[
  {
    "_id": "64d005f478aba2ec5a3b41da",
    "summary": "Huge stationary disk",
    "city": "losangeles",
    "shape": "circle",
    "date": "2006-05-15T00:00:00",
    "story": "Huge stationary disk I was sailing with a friend and I had forgotten my sunglasses, so I purchased some granny glasses. The kind that fit over your regular glasses. Sailing is pretty boring when there is no wind. i was reclining looking up into the sky and I saw a circle in the clouds. My first impression is that it looked like one of those big round plastic paper clips, round with a tongue coming down the center. It was at a very high altitude and obscured by high clouds. It was so faint that I thought it might be a glare on my granny sunglasses. I moved my head up and down and side to side. The object did not move. I raised the sunglasses and the object was not visible. I put the glasses back on and it was visible. It was very faint and line pattern was white in color. so the object was a white line on a blue sky background with white clouds all around. Very hard to see. I had some binoculars just out of arms reach and I was worried about losing the object. I took a chance and reached for the binoculars. I never saw it again. The object was perfectly round and symmetrical. It did not move, with my outstretched arm, it was about half the size of my thumb. At the altitude that it was, that would make it huge.  I will include a diagram of what it looked like, on Microsoft Visio. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/050/S50054.html",
    "state": "CA",
    "duration": "30 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b41dc",
    "summary": "A silver polygon object with several satelight ships over downtown Los Angeles in the mid nintey's, stops and flys straight up.",
    "city": "losangeles",
    "shape": "formation",
    "date": "2006-05-15T00:00:00",
    "story": "A silver polygon object with several satelight ships over downtown Los Angeles in the mid nintey's, stops and flys straight up. I don't have the exact date, it was some time ago.  I estimate it was the summer of 1995.  I was outside in my back yard in South Los Angeles CA.  Clear blue sky, no wind, early afternoon.  Something told me to look up.  I did and at an altitude of about 10,000 feet (estimated, it was just above the normal flight plan of landing LAX planes) headed east bound right over downtown was what appeared to be a weather balloon, silver in color.  This ballon was shaped like a 3 dimensional polygon, the sides were triangular so I gues it would be described as a dodecahedron.  I looked closer and saw several dark collered what looked like jet airplanes with curved back wingtips in hot pusuit of this weather balloon.  Just then a friend of mine walked up and wondered what I was looking at.  I showed him and he saw the same thing (a big releif!).  Just then the Balloon stopped in mid flight just east of downtown Los Angeles.  The \"jets\" that were in hot pursuit split off in formation and began circling the baloon (i.e. the first plane went let, second went right, third left and so on).  The Balloon stated to spin at about 10 rpm.  More and more \"jets\" began to appear and I counted maybe 20 of them at this point.  After holding in this position for about 2 minutes the baloon took off stright up at a rapid and controlled rate and the jets broke the circular formation and followed right behind the balloon in a straight line, straight up until I could no longer see them with the naked eye.  The speed was comprable to a space shuttle launch but there was no noise, no smoke or trails.  I heard no unusual sound and the only thing I noticed is this was taking place in the normal flight plan that planes land at LAX and during the entire time of the sighting no other air traffic was seen or heard. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/050/S50266.html",
    "state": "CA",
    "duration": "15 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b4276",
    "summary": "Three motionless black triangles above West LA.",
    "city": "losangeles",
    "shape": "triangle",
    "date": "2006-05-15T00:00:00",
    "story": "Three motionless black triangles above West LA. In the summer of 2000, I was driving with my then girlfriend late one afternoon westbound on Pico Blvd. just west of Sawtelle Blvd..  While stopped at a traffic light, she pointed to something she saw in the sky which was almost directly over us. I had to lean forward to be able to see up through the windshield to observe 3 identical black triangular objects. I observed them for less than 30 seconds.  The objects were motionless and we could not hear any noise from the objects. There were no markings, lights or familiar aircraft features (stabilizers, etc.), just a solid black object. the objects were in a loose triangle formation separated from each other by a distance of approximately 5 times their individual width. What struck me most was their stillness and almost silhouette-like appearance. My impression is that the objects were the size of private jets or fighter planes. They were significantly higher in altitude that the normal Santa Monica airport traffic that occurs regularly in that area, enough so that a closed fist at arms length could have covered two of the objects (were they spaced tip to tip). While observing them, I moved my head to change my viewing angle so as to verify that this was not caused by debris on the widshield or reflections. These were definitely airborne objects. Once the traffic light changed to green, I resumed driving, but was unable to see the objects again since they were nearly directly overhead. Once we had driven a few blocks so that the objects should have been easier to view from a shallower angle, the sky was empty where thay had been. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/050/S50155.html",
    "state": "CA",
    "duration": "30 Seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4294",
    "summary": "White light over Los Angeles flew away at impossible speed",
    "city": "losangeles",
    "shape": "light",
    "date": "2006-05-15T00:00:00",
    "story": "White light over Los Angeles flew away at impossible speed I was brushing my teeth, the lights were out for privacy, the bathroom has a southern view.  The windows were half open and pushed out like shutters, perpendicular to the building, so I could see reflections in the window panes.  I was facing the mirror,  East, when I noticed a light out of the corner of my right eye.  My mind computed that I was seeing the moon reflected in the window, so I turned to check out the moon.  Instead I saw two lights in the distance, one heading West, the other heading East.  It took my mind a couple of seconds to understand what I was seeing.  I remember clearly thinking that I was seeing an airplane heading West on its descent to LAX, and also seeing it's reflection in the window, because they were heading right for each other.  But a second later I realized I wasn't, that I was watching two real, separate lights heading towards each other, one from the West, the other from the East.  My heart immediately started racing as it dawned on me that I might be witnessing an in air collision.  But after a few tense seconds the lights passed each other and I was relieved.  Until the light heading East stopped, held its position for a second, and flew away arcing due South.  It was completely gone in under two seconds. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/050/S50052.html",
    "state": "CA",
    "duration": "10 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b442e",
    "summary": "Dark spherical / ovoid object travelling east/north-east from east of my position, climbing steadily.",
    "city": "losangeles",
    "shape": "unknown",
    "date": "2006-05-15T00:00:00",
    "story": "Dark spherical / ovoid object travelling east/north-east from east of my position, climbing steadily. Black/Dark circular object, apparently large but I can't say for sure.  It appeared east of my location, heading approximately east / north-east, climbing rather slowly, at about the speed of a small plane.  It appeared from behind some hills east of me (east of the 110 freeway - the hills appear to be part of Debs park, but didn't seem to be nearby.  Altitude unknown.  It was moving against the wind, holding a rather steady course.  Did not appear to be an airplane, rather had an ovoid / circular shape.  No visible lights, no \"anomalous\" manoeuvres.  There was complete silence - no sound of helicopters (frequent in these areas), or jets at high altitudes or small planes.",
    "link": "http://www.nuforc.org/webreports/049/S49948.html",
    "state": "CA",
    "duration": "5 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b4495",
    "summary": "Objects are Military",
    "city": "losangeles",
    "shape": "changing",
    "date": "2006-05-15T00:00:00",
    "story": "Objects are Military Does anyone notice that all these recent sightings are within US/UK boundries?  Does anyone notice there are reports of Miltary escorts?  Wake up, people!  You are looking at covert military aircraft.  If they're UFO's, then where's the press?  Where's the miltary reports/logs on those escorted flights?  The answers come in 2 words: National Security   Maybe the reason why the sightings are so visible and frequent, is because some info on these aircraft will be released to the public over the next decade.   Did everyone know about the U2 or the SR-71 when it was in development?   Wake up you lost little lambs.   Personally, I believe if any of this crap was actual extra-terrestrial in nature...then our existence could only be reduced to a cultivated food product for a distant alien society.   And most of us would have already been on the chopping block. Sound crazy?  Try reading the posts on this website.",
    "link": "http://www.nuforc.org/webreports/050/S50055.html",
    "state": "CA",
    "duration": "0"
  },
  {
    "_id": "64d005f478aba2ec5a3b45d9",
    "summary": "4/29/06 los angeles california 2 buble shape and transparent  last 1 minute in my room",
    "city": "losangeles",
    "shape": "unknown",
    "date": "2006-05-15T00:00:00",
    "story": "4/29/06 los angeles california 2 buble shape and transparent  last 1 minute in my room me and my girlfriend when to bed around 10:00 pm after some time i got up and went to the bathroom ,after a whent back to bed a felt a prececse like some one was inside the apartment i did not see the time, this has hapend before , and i did'nt paid any atention, then after a wille i heard a huming on my right ear i was now in bed .the huming became very loud to a point where i could not stand the pain on my ear i tried to cover my ear with my hand, that to me ment that i was able to move then i tried to wake up my girlfriend next to me then i starded to feel like some thing was toching me put it was weerd because i felt 4 hands thats when i turn to my other side and saw 2 shapes they were transparent like to bubles then i remember turning back traing to wake up my girlfend when she woke up the shapes were gone the firs time was 2 shadows i dont know wath to think",
    "link": "http://www.nuforc.org/webreports/050/S50349.html",
    "state": "CA",
    "duration": "7 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b45fa",
    "summary": "At 18:30PM I SAW 3 PLANES FLYING IN TRIANGLE FORMATION A MINUTE LATER I SAW A BLINKING LIGHT IN THE SAME AREA. BEFORE THE BLINKING LIGH",
    "city": "losangeles",
    "shape": "other",
    "date": "2019-08-23T00:00:00",
    "story": "At 18:30PM I SAW 3 PLANES FLYING IN TRIANGLE FORMATION.  A MINUTE LATER, I SAW A BLINKING LIGHT IN THE SAME AREA.  BEFORE THE BLINKING LIGHT VANISHED, THERE WAS ANOTHER BRIGHT EXPLOSION OF SOME KIND RIGHT NEXT TO IT.",
    "link": "http://www.nuforc.org/webreports/147/S147950.html",
    "state": "CA",
    "duration": "10 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b4610",
    "summary": "Me and mother in law were sitting in front of her talking  about lights in sky as we were looking a greenish lime color diamond shape o",
    "city": "losangeles",
    "shape": "diamond",
    "date": "2019-08-23T00:00:00",
    "story": "Me and mother in law were sitting in front of her talking about lights in sky as we were looking a greenish lime color diamond shape object appeared in sky flew  fast and the disappear gone  never seen nothing like this befor",
    "link": "http://www.nuforc.org/webreports/147/S147976.html",
    "state": "CA",
    "duration": "Sheriff station on imper"
  },
  {
    "_id": "64d005f478aba2ec5a3b47fe",
    "summary": "Object was long, flat with white light on top moving from left to right hovering high the sky.",
    "city": "losangeles",
    "shape": "disk",
    "date": "2019-07-25T00:00:00",
    "story": "Object was long, flat with white light on top moving from left to right hovering high the sky.",
    "link": "http://www.nuforc.org/webreports/147/S147656.html",
    "state": "CA",
    "duration": "1 hour"
  },
  {
    "_id": "64d005f478aba2ec5a3b4967",
    "summary": "I saw a UFO hover over South Los Angeles.",
    "city": "losangeles",
    "shape": "circle",
    "date": "2019-07-12T00:00:00",
    "story": "I saw a UFO hover over South Los Angeles. I was outside taping this annoying helicopter that was constantly circling my neighborhood at around 2 or 3 in the morning.  My intention was to take the video to the police station and file a complaint about them frequently using our community to practice their loud flight patterns early in the morning.  When out the right side of my peripheral vision I saw this object hovering in the sky.   I watched it as it moved into view of my camera, then towards the helicopter, before it sped away at what looked like lightning speeds.  Now, I know some skeptics are going to say, \"It could have been a laser light source,\" but that helicopter was at least a mile away from my house at the furthest part of its circular pattern.  What kind of laser light would I be able to see from standing on my porch approximately a mile or so away?  Who would have such a powerful mechanism to shine into the sky where it would be visible to others for miles?  Look how that object moves.  It is definitely an unexplained flying object hovering over South Los Angeles.  Hell, for all I know, that might be why that helicopter was in the air.  This sighting completely changes my perspective about a lot of things. https://youtu.be/2UeW31KlaZc ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)",
    "link": "http://www.nuforc.org/webreports/147/S147452.html",
    "state": "CA",
    "duration": "30 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4a2a",
    "summary": "Two small objects flying in tight formation with no lights, only the light of the city illuminated them.",
    "city": "losangeles",
    "shape": "circle",
    "date": "2019-07-12T00:00:00",
    "story": "Two small objects flying in tight formation with no lights, only the light of the city illuminated them. I was in my apartment in Hollywood near the base of Runyon Canyon watching the news coverage of the latest 7.1 earthquake that shook us last night.  My apartment balcony looks south and there was a helicopter hover just to the south.  It looked like a police helicopter but it had no spotlight on not were there many lights at all.  I think there was maybe one red strobe but I could see the helicopter from the light from the city illuminating it.  As I was watching it and wondering why it was just staying there I saw two small white objects flying in a curve around and passed the helicopter though I think they were a lot higher.  There were no lights and I could see them by the light of the city reflecting off of them.  At first I thought there were white birds but they were moving way too fast and their formation stayed perfect.  They were flying in a diamond like formation with one slightly in front of and next to the other.  As they came out of the curved f! light path they then straightened up and flew west and disappeared in the clouds.",
    "link": "http://www.nuforc.org/webreports/147/S147388.html",
    "state": "CA",
    "duration": "6 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4a80",
    "summary": "Was flying from Las Vegas to LA when I witnessed a highly reflective sphere moving slowly off the left wing. ((anonymous report))",
    "city": "losangeles",
    "shape": "sphere",
    "date": "2019-06-20T00:00:00",
    "story": "Was flying from Las Vegas to LA when I witnessed a highly reflective sphere moving slowly off the left wing.  I saw it for 30 seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  To the best of our knowledge, we've received no photos or video of the alleged event.  PD))",
    "link": "http://www.nuforc.org/webreports/146/S146737.html",
    "state": "CA",
    "duration": "30 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4aa9",
    "summary": "Metallic sphere over Los Angeles",
    "city": "losangeles",
    "shape": "sphere",
    "date": "2019-06-27T00:00:00",
    "story": "Metallic sphere over Los Angeles. Sitting on the left side of AA FLIGHT 6031 into Los Angeles from San Jose.  Late afternoon arrival, clear day.  On approach at approximately 2,000 feet bearing east toward downtown, approximately 1-2 minutes before right turn into final.   Observed a small, metallic sphere traveling in the opposite direction (west) at a very high rate of speed.  Distance, speed and size of craft not possible in the very short duration of observation.  Object appeared reflective.  Sighting was not discussed with any other crew members or passengers. ((ADDENDUM FROM WITNESS)) Dear Peter I did not mention it to others on the aircraft and the date is accurate within a week or so.  I was actually familiar with the flight crew, as I take this fight many times a month but the cockpit door was closed as we disembarked so the opportunity didn’t exist to discuss.     I don’t want to get into the details of what I do for a living but I fly a lot, sometimes many times a week.  I’m very familiar with most types of aircraft, both civilian and military (and I’ve flow on over 25 types personally).  I’ve seen similar objects on two separate occasions over the last 15-20 years.  Both were metallic spheres, one was a metallic green and the other more red and they seemed to have a slight glow… and both, I recall, seemed disturbingly close to the aircraft.  Those, if I recall correctly, happened over the mid-west but it was many years ago.  I believe one was near DFW. The recent sighting was the first I’ve had in at least a decade.  The object just seemed to be metallic with no coloration.  But it was an extremely brief sighting. As I mentioned, the disturbing part to me is that these objects are flying, at high speed, well within safe commercial separation.  It’s hard to determine their actual size but maybe something akin to Sputnik.  They seem to have no visible means propulsion or ability to stay aloft (wing surface, stabilizers, etc) nor any other surface breaks, antenna, etc. I’ve always been reluctant to discuss but now that I’m on number three I feel compelled to figure it out.  I brought it up only once prior to a 777 pilot deadheading in a seat next to me but he wasn’t very eager to continue the line of conversation.  If they’re government controlled it’s amazing that such technology exists but, at the same time, seemingly dangerous practice.  Especially over such busy airspace as the Los Angeles Basin.  ((END ADDENDUM)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/147/S147041.html",
    "state": "CA",
    "duration": "2-3 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4b25",
    "summary": "Bright lights way up high in the sky hovering around the valley area. We saw four of them and the other one disappeared.",
    "city": "losangeles",
    "shape": "unknown",
    "date": "2019-07-05T00:00:00",
    "story": "Bright lights way up high in the sky hovering around the valley area.  We saw four of them and the other one disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  The sighting appears to us to be a daytime sighting, but we have no means for confirming.  PD))",
    "link": "http://www.nuforc.org/webreports/147/S147170.html",
    "state": "CA",
    "duration": "1-5 minutess"
  },
  {
    "_id": "64d005f478aba2ec5a3b4e5b",
    "summary": "i am a ewhitness to war over los angeles in 1942--i would like mr davenport to call me or email me so i can tell him what i saw--i can",
    "city": "losangeles",
    "shape": "",
    "date": "",
    "story": "i am a ewhitness to war over los angeles in 1942--i would like mr davenport to call me or email me so i can tell him what i saw--i can see them in my head like it was yesterday---they flew right over my family's heads at XXXX glendon ave west los angeles calif 90034--google this address and see where it is--i have a lot of info--the anti aircraft guns were firing a couple blocks away and the set some houses on fire in the neighborhood--they were about 2 or 3 miles off the end of runway 21 at douglas aircraft company-------i have a lot more. ((NUFORC Note:  The source of this report has consented to submit a much more detailed account of his sighting.  However, during a lengthy telephone conversation, he asserted that what he had seen on February 26, 1942, he thought were conventional aircraft.  We will post his second report, once we receive it.  PD))",
    "link": "http://www.nuforc.org/webreports/145/S145519.html",
    "state": "",
    "duration": ""
  },
  {
    "_id": "64d005f478aba2ec5a3b4f08",
    "summary": "Strange parallel, stationary lights over Los Angeles.",
    "city": "losangeles",
    "shape": "light",
    "date": "2019-04-08T00:00:00",
    "story": "Strange parallel, stationary, lights over Los Angeles. Three parallel whitish orange streaks of light are currently hanging over southwest Los Angeles. They have been there for at least fifteen minutes.  They do not move.  They are not contrails. They are not Kleig lights.  They are not skywriting.  My 10X binoculars cannot discern any aircraft at the head of the lights. Space laser test?",
    "link": "http://www.nuforc.org/webreports/145/S145518.html",
    "state": "CA",
    "duration": "ongoing"
  },
  {
    "_id": "64d005f478aba2ec5a3b4f12",
    "summary": "I am a eye witness to the war over Los Angeles in 1942. I can see the planes in my head as if it was yesterday. They were about 2 miles",
    "city": "losangeles",
    "shape": "",
    "date": "",
    "story": "I am a eye witness to the war over Los Angeles in 1942.  I can see the planes in my head as if it was yesterday.  They were about 2 miles off the end of runway 21 at Douglas Aircraft.  I am a experienced pilot with a life long interest in aviation.  My family was living 3 blocks from the intersection Overland ave and National blvd. in west Los Angeles.  The anti aircraft guns were located on Overland ave. between National blvd. on the east side of Overland ave. It was said that they were there to protect Douglas Aircraft located down National blvd about 2 miles.  In the middle of the night, all hell broke loose.  My mom, dad, and I went outside.  I could about 12 airplanes in the search lights.  They looked like little white crosses.  There was little smoke because the shooting just began  They were very clear  They were really high up there and they were flying at a realistic speed.  Maybe they were out of range of the guns.  We were outside about a minute when my dad realized that the planes would be flying right over our heads.  We went inside and my dad placed a mattress over me and my sister.  The next day, my dad drove us over just north of National blvd. and we saw houses burned from the falling debris.",
    "link": "http://www.nuforc.org/webreports/145/S145681.html",
    "state": "CA",
    "duration": ""
  },
  {
    "_id": "64d005f478aba2ec5a3b4f3f",
    "summary": "There was a bright object that was just floating in one spot.  ((anonymous report))",
    "city": "losangeles",
    "shape": "circle",
    "date": "2019-04-18T00:00:00",
    "story": "I was at a flea market and happened to just look up and there was a bright object that was just floating in one spot and it tend to get brighter and bigger in shape and then disappeared then appeared again.  And this is not the first time I’m seeing something like this around here. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "link": "http://www.nuforc.org/webreports/145/S145641.html",
    "state": "CA",
    "duration": "30 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b51a0",
    "summary": "7/12/65   Santa Monica, California  Cigar shaped, glowing red/orange in front, blue back half    15 seconds",
    "city": "losangeles",
    "shape": "cigar",
    "date": "",
    "story": "7/12/65   Santa Monica, California  Cigar shaped, glowing red/orange in front, blue back half    15 seconds I was driving North of Santa Monica, California, on Highway 101, when a craft resembling a cigar approached from the South, the craft appeared quickly, then slowed down and hovered over the car.  It's coloration was divided in half, the front half being red/orange and the back half blue.  It was glowing like neon.  I was driving about 55 mph at the time.  The object hovered for about ten to fifteen seconds before rapidly flew forward and out of sight in less than a second.   I stopped at the first gas station and called the Sheriff's office to report the sighting.  All that was said to me was that they had several calls already, and that my sighting would be noted.  I have only told a few people about this over the years, but saw a show about UFO's on television recently, and thought I might as well make this report.",
    "link": "http://www.nuforc.org/webreports/063/S63255.html",
    "state": "CA",
    "duration": "15 Seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4156",
    "summary": "1965 Dark Grey Cylinder UFO Updated Statement",
    "city": "newyork",
    "shape": "cylinder",
    "date": "",
    "story": "1965 Dark Grey Cylinder UFO Updated Statement I just wanted to offer an updated version, the original being:  http://www.nuforc.org/webreports/025/S25728.html  \"Every now and then, my mother and I would take our dog on his night walk to the Parade Ground, a flat park of baseball and football fields. We went there because at the time it was being renovated, and the fields were being partitioned and fenced. This gave us some confidence to allow the dog off the leash to run free for a change.  The Parade Ground is just across Parkside Avenue from Prospect Park. It is August, 1965. I am ten years old.  The dog was having a good run, and once we saw that he wasn't about to run off completely, we relaxed and gazed upwards to view the night sky, trying to find various constellations.  In those days, the street lights in Brooklyn emitted a white light, and not the beige-looking type now in use. If you went to a park, you could get a decent view of the stars, but of course not anywhere near the view if you were upstate in deep woods.  Suddenly, as I looked to the left of me, I saw what I first mentally equated as a submarine perhaps two storeys off the ground higher than the six storey buildings beneath it.  \"Hey Mom, do you see what I see?\" She did.  Here comes this thing, slow and steady and silent. It is huge. It is dark grey - not \"battleship grey,\" but as grey as can be before you rule it black. There is no shine to it.  The front of it was round; I'd seen pictures of submarines, and that is what came to mind. It is actually shaped more like a very long medicine capsule.  As it  proceeded to float past us, we observed its right side. It is solid. It is a perfect and very long dark grey cylinder, and it just keeps coming very slowly and steadily.  Obviously, we can't see the top of it, but so far, we see that even though it is almost black, we sense a light behind the darkness. This does not make sense, as my mother and I later reckoned. The best I can come up with is that my eyes saw dark grey, but my mind knew the cylinder was emitting light. Dark light!  This was no blimp. No lights. No sound. No windows. No gondola beneath. No visible markings. No nothing! It is just a cylinder 300 feet longer than the Intrepid aircraft carrier now docked in the Hudson River going by!  This thing was so huge, that even from the height above me, (200 Feet?) it was clearly visible; visible enough to see even the slightest imperfection clearly, if it had any.  At the same time, we are not in any panic. We are unusually serene. As if it's no big deal somehow. Maybe we were in a stupor beyond awe.  Finally, the end of the ship passes. I ran to see the back of it. I see it is as round as the front with an opening in the center. To this day, I'm not sure if it was square or arch-like. I am convinced that at least the bottom of the opening in the back of it was flat, so it was square or arched. I remember thinking that 3 buses could easily drive inside at the same time. On the other hand, I've seen jets low to the ground on approach to JFK Airport, and thought that \"my\" cylinder was at least 3 times wider at the same height.  This is the only time I experience apprehension. I worry for a moment that whoever is flying this cylinder might see me.  I ran to a to where I could see the other side of the cylinder. It is exactly as perfect and unremarkable as the other side and the bottom.  I have been struggling with my memories for years as to whether there was a single tiny light, blue or red atop the opening in the back. I add this item, but I am not sure. Inside the opening it is absolutely pitch black.  The cylinder was in the order of 1200 feet long. I did not know this at the time. When I saw the cylinder completely, it was \"crossing\" Stratford Road, and the back of it was at Buckinham Road. The distance between these streets on Caton Avenue according to street maps is about 1200 feet.  I rejoined my mother in the original field, and we watched this thing float over the Prospect Park POLICE STATION, heading west until it faded from sight about half a mile west of the Parade Ground. No newspaper, radio, or TV station mentioned it. For that matter, we didn't even tell my father!  As I first accessed the Internet, I ran a search for \"cylinder ufo,\" and plenty of links came up. Even pictures! I wasn't too surprised, because I know damn well what I saw was real, and other people MUST have seen something as well.  I told some close friends. They gave me the jaundiced eye. I could hardly blame them. I guess its just one of those things one must see to believe.\"  Notes:  The Cylinder crossed over Parade Place, and was equidistant between Woodruff and Crooke Avenues.  The Cylinder was about 1/4 the width of the Parade Ground, and travelling in a straight line over the road that runs nearly the length of the park.  Why these single lane streets are designated Avenues is a mystery to me, especially Crooke Avenue, which runs only two blocks.  Modern street maps have re-named Buckingham Road as East 16th street. The equivalent for Stratford Road would be East 11th Street, so by my point of view the cylinder was at least five blocks in length. I need to remark that some internet-based street maps would put the length of the cylinder at 1500-1700 feet. I really should go back there and take measurements myself.",
    "link": "http://www.nuforc.org/webreports/049/S49816.html",
    "state": "NY",
    "duration": "minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b426f",
    "summary": "spaceship,like a football,flying low,over a park, no sound, detail of the ship was veary good.",
    "city": "newyork",
    "shape": "other",
    "date": "2006-05-15T00:00:00",
    "story": "spaceship,like a football,flying low,over a park, no sound, detail of the ship was veary good. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "link": "http://www.nuforc.org/webreports/050/S50235.html",
    "state": "NY",
    "duration": "15min"
  },
  {
    "_id": "64d005f478aba2ec5a3b4286",
    "summary": "BALL  SHAPED  OBJECT  HOVERING  IN  FRONT  OF.",
    "city": "newyork",
    "shape": "cylinder",
    "date": "2006-05-15T00:00:00",
    "story": "BALL  SHAPED  OBJECT  HOVERING  IN  FRONT  OF. SMALL BALL SHAPED OBJECT DESCENDED FROM SKY HOVERED IN FRONT OF ME 2OR3 SECONDS THEN HOVERED IN FRONT OF 2 OBSERVER 2OR3 SECONDS LEFT AT HIGH RATE OF SPEED. ((NUFORC Note:  Witness elects to remain totally anonymous.  Witness indicates that the site of the alleged is \"BK.\"  Judging from the ZIP code the person indicates, we assume he/she means Brooklyn.   Possible hoax, we suspect.  PD))",
    "link": "http://www.nuforc.org/webreports/025/S25924.html",
    "state": "NY",
    "duration": "5"
  },
  {
    "_id": "64d005f478aba2ec5a3b4299",
    "summary": "V-shaped translucent object seen near the moon during the eclipse",
    "city": "newyork",
    "shape": "chevron",
    "date": "2006-05-15T00:00:00",
    "story": "V-shaped translucent object seen near the moon during the eclipse I'm writing this email to tell you about an interesting occurrence I (and three others) had as we were outside to view the eclipse of the moon in NYC on November 8th, 2003. As I was looking up at the orange-shaded moon waiting for the last sliver of it to be covered, I noticed a strange V-shaped pattern, or triangular shaped pattern of lights moving in the sky. I believe my comments, along with some of the others, were: \"What's that?\" \"..that triangular shaped thing? \"Do you see that?\" We were all mystified.  This V-shaped object was extremely high up in altitude, higher than any plane I've ever seen flying, and moved just under the moon, towards it, then disappeared. It had about 8 round Shapes (probably lights, though it was too high up for me to see the illumination of these lights).  There were about four round shapes on each limb of the 'V' shape, and the whole shape seemed somewhat translucent.  Many planes had passed through the crisp crystal-clear sky as I was viewing the moon for a duration of about 15 minutes. All of the other planes had very bright lights, took routine pathways and were easily identified as planes. This V-shaped, triangular object was quite different from the planes. It had more lights on it than a plane and the lights appeared transparent or translucent. And, it was so high up that it appeared as if it was the same distance as the moon!  Then, it disappeared  as it seemed to fly towards the moon. This triangular, V-shaped object was something else!  I remember thinking that possibly a V-formation of ducks could be traveling (but in the dark at night). Perhaps, we (Earthlings) weren't the only beings sending good vibrations to the Universe during the Harmonic Concordance that night??  Regards, ((name deleted))",
    "link": "http://www.nuforc.org/webreports/050/S50073.html",
    "state": "NY",
    "duration": "15 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b42c5",
    "summary": "Object Produces Vortex of Clouds.  ((NUFORC Note:  Student report.  Possible hoax.  PD))",
    "city": "newyork",
    "shape": "unknown",
    "date": "2006-05-15T00:00:00",
    "story": "Object Produces Vortex of Clouds It was a warm day in the middle of June. My brother and I were working in our backyard, suddenly my brother said: \"Look over there- What is that?\"  To my shock there was a black object in the sky repeatedly doing circular patterns in the direction of the Verrazano Bridge, and hard to determine at what altitude.  As it did this a vortex of gasseous vapor appeared from where the oject was moving, the vapor continued spreading out and the object repeated the maneuvers.  About 10 minutes later a sudden and powerful thunderstorm came, and lasted for about 15-20 minutes.  Afterwards the sky cleared up and there was no sign of the object.  My brother and I are both positive that the vortex of clouds and most likely the thunderstorm originated from this object. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Student report.  Possible hoax.  PD))",
    "link": "http://www.nuforc.org/webreports/050/S50056.html",
    "state": "NY",
    "duration": "5-10minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b44e2",
    "summary": "star like object high up in the sky making strange movements and somethings changing lights/color",
    "city": "newyork",
    "shape": "light",
    "date": "2006-05-15T00:00:00",
    "story": "star like object high up in the sky making strange movements and somethings changing lights/color Object was noticed when I lay down in my bed getting ready to fall asleep. I saw this light, I would estimate at least 2-3 km above the city that kept my attention as I eliminated what it could be. It moved back and forth (very small changes) but in a fashion that is unknown to be done by human aviation (e.g. left and suddenly up) so I knew it was not a star either but it otherwise looked mostly like a star. When it moved it seems to change color (e.g. red flashing and different shades of white)",
    "link": "http://www.nuforc.org/webreports/050/S50119.html",
    "state": "NY",
    "duration": "60"
  },
  {
    "_id": "64d005f478aba2ec5a3b4500",
    "summary": "Sphere shape flashes in the sky with colorful trail behind it.",
    "city": "newyork",
    "shape": "flash",
    "date": "2019-08-23T00:00:00",
    "story": "sphere shape flashes in the sky with colorful trail behind it. I was looking into the sky standing by the water view in between the manhattan bridge and Brooklyn Bridge, when i noticed a sphere like shape flash in the sky.  The shape was a bright teal and it left a colorful trail behind it.  The trail and object disappeared within a blink of an eye. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "link": "http://www.nuforc.org/webreports/147/S147817.html",
    "state": "NY",
    "duration": "5 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4527",
    "summary": "Mysterious Hovering Craft In The New York City Night Time Sky.",
    "city": "newyork",
    "shape": "triangle",
    "date": "2019-08-23T00:00:00",
    "story": "Mysterious Hovering Craft In The New York City Night Time Sky On the night of July 25th, I witnessed a UFO sighting in the sky over New York City in the East Harlem Willis Avenue bridge area which connects Manhattan with the South Bronx.  It was silently hovering in the night sky at approximately 11:20pm with lights (green and red) flickering on and off.  This triangular \"vehicle\" eventually moved in a straight south direction, stopped, reversed course and then proceeded to move in a straight northward direction towards the Bronx New York.  I was just startled by its presence. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "link": "http://www.nuforc.org/webreports/147/S147822.html",
    "state": "NY",
    "duration": "10 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b45de",
    "summary": "My brother and I saw 3 objects flying over the 11203 zip code heading east out toward Long Island. 2 were flying in tandem a the 3rd wa",
    "city": "newyork",
    "shape": "cigar",
    "date": "2006-05-15T00:00:00",
    "story": "My brother and I saw 3 objects flying over the 11203 zip code heading east out toward Long Island. 2 were flying in tandem a the 3rd was lagging a half minute behind. At 1st I thought is was a seagul but it never flapped it's wings. No sounds or air stream. 5 minutes later I saw a plane flying the same path also with no sound or stream and I must say that it almost looked like the 1st 3 objects I saw. So now I'm not sure about what I saw but will post this anyway just in case someone else saw what I discribed at the same time. Thank you",
    "link": "http://www.nuforc.org/webreports/050/S50345.html",
    "state": "NY",
    "duration": "3 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b469e",
    "summary": "We were crossing GWB I was in backseat with friend he seen what I seen. Looked to be all black craft spinning like a top hovering. Two",
    "city": "newyork",
    "shape": "disk",
    "date": "2019-06-07T00:00:00",
    "story": "We were crossing GWB.  I was in backseat with friend he seen what I seen.  Looked to be all black craft spinning like a top hovering.  Two red lights on each side of saucer looked like flares.  It was as big as a truck maybe slightly bigger.  It was next to the bridges support beam.  It shot out a white light that was a beam of light the light didn't spread like a spotlight would that's why I say beam.  The white beam went into the Hudson River.  Never seen anything before this or after.  It was literally a flying saucer like something you would expect to see in science fiction. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/146/S146191.html",
    "state": "NY",
    "duration": "2 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b469d",
    "summary": "I am living in Belgium (Europa) and I was visiting the One World Trade Center in New York on the 29th of May 2019.",
    "city": "newyork",
    "shape": "disk",
    "date": "2019-06-07T00:00:00",
    "story": "I am living in Belgium (Europa) and I was visiting the One World Trade Center in New York on the 29th of May 2019. I was on the floor 100, around 11AM, looking to north (direction of Empire State Building), when I saw something looking like an helicopter, flying just next the top of the Empire State building (left of it, when looking from the One World Observatory). I found this strange, because I was thinking that nothing could fly over New York since 09/11.  To check if it was a helicopter from the police or the army (it was during the Memorial week) I took a picture and when I looked at it, I was a bit surprised to see something looking like a rose flying donut. I don’t know what is was, probably just an advertising donut balloon ???  5 to 10 seconds later (necessary time to look at the first picture), I decided to take another one but the flying object had disappeared. Looking on the internet, I found nothing about it. Picture was taken with a Canon PowerShot SX730HS, max optical zoom (*40), 400 ISO. Picture will follow through email.",
    "link": "http://www.nuforc.org/webreports/146/S146577.html",
    "state": "NY",
    "duration": "15 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b485a",
    "summary": "Star bright / white dots - over Brooklyn Prospect Park. 15 August 2019 (7pm / 19:00)",
    "city": "newyork",
    "shape": "light",
    "date": "2019-08-23T00:00:00",
    "story": "Star bright/white dots - over Brooklyn Prospect Park. 15 August 2019 (7pm / 19:00) The event occurred yesterday at 7pm in prospect park Brooklyn. I was in the park with my wife and daughter and laying on my back staring up the swallows flying high above. A small white dot caught my attention (a small star bright light) much higher than commercial airline flights seem to be and way higher than the swallows above. At first I thought nothing of it as it could be something reflecting light from the sun, but the object started to move to the left. After it moved it really caught my attention and a few seconds just stopped. After the obeject had stopped moving, two more lights (or star bright dots) appeared directly underneath the original object. It was in perfect vertical straight line underneath the original dot and totaled three lights. The three lights all proceeded to move left again and after a few seconds of following the dots/stars I tried to alert my wife and point out the general direction.  In this time more had appeared sporadically (in no formation or visibly noticeable) formation.  The number grew till around 7 stars could be seen and spaces all over the area of sky.  The whole event lasted around 2 minutes and my wife (to my frustartition) didn’t managed to track or witness it.  I’m actually sad that I alone witnessed it and would have even tried to contact a complete stranger to highlight what I was witnessing!  I would honestly love to know if any sighting (other than mine) happened and up till yesterday would have literally laughed at anyone telling me they had witnessed something extra ordinary or a UFO. This really changed for me yesterday and tried in all ways to rantionalize and explain what it could have been, both civilian and military wise. Hope to hear from you back and all the best.",
    "link": "http://www.nuforc.org/webreports/148/S148331.html",
    "state": "NY",
    "duration": "2 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b4876",
    "summary": "Cigar-like object, brownish in color, seemed to travel in tighter and tighter circles until disappeared, leaving strong odor",
    "city": "newyork",
    "shape": "cigar",
    "date": "2019-06-07T00:00:00",
    "story": "cigar-like object, brownish in color, seemed to travel in tighter and tighter circles until disappeared, leaving strong odor. I noticed a cylinder/cigar-like object, brownish in color, traveling with increasing in a circular fashion.  It seemed to travel with increasing speeds in tighter and tighter circles and then it disappeared, leaving a strong odor.",
    "link": "http://www.nuforc.org/webreports/146/S146491.html",
    "state": "NY",
    "duration": "4 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b4923",
    "summary": "UFO appeared over Hudson River and Upper West Side of Manhattan",
    "city": "newyork",
    "shape": "circle",
    "date": "2019-08-23T00:00:00",
    "story": "UFO appeared over Hudson River and Upper West Side of Manhattan. I live in a high-rise building in Weehawken, New Jersey.  I woke up in the middle of the night and saw this bright object hovering in the sky above the Hudson River roughly across 86th-89th street of the Upper West Side of Manhattan.  As first I thought it was a star, but as I look carefully, I notice the objective was moving and its brightness changes as it moved.   Since I don't have a telescope, I couldn't tell the exact shape of object, but it looks circular and it is bright.  After 15-20 minutes, the object began to ascend and the light got dimmer. Right before it fully disappeared, I saw another similar object appeared above the Manhattan Island, roughly around the 86th-80th street near the Upper West Side.  The object looks very similar to the other one.  It is round and it's bright.  It hovered over the area for about 10-15 minutes, then it traveled toward downtown Manhattan.  It was flying in a straight line, steady altitude, in a speed just faster than a helicopter.  I could hear any noise from where I was.   It continued to fly in the downtown direction until it has gone beyond the view of my window. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "link": "http://www.nuforc.org/webreports/148/S148389.html",
    "state": "NY",
    "duration": "40 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b4a17",
    "summary": "My husband and I were heading south east of Brooklyn queens expressway. There was a hyper blue light flew across the sky that that last",
    "city": "newyork",
    "shape": "light",
    "date": "2019-07-25T00:00:00",
    "story": "My husband and I were heading south east of Brooklyn queens expressway.  There was a hyper blue light flew across the sky that that lasted 3 seconds or less towards west direction. We both confirmed we saw it and it never appeared again.",
    "link": "http://www.nuforc.org/webreports/147/S147685.html",
    "state": "NY",
    "duration": "3 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4a74",
    "summary": "Observed a round boomerang shaped object gliding through the sky",
    "city": "newyork",
    "shape": "chevron",
    "date": "2019-06-07T00:00:00",
    "story": "Observed a round boomerang shaped object gliding through the sky Three people sitting in a backyard in Brooklyn observed a round boomerang shaped object flying across the sky.  It was at first thought to be a parachute but did not have a person or weight attached- and instead of gliding like a parachute, it was advancing steadily through the sky as a plane would.  There was no visible engine nor trails, and it was completely silent.  It appeared to be moving south towards the north at a airplane like speed, and disappeared out of view behind the buildings.",
    "link": "http://www.nuforc.org/webreports/146/S146291.html",
    "state": "NY",
    "duration": "90 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4a3f",
    "summary": "Three orangish spheres witnessed by Coney Island.  Video shows additional lights above sphere..",
    "city": "newyork",
    "shape": "light",
    "date": "2019-06-20T00:00:00",
    "story": "Three orangish spheres witnessed by Coney Island.  Video shows additional lights above sphere.. Leaving Home Depot on Cropsey Avenue near Coney Island my partner and I saw and orangish light  blob flying toward our direction, it went into the clouds and disappeared.     We got into the car and a minute later saw another one fly by (not at tremendous speed).   The third one approached  a minute after the second one.    By this time I was able to get my I phone out of my bag and take a video of it as I jumped out of the car to not have anything impede the video.   This third object also  orangish  in color, disappeared into the  night sky.  Upon looking at the video you can see a line of faint white lights hovering above this light form.   We are both educated retired professionals.   I posted the video to my Instagram page.",
    "link": "http://www.nuforc.org/webreports/146/S146907.html",
    "state": "NY",
    "duration": "10 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b4ddc",
    "summary": "saw light in the shy that slowly dropped, and quickly vanished off to the left.",
    "city": "newyork",
    "shape": "light",
    "date": "2019-04-25T00:00:00",
    "story": "saw light in the shy that slowly dropped, and quickly vanished off to the left. Seen driving by JFK airport on the way to work. beautiful day, and no clouds in the sky. saw a bright light that looked like a star around 8:51am.  it froze then slowly dropped south in slow motion, and took off and vanished to the left of my vision. then nothing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "link": "http://www.nuforc.org/webreports/145/S145811.html",
    "state": "NY",
    "duration": "3 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b514e",
    "summary": "Three fast moving violently churning out of place red and black clouds",
    "city": "newyork",
    "shape": "cigar",
    "date": "2006-10-30T00:00:00",
    "story": "Three fast moving violently churning out of place red and black clouds The date and time of this occurance is my best guess from memory. I knew what I had taken a close up photo of, but everyone I showed it to back then either laughed, or llooked at me like I was crazy. I put the photos away and for years they just sat in a box. Then I saw the movie Independence Day, and it reminded me of my photos. I had three, but I have lost one which I believe would have been proof positive, since it was traveling away from me and not towards me as they are in the two photos I have and want to send to you.  The location of the photo, was Fox Plaza on Hylan Blvd, near New Dorp Lane in Staten Island. I noticed off in the distance, three very strange looking clouds traveling in a V formation from northeast to southwest. If I were to guess their speed, I would have to say eighty (80) to one hundred (100) miles an hour. As they passed me they were almost directly over Hylan Blvd where the traffice was moving at 45 MPH. They were traveling at least twice as fast as the cars they passed over. As you can see in the photos, the direction from which they came had white and golden clouds, so these three very dark clouds were very out of place. What caught my eye was the violent churning of the clouds. The tops were black, whwile the bottom of each was flaming red. The bottom red part of the cloud was churning up into the middle of the cloud. To best describe it imagine a fuel explosion where a rising cloud of burning vapor is churning up and into itself. From the time I first saw it, and till it disappeared, the violent churning motion was clearly visible.  However, these three clouds never rose but did maintain a constant and steady speed, maintaining their formation.  These clouds did leave a trail which can be seen in the photos as puffy trails of smoke. They made no sound at all as they passed almost directly overhead. As I watched them I had this very erie feeling, and when they passed overhead at about a hundred and fifty feet, the hair on my arms stood up. I am sure that you can determine their speed since there are buildings in the photos. Please look at the puffs left behind, and the white clouds, and then at the UFOs, and how much they changed their shape in a matter of seconds. As I said, the inward churning of these clouds was very violent. I have never had any doubt since I took the photos of what they are. I only wish it were a motion picture camera I had that day so everything would have been recorded in real time instead of snapshots. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/051/S51645.html",
    "state": "NY",
    "duration": "5 Minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b516f",
    "summary": "it was the most amazing thing i have ever seen, but i dont remember what happened.",
    "city": "newyork",
    "shape": "egg",
    "date": "2006-10-30T00:00:00",
    "story": "it was the most amazing thing i have ever seen, but i dont remember what happened. i am 23 years of age. this happened when i was about 8 or 9. so im not shure if it is relevant or not, but i just found your website and decided to write to you and tell my story. this is not a joke or a dream i had or anything like that. i remember it very vaguley but i think its like that for a reason. here is my story... it was sometime in summer of i think 1990 or 1991. i was about 8 or 9. i have an outside porch that is all screened in. it is pretty big. that day me and my family were haveing a get together. im not shure what for. it might of been my birthday. as night came arround the grown ups were sitting on the deck at the table talking and i was out their with them. their must have been about 8 of us. i think me and my sister were the only children. she is 3 yrs younger than me. i remember seing this huge object hovering above the ground. it was not in the sky as other ufo reports. it was about a house distance from the street. i remember a huge array of yellow, orange, and red lights. some of them were flashing. i was in absolute shock. it appeared out of nowhere. the ship was illuminated but where we were it was still sorta dark. the the backs of the adults in front of me looked like silioutes. i dont remember anything after that at all. all that i recall is what i told you. noone in my family has ever spoken of that night once. i never did eaither until i was about 18. i told my best friend at the time but it is such an unbelivable story that my friend thought i was jokeing. i never brought it up to any of my family members. im really not shure why. i dont evenm know if they would remember. just the other night i told my girlfriend who also belives in aliens and other things people tend to be skecptial about. she convinced me to ask my mother if she remembers. so this week i plan on doin that. im not shure how to approach it though. anyway. thats my story. im not shure if it made much sence to you. its still a mystery to me. i decided it must have been an abduction of some sort, i think. im really not shure. thank you for your time. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/052/S52402.html",
    "state": "NY",
    "duration": "?"
  },
  {
    "_id": "64d005f478aba2ec5a3b415c",
    "summary": "My sighting of two objects in Chicago, IL as a pre-teen in the early 50's",
    "city": "chicago",
    "shape": "circle",
    "date": "",
    "story": "My sighting of two objects in Chicago, IL as a pre-teen in the early 50's This event happened when I was a young boy, just pre-teen when I'd guess I was about 12.  I'm now 65 and want to leave this report before I can't.  This would put the event in the very early 50's.  I lived in a south suburb of Chicago (on a small farm), about 20 miles SSW of downtown.  The township was Calumet Park, IL.  One afternoon I was standing in the yard looking due North.  Suddenly coming out of the west there was a very high, extremely fast round object moving west to east.  The speed was unlike anything I had ever seen.  Many times that of the fastest plane.  From the ground the view angle was probably about 60 degrees.  From my distance it appeared to be about three or so times the size of a pin head held at arm's length.  When it was due north of my location it suddenly came to a stop, motionless.  It remained that way for several minutes.  Then another identical object came from the East at the same blazing speed.  It came to a stop right by the other one.  Now there were two of the round objects together.  They hovered for a few minutes.  Then they went straight up, got smaller and smaller until I couldn't see them any more.  There was no sound, no vapor or contrails.  The day was bright and clear, not a cloud in the sky.  No wind.  Just a perfect summer day.  I remember the temperature being plesant too, which would normally mean early summer or late,late spring.  In the above part of the form I'm only guessing month-day-year. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/049/S49634.html",
    "state": "IL",
    "duration": "10 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b42da",
    "summary": "several peculiar red lights flew about in a formation and appeared to climb",
    "city": "chicago",
    "shape": "light",
    "date": "2006-05-15T00:00:00",
    "story": "several peculiar red lights flew about in a formation and appeared to climb",
    "link": "http://www.nuforc.org/webreports/050/S50540.html",
    "state": "IL",
    "duration": "3 mins"
  },
  {
    "_id": "64d005f478aba2ec5a3b4678",
    "summary": "Brief sighting of globular object at extremely high altitude and speed entering and then leaving atmosphere.",
    "city": "chicago",
    "shape": "sphere",
    "date": "2006-05-15T00:00:00",
    "story": "Brief sighting of globular object at extremely high altitude and speed entering and then leaving atmosphere. Object was viewed at an extremely high altitude traveling at an incredible rate of speed, much like the speed of the space shuttle when viewed flying on approach as it enters the atmosphere. It appeared in my view directly overhead at 12:00 o'clock position and continued East Souteast in a straight line and then appeared to leave the atmosphere and I lost sight at that moment. It was difficult to view precisely the objects shape but it appeared somewhat globular. Briefly after viewing the UFO, another aircraft of recognizable shape appeared in the same area at an oblique angle of interception, heading East Northeast. That's all I saw. At first I thought I was seeing a large satellite but satellites don't leave the atmosphere, do they?",
    "link": "http://www.nuforc.org/webreports/050/S50458.html",
    "state": "IL",
    "duration": "less than 1 min"
  },
  {
    "_id": "64d005f478aba2ec5a3b4783",
    "summary": "I was waiting on bus relief exchange of drivers and sipping a cup of coffee. Comfortably summer night leaning on Jewel food store rear",
    "city": "chicago",
    "shape": "",
    "date": "2019-07-25T00:00:00",
    "story": "I was waiting on bus relief exchange of drivers and sipping a cup of coffee.  Comfortably summer night leaning on Jewel food store rear area building and noticed east bound up about 3 stories east on Foster ave blinking lights red but long gated in about 4 to five lights steadily.  After noticed in mere shock trying to figure it was fireworks or a balloon dugout out it was a ballon.  No noise just illuminating as glow bit on and off. I was the only noticed it as to it was just behind the building as if it was found a repair or surveillance.  I think it noticed me because I yelled hey look what the hell is that a U F O. Immediately it started moving in the sky and out of north direction of sky then a flash no Enugu was noise no burst just speed of light never seen before my eyes.  This incident should have been reported to local law enforcement but didn’t flow up as to though maybe I was nuts!",
    "link": "http://www.nuforc.org/webreports/147/S147607.html",
    "state": "IL",
    "duration": "4 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b492e",
    "summary": "Bullet shaped object burning up falls towards Chicago, then changes directions and shoots away July 16 2019",
    "city": "chicago",
    "shape": "egg",
    "date": "2019-07-25T00:00:00",
    "story": "Bullet shaped object burning up falls towards Chicago, then changes directions and shoots away July 16 2019 My partner and I were attending tonight’s regular Full Moon Fire Jam on the beach along with a hundred or so other people.  My partner made a comment about the planes tonight, she felt like they were moving a lot lower and faster, they seemed more colorful than usual and were interesting to look at so I was laying on our blanket face up staring at the planes in the sky.   After a while of spacing out I realized my attention had fixed on a bright object that wasn’t the moon.  At first it was just a bright red-orange light headed towards earth from the East, if the projectile landed it would be a little bit North of us.  After a minute I asked “Do you see that?”.   We watched it for another minute, trying to understand what it was. My original thought was a foreign space object somehow missing a tail, but my partner’s was that it was a bomb.  She has better eyesight than me and later claimed that the thought of it being a bomb came from the way the light shone against! the surface of the object, like wrapping around its nose, “It looked like a bullet.”.  It was big, how big is hard to say, but big enough that if it did crash to earth it would destroy the city.   We got up and started to leave, but when no one else followed we questioned our decision.  “It’s still there.”  I noted, and we both watched it for a few more seconds.  From my perspective it seemed to stop and immediately change directions, now moving parallel to the horizon towards the North, away from us, but my partner believes it “slungshot back the way it came”.  It was completely gone within a second.   I posted a vague question about it on the Fire Jam Facebook event page and two others described the event as well.  I don’t know if what I saw was intelligent life, technology, or space junk, but whatever it was, it made my heart fall into my stomach, I could hardly believe what I was seeing was real.  I feared for my life.",
    "link": "http://www.nuforc.org/webreports/147/S147620.html",
    "state": "IL",
    "duration": "~3 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b49a6",
    "summary": "Saw 2 possibly 3 objects in the sky during early afternoon over Lake Michigan near Shedd Aquarium on July 4th",
    "city": "chicago",
    "shape": "disk",
    "date": "2019-07-12T00:00:00",
    "story": "Saw 2 possibly 3 objects in the sky during early afternoon over Lake Michigan near Shedd Aquarium on July 4th Sitting on terrace at the Shedd Aquarium having lunch when we saw a few different aircraft/ could explain most of what we saw but I managed to catch two images on phone.   One has just the 2 saucer like objects then in second there would appear to be a helicopter or even a pulled banner from smaller planes flying between them.",
    "link": "http://www.nuforc.org/webreports/147/S147368.html",
    "state": "IL",
    "duration": "Few seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b4ad8",
    "summary": "Large white light visible over Lake Michigan",
    "city": "chicago",
    "shape": "light",
    "date": "2019-07-05T00:00:00",
    "story": "Large white light visible over Lake Michigan I looked out my east facing window and thought I was looking an early morning moon in the mid-horizon over Lake Michigan.  I thought the moon was obscured by the clouds which was creating an effect of partial visibility.  The light disappeared and I thought it had gone behind the clouds.  I opened the night sky app and pointed it in that direction, and there was no moon there!  Oddly, at the same time, I saw two moving lights, going north to south.  These appeared at first to be in the far distance, but as I tracked them visually, they were decreasing in altitude and appeared between myself and the buildings in front of me.  I suppose these could be drones, used by CP to scout late-night disturbances.  Was just odd to me that there were 2 flying in unison at the same time I saw that weird light in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "link": "http://www.nuforc.org/webreports/147/S147138.html",
    "state": "IL",
    "duration": "5 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b4cc6",
    "summary": "My husband were driving on 294 near o’hare  airport in Chicago,   Illinois on our way to St.  Louis. Was taking random pics there was a",
    "city": "chicago",
    "shape": "disk",
    "date": "2019-06-07T00:00:00",
    "story": "My husband were driving on 294 near O’hare Airport in Chicago, Illinois, on our way to St.  Louis.  Was taking random pics there was at the moment, 1 commuter aircraft that had just passed going out of my pic to the right.   Upon looking at the pic I noticed what appears to be a “disk like or “hat-like\" metalic  shape\" with a  lighter color “underbelly\" outlined by a dark ring there also appears to be 1  smaller object with it off to the left and up and I have same image in same spot in 3 pics. Time was 12:53 conditions….cloudy/overcast no rain in area.  Pics taken on galaxy s9+.",
    "link": "http://www.nuforc.org/webreports/146/S146492.html",
    "state": "IL",
    "duration": "1 minute"
  },
  {
    "_id": "64d005f478aba2ec5a3b4d8d",
    "summary": "We seen 3 lights in the sky .. standing still in the air for minutes at a time. Then they went into a triangle formation. Then it look",
    "city": "chicago",
    "shape": "circle",
    "date": "2019-04-25T00:00:00",
    "story": "We seen 3 lights in the sky.. standing still in the air for minutes at a time.  Then they went into a triangle formation.  Then it look like the lights went to a single file line.  They were sitting in mid air over lakeshore drive which is a body of water.  This water strength into Lake Michigan.  This sitting was film out of a building on the 25th floor on lakeshore drive... The lights started to disappear one by one and then reappear.",
    "link": "http://www.nuforc.org/webreports/145/S145752.html",
    "state": "IL",
    "duration": "10 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b506b",
    "summary": "I saw a very big circle like thing in the sky with very strong lights in purple lavender pink color flashing very strong over trees rig",
    "city": "chicago",
    "shape": "circle",
    "date": "2019-12-22T00:00:00",
    "story": "I saw a very big circle like thing in the sky with very strong lights in purple lavender pink color flashing very strong over trees right about for at least 20 min then it faded away I have video it looked like a very big Christmas ornament flashing these colors so strong yet jus sitting there ..I DNT know what I saw but ..I feel this wasn't something I've very herd or known of I felt nervous looking at this and felt like I shouldn't be filming it ..I don't know what it was or if anyone else saw it because it was early in the morning but the lights where very vivid so many someone else did ..and I was the only one to come out side to see not sure..but definitely confused",
    "link": "http://www.nuforc.org/webreports/151/S151816.html",
    "state": "IL",
    "duration": "20 min"
  },
  {
    "_id": "64d005f478aba2ec5a3b50a9",
    "summary": "UFO Observed During Chicago Thunderstorm",
    "city": "chicago",
    "shape": "light",
    "date": "2007-10-08T00:00:00",
    "story": "UFO Observed During Chicago Thunderstorm Facing east. Observing a thunderstorm over Chicago/Lake Michigan, with a lot of lightning. Saw a bright star like object directly over head (maybe 90 degrees from horizon) in a break in the clouds.  Object became brighter as if it were approaching the Earth, stopped and then rapidly became smaller as if it were moving away from the Earth. Finally it disappeared. this entire show lasted no more than 3 seconds.  At first I thought it was part of the meteor shower. But I have observed meteor in the past and this did not move like a meteor.",
    "link": "http://www.nuforc.org/webreports/058/S58225.html",
    "state": "IL",
    "duration": "3 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b513e",
    "summary": "i saw a u.f.o in chicago in a  area called lincoln park it hoovered above us for about 5 minutes it was a circular object with flashing",
    "city": "chicago",
    "shape": "disk",
    "date": "2006-10-30T00:00:00",
    "story": "i saw a u.f.o in chicago in a  area called lincoln park it hoovered above us for about 5 minutes it was a circular object with flashing lights the colors of the lights were green,red,orange,white, at the time it happend i was 11to12 years old my family saw it with me there was 5 of us it had a very quiet engine it seemed like it was observing us for a couple of minutes and then suddenly hoovered slowly over my house i called chicago police and told the police what happend and the police came to my house but did not  come in the 2 officers saw the object and could believe what they were actually looking at that was my u.f.o sighting. ((NUFORC Note:  Date of alleged sighting may be approximate, although the witness does not indicate that fact.  PD))",
    "link": "http://www.nuforc.org/webreports/051/S51761.html",
    "state": "IL",
    "duration": "5 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b51e5",
    "summary": "BLUE Cube",
    "city": "chicago",
    "shape": "other",
    "date": "2006-10-30T00:00:00",
    "story": "BLUE Cube This event happen about 7 years ago when i was about 13… we were coming back from canada to chicago...not sure what state we were in. We were coming back in a van and it was about 11pm, most of us were sleeping but my aunt was driving. Then all at once we were driving and we were the only ones on the road which was straight and had corn fields on both sides of the road when my aunt said to everyone to look to the right side. Thats when we all saw a UFO. It was about 2 stories high and 20 feet wide....and it was a cube shap ...it was going very slow....it was glowing lightblue....but the scary thing is that once it past the road in front of us ....it took off faster then any jet i have ever seen. It had no windows, no wings, no jet powered engin, no tale like a shooting star..it had to be something from somewhere else because it was able to control its spead adn take off faster then a jet...and i seen jets in the air show so i know how fast they can take off .. I just know I was scared and every one in the van saw it......if anyone seen this I would really want to know if anyone has a video or pictures email ((e-address deleted)) ((NUFORC Note:  We have amended the date above, to reflect a date seven years ago.  PD))",
    "link": "http://www.nuforc.org/webreports/052/S52112.html",
    "state": "IL",
    "duration": "30"
  },
  {
    "_id": "64d005f478aba2ec5a3b51d9",
    "summary": "the object took off with high speed after being still.",
    "city": "chicago",
    "shape": "oval",
    "date": "2008-06-12T00:00:00",
    "story": "the object took off with high speed after being still. I am 45 years old. In the early 70s ..1974 or 1975 ,I know it was not the year I entered high school 1976 thru 1981 and I entered college 1981 thru 1986. Thats how I arrive at this date. My brother ,a neighbor girl  and maybe a few other friends and myself were out in the yard of my parents house one warm nite in 1975 or 1974. We lived in a community that had an amusement park. I say this to say we were familiar with machinery that have different color lights. This object hoovered above us wraped with different color lights.It was spining as it moved through the sky.  We all saw it and we were to young to say UFO.  My latest encounter was summer of 2004. I was with friends at a lecture that deals with phenomanom, theorys ,reptilians Ufos and conspriacies. I hung around after the lecture was over.The lecturer usually has tons of questions and answers for people buying his products for health etc etc etc, after the lecture is done. So it was an unusual wait for me but its fun to hang around and talk about the info that was brought to us by the DOC i call him for now.  The doc and all the left over guest was daparting the house and we were standing in his driveway. Some type of mental energy directed us to look up to the sky just above us. We all looked up and this object that was miles and miles above us was standing still and when it had all our attention it speed off through the air like a nasa rocket with ferrocious speed. It was still and then it speed off to let us know that it was there to protect the DOC or to confirm that we were in sync with the truth. I was stunned myself becouse I witnessed it. We all confirmed that it was a UFO that evening. I believe it blinked a lite for us as well. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
    "link": "http://www.nuforc.org/webreports/063/S63168.html",
    "state": "IL",
    "duration": ""
  },
  {
    "_id": "64d005f478aba2ec5a3b540d",
    "summary": "Circular, silver stationary object over Chicago close to Ohare Airport at high altitude.",
    "city": "chicago",
    "shape": "circle",
    "date": "2006-10-30T00:00:00",
    "story": "Circular, silver stationary object over Chicago close to Ohare Airport at high altitude. It was a sunny, but partially cloudy day.  I was outdoors by our condo swimming pool.  I looked up an next to a cloud saw a silvery, circular object.  Perfectly circle.  I was looking up directly almost and was seeing the bottom of whatever I was looking at.  It was about the size of an erasure on the end of a pencil.  It was shinny and circular.  I could not see the top.  I assume it was pretty high up.  I live by the lake michigan close to Cubs park.  Aircraft to Ohare airport frequently pass through this location, approximately, when landing.  I shifted position in my lounge to be more comfortable, looked up and it was gone.  Don't know if it was a weather balloon, satellite, ufo disk or what. Occasionally I see balloons floating at low altitudes from here, after they have been lost.  This wasn't moving when I looked at it.  More or less stationary.  And again perfectly circular and silvery metalic.",
    "link": "http://www.nuforc.org/webreports/051/S51723.html",
    "state": "IL",
    "duration": "30 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b548f",
    "summary": "Summer of 1962 Chicago \"Plane towing lighted sign\" flap",
    "city": "chicago",
    "shape": "disk",
    "date": "",
    "story": "Summer of 1962 Chicago \"Plane towing lighted sign\" flap This sighting occurred in Chicago, IL in the summer of 1962 or 1963. I was 14 or 15 years old at the time and I was with two high school classmates. We were sitting on a park bench in the Sawyer elementary school playground. This is on the south side near 51st and Kedzie.  It was summer vacation and we were out late (about 10 PM). It was already dark but as anyone who knows the city will tell you, the lights from the city will illuminate anything in the air. We noticed this object (which looked like a disk from our angle) move from our right to our left (this equates to south to north). It was fairly large and fairly close. I was about the size of a 474 jumbo jet and it was close enough to look like an airplane making a landing at nearby Midway Airport.  It moved very slowly and there was no sound at all. As I said it looked like a disk from the angle we were viewing it at and it did not have sharp edges – they were more rounded. The edges had what looked like portholes (round windows) around the periphery of the object. The inside of the object was very brightly lit and it looked like people moving around behind those portholes! I remember seeing at least one “person” who appeared to be looking at the bird’s eye view of the city! I think the object was rotating but very slowly. Other than the light from the windows there were no other lights.  We watched it slowly make its way very far north and we were able to follow its path until it just appeared as a spec of light which then moved east and disappeared. We were all very exited about this sighting and we decided to call the police to report it. It turned out that many, many people had called about this and the official police explanation was that it was an airplane towing an illuminated sign. I never believed that explanation because I know what I saw and it was NOT an airplane towing a sign.  If anyone else saw this on that night in Chicago please tell what you saw. I would appreciate hearing that someone else was witness to this strange object (notice I did NOT call it a craft although I believe that is what it was). There is one person here who describes the same thing but with square windows and he says it was in September 1964. I am fairly certain that my date is correct – summer of 1962. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/061/S61654.html",
    "state": "IL",
    "duration": "10 minutes"
  },
  {
    "_id": "64d005f478aba2ec5a3b56b7",
    "summary": "fire ball moving horizontally across sky",
    "city": "chicago",
    "shape": "fireball",
    "date": "2008-03-04T00:00:00",
    "story": "fire ball moving horizontally across sky My husband ran from the front room to the dining room to show me a big light on the corner street.  I saw a big light that lite up the corner intersection, and part of our street.  Then we both saw a fire ball low in the sky, horizontally racing east.  This fire ball was maybe 7 stories high.  I called the police because we are on the flight path of Ohare airport and I thought a plane part fell or a plane when down.  When 911 answered the phone, they asked where would it land.  I said it had to be close because it was so low but it wasn't coming down in a vertical descent.  It was confusing.  I asked if there were any other 911 calls and they said no.  There wasn't any reports of things crashing to the earth.  The fire ball was maybe 8 feet across.  This was years, maybe 2, before the Ohare reports and I didn't know what to make of it.  Only after the Ohare reported sightings did I rethink this. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/060/S60235.html",
    "state": "IL",
    "duration": "1 minute"
  },
  {
    "_id": "64d005f478aba2ec5a3b5715",
    "summary": "SOCCER-SIZED CRYTAL-LIKE SPIKED BALL, Easily Missed If One Is Not Looking Directly At It.",
    "city": "chicago",
    "shape": "sphere",
    "date": "2007-02-01T00:00:00",
    "story": "SOCCER-SIZED CRYTAL-LIKE SPIKED BALL, Easily Missed If One Is Not Looking Directly At It. Soccer-ball-sized craft that I could see thru much like a dandelion flower seeds just before you blow them.  It was made like a lot of spikes in two heights, though, and if I had not been looking in that exact spot at that exact time, I would never have seen it.  It was outside the window that overlooks the space between our building and the next, a width of about 5 feet betweein the two buildings.  The day was overcast but it was light outside.  No country, or group of countries could have made this object.  I heard it make no sound but, then, it was outside the window, and it appears to use the air as a stepping stone and it glided toward the window as I happened to look that direction.  It stopped, pivoted once, paused, pivoted again, and left quickly in the direction from which it came.  The best way I can describe seeing it is like seeing Predator, wherein one can look directly at it and not see it unless it moves.  And if you are looking a few feet to the side of it, one would not see it probably.  It was too small to have occupants since it was about 10 to 12 inches in diameter and a portion of that diameter seemed to be made of spikes, but you can see thru it.  It moved \"with purpose\", though, and could not have been some eye phenomenon because I saw it pivot twice.  I only saw it once, and have never heard of anyone quite describe what I saw, or at least I do not know of anyone whose description matches mine.  I did see a fairly similar depiction of my craft, but is was all black in the book, and there was no additional informaton.  I think a good description of the basic shape is that of certain pollen when viewed with an electron microscope, but that would be shape only.  The color is like a crystal that reflects the colors of the overcast sky at daytime.  It did not emit lights or beams, left no trail, and did not land or make any sound.  There were no lights on the object, no aura or haze around it.  It did not change colors any more than a series of crystals would.  There was no aircraft in its vicinity, and it had no noticeable affect on any equipment in my livingroom where I was when I saw it.  I do not have pictures of it.  My sense is that it was a probe of some sort, gathering information of some sort, and it may have taken a picture perhaps on the first pivot.  Who knows?  It is just a guess... ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/054/S54550.html",
    "state": "IL",
    "duration": "10 seconds"
  },
  {
    "_id": "64d005f478aba2ec5a3b5b27",
    "summary": "Chicago UFO - Sears Tower",
    "city": "chicago",
    "shape": "disk",
    "date": "2007-02-01T00:00:00",
    "story": "Chicago UFO - Sears Tower The ufo was only captured on a digital camera.  Me and my Brother were driving though Chicago right before rush hour on our way to South Dakota.  Niether of us saw the ufo, but after looking over the pictures we had just taken of the chicago skyline, we noted that there was a saucer shaped object plain as day in one of the pics.  I will email the pic to the center.  We've had this picture posted on our website for 2 years now... http://www.probush.com/ufo_over_chicago.htm  We believe this to be the same UFO United Airline workers saw this past November at O'Hare. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
    "link": "http://www.nuforc.org/webreports/054/S54637.html",
    "state": "IL",
    "duration": "Photo Capture"
  },
  {
    "_id": "64d005f478aba2ec5a3b5af9",
    "summary": "4 objects spoted over Lake Michigan in Chicago",
    "city": "chicago",
    "shape": "formation",
    "date": "2007-08-07T00:00:00",
    "story": "4 objects spoted over Lake Michigan in Chicago While laying on the beach at Chicago's North Avenue Beach I was observing planes and birds flying overhead in a perfect blue sky.  While following the path of one plane I noticed a silver dot in the sky of which the plane had just flown under.  Having seen this perspective I was able to observe the silver dot hovering in a motionless position high above land then disappear in what appeared to be an ascet out of the blue sky and out of sight; straight upwards.  This piqued my curriosity and I questioned if what I had seen was real.  30 minutes later an orange or copper colored dot appeared which seemed to be more observable than the silver object I observed earlier.  The orange dot was hovering when suddenly two white dots appeared into sight.  The three objects hovered motionless for some moments then swayed back and forth.  Hovering in a triangle formation.  My initial thoughts were that I was seeing Mars(orange or copper color) and two neighboring stars.  I was skeptical only to the fact that I've never observed stars in the daytime much less Mars.  It also seemed that the formation was shifting from a right triangle to an obtuse triangle which took away any assumptions of planets and stars appearing stationary during the daytime.  I took pictures of the sky using my camera phone.  The quality of the camera I don't think is good enough to have captured these objects digitally.  However if someone would like to examine them I took 5 or so pictures of the sky.  I also walked over to a life guard and pointed out what I was observing.  He had no explanation of what these objects were but did see them as well once I pointed them out.  Minutes later the objects flew off in what appeared to be heading south in the sky.  Their departures were very swift and disappeared in what seemed to last less than a second.  I approached the life guard again and had asked if he still saw the objects in the sky.  He answered no and stated he saw the one object fly off.  As we tried to make sense of what we had just witnessed, another small white object started to appear.  This turned out to be a seagull's down feather descending onto the beach.  Our eyes had not been fooled.  These were not jets, clouds, or feathers.  Instead they mimicked the hours and hours of footage found documenting UFO's.  Which tells me that anyone with a trained eye can spot them.  They've been around for a long time and will continue to be.",
    "link": "http://www.nuforc.org/webreports/057/S57088.html",
    "state": "IL",
    "duration": "15 minutes"
  }
]