{
  "city": "amarillo",
  "fetch_timestamp": "2025-07-12T14:36:40.837356",
  "record_count": 34,
  "pages_fetched": 1,
  "api_calls": 2,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b42a0",
      "summary": "It was little",
      "city": "amarillo",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "It was little it was a slow ball. the ball was metal. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49907.html",
      "state": "TX",
      "duration": "school"
    },
    {
      "_id": "64d005f478aba2ec5a3b43b1",
      "summary": "blueish silverish UFO felt like jello over Amirillo,Texas.",
      "city": "amarillo",
      "shape": "rectangle",
      "date": "2006-05-15T00:00:00",
      "story": "blueish silverish UFO felt like jello over Amirillo,Texas. When my grandfather picked me up from Puckett Elementry School at 15:00 we went down Bell St. I noticed something silver and shiny, at the corner of my eye. I looked out the passenger side window and saw something rectangular about three feet away from me. I said \" Papa look \" and he said \"what?\" and then I felt it, it looked solid but felt like jello. I heard my voice singing a song that I had stuck in my head from quior that morning. Then I saw three lines that had looked a lot like the design on my shoes. My grandfather couldn't see it from where he was sitting (driving). I saw a square on top that was blueish and translucent. This is where I saw the lines that resembles on my shoe. Then it vanished very quickly from my sight.",
      "link": "http://www.nuforc.org/webreports/050/S50328.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b59fd",
      "summary": "Sighting of several bright stationary lights and blue light at later time around same location.",
      "city": "amarillo",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Sighting of several bright stationary lights and blue light at later time around same location. Sightings occur at certain nights in the same location at certain times. East of town near airport and Bell Helicoptor approx. 10-11pm. Myself and 2 others driving over bridge which gave us the chance of spotting them. One bright bright white light and a secong elevated slightly higher but not as bright. After approx. 5-6 min. of sitting still the smaller light darts directly toward the brighter larger light. Larger light grows slightly brighter and darts away into the sky while second light stays. Second light stays in position until we can no longer see the lights. Later on at approx. 3-4 am we are driving back into town, of course I'm all freaked so my eyes are on the sky. Me and driver (3rd person now at home) spot a dim blue glowing object moving slowly against the wind through the clouds.  After approx. 10 sec. it brightens slightly and we distinctly see the object dart through the clouds and into the sky. Seems as if these sightings occur only in those locations at certain times late at night. In my opinion it is impossible that they were planes due to their movement, appearance and behavior. Objects spotted near airport, Bell Helicoptor and Pantex so maybe they're OURS. Thank you for allowing me to report this sighting. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information. PD))",
      "link": "http://www.nuforc.org/webreports/060/S60455.html",
      "state": "TX",
      "duration": "Random intervals"
    },
    {
      "_id": "64d005f478aba2ec5a3b6dc6",
      "summary": "Overflight of three white luminescent delta shaped craft in a triangular formation.",
      "city": "amarillo",
      "shape": "triangle",
      "date": "2006-12-07T00:00:00",
      "story": "Overflight of three white luminescent delta shaped craft in a triangular formation. The city of Amarillo sits at about 3700' above sea level and if you are in an area where street lighting or other ambient lighting is somewhat blocked, the sky can be fairly dark for a metropolitan area. Such was the location of my sighting; an east-west driveway that is bounded by a seven foot wood gate on the east, my house (roof height of 25' to 40' at its peak) along the south side, my neighbors 6' fence, house and 50' tree on the north side boundary, and the west side bounded by a stand of 30 -45' trees. My house sits in the east to west take-off flight path of our airport which is approx. 10 miles due east. Those planes are normally transiting a bit north of, yet parallel with this driveway. As an avid aviation buff since I was very young (my grandfather had a horse farm right across the highway from the now closed Amarillo Air Base which was a SAC installation), I am always checking the sky. On this particular night at 12:35 AM, I had taken my dogs out one last time for the night and I was standing in the driveway area that is darker than any other area around the north or west side of my house, perusing the sky. For whatever reason, I was looking straight to the east when I noticed three pinpoints of light emerging from the tree line of my neighbors house across the street (this would have been at an angle of about 20 degrees). These three points of light increased in size to the point where I could see that they were each delta shaped and were in a tight triangular formation as well. I was stunned that they were perfectly aligned with my driveway! At about 75 degrees I could see that the back edge of each delta shaped light was blurred. When these objects were directly overhead I would say that they were each about 1 1/2 width of a quarter. The formation remained tight until about 120 degrees (the objects were close to entering the west tree line boundary which would obscure my clear view) when the lights suddenly performed a \"shuffling\" move and regrouped into the same triangular formation. During the entire episode, I would say that each light's luminosity remained constant, only the relative size of the object/light increased and diminished as would be expected. Absolutely no noise whatsoever. One final kicker - as I was trying to figure the speed/altitude of the overflight and looking straight up from the same position - I saw a meteor streak from southeast to northwest and flame out right over my head! (obviou sly at a very high altitude because the streak was the length of my forearm and unobstructed by the roof line). Because of the manner in which the lights first appeared I was thinking that they could be at a fairly low altitude (5000 - 10,000'?), but at the overhead apex I just could not get a \"read\". But I do estimate their speed to be at least 3-5 times faster than an aircraft if they were both at a relative cruising altitude. But I do have to emphasize the point that while this sighting was very exciting, the orientation of their east to west flight path right down the center axis of my driveway was astonishing!",
      "link": "http://www.nuforc.org/webreports/053/S53185.html",
      "state": "TX",
      "duration": "60 - 90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7904",
      "summary": "Strange object and light",
      "city": "amarillo",
      "shape": "unknown",
      "date": "2006-07-16T00:00:00",
      "story": "Strange object and light I was sitting outside with my son and a neighbor when we noticed (to the direct east) a bright object speeding high across the night sky. It wasn't high enough to be a satellite, and to the best of my knowledge, all airplanes have blinking lights.  This object was not blinking.  It disappeared, possibly into some high clouds, though clouds were scarce that evening because we could see the stars quite clearly.  About a minute or two passed.  We were joking around and speculating the distance the object might have traveled over the time that had elapsed when suddenly a VERY bright light slowly blinked high in the sky- at the exact spot our rough calculations had placed the flying object.  It looked like a headlight that had turned on- then off.  It flashed once more and it was over.  Kind of like when kids are playing Morse Code with flashlights.  It was an alarming spectacle because the light was incredibly large for any object at that high of a distance-- and it was much, much larger than any light source that might come from an airplane.",
      "link": "http://www.nuforc.org/webreports/051/S51118.html",
      "state": "TX",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ecb",
      "summary": "\"Flash Bulb\" like lights hovering at 100 ft over Hwy 287 outside of Amarillo",
      "city": "amarillo",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "\"Flash Bulb\" like lights hovering at 100 ft over Hwy 287 outside of Amarillo Last summer my family and I were driving thru Amarillo at 11pm on our way home to Dallas.   Just outside of town on Hwy 287, we were surrounded by at least a dozen \"flash bulb\" like lights that were hovering at maybe 100ft over the road and keeping pace with our SUV at 80mph.   One hovered silently right over our car, moving with us and as I watched it out the passanger window, it \"flashed\" like an old fashioned camera flash bulb when I was looking right up in to it.  It then crossed over the highway and headed back north.   The phenomenon lasted for at least 10 minutes.",
      "link": "http://www.nuforc.org/webreports/072/S72215.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8201",
      "summary": "TRIANGLE UFO SIGHTING IN AMARILLO TX",
      "city": "amarillo",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "TRIANGLE UFO SIGHTING IN AMARILLO TX I HAVE DISCOVERED THIS 8MM CASSETTE TAPE FROM MY FATHERS HOUSE AND IT CONTAINS A UFO IN THE SKY  IT IS NOT A FAKE. YOU CAN CLEARLY SEE A TRIANGLE OBJECT IN THE CLEARBLUE SKY FOR ABOUT A MINUTE AND ALL OF A SUDDEN SOMETHING LIKE A LIGHT OR A SCANNER COMES FROM THE BOTTOM OF THE OBJECT KINDA LIKE A DROPDOWN OR SOMETHING.  i HAVE A FRIEND WHO ABSOLUTELY BELIEVES THIS IS REAL AND HAS SEEN THE SAME THING BEFORE. WELL THERE YOU HAVE IT A REAL UFO I CAN TELL YOU I AM NOW A BELIEVER. ((NUFORC Note:  We have requested a copy of the film.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68801.html",
      "state": "TX",
      "duration": "3 MIN"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bd3",
      "summary": "Shiny heart shaped object in amarillo texas",
      "city": "amarillo",
      "shape": "other",
      "date": "2010-04-13T00:00:00",
      "story": "Shiny heart shaped object in amarillo texas   I was washing my truck at a local car wash, for some reason I cant remember why but I looked up. As soon as I looked up a shiny heart shaped object caught my eye, the object wasnt moving it was just there floating in the same spot. It didnt move at all, I finished washing my truck and on the way home I could still see it in the rear view mirror. I called a friend and asked him to look outside and he did, he said he saw the heart shaped object as well. I was amazed when I got home I sat in the patio and just starred at it for about 40 mins, all of a sudden it vanished quickly. I got up and walked about 4 feet just to make sure it did disappear, then about 10 seconds later a little red circle appeared but this time it was moving in circles. I also called my mom and brother to tell them about the objects, the were on the other side of town. They also said they saw it. ((NUFORC NOTE:  Witness indicates that date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74722.html",
      "state": "TX",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c34",
      "summary": "An unknown light in the southwestern sky. Slowly got smaller before disappearing completely.",
      "city": "amarillo",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "An unknown light in the southwestern sky. Slowly got smaller before disappearing completely. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72903.html",
      "state": "TX",
      "duration": "00:5"
    },
    {
      "_id": "64d005f478aba2ec5a3b959a",
      "summary": "A Bright Lighted Object over Amarillo, Texas.",
      "city": "amarillo",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "A Bright Lighted Object over Amarillo, Texas. Every night I talk a walk with a Camra in case I see something,  So I was walking and then I sat down on a picnic table and looked up at the clear stary sky, So I started looking at this Bright light in the sky so I took a picture of it and then it looked like it was changing colors on me, So i kept looking at it for about an Hour and a half, so I went back home and put the pick on my Laptop as Background and when I looked at the picture it looked to be a small craft with two lights on the back of it.  Then I went back to the spot where I took the pic and the object was gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We would like to see the photos, but we have no way of contacting the anonymous party.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71109.html",
      "state": "TX",
      "duration": "1 1/2"
    },
    {
      "_id": "64d005f478aba2ec5a3b96ed",
      "summary": "Craft shaped like a cube of bright swirling light, hovering over downtown Amarillo at 3:00 a.m., spot lights and heavenly music . . .",
      "city": "amarillo",
      "shape": "other",
      "date": "2010-06-23T00:00:00",
      "story": "Craft shaped like a cube of bright swirling light, hovering over downtown Amarillo at 3:00 a.m., spot lights and heavenly music . . . After retiring to bed on a late Sunday evening in a cheap downtown motel room in Amarillo, watching television until I fall asleep, I tossed and turned until somewhere between 2:30 and 3:00 a.m., when suddenly a light flickered through the curtains.  I didn’t pay much attention as I thought it to be a neon sign on the Bank of America building across the street.  I rolled over and attempted to sleep when the light again flickered through the curtains.  I still ignored it, and again with even more intensity the light flickered through the curtains. I reluctantly got up and moved the curtains so I could see where the light was coming from.  I looked up at the top of the Bank of America building of about 20 stories high and the neon sign was not flickering.  I was closing the curtains when I noticed what I thought was a police helicopter surrounded by bright lights. Spot lights were coming from the base and shining in various spots in the parking lot.  My first thought was that it was some kind of drug bust and the helicopter would be landing with a swat team.  However, the craft did not land, but stayed hovering high in the dark night.  Now it had definitely got my attention. As I focused on it, I made out the shape to be a cube, definitely three dimensional.  I couldn’t make out any substance such as steel.  It was a cube of light, swirling bright light on a three dimensional cube.  I was still trying to rationalize what it could be.  I then remembered seeing special shape hot air balloons in Albuquerque which lit up at night in similar fashion.  \"That’s what is must be,\" I told myself.  Then something even stranger happened.  I heard musical tones similar to wind chimes or ancient flutes that we often hear in Greek mythology type movies.  But the sounds were coming from inside my head even though it felt I was hearing them with my ears. I became afraid and did not move for about 20 minutes while I continued to watch.  I finally said to myself, \"What ever it is knows I am here, and I cannot hide from it.\"   I immediately dressed and walked outside.  I stayed underneath the 2nd floor overhang and peered out to see above.  It was even more magnificent when viewing through the night air although it was hard to focus on, somewhat blurred.  At that moment I was surrounded by an orchestra of musical tones again sounding like ancient flutes or pipes.  I thought to myself, how beautiful!  The song was child like, something you might hear a children’s nursery.  Again, I heard the music in my head and outside, but not in our natural way of hearing, hard to explain . . . To make a long story short, I packed my bags and was running to my SUV when an early morning garbage truck and driver stopped in the alley next to my car. I looked at the driver in the eyes and signaled to look up with my eyes.  I turned and ran with luggage in tow, got in my car and drove two hours to my home in Lubbock.  I drove to my sister’s office where my mother happened to be and told both of them what I witnessed.  By the look on their faces they were fearful for me.  I phoned a friend of mine who happens to be a deputy sheriff in Amarillo to ask if anyone had phoned in such a sighting in the early morning dark.  He laughed hysterically and said no, but would let me know if anyone did.  He did not call back.  I’ve since moved to Phoenix and have told only a handful of people what I witnessed that early morning on June 20, 2005, five years ago. ((NUFORC Note:  Source of report elects to remain anonymous.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75836.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b98a1",
      "summary": "unknown ball of light appeared and then took off at a high rate of speed!!!",
      "city": "amarillo",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "unknown ball of light appeared and then took off at a high rate of speed!!! I was sitting outside on my porch having a smoke , when all the sudden a ball of light appear about 2 blocks away and about 300 feet in the air and it was round and very bright light was coming from it,  the unknown object stayed in the same position for about one minute and then took off at a high rate of speed going in the direction of southwest faster than any plane or man-made craft then it was gone from my site. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67402.html",
      "state": "TX",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ef8",
      "summary": "we saw flashing lights",
      "city": "amarillo",
      "shape": "flash",
      "date": "2008-10-31T00:00:00",
      "story": "we saw flashing lights we saw blue and amber flashing lights",
      "link": "http://www.nuforc.org/webreports/066/S66197.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba70b",
      "summary": "Two, maybe three, possible ufos of triangle shape- one of which was moving slowly.",
      "city": "amarillo",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Two, maybe three, possible ufos of triangle shape- one of which was moving slowly. I believe I just witnessed two ufo’s. The first one I saw was close, triangular in shape, and was moving too slowly to be an airplane. It seemed to have three lights, one on each of the points, and then a couple more in the middle of the front.  I couldn’t get my palmcorder out fast enough to catch it on video and I was driving the opposite way of the direction it was traveling.  It seemed to be traveling in a north and then northwest direction. The second possible ufo, I got on video, but it was farther away and it looks like just a light on the recording.  I was traveling south on a straight road and you can tell it is not moving from side to side.  It was not getting fainter or brighter, so it must not have been moving towards me or away from me.  This leads me to believe that it was hovering. Something else I saw that could be \"something\" is hovering to the southeast of my house.  On the video I got of it, it brightens and darkens itself.  It seems to be stationery.  I must admit, I could just be excited about my previous sightings and it could be a planet or bright star that I have not previously noticed. I will take another video of the same area tomorrow night. I was driving when this all took place, save for the last possible incident, so if the \"crafts\" made any noise, I couldn't hear them. I cannot e-mail the videos because I can only e-mail up to 10mb, and both videos exceed that.",
      "link": "http://www.nuforc.org/webreports/067/S67882.html",
      "state": "TX",
      "duration": "approx. two minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bab72",
      "summary": "Bright multi colored spinning object in Amarillo Texas about 3 AM duration at least ten minutes.  ((NUFORC Note:  Star??  PD))",
      "city": "amarillo",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Bright multi colored spinning object in Amarillo Texas about 3 AM duration at least ten minutes. On September 28, 2010 at 3 AM my son and I saw a very bright, twinkling light to the northeast of our house.  It was very low in the sky and we could see it just above the roof line of our neighbor’s house.  With the naked eye it looked like it was changing colors very faintly.  We looked at it through a telescope and it appeared to be a flattened round object with very bright multicolored lights on it and it was spinning.  It did not appear to be moving.  I have looked at the stars for years and I know that it was not a planet nor was it the space station.  I have never seen anything like it.  My telescope does not have the capability to take photographs so we could not take a picture.  Interestingly it appeared to be in the direction of Pantex, which if you know the area is a nuclear facility which takes bombs apart.  It was in that direction.  I would really like to know what this was. ((NUFORC Note:  Star??  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78036.html",
      "state": "TX",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3bb38f",
      "summary": "a crossed shaped UFO with orange dots",
      "city": "amarillo",
      "shape": "cross",
      "date": "2010-11-21T00:00:00",
      "story": "a crossed shaped UFO with orange dots I was laying down in my front lawn after going for a run. after about five minutes of listening to music and staring into the night sky i saw a slowly moving object out of the corner of my eye and at first dismissed it as a shooting star. then after looking there were about 10 orange dots in the shape of a cross. the tail of the cross was waving back and forth almost as if a kite tail would in the breeze.",
      "link": "http://www.nuforc.org/webreports/078/S78819.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb43b",
      "summary": "11/10/2010 Unidentified Craft South Amarillo, TX",
      "city": "amarillo",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "11/10/2010 Unidentified Craft South Amarillo, TX At approximately 9:40 PM. on the tenth of November 2010, a friend and myself were traveling south on S.Bell St. between Hollywood road and Interstate 27.  My friend and I were engaged in light conversation when he suddenly asked \"What kind of plane is that?\". I looked through the front windshield of the vehicle and observed an object overhead with an orange light being emitted but could not identify it immediately.  The object was triangular with rounded edges and appeared to be traveling in a rough south-east to north-west direction moving over S.Bell St. toward I-27 and the Arden Rd.area. I rolled down the window and stuck my head out of the vehicle to get a better look at it and I observed the object to be flying low just over the power lines and moving rather leisurely and I at this point realized that the craft did not have wings or rotors or landing struts.  The object appeared to slow just long enough for me to study its underside and I observed tha! t the skin of the craft appeared beige in color and textured and the craft itself was about the size of a full moon if not slightly larger.  There was an individual non-blinking orange light illuminating the craft and the craft made no sound.  I noticed that the craft appeared to warble slightly as it followed its trajectory. I requested to my friend that we should follow it and he immediately turned right onto Ventura Dr and stopped. We both observed the back of the craft which was illuminated orange and observed it to move over I-27 and then slowly bank to the left behind a billboard and downward toward Arden Rd.  We lost sight of it at that point and continued on to our destination.  After we started our return home we briefly drove to where we thought the craft was trying to land and found nothing.  We placed a call, upon arriving back home to the local private airport, Tradewinds Airport, and inquired about light aircraft being in the area. We were told that they were ! unaware of any aircraft in the area in question.  They stated ! however that occasionally the Randall County Sheriffs Dept flies their helicopter with unusual lights equipped. The location of the sighting is on the southern edge of the city of Amarillo and there were street lights illuminating the road and a moderate amount of traffic on I-27 for that time in the evening.",
      "link": "http://www.nuforc.org/webreports/078/S78843.html",
      "state": "TX",
      "duration": "1 minute 30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2a6",
      "summary": "Two bright flashing round objects moveing in all directions then stoping ubruptly",
      "city": "amarillo",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "Two bright flashing round objects moveing in all directions then stoping ubruptly We went outside to smoke a cig and while we were smoking I looked up and seen two flashing lights they were not to far from each other so I asked my boyfriend and he said they must be planes as we keept looking the lights began to move up and down and side to side in all different directions we I asked him what colors he was seeing he said white and green we looked harder and it was white red and green I'm convinced I seen a ufo tonight no star no planet and no weather ballon",
      "link": "http://www.nuforc.org/webreports/084/S84112.html",
      "state": "TX",
      "duration": "Hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bc895",
      "summary": "My mother told me to go help my dad with the groceries last night and I went out a little earlier because he wasn't home yet and i saw",
      "city": "amarillo",
      "shape": "unknown",
      "date": "2011-10-25T00:00:00",
      "story": "My mother told me to go help my dad with the groceries last night and I went out a little earlier because he wasn't home yet and i saw a weird shaped craft with like 6 lights on the bottom fly real low past my neighbor hood i called my friend out he thought it was extremely weird and you could see the bright light when it was miles and miles away.",
      "link": "http://www.nuforc.org/webreports/084/S84726.html",
      "state": "TX",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5f3",
      "summary": "Orange light seen by four adults in Amarillo, Tx sky.",
      "city": "amarillo",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Orange light seen by four adults in Amarillo, Tx sky. The object shot across the sky like a shooting star with a light orange color; looked like it made the letters t and j then made a curve and disappeared into the sky.   We all looked at each other in dismay.",
      "link": "http://www.nuforc.org/webreports/090/S90811.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bde56",
      "summary": "White oval object moving fast and not in a straight line about 200 feet in air.",
      "city": "amarillo",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "white oval object moving fast and not in a straight line about 200 feet in air.",
      "link": "http://www.nuforc.org/webreports/088/S88419.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bebce",
      "summary": "V shaped craft large lights silent huge and took ten minutes to pass covered sky.",
      "city": "amarillo",
      "shape": "triangle",
      "date": "2013-08-30T00:00:00",
      "story": "V shaped craft large lights silent huge and took ten minutes to pass covered sky. This information come from my sister and it was on the news. A V shaped huge craft flew over silently with lights like in the Phoenix lights.  She stated it took several minutes to pass over Thompson Park and it covered the entire sky above them.  There were several people who saw the event.  It was a big news at the time.  They news stated that it was helicopters operating in the area. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101522.html",
      "state": "TX",
      "duration": "10 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c26b2",
      "summary": "Red light surrounded by a green light spinning around red. 2 side by side.",
      "city": "amarillo",
      "shape": "circle",
      "date": "2014-10-03T00:00:00",
      "story": "red light surrounded by a green light spinning around red. 2 side by side Driving eastbound I-40 30 miles west of Amarillo. Noticed 2 red lights in distance. Thought they were the tops of the wind generators in distance. They must have been a little different because they caught my attention.  My sister also saw them once I pointed them out. As they got closer a small green light was rotating around them, as they got closer the green light was brighter and spinning fast enough to leave a circle trace around the red light. I thought they were propellers spinning.  They were 50 - 100 feet up heading west. When they were almost over us I recognized a smoky haze inside of the circles they remained next to each other and could have been part of the same object.  I would approximate them at 10 - 20 feet in diameter green part and 1 foot or less diameter for the red portion in the middle. My sister saw blinking square red lights inside the red circles. It passed right over us and we could not track it because we were traveling 75 miles an h! our the opposite direction. It appeared to travel slow over us, but I could not gage because of the darkness.",
      "link": "http://www.nuforc.org/webreports/113/S113891.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c281e",
      "summary": "Only seen on the photo I have.",
      "city": "amarillo",
      "shape": "disk",
      "date": "2014-09-25T00:00:00",
      "story": "Only seen on the photo I have. The sighting I have is from my game camera on my place.  It it 22 miles north of Amarillo Texas an away from any electric power lines or houses.  I have the photo from my camera and would like to send it to someone but cannot find an e-mail address to send it. The light is seen over a buck deers back while he is feeding.  It appears it is directly above the deers back as the tree seen in the background is about 10 yeards from where the deer is standing. The stick with the stripes on it are one foot increments, so I can determine the size of the deer.  (I do not kill deer). ((NUFORC Note:  We have requested a copy of the photo.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113827.html",
      "state": "TX",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c3132",
      "summary": "Triangle shaped craft with three lights or more.",
      "city": "amarillo",
      "shape": "triangle",
      "date": "2014-08-08T00:00:00",
      "story": "Triangle shaped craft with three lights or more My girlfriend and I saw what appeared to be a star, that was moving erratically.  When it would come closer we could discern three lights.   Airplanes don't move like this object did, it was capable of high speeds and appeared to be doing half circles and zig zags overhead of where we were.   At times it would be still, but then it would begin to move again.   Very strange.  Indeed",
      "link": "http://www.nuforc.org/webreports/112/S112275.html",
      "state": "TX",
      "duration": "1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c3271",
      "summary": "Saw with naked eyes, football field sized ufo perform impossible maneuvers.",
      "city": "amarillo",
      "shape": "disk",
      "date": "2015-04-08T00:00:00",
      "story": "Saw with naked eyes, football field sized ufo perform impossible maneuvers. Well it's been a few years.  I was driving flatbed truck west into Amarillo. I was about 10 to 11 miles out from city center when I saw ahead and slightly to the right over some radio towers about a mile high was this white glowing football shape.  More like an eye since the ends were sharp.   It just sat there over the towers for about 2 minutes and suddenly began moving left and right about 6 miles at a time in a fraction of a second.  It would get so fast that it would disappear and reappear in different spots.   Next it began doing that same maneuver but this time would move to and from over the freeway, over me.   Now I was having a hard time following it with my head out the window, and had giant rolls of aluminum on the flatbed I didn't want to run off the road with, so I stopped looking. The craft was no doubt as large if not larger than a football field.  I don't know what the date was I'm just guessing.  It's been a while.  Sky was clear, maybe 1 skinny cloud way off.",
      "link": "http://www.nuforc.org/webreports/118/S118281.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e1d",
      "summary": "I layed down to mess with my dogs outside, as I glance up I notice a odd formation in the sky. At first I figured it was a flock of gee",
      "city": "amarillo",
      "shape": "formation",
      "date": "2015-08-27T00:00:00",
      "story": "I layed down to mess with my dogs outside, as I glance up I notice a odd formation in the sky.  At first I figured it was a flock of geese flying in a \"V\" formation, then realized it was breaking formation and heading north.  I would say the object was roughly 200 yards above me and 50 yards long.  Dead silence, you could hear a pen drop.  It looked roughly like this.  . .     . .         .",
      "link": "http://www.nuforc.org/webreports/121/S121484.html",
      "state": "TX",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c54cf",
      "summary": "Flash of light seen on 11/30/15, east of Amarillo.",
      "city": "amarillo",
      "shape": "fireball",
      "date": "2015-12-10T00:00:00",
      "story": "Flash of light seen on 11/30/15, east of Amarillo. I saw what appeared to be a ball of light flash across the sky, headed downward in the east sky along Amarillo.  I was driving home from work when i saw it.   It was there for as long as it took me to think, \"Whats that, I think I shoould video tape it.\"  Before it disappeared, before I could get out my phone.",
      "link": "http://www.nuforc.org/webreports/124/S124521.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c623c",
      "summary": "Round, Shiny, almost transparent, still object in the sky, facing West",
      "city": "amarillo",
      "shape": "teardrop",
      "date": "2016-09-30T00:00:00",
      "story": "Round, Shiny, almost transparent, still object in the sky, facing West When walking outside there was an oval, teardrop shaped shiny but almost transparent object in the sky.  Almost like a balloon, but it was not moving. It was toward the west.",
      "link": "http://www.nuforc.org/webreports/130/S130275.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6518",
      "summary": "Thank you for reading this report and taking my claims seriously.",
      "city": "amarillo",
      "shape": "sphere",
      "date": "2016-08-19T00:00:00",
      "story": "Thank you for reading this report and taking my claims seriously. I was sitting on my front porch, as I was home alone at the time.  I look up from my cellphone at just the right time to see something very bright, but far away, and extremely fast.   The object looked spherical and bright green in color.  It looked very small considering how far into the sky it seemed to be.  It had a white circle in the middle of the bigger green coloring.   It took about three seconds for the craft to shoot all the way from the left, to the right side of the sky right in front of me.  It was far, far too fast to be anything built by modern humans.   It would be impossible, not to mention deadly, for a commercial aircraft or other human-developed device.  I would really like to know what it is I saw.   This is my first UFO encounter. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129310.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c786f",
      "summary": "I. Woke up an looked at my security cameras an. This. Is. What I saw I have. Seen this. Before. A  large. Bright light which looks lime",
      "city": "amarillo",
      "shape": "triangle",
      "date": "2017-12-14T00:00:00",
      "story": "I.  Woke up an looked at my security cameras an.  This. Is.  What I saw I have.  Seen this. Before.  A  large.  Bright light which looks lime.  The moon  but noticed it moves slowly an yet too fast to barely be noticed   take a look for your self. .I am only reporting this. I am scared they. Don't. Want me to.  Indulge  this.",
      "link": "http://www.nuforc.org/webreports/137/S137712.html",
      "state": "TX",
      "duration": "18 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c840f",
      "summary": "Two low flying disk-shaped craft with porthole windows fly directly over witness' head.",
      "city": "amarillo",
      "shape": "disk",
      "date": "2018-08-10T00:00:00",
      "story": "Two low flying disk-shaped craft with port-hole windows fly directly over witness' head. Just before sundown I saw something moving on the western horizon and jumped up to get a better look.  When the objects were about half way from the western horizon to my position I could see that they were disk shaped craft.  I was at the state fair and they flew silently almost directly over my position. Their altitude was quite low so at arms length they were about the size of a soda can bottom. I could see four round, port-hole windows on the bottom of each craft.  There was green light shining through each window like it was just the interior light and not a beam or external light.  The bodies of the craft were grayish, metal looking. Flying from horizon to horizon only took about eight to ten seconds and going that fast they were not stream-lined like one would expect but wobbled slightly from side to side like there was some sort of magnetic attraction-repulsion as they flew.  They were completely silent. There was a person walking close by when the craft were just overhead and I told him there were \"UFOs there\" and pointed up, but he purposely looked down, not wanting to be fooled.  Once the craft were out of sight, he looked up and not seeing anything he gave me a disapproving grunt like he knew there wasn't going to be anything! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142382.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c861e",
      "summary": "Unexplained bright light",
      "city": "amarillo",
      "shape": "circle",
      "date": "2018-08-31T00:00:00",
      "story": "Unexplained bright light I just. Happen to look at my security camera an seen this round Circle which looks like the moon but strangely one side of the.  Light. Was straight up an down it was missing it appears to come out.  From behind a triangular.  Shape cloud.  An gets very bright you see for your selves.  I cant explain it",
      "link": "http://www.nuforc.org/webreports/142/S142859.html",
      "state": "TX",
      "duration": "17 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c97eb",
      "summary": "Standing on back porch smoking a cigarette.  I noticed a bright or or Dick shape in the sky that hovered for about 5 minutes and than b",
      "city": "amarillo",
      "shape": "disk",
      "date": "2019-12-19T00:00:00",
      "story": "Standing on back porch smoking a cigarette.  I noticed a bright or or Dick shape in the sky that hovered for about 5 minutes and than bobbed up and down moving back and forth and after 10 minutes of that it was just gone.  No zoom no noting,  just disappeared from sight. I heard no sounds to make me think it was a craft that was man made.",
      "link": "http://www.nuforc.org/webreports/151/S151641.html",
      "state": "TX",
      "duration": "15 minutes"
    }
  ]
}