{
  "city": "anaheim",
  "fetch_timestamp": "2025-07-12T14:33:20.717665",
  "record_count": 75,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b48fa",
      "summary": "Objects form triangle shape over street in Anaheim",
      "city": "anaheim",
      "shape": "triangle",
      "date": "2019-07-25T00:00:00",
      "story": "Objects form triangle shape over street in Anaheim Going down Karelia ave there were 3 objects a smaller one at the top and 2 larger ones on the sides forming a triangle shape the lights were flickering bright yellow and were not far from the top of the telephone poles and the width the object formed was the width of the street and not flying fast just gliding down the street headed east",
      "link": "http://www.nuforc.org/webreports/147/S147604.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b669f",
      "summary": "Dear Petter i just wantted to take this oppertunity to thank you for the good work you are tryng to due with the UFO fanominon.",
      "city": "anaheim",
      "shape": "",
      "date": "2007-10-08T00:00:00",
      "story": "Dear Petter i just wantted to take this oppertunity to thank you for the good work you are tryng to due with the UFO fanominon, I few years ago I would listen to your nightly report on coast to coast am with Art Bell On KFI Radio Out of Los Angeles California, for the past two years we keep seeing your interveiw Repeat with Petter whats his name with ABC News, on The History Cable T.V. channel and The national Geographic Cable T.V. Channels,  Petter I just have one Question that has been on my mind for the past 5 years, Could some of these UFO's famnominon be comeing here,because The Earth is like a Desert Ossis in Space For Food and Water ? amd to evacuate there sewage waste they carry on board there Star Ships ??? I really due wonder about this??? This is a real brain teaser for me.  Again Petter I just wanted to write you to let you know that I admire what you are trying to due with exspoxing the UFO Fanominon real Reports From the The Dum ass hoax Reports ; and to let you know that some of us out here really admire what you are trying to accomplish with this UFO Fanominon      Best Wishes From Your Friend ((name deleted)) Anaheim Califoria  God bless you one and all ((NUFORC Note:  We are grateful for the kind words regarding our work here at NUFORC.  They go a LONG way in ufology, given that we live on a seemingly steady diet of ridicule, criticism, and out-and-out condemnation.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58658.html",
      "state": "CA",
      "duration": "none"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b31",
      "summary": "While Driving West bound on the 91 freeway around the State College exit. I thought I saw a falling star, but when they started to fly",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2008-02-14T00:00:00",
      "story": "While Driving West bound on the 91 freeway around the State College exit. I thought I saw a falling star, but when they started to fly in crazy directions I figured them to be UFO's. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61213.html",
      "state": "CA",
      "duration": "1 to 2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d60",
      "summary": "Smoke ring in sky, anaheim, ca 1/04/2008",
      "city": "anaheim",
      "shape": "circle",
      "date": "2008-01-21T00:00:00",
      "story": "Smoke ring in sky, anaheim, ca 1/04/2008 Driving southbound on the 5 freeway looking SW out of my passenger's side window of my vehicle I saw a circular, black, smoke ring in the sky.  The smoke ring was constant and not moving.  It was a partly cloudy day, no rain and no wind.  The object was just North of Angels Stadium.  I tried to take a picture with my camera phone, but the smoke ring wasn't in the photo, just a bright light.  I never saw the object change appearance, but I had to keep driving and lost sight of the object.",
      "link": "http://www.nuforc.org/webreports/060/S60684.html",
      "state": "CA",
      "duration": "constant"
    },
    {
      "_id": "64d005f478aba2ec5a3b76ec",
      "summary": "Facing west toward John Wayne Airport I observed two luminous objects flying above the light cloud cover at high altitude. Objects ente",
      "city": "anaheim",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "Facing west toward John Wayne Airport I observed two luminous objects flying above the light cloud cover at high altitude.  Objects entered from the north and quickly traversed the entire horizon before doing a looping maneuver and streaking back off to the north, and disappeared",
      "link": "http://www.nuforc.org/webreports/056/S56236.html",
      "state": "CA",
      "duration": "1min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d04",
      "summary": "((HOAX??))  I  saw a cigar shaped craft. I did not know if it was an alien craft.",
      "city": "anaheim",
      "shape": "cigar",
      "date": "2006-12-14T00:00:00",
      "story": "It was night the sky was clear there was nothing in the sky. I then saw a cigar shaped craft. I did not know if it was an alien craft or a new air craft made by the U.S.A because it was fallowed by a helicopter. The weird part was that the helicopter did not have any one inside it.  then the craft tried to land but it saw me I tried to take a picture of it but then it took of living me with a small burn on my hand. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  Witness elects to remain semi-anonymous.  Possible hoax, we believe.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53891.html",
      "state": "CA",
      "duration": "60 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b817c",
      "summary": "Ufo shooting smaller crafts from bigger Ufo",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2008-10-31T00:00:00",
      "story": "Ufo shooting smaller crafts from bigger Ufo Went outside to smoke a cigerette when I looked up at the sky. I saw a bright orange light that was too far away to see shape of ufo. The time was around 10pm at night and the light seemed to be moving side to side very rapidly. When I called my parents to see the strange light suddenly the ufo started shooting out red lights that started vanishig as soon as they appeared. Ounce the red lights stopped the orange light started to make its way upwards slowly until was gone from sight.",
      "link": "http://www.nuforc.org/webreports/065/S65939.html",
      "state": "CA",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b861a",
      "summary": "Looked up in the WNW sky and saw a light that was blinking white,green,and then red; object briefly moved and then stayed still.",
      "city": "anaheim",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Looked up in the WNW sky and saw a light that was blinking white,green,and then red; object briefly moved and then stayed still. Me and my friend were looking up into the sky when we saw a light in the WNW sky. The light grew bigger and smaller,blinked white,green,and red.It briefly moved and then stayed still for about 15 mins.",
      "link": "http://www.nuforc.org/webreports/072/S72512.html",
      "state": "CA",
      "duration": "30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b887f",
      "summary": "Flying disk over Anaheim Ca",
      "city": "anaheim",
      "shape": "disk",
      "date": "2009-03-19T00:00:00",
      "story": "Flying disk over Anaheim Ca I was walking out of a music venue in Anaheim by the I-5 with a friend, we were walking though the parking lot talking as I looked up I saw a round disk flying over our heads going East by North East. She looked up and saw it as well, the disk had lights on the edge and was spinning. It was about as high as a small plane would fly but made no noise",
      "link": "http://www.nuforc.org/webreports/068/S68075.html",
      "state": "CA",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a4e",
      "summary": "UFO over Disneyland.",
      "city": "anaheim",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "UFO over Disneyland. We were at Disneyland waiting in line to get in a ride, when I saw a light in the sky glowing with different colors and moving at a slow speed. After observing the object moving, it change directions at a 90 degrees and then stopped. Later the lights turned white and began to fade. Several people in line also saw the object, including my buddies but we decided not to comment about the incident.",
      "link": "http://www.nuforc.org/webreports/072/S72803.html",
      "state": "CA",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f8e",
      "summary": "Triangle shape U.F.O. flying by overhead",
      "city": "anaheim",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Triangle shape U.F.O. flying by overhead I was outside with some friends and cousins playing basketball, we stopped and were just standing around and talking. One of our friend starts talking something about Orion's belt and we were looking up. All of a sudden DIRECTLY above us we see these halo-like really dim white lights, it was three of them and they formed the shape of a triangle. It was about the height of helicopters flying around when there's news and chases and things of that nature. It made a weird \"hoovering?\" sound, its hard to explain really. We were all really surprised as it was flying relatively low. The skies were really clear and we only saw it for about 10 seconds just to where we were able to see it as the light were really dim and could not see it that far after it passed. This has been my very first sighting and I am very intrigued by what it could be. I did not manage to get any pictures of it as I did not have my cell on me and was very short in length, but there was 8 witnesses to this.",
      "link": "http://www.nuforc.org/webreports/068/S68379.html",
      "state": "CA",
      "duration": "10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8fa7",
      "summary": "Large fiery orange object seemed to come apart then turned and climbed in altitude and speed.",
      "city": "anaheim",
      "shape": "diamond",
      "date": "2009-12-12T00:00:00",
      "story": "Large fiery orange object seemed to come apart then turned and climbed in altitude and speed. On Friday, October 30th at around 10:20PM I was on my balcony smoking a cigarette when I noticed a very large light moving from the North-West to the South-East. What got my attention is that the light was larger than the normal flight traffic you get here between LAX and John Wayne airports. It was a deep orange color, no wing tip lights or other normal blinking marker lights. I watched for more than 5 minutes as it approached my location growing bigger, before I called to my son. My 19yo son commented that this was very definitely not our normal passenger air traffic, and that is very unsettling.  A few moments later the light made a turn to our left and headed do west out over the Pacific Ocean and gained altitude. Just at this moment it seemed to break apart or drip debris. Looked very much like burning embers falling from the object and fading as the fell. Both my son and I felt that this must have been a burning aircraft up until it turned and gained altitude as it headed out to sea.  We see a tremendous amount of air traffic (civilian and military) here as well as occasional launches from Vandenberg AFB. This was very definitely not either! Too big to be aircraft and missile launches generally produce a very white light. Waited to report until today as we assumed we would hear about it in the news today.  Last night was an almost full moon and exceedingly clear cloudless night. The altitudes and speeds  seemed consistent with general aviation, although the size and orange color were inconsistent as well as the turn towards the pacific and the debris falling. Total viewing time 10-12 minutes.",
      "link": "http://www.nuforc.org/webreports/073/S73097.html",
      "state": "CA",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8fc4",
      "summary": "3 multicolored lights in triangular formation hovering and then rising up.  It changed formation and moved on a curve several times.",
      "city": "anaheim",
      "shape": "formation",
      "date": "2010-02-14T00:00:00",
      "story": "3 multicolored lights in triangular formation hovering and then rising up.  It changed formation and moved on a curve several times. This is probably going to sound crazy, but I can’t explain what I saw tonight.  My husband saw it too, he thinks it was just a plane, but he can’t explain how the lights possibly looked if they were a plane. We went to Disneyland tonight.  We got off the Nightmare before Christmas ride and were walking back towards the lake when I saw 3 multicolored lights in the sky over the lake in triangular formation.  Disney normally has this light show over the lake, where they project lights and movies onto water fountains that shoot out of the lake.  I though the lights were something for the show, and I pointed them out to my husband and told him I wanted to see what they were doing for the light show. As we walked, the lights were moving slowly upwards.  I still thought they had to do with the show, until we got over next to the lake and no one was there because there was no light show.  We could still see the triangular formation moving up and to the right.  I asked my husband what it was, and he said it had to be a plane.  But the lights did not stay in one formation, they changed places.  I could tell because each one was a different color, and they switched as they moved. I kept telling my husband to look, and asking him what he thought it was, but he couldn’t answer.  He said it was a plane, then that it was too foggy to tell, but I know what I saw. The lights moved up and to the right, and finally, and turned to look at my husband and when I looked back they were gone.  I’ve thought it over 100 times, and I don’t know what it was. They did not move in a straight line, they changed formation, they were much closer to the park when I saw them than when they disappeared.  Even if there had been a light show it couldn’t have explained this.   I know it sounds completely crazy to say you saw a UFO at Disneyland, but I have no explanation for what I saw. I have photos, but they are long exposures and not very good, but you can see in the few shots that they are getting dimmer.  I could see them for probably about 2-3 minutes.",
      "link": "http://www.nuforc.org/webreports/073/S73788.html",
      "state": "CA",
      "duration": "1-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b93b5",
      "summary": "Flying Saucer Seen Cruising Over I-5 Near Anaheim Late at Night",
      "city": "anaheim",
      "shape": "disk",
      "date": "2010-04-13T00:00:00",
      "story": "Flying Saucer Seen Cruising Over I-5 Near Anaheim Late at Night A low-flying aircraft of a round, saucer-like shape was seen flying north alongside the I-5 south in Anaheim after midnight on Tuesday night as I was driving home to San Diego from Los Angeles. My peripheral vision picked up a low-flying airplane above the freeway, which caught my interest. As I looked to examine it, I noticed it was not an airplane but a darkly-colored (black or dark grey) saucer-shaped object that was moving at what seemed to be a low speed and at what seemed to be a low altitude. It was difficult to tell, as my car was moving past it at 70 mph in the opposite direction, but the craft appeared to be travelling somewhere between 40-70 mph, going north, and only a few hundred feet off the ground.  This would have made the object itself a bit smaller than an airplane, although it is too difficult to estimate a size. What was then even more interesting was a blue light that emitted from the side wall of the craft, moving in a circle around the ! craft, looking a bit like a reflection from a glass wall, but perhaps coming from within the craft. It was then that I really thought I'd seen a U.F.O. I had never seen one before, and I still have my doubts about this one.  The craft was spotted in a densely populated urban area, not far from Disneyland and many other world-famous entertainment spectacles, and it may simply have been coming from or going to one of those places.  But for the five seconds I had to witness it, the craft truly did not look human to me. Many more people saw the object I'm sure, and so I made this report to see if anyone else who saw it also was taken aback by its curiosities.",
      "link": "http://www.nuforc.org/webreports/074/S74619.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b5f",
      "summary": "Glowing Globe of Light",
      "city": "anaheim",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "Glowing Globe of Light i was going to my bed when i looked out the window and seen a large glowing globe out my window. at first it caught my eye as maybe an airplane as i do live near a military base. but the object lingered and it the glowing would get larger then it would go smaller then larger again.  i grabbed my camera and popped the screen out of my window to try to take some pictures. the object was present for around 15 minutes. i went thru my parents room to the balcony to get better pictures. i woke my dad up and told him he needed to see this object.  my dad thought it was just a helicopter and i told him no this doesnt look like any helicopter i have ever seen. he came outside and looked and he thought it looked kind of odd as well.  i showed the pictures i took to my husband who is in the military thru the computer and he had no idea what they were of and said i should do some research to find out what i was looking at.  please note the time on my camera is 1 hour ahead as i do not know how to change the time.",
      "link": "http://www.nuforc.org/webreports/068/S68793.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e3a",
      "summary": "Two spheres over Disneyland, 06-03-2010.",
      "city": "anaheim",
      "shape": "sphere",
      "date": "2010-06-10T00:00:00",
      "story": "two spheeres over disneyland 06-03-2010 two sightings one at two pm high altatude sphere.moving slowly wife witnessed pointed out to others. No com trail no altatude change, moved slower then other jets second during firworks bright light easly mistaken for a star until fireworks produced reflection on bottom.  Stayed for about 1 min. then slowly traveled west the fiteworks smok traveled east. Referance of movement was the castle in front of us.(spheere) alot of single helecopter trafic this day not sure if significant. First orb traveled west",
      "link": "http://www.nuforc.org/webreports/075/S75685.html",
      "state": "CA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba30d",
      "summary": "Triangular shape object with very faint, dimmed circles for gray light seen over Disneyland.",
      "city": "anaheim",
      "shape": "triangle",
      "date": "2009-05-12T00:00:00",
      "story": "Triangular shape object with very faint, dimmed circles for gray light seen over Disneyland. Witnessed a perfect sharp triangle shape flying object over Disneyland. We were waiting for the tram to take us to the parking lot when I've seen this flying object. I started shouting and pointed the object to my wife other people in line. No sound. 20-30% smaller than a 737 but similar speed to a 737 on approach to land 20 miles away from airport. The object had very faint, dimmed circles of gray light on both sides of the triangle towards the sharp angle. There were 5 circle on each side. The object was stealth like. I was able to see it at first because it blocked the light from a star and because it leveled its end with the front in its descend. Perfect weather conditions. The object moved from south-west to north-east.",
      "link": "http://www.nuforc.org/webreports/069/S69821.html",
      "state": "CA",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba4a5",
      "summary": "orbs fast dissapear",
      "city": "anaheim",
      "shape": "sphere",
      "date": "2009-05-12T00:00:00",
      "story": "orbs fast dissapear me and my friend were walking down the street from the store and we saw a orbish looking thing jet through the sky super fast then dissapear then the street light just started blinking red over and over then all the sudden minutes after a bunch of helicopters appear outta like nowhere idk what it was but i am scared and we had this weird feeling like if we were maybe imagining this but we werent it was one of the scariest thing that has ever happened to me",
      "link": "http://www.nuforc.org/webreports/069/S69891.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba958",
      "summary": "2 Orange Orb hovering the california sky.",
      "city": "anaheim",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "2 Orange Orb hovering the california sky. Driving home from anaheim to Diamond Bar see the halicopter take off from close air port and fly by the car, 1 minutes later i see the helicopter and 2 small air craft tracing 2 Orange Red color Oval object, thes 2 object moving up and down left and right in the extram high speed over the sky, when it moving it seem's have the tail whitch is like ocular spectrum one of the object seems can teleporting from the top of the sky to very button in 1 second, thes 2 object keep flying from south toward north every one driving on the free way was slow down try to see the event, it's been 2 years never see this kind of thing in my life. here is the post by other people: http://www.americanchronicle.com/articles/view/51263  here is the video i found on youtube shoot at same day in maxico, they looks like the same, only the video's object didnt move in fast speed  http://www.youtube.com/watch?v=ANuCiQNHVUg",
      "link": "http://www.nuforc.org/webreports/078/S78304.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba964",
      "summary": "Spinning top shaped craft photographed in california November 2008",
      "city": "anaheim",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "Spinning top shaped craft photographed in california November 2008 I was a British tourist photographing a night scene in Anaheim CA from a hotel balcony on convention way, I was trying to photograph 777 convention way the Hilton hotel main tower block.  As a amateur I took several photographs at different settings and on my return home I saved the best looking pictures to hard drive.  That was 2008.  I reviewed the picture earlier this year and found that the camera had captured a spinning top shape craft to the right of the main tower in two consecutive shots I have researched light aberration and photographic anomalies and found nothing to explain the pictures as having an ordinary known fault.   All I can conclude is something was in the sky that night. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77747.html",
      "state": "CA",
      "duration": "Five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bac30",
      "summary": "UFO over Anaheim CA, near midnight, circular with blue lights. Investigated by mysterous helicopter.",
      "city": "anaheim",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "UFO over Anaheim CA, near midnight, circular with blue lights. Investigated by mysterous helicopter. About 23:45 hours on above date I recieved a call from a family member.  The family member was hysterical about a supposed UFO near our location.  This family member indicated that there was a UFO hovering over a major hotel in the area, that dozens of people had pulled over to watch it and that it showed no sign of leaving.  Myself and two other family members quickly got into a vehicle and drove to the location they were at.  While we were in transit, we saw a strange helicopter approach the area and alternatingly hover and search. This helicopter had the apparent length of a CH-47 military helicopter, but was unidentifiable due to lack of lighting.  It had none of the regular blinking red lights, but had alternatingly green, orange, and blue bright lights flashing in a regular pattern.  It appeared to have some sort of attached storage device under it, cube or rectangular shaped. The light configuration and storage construct was unlike anything I had seen before.  The altitude of the helicopter was about 75 meters.  The helicopter was there from about the time I recieved the call (possibly earlier) and bugged out at approx. 0010 hours in a N/NW direction. We approached the location my family member gave me and parked alongside 9 other vehicles, each with 2-5 people in them all looking in the same direction.  We personally were unable to see the UFO as it left minutes before we arrived.  We stayed for about 45 minutes and it did not reappear. The family member that called me took video on her cellphone and upon getting home, we loooked online and there was already one other video of the event posted. On a perhaps unrelated note, a cell phone in the house at 2232 hours experienced service interruption and emitted an electronic tone I have never heard before.  The tone sounded like the hybrid tone of a dial up phone, but without the tempo or form associated with that normal tone. The cell phone video my family member took is available if needed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78286.html",
      "state": "CA",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3baec9",
      "summary": "Low flying, triangular shaped, series of dimly lit orange lights",
      "city": "anaheim",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "Low flying, triangular shaped, series of dimly lit orange lights Six (6) dimly lit, orange lights in the formation of a triangle made up the object. Three (3) lights making up the outer corners of the triangle were accompanied by three (3) more lights, making a smaller triangle in the middle of the first. (Refer to the corners of a \"triforce\" to better grasp this concept.) It appeared that all the lights were connected to the same craft, as opposed to the lights being their each individual entities, because as the object moved through the sky, the lights remained equidistant to each other. he rest of the craft, aside from the lights, was a dense dark shade of black. The only way it was possible to make out the shape of the craft, was seeing how it blocked out the stars as it passed through the sky. Besides that, the craft was relatively invisible in contrast with the black sky. It flew through the area quite low, such as if you were in the proximity of an airport with the planes flying over you to land. The biggest shock of all, when comparing this object to a low flying aircraft, was the absolute absence of any and all noise. No engine noise, no sonic boom. The craft moved in pure silence. The object passed through the sky heading heading Westbound. We first saw the object in the horizon of the Eastern sky, towards Yorba Linda.  We watched it come straight towards us, and just as it had nearly reached our location, it began to alter it's course. It bent to it's ride side and headed North-West towards Fullerton.  The time it took for it to get from the Eastern horizon, across the sky, and out of sight to the North-West was about 20 seconds.",
      "link": "http://www.nuforc.org/webreports/079/S79079.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb508",
      "summary": "three lighted triangular object",
      "city": "anaheim",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "three lighted triangular object there appeared to be a triangular object with 3 orangish/white lights at each of the angles that flew across the sky in a northeasterly direction and was gone within 5 seconds.   The object made a very low humming noise and was at the lower cloud covering (approx 10 K feet).",
      "link": "http://www.nuforc.org/webreports/079/S79388.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4f8",
      "summary": "Cross-like UFO off 91 freeway in Anaheim, CA.",
      "city": "anaheim",
      "shape": "cross",
      "date": "2010-08-24T00:00:00",
      "story": "Cross-like UFO off 91 freeway in Anaheim, CA. One cross shape object hovering about 200 ft in the air off the side of the 91 Freeway in Anaheim.  The object did not move but emitted three lights at different intervals and in different patterns. On first sight, red lights did a wave like motion parallel to the ground for about 5 minutes then proceeded to flash red and white lights in a horizontal direction, red and white back and forth for another 5 minutes.  A small greenish light then appeared at the center of the object.  The red and white lights at this time began to flash red horizontally and white vertically in a cross-like pattern.  A brighter light at the top of the object shone onto the top half of the object, it wasn't metallic or shiny in appearance but was of greyish color. The object, after about 15 minutes of remaining in the same position, slowly descended into the sky and continued the blinking and flashing patterns.",
      "link": "http://www.nuforc.org/webreports/077/S77073.html",
      "state": "CA",
      "duration": "23 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfa3",
      "summary": "I saw a light object in the sky streaking very fast, then it faded away quick.",
      "city": "anaheim",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "I saw a light object in the sky  streaking very fast then it faded away quick I was driving on the 5fwy north just passing Disneyland.  I saw a light object in the sky it looked like a dot streaking very fast then it faded away quick.  I viewed it in the sky it was clear. It was moving from top right of my front window view to the bottom left view of my front window.  Never seen anything like it before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85753.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc316",
      "summary": "Three lights flying in triangular formation but did not move in a way that could have been a simple military formation.",
      "city": "anaheim",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Three lights flying in triangular formation but did not move in a way that could have been a simple military formation. Three lights that looked like stars flying in a triangular formation.  Seen at Disneyland, CA.  Youngest son (5) noticed them first.  Could have been a military formation, but moved unusually. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84292.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bc613",
      "summary": "We were fishing in Anaheim, CA, on July 23, 2011, when we saw a large triangle UFO fly overhead",
      "city": "anaheim",
      "shape": "triangle",
      "date": "2011-08-21T00:00:00",
      "story": "We were fishing in Anaheim, CA on July 23, 2011 when we saw a large triangle UFO fly overhead While we were fishing as a local private lake my husband notices an odd dimly light triangle shape object coming out direction traveling in a south/west direction. He turned to me and told me to look at it to make sure he was really seeing what we both believe to be a UFO. It was traveling at a steady pace at about 70-80 miles per hour at about 1/4 to 1/2 mile up. It was very clearly a triangle shape and had very define points to it. We were both very baffled as to how something that shape could be flying in the night sky. The sky was free from and clouds and it was very clear out. As it passed by it blocked the view of the stars so we knew we were looking as a solid object. It was a very surreal feeling to be looking at this object. It kind of scared me a bit as well. Being a very logical person I was going through things it might be in my head as I was analyzing it as it flew over. There was nothing that I could logically say it resembled that I have ever ! seen and I have seen many tv programs in military aircrafts and prototypes and this looked nothing like anything I have ever seen in my life. I would say the size would be in proportion with a 747 jet. It had 3 very dim square light at each triangle point. The lights were a white glow similar to a florescent bulb and they were casting a glow in between each light showing the triangle shape. As it flew over we noticed that there was no sound what so ever and as it passed us we could see the back of it as it glided over us. It was perfectly flying it a straight line and parallel to the sky. It never pivoted of veered off course. After it passed by we got a very good view of the back of the craft. It was a flat dark surface about 15 to 20 ft high. We continued to watch it until it was out of sight. I have to say that was a very eerie feeling and I will never forget what I saw that night.",
      "link": "http://www.nuforc.org/webreports/083/S83048.html",
      "state": "CA",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd272",
      "summary": "Bright Copper color light moving over Anaheim CA sky",
      "city": "anaheim",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Bright Copper color light moving over Anaheim CA sky Object came out of nowhere into the same path as other aircraft traffic, at first it moved towards us like an aircraft but then the color of the UFOs lights did not match those of an aircraft. It had a copper color to it and was very bright in color!    At first it moved like an aircraft but it did not match any shape to any type of aircraft.   The object moved in the sky, but then it came to a stop and started to hover at that same time it proceeded to move up like an elevator would.   I am more then positive it was not a helicopter because the altitude of the aircraft was just too high. And living in the city of Anaheim I can say, \"I've seen my share of helicopters!\"    Then its lights then started to dim in the same sense as a flame would do when struck with air.  It did that for about a minute disappearing and then reappearing while moving just a little to the side, before completely disappearing",
      "link": "http://www.nuforc.org/webreports/093/S93097.html",
      "state": "CA",
      "duration": "about 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7d2",
      "summary": "UFO seen flying over Disneyland during fireworks show.",
      "city": "anaheim",
      "shape": "disk",
      "date": "2012-07-04T00:00:00",
      "story": "UFO seen flying over Disneyland during fireworks show. I was visiting California for my little sister's graduation. My family and I went to Disneyland after her graduation.  The UFO was seen in the evening at Sleeping Beauty's Castle during the end of the night fireworks show.  During the middle of the fireworks show, my family and I, along with the hundreds of people at Disney, noticed a shape approaching the castle coming from the West.  The shape became evident that it was in the shape of a saucer as it flew closer to the castle.  Hundreds of eye witnesses and myself became very quiet as it flew over us.  My best guess is it was maybe 500 ft above us as we could all see it was silver, metallic and it had a series of lights on the underside of the craft that spiraled in a counter-clockwise direction.  The craft never made a sound as it flew over us.  The flight pattern was smooth and linear.  The craft never stopped.  It continued to fly through the fireworks, over the castle and onto the horizon. I tried to video tape! it with my little digital camera; however, all you could see was the lights swirling in the counter-clockwise direction and could not quite make out the shape of the craft because it was too dark.  I remember listening to a bunch of the surrounding people whispering and asking if that was a UFO as it approached the castle.  There is no doubt in my mind that what we saw was not an airplane, helicopter or any other flying craft we typically see in the sky.",
      "link": "http://www.nuforc.org/webreports/090/S90313.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdab8",
      "summary": "Red light in sky dropping flares",
      "city": "anaheim",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Red light in sky dropping flares I was driving home from work approx at 11:55 pm on the 91 fwy westbound and as I was exiting the fwy  to my left I noticed a red light in the sky.   I thought it was a airplane or a helicopter.  It was distant, like a few cities away.    As I was pulling into my house I noticed it much more brighter.  I live in Anaheim and this light had to be hoovering over Orange, Santa Ana area.   I kept staring at it because it was still so at first I thought it was a star but too red to be a star so then I thought it was a helicopter and red lights were on.    Then I was getting off the car, still looking at it and I then seen something that looked like red flares dropping down from it.   I stayed frozen looking at it and the first thought that came to me is that its some type of aircraft with a bomb or something.   I started shaking cause I was so scared but came in my house and told my 12 yr daughter to come outside with me, that I wanted her to see something in the sky.   She rushed outside with me and it was no longer there.  I looked all around in the sky but there was nothing that looked like what I seen.  I would say that the duration since the time I noticed it and the last I saw it was about 3 minutes.",
      "link": "http://www.nuforc.org/webreports/092/S92658.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdcaa",
      "summary": "We were at Disneyland walking around and I noticed a round orange sphere/UFO moving very slow in the sky.  It was an odd orange color w",
      "city": "anaheim",
      "shape": "circle",
      "date": "2012-07-04T00:00:00",
      "story": "We were at Disneyland walking around and I noticed a round orange sphere/UFO moving very slow in the sky.  It was an odd orange color which caught my attention so I told my wife to look up.  She saw it too and shortly afterward about 1 minute of watching it around 5 smaller orange balls dropped from the sphere/UFO.  It was crazy...  It dropped these balls in a perfect straight line.  The sphere continued to move north east and appeared to pulse and finally disappeared.",
      "link": "http://www.nuforc.org/webreports/090/S90044.html",
      "state": "CA",
      "duration": "2 -3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be30c",
      "summary": "First sighting 1963 disk shaped 50 foot diameter, no noise and was stable when stopped over my head.",
      "city": "anaheim",
      "shape": "disk",
      "date": "",
      "story": "First sighting 1963 disk shaped 50 foot diameter, no noise and was stable when stopped over my head. Peter,  I just caught the end of your interview on coast to coast last night but I have herd you before. My question is do you have any interest in old reports?   I had an encounter in 1963 with my brother and the next door neighbor, I was eight at the time but still remember it rather well.   I also have a sighting five years ago with two disk and I know a man locally with a sighting. The one with the local man here is interesting to me anyway, he is now into refrigeration repair on businesses.  This story was told to me while we were having lunch together and we got to talking about jobs we had.  He had a small aircraft parts delivery business and mentioned he was a security officer at Malstrom AFB just north of us here in Great Falls Montana when he got out of High School.   The interesting part was I asked him about his time there and one thing lead to another.  His job was to watch over the nukes, he was called out to investigate a alarm.  When he showed up with his partner they noticed a glowing 10 foot diameter object over the concrete top on the missile.  They watched it for 20 minutes when it moved toward town, he said they could keep up with it till it got to the other side of town.  He them radioed in and two jets were sent and he could still see the craft when the jets went bye with after burners on.  He was later told to be quite about it but was told ! the craft was clocked at 4000 MPH when lost over Belt Montana.  He is a rather religious guy and when I asked him if he thought there were alien he said that stuff is B.S.  He did tell me he thought they were Russian crafts because this happen in the 1970's and the Russian's were watching us.  ((name deleted))",
      "link": "http://www.nuforc.org/webreports/087/S87904.html",
      "state": "CA",
      "duration": "20 min +"
    },
    {
      "_id": "64d005f478aba2ec5a3be54f",
      "summary": "Yellow glowing object that shone like a star but distinct from either stars , human craft, meteor",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2012-03-13T00:00:00",
      "story": "Yellow glowing object that shone like a star but distinct from either stars , human craft, meteor I witnessed an yellow glowing object which ejected a red object as it gradually dissappeared into space.  It appered to be a large bright yellow object which caused some kind of electrical interferance with my tv signal of which i only became aware of its cause by walking outside and looking skyward and observing this glowing object on the evening of feb 14 2012 around 7 to 7:20 pm.   I am sure it was neither a star or human craft but perhaps some unknown object yet to be if ever determined",
      "link": "http://www.nuforc.org/webreports/087/S87199.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed4f",
      "summary": "Falling star, south of me, moments later saw a sphere floating towards me from the direction of where the falling star would have land",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Falling star, south of me, moments later saw a sphere floating towards me from the direction of where the falling star would have land I was driving south bound on the 57 freeway in Fullerton CA, and I saw what looked like a falling star or meteor, south of me to where I was driving, but this one was red, or fire color.  Moments later I saw a red orange sphere floating over the free way from the direction where the meteor would have fallen.  I was driving southbound, the object was floating northbound, pretty quickly, and then I lost sight of it. I saw it for maybe 10 seconds.  I thought chinese lantern but, this thing was floating or flying pretty quick. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100579.html",
      "state": "CA",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6f5",
      "summary": "Silent, hovering, orange light at about 500 ft and about 1oo yds away.and disappeared in an instant.",
      "city": "anaheim",
      "shape": "unknown",
      "date": "2013-06-02T00:00:00",
      "story": "Silent, hovering, orange light at about 500 ft and about 1oo yds away.and disappeared in an instant. A yellow-orange light moved slowly from north to south and hovered just west of us as we watched the fireworks at Disneyland.  We were about three blocks west of Disneyland. There was no sound as it moved south.  The fireworks was very noisy.  As the show ended and as everyone reentered the house, I remained outside to observe the orange light.  It was about a football field west of me.  Silent and totally motionless. After about three minutes the light went out and it was gone. The color of the light, not ordinary aircraft lights and the absence of any sound I found interesting. It was not a helicopter but what else can hover that long without any sound?",
      "link": "http://www.nuforc.org/webreports/098/S98230.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7b5",
      "summary": "Ball of multicolored light in sky",
      "city": "anaheim",
      "shape": "sphere",
      "date": "2012-12-20T00:00:00",
      "story": "ball of multicolored light in sky Thursday night 11:00 P.M. Anaheim, Ca looking south from Ball/Euclid my girlfriend and I looked up to see a flash of blue flickering light up in the sky.  It was a ball of light about 1000 feet up.  At first we thought lightning or a helicopter, but it pulsated dripping /molten colors of blue, then went to red, white, yellow, orange and purples.  It stopped flashing after approx 2 minutes.  When it stopped it went dark, although still kind of shimmering.  We could see the shape of this sphere like little flecks of 'fireflies' barely visible.  We looked around the sky and noticed about 10 other of these spheres lined up in a line right above it looking the same.  After about 4 minutes, this sphere rose up in the sky above all of these other spheres quickly but not very far (about 2 seconds).  Then another ball off to the right started flashing different colors of blue for about 30 seconds.  All of these spheres remained silent and in-formation.  We watched for about 15! minutes, nothing else was happening but these balls were still in the sky.  We left, they were still present. It's difficult to say how large or how far away they were, probably 1 to 2 miles away and larger than a hot air balloon.  I've never seen anything like this before,  I wish I had a video camera to record it.  Anyone looking up in the sky paying attention would have seen this!",
      "link": "http://www.nuforc.org/webreports/094/S94805.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc45",
      "summary": "A bright star-like white light suddenly appeared around 8 a.m., a dark shaft appeared hanging down from it, then vanished.",
      "city": "anaheim",
      "shape": "light",
      "date": "2013-07-22T00:00:00",
      "story": "A bright star-like white light suddenly appeared around 8 a.m., a dark shaft appeared hanging down from it, then vanished. I was facing N. in the east Anaheim area. In what seemed to be in the far N. (Simi Valley?) area, at high altitude in a clear sky with low-lying clouds (not far from sunrise) I was watching the sky and a bright white star like light appeared, as if Mars times 10 in brightness. It seemed to move slightly south before a dark rod appeared to hang down from it, about 7 times the height of the star-form, then abruptly vanished.",
      "link": "http://www.nuforc.org/webreports/100/S100218.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ccc",
      "summary": "Helicopter chasing ball of light.",
      "city": "anaheim",
      "shape": "sphere",
      "date": "2014-03-18T00:00:00",
      "story": "Helicopter chasing ball of light. Anaheim, CA- Wed evening March 12, 2014 approx 7:30 pm, while sitting in the backyard looking south toward Katella Ave, I saw a bright-white star-like orb being followed or chased by a helicopter.  They both were travelling from west to east about 80 mph fast, straight and horizontal about 300 feet up.  They were travelling parallel to Katella Ave from about Beach Blvd. vicinity when I first noticed.   I ran and got my binoculars and watched as they passed in front of me.  The copter was close to it, maybe 75 feet behind and slightly above it about 30 degrees.  I could see the copter.  I could see the orb light, there was not a craft attached to it,  just a bright sphere of light.  The orb appeared to be no larger than the cockpit of the copter.   As they continued on fast, straight and horizontal, the orb faded out around Harbor Blvd vicinity.  The copter kept going.   5 minutes later 2 loud military type helicopters flew by along the same path.  There were many helicopters heard that night, but I did not see any more strange flying lights.  This orb was self-illuminated and looked like a flying ball of light, not like an aircraft with a fuselage of any sort.",
      "link": "http://www.nuforc.org/webreports/107/S107872.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1acb",
      "summary": "Star light in the sky.",
      "city": "anaheim",
      "shape": "light",
      "date": "2014-07-11T00:00:00",
      "story": "Star light in the sky The object looked like a semi-bright star in the south east sky. The color of the object matched the color of the night stars.   At first, I thought the object to be a star, it did not move in the night's sky.  Looking away for a couple minutes, I looked back, and the object was gone.   I do not believe the object was a plane.  I am leaning more toward the object was of Earth, not alien. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111289.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c210f",
      "summary": "Manuevering Fireballs in the Sky in Souther California",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2014-05-08T00:00:00",
      "story": "Manuevering Fireballs in the Sky in Souther California We were in the car coming to a stop light when we looked up and 3 round almost looked like fireballs or pieces of burning debris moving smooth and calm through the sky.  I got my phone out and recorded about a minute of it.  We pulled away passing them and a fourth one appeared behind by itself.  They were weird looking and other people in cars next to us were also looking and taking pictures.  I thought that they were Chinese lanterns maybe, but these things were flying pretty low and they were not Chinese lanterns.  I only say that because of the pulsating and they way they were flying the same direction sometimes even lining up.",
      "link": "http://www.nuforc.org/webreports/109/S109173.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29f5",
      "summary": "I have an encounter for second time in a week, with a Disk giant that was flying in the sealing of the building with another like big l",
      "city": "anaheim",
      "shape": "disk",
      "date": "2014-09-25T00:00:00",
      "story": "I have an encounter for second time in a week, with a disk giant that was flying in the ceiling of the building, with another like big light triangle shapes with three lights green,white,yellow. I was in my bedroom opening the window to let fresh air come inside the room, suddenly i noticed the presence of the big object outside my window.  The size a little more bigger than a car.   Didn't do any noise and was like trying to hide in the palms.  But in the day i have seen it also white and dark objects.  The object moves slow and disappears in seconds. I don't used to believe in this things and i have now nightmares, I talk to my neighbor and show her the same night about the strange lights in the sky and absolute this things are not regular planes. I will like to please the authorities to come around 10:30pm or 11:00pm at night to verify this objects that are flying so close of the houses and apartments.",
      "link": "http://www.nuforc.org/webreports/113/S113686.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c2afc",
      "summary": "Bright, Fast, and Red.",
      "city": "anaheim",
      "shape": "oval",
      "date": "2014-11-14T00:00:00",
      "story": "Bright, Fast, and Red. Opened the front door, saw a very bring red light going up into the sky and disappeared in a matter of seconds.  Was traveling very fast.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115205.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2cc9",
      "summary": "Egg-shaped object hovering 3 feet off ground.  Dark blue with rose/pink pulsaing interior light.",
      "city": "anaheim",
      "shape": "egg",
      "date": "2014-09-18T00:00:00",
      "story": "egg shaped object hovering 3 feet off ground.  Dark blue with rose/pink pulsaing interior light. On Saturday September 13, 2014, at 11:15 PM on the 1500 block of West Embassy Street in Anaheim California 92802 (the cross street is Loara 1 block south of Lincoln Avenue).   I observed the following:  In the middle of the street (Embassy Avenue) I saw an egg shaped object floating 2-3 feet off the ground.  The object was about 2 ½ feet across and it was approximately 20 feet away from me.  It was a dark blue like an India ink blue and it blended into the night and the black asphalt.  The only illumination was from a street light.  I first thought it might have been a helium balloon that had drifted from Disneyland.  Disneyland is about 2 miles away and sometimes helium balloons float away and they land in the area.  Upon close inspection it had no string attached to it and it stayed in the same position.  It never touched the ground. As I approached the object I could see that the “balloon” had a thin semi-transparent membrane covering it.  Inside the object I could see a faint rose/pink colored light that was the size of a football and the light slowly pulsated.  It was a faint light.  Not bright.  And it was inside the object.  The object was smooth and it looked like latex.  Not metallic.  It had no antenna, fins nor propeller.  And it had no exterior lights. As I walked towards the object it remained in place about 3 feet off the ground.  My first impression was that it may be a balloon, drone or remote controlled object.  But it made no sound.  The object was totally silent.  It seemed peaceful and tranquil.  Not threatening. As I walked toward it (I did not run or make any fast moves), I thought I would try to capture it but when I got within about 2 feet from the object it slowly rose out of my reach straight up into the night sky.  It banked to the north and went over the buildings across the street and out of sight.  Its motion was smooth and not fast.  I never touched it. I did not experience any adverse reaction from it.  In fact it seemed inviting and almost playful.  I regret I did not have a camera with me to photograph it.   I was alone and no one else to my knowledge saw the object.",
      "link": "http://www.nuforc.org/webreports/113/S113612.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e04",
      "summary": "A UFO with 3 alternating red, and 3 white, lights flashing, floated across sky then vanished.",
      "city": "anaheim",
      "shape": "unknown",
      "date": "2014-09-18T00:00:00",
      "story": "A UFO with 3 alternating red, and 3 white, lights flashing, floated across sky then vanished. On 09/16/2014, at 14:24 local time, in Anaheim, California, I had gone out onto my 2nd floor apartment balcony.  Just after exiting the front entry door, I looked up to check for any wasp nests under the overhang from the roofline edge. At that moment, I immediately noticed an object hovering in the clear open sky, past the roof of the apartments, opposite my own.  The object shape was sort of fuzzy and hard to make out, but it was silent, and flashed 3 red lights, then 3 white lights.  The object looked close enough to have made a sound, if it had been a helicopter.   The object very slowly floated off to my right (in an Easterly direction), and got gradually farther away, but I could still clearly see the alternating lights flashing, red then white, red then white...    After about one minute of watching the object, a dragonfly insect flew close to where I stood on my balcony, and for a brief second distracted me from the object.  When I looked back at where the object should have been, there was no lights or sign of the ufo anymore - as if it had 'blinked off' or simply just vanished.   I watched the sky for half a minute more, but there was nothing at all to seen in the blue, above me.",
      "link": "http://www.nuforc.org/webreports/113/S113611.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c34fd",
      "summary": "Multiple fiery lights seen in the western sky moving at a slow speed, then eventually disappearing.",
      "city": "anaheim",
      "shape": "light",
      "date": "2015-03-06T00:00:00",
      "story": "Multiple fiery lights seen in the western sky moving at a slow speed, then eventually disappearing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117511.html",
      "state": "CA",
      "duration": "~3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c37f2",
      "summary": "Many silver spheres.",
      "city": "anaheim",
      "shape": "sphere",
      "date": "2015-01-07T00:00:00",
      "story": "Many silver spheres Around 50 silver spheres flying in circles and also forming shapes, seems they were protecting something.  We saw the spheres 50 meters about Walmart on Euclid Ave.  So many, that we got scared.",
      "link": "http://www.nuforc.org/webreports/116/S116185.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3940",
      "summary": "That it was big and a different shape that disappeared before our eyes.  ((NUFORC Note:  Atlas V missile launch.  PD))",
      "city": "anaheim",
      "shape": "chevron",
      "date": "2014-12-18T00:00:00",
      "story": "That it was big and a different shape that disappeared before our eyes. At around  19:00 hours, on the 12th day of the 12th month, in 2014. Myself and a girlfriend of mine were driving to the store, In the city of Anaheim CA.  I happened to look up in the sky, to my right.  As I was sitting passenger, I noticed something that looked as it were flying, across the sky.but what caught my eye was that it looked as if it had a magnetic field in the front of it.  It was crescent shaped as it got closer, a white light was noticed rite behind the magnetic field.  We pulled to the side of the road . We exited car, and proceeded to stare at it, as it flew over , and soon passed us.  As it got further away, the light began to dim.  And rite before our eyes the object, flickered and went completely out. We got back into vehicle, and  continued on our way. ((NUFORC Note:  Atlas V missile launch from Vandenberg AFB at 19:19 hrs. (PST)  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116030.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3bbd",
      "summary": "I was looking at the starsjupiter and venus through my binoculars when a redand blue coned shape object appeard heading south i could n",
      "city": "anaheim",
      "shape": "other",
      "date": "2015-07-23T00:00:00",
      "story": "i was looking at the stars jupiter and venus through my binoculars when a red and blue coned shape object appeard heading south i could not belive what i saw and looked again only to see the same object moving through the sky again i got the impression that it was alive it moved like a huge jelly fish in the air and it moved as it was in water  it had sringy ending like a jelly fish .  i yelled to my friend to come and see, but by the time he got their it was gone.   for many days after this incident i felt sad like you do when your homesicf.???????????????????????????????????????????????    I am retired from health care/ human services .",
      "link": "http://www.nuforc.org/webreports/120/S120511.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c54",
      "summary": "Spinning lights completely disappear in Orange County.",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2015-07-17T00:00:00",
      "story": "Spinning lights completely disappear in Orange County. My friend pointed something out, it was so weird because it happened so fast.  I saw something spin and by the second spin, the lights disappeared.   I was in total shock, never in my life have I seen anything close to looking like this.  It scared the hell out of my friend, too. ((NUFORC Note:  We have changed the time and date above, to reflect a nighttime sighting.  However, the source of the report elects to remain totally anonymous, and provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120307.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e7e",
      "summary": "My wife and I saw what by all appearances was a UFO at Disneyland on the night of June 4th 2015.",
      "city": "anaheim",
      "shape": "oval",
      "date": "2015-06-15T00:00:00",
      "story": "My wife and I saw what by all appearances was a UFO at Disneyland on the night of June 4th 2015. My wife and I were at Disneyland on the night of June 4th 2015.  We were sitting on a low railing around a planter, waiting for the 11:00 pm light parade to start.  It was approximately 10:45 pm.  We were directly in front of the \"Great Moments with Mr. Lincoln\" building, facing west toward the circle that is the beginning of Main Street.  A man sitting to my right on the same railing got my attention by saying to me (while he was looking to the sky directly above the circle), \"Are you seeing the same thing I'm seeing, or am I going crazy?\"   I followed his line of sight and observed what I at first glance appeared to be a giant dark smoke ring at cloud level (approximately 2000 feet).  I answered him, and said, \"No, you're not crazy I see it.\"   I then said, \"What is that?\"  He then said (as neither one of us took our eyes off of the object), \"I don't know, that's what I'm trying to figure out.\"  At that time, my wife (sitting to my left on the same railing ) said to me what are you looking at, looked in the same direction and observed the same thing, she then asked me what it was. I told her I did not know.  Clearly this was not a smoke ring of any kind because by this time (by which a couple of minutes had passed), if it had been a smoke ring, it would have dissipated.   Upon further observation, this was an object partially obscured by being at just the bottom level of the cloud layer.  As if it were using the clouds to camouflage itself.  This object appeared to have a slight oval shape.  And I would approximate it to be (at being 2000 feet above us) about 300 yards long and 250 yards wide.  As we watched it began very slowly move due north (towards Cinderella's castle ).  I would estimate its speed at no more the 30 mph.  The object traveled a distance equivalent of about six times its length and slowly disappeared upwards at that point, the clouds around it envelopeing it until it was out of sight.   I remember as the object moved slowly through the clouds you could see the clouds billowing around the leading edge of the object.  It emitted no sound that I could detect and hid so well in the clouds that you could only see its dark silhouette, the front of the object having a darker appearance than the rest of the  silhouette, giving it an almost transparent appearance.  At about the same time the object started moving, my wife and I stood up and walked five feet forward to the curb of the street to get a better look at the object, and we remained there till it was gone from sight.  I did not get the other man's phone number as I should have, but after I acknowledged that I did see the object he showed no interest in talking about what we had seen, and when the parade was over, he walked away into the crowd of people.  So unless someone else happened to see this and comes forward with what they saw, it's just the corroboration of my wife and me, and we will not deny what we saw.   I did take photos of the object that are difficult to make out because you are looking at an object obscured by clouds at night.  Although in one of the shots you can make out the leading and trailing edges of the craft.",
      "link": "http://www.nuforc.org/webreports/119/S119366.html",
      "state": "CA",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4132",
      "summary": "Light in the sky.",
      "city": "anaheim",
      "shape": "light",
      "date": "2015-05-08T00:00:00",
      "story": "The City of Anaheim had its annual Cinco de Mayo fair so I went with my friends, we left to go to the packing house (Food Court by city hall) on our way out my friends and I decided to go get ice cream.   While we were walking to the car we stop in the middle of the parking talking about snow station (the ice cream parlor) they had their backs towards the parking lot, I was facing the parking lot.    My friends were having their own conversation so I dozed off, I looked up into the sky and I saw this bright dot of light in the sky, I assumed it was a star, but then the light dashed across the sky and disappeared.   Later on, I started think about the strange light I kept trying to make my self believe it was a star but I live in the city I rarely see stars in the sky, and if it was a shooting star it would burn out but it didn't.  It just whe straight and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118790.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4289",
      "summary": "There where strange colored lights in the sky flashing quickly.",
      "city": "anaheim",
      "shape": "light",
      "date": "2015-04-23T00:00:00",
      "story": "There where strange colored lights in the sky flashing quickly. I was inside my apt when my sister-in-law called me outside cause she seen lights I got my phone camera and recorded blue, red, and green light flashing, started off slow and then fast like lightning. ((NUFORC Note:  Video clip indicates diffuse, flashing light, which cycles from blue, to red, and perhaps to green.  We do not know whether the display is related to UFO activity.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118550.html",
      "state": "CA",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4346",
      "summary": "At 9pm a bright fuzzy purple light in the sky caught my attention. It was flying directly towards me,  after about 30 seconds it stoppe",
      "city": "anaheim",
      "shape": "",
      "date": "2015-11-19T00:00:00",
      "story": "At 9pm, a bright fuzzy purple light in the sky caught my attention.  It was flying directly towards me,  after about 30 seconds it stopped and hovered.   Then it flew directly sideways towards the east.  It stopped again and hovered then dropped down behind a row of buildings.   A few seconds later it shot straight up into the sky and disappeared.   I did snap two pictures of the object on my camera phone.",
      "link": "http://www.nuforc.org/webreports/123/S123534.html",
      "state": "",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4384",
      "summary": "Strange bright light on the sky that left a green trail that later disappeared.  ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "anaheim",
      "shape": "circle",
      "date": "2015-11-19T00:00:00",
      "story": "Strange bright light on the sky that left a green trail that later disappeared. ((NUFORC Note:  US Navy missile launch.  PD)) I was sitting on a couch outside my house when a suddenly saw a bright light appear.  I was surprised by the brightness of the light I noticed that it was not a helicopter nor a plane.  As the light slowly cruised on the sky moving from left to right, the light diminished slowly and the light turned off but could still see the circular ufo. The light kept ongoing and the distance I saw the light that was once shining to the right was shining down.  Another thing that really surprised me was that it left a green trail that later disappeared, it kind of looked like an aurora but in Southern California??  This is the weirdest situation I've ever experienced in my life and hope I'm not the only one who saw this.",
      "link": "http://www.nuforc.org/webreports/123/S123667.html",
      "state": "CA",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c46a7",
      "summary": "Solid Green lights then Solid Red zig zagging across the sky.",
      "city": "anaheim",
      "shape": "light",
      "date": "2015-10-29T00:00:00",
      "story": "Solid Green lights then Solid Red zig zagging across the sky At about 7:00 I saw 2 bright solid green lights about 10 miles out in the south sky.  Being an ex-pilot I thought it was weird because usually a plane will have a red light and  green.  Ex. (red right returning) this didn’t.  I kept my eye on it and all of a sudden the lights turned a solid red and streaked towards me at a tremendous speed and stopped about 2 miles away.  It then turned to Green and hovered.  Then a solid Red light and streaked west about a mile and hovered.  Now I cant remember what lights were showing but it was either a solid red or green.  Then it streaked east about another 7-10 miles and hovered.  Then back west about 3 miles and finally started moving away and lowering its altitude until it moved below a tree line from my house.  This was silent and very swift.  We have fighter jets that fly over our house at times and these are not even as swift as these lights were.",
      "link": "http://www.nuforc.org/webreports/123/S123027.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c47fe",
      "summary": "We saw a cylinder shaped blue light moving slowly towards the south east.",
      "city": "anaheim",
      "shape": "light",
      "date": "2015-11-12T00:00:00",
      "story": "We saw a cylinder shaped blue light moving slowly towards the south east. ((NUFORC Note:  US Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123729.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4cdb",
      "summary": "White orb flying over Anaheim, CA",
      "city": "anaheim",
      "shape": "light",
      "date": "2015-09-11T00:00:00",
      "story": "White orb flying over Anaheim, CA I had just parked my car, when i noticed a white orb moving slowly, but remained in the same place.   I started to record it and take pictures, but the camera has poor quality images.   There was no sound coming from that object.   A man who was running away from the police passed by and also noticed the light but he was so paranoid that he thought it was the police looking for him.  (I say this because he comes out in one of the videos and the sound is of a helicopter flying nearby).",
      "link": "http://www.nuforc.org/webreports/121/S121775.html",
      "state": "CA",
      "duration": "Several hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c520d",
      "summary": "Strange fireball in morning sky over Anaheim.",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2016-01-05T00:00:00",
      "story": "Strange fireball in morning sky over Anaheim 11/13/15  Looking out at what I believe we're Venus and Jupiter in the sky at approx 6am (perhaps 5:30) PST.   Was looking out of a hotel room towards Disneyland resort area and it was early dawn.  In the sky appeared a light that at first could have been a meteor but moved slowly in its trajectory and made a very long streak.  It became a little brighter and then faded out to nothing, similar to when a plane flies, turns towards you, and then turns away.   I do not know what I saw, but it seemed far too slow moving for a shooting star/meteor.   It also was the date that debris was reported to be crashing to earth, but I did not read anywhere that this would have been visible over Anaheim, California.",
      "link": "http://www.nuforc.org/webreports/124/S124814.html",
      "state": "CA",
      "duration": ">1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c51f3",
      "summary": "Two orange-ish blinking lights, 30 degrees from horizon, faded then disappeared.",
      "city": "anaheim",
      "shape": "other",
      "date": "2016-02-11T00:00:00",
      "story": "Two orange-ish blinking lights, 30 degrees from horizon, faded then disapeared. Two blinking lights one higher than the other first one slowly faded and then disappeared and then the second one did about 30 degrees from the horizon. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125784.html",
      "state": "CA",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c5898",
      "summary": "Satellite-looking object acts strange over Disneyland. (Disneyland UFO)",
      "city": "anaheim",
      "shape": "light",
      "date": "2016-06-10T00:00:00",
      "story": "Satellite-looking object acts strange over Disneyland. (Disneyland UFO) I was at Disneyland with my friends for grad night.  We were outside of a ride waiting in line when I looked up at the sky to see the stars.  I saw what appeared to be a satellite.  It was headed south/southwest and was a reddish orange color.   My friend and I both watched it for a minute or so before it began to act unusual.  It began to zigzag and speed up and slow down.  It even stopped and started at one point.   At this point my friend looked away and the object stopped a second time.  It turned from a reddish-orange to yellow and let out a sky blue beam out into the night sky on its left side and disappeared into the clouds. I cannot believe that my friend looked down at his phone just before it started to act like it was not a satellite but maybe other people saw it too.  Disneyland can be very crowded.",
      "link": "http://www.nuforc.org/webreports/127/S127783.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c64bb",
      "summary": "UFO on fire.",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "Sitting on my porch facing south, I look up into the sky and what I saw, was a UFO on fire.  If it was a plane on fire, it would have been on the news.   It was flying as fast as a plane or helicopter.   I kept my eye on it as it traveled north, until it was out of my eyesight.",
      "link": "http://www.nuforc.org/webreports/128/S128675.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c67c9",
      "summary": "Red orb spotted in daytime in Anaheim.",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2017-04-20T00:00:00",
      "story": "Red orb spotted in daytime in Anaheim. Stopped at a light on Westminster Blvd. looking toward Anaheim, I noticed a red orb in the clouds.  I blinked a few times to verify if it was flashing from, perhaps a plane, but it remained solid red.   It kept moving downward smoothly.  After a good seven seconds, I tried to grab my phone real quick to get a video but as I looked up, it disappeared.  It looked as if it left a small visible trail behind it.",
      "link": "http://www.nuforc.org/webreports/133/S133709.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6938",
      "summary": "4 small white circular objects flying around in random patterns in the Southern California Sky.",
      "city": "anaheim",
      "shape": "circle",
      "date": "2017-04-07T00:00:00",
      "story": "4 Small White Circular objects flying around in random patterns in the Southern California Sky. I was on my way to my car with a co-worker, when I noticed 4 small white objects in the sky.  I took my sunglasses off and could not see them without my sunglasses on and actually handed my sunglasses to my co-worker so he could see them.  Once he saw them, we watched them circle each other and move around the sky randomly, almost as if they were playing with one another.  I noticed that a helicopter was flying nearby and these objects were much higher in the sky than an helicopter.   As we watched, we noticed that at one point all of them turned and the sun hit the objects creating 4 bright small circular objects in the sky.  We continued to watch them for about 4-5 minutes until they flew off into the distance away from the Orange County airport heading south about 20 miles inland from the coast.  The way these objects were flying, was almost as if they were birds playing in the sky, darting in and out and up and down and circling one another... not at all h! ow  commercial planes or helicopters would fly.  All 4 objects were the same size, they were white and when the sun hit them as they moved it shined a large glare off the objects.",
      "link": "http://www.nuforc.org/webreports/133/S133446.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c72a1",
      "summary": "Fireball good across the sky leaving a trail.  ((anonymous report))",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2017-07-07T00:00:00",
      "story": "Fireball good across the sky leaving a trail. While at Disneyland a fireball came into view.  The object changed color before disappearing.   It could not be a shooting star because it was very bright and unlike any other shooting stars I've seen.   We have taken annual trips to see shooting stars in August where there is no light pollution, and the magnitude of the objects brightness was unlike anything I've seen. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134993.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7310",
      "summary": "Drone-like sphere follows airplane in clear afternoon sky, then veers slowly away, before vanishing.",
      "city": "anaheim",
      "shape": "sphere",
      "date": "2017-06-15T00:00:00",
      "story": "Drone-like sphere follows airplane in clear afternoon sky, then veers slowly away, before vanishing. At my apartment complex, I had just walked out to toss trash in a dumpster, when I heard, and then saw, a Cessna model 172 flying in an Easterly direction, above the trees and housing area nearby.  The sky was blue, and without any clouds.  The Cessna flew at an altitude that suggested it would land at nearby Fullerton airport.  It was perhaps about one quarter mile south of my location. Just a moment after looking at the Cessna airplane, I noticed a mostly round shaped object, about one third the length of the Cessna in size, was flying just slightly higher and behind the Cessna plane.  The object was colored mainly white and black, and had a single and very bright white light near its top that flashed regularly, like a beacon or strobe. The object flew on at a slower speed than the Cessna, and I followed it for about one minute as it flew farther away and farther South than the track the Cessna had taken.  When the object was then just a tiny point in the clear sky, it suddenly just vanished.  I watched for another minute or so, but it never came back. The best thing I can compare the object to would be the flying ‘drone balls’ that are in the Tom Cruise Science-Fiction film called “Oblivion”.  The object flew and looked much like those round drones in that movie, though I estimate it to have been much larger in size than those in the film were.  Maybe the size of a Smart Car or Fiat 500. I believe whatever this object was, that it was a remotely controlled vehicle.  Whether it was of an alien origin, or a secret military device, I can only speculate at this point.  But I can say that it is the second time I have seen a drone-like UFO flying in the vicinity of my apartment in Anaheim, seeing another one just last year, also in the afternoon daylight hours.   Lastly, I had the feeling it knew it was being observed.",
      "link": "http://www.nuforc.org/webreports/134/S134570.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a55",
      "summary": "On 91 freeway, we saw this orange ball of fire then it moved and it left a tail of fire.  ((anonymous report))",
      "city": "anaheim",
      "shape": "fireball",
      "date": "2017-10-19T00:00:00",
      "story": "Driving down the 91 freeway, we saw this orange ball of fire, then it moved and it left a tail of fire (I’m calling fire because it was redish/orange like fire).   Then the light disappeared off the sky and came back on, but this time it was normal white lights and it seemed like a round shape object with three round lights on the bottom.   The object then expanded/threw sort of like throwing nets in the sky and were lid up and then it retracted them.  After that, the lights went off and disappeared of the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136652.html",
      "state": "CA",
      "duration": "1"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a7f",
      "summary": "Red light turns into a white light with smaller lights doing a dance before fading out.  ((anonymous report))",
      "city": "anaheim",
      "shape": "sphere",
      "date": "2017-10-19T00:00:00",
      "story": "red light turns into a white light with smaller lights doing a dance before fading out. It was 5:39 in the morning.  I was on the 91 freeway headed westbound, when I saw what looked like a satellite entering the atmosphere going eastboud.  It has a red light with smaller red lights following behind it.  It looked like a fireball with a trail behind it at first.  It was there for maybe 10 seconds.   Then it came back maybe 20 seconds later and now it was white colored.  It broke off into smaller dimmer lights with the main light in the center.  These smaller lights broke away and did a dance and then faded out.  Then it came back again maybe a minute later as a red glowing light headed west bound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136650.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a7b",
      "summary": "Oblong,shape with lights moving slowly across the sky at times it just sets there",
      "city": "anaheim",
      "shape": "oval",
      "date": "2017-11-22T00:00:00",
      "story": "Oblong shape with lights moving slowly across the sky at times it just sets there",
      "link": "http://www.nuforc.org/webreports/137/S137321.html",
      "state": "CA",
      "duration": "Slowly"
    },
    {
      "_id": "64d005f478aba2ec5a3c8383",
      "summary": "Ten spheres in sky.  ((anonymous report))",
      "city": "anaheim",
      "shape": "circle",
      "date": "2018-09-27T00:00:00",
      "story": "Ten spheres in sky. Ten spheres random in sky.  Couple of them moved then stopped. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143138.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8add",
      "summary": "I was getting out of my car. I was on the phone with my husband, and I looked up to see about six spheres flying in a clump, they were",
      "city": "anaheim",
      "shape": "circle",
      "date": "2019-09-12T00:00:00",
      "story": "I was getting out of my car.  I was on the phone with my husband, and I looked up to see about six spheres flying in a clump, they were on different levels.  Moving swiftly, some would move up and others down.  Heading South.  Some would go ahead and some would go backward the other direction just as fast as going forward.  Some would disappear and reappear.  As I tried to get my phone to record it, I lost sight of them.  A couple seconds later they reappeared in a line going west and then they disappeared.",
      "link": "http://www.nuforc.org/webreports/148/S148787.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e5f",
      "summary": "12/19/2018 Anaheim Ca 20 seconds  2 red lights with helicopter chasing moving very fast. seen by 4 people 12/20/2018",
      "city": "anaheim",
      "shape": "unknown",
      "date": "2019-01-04T00:00:00",
      "story": "12/19/2018 Anaheim Ca 20 seconds  2 red lights with helicopter chasing moving very fast. seen by 4 people 12/20/2018 There were three outside my work when I came out for a break.  I heard a loud noise which turned out to be a Helicopter (possibly a military helicopter) chasing 2 little red lights about 1,000 ft in the air or less one in front of the so fast that the helicopter seem to have a hard time following. the red lights were traveling at a very high speed (to me they seemed to be going to fast to be drones).  As they passed almost directly over our heads, one of the red lights sped up passing the other one and leaving the helicopter way behind.  They were traveling north through orange county towards Los Angeles.  I watched until they out of my sight.",
      "link": "http://www.nuforc.org/webreports/144/S144116.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f80",
      "summary": "Rod Shaped UFO.  ((anonymous report))",
      "city": "anaheim",
      "shape": "other",
      "date": "2018-11-24T00:00:00",
      "story": "Rod shaped ufo moving silently thru sky.  Faint lights seen on object in line. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143718.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9093",
      "summary": "Approximately 9 or so triangular shaped craft, moving and then disappearing",
      "city": "anaheim",
      "shape": "diamond",
      "date": "2019-12-01T00:00:00",
      "story": "Approximately 9 or so triangular shaped craft, moving and then disappearing I was looking up at a small Alaska airlines plane making its approach to John Wayne airport. I noticed a group of triangular craft flying in sequence and then they disappeared within 10 seconds. They were white in color.",
      "link": "http://www.nuforc.org/webreports/150/S150083.html",
      "state": "CA",
      "duration": ".10"
    },
    {
      "_id": "64d005f478aba2ec5a3c930c",
      "summary": "Low flying/hovering egg shaped object seen in southern california w/video.",
      "city": "anaheim",
      "shape": "egg",
      "date": "2019-12-01T00:00:00",
      "story": "Low flying/hovering egg shaped object seen in southern california w/video. Good evening around 1845 on Thursday Oct 24 2019 my wife and I were driving Northbound toward Los Angeles on the 405. As we were passing through the town of Anaheim we noticed a unusual egg/oval shaped object that appeared to be floating then suddenly moving downward and upward erratically. I quickly pulled out my phone to try and capture what we were both witnessing. What we were seeing was approximately 100 yards off the highway and seemed to be above a parking garage by the looks of it. The color of the craft was grey in color with some shimmery texture to it. It appeared to be maybe 10-15 feet in height but was hard to tell as we were driving and it was moving frantically. I looked online on multiple sights and asked on multiple social media sites to see if anyone else that was around witnessed the same thing. I was able to get a decent 20-25 second video of the craft which I will attach. The first thing I thought of when I saw this was that it’s a big balloon that usually car dealers put on the cars if they are having a big sale of some sort. But after getting closer and than witnessing the object quickly come down then go back up I realized it couldn’t be a balloon cause they do not move that erratic or suddenly. Also there was no strings or anything attached to this thing. What I could tell this object was approximately 75-100 feet in the air. A little background on myself, I have noticed unusual objects flying since moving out here in California 4 years ago.  I’m 28 years old and am a Marine Corps OEF combat veteran.  Served just over 5 years before coming out here.  After that I worked for the government as a contractor and was around aviation heavily so I have a strong deep understanding and knowledge of aviation and in general flying.  This sighting was for sure a bit off and it wasn't anything iv seen nor know of that would be able to maneuver the way this thing did. Hope this was detailed enough and I was able to shed some light on the issue.  Stay vigilant.",
      "link": "http://www.nuforc.org/webreports/150/S150124.html",
      "state": "CA",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c96cc",
      "summary": "Red Orange Ball of Light",
      "city": "anaheim",
      "shape": "circle",
      "date": "2019-12-19T00:00:00",
      "story": "Red orange ball of light in sky. Didn’t have lights flashing every so often as a plan or helicopter does. No sound. Moved slowly. Dimmed lightly very few times. But no pattern when it would it happen. We saw it for about five minutes until we had to leave. So not sure how long exactly it was visible. Moved very, very slowly throughout the sky. At times, appearing to not move at all.",
      "link": "http://www.nuforc.org/webreports/151/S151493.html",
      "state": "CA",
      "duration": "5 minutes"
    }
  ]
}