{
  "city": "anchorage",
  "fetch_timestamp": "2025-07-12T14:34:38.301545",
  "record_count": 117,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4860",
      "summary": "2 bright lights above the mountains in Anchorage",
      "city": "anchorage",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "2 bright lights above the mountains in Anchorage My window faces the Mountains just east of Anchorage.  My cousin and I looked outside and saw a really bright light above the mountains.  It shined for about 2 minutes.  It faded and then a second light appeared to the right of the first one.  This one only lasted for about a minute.  Then we looked around the sky and didn’t see anything except for two airplanes in the South.  We have no idea what these lights were. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148329.html",
      "state": "AK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e6b",
      "summary": "I looked out of my north facing window after a vibration broke all of my dishes. I saw a light, too bright to look directly into.",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2019-04-08T00:00:00",
      "story": "I looked out of my north facing window after a vibration broke all of my dishes.  I saw a light, too bright to look directly into.  Someone was behind me in my kitchen.  I had my rifle, (bears) the rounds passed right through it.  I fought.  My fists didn't ever hit anything.  It told me that Anchorage would be a stronghold.  I woke up naked in the snow, three days had passed.  My watch still said it was the same day.  My cats won't come within ten feet.  I've never seen rorschach behave so aggressively.  These cats are my babies, I've raised both of them from kittens.  Both if them hiss and claw ar me since the event.",
      "link": "http://www.nuforc.org/webreports/145/S145445.html",
      "state": "AK",
      "duration": "17:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b56b5",
      "summary": "I saw a silver sphere over Anchorage, Alaska, It stopped hovered and then disappeared before my eyes.",
      "city": "anchorage",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "I saw a silver sphere over Anchorage, Alaska, It stopped hovered and then disappeared before my eyes. In the spring of 04, as I was driving off Elmendorf AFB, I saw a silver sphere in the sky. I was stopped at the stop light just before the bridge at Mountain View and Boniface Parkway. There were other cars at the light also. I noticed a small aircraft flying from east to west. What caught my eye was it looked to be towing something. This is not unheard of for the Anchorage area, but not all that common either.  I thought it was towing a large balloon at first. By comparing it to the plane, I’d say it looked to be about  eight feet tall. As I was looking at it, it stopped moving and the plane kept going. At first I thought it broke away from the tow rope or whatever, but as the plane flew further away, I could tell the sphere was actually much further away than I first thought. I think it had just happened to be moving at the same rate as the airplane, making it look like it was being towed.  It was very near the Chugach  mountain range, which is east of Anchorage. I could tell it was spinning on it’s own axis. It was totally featureless. Just a silver orb now hovering in the sky spinning. Then it just disappeared. It is hard to explain, but it looked as though  it disappeared on itself as it turned. It never made a sound, but it was far enough away that I don’t think I could have heard it if it did.  When I first noticed it, I was looking through my windshield. I thought it might be some kind of reflection off the windshield, so I rolled down my window and stuck my head out, so I’m sure it was actually there. After it had disappeared, I looked around me to see if anybody else in the other cars had seen it. No one seemed to have noticed it. It was only visible for about 15 or 20 seconds.  I reported this incident shortly after it happened to your web site. It said it had accepted it, but the report never showed on the site. I just chalked it up to a computer error and forgot about it. I’ve only told two people about this incident. My wife and my youngest son. They both laughed at me and thought I was seeing things so I dropped it and never talked about it again. But today, 02/29/08, My oldest adult daughter was visiting with me, and somehow the subject of UFOs came up. Well, it turns out she saw the exact same thing in the same general location about two months ago. So I thought maybe it was important enough to resubmit it. I will leave it to her to decide weather to report her sighting or not.  This incident really occurred. It was a real object, and it really disappeared before my eyes. I am not an attention seeker. I am a military retiree, an ex cop and currently work in the federal security field, so this kind of publicity I don’t need. Do with this report what you will. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61957.html",
      "state": "AK",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b60db",
      "summary": "Disk shaped object in sky for 45 minutes",
      "city": "anchorage",
      "shape": "disk",
      "date": "2007-04-27T00:00:00",
      "story": "Disk shaped object in sky for 45 minutes I was on my balcony and noticed a shiny object in the western sky.  At first I thought It was a plane but it stayed in almost the same spot for at least half an hourmoving slowly east and then back west.  Then it just disapeared. I took pictures and when I zoom them in on my computer it looks like a silver disk.  I also noticed fighter jets in the air right before it vanished.  My boyfriend and I watched it until it disapeared and then waited a long while and it never came back.",
      "link": "http://www.nuforc.org/webreports/055/S55620.html",
      "state": "AK",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6bbc",
      "summary": "Triangular shaped UFO blocks out starlight Anchorage evening sky",
      "city": "anchorage",
      "shape": "triangle",
      "date": "2007-11-28T00:00:00",
      "story": "Triangular shaped UFO blocks out starlight Anchorage evening sky. Lighting: dim orange lights at the 3 corners  Estimated altitude: 1500 - 2000 feet  Bearing: aprox 90 degrees  Weather conditions: clear and dry  Temperature: approx 30F   As I was walking up the rear entry staircase to my house, I saw something out of the  corner of my eye.  I looked down quickly to assure my footing, and then looked up.   I saw what appeared to be a very large object, defined in shape only by the dim orange marker lights at each corner.  The object was moving at a steady rate, and blocked out starlight as it passed overhead.   There was no sound associated with the object.   The location of this siting is very close to the takeoff and landing flight pattern for Anchorage International Airport, but there were no other aircraft in the area at that moment.   I closed my eyes for a split second and watched again.  The object continued on its path, and I lost it as it moved beyond my line of site.   The whole episode lasted approximately 4-5 seconds.",
      "link": "http://www.nuforc.org/webreports/059/S59731.html",
      "state": "AK",
      "duration": "4-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f28",
      "summary": "INTENSE AMBER-ORANGE HONEYCOMB SHAPED DUAL HORIZONTAL LIGHT; SILENT DESCENT....",
      "city": "anchorage",
      "shape": "changing",
      "date": "2006-12-07T00:00:00",
      "story": "INTENSE AMBER-ORANGE HONEYCOMB SHAPED DUAL HORIZONTAL LIGHT;, SILENT DECENT.... MY SON, & I ON HOME SCHOOL FIELD TRIP/HUNTING TRIP.  EXACTLY 21:03 TO 21:14,  THE CRAFT WAS DESCENDING VERY GRADUALLY, IT HAD EXTREMELY INTENSE RED/ORANGE HONEYCOMB LIGHTS ON BOTH HORIZ.SIDE OF FAINT DARK STEALTHY LOOKING WINGS. NO NOISE, BUT STRONG AURA VIBRATION AND INTELLIGENT PRESENCE CAPTURED OUR WHOLE BEING. LIGHTS WERE ALMOST SUPER INTENSITY TO LOOK DIRECTLY AT, CRAFT CONTINUED TO DESCEND WITH ALMOST A HOVERING SORT OF DEVIATION/ R-L. DISTINCTIVE HONEYCOMB PATTERN FIXED AMBER/ORANGE/RED, AS IF THE LIGHTS WERE TRAINED ON US STANDING @ 1 MILE AWAY IN A FLUFF POWDER SNOW FIELD.  ABSOLUTLEY NO AUR/NORTHREN LIGHTS ACTIVITY. NO MISCONSTRUMENT ON THAT, BOY WAS CAPTIVATED IN AWESTRUCK AND DAD WAS WATCHING ENTIRE DESCENT, INCLUDING A HOT GASOUS-VAPOR-TRAILS X-2 ABOVE OUTER FAINTLY SEEN WINGS. CRAFT WAS QUIET AND WE THINK DESCENT WAS TO LAND OR HIDE BEHIND @ 3000 FT MOUNTAIN ON SOUTH SIDE OF CHENA HOT SPRINGS RD, MILE 37. TOPO SHOWS \"PRIVATE LAND SQUARE\" BEHIND THAT MOUNTAIN, AND GRANITE ROCK UPLIFT NEAR \"TOR-TRAIL\". WE HAVE NO FEAR ON OUR HUNTING TRIP, AND YET THIS CRAFT HAD SOMETHING INTELLIGENT OPERATING IT, THAT SEEMED TO LOCK OUR MENTAL AND PHYSICAL ATTENTION ABOVE LEFT BRAIN NORMAL. BOTH SON AND FATHER 9@42, SCIENTIFIC MINDED, ABOVE BOARD INTELLECT. DAD IS MISFIT TYPE, SON IS OPPOSITE, YET FASCINATED WITH FLIGHT/WEAPONS ETC. SON HAD NO DOUBT IT WAS A EXTRA-T, OR ELITE CLASSIFIED CRAFT. FATHER IS NO COMMENT, BUT AWESTRUCK. WE HAVE NO ALC/TOB/OR DRUGS, WE WERE IN HUNTING SAFETY MODE AND HAD A SMALL CAMPFIRE BURNING.",
      "link": "http://www.nuforc.org/webreports/053/S53624.html",
      "state": "AK",
      "duration": "@ 10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7107",
      "summary": "orb with tail captured on camera in Alaska 02.06.08",
      "city": "anchorage",
      "shape": "light",
      "date": "2008-02-14T00:00:00",
      "story": "orb with tail captured on camera in Alaska 02.06.08 For those that don't know me yet, I am a lifelong Alaskan living in Spenard.  I am urban Inupiaq; I have been working for local non-profits in the areas of Tribal resource management and/or conservation efforts for about 8 years.  I am writing to you all today to share some wondrous photos I was blessed to have taken this past Wednesday night, here in Anchorage.  The photos were taken between 18:59 - 19:00 (AK standard time).  You see what you think!  (Note that these images captured by my digi cam were not visible to the naked eye.)",
      "link": "http://www.nuforc.org/webreports/061/S61512.html",
      "state": "AK",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b7353",
      "summary": "it was a definite flying saucer, that made no sound, no lights, rusty colored round",
      "city": "anchorage",
      "shape": "disk",
      "date": "2008-03-31T00:00:00",
      "story": "it was a definite flying saucer, that made no sound, no lights, rusty colored round at approximately 11 a.m. my son woke me up yelling dad, dad, there's a u.f.o. i sprang up to my feet and thought to myself that you better not be joking. i went immediately to his bedroom window upstairs and looked at the craft in the sky. it was rustic reddish brown colored. it was round but from the angle we were observing it from it seemed to be oval with a round crescent top and a bulbous rounded bottom. it made no noise and just stayed in one spot. it was approximately 6 to 8 hundred feet up. about as large as a 747 or maybe even larger. then it slowly drifted across the sky and stopped again. this time it was just further away. then it drifted further away stopped and started to return. but as it returned it went up and through the clouds.",
      "link": "http://www.nuforc.org/webreports/062/S62420.html",
      "state": "AK",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7354",
      "summary": "Brown rustic red sideways disc shaped UFO and hovering very slowly through the air with pauses at random.",
      "city": "anchorage",
      "shape": "disk",
      "date": "2008-03-31T00:00:00",
      "story": "Brown rustic red sideways disc shaped UFO and hovering very slowly through the air with pauses at random. I was getting ready to play my computer games this  morning the usual for me. Before I sat down I decided to take a look outside and see how the day was.  When I looked outside noticed a irregularity in the sky, there was a sideways rustic red/brown disc shaped craft and seemed to have a cone shape coming off the bottom heading southwest. The UFO seemed to have stopped briefly for about two to three minutes after hovering about eight hundred feet above the ground. It was approximately in diameter about the size of a 747 jet. Me and my father thought quickly so I grabbed my camera a and took six images over the time it took for it to disappear.  Camera Info: Device maker: Digital Camera Device model: Vivicam Software: Ver 1.15V ISO level: 50 Sharpness: Hard White balance: Daylight",
      "link": "http://www.nuforc.org/webreports/062/S62419.html",
      "state": "AK",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7562",
      "summary": "Large shiny white disk hovering West and East in afternoon sky.",
      "city": "anchorage",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "Large shiny white disk hovering West and East in afternoon sky. On Saturday afternoon at 14:30 hours while doing work in my fenced backyard in Anchorage I looked up and saw a shiny white disk shaped object above a jet contrail.  The contrail was at an altitude of 30 to 40 thousand feet.  At first I thought it was a small plane, but after I continued to work and then looked up again and it was still in the same area, I knew it was not moving like a small plan would be.   After watching it awhile longer I called my husband to come see the strange object in the sky.  He brough 9x power binoculars to veiw the object.  It was large and pure shiny white in a disk shape.  We observed the shiny disk hover in place then move West then East then back West again.  At this point the jet contail was gone and the disk object was the only thing in a clear blue sky.   I had watched it for almost 30 minutes before it just suddenly disappeared.",
      "link": "http://www.nuforc.org/webreports/052/S52741.html",
      "state": "AK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b77d7",
      "summary": "greenish ball of light moving rapidly in northern direction  at exactly 11:25 pm  Alaska time Nov. 14, 2006",
      "city": "anchorage",
      "shape": "light",
      "date": "2006-12-07T00:00:00",
      "story": "greenish ball of light moving rapidly in northern direction  at exactly 11:25 pm  Alaska time Nov. 14, 2006 i was checking the time by the kitchen clock (11:25 pm Alaska time) and I  glanced out the window and happened to see a green ball of light, which seemed to have a yellowish \"halo\"..moving rapidly in a northern direction.  It was moving much too fast to be a light plane preparing to land.  The light vanished after 2 or 3 seconds. Can't be sure how high it was.. certainly above the highest tree level.",
      "link": "http://www.nuforc.org/webreports/053/S53795.html",
      "state": "AK",
      "duration": "2 seconds or so"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a08",
      "summary": "black disc-shaped object rose from behind a mountain then stopped and moved quickly to the south against a heavy wind",
      "city": "anchorage",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "black disc-shaped object rose from behind a mountain then stopped and moved quickly to the south against a heavy wind I was smoking outside my apartment when I saw this thing.  I'd say it was about 30 miles from my home, hovering in front of the.  It was a black saucer-shaped disc that appeared to be rotating with a slight \"wobble\".  It rose slowly straight up, slowed almost to a halt, then moved directly to the right (south) against the wind which was moving to the north.  As it moved south it passed behind a tree, blocking my view.  I ran uphill to get a better view, but it had disappeared.",
      "link": "http://www.nuforc.org/webreports/052/S52843.html",
      "state": "AK",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b7aaf",
      "summary": "It was very bright and had lights that were very red, the disk was silver, and it stayed in the air for about 5 minutes.",
      "city": "anchorage",
      "shape": "disk",
      "date": "2007-02-01T00:00:00",
      "story": "It was very bright and had lights that were very red, the disk was silver, and it stayed in the air for about 5 minutes. It was a very disturbing sight.  Its lights were brighter than the stars.  It stayed in the same spot for over 5 minutes, and flew away at over 100 mph.  It hovered right over Lake Hood Elementary School.   There were many people there that night, and they were just as afraid as I was.  I could've sworn I saw some sort of body or figure moving inside the craft.   It was a silver disk, and had bright red lights all around it.  It was a very dark night, and nothing could possibly be that bright-not even the Northern Lights!   I never believed in aliens or UFOs until that very night. I just hope it never happens again.",
      "link": "http://www.nuforc.org/webreports/055/S55007.html",
      "state": "AK",
      "duration": "10,000"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c1e",
      "summary": "an amazingly fast blue-green light pulsing to the chugach mountains in south anchorage",
      "city": "anchorage",
      "shape": "light",
      "date": "2006-12-07T00:00:00",
      "story": "an amazingly fast blue-green light pulsing to the chugach mountains in south anchorage I was walking home from a friends house tonight, and just as i was about to walk on my driveway i turned to look at the sky (the moon was out tonight and it was beautiful).  Right under the moon, i saw an extremely unique light, almost blue-green, appear. The light had the same look of a planes light, but a little bigger and much softer. It was slowly pulsing and traveling at an amazing speed.  The speed it was traveling at led me to believe it was at a low altitude.  It was completely silent, except for a faint noise of some kind of engine, barely audible.  Then, just as it passed the moon, it vanished, and there was no trace of anything out of the ordinary once again.  The street i was on was completely empty, and it was almost pitch black outside.   At first i thought  this was a shooting star or a plane, but everything seemed wrong about it.  There might have been a plane nearby, which would explain the sound, but this thing was extremely fast and out-of-the-ordinary.  It was a completely clear sky outside, and the object seemed to be traveling to the chugach mountains, and definitely crossed over south anchorage.",
      "link": "http://www.nuforc.org/webreports/053/S53669.html",
      "state": "AK",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c91",
      "summary": "Multiple craft sighted above a Anchorage, Ak",
      "city": "anchorage",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "Multiple craft sighted above a Anchorage, Ak My friend and I were out fishing on a public dock on Sand Lake in the south part of the Anchorage Bowl. The sun had set and we were about to wrap things up when I mentioned that because of the clear sky and recent climate change that we might be able to see the Northern Lights if we stuck around a bit longer until it was completely dark outside. I was taking in my line and getting my fly rod ready to put it into its case when, out of the corner of my eye, something caught my attention. There was an odd movement in the sky. I redirected my gaze up to my left (Southwest) to see what appeared to be a star of medium brightness making erratic movements in the sky. The spot of light was moving at quite remarkable speeds in an 'S' pattern and then shot off across the night sky at a perfectly straight trajectory from southwest to north at about 11 inches (from my perspective) a second. It then faded into obscurity slowly as it sped into the distance of space above the earth. Then more of these spots began speeding across the sky at breakneck speeds, one after another, back and forth. We must have seem at least a dozen of them. At the height of the activity there were three together in a small portion of the horizon. Two of them almost collided as they crossed paths. One of the spots made an instantaneous 30 degree turn as if it were a billiard ball being banked off of a rail. It was quite curious to be sure. Neither of us could decide what we were actually seeing. The Objects moved far too swift and precisely to be any sort of conventional aircraft or even spacecraft.",
      "link": "http://www.nuforc.org/webreports/053/S53056.html",
      "state": "AK",
      "duration": "2 Hours +"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f74",
      "summary": "Odd Cloud Formation Lit Up and Moving Toward and Away from us.",
      "city": "anchorage",
      "shape": "formation",
      "date": "2009-12-12T00:00:00",
      "story": "Odd Cloud Formation Lit Up and Moving Toward and Away from us. My husband and I were on our deck in the hot tub about 11pm or so last night (8/28/09) Friday.  It was sprinkling rain and there was a cloud cover blocking any view of stars as is common in Alaska.  We then viewed an odd cloud formation traveling alone and lit up, not like the other clouds at all.   I made mention of it and we started watching it.  It seemed to be moving right toward us and we honestly thought it was going to come right over our heads, very very low to the ground.  Where was the light coming from?  Then it stopped moving toward us and started moving away (west) and seemed to dissipate.   Soon after it was there again, but not as close.  Still oddly lit up unlike the other clouds and it seemed to move and stop at will instead of moving with the breeze.  No opinion or clue of what this was, but we are not given to looking for weirdness in the sky, and this scared us silly! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71934.html",
      "state": "AK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba205",
      "summary": "black/silver disc over anchorage alaska",
      "city": "anchorage",
      "shape": "disk",
      "date": "2009-06-09T00:00:00",
      "story": "black/silver disc over anchorage alaska location is around dimond and jewel lake area.Our sight location was dimond post office area. The object was roughly 4 inches width and 1 inch height from first line of sight. Object was disc shaped,bottom half was flat black with no reflection,top half was a very reflective(chrome/silver) with what seemed like a hump or cockpit in the middle of the shiny half of the object. Object proceeded to rotate/flip as it ascended toward the upper atmosphere it became less visible (the size of a pin head)and kept up its eerie movement the whole duration of sight.",
      "link": "http://www.nuforc.org/webreports/070/S70227.html",
      "state": "AK",
      "duration": "10-15min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba9bd",
      "summary": "UFO APPEAR'S OVER ANCHORAGE ALASKA 80,000 FT. LOOK'S LIKE A BB & NO MOVEMENT",
      "city": "anchorage",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "UFO APPEAR'S OVER ANCHORAGE ALASKA 80,000 FT. LOOK'S LIKE A BB & NO MOVEMENT I was in a hospital room with my brother who had just had a knee surgury he lied next to me as I sat next to the window it was vary cloudy out and the cloud's hung low and we where haveing alot of rain.   I was just looking at the cloud's and noticed that their was like a port whole through the cloud's that you could see up to the next level of cloud's the lower one I figured where at about 30,000 feet and where high enough that comercial plain's were flying under them as in the hospital you could see Anchorage International Airport of to the south west directly next to the hospital in Maril field private airfield and just north is Elmendorf Airforce Base wich you can see all from the 6 th. floor of the hospital room we were in . I just left work and showed up in his room had not been their 15 minute's when I spoted the ball or bb I called it as it was so high that you could only refure to it as a bb it was at about 60,000 to 80,000 feet up as the aircraft I ! seen flying had wingspan's of 200 feet at least as one plain flew by was 737 and another was a military transport both flew under the cloud mass and they appeared to have a wingspan of a 1\" to 1 1/2 \" span at the hight I seen them not sure if this is a good way of showing the size or not but the bb was two to three times the hight of the passing by aircraft and appeared to be just a attimate object that did not move the whole time I watched it and I told my brother man their is a UFO out their and I got to find some one show it to and I looked out the coridor to see if their was a nurse or doctor to show what I was witnessing and no one was in sight and at a minute of viewing this object since it didnt move all that time I figured I would go down the hall way and find some one wich I did and when I returned with a witness it was gone . I only wish I had stayed but all my life I never seen nothing I could not explain and this thing sat at that hight and didnt move . This was! daylight and heavy cloud cover and if it wernt for the portho! le and t he object to be sitting in the middle of the blue clear spot you would not of ever spoted it . It was like they were useing the port hole to spy or at least be able to down through it their was no other porthole's or any other blue sky showing any where so that is the only reason I spoted it .",
      "link": "http://www.nuforc.org/webreports/077/S77667.html",
      "state": "AK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3babf8",
      "summary": "Silent Objects over Anchorage Alaska while northern lights were out.",
      "city": "anchorage",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Silent Objects over Anchorage Alaska while northern lights were out. Approx. 0130 10/8/10 noted silent moving objects in sky on clear night with very dim white lights flying in a V formation, then changing positions, seen by the naked eye for several miles, later approx. 10-15 mins. a silent triangle shaped object with constant white lights on corners of triangle (3 white lights in number)with flashing red light in center, flying silently and slowly in same direction east towards mountains.  Noted aurora/northern lights where seen about same time as objects. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78321.html",
      "state": "AK",
      "duration": "15min"
    },
    {
      "_id": "64d005f478aba2ec5a3bacc7",
      "summary": "rotating teardrop over trees/highway",
      "city": "anchorage",
      "shape": "teardrop",
      "date": "2011-05-02T00:00:00",
      "story": "rotating teardrop over trees/highway Well what I had seen was a rotating oval with the narrow end of the oval was sharpened and then rounded off making it look like a sunflower seed.  It was a grayish blue in color but it was dull not shiny. It seemed to arise from the trees from a vertical takeoff the seemed to proceed horizontally towards the mountains, and then faded smaller and smaller as the object went off into the distance. It was outside of my dads work at the time he went off to get something inside, so I was bored I looked out the window and happened to get a glimpse of it.  This aircraft was very slow if it was an airplane it would have fell right out of the sky.  As it rises from the trees spiraling in the air it continued to spin as it went off into the distance. This sunflower seed shaped aircraft that flies horizontally and vertically while in a rotating motion, this aircraft that is a dull blue gray was rounded everywhere and had some sort of window or some circular shaped panels all over the back side  I don’t know if that’s what made it move or if they are lights, windows I don’t know.  This aircraft flies silently send slow breaking the laws of gravity is what it seems to me. I just had an encounter and wanted to document it and get it off my mind.  Because whatever I saw was an unidentified flying object. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80976.html",
      "state": "AK",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2c7",
      "summary": "What The Hell Is that in the sky??  ((NUFORC Note:  Possible hoax??  PD))",
      "city": "anchorage",
      "shape": "circle",
      "date": "2011-01-05T00:00:00",
      "story": "What The Hell Is that in the sky?? It was 12/16/2010,between 12pm and 2pm I was driving to a Chevron Gas station across the street from Alaska Reginonal Hospital to get my head light fixed.  It was a clear beautiful day and as i came close to the gas station i looked up toward the moon and i noticed right below it was a circular silver shape in the air that was just sitting there.   AS i was trying to drive and watch it at the same time, the object begin to move down, than stopped, I pulled into the gas station and gave my boy friend a call to tell him what i was seeing, the object disapered.   I got out of the car and just watched the sky as the man that worked at the store asked me what was wrong. I was kind of afriad to tell him i thought i just saw a ufo.  So i just kept it to myself.  I Never in my life believed in ufo's, or aliens,  But i know what i saw yesterday had no wings, no lights, it just looked like a sliver circle in the sky, but the way it was moving let me know it wasn't a balloon,  or nothing like that. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79289.html",
      "state": "AK",
      "duration": "Dabarr"
    },
    {
      "_id": "64d005f478aba2ec5a3bb60e",
      "summary": "Two small orange lights flying over Anchorage",
      "city": "anchorage",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "Two small orange lights flying over Anchorage It was New Year's Eve 2010, and I stepped outside to let my grandmother's dog out at about 8:10 PM. There were fireworks going off all around, so I instantly looked toward the sky when I got outside. The very first thing I noticed was a small orange light traveling fairly slowly moving from east to west. It was going slower than an airplane and was fairly low to the ground. Lower than an airplane would probably be flying. There is plently of air traffic over Anchorage all the time, so I know what I'm talking about and this was definitely not an airplane. I watched the thing very closely, and it was a steady light -- no blinking.  I tried to make out if it was a large craft, but it was too dark and all I could see was the light.  And it was not fireworks either, believe me.  I saw it moving and all of a sudden it made a strange move -- about a 23 degree shift to the right effortlessly.  At that point it looked like it was going to fly almost directly over my head! , so I got excited, but all of a sudden the thing started going straight up in the air. It went straight up to the point where the light was so small, it was about the size of a star. And there were two stars up in the sky and I swear they were moving around, but maybe my eyes were playing tricks on me.  I wear glasses and my vision is not great, especially things from far away. I was squinting as best as I could, and I could still see this light traveling now toward the southwest. It was obviously very high in the sky at that point, and I watched it about another three minutes until it just stopped. At this point it was no longer orange.  It was what I'd call a black or gray light. So you'd think it was something impossible to see, but I could still see it because I had been watching it the whole time. This was the point where I figured it must be a very large object because it was very far away at this point. And it just started falling straight down. It was falling faster ! than it had been moving the whole time. I heard no sound, but ! keep in mind I was near a busy road and there were fireworks going off all over the place. But I made a conscious effort to listen for sound from it, and there was none. I watched it fall for about 30 seconds, and I looked back toward the east for a second and I saw another light. It was the exact same thing flying at the same rate and roughly the same path as the original. I watched this one for about 10 seconds and then I looked back to the southwest for the other one, and I could no longer see it. So I looked back for the new light, and it was gone. I scanned the sky for about another minute, and I could not see either of the two lights, so I went back inside.",
      "link": "http://www.nuforc.org/webreports/079/S79474.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2c3",
      "summary": "This incident took place on 11-23-11, I had just passed Alaska Regional Hospital and was heading West on Debarr Rd. and had just crosse",
      "city": "anchorage",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "This incident took place on 11-23-11, I had just passed Alaska Regional Hospital and was heading West on Debarr Rd. and had just crossed Lake Otis, where Debarr turns into 15Th. Ave.  It was around 11:40am.   The day was very sunny with low hanging scattered clouds.  I had been looking Northwest at the low hanging clouds over Merrill Field Airport (Small Aircraft Airport and turned my gaze to my left, which is Southwest, and said out loud to myself \"what is that\" and there at the end of a low hanging cloud was a round silver metallic object hanging motionless.   I live near this area and I'm familiar with all of the small aircraft and helicopters that land at Merrill field. And this object was like nothing I had ever seen and was completely still.  This part of 15th is very busy so I went up the hill and made the first left to see if I could get a view looking East, no sign of the object,I drove around for quite awhile and it was gone.",
      "link": "http://www.nuforc.org/webreports/085/S85525.html",
      "state": "AK",
      "duration": "01100"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2f9",
      "summary": "New Years morning 2012. 5 lights by southern mountains outside Anchorage, AK",
      "city": "anchorage",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "New Years morning 2012. 5 lights by southern mountains outside Anchorage, AK I took my son outside to see the New Year's fireworks and in the southern sky I saw 5 red and orange lights by the mountain. They started low and close together, looking like they were emerging from the mountain, and as they got higher they spread out. I tried to get my camera but it wasn't good enough to see them. By the time I asked my neighbor (she just got outside)they weren't there anymore.",
      "link": "http://www.nuforc.org/webreports/086/S86222.html",
      "state": "AK",
      "duration": "about 1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3bb",
      "summary": "Five glowing lights traveling at slow speeds without engine noise.",
      "city": "anchorage",
      "shape": "sphere",
      "date": "2012-01-12T00:00:00",
      "story": "Five glowing lights traveling at slow speeds without engine noise. Around 7:30 pm saw 5 lights traveling in the same direction from SE to NE. One alone at first then another one, then two side by side, then one. Fairly evenly spaced almost like military planes returning from a sortie. However what caught my eye is how slow they were flying. They also were a steady glow that that cycled between a reddish orange and yellow. They then at the same point in the sky appeared to go straight up and then disappear. The other noticeable charateristic is that there wasn't any engine noise at all. Completely silent  leading me to believe they weren't helicopters.  I am an electrician and have wired many runways so I am familiar with airplane lights and runway lights along with FAA standards. These were not airplanes of any conventional standard. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86280.html",
      "state": "AK",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc606",
      "summary": "Point of light appears to fall, maneuvers, vanishes",
      "city": "anchorage",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "Point of light appears to fall, maneuvers, vanishes I was on the deck having a smoke Standing at the east end of the deck Observing the moon and sky and stars and clouds   Turned north to change view   Saw what at first appeared to be a star (dot of light not quite as bright as Polaris) just slightly west of north    Then it appeared to be falling, for a brief moment I thought it was a meteor  But there was no streak    And then it leveled for a second, heading west, then inclined slightly,  then disappeared, vanished, was no more  That particular area of sky was not obscured by clouds   No aircraft in the area   Nearest star (not quite as bright) was a little lower in the sky and a little further east of the observed object   It stayed put  (repost to correct date)",
      "link": "http://www.nuforc.org/webreports/085/S85689.html",
      "state": "AK",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc782",
      "summary": "5 orange/red balls equally apart moving south in Ancorage AK at 815ish pm on 1/22/2012",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2012-01-24T00:00:00",
      "story": "5 orange/red balls equally apart moving south in Ancorage, AK at 8:15-ish pm on 1/22/2012 They where bright orange/red dots in the sky, they where  in order in a line but quite away apart.  They were following each other like in a convoy.  Not sure how to measure.  As soon as one popped up another did.  Through binoculars they where 4 to 5 inches apart?",
      "link": "http://www.nuforc.org/webreports/086/S86779.html",
      "state": "AK",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc793",
      "summary": "Orange circles \"climbing\" then fading away",
      "city": "anchorage",
      "shape": "circle",
      "date": "2011-10-25T00:00:00",
      "story": "orange circles \"climbing\" then fading away orange circles \"climbing\" and then fading away. Too many to count. I thought it was things going up a mountain but it was to the right of the mountain. Dont know when it started but I watched for about 5 minutes. It was a lot of little orange balls that were moving up toward the sky. They started low and you could watch them move upward and then fade away. They didnt all stop glowing at the same time. Some faded or disappeared much lower then others. Some went really high before fading away. They all just either faded away or stopping glowing. You could watching them moving, not all in a straight line. They were not moving fast or zig zagging from side to side. It was like they were slowly climbing.",
      "link": "http://www.nuforc.org/webreports/084/S84696.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7d2",
      "summary": "Red lights in line formation coming over the mountains in Anchorage Alaska.",
      "city": "anchorage",
      "shape": "sphere",
      "date": "2012-01-24T00:00:00",
      "story": "Red lights in line formation coming over the mountains in Anchorage Alaska. We were waiting in the parking lot it was 730 pm and i looked over at these red lights coming over the mountains in line formation.  I thought it was military parachuting or exercises or something unitl the red speres spread apart hoovered and then went staight up slowly at the same pace all of them and then disappeared.",
      "link": "http://www.nuforc.org/webreports/086/S86810.html",
      "state": "AK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd389",
      "summary": "2 bright lights over Anchorage",
      "city": "anchorage",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "2 bright lights over Anchorage Driving North on Old Seward Highway near sylvan drive I spotted 2 bright lights in the Northwest sky high up.  The one to the left was biggest.  They did not move, I stopped at dowling road and the lights began to move south very slowly in unison than totally disappeared starting with the big one.   Another driver stopped at the light was watching the show too.  Ten minutes elapsed and jets from Elmendorf airforce base began to take off I dont know how many but within minutes afterward a total of 6 jet contrails were visible where the lights would have been, 4 were traveling together going east and 2 were together going west.",
      "link": "http://www.nuforc.org/webreports/092/S92258.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3a9",
      "summary": "Jesus Christ enlighten us.",
      "city": "anchorage",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Jesus Christ enlighten us. Red and white bluish blinking hovering above anchorage, Alaska.  Viewing at Chugach foothills park looking at Direction North West.  Light is double size of big dipper stars.  Sighting time 21:20 on 09/29/2012   Jesus Christ enlighten us!! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93186.html",
      "state": "AK",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4b0",
      "summary": "25 to 35 light orange orbs in sky...not flares",
      "city": "anchorage",
      "shape": "formation",
      "date": "2012-10-30T00:00:00",
      "story": "25 to 35 light orange orbs in sky...not flares I walked out of house at 9:30 to have a cigarette looked up to see 25 to 35 light orange orbs. I ran back to get keys to drive to a closer spot without street lights and try to photo with phone camera and they were fading out of sight as I was driving and within 7 minutes the had all faded away. I don't believe in little green men but I was mesmerized by this sight and at one point at a stop sign, they seem to be moving slowly to the left.",
      "link": "http://www.nuforc.org/webreports/093/S93285.html",
      "state": "AK",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6f9",
      "summary": "3 orange \"stars,\" brighter than reg stars in a hazy night sky.  non-moving then fading out. triangle formation.",
      "city": "anchorage",
      "shape": "light",
      "date": "2012-11-19T00:00:00",
      "story": "3 orange &quot;stars&quot;, brighter than reg stars in a hazy night sky.  non-moving then fading out. triangle formation. Driving south on Muldoon, saw 3 bright orange stars in an elongated triangle (up and down) with the point at the top.  The one in the lower right corner was wavering a little and then one by one they faded out like a flame running out of oxygen.  The sky was black and hazy and only one star (or planet) could be seen through the haze but these were slightly brighter and easily noticed with all the street lights on.  When we came to a stop at the stoplight, there was an electrical wire passing between us and them so it was easy to tell they weren't moving except for the lower right one.  As they stayed in one spot in the sky as we were driving, like a star, we could tell that they were some distance away, perhaps in the atmosphere?  Apparently, others around town also saw them.",
      "link": "http://www.nuforc.org/webreports/094/S94283.html",
      "state": "AK",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd94f",
      "summary": "Short rocket-like fireball near air force base.",
      "city": "anchorage",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Short rocket-like fireball near air force base. We had just left a restaurant and were sitting in our car admiring the stars, when what looked like a rocket started pouring out flame from the back of whatever it was. I say it looked like a rocket because of the way the flame shot out the back.  There was no definable object. When it started, it looked just like a rocket fired from Cape Canaveral, slow and graceful.  I am a prominent aircraft enthusiast, and nothing I have ever seen looked like what we saw tonight.",
      "link": "http://www.nuforc.org/webreports/093/S93512.html",
      "state": "AK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bde1a",
      "summary": "Black mass in Anchorage.",
      "city": "anchorage",
      "shape": "other",
      "date": "2012-08-05T00:00:00",
      "story": "Black mass in anchorage I saw what looked like a circle of a black mass sitting in the sky, i looked at this mass for about a whole 3-5 minutes then i put my feet on the floor to get a closer look out my bedroom window and it was gone.  I thought maybe the marijuana and alcohol would have made me see it. but to my knowledge i was sober enough to tell that the object was very well in the sky and wasn't just a cloud.  I saw this event over by the coastal trail on the same side as the anchorage port.  So, not facing fire island but over on the right side.",
      "link": "http://www.nuforc.org/webreports/091/S91161.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bde24",
      "summary": "3 bright lights (same hew as the stars) darting around the area of the Big Dipper, 2 seemed to be \"attacking\" the 1",
      "city": "anchorage",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "3 bright lights (same hew as the stars) darting around the area of the Big Dipper, 2 seemed to be &quot;attacking&quot; the 1 On the night of October 20th 2012 I went with my Fiance to Stuckagain heights in East Anchorage, Ak to watch the meteor shower that was taking place that night. We are both professionals and I am also in college for Astrophysics. We were both completely sober and have no history of mental health issues. We had been there for about a half an hour it was then 11:00 pm and we had seen over 10 meters, a few satellites and of course some planes (the plane that flew the highest was still nowhere near the altitude of what I witnessed). We were both sitting in the truck and it was parked facing the Big Dipper. I was looking at the Big Dipper when I noticed a light (same light intensity and hue as the star) moving rapidly around. It was next to a star that is almost directly under the second from the last star making up the handle of the Big Dipper. It startled me because what I saw first was a light, the same size and brightness as the star, shot out to the right from in front or behind this star, then almost instantly two more (slightly smaller in size) lights came rushing towards the first light and stopping dead underneath it on either side making a triangle formation, this lasted just a second. The first light darted down several inches in the sky (this was at an extremely high altitude) the other two followed even faster circling and darting around it, crossing over it as it kept darting away from them. They seemed to get closer and further away all during this, at one point it was very hard to see the! m. It was about 2 minutes in and we had gotten out of the truck to see better. Right as we stepped out my Fiance finally looked to where I was pointing just in time to see the first, slightly larger light dart straight down at an alarming rate, we lost sight of it for a second then saw it rush (again at a ridiculous speed) straight up again, this time a few inches to the right  from where we lost it. It seemed to have lost the other two lights (I’m assuming they’re the same ones) and then, again, out of nowhere, they appeared at either side of it and their interaction started again. They were darting all around the area of the big dipper, faster than anything my Fiance or I have ever seen. The smaller two kept darting away and then would bombard the first light for either side and cross over it, however, it was never the same move twice. It looked eerily like military tactics, however, it seemed to be outside or just inside of the atmosphere. We watched it go on for over 20 minutes, it put both of us so on edge, mainly because, for the first time in both of our lives, we only had one explanation, and that is extraterrestrial crafts.  We finally had to stop looking and left shortly after. Neither of us could sleep that night and we aren't the kind of people to be “spooked” easily.  What we saw is the kind of image that is seen in sci-fi movies, NOT real life, however, there is no denying the activity we witnessed. Both of us are born and raised in Alaska and spent our entire lives looking up at night. Over the years we have seen many strange air crafts coming from Elmendorf air force base that we live near, and pride ourselves on being able to recognize terrestrial crafts and not jumping to conclusions. My Fiance has spent may years studying air crafts and is able to recognize them on sight, even the lesser known ones. We would never have believed it if we hadn't seen it. There is no possibility that it was some sort of advertising lights, I have never seen anything other than stars and satellites at that altitude, and satellites do NOT move like that, nor to meteors.  This was completely erratic and spontaneous movement but seemed very apparent what the craft was trying to do (get away from the other two). I know of only one other person besides my Fiance and I who saw this anomaly and that person has no relation to me and knew nothing of what we saw when she told me, her description is on point to what we saw, and I hope that she chooses to report her sighting as well. We tried to video tape it, however, we only had our phones and neither of them could zoom in close enough to see the lights.",
      "link": "http://www.nuforc.org/webreports/093/S93792.html",
      "state": "AK",
      "duration": "20+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bde70",
      "summary": "Cylindrical lights, Anchorage",
      "city": "anchorage",
      "shape": "cylinder",
      "date": "2012-10-30T00:00:00",
      "story": "Cylindrical lights, Anchorage Two cylindrical shaped objects/lights were seen in Anchorage while driving near M street and W 5th avenue on 21st OCT 2012 at 18:30 hours.  Both were hovering up and down at a heavy speed and at times one moving away from one another.  I do not know exactly how long it lasted but I saw it for 30 minutes and then we drove away.  Since my partner was concentrating on the road, he did not see it.  No camera was on sight to take pictures/vidoes. But am sure there were other people who were walking on the street and who might have noticed it too.",
      "link": "http://www.nuforc.org/webreports/093/S93876.html",
      "state": "AK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdedb",
      "summary": "Saucer with bright lights, then spiky halo in colors, over Cook Inlet, Anchorage.",
      "city": "anchorage",
      "shape": "disk",
      "date": "2012-11-19T00:00:00",
      "story": "Saucer with bright lights, then spiky halo in colors, over Cook Inlet,  Anchorage. A disk with a couple of bright lights, \"sitting\" on the sky, just exactly where planes turn around the Cook Inlet.   When I went outside to look at it from the balcony, it changed in illumination and color, showing like a spiky halo around it.  Each spike was blue towards the middle, with tips/ends.  It was alternating this shape with the saucer-like with a couple or three bright lights.  It was not windy, so it was not an airplane on a stall position.  I observed it for about 5 minutes outside.  When I went back in, it was still there. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94478.html",
      "state": "AK",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdfa0",
      "summary": "Walking dog in the day and saw a silent and still chrome cylindrical object in the sky.",
      "city": "anchorage",
      "shape": "cylinder",
      "date": "2012-03-13T00:00:00",
      "story": "Walking dog in the day and saw a silent and still chrome cylindrical object in the sky. It's taken me a while to work up the will to let this out I never even told my family or friends.  Anyways I was walking my dog in my neighborhood when i was about 13 and glanced up in the sky.  What I saw about 500 yards (guessing) away was a vertical chrome cylinder shaped craft of some kind with rounded ends just perfectly still and silent in the air.  Nothing human made can do this.  It was a clear sunny day I just turned my eyes back to where I was going and kept walking and ignored it but after about 5 seconds then it made me curios and I looked again and it was still there I stopped walking and watched it for about 15 minutes.  It never moved just hung in the sky motionless the entire time.  Then a truck came up the road and I was forced to move when I looked back up about 30 seconds later after the truck passed it was gone.  I absolutely could not find it in the sky and looked for about 5 minutes then walked home.  I then went on my deck of my house and looked for it for about a half an hour and could not find it.  I have always wondered what it was and never talked to anyone about it. People just call you crazy for this stuff.  But I know what I saw and it still is in my mind today.  Figured you may be able to use this info. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87318.html",
      "state": "AK",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf96",
      "summary": "Flashing lights, triangular. Star sized, clear night, 2 witnesses.",
      "city": "anchorage",
      "shape": "triangle",
      "date": "2012-11-04T00:00:00",
      "story": "Flashing lights, triangular. Star sized, clear night, 2 witnesses Early in the morning of October 27 a friend and I had stayed up late and were preparing to go to bed when I noticed far out beyond the trees an object about the size of a star way out in the distance.  This object what flashing red, green, and yellow lights.   At first i just assumed it was a plane as there are quite common in our area.  But after looking at it for some time and realizing it was not moving I decided to take a closer look.  We saw a triangular object some distance away beaming out lights of several colors.  Not consistently either like you would be on a plane.  And at times the object would almost seem to disappear but then would reappear always in the same place.   My friend who was with me and been in the military for several years and we both agreed this was no plan or satellite as it had not moved what so ever.  We definitely new it wasn't a plane when a commercial jet proceed to fly underneath it.   We observed the object for about 30 min before gro! wing tired and going to get.  It never moved besides disappear and reappearing in the same spot.  It was a totally clear night.  The object was very far away.   Could've possibly been in outer space.  No photos were able to be taken",
      "link": "http://www.nuforc.org/webreports/094/S94068.html",
      "state": "AK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be0ba",
      "summary": "White stationary light over the mountains changed to purple then back to white and then back to purple then it fell like a shooting sta",
      "city": "anchorage",
      "shape": "light",
      "date": "2012-11-04T00:00:00",
      "story": "White stationary light over the mountains changed to purple then back to white and then back to purple then it fell like a shooting star towards the ground.   At first I thought it was a star... Then it changed color and moved. Observed by an army sergeant.",
      "link": "http://www.nuforc.org/webreports/094/S94020.html",
      "state": "AK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be94c",
      "summary": "Several red lights with no sound ascending to the sky in Alaska",
      "city": "anchorage",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "several red lights with no sound ascending to the sky in Alaska I was out walking my dog by Jewel Lake and a truck pulled up in the parking lot and asked me if I had seen the lights.  I hadn't been paying attention, but when I looked - we all (two other people besides myself) saw several red lights that were coming from the ground going to the sky. Did not see them leave the ground because we were approximately 5 miles away and the tree's were blocking the ground.  Looked like it could have been coming from the old Airforce Base off of Raspberry Road. First, three came up and went to the sky then four, then one, then two (not in that order) probably 12 - 20 in all.  I don't know - but, there's probably some sort of rational explaination. I would not say that I believe in extraterrestial UFO's nor would I say I don't believe, there's just no proof.  So, right now - I just saw some unidentified flying objects.  I'm just curious if anyone else in Anchorage saw the lights and can say what they were.",
      "link": "http://www.nuforc.org/webreports/087/S87497.html",
      "state": "AK",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed6d",
      "summary": "Upper atmosphere object moving south, becoming stationary and later moving east at a high rate of speed.",
      "city": "anchorage",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Upper atmosphere object moving south, becoming stationary and later moving east at a high rate of speed. While standing on a friends back deck, I happened to glace toward the southern sky and observed what appeared to be a fast moving satellite moving north in the upper atmosphere.  I noted the object at about the 9 o’clock position in the southern sky and continued to observe the object until the eleven o’clock position.   What I though was a satellite abruptly stopped and remained in a stationary position for approximately fifteen seconds.  I was shocked!  The object then moved at a higher rate of speed heading east and disappeared about 15 seconds later.   This has been bothering me since the event and wanted to report this incident to someone who would understand.  If you were aware of my background and current position, you would understand my concern about reporting this unusual event.  I know the object was under intelligent control and NOT man made. Thank you for your time. ((NUFORC Note:  Witness holds a very responsible position in law investigation.   PD))",
      "link": "http://www.nuforc.org/webreports/097/S97247.html",
      "state": "AK",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5ca",
      "summary": "Was red and orange balls floating and soaring brightly lit all running straight line from north to south",
      "city": "anchorage",
      "shape": "oval",
      "date": "2013-09-30T00:00:00",
      "story": "was red and orange balls floating and soaring brightly lit all running straight line from north to south",
      "link": "http://www.nuforc.org/webreports/102/S102495.html",
      "state": "AK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf78d",
      "summary": "Weird occurrence over Anchorage",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2013-10-14T00:00:00",
      "story": "Weird occurrence over Anchorage I was looking at the Big Dipper and noticed a fast light moving across the sky.  It was high enough that it seemed unlikely to be an F-22 or other Air Force aircraft.  Furthermore, it didn't \"flame out\" like a meteor, and while not exhibiting erratic flight patterns, seemed out of the norm.  In short, given the height and speed, it did not seem like an \"average\" phenomena. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102961.html",
      "state": "AK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bff4f",
      "summary": "Object emitted another object.",
      "city": "anchorage",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "Object emitted another object Strange light pattern over Anchorage, AK Time 19:50ish Started watching orange/reddish flashing lights headed toward lake hood to the west, I thought. 19:52ish The lights looked like three orange/reddish flashing strobes started moving up and down not like a plane.  I thought maybe a helicopter.  I watched a few more minutes, then a white light shot up out of the three orange/reddish lights with an arc of 180 degrees and then the white light vanished.  The object started moving up and away toward the east resting about 5 o’clock position of the bright white light that I think is military sat. 19:58 Watched with 10x50 glasses, orange/reddish lights now appear to be many colors. 21:15 The lights appear to be at the same location. 21:35 The lights appear to move farther away to the east. Who knows?",
      "link": "http://www.nuforc.org/webreports/094/S94832.html",
      "state": "AK",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c020b",
      "summary": "There are a 5-7 lights higher than a passenger plane but they are blinking; thought they may have been satellites.",
      "city": "anchorage",
      "shape": "",
      "date": "2013-02-04T00:00:00",
      "story": "there are a 5-7 lights higher than a passenger plane but they are blinking , thought they may have been satilites  but i looked it up says they dont blink ..im not not a nut lived here all my life was taking out the trash and noticed them.anyhow they seem strange ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95856.html",
      "state": "AK",
      "duration": "still on"
    },
    {
      "_id": "64d005f478aba2ec5a3c07b5",
      "summary": "At least 40 round red orbs hovering in formation above the hillside, disappeared quickly.",
      "city": "anchorage",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "At least 40 round red orbs hovering in formation above the hillside, disappeared quickly",
      "link": "http://www.nuforc.org/webreports/105/S105533.html",
      "state": "AK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c07b4",
      "summary": "stationary amber/orange colored lights over Anchorage.",
      "city": "anchorage",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "stationary amber/orange colored lights over Anchorage At 10:11 pm Monday, 12/23, I was getting into my car and looking to the south saw what looked like a cluster of 5-7 amber/orange colored lights, with one situated a little away and to the left of the main cluster.  They were about 45 degrees to the horizon.  They appeared stationary as I drove west and then south.  Thought they might have been an aircraft(s), but no nav lights or strobes detected.  Anyone else see them?  I’m a skeptic, but I can’t come up with any plausible explanation.",
      "link": "http://www.nuforc.org/webreports/105/S105701.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0874",
      "summary": "Luminescent oval shaped craft flies over Kincaid Park.",
      "city": "anchorage",
      "shape": "oval",
      "date": "2014-03-18T00:00:00",
      "story": "Luminescent oval shaped craft flies over Kincaid Park. I had stepped outside onto the porch to have a cigarette.  I was leaning against the fence watching a commercial airliner gain altitude in a westerly direction over Kincaid Park, when a large white luminescent oval shaped craft flew over my head and disappeared into the horizon just below the commercial airliner.  The oval shaped craft was three times larger in length and width then the airliner.",
      "link": "http://www.nuforc.org/webreports/107/S107711.html",
      "state": "AK",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c08b0",
      "summary": "Orange light in sky approaching from southeast.  Steady trajectory.",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2014-01-10T00:00:00",
      "story": "Orange light in sky approaching from southeast.  Steady trajectory December 26, 2013, 1821 local time, Anchorage, AK.  Orange object approaching from southeast, no sound, brightness similar to venus at its brightest.  Orange disappeared just before passing over south anchorage.  Very dim white light continued on same trajectory.  Looked like satellite on fire maybe, then orange light extinguished.  Watched for five minutes during which time it moved about 10 degrees rising over Anchorage (75 degrees altitude to 85 degrees altitude). ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105633.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0904",
      "summary": "9 red dots hovering  low in the sky moving very slowly to the west.",
      "city": "anchorage",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "9 red dots hovering  low in the sky moving very slowly to the west. My fiancé told me to look out our bedroom window because he could see little red lights in the sky hovering really low and it didn't look like an airplane.   I looked and noticed there was 5 red dots and then it looked like the dots dimmed and then became bright again and 4 more dots appeared flying in no particular pattern but moving west towards the mountains very slowly and then they just disappeared.  They also made no noise at all.   I was able to get a video and take a picture.",
      "link": "http://www.nuforc.org/webreports/107/S107589.html",
      "state": "AK",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0984",
      "summary": "Approx. 12 orange orbs moving across the sky from the NW to the SE , moving towards outer space.",
      "city": "anchorage",
      "shape": "circle",
      "date": "2013-11-11T00:00:00",
      "story": "Approx. 12 orange orbes moving across the sky from the NW to the SE , moving towards outer space. Have seen approx. 12 orange lights (circle like), these objects were moving from the NW to the South south east.  It was a clear night and very quiet. these objects were moving towards outer space.   This was definitely  not any aircraft, nor was it any thing normal.  At this point they started to fade out and then disappear, there were about four that were still visiable for a short bit longer.   This is truly something out of the ordnary..   This was the craziest thing I have ever saw or experianced.",
      "link": "http://www.nuforc.org/webreports/103/S103673.html",
      "state": "AK",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c096a",
      "summary": "Driving on Fort Richardson saw 1 orange bright light above Arctic valley that appeared droped disapered then reappeared .",
      "city": "anchorage",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "Driving on Fort Richardson saw 1 orange bright light above Arctic valley that appeared, dropped, disappeared, then reappeared . A orange bright light that appeared extremely bright.   Then dropped, disappeared, and reappeared.",
      "link": "http://www.nuforc.org/webreports/103/S103520.html",
      "state": "AK",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b4e",
      "summary": "Red Flashing UFO Hovering and slowly moving right to left.",
      "city": "anchorage",
      "shape": "flash",
      "date": "2014-02-27T00:00:00",
      "story": "Red Flashing UFO Hovering and slowly moving right to left. Around 0300 me and my coworker was parked somewhere and saw a red flashing light slowly hovering and moving to the right slowly, then to the left.  When it moved to the left it disappeared.   Less than a minute, two planes took off from the airport.   We believe it was jets, judging by the speed and sound.   The object was seen West from downtown Anchorage. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107444.html",
      "state": "AK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0dd7",
      "summary": "Bright orange lights, moving slowly up from the ground, hovering and moving away to the SW.",
      "city": "anchorage",
      "shape": "cylinder",
      "date": "2014-02-07T00:00:00",
      "story": "Bright orange lights, moving slowly up from the ground, hovering and moving away to the SW. 6 bright orange colored lights rose up from the ground one at a time moving slowly and sometimes stoping in a hover over the Westchester Lagoon area.  Lights appeared close to my location in downtown Anchorage.  They rose straight up, moved in a northerly direction, circled, turned and moved southwest.  The light only appeared to be on the forward side for as they turned the light faded and a dim cylinder shape could be seen probably due to the reflection of city lights suggesting that they were not very high.  They showed no navigation lights common on airplanes or helicopters.  There was too much city noise to hear if the objects made any noise themselves.  One object moved off to the east.  The event lasted about 10 minutes.",
      "link": "http://www.nuforc.org/webreports/106/S106827.html",
      "state": "AK",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e5b",
      "summary": "2 Unidentified Orange Lights above Anchorage.",
      "city": "anchorage",
      "shape": "light",
      "date": "2014-02-27T00:00:00",
      "story": "2 Unidentified Orange Lights above Anchorage. I was bringing my son's friend home from the movies and was headed south on Elmore Road to Abbott Road.  I noticed 2 orange lights in the same vicinity just above the treeline and west of the road through the front windshield.  The orange lights were similar in color to the street lamps common to Anchorage;  however, the orange lights were at a higher elevation than street level.  At first, I thought they might be lights atop radio or cellular towers, but as I focused, towers never manifested themselves and I wasn't aware of any towers in the residential neighborhood I was near.  That was my initial judgement as to elevation.  It was dark and the UFO's never manifested shape or elevation - only orange light.  The lights also appeared stationary.  There were small aircraft operating that night with the customary white lights or blinking lights.  As I turned west onto Abbott Road and then north again into a neighborhodd on Cathedral Way.  The lights appeared d! irectly overhead and visible through my sunroof.  I opened the sunroof to get a better look.  At this time, only one orange light was visible to me.  It appeared stationary but then began to move in a southwesterly direction.  No engine noise heard.  The orange light was round/oval and flickered slightly before the orange light dimmed completely.  At that point, the object resembled and appeared to have altitude similar to a satellite moving in orbit.  I followed the object until I could no longer see it.  So, not sure if I was catching sun off a large satellite moving in polar orbit (i've seen plenty of satellites orbit and never one display an orange light like this one) or if I was catching a drone moving in the area or something else.",
      "link": "http://www.nuforc.org/webreports/107/S107426.html",
      "state": "AK",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1146",
      "summary": "Strange flash in the sky.",
      "city": "anchorage",
      "shape": "flash",
      "date": "2013-12-23T00:00:00",
      "story": "strange flash in the sky Two buddies and I were out in the woods in Anchorage, Alaska, down a trail working on our shelter building, when while we're working.   All of a sudden the entire sky above us lights up and flashes a blue to green then back to normal in a matter of seconds.   We don't know what to make of it but it had us all confused.",
      "link": "http://www.nuforc.org/webreports/105/S105352.html",
      "state": "AK",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1382",
      "summary": "Two large, bright red, circular objects falling out of the sky over Elmendorf AFB.",
      "city": "anchorage",
      "shape": "circle",
      "date": "2013-12-23T00:00:00",
      "story": "Two large, bright red, circular objects falling out of the sky over Elmendorf AFB I work at Lowe's right outside the gate of Joint Base Elmendorf-Richardson in Anchorage Alaska.  At approximately 4:00 p.m., I went out to sit in my car to take a lunch break but stopped before I got to my vehicle to chat briefly with a co-worker.  I happened to be looking north toward the Muldoon base gate and saw two huge balls in the sky hurdling to the ground.  They were bright red, yellow, and pink (the sun was setting, so that could explain the color) and were traveling/falling at the same speed right next to each other.   To me it seemed they were approximately 100 to 200 feet apart, but I have no way of gauging the distance from one another, nor how high in the sky they were, only that they were falling fast, as though they were crashing to the ground.  They could have been meteors.  I watched them fall for about five minutes before the clouds obstructed the view. ((ADDENDUM FROM WITNESS)) Hi Peter, Hmm...definitely weren't contrails. I'm an Air Force brat and have lived on air force bases my entire life (and still do) and have seen every imaginable jet in the sky from A-10 Warthogs to F-22s, and this was like nothing I have ever seen.  I watched the sky for quite some time afterwards and saw no aircraft flying.  These balls of light were vivid red and very distinctively circular in shape.  It was around 4:00 Alaska time, which means the sun was starting to set, but it was by no means dark out.  There was a short trail of light following the objects that like I said were yellow, pink, and red, but the objects themselves were red.   The fact that I watched them in the sky for five minutes tells me they must have been way up there.  As I watched them, I assumed they were meteors, it's just that I have seen meteor showers in the past and they always had long \"tails\" and were much more brief, and weren't nearly as colorful.  Also, they came down almost completely vertically, slow enough that at times it seemed like they were suspended in the air.  Have you heard of large meteors like this? ((END ADDENDUM)) ((NUFORC Note:  Witness reports that the objects were not conventional \"contrails.\"  Meteors are not visible for five minutes.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105453.html",
      "state": "AK",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c14f2",
      "summary": "Red light with yellow edges pulsating and stationary to the south of Anchorage just below overcast cloud cover which provided me with a",
      "city": "anchorage",
      "shape": "light",
      "date": "2013-12-12T00:00:00",
      "story": "Red light with yellow edges pulsating and stationary to the south of Anchorage just below overcast cloud cover which provided me with an excellent view.  Viewed for 2 to 3 minutes as it hung stationary.   Winds with brisk gusts out of the East Chugach mountains at times this light object was not affected at all!   It was about the size of a football field compared to jet aircraft that fly over this area all the time from Anchorage International on a west to east take off, usually 747's.   What was very unusual at the time when I viewed this light object there was no aircraft in this air space what so ever for the duration and for a good hour and a half after this event which is a very rare occurrence!",
      "link": "http://www.nuforc.org/webreports/105/S105233.html",
      "state": "AK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c14f4",
      "summary": "Anchorage meteor ufo Spenard area.",
      "city": "anchorage",
      "shape": "fireball",
      "date": "2013-12-12T00:00:00",
      "story": "anchorage meteor ufo spenard area Meteor/comet / fireball sighted flying over Anchorage.  Appeared to originate near Lake Hood. Flying low about 20 degrees above horizon.  Trajectory would place landing near east side of town.  Object was pulsing with flames and white light as it crossed the sky. What was it?  Why no media report?",
      "link": "http://www.nuforc.org/webreports/105/S105249.html",
      "state": "AK",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c16ef",
      "summary": "Moved spuratically and continued back & forth and from side to side Lights were reddish and clear for a few seconds would show no light",
      "city": "anchorage",
      "shape": "changing",
      "date": "2014-06-04T00:00:00",
      "story": "Moved spuratically and continued back & forth and from side to side Lights were reddish and clear for a few seconds would show no light then flash on then then flicker sometimes seeing 3-4 lights, a few times moving faster with what looked like a line behind it,  then just hoovering above the mountains seemed to blend behind clouds for a few minutes.  I thought I may have seen something similar a few weeks ago as well and now sure it was something, tried taking a pic but came out too dark.",
      "link": "http://www.nuforc.org/webreports/109/S109584.html",
      "state": "AK",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d35",
      "summary": "Huge craft 500' in diameter 5000' following a airliner, object went threw clouds and reappear changing shape from square to rectangl",
      "city": "anchorage",
      "shape": "rectangle",
      "date": "2014-06-13T00:00:00",
      "story": "Huge craft 500 ft in diameter 5000 ft following an airliner,   object went threw clouds and reappear changing shape from square to rectangle over the turningan arm mountains heading to Kenai alaska,   i also observed to fighter jet,s heading south above anchorage in hot pursuit.",
      "link": "http://www.nuforc.org/webreports/110/S110035.html",
      "state": "AK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c213b",
      "summary": "Brightly flashing high speed spherical object moving at very low altitude across the mountains, moving sporadically at first.",
      "city": "anchorage",
      "shape": "flash",
      "date": "2014-04-24T00:00:00",
      "story": "Brightly flashing high speed spherical object moving at very low altitude across the mountains, moving sporadically at first. This could be best described as a very brightly flashing spherical/maybe oval shaped light moving about randomly initially.  It was actually spotted by one of my supervisors while we were on the tarmac at Ted Stevens not far from the UPS and FedEx parking.  When we first spotted it, it was moving about randomly low along the mountain slope in a weird, unpredictable circular pattern like it was pacing a bit before it started traveling across a greater distance and at a slightly faster speed.  The unknown object's bright white blinking light moved fast low on the mountains in almost a straight line after about a minute or two, still flashing.  The time posted is estimated.   It moved far too low and too fast to be any sort of small aircraft or military aircraft, or even a vehicle which might have made the most sense, but even then the light was too bright and flashing too constantly at such a distance, and they generally don't flash that bright while moving either.  It covered a lot of ground and seemed to disappear closer to the Cook Inlet by where i live farther south along the mountains towards Girdwood.   Note that had it been bright enough or a normal moving flying object i would have seen it past the last visible slope of the mountain chain in the south Anchorage area unless it turned around the bend out of sight.   Regardless it seemed way too bright and big for any sort of ground vehicle, and I can tell the difference between small aircraft, helicopters and higher flying jets at night.   Unfortunately I was not able to get any videos due to the distance this object was spotted at, nor would the results be good with the camera on my smartphone.",
      "link": "http://www.nuforc.org/webreports/108/S108770.html",
      "state": "AK",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2115",
      "summary": "UFO hiding in moving mist/cloud over Cook Inlet.",
      "city": "anchorage",
      "shape": "",
      "date": "2014-05-08T00:00:00",
      "story": "UFO hiding in moving mist/cloud over Cook Inlet. A mist like fog or dust/smoke looking cloud hanging over the Cook Inlet and hazing and moving over the water about 40 feet above ground level.  It is too warm for mist or fog and  it does not smell like smoke and no dust is blowing.  Made a few commercial airlines divert from the airport for unknown reasons besides that  they fly in over the inlet.  Yet they can fly in and navigate through thick winter ice fog.  One plane diverted to local Air Force base. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109221.html",
      "state": "AK",
      "duration": "3+ hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c2161",
      "summary": "UFO between our neighbors house and ours in Anchorage, Alaska.",
      "city": "anchorage",
      "shape": "triangle",
      "date": "2014-04-11T00:00:00",
      "story": "UFO between our neighbors house and ours in Anchorage Alaska I was alone at the house watching TV and it was still light out.  We had no curtains on our picture window yet because we were in the process of remodeling.  The couch I was sitting on was directly below and along side our picture window and the TV was directly in front of me.   Out of the corner of my eye I caught something that drew my attention.  I turned around and looked directly out our picture window and I saw a craft up close between our neighbor's house and ours stationary, hovering between the two buildings.  I could not believe what I was seeing, the craft was maybe ten feet away from me.   I knew it was hiding, but I did not understand from what.   I watched it and got a good detail of the underside of it.  I was like it was semi on its side due to the space confinement between the two houses.  No sound came from it and it had three lights on its belly that were white.  The body was metallic, silver like.   I could not believe I was seeing, and afterwards, it slowly took off and it did so slowly and upward, with not sound.   After the event, I got on the phone to my mom who lives about a half a block away and told her what happened.  She said she did not see anything, but heard military jets flying around.  We both thought that was really usual because we never hear military jets in our residential area.   Days after the event, I drew many pictures of what I saw and I will never forgot the incident.  Somehow I believe that this was no accident, that this UFO wanted to be in the area and maybe wanted me to see it.   I would like to know if anyone has had a similar experience here in Anchorage.   I checked the box \"I would like to be contacted by an investigator\" to talk to someone from your organization.  When you see something such as this, you do not forget it. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108373.html",
      "state": "AK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2374",
      "summary": "I explained away the first time I thought I seen this object but twice weeks apart...I'm certain now",
      "city": "anchorage",
      "shape": "cigar",
      "date": "2014-04-04T00:00:00",
      "story": "I explained away the first time I thought I seen this object but twice weeks apart...I'm certain now Was heading up Jewel Lake and noticed shiney cigaar shaped object on the horizon hovering over the Inleet.  It just sat there with no movement at all set slightly at an angle.  When I got out of car to get a picture it just disappeared in a split second...FASTER than a split second",
      "link": "http://www.nuforc.org/webreports/108/S108193.html",
      "state": "AK",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2622",
      "summary": "Very large fireball with a fire trail falling over southside of Anch. inlet,  2 jets observed flying towards object.",
      "city": "anchorage",
      "shape": "fireball",
      "date": "2014-10-03T00:00:00",
      "story": "Very large fireball with a fire trail falling over southside of Anch. inlet,  2 jets observed flying towards object. Very large, very bright fireball appeared to be falling very fast from a very high altitude. Located above the inlet, south-west from actual Anchorage.  Witnessed from Spenard area. Almost immediately after we saw it, we saw 2 \"stealth looking\" jets flying towards the object.  Falling \"Fireball\" object left a trail of what looked like fire that remained in the sky as long as we could see it fall.  Attempted to get to get closer but couldn't in time due to rush hour traffic.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114094.html",
      "state": "AK",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b25",
      "summary": "Light green saucer-like object behind Anchorage airport (Earthquake Park).",
      "city": "anchorage",
      "shape": "circle",
      "date": "2014-09-25T00:00:00",
      "story": "Light green saucer-like object behind Anchorage airport (Earthquake Park). On Saturday, the 20th of September, at approximately 10:15 PM, while driving around earthquake park towards the back of the airport I witnessed a light green glowing circular saucer like object right at cloud level flying way too fast to be an airplane streak past me towards the water.   I was unlike anything I have ever seen before.  I know it was not any airplane, strobe, or search light of any kind.  The object appeared to be only as big as maybe 2 car lengths long in diameter.  It glowed a light green color and a light trail followed it about 20 feet behind the object.",
      "link": "http://www.nuforc.org/webreports/113/S113803.html",
      "state": "AK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c326d",
      "summary": "Large fireball growing larger while coming toward us in night sky.",
      "city": "anchorage",
      "shape": "fireball",
      "date": "2015-03-13T00:00:00",
      "story": "Large fireball growing larger while coming toward us in night sky. My husband and I were watching TV, when I noticed this large red fireball heading toward us.  ( My husband took a photo with his cell phone.)   I thought it was coming right toward our window, but as it got closer and larger, it suddenly fell downward, perhaps into Cook Inlet.  I noticed it left a small sort of smoke trail after it disappeared.   This was a UFO, even though we did not hear of any other reports.  It was not a space ship, because I have seen those in Connecticut. . .  so not sure what this was.    I blew the photo up with iPhoto and you could really see the structure of the fireball.",
      "link": "http://www.nuforc.org/webreports/117/S117680.html",
      "state": "AK",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c338b",
      "summary": "Fast flying oval seen in the daylight past Chugach Mountains.",
      "city": "anchorage",
      "shape": "oval",
      "date": "2015-01-07T00:00:00",
      "story": "Fast flying oval seen in the daylight past Chugach Mountains. Several miles away I saw a military fighter jet flying North.  Looking behind I saw a fast flying oval craft flying South. The sun glinted off it and it appeared silver.  It was smaller than the military fighter jet and a standard 757 commercial jet but larger than a small plane. The 'altitude was near the Chugach mountain tree line.",
      "link": "http://www.nuforc.org/webreports/116/S116536.html",
      "state": "AK",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c367c",
      "summary": "Saucer hovering over military base forest off of Seward Highway in Anchorage.",
      "city": "anchorage",
      "shape": "disk",
      "date": "2015-01-07T00:00:00",
      "story": "Saucer hovering over military base forest off of Seward Highway in Anchorage. Mother and I saw what appeared to be a \"traditionsl 1950's war of the worlds\" type of flying saucer hovering over the forest (about triple tree height) near the military base off of Seward Highway in Anchorage.   When we rounded a bend in the highway it immediatly was visable.   About 10 seconds after we laid eyes on it, the craft flew up and away into our atomsphere at a velocity so instantaneous and quick that it was out of sight in about 1 second.   The cloud/fog cover settled immediatly after the craft departed.",
      "link": "http://www.nuforc.org/webreports/116/S116204.html",
      "state": "AK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f85",
      "summary": "Disk shaped object hovering in the sky.",
      "city": "anchorage",
      "shape": "disk",
      "date": "2015-06-15T00:00:00",
      "story": "Disk shaped object hovering in the sky. I was walking northbound on 32nd avenue and looked up in the sky and saw something disk shaped that was hovering.  It was the size of 3 jumbo size airplanes.  It was the same altitude that the airlines fly.   When it tilted towards me and I saw the metallic surface then it shot northbound out of sight like lightning.  There were no clouds in the sky around it.   Later I saw an Alaska Airlines plane fly by in the general area and it looked tiny in comparison to the disk shaped object.",
      "link": "http://www.nuforc.org/webreports/119/S119533.html",
      "state": "AK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4133",
      "summary": "A small orange oval moving in a straight line across the night sky with no sound.",
      "city": "anchorage",
      "shape": "oval",
      "date": "2015-05-08T00:00:00",
      "story": "A small orange oval moving in a straight line across the night sky with no sound. A clear star lit night when in the southern sky heading west over Anchorage was a bright small orange oval at a very high altitude moving three times the speed of a jet.  It traveled for what seemed like half the distance of the city when it just disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118768.html",
      "state": "AK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4606",
      "summary": "Small reddish light slowly joined a bigger reddish light, the big light didn't move.",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2015-11-06T00:00:00",
      "story": "a small redish light slowly joined a bigger reddish light, the big light didn't move I saw a bright red light in the south, and it didn't move.  Then a smaller red light, slowly moved towards the bigger light and joined the other then slowly dimmed out, possibly moving away.  The bigger light never moved, just slowly dimmed out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123273.html",
      "state": "AK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4691",
      "summary": "I saw two pulsating light blue colored lights fairly high in the sky, noiseless, moving very slowly in a southerly direction.",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2015-12-03T00:00:00",
      "story": "I saw two pulsating light blue colored lights fairly high in the sky, noiseless, moving very slowly in a southerly direction. I was traveling north on Old Seward, heading toward Diamond, and happened to look up, and  noticed two pulsating light blue colored lights fairly high in the sky.  They were pulsing in unison and moving together with constant distance between them, which made me think it was a single object.   What really got my attention was its “very slow speed”, like it was just barely moving along, not at all like a conventional aircraft that we see all the time.    I had time to pull off the road next to Play It Again Sports, get out of my car and watched “it” gradually move away from me, in a southerly direction until the lights faded out of sight into the dark and misty early evening.  I heard no noise coming from it.    Did anyone else see it or know what it was?",
      "link": "http://www.nuforc.org/webreports/124/S124438.html",
      "state": "AK",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4996",
      "summary": "Looked out of window before going to bed. Saw a circular craft with rotating colored lights. Called Elmandorf Air Force Base. Said they",
      "city": "anchorage",
      "shape": "circle",
      "date": "",
      "story": "Looked out of window before going to bed.  Saw a circular craft with rotating colored lights.  Called Elmendorf Air Force Base.  Said they didn't have any air craft in area at time. ((NUFORC Note:  Source of report indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121702.html",
      "state": "AK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4acd",
      "summary": "It was Sunday morning and it was like 3:14. I've had just finished delivering newspapers with my brother,something I do everyday. So as",
      "city": "anchorage",
      "shape": "light",
      "date": "2015-09-25T00:00:00",
      "story": "It was Sunday morning and it was like 3:14.  I've had just finished delivering newspapers with my brother,something I do everyday.  So as I was getting out of the car I stoped and looked up to watch the northern lights.  And as I was watching I saw what looked balloons like 8 of it and was yellowish like the size of a basketball if you were to see it from were I was standing.  At first I thought it was one of the group of birds I had saw earlier. But as it got closer saw it can't be balloons it's to dark to be able to see a balloon.  I told my brother look a ufo I was joking and he said those are just balloons and went inside the house.  Well I kind of started to believe too that it were baloons, until it went a little higher and I could still see it.  Then I said to myself if those were balloons you'd probably couldn't see it from here, then I was 100% sure it was balls of light.  So as the ball of lights went bit higher coming from the opposite direction was anoth! er balls of lights same everything except it was reddish it kind of met up with the other ball of lights and sort of circle each other then both went higher and higher in the sky then it started to look like stars then stoped for like 15 second then it started to line up perfectly and then started to move toward the center of the sky. And when it got there the northern lights started to make its way to the lights and started surrounding it 10 seconds later when the nor the lights was gone the balls of light was gone too....September/20/2015",
      "link": "http://www.nuforc.org/webreports/122/S122081.html",
      "state": "AK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d86",
      "summary": "On a clear Anchorage morning, I saw a bright ball of light moving over the mountains.  No visible stars out and moved too slow for A/C.",
      "city": "anchorage",
      "shape": "oval",
      "date": "2015-09-02T00:00:00",
      "story": "On a clear Anchorage morning, I saw a bright ball of light moving over the mountains. No visible stars out and moved too slow for plane. I was walking to my bus stop on a clear Anchorage morning, until I saw a single bright ball of light moving over the Mountains.  There are no there stars that can be seen and it was moving upward.   It's been 2 days and I can still see it from my bus stop, and it's still moving but slowly.  Too slow for a plane or helicopter.",
      "link": "http://www.nuforc.org/webreports/121/S121625.html",
      "state": "AK",
      "duration": "2 days"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d99",
      "summary": "Yesterday p.m., it was very clear in the sky over Anchorage, AK.  I was just going to try to ignore what I saw.",
      "city": "anchorage",
      "shape": "rectangle",
      "date": "2015-08-27T00:00:00",
      "story": "Yesterday afternoon, it was very clear in the sky over Anchorage, AK.  I was just going to try to ignore what I saw, because as weird as it was, it was descending in altitude over the huge joint Army/Air Force base near my house, JBER.   When I was trying to Google stuff about UFO's, which was weird for me anyway, I found another documented sighting on the list from Knoxville, TN, on 8/15/15 which was identical in every way to what I saw.  No difference.   At first I looked for an aircraft pulling a sign, but realized that it was definitely something, rectangular/louvred and moving slowly under its own power.   I have seen some strange things over JBER, so I tried to forget it.  It was SO CLEAR and interesting.  I tried just to forget it. ((ADDENDUM FROM SOURCE)) Addendum:  the person that saw exactly what I saw reported on 08/10/15, not 08/15/15.  It is also interesting that we both live only miles from a large military/Air Force installation. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/121/S121431.html",
      "state": "AK",
      "duration": ">5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f3b",
      "summary": "They were all around in the sky!",
      "city": "anchorage",
      "shape": "light",
      "date": "2016-03-18T00:00:00",
      "story": "They were all around in the sky! We saw 10 or more flashing lights in the sky of Anchorage, AK.  It only lasted 5-10 minutes.  That all i can describe.",
      "link": "http://www.nuforc.org/webreports/126/S126359.html",
      "state": "AK",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c50b8",
      "summary": "Circular craft over flying downtown Anchorage at 5th Ave East bound. Red solid light with white light oscillating.",
      "city": "anchorage",
      "shape": "circle",
      "date": "2016-02-11T00:00:00",
      "story": "Circular craft over flying downtown Anchorage at 5th Ave East bound.  Red solid light with white light oscillating around the exterior 360 degrees.",
      "link": "http://www.nuforc.org/webreports/125/S125677.html",
      "state": "AK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c516e",
      "summary": "Orange circular craft hovering over House in Anchorage, AK.  ((NUFORC Note:  Video on NUFORC homepage.  PD))",
      "city": "anchorage",
      "shape": "circle",
      "date": "2016-02-19T00:00:00",
      "story": "Orange circular craft hovering over House in Anchorage, AK. Last night at 8:45 PM Alaska Time, my wife and I were watching TV, We live in the mountains above Anchorage, AK  I shot this video with IPhone of an object that was hovering for about 3 – 4 minutes right in front of our house last night. When it first showed up, it was a complete orb without any ‘hole’ in the middle.  It was super bright and made absolutely no noise.  It just hovered in front of the house. As it started to ascend, it began to change to the object he captured.  After I filmed this, I switched to looking through binoculars. It continued to ascend and I saw it go from the orb to finally a very clear triangle with nothing in the middle.  Kind of like the old cowboy dinner bells. Through the binoculars, it suddenly showed what I’ll call ‘radio waves’. Then suddenly it disappeared…. not into the clouds…. just poof, gone. ((NUFORC Note:  Video on NUFORC homepage.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125924.html",
      "state": "AK",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5323",
      "summary": "Two separate bright lights within a few seconds of each other.",
      "city": "anchorage",
      "shape": "light",
      "date": "2016-01-20T00:00:00",
      "story": "Two separate bright lights within a few seconds of each other. While taking a walk on Brayton drive, I observed what I thought was a bright star.  It got rather bright and then vanished, but then another light appeared in another section of sky and vanished.  It was neither a satellite or plane.",
      "link": "http://www.nuforc.org/webreports/125/S125342.html",
      "state": "AK",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c53d7",
      "summary": "New Years yellow objects.",
      "city": "anchorage",
      "shape": "circle",
      "date": "2016-01-05T00:00:00",
      "story": "New Years yellow objects I was outside watching fireworks, when above the mountains a yellow round dot appeared. Then 3 more just appeared and it looked almost like a square.   My mom also came out to see and by then it was only one object.  But when we looked behind us, there was another single ball of yellow.   My sister and a friend said they also saw the yellow ball.  They thought maybe it was a Chinese lantern but it did not rise into the air and float around.  And they were in a formation when all 4 appeared.  It was just there.  No floating up, just appearing.  Then they were gone.",
      "link": "http://www.nuforc.org/webreports/125/S125025.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5464",
      "summary": "At 1:30 am saw 2 crafts flashing red and white.as we kept watching.there was objects in all directions flashing the same.they were stat",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2015-12-21T00:00:00",
      "story": "At 1:30 am saw 2 crafts flashing red and white.as we kept watching.there was objects in all directions flashing the same.they were stationary long periods of time.there was formations like some mass gathering.I don't understand why no one has reported.it was not a satellite.plane or meteor shower.I've stumped.there was just so many.I can't get my mind around it.I've been seeing 1 or 2 of these flashy :) light psoriatic for months.I just can't explain.it's so different. The sky was full of some in formation.one would flash bright and the others would move in. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124758.html",
      "state": "AK",
      "duration": ">30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c547f",
      "summary": "The lights were changing colors blue and red.moved in all dir.but continued to remain in one position.  ((NUFORC Note:  Sirius?  PD))",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2015-12-17T00:00:00",
      "story": "The lights were changing colors blue and red.  moved in all directions.  but continued to remain in a fixed position.  It was spotted by alaska usa building.  it was not the building lights.  and I'm a skeptic.  so this is a big deal for me to write this. ((NUFORC Note:  Possibly a sighting of the star, Sirius??  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124637.html",
      "state": "AK",
      "duration": ">30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c57bc",
      "summary": "It was a total ghost to our radar.  ((no contact information provided by source))",
      "city": "anchorage",
      "shape": "circle",
      "date": "2016-06-10T00:00:00",
      "story": "It was a total gost to our radar. 1978, UFO incounter with 'B' Battery 1/43rd ADA Alaska. A orange red light, about 2 feet wide, came down from our ceiling and at a slight angle.  This wall of light moved slowly as we followed it out all the way out the front of the building.  We were ordered to stay inside but did not.   When we got outside and looked up, we seen a UFO over our heads, about 50 or 60 feet above our MTR radar.  It hovered above us and made no noise what so ever.  It disappeared in a direction toward Anchorage at a speed that was a blink of an eye, and again no noise or sonic boom.   We were on hot status and it never showed up on our radar.  We went into lock down and the 1/72nd base commander had every witness sign a form what you seen you did not see.  Three of our soldiers went AWOL becauses they refused to sign the confidentiality form.  All three were labeled subversionist and recived BCD's. I have lived with this for many years, and now cancer will relive me of this memorey soon. ((NUFORC Note:  The source of the report provides a name, but no contact information.  We are unable to contact him.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127796.html",
      "state": "AK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c585e",
      "summary": "Color changing single light speeds over Anchorage, Alaska.",
      "city": "anchorage",
      "shape": "light",
      "date": "2016-06-10T00:00:00",
      "story": "Color changing single light speeds over Anchorage Alaska I work nights .. at 2am this morning I went on break, outside to have a cigarette. I used the south exit. When I notice a solid dark blue small light, not flashing, not moving, over the southeast part of town. While grabbing my phone to record it the light changed to a light blue and flashing very fast and started to move..  I tried tracking the object, when it went behind a tree.  then on the other side of the tree its started flashing light red… and disappeared. Here in Alaska, the sun does not really set.  I recorded as much as I could within 30 seconds it was over the northwest part of downtown Anchorage.   I am sending you a video clip via your email.",
      "link": "http://www.nuforc.org/webreports/127/S127717.html",
      "state": "AK",
      "duration": "78 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5841",
      "summary": "Bright flash of light illuminated dark bedroom as bright as midday but with no sound-6th time it's happened in 5 years.",
      "city": "anchorage",
      "shape": "flash",
      "date": "2016-06-16T00:00:00",
      "story": "Bright flash of light illuminated dark bedroom as bright as midday but with no sound-6th time it's happened in 5 years. This is the 6th time my husband and I have seen a flash of light that lights up the entire room with intense bright white light over the past 5 years.  The window faces north and is directly under the flight path of JBER, the military base here.  We alway rationalized it had to be military related, but tonight I ran to the window expecting to see a military plane but the sky was clear, no planes.  I also rationalized it was a neighbor with a really bright flash light, or Google Earth updating their street view.  No one was outside, no cars had driven by.  Whatever it is, it's so bright it lights up the room as if it were daylight, but with no sound. I have yet to read about a natural phenomenon that would explain it, such as a meteor or asteroid, on the evenings we have witnessed it.",
      "link": "http://www.nuforc.org/webreports/127/S127870.html",
      "state": "AK",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c58fb",
      "summary": "Black oblong/rectangular ufo tumbling and turning without gaining much altitude",
      "city": "anchorage",
      "shape": "rectangle",
      "date": "2016-06-01T00:00:00",
      "story": "Black oblong/rectangular ufo tumbling and turning without gaining much altitude I was taking some video on my new S7 edge of a rare thunder storm with lightning flashes, which we very rarely get in our city.  I noticed something gain altitude in a tumbling fashion out of my peripheral vision and quickly set myself up to record it as steadily as possible resting my arms against the corner of the building for support.   The object was sort of oblong, or perhaps even rectangular, and black or very dark in color.  I live adjacent to 2 active airstrips, one being the small craft airport Merrill Field, and the other being JBER (Joint Base Elmendorf Richardson), and so I am very familiar with aircraft of ALL SORTS.  Everything from single engine Cessnas to AWACS (I've even taken a picture of a Royal Australian type of aircraft very similar to an AWACS but with a \"table top\" rectangular radar setup as opposed to the circular American style reconnaissance dish, I digress.   The object had a very peculiar wobble and tumble to it as it pret! ty much remained on a straight heading moving from N/NE to W.  It was unlike any plane, helicopter, drone, balloons or birds that I've ever seen and I am at a loss as to what it was.  It IS a UFO in the truest sense of the term, although I can't say with any assurance that it was a \"space craft\"  it is most definitely an enigma.  I was able to follow it relatively smoothly for a couple of minutes before it disappeared behind some building and tree in the horizon.  Perhaps Merrill Field or JBER may have visual or radar sighting of the object as well...",
      "link": "http://www.nuforc.org/webreports/127/S127603.html",
      "state": "AK",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d08",
      "summary": "Bright orange pointed cigar 50 degrees above dithers horizon going full east to west in 5 sec.  Appeared to be very low and faster than",
      "city": "anchorage",
      "shape": "cigar",
      "date": "2016-12-05T00:00:00",
      "story": "Bright orange pointed cigar 50 degrees above dithers horizon going full east to west in 5 sec.  Appeared to be very low and faster than anything I have ever witnessed.",
      "link": "http://www.nuforc.org/webreports/131/S131192.html",
      "state": "AK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6016",
      "summary": "Disk shape object above tree line.  ((anonymous report))",
      "city": "anchorage",
      "shape": "disk",
      "date": "2016-09-30T00:00:00",
      "story": "Disk shape object above tree line. Object was low in the sky, just above the tree line.  Object streaked from left to right very fast with blinking lights.  I was standing on balcony and saw bright blinking lights off to my right. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130318.html",
      "state": "AK",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c626c",
      "summary": "Light moving in random motions at approximately 30,000' - 50,000' for more than 2 hours.",
      "city": "anchorage",
      "shape": "light",
      "date": "2016-09-15T00:00:00",
      "story": "Light moving in random motions at approximately 30,000' - 50,000' for more than 2 hours. While looking up at the dusky night sky, I noticed a light that was moving very slowly from east to west that was going much slower than a satellite or airplane.  I watched it for about one minute before it started moving erratically at a slow, often jerking motion.  It was moving like a fish or a snake at times, and at others it was hardly moving.  It could make abrupt 180 degree turns and other maneuvers not possible with today’s modern aircraft.  With some binoculars, it looked like a single bluish white light with the intensity of a bright star.  Broken high altitude clouds were moving thru the area and its light would be obstructed as it flew thru or above the clouds.  It appeared to be at or just above the clouds as its light would dimly reflect off the clouds. \tI first saw the light around 9:20 p.m. Alaska Standard Time.  There were 3 other witnesses when I first saw the light.  I was near Mile 109 of the Seward Highway when I first watched the light move around the sky for about 20 minutes.  I drove home and arrived around 9:50 p.m.  At this time I had 4 other witnesses see the light moving around in the sky as the night grew darker.  The light hung out in roughly the same part of the sky near the Constellations Cygnus and Lyra.  A witness and I laid down in our front yard and watched the light move around for another 50 minutes before we went inside to write this report.  By this time the sky was mostly clear and dark and stars were visible. 20 minutes later, the light was still visible continuing the same motions as before.  A second light was seen shortly after I arrived home but we did not maintain visual of that object for more than a minute while we focused mainly on the original light.",
      "link": "http://www.nuforc.org/webreports/129/S129857.html",
      "state": "AK",
      "duration": ">2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c6411",
      "summary": "Red and blue color changing orb moving in all directions.",
      "city": "anchorage",
      "shape": "sphere",
      "date": "2016-09-02T00:00:00",
      "story": "Red and blue color changing orb moving in all directions. I went out on my deck and i saw a fast moving blinking white light.  It then turned solid red. It was going faster then a plane, then all of a sudden it stopped and went the oppisite direction.  Then it was moving diagnal, then up and down.  Then it turned really bright solid blue for a few seconds.  Then it turned red again and went over towards some planes coming.  Circled around them.  The movement of this red and blue orb was the most unique part.  Then it seemed like the orb didn't know what to do.  Then it feathered down past the tree line.  The interesting part was that i grabbed my phone to record it and i only got one second, and my phone misteriously died and i had 15% charge.  It didn't want me to record it.",
      "link": "http://www.nuforc.org/webreports/129/S129634.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c64e8",
      "summary": "Midnight adventure car ride to the top of a mountain greeted by something beyond this earth?",
      "city": "anchorage",
      "shape": "triangle",
      "date": "2016-08-16T00:00:00",
      "story": "Midnight adventure car ride to the top of a mountain greeted by something beyond this earth? My friend and i were going to Anchorage from Wasilla to pick up his girlfriend from work around midnight.  (He was driving i was in the back right seat she sat in the front passenger)   After picking her up, we decided to go on an adventure and take a road we had never noticed before.  As we fallowed the road it lead us deep into the mountains.  The clouds were so low it covered the top of the mountain (we've had a lot of rain the last few days) but had a clear distinction on where the cloud ended and the mountain began.   As I was admiring the edge of the cloud line through the open window, three lights appeared in the corner of my left eye.  When I looked right at it I thought it was a plane but it wasn't moving.   At first, I thought my eyes were playing tricks but while I was watching it seemed as though it jumped across the sky to the right.  To be honest I was so shocked I couldn't speak to signal my friends.  I couldn't believe my eyes!  As I kept watching it jumped again this time downward horizontally to the left.   I leaned my head out of the window to get a better look.  I was finally able to find my voice.  I shouted over my friends loud music, \"Guys!  It's a ((deleted)) UFO!\"  Literally, as I yelled the UFO disappeared into the clouds.   At that point I told my friend to turn around and take me home.  My friends say they believe me but I feel like they think I'm crazy.  I keep asking myself:  Did I really see a UFO?  Am i going crazy? ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129179.html",
      "state": "AK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6840",
      "summary": "Trapezoid shaped object rising above trees leaving to the West over Anchorage",
      "city": "anchorage",
      "shape": "other",
      "date": "2017-03-23T00:00:00",
      "story": "Trapazoid shaped object rising above trees leaving to the West over Anchorage. This experience was played out as follows.  My dad and I walked to a large field where we saw the unidentified craft, we saw it flying through the tree line like the trees were non-existent.  It was the second time the craft came around that I pulled out my phone to start recording it, but my phone had died, and it was at 60% (my phone could never die with that much power left.)   The craft seemed to patrol in the same manner as it circled around the snow-covered field.   The shape was very odd, having a trapezoid-like shape with lights at the end of every point.  Another detail I noticed was the peculiar hieroglyphic design on the bottom of the craft.  The design was on plate with the mysterious hieroglyph etched into it.",
      "link": "http://www.nuforc.org/webreports/133/S133160.html",
      "state": "AK",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6841",
      "summary": "3 orbs in the shape of a triangle, morphed to a long thin line of light above treeline in Anchorage",
      "city": "anchorage",
      "shape": "diamond",
      "date": "2017-03-23T00:00:00",
      "story": "3 orbs in the shape of a triangle, morphed to a long thin line of light above treeline in Anchorage While taking the dog for a walk, at University Lake in Anchorage, we headed through a treed trail and on to a clearing.  After Several seconds, my Daughter said “dad, look at the lights in the trees”.  To the North, I saw three white orbs in the shape of a triangle rise above the tree line.  It appeared to turn West, and as doing so, the “orbs” turned into a long thin bright white light.  Like a long fluorescent light bulb, but so much brighter.  It then headed West and no lights were visible.  I opened my eyes wide to let as much light in as possible (the moon was not above the horizon at the time).  That is when I noticed the shape, very much like a box kite, but with triangles on top and bottom; essentially an elongated diamond.  We stood there for about a minute after and headed back down the wooded trail talking about what we had seen.  After about 40 yards, I said let’s go back.  I was shining my flashlight on the tree line and my daughter said that if ! we see anything she will record it with her IPhone.  Once again, three orbs in the shape of a triangle appeared in the same spot slowly rising above the tree line. This time my daughter took out her phone to record and her phone died.  She said it was at 60%.  The same scenario as above played out, the orbs turned to one long bright light, then as headed West was just a dark silhouette of an elongated diamond until it went out of view (total time about 20 seconds each occurrence.  At this point we left as it was cold.  My daughters phone did not turn back on until we got home and plugged it in.  it immediately showed 62% of battery power.",
      "link": "http://www.nuforc.org/webreports/133/S133157.html",
      "state": "AK",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6940",
      "summary": "Object observed to the east of the City of Anchorage.",
      "city": "anchorage",
      "shape": "fireball",
      "date": "2017-03-10T00:00:00",
      "story": "object observed to the east of the city of Anchorage. Object was reported observed over or beyond the Mountains to the East of the city.  Cool morning, approximately 11° F at ground level, clear morning sky, light breeze.   Object appeared vertical at first, the horizontal and proceeded to travel to the south at a rather fast pace.  No reports of sounds or booms, and unable to determine distance, other than sight of the object was lost as the mountains blocked the view briefly behind the peeks.    The object was bright as it was back lit by the sun, and the western face of the mountains was still shadowed.  There was a trailing plume that was visible and changed slightly in form the trailing edge did not linger and closer to the tip remained constant; however, the leading edge appeared sharp and constant.",
      "link": "http://www.nuforc.org/webreports/132/S132952.html",
      "state": "AK",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c699f",
      "summary": "White flashing orb-like object.  ((NUFORC Note:  Possible sighting of Venus??  PD))",
      "city": "anchorage",
      "shape": "circle",
      "date": "2017-03-10T00:00:00",
      "story": "white flashing orb-like object the bright white circular orb flashed at few second intervals and remained in the sky for a long period of time. ((NUFORC Note:  Possible sighting of Venus??  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133002.html",
      "state": "AK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c81",
      "summary": "Three bright orange orbs, exhibiting odd flight patterns, above Ted Stevens Airport. ((anonymous report))",
      "city": "anchorage",
      "shape": "fireball",
      "date": "2017-01-06T00:00:00",
      "story": "Three bright orange orbs, exhibiting odd flight patterns, above Ted Stevens Airport. Three hours after witnessing one large, bright, orange orb travelling south-westerly over mid-town Anchorage, I sighted upon three identical orbs a few miles (in my estimation) above the ted stevens international airport property.  These were moving around in separate, oblong paths at casual speeds, with sometimes one or another momentarily breaking away from its path to perform a zig-zag or to move somewhat farther afield, and every few minutes all of them slowly dimming and returning to full brightness.  After about 20 minutes of watching they simultaneously dimmed out for good as a routine aircraft was making its approach from the Chugach Mountains. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131964.html",
      "state": "AK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c88",
      "summary": "Red round lights in 5 or 6 groups of 3 lights each hovered over Hillside(?) area during midnight fireworks.  ((anonymous report))",
      "city": "anchorage",
      "shape": "formation",
      "date": "2017-01-06T00:00:00",
      "story": "Red round lights in 5 or 6 groups of 3 lights each hovered over Hillside(?) area during midnight fireworks seen from Tikahtnu area. From the viewpoint of the north end of Muldoon area near the Glenn Hwy, at 10 minutes after midnight (Happy New year's, guys!) we saw 5 or 6 clusters of what looked like small orange steady lights, 3 to a group, each group of three kept a perfectly tight triangle pattern/formation.  They came up from the south at a medium speed, too slow for a firework rockets or flares, but faster than most airplanes. They slowed to a stop still in formation & still due south, hard to guess the distance being dark, but my guess would be about 500-800'in altitude & maybe 5-8 miles due south from us. The groups of three seemed to keep perfectly together within each group as if there was one object with three lights each but the different groups of three would vary slightly in position relative to the other groups.  Once they stopped they were still moving slightly around but staying in the same rough area.  There were no flashing lights but the Orange balls seemed to slightly pulse with a subtle color shift from almost yellow to deep reddish orange.   After watching for 2-3 minutes, I ran inside to grab my camera but when I got back less than a minute later, they were gone or moved too low to see due to a 2 story apartment blocking my view.  At first I thought they were part of the neighborhood fireworks, but after watching, it was clear that they weren't. We were joking about the fact that they SEEMED to act like they came in close to watch the midnight fireworks show, then left when the fireworks were thinning to a close. Also, they made no sound that could be heard.  That could have been because of the distance and/or the fireworks' noise. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131967.html",
      "state": "AK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d46",
      "summary": "4 red silent crafts flying from North to South with no flashing airplane lights.  ((anonymous report))",
      "city": "anchorage",
      "shape": "circle",
      "date": "2016-12-21T00:00:00",
      "story": "4 red silent crafts flying from North to South with no flashing airplane lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131815.html",
      "state": "AK",
      "duration": "160 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d73",
      "summary": "Three stationary light pulses over the Chugach range.",
      "city": "anchorage",
      "shape": "flash",
      "date": "2016-12-15T00:00:00",
      "story": "Three stationary light pulses over the Chugach range. I opened my back door to let my dog out last night at exactly 11:30 pm.  Upon opening the door, I immediately noticed (my dog also noticed) a very bright white/ light blue pulse of light.  The location of this light was West of Anchorage, above the Chugach Mountains.  The pulse was slow, and I observed no movement (up/ down/side-to-side).   Immediately following the pulse, a streak of light passed directly under the location of the light pulse, appearing to be a shooting star (quick movement North to South, and left a visible trail behind).   Immediately following this, two more light pulses of the same color/shape/ brightness flashed.  Each happened at a slightly lower altitude (beneath the \"shooting star\") than the initial light pulse, but were identical in duration, brightness, and color.   After the third pulse, no subsequent sightings were made.  No flashing lights/forward movement/ or noise were observed.   It did not appear to be a commercial/ military aircraft and had no observable beacons.   The brightness and color were  quite notable, even causing my dog to pause and take note. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131663.html",
      "state": "AK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6dc6",
      "summary": "BRIGHT WHITE ORB:  (Silently Followed 2 Witnesses), Two Sharp Turns, Instant Mach Speed Departure.",
      "city": "anchorage",
      "shape": "sphere",
      "date": "2017-08-11T00:00:00",
      "story": "BRIGHT WHITE ORB: (Silently Followed 2 Witnesses), Two Sharp Turns, Instant Mach Speed Departure CIRCUMSTANCES -  TIME:  Night 7:00PM-9:30PM   TIME OF YEAR:  Winter   DATE: 1978, 1979, or 1980  WEATHER:  Crystal Clear Starlit Night  ACTIVITY:  Walking home from Kanchee Park (Klevin St. & E 4th Ave.) Anchorage, Alaska, proceeding East on E 4th Ave., then right heading South on Hoyt St. toward home near E 7th Ave & Hoyt St. Additional Witness: Paul  - UNIDENTIFIED FLYING OBJECT - SHAPE & DESCRIPTION: Bright White Sphere/Orb, Slow Hovering Movement, No Audible Sound, Made 2 perfect 90 Degree Turns, (Not Moon, Not Planet, Not Star, Not Helicopter Spotlight, Not Plane) PATH & EVENTS: Bright White Orb, No Sound, followed Paul and I, on our right side approximately 60 feet to the South, at an altitude of approximately 75 to 150 feet, as we proceeded East on E 4th Ave.  We joked about it being a UFO as we kept watching it during our walk.  When we turned right to head South onto Hoyt St. it turned right as well and headed South at the same altitude.  We were then alarmed and started eliminating options like aircraft, helicopter, perceived distance, etc.  After eliminating all known possibilities, with the object continuing to follow we became concerned, started to walk towards it, yell at it, and threw snow balls at it.  The altitude was too high to hit the object.  The object was not deterred.  We gave up attempting to scare it off and continued to proceed South on Hoyt St.  The Unidentified Flying Object (UFO) proceeded to follow us.  At approximately E 6th Ave. the object shot off, heading West, at a visually trackable but incredible rate of speed, just ! to the South of downtown Anchorage and disappeared over the horizon as it appeared to cross the Cook Inlet.  - IMPORTANT NOTES - The Bright White Orb approached behind us from the West and followed adjacent or parallel to our right or South at a distance of approximately 60 feet (altitude 75-150 feet). WHY THIS IS IMPORTANT? It occurred to me just yesterday (08/03/2017), after 35 years, that this object was most likely intelligently operated. WHY? If the object would have approached us at, or near, that altitude from any other side it could have dangerously interfered with the \"take-off\" and \"landing\" Flight Corridor of not only the military, at Elmendorf Air Force Base, but also the civilian, at Merrill Field Airport.  The object followed us just a few hundred feet to the West of the Elmendorf AFB Flight Corridor and departed silently at instant mach speeds just a few hundred feet North of the Merrill Field Flight Corridor, heading West past and parallel to Merrill Field. HUMAN CRAFT OR PLANE(?): Not a traditionally recognizable human flight vehicle, it was silent, it hovered, it could stay aloft at walking speed, it made two perfect 90 degree turns, it instantly accelerated to greater than mach speeds with no jet type visual exhaust and no sonic boom(s).  It specifically followed us and stayed just outside the two Flight Corridors (military & civilian) by just a few hundred feet.  If it was a human plane, it could not have performed in such a manner and its flight path would have been \"in\" one of the Flight Corridors.  I grew up in the cross section of the military and civilian Flight Corridors.  I watched literally hundreds of very low altitude civilian and military aircraft, landing and taking off, day and night (Cessna's, C-130's, F-15s, Visiting Blue Angels, etc.).  My reasonable assessment, then and now, is that this was not a traditionally recognizable human flight vehicle.  - DISCLAIMER - I am only relaying the facts as I recall them.  I make no claims as to the objects origin or purpose.  It could be the false recollection of a youthful imagination.  Nonetheless, with due diligence and intellectual integrity, I have considered and reasonably dismissed all normal or likely origins to account for this object.  Simply put, the object \"appeared\" to be an Unidentifiable Flying Object with uncharacteristic flight behaviors. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135546.html",
      "state": "AK",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6dbe",
      "summary": "At approximately 5:50 am I saw 4 bright lights over the air force base. The lights hovered in the shape of a diamond or kite for just a",
      "city": "anchorage",
      "shape": "diamond",
      "date": "2017-07-27T00:00:00",
      "story": "At approximately 5:50 am, I saw 4 bright lights over the air force base.  The lights hovered in the shape of a diamond or kite for just a few seconds before disappearing.  The UFO was in the clouds and did not move.  Within seconds the lights fainted and disappeared.",
      "link": "http://www.nuforc.org/webreports/135/S135382.html",
      "state": "AK",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c72a6",
      "summary": "Large circular object hovering right above tree line with white lights that blinked in a strait line  circling the object every 3 secon",
      "city": "anchorage",
      "shape": "cylinder",
      "date": "2017-06-02T00:00:00",
      "story": "Large circular object, hovering right above tree line with white lights that blinked in a strait line, circling the object every 3 seconds or so, was very close with no sound moving side to side in a zig zag motion moving at a slower pace stopping periodically then would speed up erratically this occurred two morning in a row approximately 30 min apart from each other on the south side of Anchorage in the same exact spot.",
      "link": "http://www.nuforc.org/webreports/134/S134301.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7675",
      "summary": "Anchorage Alaska Gray Aliens are conducting barbaric inhumane human experiments on innocent children,that needs to be destroyed!",
      "city": "anchorage",
      "shape": "circle",
      "date": "2018-01-12T00:00:00",
      "story": "Anchorage Alaska Gray Aliens are conducting barbaric inhumane human experiments on innocent children,that needs to be destroyed! The UFO were dropping from stationary stars over anchorage.  They were dropping straight down like they were leaving from  it and the others were moving beneath the darkness horizontally.  These were distinctively different than the orange circle fleets that popped up from the ground formed a serpentine geometrical danse and dispersed.  Or the fake red helicopters that are sometimes utilized by them. ((NUFORC Note:  For some reason, the witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138068.html",
      "state": "AK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e65",
      "summary": "Horizontal white cigar shape UFO in Anchorage, AK.",
      "city": "anchorage",
      "shape": "cigar",
      "date": "2018-05-15T00:00:00",
      "story": "Horizontal white cigar shape UFO in Anchorage, AK. Me, three friends and my friend's mom were in the car on the way to get food.  We saw a shiny weird object in the sky, and it wasn't really moving much, and there was only one of them at the time.  It was a horizontal cigar shape, and it was white/silver.  It wasn't were any plane could have been, and it was too high in the sky for it to be a balloon or sign.  We aren't exactly sure how long it stayed there, as we were in a moving car and eventually it was out of view.  It also appeared to be pretty far away, so it could have had lights, or it could have been moving more if we observed it up closer.",
      "link": "http://www.nuforc.org/webreports/141/S141458.html",
      "state": "AK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fe9",
      "summary": "Star-like Object in Rapid Non-Linear Motion",
      "city": "anchorage",
      "shape": "unknown",
      "date": "2018-04-13T00:00:00",
      "story": "Star-like Object in Rapid Non-Linear Motion Currently observing a mysterious light source beyond the distant Northeast sky.  At first, I assumed it to be a sparkling star, or far away plane, but then its motion demanded more critical attention.  It moves at a constant and seemingly unpurposeful rate and direction, resembling the actions of an insect (sometimes fast, sometimes slowly, back and forth, and in circles).  Less frequently, minute alterations in the light distribution suggest multiple aspects but these are fleeting.  The colors are indistinguishable yet alternating.  It looks mostly white.  It has not crossed a significant amount of sky span from this perspective, yet it seems very very far away.  Its speed and fluidity is phenomenal!  It does not grow nor reduce, and the light reflected by it flickers.  It is mesmerizing!  Ongoing, 30 mins since being noticed.",
      "link": "http://www.nuforc.org/webreports/139/S139377.html",
      "state": "AK",
      "duration": "Continuous"
    },
    {
      "_id": "64d005f478aba2ec5a3c803c",
      "summary": "So standing on my porch having a smoke and what i thought was a dark cloud over downtowwn anchorage i noticed it slowly moving but not",
      "city": "anchorage",
      "shape": "changing",
      "date": "2018-04-05T00:00:00",
      "story": "So, standing on my porch having a smoke, and what i thought was a dark cloud over downtowwn anchorage i noticed it slowly moving but not in a cloud movement, you could see it move to see its length and then its width. was a dark grey object.  i grabbed my binoculars.  When i returned to get a better look it was farther away and when i looked from what i observered it had a \"smokey trail\".  i have no idea what i saw so if anyone also saw this event id love to read what you saw.",
      "link": "http://www.nuforc.org/webreports/139/S139340.html",
      "state": "AK",
      "duration": "5+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c808e",
      "summary": "Metallic cylinder with no lights hovering then moved rapidly West and up into clouds.",
      "city": "anchorage",
      "shape": "cylinder",
      "date": "2018-03-23T00:00:00",
      "story": "Metallic cylinder with no lights hovering then moved rapidly West and up into clouds. A stationary cylinder shaped object was seen hovering just below cloud level.  It was metallic looking with no exterior lights.   At first I took it for a flock of birds, but then realized it was a single object of undetermined size.  It did not move for approximately 1 minute, it then moved rapidly laterally to the West and then rapidly up into the clouds in a motion impossible for any aircraft.",
      "link": "http://www.nuforc.org/webreports/139/S139143.html",
      "state": "AK",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b78",
      "summary": "They hovered in the same spot for 2 mins then lined up next to each other. ((anonymous report))",
      "city": "anchorage",
      "shape": "light",
      "date": "2019-03-14T00:00:00",
      "story": "They hovered in the same spot for 2 mins then lined up next to each other.  The middle one disappeared but the other two remained in the same spot.  Then the middle one appeared next to the other light on the right hand side.  Then the other light that was on the bottom disappeared and the other two now remained still in the same spot. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145060.html",
      "state": "AK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d39",
      "summary": "Saw a silver sphere that moved slowly, gradually picking up speed, moving from north to south.",
      "city": "anchorage",
      "shape": "sphere",
      "date": "2019-01-11T00:00:00",
      "story": "Saw a silver sphere that moved slowly, gradually picking up speed, moving from north to south. I was taking out trash at the end of my shift and having a cigarette.  I heard a hissing sound, almost like something was releasing an air brake (though not as sharp and loud).  I looked up and saw a silver sphere about 50 feet over a field across the highway from me, at approximately 100 yards away. The sphere moved slowly and gradually picked up speed, going from north to south. It took 10-12 seconds to go from where I first saw it until it vanished from sight to the south.  I could see the ground reflected on the bottom of the sphere as it flew by.  I seem to recall two jet fighters chasing after it almost immediately after it began acceleration. This isn't the first or the last time I've seen UFOs, just the more memorable one because of the jet fighters. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144335.html",
      "state": "AK",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f26",
      "summary": "Green Light in Sky after Nov 30 Earthquake near Anchorage, Alaska. ((anonymous report))",
      "city": "anchorage",
      "shape": "light",
      "date": "2018-12-06T00:00:00",
      "story": "Green Light in Sky after Nov 30 Earthquake near Anchorage, Alaska. Heard on Radio Station at approx. 9am 11-30-18 after 7.0 Magnitude Earthquake near Anchorage, Alaska.  2 people called in Station saying they saw a Green Light in Sky after our Major Earthquake.  I never heard anything further.  Radio listener. Thanks if anyone has information. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  For some strange reason, witness indicates that the date is approximate, even though the time and date of the earthquake are both known.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143952.html",
      "state": "AK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fce",
      "summary": "I live in Wasilla and was hearing a weird rumble for about 10 minutes. Not thunder. Not jets flying over. Went out and looked over Cook",
      "city": "anchorage",
      "shape": "light",
      "date": "2018-11-24T00:00:00",
      "story": "I live in Wasilla and was hearing a weird rumble for about 10 minutes.  Not thunder.  Not jets flying over.  Went out and looked over Cook Inlet and saw bright white lights in a stack.  Not moving.  One would blink out then another until there were only 2 then more would blink back on.  Most I counted were 5.  All lined up in a stack.  Not moving and no other lights other than very bright white.  No green or red. At one point they all went out.  Then one blinked back on and lit up the sky.  Then another blinked on.  I watched while the weird rumble continued.  After about 10 minutes, all blinked out and the rumble stopped. ((NUFORC Note:  Witness submits a very nice photograph, showing five bright white, or yellow, lights, positioned against a dark nighttime sky.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143815.html",
      "state": "AK",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9859",
      "summary": "bright light on chugach mountain range moving in southern direction across mountain",
      "city": "anchorage",
      "shape": "",
      "date": "2019-10-04T00:00:00",
      "story": "bright light on chugach mountain range moving in southern direction across mountain",
      "link": "http://www.nuforc.org/webreports/149/S149067.html",
      "state": "AK",
      "duration": "15 minutes"
    }
  ]
}