{
  "city": "arlington",
  "fetch_timestamp": "2025-07-12T14:33:06.739550",
  "record_count": 130,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b41d0",
      "summary": "Enormous UFO Arlington, Texas",
      "city": "arlington",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "Enormous UFO Arlington, Texas Although I have given the date of my sighting as December of 1993, I am unsure of the exact date.  I was driving East on Arkansas Lane in Arlington Texas in early afternoon.  As I topped the hill and approached the intersection of Park Springs and Arkansas Lane I saw an enormous oval shaped disk that appeared to be made of highly polished silver, hovering over the City of Grand Prairie, Texas, which is the City to East of Arlington and about 10 miles from the intersection I was approaching.  It seemed to me to be about the width of a football field or two and was much larger on the horizon than the Dalworthington Gardens Water tower that came into view as I approached the next traffic light at the corner of Spanish Trail and Arkansas Lane.  The strange thing about this sighting is that the UFO appeared to be appearing and disappearing as it sort of wobbled while sitting there in the sky.  Although I did not see any airliners at that time, The UFO seemed to be sitting well above the trees that were visible to me and just under a landing flight path to DFW Airport that I generally always see a plane or two making a final approach when I travel East on Arkansas Lane.  Sometime before this sighting, I remember hearing about some one or some group trying to project a picture of Christ in the skyline above New York City and at first I thought that because the UFO was appearing and disappearing that perhaps that was happening here also.  However, this was in broad daylight.  I looked to my left, intending to honk at the white pick up truck to my left and call the driver's attention to what ever this was.  However when I looked at the driver, I could see that the gentleman driving the truck had his mouth open and was looking at the same sight I was seeing.  I continued down Arkinsas Lane and the UFO continued to hover and appear and disappear until I reached the intersection of Bowen Rd. and Arkansas Lane.  Then the UFO disappeared and never appeared again.  The next day, I was again in my car listening to either the local Classical or Oldies but Goodies Radio station, when the announcer made the following addition to a short news break, \"All you people in Arlington, who called in to report what you thought was a UFO yesterday were actually seeing a weather baloon.\"  I was not one of those people who called in, but I do know that what I saw was no weather baloon.  At the time of my sighting, I did not have a computer.  Two years later when I did purchase one, I began a search that continues today for someone, anyone who saw this same UFO  I am unsure of the date and even the exact year, but I know that others must have seen it and either called the authorities or a radio a station to report it.",
      "link": "http://www.nuforc.org/webreports/050/S50228.html",
      "state": "TX",
      "duration": "5 to 10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b44ce",
      "summary": "3 faded and/or dull lights (e.g. almost a cloaked effect) in the form of a triangle - moving at extremely high speeds from west-southwe",
      "city": "arlington",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "3 faded and/or dull lights (e.g. almost a cloaked effect) in the form of a triangle - moving at extremely high speeds from west-southwest to east-northeast over the Dallas/Ft. Worth Metroplex at approx. 10:15pm central time.  The lights looked as though they were perimeter-like lights although I did not see any solide structure between them.  The lights were not flashing, amber in color, and absolutely no sound to the event.  I am positive it was not an airplane.  If you didn't catch it moving across your line of sight (e.g. star-gazing or in my case talking on the phone sitting in a lounge chair outside on my backyard deck) you probably would have missed it.  A once in a lifetime event...  Wow!",
      "link": "http://www.nuforc.org/webreports/050/S50109.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b488d",
      "summary": "Bright white,star- like,moving and stopping over Southwestern Vermont,changing course easily",
      "city": "arlington",
      "shape": "light",
      "date": "2019-07-25T00:00:00",
      "story": "Bright white,star- like,moving and stopping over Southwestern Vermont,changing course easily On Sat evening July 13 2019 my husband and I were at our home sitting in chairs in front of the house facing East at 8:45pm.  We could see the moon to the East South East,  and it was big but not yet full. It was bright. The sky was dark blue. There were no stars visable yet ,due to the still illuminated sky.  At 8:57 I stared at the moon again, this time to see a bright star to the Right of it ( as seen in the video).  It was so bright I thought it was a planet. Not knowing my stars, I just wondered.  As I spent  a minute looking…it started to travel to the Right (south) about the same distance it was from the moon. It only took 5 seconds to cover that distance. Then it dead stopped.  It really caught my eye. My husband was now watching it. Then it moved Left , back to the original position. ( Video was taken after the movement) We decided to move inside the house at that point. At 10:25 pm we thought we could find some other stars to look at. We grabbed a white painters cloth and laid it in the backyard , I brought my strong flashlight with me. The sky was black with many stars . Within 1 minute, we again saw a bright star (among many that were visible that night) We were facing the West on a slight incline in the yard. Our heads were higher than our feet on this slope. We were facing Ball Mountain. Within a minute , we found a bright star traveling from right to left.(north to south) Then it stopped.  At this point I teased my husband and said,” hey lets call it over, maybe it can see us.” I waved the flashlight up and down and left and right about 5 times, immediately  this star started moving in our direction  (now it headed East).  It traveled quickly and directly towards our part of the sky. When it got close , it stopped. We were really frightened. I was sorry I flashed the light at it. We picked up the cloth and ran into the house. We did not go back outside. We did not speak about it. We do not know what we saw. We don’t want to know. – I do not think satellites change course like that. I don’t know if spy drones fly at night. I am unable to research this to my satisfaction. These flying stars were the brightness and size of a night time star. ( no trails, no other colors) If anyone can explain, we would be grateful.",
      "link": "http://www.nuforc.org/webreports/147/S147636.html",
      "state": "VT",
      "duration": "10minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b48db",
      "summary": "Silver Cylinder Flying Dark over the Far West Valley",
      "city": "arlington",
      "shape": "cylinder",
      "date": "2019-06-07T00:00:00",
      "story": "Silver Cylinder Flying Dark over the Far West Valley Guarding a construction site quite aways out into the desert that doesn’t usually have a lot of air traffic, save a freighter coming to Phoenix every now and again early in the morning. Co-worker and I were sitting in a new area facing the open desert, when I happened to glance up and see what appeared to be a plane or similar flying very low and VERY almost alarmingly slow.  There were no indicator or headlights of any kind, and no noise that would suggest a plane engine.  I happen to have both a flight radar and an Air Traffic Control tower app on my phone, and neither picked up a reading from it or any sort of distress call. It appeared to be a silver cylinder or cigar shaped object headed East towards Phoenix.  The lights from a nearby site reflected off the bottom of it as it cruised over and we watched it for several seconds before it suddenly turned and bolted North into the open darkness VERY quickly.",
      "link": "http://www.nuforc.org/webreports/146/S146330.html",
      "state": "AZ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4985",
      "summary": "My wife and I witnessed a dark shadow moving down our sidewalk when nothing was there to make a shadow for an entire block.",
      "city": "arlington",
      "shape": "other",
      "date": "2019-07-05T00:00:00",
      "story": "My wife and I witnessed a dark shadow moving down our sidewalk when nothing was there to make a shadow for an entire block. After moving into my wife's house in Arlington Washington, near Arlington airport back in 2004 we witnessed something extraordinary while clearing and plowing a new garden in our backyard. Our cat suddenly started to act odd and was making strange yowling noises. She then suddenly jumped over our wood fence into the front yard in a run. That struck me as very odd. So I looked through the slits between the fence boards to see where she was going.  As I peered through the slits between the boards of the fence I saw a shadow moving down the sidewalk outside our house. At first I didn't think much of it. But then the alarms went off when I realized that shadow was showing up on the ground under the shade of a very large tree we have in our front yard. How can there be a shadow inside a very shaded area? That is when I looked again, but closer. Then I saw it. a thick very black shadow on the ground that was moving from 176th PL NE on 39th Dr NE in a south direction on the sidewalk past our house. I then noticed not only was our cat following this shadow on the ground, but a few other cats from our neighborhood were also following it. Ever seen a cat go after a laser pointer? That is exactly what all the cats were doing. Like they were trying to catch it. I know it wasn't just the shadow that attracted them because of the way our cat sensed it from the other side of the fence in our backyard. It was really weird.  Then I pulled my head over the fence to look straight at it. This thing was invisible when you looked at it straight on, you couldn't see it at all. You could only see it when looking through the small gaps between the boards of our fence. It was moving slowly. To me it looked like the shape of a guy in a space suit pulling a kids wagon. I called my wife over to look. It took her a while to see it, and it didn't register with her that it was something unusual. I had to point it out to her. I said \"It's a shadow in the shade\"! Then she got it and her eyes got big. We watched it until it moved too far down the street for us to see it anymore. The last thing we could see were the cats following it because the street turns sharply just a few houses down and changes name to 175th PL NE. We decided whatever it was we didn't want to mess with it or investigate further. Especially since we couldn't see it looking straight at it.  Another caveat to this story is we had a child's wading pool full of water in our front yard. It had no leaks. I say this because it would hold water all day long. But all this same week leading up to this anomaly (shadow thing), at night the kid wading pool would get completely drained. As if something or someone was siphoning out all the water. I kept filling it back up and testing it for leaks. It would hold all day everyday, but be empty in the morning.  A few days after all this happened someone from Snohomish water conservation came to offer us \"free rain barrels making class\". She seemed very interested in striking up conversation. She was cute, blond, late 20s to early 30s. But she just stood there not saying anything after introducing herself and handing me the pamphlet about the class. But she was waiting for me to say something. It was REALLY strange and awkward. I got the distinct intuition that it was related to the shadow we witnessed and the disappearing water. Whatever that thing was, they knew about it and wanted to help us put water out for it. They knew it was taking water off of our property and they were trying to get us to provide water at that location for it. We went to the class and I did set up that rain-barrel. But I put cameras on it. Nothing ever showed up and I never noticed water missing from that rain barrel. I still get newsletters from that group at Snohomish water conservation to this! day. I never posted anything because I didn't know where to post it! And the whole thing seemed too far fetched to tell people about. Seems appropriate here among all the glowing lights people report. http://snohomishcd.org/rain-barrel-program/",
      "link": "http://www.nuforc.org/webreports/147/S147254.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b73",
      "summary": "Stepped out to with dog before bed.  Noticed a moving light in the N sky about the size of &quot;Venus ?&quot;. It was moving v",
      "city": "arlington",
      "shape": "light",
      "date": "2019-07-25T00:00:00",
      "story": "Stepped out to with dog before ebbed.  Noticed a moving light in the northern sky about the size of &quot;Venus ?&quot;. It was moving v Stepped out to with dog before ebbed.  Noticed a moving light in the northern sky about the size of \"Venus ?\". It was moving very slowly.  No sound.  No flashing lights like an airplane would have.  It slowly disappeared as I watched it. I live near an airport and see dozens of planes daily.  This was very different! Moved north east as it traveled. I took a video but it is grainy and doesn't show much.",
      "link": "http://www.nuforc.org/webreports/147/S147772.html",
      "state": "WA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b72",
      "summary": "Stepped out to with dog before ebbed.  Noticed a moving light in the northern sky about the size of Venus?  It was moving.",
      "city": "arlington",
      "shape": "light",
      "date": "2019-07-25T00:00:00",
      "story": "Stepped out to with dog before ebbed.  Noticed a moving light in the northern sky about the size of &quot;Venus ?&quot;.  It was moving v Stepped out to with dog before bed.  Noticed a moving light in the northern sky about the size of \"Venus ?\".  It was moving very slowly.  No sound.  No flashing lights like an airplane would have.  It slowly disappeared as I watched it.  I live near an airport and see dozens of planes daily.  This was very different!  Moved north east as it traveled. I took a video, but it is grainy and doesn't show much.",
      "link": "http://www.nuforc.org/webreports/147/S147773.html",
      "state": "WA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b50a5",
      "summary": "Bright pulsation lights over Arlington VA",
      "city": "arlington",
      "shape": "flash",
      "date": "2007-10-08T00:00:00",
      "story": "Bright pulsation lights over Arlington VA At about 1:30 am I heard a roaring sound over south Arlington VA. Most unuusal for early am..as National airport has no flight operations that late. I live in a high rise and was surprised to see 3 very bright pulsating lights flying in a random manner over the area. They did not seem to have red or green lights...only a very brignt white light pulsating... ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58187.html",
      "state": "VA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5549",
      "summary": "Close Call with Huge Triangular Craft",
      "city": "arlington",
      "shape": "triangle",
      "date": "2007-11-28T00:00:00",
      "story": "Close Call with Huge Triangular Craft I was driving home at approximately 2:30-3:00 a.m., heading north on I-5 from Everett to Arlington. It was a clear night. As I approached the Smokey Point Exit, I noticed a very bright white light (the size of a bright star) traveling from the east to west. It was several miles north of my location. At first, I thought it was a shooting star. But it wasn’t moving as quickly, and it was blinking at the rate of about once per second as it moved across the sky. I watched it for several seconds, and thought perhaps it was a satellite. As soon as that idea crossed my mind, the light suddenly shot back the way that it came, zipped up, zipped north, and then shot east again...and disappeared. It startled me quite badly, and I felt nervous as I continued off I-5 at the Smokey Point (#206) exit. I kept searching the sky, looking for the mysterious light, thinking it might reappear near the place that it had disappeared.  As I turned east and came to stop at the light at Smokey Point Boulevard, I glanced around and looked directly up. I was terrified to see an extremely large triangular object hovering directly above the intersection. It was so low that the streetlights shined on its underside, highlighting large rectangular shaped panels and what appeared to be rivets that were spaced very far apart.  I can’t describe the size of the craft, because it extended beyond my scope of vision lengthwise, and I could see clusters of small white lights that indicated the shape. Could it be that they saw my headlights, and traveled to the intersection where I was heading toward? It HAD to be more than a coincidence.  I couldn’t believe my eyes. I looked around for other people who might see what I was seeing, but there were no other cars around, and no people to be seen at the 7-11 store on the corner.  Even after all I’d witnessed, I really hoped that my imagination was playing tricks on me, so I looked up and expected that \"it\" would be gone. But, it was still there.  I then noticed that it made no noise and created no turbulence in the air. I got SO frightened that I ran the red light, turning north onto Smokey Pt. Boulevard and drove as fast as I could all the way home. I never heard any other reports of this.  It has bothered me ever since, and I am uncomfortable to this day about looking skyward. ((NUFORC Note:  Date may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59514.html",
      "state": "WA",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a83",
      "summary": "Triangular object with at least 5 round dim lights moving from West at very slow pace.",
      "city": "arlington",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "Triangular object with at least 5 round dim lights moving from West at very slow pace. I recently started looking through NUFORC.com in hopes of finding a similar sighting, which my father and I saw together. I was startled to find that someone had posted a sighting of the very object we saw and even stranger that the UFO was in the same town, on the same date, at the same time, and moving in the same direction - West to East.  We were just oustide my new home in Arlington, TX, when the object caught our attention. We both looked up and saw a rather large black trianglular object moving very slowy and seemingly very low, directly above us. The object was pitch black, against the night sky, with several large circular, but very dim, lights underneath. No other deatails could be made out and it seemed to glide accross the sky, in complete silence, and then it just dissappeared, soon after it passed overhead. The whole incident lasting only a minute.  The report I found of this sighting in NUFORC.com was seen from a different angle than myself, and the other viewer was able to see some more detail than I remember, however, I was able to see the lights underneath in more detail than what the other report describes. There were at least 5 perfectly round lights that were evenly dim, I was able to see them, but they did not give off any rays of light.  There is no stranger feeling in this world than experiencing a UFO, especially when it comes so close. It is gratifying to know someone else saw the same object. But even stranger it would be over 30 years before I would find that out.",
      "link": "http://www.nuforc.org/webreports/056/S56006.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c24",
      "summary": "Dissappearing Orange Ball of Light",
      "city": "arlington",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Dissappearing Orange Ball of Light While driving down a country road we noticed a large Orange Colored (and White, not a plane, it was not red) light to the north. We continued to watch this large light for about 1 minute. It then dissappeared. It was a very clear night. I have lived in the country most of my 37 years. I was in the Military for 6 years. I am not prone to \"Seeing Thing\". I have never seen anything like this before!",
      "link": "http://www.nuforc.org/webreports/060/S60112.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5fb2",
      "summary": "3 dark spots in sky flying in formation, turned into 4 and dissappeared",
      "city": "arlington",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "3 dark spots in sky flying in formation, turned into 4 and dissappeared Driving south on I-5 just north of Arlington/Smokey point exit. Saw 3 dark spots against blue/partly cloudy sky maybe a half mile away. Couldn't make out tail or wings, flying in a formation heading what looked like southwest. 3 turned into 4, still flying in tight formation, ascended towards a cloud, flew into the cloud and I didn't see them again.",
      "link": "http://www.nuforc.org/webreports/063/S63082.html",
      "state": "WA",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b60ce",
      "summary": "lights in the sky and time lapse",
      "city": "arlington",
      "shape": "flash",
      "date": "2008-06-12T00:00:00",
      "story": "lights in the sky and time lapse   i was driving home from work late saturday night (early am sunday), when i turned right by the park across the street from my apartment, i saw a huge flash in the sky with no lightning. What I did see was sort of a small circle (the size of a pencil eraser in the sky) glowing bright white light and shooting diagonally and silently toward the earth. When I turned the corner a couple of blocks away I had glanced at the clock on my radio and it read 12:14, when i arrived home and sat on the couch it was closer to 12:34 or 44 I can't remember but it seemed very odd to me.",
      "link": "http://www.nuforc.org/webreports/063/S63099.html",
      "state": "TX",
      "duration": "seemed like just a couple"
    },
    {
      "_id": "64d005f478aba2ec5a3b63fa",
      "summary": "The fastest falling metour without a tail that was no common airplane!",
      "city": "arlington",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "The fastest falling metour without a tail that was no common airplane! At approximatly 7:15 pm, Thursday, Oct. 25th, I was driving in an easterly direction, in Arlington, Texas.  More specific, I had just turned left onto Rosewood lane from Collins street. The sky was at dusk, still with a lot of blue, and a mostly full moon was staring me in the face.  All of a sudden, a bright \"star-like\" object, (much brighter than Venus), appeared at the top of my windshield, falling hard and moving fast toward the horizon. I can assure you it was no airplane, for, to be honest, I'm smarter than that.  I know when I see an airplane, and THIS was no airplane!  This unidentified falling object moved too fast and the light did not \"twinkle\", or \"blink\".  It traveled from the top of my windshield to the horizon in a matter of 10 seconds, or so, keeping in mind I was on a residential street, not exceeding 15 miles per hour. My raw impression, is that whatever this thing was, \"IT\" came from the atmosphere and hit the ground.",
      "link": "http://www.nuforc.org/webreports/059/S59438.html",
      "state": "TX",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6497",
      "summary": "I was sitting on the bleachers of a baseball field next to the arlington county public library. I looked up and saw a ship about maybe",
      "city": "arlington",
      "shape": "triangle",
      "date": "2007-06-12T00:00:00",
      "story": "I was sitting on the bleachers of a baseball field next to the arlington county public library. I looked up and saw a ship about maybe 100 ft in the air. It's size was half the size of the arlington library and it was triangular with the corners cropped off. It hovered and made absolutley no sound whatsoever as it passed. There were lights on each end of the ship and as it passed it seemed to give out a calming emission of some sort. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56820.html",
      "state": "VA",
      "duration": "2minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ce5",
      "summary": "\"Bat-wing\" aircraft swiftly crosses night sky on south-to-north trajectory",
      "city": "arlington",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "\"Bat-wing\" aircraft swiftly crosses night sky on south-to-north trajectory Guest leaving just before 10:00 pm reported seeing \"bat-wing aircraft\" fly across on south-to-north trajectory to west of house. Passed before I could get outside to see it myself. Described as high up but impressively large and very fast. One red light each wing and white light at front. Possible \"stealth\" aircraft. Observer said it made a noise, but not very loud. Location in north Arlington near Seven Corners.",
      "link": "http://www.nuforc.org/webreports/063/S63730.html",
      "state": "VA",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6fec",
      "summary": "Oval UFO streking southward in the DFW area, going about 1,000 mph silently.",
      "city": "arlington",
      "shape": "egg",
      "date": "2006-10-30T00:00:00",
      "story": "Oval UFO streking southward in the DFW area, going about 1,000 mph silently. UPs streaking across night sky, vary fast and silent.  estimated about 1,000 mph.. Appx 3,000 to 5,000 feet high. I'm age 51, a business owner, and a very levelheaded person.  Not drinking at all I might add.",
      "link": "http://www.nuforc.org/webreports/052/S52532.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7190",
      "summary": "White oval (weather balloon?) over The Ballpark",
      "city": "arlington",
      "shape": "oval",
      "date": "2007-04-27T00:00:00",
      "story": "White oval (weather balloon?) over The Ballpark While watching the Rangers game, a white object was observed over The Ballpark (Texas Rangers)that was likely a weather balloon.  It appeared to be relatively high as DFW Airport had a take-off pattern to the east of the stadium and the planes were lower then the object.  It drifted toward the northeast (possibly upword), did not appear to have flashing or constant lights, and faded toward the northeast.  I took a few pictures, but the object was very blurry (can submit if requested).  We were just wondering if anyone else saw the object.",
      "link": "http://www.nuforc.org/webreports/056/S56035.html",
      "state": "TX",
      "duration": "3 Mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7444",
      "summary": "A  distant explosive sound as the area around me turned deep blue  for a second and then I witnessed two bright lights in the sky.",
      "city": "arlington",
      "shape": "fireball",
      "date": "2007-08-14T00:00:00",
      "story": "A  distant explosive sound as the area around me turned deep blue  for a second and then I witnessed two bright lights in the sky. I was in my backyard and night had fallen completely so it was very dark, yet I remember the moon was almost full. I was looking straight ahead of me, playing ball with my dog when I heard was sounded like a distant explosion and a second after I heard the sound, the ground and the area right above it turned to what looked like a deep, velvety blue. Something made me look up at the sky to the east where I saw the ending of an explosion of a giant ball of white/golden light. It faded entirely and then what remained a little off to the side of where the light had been was a vibrant, yet misty purple/blue/yellow haze which faded slowly and then disappeared completely, returning the sky to blackness. I likened the purplish haze to that of a nebula – the colors, patterns and shape of the mist resembled photos of nebulae I have seen. Unfortunately, my mother was inside the house and I was the only one to witness the whole thing. I posted the story on a couple of UFO websites, hoping to find someone who had witnessed the event as well yet received no response. The entire event happened very quickly, but still after all this time, it still leaves me unsettled and baffled. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58034.html",
      "state": "TX",
      "duration": "Around one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7517",
      "summary": "Approaching intense bright white light with a rainbow spectrum in the center witnessed at sun down on 04/07/07.",
      "city": "arlington",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "Approaching intense bright white light with a rainbow spectrum in the center witnessed at sun down on 04/07/07. I was standing on the balcony smoking a cigar. I am watching the sun set to my right and at the same time there is another form of light that is forming right in front of me getting larger and more intense with its own light much brighter than the sun light. It was almost so bright creating a rainbow effect. I was really stuck in place, and I couldn't move for a secound then I snapped three pics using my cell phone camera. I would love for you to look at them and explain to me what it was....Really the pictures show it in clear detail... ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56137.html",
      "state": "VA",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b75f3",
      "summary": "Bright object in the sky changing shapes before taking off at a vary high speed. (Like 0 4,000mph in .090 seconds)",
      "city": "arlington",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "Bright object in the sky changing shapes before taking off at a vary high speed. (Like 0 4,000mph in .090 seconds) It was little before dark and the sky was blue and pink with some clouds in the distance, Air plains were flying   all over. Suddenly A bright small light caught my attention, and when I looked up I seen a little dot glowing. It changed into a tear drop shape then it just took off. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59075.html",
      "state": "TX",
      "duration": "two -tree minuts"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a01",
      "summary": "Around 16:00 on 10.7.06, I spotted a cylinder like object NNW of Arlington, TX. I observed the object for around 10 min, it didn't appe",
      "city": "arlington",
      "shape": "cylinder",
      "date": "2006-10-30T00:00:00",
      "story": "Around 16:00 on 10.7.06, I spotted a cylinder like object NNW of Arlington, TX. I observed the object for around 10 min, it didn't appear to move but it was really hard to tell at that time. I was in my way to a grocery store when I spotted the object in the sky. The object does appear to be moving at a very slow rate. I arrived home and pulled out my binoculars, I found the object and was able to gather more of a detailed picture. The object appeared to have a goldish,bright light emitting from it and a haze surrounding it. The object appeared to be very large, and just above the clouds. At times it looked liked two lights moving in a slow rotation, never completeing a full turn. When I first noticed the object it looked cylinder in shape, after 30 or so minutes, It changed to a circle like shape. I live around 10-15 miles from DFW and the object appears to be hoovering in that general direction. I'm not sure if what I observed was a weather ballon, I doubt that though. I've lived near the airport for nearly 7 years and I've never seen a weather ballon in that area before. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52830.html",
      "state": "TX",
      "duration": "96 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b37",
      "summary": "I was having a smoke,  I looked up into the sky  and saw an unusual light East North East,  from where I live in Arlington,  the UFO ap",
      "city": "arlington",
      "shape": "sphere",
      "date": "2007-02-01T00:00:00",
      "story": "I was having a smoke,  I looked up into the sky  and saw an unusual light East North East.  From where I live in Arlington, the UFO appeared over Darington, WA, ((to the northeast)) The craft moved very slow,  away from our perspective.  I ruled out a plane or chopper.  The craft moved quite slow.  Lights moved around the craft.   I got out the binoculars  and showed my wife and kids.  I may be wrong in understanding what it was we saw,  however,  \"it falls under the catagory of UFO as I understand it....  Maybe some kind of military OP. going on?   ((names deleted))   Arlington, WA  98223",
      "link": "http://www.nuforc.org/webreports/055/S55029.html",
      "state": "WA",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b7c58",
      "summary": "Two lights- no sound- being pursued by large military helicopter at low altidude",
      "city": "arlington",
      "shape": "light",
      "date": "2007-02-24T00:00:00",
      "story": "Two lights- no sound- being pursued by large military helicopter at low altidude February 23, 2007 Arlington, Washington  I had gone to my back deck to have a smoke at 8:45 Pm last night. I heard what I thought was a lifeline (hospital), helicopter hovering over the nearby hospital. However the engines were too loud for a smaller search and rescue type helicopter. So my attention was drawn to see what was evidently on a path that would bring it very close to my house. As I looked to see what kind of helicopter it was, suddenly I noticed two bright lights traveling together in a straight path approximately a hundred feet apart. They were moving at least three hundred to four hundred miles an hour approximately a hundred and fifty feet in front of the helicopter. All three aircraft were traveling at only around three hundred feet in altitude. Directly in pursuit of the two lights was a very large, single rotor, obviously military helicopter with all of its flashing lights. The two lights made no noise, and had no other flashing or strobe lights- (proximity lights), just two \"star-like\" lights. I did not realize what I was watching until after the event. The two lights were traveling in a very straight path almost as if they were trying to elude the military helicopter, or possibly the helicopter was escorting them. The whole event only lasted for aproximately 30 seconds. It took three seconds for all aircraft to cross the night sky over my head. I could not make out any shape around each of the two unidentified lights I am not sure what I had just witnessed, but this was very unusual. I have been an Airworthiness Inspector for over twenty years and in aircraft for thirty, and I have never seen anything like this. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55417.html",
      "state": "WA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f3d",
      "summary": "At 9:30 pm, two oval shaped objects were seen in the sky. 10 mins later they turned north and flew off.",
      "city": "arlington",
      "shape": "oval",
      "date": "2009-12-12T00:00:00",
      "story": "At 9:30 pm, two oval shaped objects were seen in the sky. 10 mins later they turned north and flew off. At Approxametly 9:30 pm, I was outside practicing my Tai Chi, when I saw two large, oval shaped objects hovering and spinning about 700 feet above me, They made a low whistling sound as they spun. They hovered there for a good 10 minutes, then they turned north and zoomed off at an unconcevable speed. I did not speak further to anyone about the encounter.",
      "link": "http://www.nuforc.org/webreports/072/S72746.html",
      "state": "MA",
      "duration": "5-10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8133",
      "summary": "grayish color sphere shaped craft,no lights, and two more smaller crafts came out of the rear of the larger craft.",
      "city": "arlington",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "grayish color sphere shaped craft,no lights, and two more smaller crafts came out of the rear of the larger craft. We were in the woods with our hunting dogs and we saw one large sphere shaped craft and out of that came two smaller spheres and flew toward us, and we ran back to the car through the woods.  We looked for it from the window of the car but it wasn't in our sight.  This was in a clearing in the wooded area. ((NUFORC Note:  Witness indicates that date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67581.html",
      "state": "VT",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b82a0",
      "summary": "At about 10:30pm my wife and I saw an object in the sky NNW approximately 25 degrees off the horizon.",
      "city": "arlington",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "At about 10:30pm my wife and I saw an object in the sky NNW approximately 25 degrees off the horizon.  The object appeared to be a bright star but was blinking with distinct alternating/vibrating colors: red, green, blue, yellow, white. The object appeared to be stationary.  I had a pair of binoculars --not sure what the magnification is, with which we both looked at the object, and it was indeed blinking those colors. This 'star' also appeared to change shape while watching through the binoculars, but maybe that was my imagination.  There were other stars near this object from our vantage point that were not behaving in a similar fashion.  I thought maybe it was a twinkling star. What do you think?",
      "link": "http://www.nuforc.org/webreports/072/S72341.html",
      "state": "VT",
      "duration": "indeterminate"
    },
    {
      "_id": "64d005f478aba2ec5a3b84b1",
      "summary": "Cone Shaped light from bright dot. ((NUFORC Note:  Missile launch.  PD))",
      "city": "arlington",
      "shape": "cone",
      "date": "2009-12-12T00:00:00",
      "story": "Cone Shaped light from bright dot It lasted 20 seconds or so a light in the sky, a bright dot in the sky, with a cone shaped light shining down at the ground. The dot raised up and disappeared but the cone shaped light remained, slowly fading away. The cone looked almost like a cloud of light. But it almost seemed as the light emitted from it was slow at disappearing, not like turning off a light. ((NUFORC Note:  Missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72444.html",
      "state": "MA",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8543",
      "summary": "About 7 pm Nov, 2, 2008 I was leaving a restraunt near the Parks Mall and I looked up and notice a very bright white light.  It appeare",
      "city": "arlington",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "About 7 pm Nov, 2, 2008 I was leaving a restraunt near the Parks Mall and I looked up and notice a very bright white light.  It appeared to look like a star but much larger and brighter, it was moving at a normal speed around 20,000 ft.  It did not look like a commercial aircraft because it was only glowing white light as it headed east towards Dallas.  Then it shut off like a flash light would do, there we no other lights to indicate where is was in the sky.  I heard no noise and even though it was high there was no indication of engines.",
      "link": "http://www.nuforc.org/webreports/066/S66658.html",
      "state": "TX",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b86a6",
      "summary": "Large oval object hovering over major Texas city",
      "city": "arlington",
      "shape": "oval",
      "date": "2008-10-31T00:00:00",
      "story": "Large oval object hovering over major Texas city I was sitting at my desk talking on the phone, and I looked up out the window.  I saw a grayish oval object hovering above the trees.  I watched it go down behind the tree line and then rise again several times.  I took pictures of it with my cell phone, but the object was too far away.  I tried to enlarge them, but the object is just blurred out. I am in a 3 story building and the object was about the same height, maybe a bit higher.  I could also swear that it seemed to be changing shape.  Started out pretty big, appeared to decrease in size, flatten out, and even looked to change into a diamond shape sort of.  If I had to guess, I would say it was about 20 miles away.  I am at work, so I had to do an xray.  When I came back it was gone and has not returned since.  I had one of my skeptical work mates look at it, and all she could say was that it had to be tethered to something.  It was raining here this morning with a slight breeze.  If it was a balloon, it was pretty big and grayish, not your typical bright balloon that you would associate with a promotion of some sort.  I really don't know what this was, but I felt compelled to report it.  Thank You",
      "link": "http://www.nuforc.org/webreports/065/S65287.html",
      "state": "TX",
      "duration": "approx.20min"
    },
    {
      "_id": "64d005f478aba2ec5a3b88ab",
      "summary": "The object emitted two smaller objects and made no sounds whatsoever.",
      "city": "arlington",
      "shape": "disk",
      "date": "2010-02-14T00:00:00",
      "story": "The object emitted two smaller objects and made no sounds whatsoever. My friend and I were running our hunting dogs in Arlington, Vt, off of Kelly Stand Road at 5pm in late August of 1976.  We started out in the woods about a half mile in, we came to a mountainess valley, and let our dogs off the leash to run.  After a few minutes, we happened to look into the sky and saw a large dish shaped object, dark grey in color, against a green mountain background so we could really see it clearly.  It was about three quarters of a mile away and looked very large to us.  As we looked at it in awe,two smaller objects came out of the rear or side of the large object.  This object made no sound or had no lights or windows that we could see.  Whe we witnessed this, we called our dogs in and ran back to our trucks. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73824.html",
      "state": "VT",
      "duration": "3 minuutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a30",
      "summary": "big point of light, first appeared to be a planet, but it was too much daylight for that. thought it was a weather baloon til it moved",
      "city": "arlington",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "big point of light, first appeared to be a planet, but it was too much daylight for that. thought it was a weather baloon til it moved Near the zenith (slightly south of zenith) looked to be 1/8th inch across from my distance, and it moved in a jerky (kind of) figure 8 then shot off to the southwest and disappeared instantly.",
      "link": "http://www.nuforc.org/webreports/066/S66894.html",
      "state": "TX",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ec5",
      "summary": "School bus size UFO hovering over river.",
      "city": "arlington",
      "shape": "oval",
      "date": "2008-08-12T00:00:00",
      "story": "School bus size UFO hovering over river. On Jun 1, 2008, an older woman and her son were camped in a tent on a slight rise overlooking the Gasconade River at the Arlington Campground.  A thunderstorm had just moved throught the area and as they exited their tent to check for storm damage between 02:30-3:00 A, they noticed an object suddenly appear over the river. The object was 125-150 yards from them and hovering about 20 feet over the water.  It looked like a flatened football. It was a beautyful metalic blue with a series of dull red, green and pretty blue lights around the edge.  The whole thing was enveloped in aqua blue fog which  also lit up the water beneath it. It was \"bigger than a school bus\"and was 5 inches long at arms length.  They watched it for 2-3 minutes when it raised up an additional 30 feet, hovered monentarily then departed to the northwest at a 45 degree angle at fantastic speed.",
      "link": "http://www.nuforc.org/webreports/065/S65187.html",
      "state": "MO",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f84",
      "summary": "Fast moving green and yellow in color at low altitude",
      "city": "arlington",
      "shape": "teardrop",
      "date": "2009-01-10T00:00:00",
      "story": "Fast moving green and yellow in color at low altitude Driving north on hwy 287 from Mansfield to Arlington  at 20:20 both wife and I noticed fast moving craft a low altitude. Bright Green light with yellow tail . vehicle moving at very high speed. Much faster than a normal aircraft. Visible for approx 10 seconds.",
      "link": "http://www.nuforc.org/webreports/067/S67072.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b97c7",
      "summary": "Large, very well lit sphere shaped object flying very low over my neighborhood then disappeared",
      "city": "arlington",
      "shape": "sphere",
      "date": "2008-10-31T00:00:00",
      "story": "Large, very well lit sphere shaped object flying very low over my neighborhood then disappeared I was walking by the window in my living room and saw a bright lights in the shape of a sphere. The lights seem to be individual lights that lit up the entire thing in the front it had a flashing red light as well as on top and bottom too. It was only about 500 feet or less in the air over my neighborhood. There was no sound. It slowly moved behind a large tree in our backyard. I had enough time to wake up my husband and show him before it disappeared behind the tree. He thought it was a blimp but it was not shaped like one. There was no writing on it and there was not an area to fly the thing below it like a blimp has. It was lit up like a Christmas tree. The red lights blinked but the white lights remained constant. Very strange...",
      "link": "http://www.nuforc.org/webreports/066/S66012.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a6e",
      "summary": "explanation of earlier report",
      "city": "arlington",
      "shape": "other",
      "date": "2009-08-27T00:00:00",
      "story": "explanation of earlier report This is a follow up to a report I made earlier about loud booms, lights in the sky, and an unknown object being transported on a flatbed truck from a supposed crash site near Arlington,Tx. The object was a full scale model of an F-35 being transported to England from Lockheed in Fort Worth, with a military escort. The loud booms and lights in the sky were fireworks from a nearby racetrack in Kennedale, Tx. at 10:30pm to 12:30 am. It turns out the emergency vehicles in the parking lot of the supposed crash were part of a candlelight vigil for a skateboarder killed the night before on the access road of I-20 at that location. The two incidents were separated by 3 hours, and the military convoy just happened to pass by at the time of the vigil, around 9:30 pm, and there were entrance ramps to the freeway at that location blocked for the passing of the oversized load.",
      "link": "http://www.nuforc.org/webreports/071/S71612.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c0e",
      "summary": "Reddish-lights traveling erractically.",
      "city": "arlington",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "Reddish-lights traveling erractically. Around 21:01 on 03/29/10 - I was taking my two dogs out for restroom break when I looked up at the moon. The moon towards my right or east postion. I was checking out the moon when I noticed a flash - at first I thought it was a planes FAA collision lights blinking, but it only blinked once. As I contunued to watch the object travel towards the East I noticed it splitting into two objects. One object headed North and the other kept traveling towards the East. I was able to watch both objects for a couple of minutes until they disapeared into the night. The weather was clear and breezey with a slight haze covering the sky. The objects were identical - both round and reddish - moving fast and erratically. I've worked near the airport for almost 12 years and Ive never witnessed anything like that before.",
      "link": "http://www.nuforc.org/webreports/074/S74825.html",
      "state": "TX",
      "duration": "2 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e25",
      "summary": "A star like object moving up and down rapidly and disappeared in the sky",
      "city": "arlington",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "A star like object moving up and down rapidly and disappeared in the sky I was sitting outside my house with three of my friend.  As we was talking I so happen to look up and I seen a star like object moveing rapid through the sky.  Then all of a sudden it just disappeared",
      "link": "http://www.nuforc.org/webreports/075/S75576.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e02",
      "summary": "Bright Electric Blue Light in Arlington Texas Moving Very Fast in a Short Distance",
      "city": "arlington",
      "shape": "light",
      "date": "2010-06-23T00:00:00",
      "story": "Bright Electric Blue Light in Arlington Texas Moving Very Fast in a Short Distance A very bright electric blue light was seen just above the houses in South East Arlington. I noticed the light and advised my entire family to come out and observe as I noticed it was moving South slowly and was a color light I have never seen on an aircraft before.  As we watched, it started moving faster to the South, only to be amazed that a helicopter was following the blue light.  This struck fear as we continued to watch, when suddenly, the light shot back in the direction it was going, and immediately dropped below the house line. I ran into the house and grabbed my video camera.  The light returned and in a similar, but not exactly the same pattern, flew the same path running at very wild speeds. I was able to capture the light but due to how dark it was, kept having to zoom in and out to get a clear example of the brightness of the blue. It finally dropped again and was never seen again.  The sky was dark and very clear so this was by no means a spotligh! t as most of us were thinking.  I have the video but am not sure who to share it with for fear or rejection, but 5 of the most honest people I know watched this light move back and forth with no idea what it was we were watching.",
      "link": "http://www.nuforc.org/webreports/075/S75877.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ead",
      "summary": "Large bright star looking object moving slowly toward the northwest at 4AM",
      "city": "arlington",
      "shape": "light",
      "date": "2010-06-23T00:00:00",
      "story": "Large bright star looking object moving slowly toward the northwest at 4AM Went outside my house around 4:00AM June 20,2010, noticed a very bright star in the northwestern sky.   Almost in the same position as Venus at 9-10:00PM from my viewpoint.  After a few moments of watching I noticed bright glimmering lights as if you were shining a prism in the sun.  The object was very far in the distance I could not make out a shape.  Grabbed my telescope and focused on the object as it moved very slowly toward the northwest.  Colors were red, blue, green.  Once again moving to slow and large to be a plane going off in the distance.  I watch it until my point of view was blocked 30 min or so.",
      "link": "http://www.nuforc.org/webreports/075/S75864.html",
      "state": "TX",
      "duration": "30 plus minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba027",
      "summary": "Round white, red and blue twinkling lights, object not moving for a long time.  ((NUFORC Note:  \"Twinkling\" star?  Sirius?  PD))",
      "city": "arlington",
      "shape": "circle",
      "date": "2009-05-12T00:00:00",
      "story": "Round white, red and blue twinkling lights, object not moving for a long time Object twinkling in the sky, we thought it was a star or an aircraft but through binoculars we see that it is a circle twinkling with red and blue lights.  It has been sitting in the western sky for about an hour motionless other than the sparkling of the lights.  It's very high and looks pretty big.  But it is too far away to photograph, I don't have the right kind of camera",
      "link": "http://www.nuforc.org/webreports/069/S69737.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba202",
      "summary": "out of the night eastern sky,it appears to be a falling star at first,at super sonic speed.dull neon green light dot.suddenly,it went i",
      "city": "arlington",
      "shape": "chevron",
      "date": "2010-04-13T00:00:00",
      "story": "out of the night eastern sky,it appears to be a falling star at first,at super sonic speed.dull neon green light dot.suddenly, it went into a horizontal position heading north at a few thousand m.p.h.I could then see almost like a long stealth jet figure, with no streak at all, with a dull neon green around the frame of the craft.  No blinking lights.  I've seen the space shuttle,satellites, falling stars,j ets, but never have i seen a craft fly like this one. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75007.html",
      "state": "TX",
      "duration": "10 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3ba297",
      "summary": "Sphere that jolted, changed shape and color.",
      "city": "arlington",
      "shape": "sphere",
      "date": "2009-05-12T00:00:00",
      "story": "Sphere that jolted, changed shape and color. It was a sphere just above many planes.  It remained moveless but there were small sudden jolts.  Once or twice it became the shape of a cigar. It was constantly changing colors.",
      "link": "http://www.nuforc.org/webreports/069/S69799.html",
      "state": "VA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba547",
      "summary": "Two balls of light holding planes midair",
      "city": "arlington",
      "shape": "light",
      "date": "2008-07-05T00:00:00",
      "story": "Two balls of light holding planes midair Two lights. Have video tape. 2 Witnesses. Hovered for 5 minutes in one spot then one light moved above the other and flew off.  When it flew overhead it seemed like a plane but there is no way a plane could have done what it did.  Second light same thing.  Hovered 5 minutes more than flew over me.  Looks like a plane I think flying over but can’t explain what happened. Almost like two planes were held by two balls of light then let go.",
      "link": "http://www.nuforc.org/webreports/064/S64008.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba614",
      "summary": "black object appeared in the arlington sky after a mysterious thunderstorm. lightning still exists.",
      "city": "arlington",
      "shape": "oval",
      "date": "2008-08-12T00:00:00",
      "story": "black object appeared in the arlington sky after a mysterious thunderstorm. lightning still exists. The ufo was black in shape and silent. It was completely visible and moved slowly forward then up into the sky. My memory card on my camera was full. I wish I captured it. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64956.html",
      "state": "VA",
      "duration": "five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6fa",
      "summary": "Star like motionless object pulsating blue and red, lasted only five minutes and was gone",
      "city": "arlington",
      "shape": "other",
      "date": "2009-04-14T00:00:00",
      "story": "Star like motionless object pulsating blue and red, lasted only five minutes and was gone It at first seem to be an airplane, I noticed there was no movement. I went into the house (75 yard walk) to get my girl friend and have her get binoculars. We went back out the craft had still not moved. It appeared to pulse blue and red, to me it seemed to have a star like blue with a streaking effect like a comet. We went in to get warmer jackets. When we got back out it was gone!",
      "link": "http://www.nuforc.org/webreports/069/S69561.html",
      "state": "WA",
      "duration": "about 10min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba9d4",
      "summary": "On 8-17-10 about 7pm I went outside in my backyard and witnessed Neon Light Blueish lights in the sky NorthEast of me Flying in circles",
      "city": "arlington",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "On 8-17-10 about 7pm I went outside in my backyard and witnessed Neon Light Blueish lights in the sky NorthEast of me Flying in circles and dipping downward to the Earth at a very high rate of speed.  I watched for 5-10mins before I went and retrieved my wife to witness these lights as well. We looked on for about 10mins together before I went in my frontyard and tried recording with my phone for another 10mins before it disappeared.  I'm only reporting this because I read an article about the Sightings on MSNBC this morning as well as viewed a video that best shows what I witnessed on YouTube by Toomnymods.",
      "link": "http://www.nuforc.org/webreports/078/S78032.html",
      "state": "TX",
      "duration": "30mins"
    },
    {
      "_id": "64d005f478aba2ec5a3baac3",
      "summary": "2 Hyper White Blue lights when roll move completed, discovered as a 3 light triangle object",
      "city": "arlington",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "2 Hyper White Blue lights when roll move completed, discovered as a 3 light triangle object My first sighting was a few months which I reported a very bright blue light in the sky over Arlington moving in odd directions and followed by a helicopter.  My parents witnessed this with me and no explanation.   Well on Sunday night, the object returned, only this time, we were closer to the object.  I noticed it while at the bank, it appeared as 2 bright blue lights, a electric blue in which no other plane I have ever seen has had.   I called my wife who was around the corner getting yogurt, and then also saw the object. I took care of bank business as I watched the object move east and I thought it was going to disappear.  When I met with my wife a moment later, we clearly saw the object almost directly above us, and thought it was a helicopter until it completed a roll move and was clearly 3 bright blue lights in the shape of a triangle with red and white lights on the belly. In the few minutes seen, the object would roll back and forth showing the triangle s! hape, but then rolling back and appear as just 2 lights.  My wife, my mother in law, and I all stood in awe as we watched the object slowly lower itself as if about to land, I ran to grab a better camera as the shots and video taken on my iphone were unclear due to the night sky, to truly make out the triangle, but the color of the light was captured.  Before I could get back, my wife yelled that it had suddenly dropped at a high rate a speed behind our view.  There are softball fields where this would have landed, but upon driving to the area, the only thing I found were the end of the softball league games, and several police officers in the parking lot.  I assumed they were there for softball boozers, not space invaders.",
      "link": "http://www.nuforc.org/webreports/077/S77817.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bab00",
      "summary": "Several people observed slow moving light in sky for about five minutes.",
      "city": "arlington",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Several people observed slow moving light in sky for about five minutes. Several people observed slow moving light in sky for about five minutes it was lower than an airplane and moved slowly ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78201.html",
      "state": "VA",
      "duration": "5 mintues"
    },
    {
      "_id": "64d005f478aba2ec5a3bac43",
      "summary": "Moving object resembeling a star headed Southeast",
      "city": "arlington",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Moving object resembeling a star headed Southeast The object looked like a star but it was moving at a moderate pace Southeast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78322.html",
      "state": "VA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bafa1",
      "summary": "just a glowing on and off light that suddenly darted.",
      "city": "arlington",
      "shape": "light",
      "date": "2011-01-31T00:00:00",
      "story": "just a glowing on and off light that suddenly darted. i was outside and see this to the west traveling slowly and thought it was a plane but the light was just a constant slowly moving north then started glowing i went to grab a friend and we stood there watching it for around 2-3 minutes then it just darting east and we both stood there like deer in a headlight to what just happened",
      "link": "http://www.nuforc.org/webreports/079/S79579.html",
      "state": "IA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb096",
      "summary": "red white light descending initially like a plane. As it is descending completely changed direction of descent and zipped across space",
      "city": "arlington",
      "shape": "flash",
      "date": "2011-01-05T00:00:00",
      "story": "red white light descending initially like a plane.  As it is descending completely changed direction of descent and zipped across space I was sitting with my window open writing a Research paper, when bright blinking lights caught the corner of my eye. I turned to the window, and saw the descent much like a plane of an object in the dark sky, with four lights lined up together horizontally, in the color order of red, white, red, white.  The white blinked the brightest first, followed by the first red, then the second red, then white. It continued descending with this same order of blinking for a little less than a minute, then all of a sudden the lights converged in into one red white moving ball, and quickly flew/ hovered a completely different direction leaving a brief red white mark in the night sky that did not last more than 2 seconds.  Its movement was like a v, first with the plane speed descent then the zip across space. The speed it did this was supernatural.",
      "link": "http://www.nuforc.org/webreports/079/S79161.html",
      "state": "MA",
      "duration": "A minute or less"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5d7",
      "summary": "3 pairs of glowing red/orange light formations New Years eve 2011 at midnight",
      "city": "arlington",
      "shape": "formation",
      "date": "2011-01-05T00:00:00",
      "story": "3 pairs of glowing red/orange light formations New Years eve 2011 at midnight About 5 minutes before new years three of us were on top of an rv getting ready to watch the fireworks, when in the sky to the south of us their appeared an orange light above the horizon. Thinking maybe it was a helicopter at first when another unblinking, slightly pulsating orange/amber light came behind the first following its flight pattern. When the first pair changed direction the second pair showed up behind the first, then the third pair appeared. All three pairs drifted through the same positions in the sky, from flying horizontal to vertically,( one above the other ). Then one pair after the other just kinda faded away. Minutes later we see an actual airplane flying from south to north, heading to Arlington airport. We then see one more of these orange lights fly parallel the the plane for a bit before hovering, and then drifting straight up and disappearing. Then a couple minutes later another two were moving to the north, further north then before. These were not airplanes or helicopters, no noise, no blinking lights.",
      "link": "http://www.nuforc.org/webreports/079/S79467.html",
      "state": "WA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb70a",
      "summary": "While driving home, we saw a low flying triangular shaped aircraft, with lights that hovered, changed directions, and moved silently.",
      "city": "arlington",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "While driving home, we saw a low flying triangular shaped aircraft, with lights that hovered, changed directions, and moved silently. My name is ((name deleted)). I am 47 years old and worked in Law Enforcement for 6 years.  I was driving home to Portage, Wisconsin from Madison, Wisconsin. I was driving north on State Highway 51 approaching Johnson Auto Sales (N1255 US Highway 51, Arlington, WI). My Son (14 years old) was in the front passenger seat, my wife was in the back seat. I saw an extremely low flying aircraft in the sky just northwest of Johnson sales.  The object appeared to be moving very slowly to the south, toward my vehicle.  Hwy 51 was busy with traffic, vehicles were northbound behind me and in front of me.  There were also several vehicles passing me southbound. I pointed to the aircraft and asked my son what he thought it was.  My son said he thought it might be a helicopter.  My wife, a Nurse, said that maybe it was a med-flight helicopter. The aircraft continued to move southeast and began hovering just west of my car, right over the Johnson Sales retail store. I slowed way down and could immediately see that the aircraft was not a helicopter or a conventional airplane.  It was hovering approximately 1000 ft above Johnson sales.   My son and I both saw that the aircraft had two distinct white headlamps.  The headlamps had approximately 20 feet of separation.   We also saw a third white headlamp toward the rear of the aircraft... and all three headlamps formed a triangle).  There were two blue lights on the right triangular wing, and two red lights on the left triangular wing.  The body shape of the aircraft closely resembled that of a thin triangular spur. I rolled my window down expecting to hear an aircraft engine or rotor blades, but the aircraft was completely silent. I pulled into the Johnson Sales parking lot.  The aircraft immediately moved silently and slowly to the south, almost as though it knew we were trying to observe it more closely.  My wife was afraid and asked me not to try to follow it.   The aircraft continued to move south and I drove my family home.  My son, 14 years old, drew a sketch of the aircraft and we just can't seem to stop talking and thinking about this remarkable event.  There were many vehicles on Hwy 51 at the time, and I was just wondering if anyone else may have reported seeing this strange aircraft.  If so, I would be interested to know.",
      "link": "http://www.nuforc.org/webreports/079/S79502.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbc8",
      "summary": "Dazzling bright white oval light falls from sky in Arlington, Virginia",
      "city": "arlington",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Dazzling bright white oval light falls from sky in Arlington, Virginia I don't remember the exact date, but this was in March 2006. I was walking home around 10:30 at night in Arlington, Virginia, just a few miles from Washington, DC.  Suddenly I saw a dazzling white, oval-shaped light fall from the sky at a constant rate and disappear over buildings on the horizon.  There was no sound.  The light was bright enough that it cast shadows around me. The oval was an even and pure white light.  I was bigger than a full moon.  I have no idea how far away it was, but didn't seem more than a few miles if that. I am an aviation enthusiast and have fulfilled all requirements for my private pilots license.  I cannot explain what I saw.  It was not a meteor because it seemed too large and had no tail.  It was not an aircraft.  The light was pure white and dazzling. The next day my carpool mate picked me up.  I was only a few hundred feet from his house when I saw the light.  He had been watching TV in his living room which faced the same direction I had been walking.  He told me that the room had filled with a bright white light at the same time I saw the object.  So I had independent corroboration. I called the Arlington police the next day to report it.  No one had seen anything.  I think the woman at the police station thought I was a nut. My carpool mate similarly thought I was nuts for reporting it. I still can't explain what I saw.  Anyone ever see something similar? ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83358.html",
      "state": "VA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd2f",
      "summary": "Glowing light slowing down, speeding up and wobbling in the air at night.",
      "city": "arlington",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Glowing light slowing down, speeding up and wobbling in the air at night. I was standing outside when I saw a glowing light moving across the sky.  There weren't any flashing lights like a plane would have so I was concerned.  As it neared the trees it slowed down almost to a stop and wobbled back and forth and proceeded to move forward and repeat this slowing and wobbling phenomenon until the trees blocked my view. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83446.html",
      "state": "WA",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd23a",
      "summary": "Reddish-orange orb",
      "city": "arlington",
      "shape": "sphere",
      "date": "2012-09-24T00:00:00",
      "story": "reddish-orange orb I looked out my kitchen window as I was turning off the night light on my microwave, and noticed a bright “star” in the northern sky.  After turning out the light, I went to the sliding back door next to my kitchen, and observed the “star”.  Turns out it wasn’t a star after all since it was moving. It was by far the brightest object in the sky, and was heading in the northeastern direction. I watched it for about 20 seconds, and then it just faded away.  I would say it was an orb shape, and was reddish-orange in color. It was not the ISS or a satellite or a shooting star. I have actually seen a number of these in the past few years now.",
      "link": "http://www.nuforc.org/webreports/092/S92243.html",
      "state": "VT",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd263",
      "summary": "Three orange-red objects were circling over Arlington,WA. on Fourth of July.",
      "city": "arlington",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "",
      "link": "http://www.nuforc.org/webreports/090/S90494.html",
      "state": "WA",
      "duration": "at least 2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd644",
      "summary": "Low rumble revealed sparkling lights, resolved into dark Triangular craft with lighting at two leading edges.",
      "city": "arlington",
      "shape": "triangle",
      "date": "2012-11-19T00:00:00",
      "story": "Low rumble revealed sparkling lights, resolved into dark Triangular craft with lighting at two leading edges. As I sat in my studio, I was beginning to get ready for bed.  I emptied my pockets onto my desk and thought that I should go out side before my shower.  As this was the second time in a few minutes that I had thought about going outside, I stopped what I was doing, lit a smoke,  and walked to the back door, opened it, and walked onto the patio.  I noticed that there was a distant rumbling sound that seemed loud, loud  enough that I wondered why I had not heard it inside my house.  The sound was much like the sound of a jet engine, without the usual high pitched whine.  Just the low frequency component of the sound like an Atlas rocket at a distance, or maybe a Harrier jet.  I am a professional audio engineer, and have very good hearing. I'll also point out that I grew up in the Land Surveying business, working many years in that field before my mid 20's.  Since the security lighting had activated when I went onto the patio, I reached my hand back inside the door and turned off the light to get a better look at the sky.  Still hearing the rumble, I looked up to see what it could be. Above me about 60 degrees above the horizon, and due west, I saw an odd haze that would sparkle light, mostly white, with red and blue green. My first thought was that it was too low to be an airplane, and that it did not appear to be moving fast enough for flight.  The sound was incorrect for it to be a helicopter.  The lights seemed to twist and turn, with no discernible shape.  As the sky was otherwise clear, this confused me.  I noticed that there was an occasional brighter flash in red and then blue green.  The object continued to morph, and as I watched, it solidified into a shape.  It became an equilateral triangle with one end pointed directly south.  The object seemed dangerously close to the ground and just hanging there. With my right hand outstretched to 30 inches, the object was about 9 -12 inches on each side, and about ½ to ¾ inches thick. The lights appeared along the perimeter of the two leading edges, with the brightest areas at the middle of each of those two edges.  I noticed that the southern most tip of the triangle had a soft white glow, and that the remainder of the bottom was a dull dark matt finish. The light area did not appear to be illuminated, only contrasted to the rest of the surface.   Much to my surprise, the bottom was not flat.  There appeared to be two large rectangular areas, one on each side of the center line, and while one was along the axis of (very slow) travel, the other was at 90 degrees to it.  The rectangular boxes had rounded edges.  I remember thinking, that this was not a good aerodynamic shape. Another incongruity. Once the position of the object stabilized, the lighted edges were barely visible from my perspective, but the occasional brightening of the nearest mid-side light was red.  I thought, maybe they were FAA lights, so I waited for the next flash.  The flashing did not have consistent timing.  The next time it was green, and still hazy in a digital sort of way.  Checking the far side lights, I realized that they were also inconsistently colored also..  It was more like the lights were displayed as camouflage, something that would appear correct to the casual observer. Wanting to take a photo, I realized that I did not have a camera on me, and that in order to get a photo I would have to get back into the studio, grab my phone off the desk and turn it on.  By this time, the object was already 45 degrees south of my position and I realized that I did not have time to get to the camera, and I decided to just continue watching.  The object continued south and within a few seconds had moved to the horizon, the sparkle growing ever smaller and less distinct. I have some surveillance cameras located around my house, and I later checked to footage.  I left the studio at 11:15 pm CDT to go outside, and the event lasted barely 2 minutes.  I saved the recordings from the system and looked at it later, hoping that some more information could come from it.  The studio camera has an audio channel, but the camera over the patio does not.  I could not detect any low frequency information from the sound track, as the noise floor on such systems is rather high.",
      "link": "http://www.nuforc.org/webreports/094/S94118.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd706",
      "summary": "Two pure red star like objects shoot accross the night sky in Arlington, South Dakota.",
      "city": "arlington",
      "shape": "fireball",
      "date": "2012-05-13T00:00:00",
      "story": "Two pure red star like objects shoot across the night sky in Arlington, South Dakota. I was laying on my roof looking at the stars and i noticed two bright pure red star like things shoot accross the sky in a south west direction.  They were equil distance apart from one another and then one moved away from the other and back to being equil distance.   When they got to the tree tops the vanished.",
      "link": "http://www.nuforc.org/webreports/087/S87760.html",
      "state": "SD",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be50f",
      "summary": "Two separate white orbs of light that just fade out of sight",
      "city": "arlington",
      "shape": "sphere",
      "date": "2012-06-14T00:00:00",
      "story": "Two separate white orbs of light that just fade out of sight I went to my kitchen to shut off the night light on my microwave, and just happened to glance out my kitchen window that faces north/northeast.  I could see a large bright solid white light up in the sky north of me.  It was no problem seeing this orb, but I couldn’t see anything else (stars) through the window.  I stood still to see if it was moving or not, and sure enough it was. I stepped out my sliding back door right next to my kitchen, and watched it.  I could now notice some stars, but there were some clouds out as well.  I kept my eye on this orb, as it seemed to move from north to south.  Then all of the sudden, it slowly faded away in about 4-5 seconds. I watched this orb for about one minute. I kept watching the skies after that to see if it would come back.  I noticed a fairly close group of stars in the northern sky, when one of the “stars” that had been motionless for the past couple of minutes, started moving northeast and then faded away in about 4-5 seconds just like the last object I witnessed.  This took about 15 seconds from the time it started moving until it disappeared. I have seen these orbs in the sky for the past couple years now, and that is why I continue looking at the sky at night.",
      "link": "http://www.nuforc.org/webreports/089/S89522.html",
      "state": "VT",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be524",
      "summary": "Reddish object descended within a shadowy spinning circular silouhette",
      "city": "arlington",
      "shape": "circle",
      "date": "2012-08-19T00:00:00",
      "story": "Reddish object descended within a shadowy spinning circular silouhette A single reddish light approached my position from the north east.  I thought it was unusual for a plane that might normally approach from this direction.   As it approached 2 other similar reddish lights appeared on the northeast horizon.   It appeared they were close to each other but began to diverge as they came closer.  The first light began to fade as it went overhead.   The 2nd red light/object grew somewhat brighter as it approached. I thought how weird is this.   Finally the first object faded overhead at some distance, the 2nd and 3rd approaching began to separate, they originally approached close to each other.   The 2nd came straight over head.   As it did I detected a circular shadow against the clouds and a dark segment circulating clock wise within the shadow.   The 3rd 'light' seemed to diverge and fade to the west as I watched the 2nd, which was surprisingly low and appeared to be descending.  The shadowy circular shape was amazing.   Within seconds I saw it h! it silently, \"collapse\" and fall from the side of a neighbor's roof 40 yards away.   It feel off the roof toward the ground and remains to be determined what it is.   I intend to check with that neighbor tomorrow and ask if they found anything in their side yard.   Creepy but true… ((NUFORC Note:  We have amended the time and date above.  We suspect that the sighting was a nighttime sighting, and that it occurred on Saturday night, August 18, not Sunday morning, as the witness indicates.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91939.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be64e",
      "summary": "Blue and red jelly bean shaped craft, hovering over Arlington Airport, Washington State.",
      "city": "arlington",
      "shape": "oval",
      "date": "2012-06-08T00:00:00",
      "story": "Blue and red jelly bean shaped craft, hovering over Arlington Airport, Washington State. I saw an object hovering over Arlington Airport.  It was jelly bean in shape and size, half was blue, other half red. It was soft in the light being projected. I watched for a couple of minutes then I went and got a fiend to come out at look at it.  We both watched for a couple of minutes more. It was very cold we went in to get coats, it was gone when we got back. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89400.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb6e",
      "summary": "Bright light zooms across Arlington, TX",
      "city": "arlington",
      "shape": "light",
      "date": "2012-02-03T00:00:00",
      "story": "Bright light zooms across Arlington, TX I was standing on the back porch around 8 PM.  It was dark outside.   Suddenly the back yard was flooded in bright white light from above.  I looked up to see the bright light fly quickly to the east.  The light was became fluorescent green,  then it turned to red and zoomed out of sight.   No sound.  Much faster than a plane.   A few minutes later I heard a lound bang, like a distant explosion from the east.",
      "link": "http://www.nuforc.org/webreports/086/S86951.html",
      "state": "TX",
      "duration": "6-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf4e3",
      "summary": "Yellow lighted craft seen in horizon for 5 sec in Arlington,TX.",
      "city": "arlington",
      "shape": "cylinder",
      "date": "2013-05-15T00:00:00",
      "story": "Yellow lighted craft seen in horizon for 5 sec in Arlington,TX. At around 10:30 to 11:00 pm 4/14/13, I was in the backyard looking across the horizon due West. I noticed from left to right an object flying at first at a semi-fast speed then slowing.  The object had a yellow to orange colored light pulsing from high, then dimning to low then the object gained speed and the light went out completely and was gone.   I ran to the front of the house, but the object was gone.  I am located at the southeast tip of Arlington,TX. .",
      "link": "http://www.nuforc.org/webreports/097/S97196.html",
      "state": "TX",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa3c",
      "summary": "Bright orange seen in Texas.",
      "city": "arlington",
      "shape": "fireball",
      "date": "2013-09-09T00:00:00",
      "story": "Bright orange seen in Texas. Started as what I thought was a shooting star as it was a on range, bright fireball heading towards earth. It then started back upwards the went straight ahead and never headed back in a downward motion.  I would not say I believe in UFO's but I know what I saw was unlike anything I have EVER seen.",
      "link": "http://www.nuforc.org/webreports/101/S101786.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfaef",
      "summary": "Orange and red sphere over Northern Virginia",
      "city": "arlington",
      "shape": "sphere",
      "date": "2013-09-30T00:00:00",
      "story": "Orange and red sphere over Northern Virginia I was traveling east on 10th Street N. The object appeared from the Eastern sky. At first, it looked like a flare, a firework, or rocket after take off (like from Wallops).  It moved slowly and appeared to almost stop at one point.  I did a U-turn and followed the object West down 10th.  When I was able to pull over it had moved more rapidly and had started to fade to the West.",
      "link": "http://www.nuforc.org/webreports/102/S102711.html",
      "state": "VA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe3b",
      "summary": "Three Orange Lights on Oval Shaped Craft which moved slowly- no sound, then rapid accelleration upward.",
      "city": "arlington",
      "shape": "oval",
      "date": "2013-10-03T00:00:00",
      "story": "Three Orange Lights on Oval Shaped Craft which moved slowly- no sound, then rapid accelleration upward. Around 22:00 on the evening of 9/01/13 - I witnessed an oval shaped craft with what looked to be three solid orange lights head west from directly overhead- the craft appeared to be at the height that I see small airplanes fly at in our area regularly.   The craft moved slowly- and I could not hear any sound like I would normally hear with a small aircraft.  The craft or object moved slowly for approx. 30 seconds and then just rapidly accellerated (could still make it out in the sky as it moved farther away for approx 20 sec) and disappeared very quickly in an upward motion.",
      "link": "http://www.nuforc.org/webreports/102/S102893.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bff8e",
      "summary": "Orange sphere type object moving in a zig-zag type pattern over Roslyn, Virginia. Lost power when it was hovering.",
      "city": "arlington",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "Orange sphere type object moving in a zig-zag type pattern over Roslyn, Virginia. Lost power when it was hovering. There was a storm that had hit, a little bit of rain.  Anyways the power went out so a friend and I had gone outside on the balcony to see who else had lost power when we noticed an &quot;orangey-red&quot; sphere dipping down over Roslyn and then climbing back up again (something a plane would not do) then traveling up into the sky horizontally (something a plane would not do either). The object appeared to be round, my friend said it looked like a fireball or something.  We noticed it a second time coming towards my apartment building, traveling East and it appeared to get darker as it traveled higher... from an orange color to a darker red.  As soon as the object had left the area, my Comcast (TV) signal then came on.  Anyways, I've filmed it if anyone is interested. Couldn't get a solid photo of course.",
      "link": "http://www.nuforc.org/webreports/098/S98934.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0046",
      "summary": "Strange Green/Purple and Orange Dancing Lights Above Farm Field.",
      "city": "arlington",
      "shape": "unknown",
      "date": "2013-10-03T00:00:00",
      "story": "Strange Green/Purple and Orange Dancing Lights Above Farm Field 10/2/13  On the night of 10/02/2013 at around 23:30 I took my dog outside for his last break before bed.  When we walked onto our deck (looking due north)- I could clearly see unusual lights coming from the farm fields located directly behind our rural property.  We live on a hill with clear visibility for at least ½ to ¾ mile to the north.  I noticed that my small dog would not leave my side.  Normally he would be off sniffing in the darkness for  ocal small wild animals etc…  It was quite unusual for him to stick close to me- in fact he kept walking right back to the door like he wanted to go inside instead of have his last late night romp.  I guess you would say he was acting out of character. I was a bit shaken by what I witnessed in the night sky.  First of all- the night sky was very clear with awesome visibility of the stars.  However- I witnessed something I have never witnessed before.  It looked to me quite a bit like the aurora borealis directly behind by property.  There was what appeared to be a misty quality to the area from the ground and up for approx 100 feet or so- but ONLY in the due north direction.  There were also beams of straight light that appeared to be coming from the sky down (or from the ground up) into this misty green and purple hazy lit up area (the color was green closer to the ground- and had a tint of purple the higher it went- also it seemed to have a bit of a sparkly aspect to it as well).   What was very odd about this is that directly above where these lights were- and where the spotlights stopped up in the air- I could not make out what was above that.  It was a clear black out.  Normally I would see stars in this area of the s! ky- but it was solid black!  I could not see a shape or form of anything in the sky- it was like it was blacked out on purpose!  I could hear no sound.  I could not hear any sounds from the nearby highway- I could hear no local animals (horses-dogs-crickets etc…) there was literally NO NOISE- even the naturally occurring country noises outside.  It was still as ever!  The beams of light would rapidly change position- following no obvious pattern.  I walked the entire distance of my deck (60 feet) back and forth trying to make sense of what I was seeing- and to try and figure out what I was looking at.  I was home alone with the dog and did not have the courage to walk down onto my property and out into the field directly behind my home.  I unfortunately did not have my phone or a camera with me. As I watched the lights- I tried to make out whether they were coming from above or from the ground- and to be perfectly honest- I couldn’t really tell.  I just noticed that the lights were very strong and vivid and much like a spotlight that you would see in the sky for a Hollywood premier- the lights had a bit of an orange and hazy sort of sparkly  tint to them- and were sometimes moving so rapidly that I couldn’t tell where they were stopping and starting.  From what I could tell- there were no farmers out doing any crop work- as there was no machinery noise like you would hear during harvest time- plus they rarely harvest in the dark of night.  There are no homes due north of my house- only farming fields.  There are no trials for   hiking or four wheelers back there.  There should have been nothing there at all! I watched this light show for approx ten minutes and then became scared and went indoors.  After about ten more minutes I looked out my back window and all of the lights were gone!  There was also no more mist or fog in the air.  It was just clear night sky.",
      "link": "http://www.nuforc.org/webreports/102/S102901.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0530",
      "summary": "I live in Arlington, Tx. Is the norm to hear planes all the time.  DFW Airport is just north of us and only 20 min away.",
      "city": "arlington",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "I live in Arlington, Tx. Is the norm to hear planes all the time.  DFW Airport is just north of us and only 20 min away.   This morning at 05:25 I'm walking to my truck where is always parked in the drive way I look up and there it is!!  Is huge!!  The size of about 3 football fields and the shape is a triangle with this lights around it.  The sound is different.  I call my wife who is standing at the front door which she does everyday I leave to work.  She hurries towards me and I tell her to look up!   Now we are both looking at it and my wife's points out that the object is transparent that she can see the stars and the clouds thru it.  Is not cloudy or just a few clouds and the moon and the stars are bright.   I quickly pull out my iphone to record it, but if you have an iphone you know is not great at night from a distance. It was awesome to see something like that.  I don't know what it was.  Maybe a new spy plane?  All I know it was huge.  I have the video I will d! o my best to post it.  I hope someone else seen what I did.  Feed back will be great.  My first time.",
      "link": "http://www.nuforc.org/webreports/096/S96051.html",
      "state": "TX",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0550",
      "summary": "White glowing object with fire coming out of it.",
      "city": "arlington",
      "shape": "oval",
      "date": "2013-03-03T00:00:00",
      "story": "White glowing object with fire coming out of it. February 26, 2013 around 7:15 pm, I was getting out of my car about to go in the house when suddenly I noticed a very bright white glowing object that looked like a glass bubble with fire coming out of the bottom end of it floating down from the sky.   It appeared to want to land on top of the roof and I said, \"Oh, no it is going to set the roof on fire.\" So I began to take some pictures and call 911 as I did that, it suddenly started going back up a little faster than it was coming down.   As it was going back up it burned itself out and became a round circle with an inner ring that was glowing very brightly as it ascended.   I then noticed three low flying planes headed in the same direction as the object went suddenly up.",
      "link": "http://www.nuforc.org/webreports/096/S96497.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c091a",
      "summary": "Four round white lights circling and converging at center an then circling and converging, in the sky at Arlington, VA",
      "city": "arlington",
      "shape": "",
      "date": "2014-03-18T00:00:00",
      "story": "Four round white lights circling and converging at center an then circling and converging, in the sky at Arlington, VA We saw four white lights circling and converging at the center and again moving and circling and then converging at the center on the sky.  It was going on for few minutes.  Tried to take pictures n video but could not as it was dark.  We could not believe our eyes and we surprised.  Not sure if there are powerful lights from the ground that hit the sky.  Did anyone else see this? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107584.html",
      "state": "VA",
      "duration": ">5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0934",
      "summary": "There were four lights in the sky. Imagine a pizza cut into four slices the lights met in the center and then spread out making an X th",
      "city": "arlington",
      "shape": "formation",
      "date": "2014-03-18T00:00:00",
      "story": "There were four lights in the sky.  Imagine a pizza cut into four slices the lights met in the center and then spread out making an X then out to the edge.  Each light outlined 1/4 of a circle.  This happened in the only cloud in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107575.html",
      "state": "VA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b8c",
      "summary": "http://youtu.be/3mgEZ4nD_Ww.",
      "city": "arlington",
      "shape": "cigar",
      "date": "2014-02-27T00:00:00",
      "story": "http://youtu.be/3mgEZ4nD_Ww It was over the Potomac river before crossing into dc...  I was shooting video trying to capture a plane and i saw something flying by very close.   And really quick it was hard to tell what it was I'm waiting for my friend to send me the file and another one that he may had seen",
      "link": "http://www.nuforc.org/webreports/107/S107319.html",
      "state": "VA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d29",
      "summary": "I saw a small blue light move from a star to the left, then it blinked out.",
      "city": "arlington",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "I saw a small blue light move from a star to the left, then it blinked out. On March 12, 2014, about 23:21 hours, I was standing outside my home, smoking a cigarette.   I looked to the West and just above my roof line I saw 3 stars in a line, (that I always see early in the night and to the west) but near the lowest star on the horizon out of these 3 stars, there was a small blue light.   I immediately focused in on it, because it was blue and it was moving.  I watched this blue light travel from (it almost looked like it was behind the star) the star to the left and at about a 40-45 degree angle towards the ground.   It traveled quickly for a few seconds, then it blinked out, and it was gone.  I thought I might have lost sight of it because of the tree branches that are in the way, but after getting a better view of that piece of sky, I could no longer see it.   I took out my iPhone 4S and took a picture of the sky where it was, but unless you turn up the brightness the image is almost all black.   This morning I remarked a copy of that p! icture, this morning.  I have used MSPaint to draw the path of the UFO, the tree branches, the roof line, and the brightest stars that were visible with the naked eye.  I will send the remarked picture and the original with this report.  Granted this was not a spectacular UFO sighting, but it was strange to me because I live in the flight path of a few airports, DFW International Airport, Love Field, Alliance Airport, and Arlington Municipal Airport.  So I am very familiar with Airplanes in the sky and the paths they take over my home, (it's usually from North to South) and this UFO was not taking a normal path that I see other Airplanes take.",
      "link": "http://www.nuforc.org/webreports/107/S107843.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f0b",
      "summary": "Triangular Craft moving at high speeds- changing elevation several times- Orange perimiter lights- Red glowing/pulsing light in middle",
      "city": "arlington",
      "shape": "triangle",
      "date": "2014-02-14T00:00:00",
      "story": "Triangular Craft moving at high speeds- changing elevation several times- Orange perimiter lights- Red glowing/pulsing light in middle At 3 am this morning I was outdoors with my dog- and while sky watching I noticed a triangular shaped object moving rapidly from west to east as I looked at the northern sky.  I would describe it as a rather large triangle with a number of orange lights on the  entire perimeter and a larger more intense red light directly in the middle.   The middle red light appeared to be pulsing somewhat as it faded slowly in and out- the orange perimiter lights remained constant.   The speed of this craft was impressive and covered the entire expanse of my northern view from the west hemisphere all the way to the visible east hemisphere.  It moved in a rather erratic manner and changed elevation several times as it moved.   I would say that the height of the craft was lower than an Air Force Jet would fly- yet higher than a smaller personal aircraft (such as a two to four seater).  There were very clear conditions this morning- and I could clearly see the stars and planets.   The craft was illuminated brightly and would have been hard for anyone to miss!  My rural home is approx 15 miles north of Madison WI.  There is an Air Force base at Truax Field in Madison.   I noticed a number of Air Force jets patrolling this area within 5 to 10 minutes of my sighting!  They covered the area for about a half an hour traveling the same approximate route (back and forth) as the craft I witnessed.  It was a stunning sighting for me!   I keep my eyes skyward at night- and this was the most impressive thing I have witnessed over the past few years!",
      "link": "http://www.nuforc.org/webreports/107/S107009.html",
      "state": "WI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0edb",
      "summary": "silent v shaped ufo all white lights   not conventional aircraft lights.",
      "city": "arlington",
      "shape": "triangle",
      "date": "2013-12-02T00:00:00",
      "story": "Silent v shaped ufo all white lights   not conventional aircraft lights I was walking outside and while i was looking at the stars i noticed a v shaped  aircraft with all white lights on.   The ufo had no tail lights no flashing beacon  and no red or green lights.  It was silent and moving faster than any aircraft that i have ever seen just seeing if anyone els saw what i saw",
      "link": "http://www.nuforc.org/webreports/104/S104737.html",
      "state": "TX",
      "duration": "12:31"
    },
    {
      "_id": "64d005f478aba2ec5a3c1122",
      "summary": "Green falling star.",
      "city": "arlington",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "Green falling star. Very small but incredibly fast green light to the north of Columbia Pike and South Washington Blvd (like a falling star but bring green). ((NUFORC Note:  Date of sighting indicated by witness is flawed.  We suspect that the alleged sighting must have occurred on Friday, November 1st.  Other reports were submitted from the east coast for a similar sighting on that date.  The party who submitted the report elects to remain totally anonymous, and provides no contact information, so we are unable to contact the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103842.html",
      "state": "VA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1156",
      "summary": "Cross-shaped ufo with white and red blinking bright lights that hovered over Arlington, Tx, near the ground.",
      "city": "arlington",
      "shape": "cross",
      "date": "2013-11-20T00:00:00",
      "story": "A cross shaped ufo with white and red blinking bright lights that hovered over Arlington, Tx near the ground I was sitting in the car with a friend then all of a sudden we notice something very big a that was very low to the ground.  It was flying so low to the ground we thought it was going to crash and it was comin towards us then all of sudden it begin turning it was infront of us turning but it did not make a sound.  Underneath it were white lights goin horizontal and red lights going vertical.  We knew it was no plane and we were AMAZED so we got out the car and watched it float off as the lights kept blinking.  It turned so sharp and made no noise and was certainly not shaped like a plane.  We tried to get in the car and follow it but it seemed to disappear in the sky, it was very weird and all we could do was smile and talk about it.  I have never come in counter of a ufo but I am most certain that was a UFO!  What is so strange is that after we went back to where we seen the ufo and parked rhe car strange things begin to happen.  There was no wind at all and the gate by us begin to open and and would close but there was none there.  Then it would open slowly and close half way the open again and when we looked no one was there but there was a cat that stopped and stirred for a long time at the gate.  It was very weird so we both went home.",
      "link": "http://www.nuforc.org/webreports/104/S104398.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1558",
      "summary": "Bright orange light seen traveling NW to SE by 2 civilians in NE Iowa.",
      "city": "arlington",
      "shape": "unknown",
      "date": "2013-12-02T00:00:00",
      "story": "Bright orange light seen traveling NW to SE by 2 civilians in NE Iowa. My wife and I were driving northeast of Arlington, IA, at 8 PM on November 30, 2013, when we noticed an orange light in the northwest sky heading southeast.  We both thought it might be a meteorite entering the atmosphere.  But the light did not diminish and disappear.  Instead the light got brighter and continued to travel southeast at a continuous rate of speed. The light did not flicker and traveled across our view southeast for at least 1 and a ½ minutes, then it disappeared as suddenly as it had appeared. We parked the car on the shoulder of  the road and shut off the engine.  There was no sound as the orange light traveled.  We thought about the space station, since we have seen it travel across the sky, but the light was too bright and it was orange.  Like a flaming pumpkin orange. We called local TV stations, but there had been no other calls that evening ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104986.html",
      "state": "IA",
      "duration": "1.5-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c155f",
      "summary": "Large white orb with glow around it in south west Texas sky.  ((NUFORC Note:  Possible sighting of Venus?  PD))",
      "city": "arlington",
      "shape": "sphere",
      "date": "2013-12-05T00:00:00",
      "story": "Large white orb with glow around it in south west Texas sky. As I was backing into my driveway I noticed what I thought was a seasonal planet that was just unusually close to Earth, it was very large, close to three times the size of the North Star for reference but with a glow around it as If it were in fog perhaps.  I blew it off until I walked outside a little later and it was gone.  It was very clear out which why I found the glow around it to be odd.  The light was fixed without any movement, round in shape; and very white in color. ((ADDENDUM FROM WITNESS)) Peter,        When I saw the object in question I was facing south west, what's very curios about what I saw is the fact that my girlfriend of many years works for a major airline, one of my best friends is a professional pilot; and I live near one of the largest airports in the word so I know what an approach light looks like. Good stuff!!!  Sent from my iPhone ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/105/S105062.html",
      "state": "TX",
      "duration": "~30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c167e",
      "summary": "Green flashing orb floating above the Douglas Park neighborhood of Arlington, VA",
      "city": "arlington",
      "shape": "circle",
      "date": "2013-10-23T00:00:00",
      "story": "Green flashing orb floating above the Douglas Park neighborhood of Arlington, VA. Looking at the full moon and noticed a bright shape moving off to the left.  It was green and would change to red at irregular intervals as it moved around in a random pattern, staying within a particular area.   I went into the house and got my phone to film it and captured two short clips before it dropped behind my roof and trees. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103368.html",
      "state": "VA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c16cf",
      "summary": "6 bright orange objects in formation over Arlington TX. 10/22/13.",
      "city": "arlington",
      "shape": "sphere",
      "date": "2013-10-23T00:00:00",
      "story": "6 bright orange objects in formation over Arlington TX. 10/22/13 October 22nd, 2013.  9:51pm to 9:54pm, local time. Clear sky; normal air traffic around DFW for this time of day (roughly 30% chance of an air traffic within view), and normal number of stars. Atmospheric conditions allowed me to hear airplanes and cars as normal. Six objects in a loose formation of three pairs traveling at a constant height from SSE to ENE over Arlington TX.   Bright Orange/Red spheres, whose formation changed predictively in relation to my perspective as they flew by.  My view of this sky segment is 25% blocked by trees. Their size, apparent speed, and height reminded me of a formation of military helicopters, which most often travel down the I-30 corridor, as I see these several times a year, both day and night.  This flight appeared 2-3 miles South of I-30.  The two distinctions that differed these from a normal helicopter formation were a complete lack of noise, and their light output. These aircraft were silent, and luckily during my viewing there was no competing airplane noise.  To extrapolate their apparent size and speed to a distance where a normal helicopter could not be heard, would place them near the border of believability. The light output of these objects is, in my opinion, what sets them apart from anything in my experience.  They were not pin points, but were circular and by changing perspective, had volume.  Although orange/red, the brightness was only a little less than if a spotlight were pointed in my direction.  The intensity seen, varied only with distance, it was steady and uniform from all 6 objects.  They were too bright to make out helicopter rotors or tail booms. I have seen two fireballs in the sky in the past, one red, the other yellow green, both lasted around 10 seconds and I read about them the following day.  Last night the objects I saw lasted much longer.",
      "link": "http://www.nuforc.org/webreports/103/S103499.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1bf1",
      "summary": "Three low bright orange objects following the same path fading to red with no sound or navigation lights.",
      "city": "arlington",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "Three low bright orange objects following the same path fading to red with no sound or navigation lights. I saw the first large bright orange light going from north to south between Ballston and East Falls Church at around 10:30 pm.   As it passed directly over head, the light was reflecting off the bottom of the clouds as it the object was right below the cloud.  Absolutely no noise.   Before the first object faded into the distance another object followed the same path at the same speed.   By this time my neighbor had seen it as well.  Then as the second object faded to the south, a third even brighter object followed the same path.  Again, no noise and no navigation lights.  Just bright orange turning to dim red as they faded into the distance.   It took each object about 3 minutes to traverse the sky and their altitude was just below the clouds.",
      "link": "http://www.nuforc.org/webreports/109/S109668.html",
      "state": "VA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c4d",
      "summary": "Stationary white light observed by two people for several minutes.",
      "city": "arlington",
      "shape": "circle",
      "date": "2014-07-11T00:00:00",
      "story": "Stationary white light observed by two people for several minutes Bright, non-flickering white object in sky before any stars were visible. \"Star Walk\" iPhone program located it in roughly the location of star Dubhe (end of bowl in \"Big Dipper\").   Appeared to be stationary during several minutes of observation (we didn't see it appear--it was already visible when we went out on our deck), though there were no nearby visible reference objects for confirmation.  Brightness roughly that of Jupiter, but way too far from the ecliptic to be a planet.   My wife & I looked away for a few seconds while discussing where our binoculars might be, and when we looked back it had completely vanished,  So, unfortunately, we did not see if it flickered out or vanished in an instant.   Thought it might be a meteor headed directly towards us, but the brightness seemed too steady for that. We sometimes observe rocket launches from Wallops that appear as stationary spots when headed away from us, but there were none scheduled toda! y that we know of.   Definitely too little motion over the period of the observation for it to be an ordinary aircraft. Seemed too bright (and stationary) to be a satellite.",
      "link": "http://www.nuforc.org/webreports/111/S111302.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ca5",
      "summary": "Triangle shape in the sky, dead still, lights on each corner and one in the center, hovering above what may be a train station.",
      "city": "arlington",
      "shape": "triangle",
      "date": "2014-07-20T00:00:00",
      "story": "On the east side of 161 not of I30.   Triangle shape in the sky, dead still, lights on each corner and one in the center, hovering above what may be a train station?   I watched it for a long time, then finally passed it and realized what I was seeing and that it wasn't moving.   I took the next exit and turned around to get a photo, when I returned, it was gone.",
      "link": "http://www.nuforc.org/webreports/111/S111685.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1eaa",
      "summary": "Turned off 95 N on to 2 E and immediately saw a large blue fireball very low in sky change shape and disappear in leftward motion",
      "city": "arlington",
      "shape": "fireball",
      "date": "2014-06-13T00:00:00",
      "story": "Turned off 95 N on to 2 E and immediately saw a large blue fireball very low in sky change shape and disappear in leftward motion",
      "link": "http://www.nuforc.org/webreports/110/S110050.html",
      "state": "MA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c240f",
      "summary": "Gray/black saucer with red triangular lights traveling north in the southbound lanes of traffic on SW Green Oaks Blvd.",
      "city": "arlington",
      "shape": "disk",
      "date": "2014-03-27T00:00:00",
      "story": "Gray/black saucer with red triangular lights traveling north in the southbound lanes of traffic on SW Green Oaks Blvd. At 3:15 a.m. on Monday, March 24, 2014, I was waiting for the light to change at the intersection of I-20 and Green Oaks Blvd. in southwest Arlington, TX.  I was traveling south.   One block south of me and traveling north toward me, a dark grey and black saucer-shaped craft topped the hill.  It was as wide as the three lanes of traffic and had two red triangular lights on either side in a similar position to where the parking lights are on an automobile but on the bottom edge.  However, no light from these reflected onto the ground and they were not bright like headlights, but they were large rectangles and most definitely red.   The largest part of the craft was very dark gray and the top “bubble” part was black.  This craft was only a few inches off the roadway.  My light changed and as I proceeded toward it, it was as if something came between us and it was no longer visible.  As there was nothing there to actually come between us, I feel as if it “cloaked! ” itself, but it was gone.  This area is very well lit as there are street lights on either side and there are businesses on both sides of the road so my visibility was excellent.  At this time of morning, there was no one else on the road except for it and me.  This road runs directly behind my house and this happened 1/2 block north from my backyard.  I went home and immediately called my friend who I had just dropped off and told her about it.  However, over a period of 20 minutes, we were only able to maintain a phone connection for about 5 minutes, as our call would get dropped and I would get the message “Call Failed” which never comes through when a call is dropped but rather when it doesn’t go through to begin with.  I would try to call her back and it would do absolutely nothing.  Just like dead air.   She left me a voicemail message but my phone had not rang.  She would call me and get the same nothing.  One time, I called her and as the phone was ringing, it soun! ded as if there was a third party on the line and I could hear! some sc ratching like claws on a piece of wood but just when the call should have gone to voicemail, it just disconnected and I got the “Call Failed” message.  She said when we finally were able to talk that she had never experienced anything like that ever before with a cell phone.  I hadn’t either.  I was unable to go to sleep until about 6:00 a.m.  The next day she told me that she had checked the Arlington Police Dept. active police “blotter” after we hung up and that from 3:00 a.m. until 3:30 a.m. there had been 9 calls to 911 that were only classified as “disturbances” within a 1-mile radius of where this occurred and my house.  She tried to take a screen shot of this information, but it would not work.  I can get a copy of that night’s activity from the police department, but cannot do so for 30 days.  At that time, I will forward you a copy of that to go with this report.",
      "link": "http://www.nuforc.org/webreports/108/S108107.html",
      "state": "TX",
      "duration": "<5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c263e",
      "summary": "Orange colored orb with lightning bolts from ground up.",
      "city": "arlington",
      "shape": "sphere",
      "date": "2014-10-10T00:00:00",
      "story": "Orange colored orb with lightning bolts from ground up. Orange sphere dropped to above tree line and hovered. Then proceeded North across a field generating a huge electromagnetic field (lightning bolts coming from the ground up to the object).   About 10 minutes later two fighter jets flying side by side formation came within a mile of it and it then shot up at a 45 degree angle and was gone in just a second or two.   Jets kept flying at same altitude heading north. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114405.html",
      "state": "MS",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29d5",
      "summary": "Got up to turn heater on and could hear what sounded like the sound barrier had been broke like fighter jets.",
      "city": "arlington",
      "shape": "unknown",
      "date": "2014-12-05T00:00:00",
      "story": "Got up to turn heater on and could hear what sounded like the sound barrier had been broke like fighter jets.   I steped outside and the sky for 2am in arlington looked as though their was an orange glow in the clouds passing over behind a cold front and it looked as if the clouds werent moving too fast and it was like something hiding beneath the clouds like a cloak and saw tiny streaks of light darting around like a laser pointer and too fast I believe for an earthly vehicle and too tiny to be lights on a jet plane from dfw and dfw airport is just up 360 N.  I believe it could of been a ufo.  The incident didn't last but maybe 45 minutes.  Kinda set my neck hairs on their staight ends. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115757.html",
      "state": "TX",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d1d",
      "summary": "Spotlight shines over Arlington.",
      "city": "arlington",
      "shape": "unknown",
      "date": "2014-09-25T00:00:00",
      "story": "Spotlight shines over Arlington. 9/23/2014 at 8:27 (looked at the clock) I was sitting in the driveway facing an eastward direction, I leaned forward and noticed a light kinda like a spotlight shining around in the sky.  Then the light, which was a blue-ish color, shined directly in my direction for split second, then swung upwards and went black.  I opened the door got out to look and nothing, gone, no sounds or anything.   Ok, I know it was NOT a helicopter, they don't normally climb to commercial jet altitude, which is about where this was, say about 30-35,000 feet.  It wasn't a reflection off the windshield, I tried to recreate it just in case and couldn't.  It wasn't a commercial jet, I see those all the time, it wasn't a satellite, I see them too.  I cant explain what that was.  I tried to scan the area afterwards to see if I could detect any movement without lights but I didn't see anything.",
      "link": "http://www.nuforc.org/webreports/113/S113838.html",
      "state": "TN",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c30a5",
      "summary": "I saw a perfectly round shape fall from the sky very, very fast.  It was blue-green in color.",
      "city": "arlington",
      "shape": "circle",
      "date": "2014-08-08T00:00:00",
      "story": "I saw a perfectly round shape fall from the sky very, very fast.  It was blue-green in color. I saw a perfectly round object enter my line of sight.  It came down from the sky at maybe a 70 degree angle.  It lasted for about 2 or 3 seconds.  Its color was blue-green.   I did not see it land but I searched for it at the town square.  It made no sound.  In the sky, it was maybe the diameter of half the size of the moon.   I did not find where it landed.  It was moving very fast.   I saw this from my truck that I was driving and I was heading east on Highway 70. ((NUFORC Note:  We believe that the sighting may be of a meteor, but that is only a guess.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112216.html",
      "state": "TN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c30bf",
      "summary": "We were outside pooking at the stars, when we saw a what looked like a fireball falling  at an angle,off to the southeast of the sky.It",
      "city": "arlington",
      "shape": "fireball",
      "date": "2014-08-08T00:00:00",
      "story": "We were outside looking at the stars, when we saw a what looked like a fireball falling  at an angle, off to the southeast of the sky.   It appeared, then disappeared in about 4 seconds.",
      "link": "http://www.nuforc.org/webreports/112/S112195.html",
      "state": "WA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c32be",
      "summary": "Explosion and then a Giant Star-like object appeared and ascended.",
      "city": "arlington",
      "shape": "circle",
      "date": "2015-03-13T00:00:00",
      "story": "Explosion and then a Giant Star-like object appeared and ascended I was walking back from taking the garbage out and saw what looked like a shooting star. The shooting star/object was moving west away from Washington, DC..  As it was moving west, it exploded into two pieces.  It looked like a blue flame that split into two.  Half of it went West and the other half moved East and disintegrated.   At that moment I thought it was pretty cool that I saw a shooting star, but then thought I never seen a shooting star explode like that.   I then proceeded to look up at the sky and about a minute after I saw the explosion, I looked up and saw what looked like a very big star.  I would say it was comparable to the size of the North Star.  The Star got bigger and then started to ascend upward and disappeared.   Now I am an educated man and have seen dozens of shooting stars but never saw a shooting star explode and then see object in the sky move closer to Earth and then ascend upward and out of our atmosphere.  Pretty crazy but pretty exciting as well.",
      "link": "http://www.nuforc.org/webreports/117/S117618.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36d2",
      "summary": "I clearly witnessed a UFO sighting for 12+ seconds on the Columbia River near Arlington, OR on 02/19/15.",
      "city": "arlington",
      "shape": "disk",
      "date": "2015-02-20T00:00:00",
      "story": "I clearly witnessed a UFO sighting for 12+ seconds on the Columbia River near Arlington, OR on 02/19/15. On Thursday, February 19, 2015 I was driving from Kennewick, WA to Vancouver, WA on the Oregon Interstate 84 West that runs along the Columbia River.  At 11:55 a.m., I was approximately 1/4 mile from the green Gilliam Co. road sign.  The weather was clear with some sun and high white and dark rolling clouds. A train came up along side of me on the raised tracks to the north of the Interstate.  On the north side of the train track, setting lower, is the Columbia River bed and river.  I looked over at the train as it passed me, wondering how fast it was traveling as I was driving approximately 68-69 m.p.h..  I noticed the back few train cars were flat trailers, faded pinkish in color, with some flat product wrapped in white and bright yellow plastic, and a little bit of the plastic was flapping in the wind.  I did not notice any other cars around me on the Interstate at the time. As the train got approximately three car lengths ahead of me, I heard a very loud rumble. The sound was not like a train track sound, but more like a very close jet rumble.  I had my two front car windows, and my back passenger window, down approximately 3\" each, because of the outside mild temperatures.  I was shocked by the sound and was trying to figure out why I was hearing, what I thought must have been the train sound, even though I knew it sounded odd, after it had already passed me. I glanced back at the train to the left and caught something out of the corner of my eye to the right that made a downward fishhook motion from above the river water, as if it had descended and leveled.  I looked directly out my passenger window and parallel with me was a small domed craft, what appeared to be hovering, but it also stayed parallel with me as I continued to drive.  It was approximately 10-15 feet above the Columbia River water, well below the Interstate and train track.  There were no boats in the water and this was an obvious aircraft with an obvious shape, above the water.   I glanced back again at the last train car that was now ahead of me on the track and back to the craft for size comparison, and the craft appeared to be slightly larger than half a train car. The craft shape was slightly domed on top and was symmetrical. It appeared to be directly facing me as it stayed parallel with me.  On the end of the dome, on the left and right, were small extensions that looked like downward wing tips.   The underbelly was slightly domed, but not as much as the top part.  In the center of the side wall facing me, was a smooth small protruding cone, or rounded tip of some kind, with a perfect black circle on the end.  Above this cone, was a shape that resembled a bell dome, or what came to mind at the time was the shape of a WWII German soldier hard hat, with a slight curl on the end and small brim at the top.  The center of the bell looked flat, which looked like a cockpit window of sorts, but there was no glass reflection or difference in color from the rest of the craft.  The overall color was a dry flat blended, almost swirled, grayish green, very similar in color to that of the river, but the river was shiny and glossy, and this was an obviou! s flat color, and again, obviously shaped and raised above the water. This entire event was only a matter of seconds, approximately 12, but felt slow motion at the same time as I couldn't believe what I was seeing. The craft, while appearing to stay even with me while I continued to drive, and the train out of immediate view now, made a 1/4 slow even circular turn to the right and paused for a second.  As it did this, I did not see the profile of the cone or brim that was on the front. It appeared a smooth, almost fluid, transition.  There were no shapes or markings on this side, only the same grayish green color.  The craft then very quickly made a 3/4 right turn, bringing it full circle, and it shot upward, heading northwest toward the Washington side of the Columbia River, in a steep, just slightly angled, climb, well above the mountain on the Washington side of the river.  As it made its final turn before heading upward, I heard a loud brief swoosh sound. The craft appeared to turn black once it moved away from the water. In a matter of 2-3 seconds, it disappeared in to the white rolling clouds above.  There were no visible lights on the craft, no jet trail, no heat or fume waves visible.  Nothing. I drove to the next small town of Arlington, OR, and pulled in to their park.  My heart was racing and I felt nauseous.  I think I was in shock from what I had just seen.   I texted my immediate family members and told them what had happened at 12:20 p.m.  At 1:17 p.m., I sketched a picture of what I saw. To my credibility, I am a ((50's)) year old mother, and grandmother who holds a ((deleted)) Degree in ((deleted--arts and sciences)), and two ((deleted)) Degrees with ((deleted--honors)).  I have never experienced anything like this before, but I can not refute what I saw today.",
      "link": "http://www.nuforc.org/webreports/117/S117393.html",
      "state": "OR",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e99",
      "summary": "10-11 orange lights seen on 06 June, 2015, @ 10 PM, in Arlington, WA.",
      "city": "arlington",
      "shape": "light",
      "date": "2015-06-15T00:00:00",
      "story": "10-11 orange lights seen on 06 June, 2015, @ 10 PM, in Arlington, WA. On June 6, 2015, at 10:00 PM, in Arlington, WA, I got out of my car to pump some gas at the Safeway gas pumps in Smokey Point.  As I turned north to walk behind my car, I saw several orange lights jump up into the sky very quickly, one after another.  Each one popped up within a second or less after the one before it.  I have photos of ten of them, but I think there was an 11th one that is not in the photo.  It seemed like there was a straggler. They stayed somewhat low above the horizon for about 30 seconds.  (You can get a good idea of this in the photos.)  I took a total of ten photos while they were in sight.  Then they suddenly turned to the east, (they had been heading south towards me, and I was slightly to the west of them) and flew out of sight pretty quickly.  There was no sound from them the entire time. These lights were much brighter and bigger than any star and much smaller than the Moon. You can get a sense of this in the photos.  I did not see any flashing lights, just steady, orange lights moving across the sky.  They did not have any of the lights that a typical airplane would have. I did consider the possibility that they could be Chinese lanterns.  However, they moved much too quickly and with too much control for that to be the case.  In my location, I wondered if they had taken off from the Arlington Airport, which is not a manned airport (it has automated landing).  That could have been approximately where they took off from, because they looked reasonably close.  However, they could also have taken off further north than that.  The lights were bright enough to be seen from a good distance. There was not a noticeable wind in the area at the time I saw this.  I think Chinese lanterns would have stayed around much longer, even if there had been a strong wind. When I expand the one photo of three lights, I can see the orange glow.  It’s not real clear.  I took the photos with my iPhone. However, you can get a sense of the color. ((NUFORC Note:  We spoke via telephone with the witness, and we found her to be quite level-headed, and quite objective in her description of the sighting event.  We suspect that she is a very reliable and capable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119440.html",
      "state": "WA",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3eb4",
      "summary": "Bright light, seen from Arlington facing west looking towards Camano Island area",
      "city": "arlington",
      "shape": "circle",
      "date": "2015-06-15T00:00:00",
      "story": "bright ligh. scene from Arlington facing west looking towards Camano Island area Very bright light seen while looking at Venus from Arlington.   Thought I was looking at a star but it suddenly seemed to turn from going north to facing East got very bright then disappeared.  I am sure it was not an airplane.  There were no flashing lights and when it disappeared it was very sudden.",
      "link": "http://www.nuforc.org/webreports/119/S119453.html",
      "state": "WA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f71",
      "summary": "Star moved, then disappeared.",
      "city": "arlington",
      "shape": "light",
      "date": "2015-05-29T00:00:00",
      "story": "Star moved, then disappeared. About 12:50 am, I walked out on my deck noticed 3 stars, equally spaced, looked like orians belt I was looking do west.  l looked south to see orion but dident I looked back and forth for about a minutes then just stared to the west I didnt rember 3 stars before .  Then all of a sudden the star on the right moved north west for 3seconds about the distance between the spaces between all 3 stars .then disappeared like a light switch all this time all 3stars were same distance apart and same brightness",
      "link": "http://www.nuforc.org/webreports/119/S119152.html",
      "state": "WA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4101",
      "summary": "Greenish bright light that moved up and down several degrees then rapidly fell towards earth.",
      "city": "arlington",
      "shape": "light",
      "date": "2015-05-22T00:00:00",
      "story": "Greenish bright light that moved up and down several degrees then rapidly fell towards earth While sitting outside my condo I always watch the airliners ascending from Reagan National Airport.  Tonight I heard the sound of a jet fighter patrolling high in the sky.  At about 9:30 PM I was looking east, up at about 40 degrees altitude when I saw a greenish tinted bright light that was moving just perceptibly up and down in the sky.  After it moved up and down and up and down again it rapidly fell straight down.  My 6-story high building then obscured it further from view.  I might guess that the light was 1 to 2 miles distant, based on its size and brightness. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118985.html",
      "state": "VA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4649",
      "summary": "6 round orange lights seen in southwestern sky in west Tennessee",
      "city": "arlington",
      "shape": "fireball",
      "date": "2015-11-19T00:00:00",
      "story": "6 round orange lights seen in southwestern sky in west Tennessee I observed 6 round orange lights in the southwestern sky this evening around 7 p.m.  I had taken my dog out in the back yard and looked up to see the lights which were in the approximate shape of a check mark.  Two lights at the bottom were very close together and the rest of the lights appeared to form an arc toward the west..these were farther apart.  I ran inside to get my camera and when I came back out, all were gone but one.  It seemed to just fizzle out and totally disappear really fast.  Then I observed another orange round light a little farther out.  I was actually able to photograph both of the single sightings before each disappeared.  They did not appear to move through the night sky.",
      "link": "http://www.nuforc.org/webreports/124/S124084.html",
      "state": "TN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4754",
      "summary": "Pictures taken of sunset and clouds, UFO captured in photo over Arlington, TX",
      "city": "arlington",
      "shape": "cigar",
      "date": "2015-12-03T00:00:00",
      "story": "Pictures taken of sunset and clouds, UFO captured in photo over Arlington, TX. Driving home from work I was trying to take some photos of the sunset and the clouds and after looking at the pictures I found something strange as it appears to be an unidentified flying object that was not visible in the sky when the picture was taken.   This was around 6:45 in the evening. There were NO Airplanes or HELICOPTER in sky at the time either.",
      "link": "http://www.nuforc.org/webreports/124/S124483.html",
      "state": "TX",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b39",
      "summary": "((HOAX??))  Looks like a large meteor.",
      "city": "arlington",
      "shape": "fireball",
      "date": "2015-09-17T00:00:00",
      "story": "Looks like a large meteor. ((NUFORC Note:  Meteors do not remain visible for an hour.  Hoax??  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121930.html",
      "state": "WA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c17",
      "summary": "10+ redish orange lights.",
      "city": "arlington",
      "shape": "light",
      "date": "2015-09-11T00:00:00",
      "story": "10+ redish orange lights. Went out side saw a bright redish orange light above the treeline seeming to be hovering. Then called my wife out to look.   Then several other of the same lights coming in to view from behind the trees as soon as those one cought up to the light that was hovering they all took off to the south southwest and disappeared with out any sound.   Then a few minutes later two more came from the same position that the rest came from and left in the same direction and speed of the rest of the lights",
      "link": "http://www.nuforc.org/webreports/121/S121727.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5138",
      "summary": "Bright fast moving glowing green object low in horizon at early evening",
      "city": "arlington",
      "shape": "teardrop",
      "date": "2016-02-19T00:00:00",
      "story": "Bright fast moving glowing green object low in horizon at early evening Was walking my dog, helicopter was in the area in apparent low large oval orbit with landing spotlight shining in Douglas Park area.  As it moved towards Four Mile Run Road, I saw an object moving along the dark skyline, traveling northwest.   The weather was clear, object glowed bright green with small glowing tail of green, my first thought it was an aircraft possibly the helicopter, but noted it was bright and moving horizontally at a moderately fast flight NW...second thought was it was a falling star type object, but it was too close to horizon to be that.   Object should possibly have been observed by helicopter in the area as they were in the same basic direction.",
      "link": "http://www.nuforc.org/webreports/125/S125881.html",
      "state": "VA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c532e",
      "summary": "As a pilot I recognized these as aircraft landing lights, but they never moved.",
      "city": "arlington",
      "shape": "chevron",
      "date": "2016-01-14T00:00:00",
      "story": "As a pilot I recognized these as aircraft landing lights, but they never moved. Three bright lights north of Lakewood Dr., approx. 2.5 mi. NW Arlington, WA.  Appearedt to be landing lights of aircraft approx 1,800'.  AGL 3 white one rotating red., but stayed in same position for 3-5 minutes.   Extremely bright as an aircraft landing, but never moved.  Faded after a few minutes",
      "link": "http://www.nuforc.org/webreports/125/S125179.html",
      "state": "WA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5571",
      "summary": "Slow moving fireball.",
      "city": "arlington",
      "shape": "fireball",
      "date": "2016-07-08T00:00:00",
      "story": "Slow moving fireball. Slow moving orange colored.  It looked like a fireball, but was moving too slowly, (according to the website where fireballs can be reported).  The object moved in an arc shape from north toward south.",
      "link": "http://www.nuforc.org/webreports/128/S128055.html",
      "state": "WA",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c55af",
      "summary": "Slow silent orange lights over Arlington, WA.",
      "city": "arlington",
      "shape": "light",
      "date": "2016-07-08T00:00:00",
      "story": "Slow silent orange lights over Arlington, WA. 3 Orange lights coming slowly from the east.  When they got approximately over Arlington or Oso, they stopped, and then slowly faded out.   This is the second time I have seen bright orange lights here near Arlington.  Always no sound, always orange.",
      "link": "http://www.nuforc.org/webreports/128/S128124.html",
      "state": "WA",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c4b",
      "summary": "Bright object shots up and disappears into space.",
      "city": "arlington",
      "shape": "oval",
      "date": "2016-04-01T00:00:00",
      "story": "Bright object shots up and disappears into space. I work between Arlington, Texas, and Euless, Texas @ Collins street or TX157.  For the past month I've noticed an oval shape craft fly in the same direction (south) and slowly shoot up into the sky and disappear.   I've have noticed that it usually appears flying somewhat erratically and bright. It's as bright a the planet Jupiter.  I can actually see it go up into the upper atmosphere and disappear. It's cool.",
      "link": "http://www.nuforc.org/webreports/126/S126646.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f97",
      "summary": "Very bright light fairly low in the sky as seen SW from Arlington. Very slowly descended then faded out and just disappeared.",
      "city": "arlington",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "Very bright light fairly low in the sky as seen SW from Arlington.  Very slowly descended then faded out and just disappeared.",
      "link": "http://www.nuforc.org/webreports/131/S131153.html",
      "state": "WA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6072",
      "summary": "Large Bird Drone Seen Flying Over VIP Security Helicopters?",
      "city": "arlington",
      "shape": "other",
      "date": "2016-09-22T00:00:00",
      "story": "Large Bird Drone Seen Flying Over VIP Security Helicopters? I was in my front yard watering flowers.  About 10:40 AM two UH1N helicopters started making wide circles around my neighborhood (dark blue fuselage, white on top) which usually indicates there is a federal VIP in the area for some event.  The helicopters were flying low, about 300 feet altitude.  They circled the neighborhood in 2 mile circles several times.   After the helicopters passed nearly overhead I looked up and saw a large bird circling overhead at about two thousand (2000) feet altitude.  I had seen a similar large bird before a year ago when a couple of UH1N helicopters circled my neighborhood.  The bird did not flap its wings but soared in tight circles for 30 seconds and flew to another location and soared in tight circles for another 30 seconds, and then soared to another location, soared in tight circles for another 30 seconds.  I estimate the bird had a wingspread of 10 feet.  The bird appeared to be alternately black and silver.   I ran indoors to grab a pair of binoculars, and by the time I returned, the helicopters and bird had disappeared.",
      "link": "http://www.nuforc.org/webreports/129/S129957.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61cd",
      "summary": "Fifteen minute sighting of unusual light formation north of Madison..",
      "city": "arlington",
      "shape": "light",
      "date": "2016-09-09T00:00:00",
      "story": "Fifteen minute sighting of unusual light formation north of Madison.. Light formation witnessed for a period of fifteen minutes north of Madison.  This formation appeared to be approx the width of a football field. It looked like 30-40 spotlights pointed straight upward toward the sky.   The lights were green with a bit of orange- but mostly green.  I could not see a source of the lights, and they were over an area of farm fields.   There were no tractors in the fields and there are also no homes or buildings in this area.   The light formation did move slightly to the west at the ten minute mark.  I counted approx 20 Air Force jets circling in the sky during the event.  This is highly unusual, as I normally see no more than a handful at a time in the skies around my home.  At the fifteen minute point the lights completely disappeared.",
      "link": "http://www.nuforc.org/webreports/129/S129649.html",
      "state": "WI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c63a0",
      "summary": "3 or 4 lights in a perfect triangle arrangement, to the west of Arlington.",
      "city": "arlington",
      "shape": "triangle",
      "date": "2016-09-02T00:00:00",
      "story": "3 or 4 lights in a perfect triangle arrangement, to the west of Arlington. Two of us went outside at night to walk the dog.  I was noticing the stars and that one in the clear western sky looked \"odd\".  I kept looking at it and noticed it appeared to be not one light, but multiple lights, at least 3 lights and perhaps 4.  All together they were in the shape of a perfect triangle, with the point toward us consisting of perhaps 2 lights close together.  The lights were colored yellowish.  The UFO was approximately due west from us, elevated approx. 40 degrees up from the horizon.  My best guess is that its altitude was perhaps 3500-5000 feet above ground, and maybe 4 miles from our position. \"It\" seemed to appear to be moving very very slowly to the east, almost as if in a slow moving hover.  No sound could be discerned from it. We could see only lights. My wife took some pics with her cell phone but they just show a faint blur (pixelated) area.   After about 5 minutes of looking, we went back to our apartment to get my monocular, binoculars, camera, and to make a quick report on Facebook, in the hopes that others saw it too.  That took about 3-4 minutes, then we went back outside to the place we had observed the UFO.  We could not locate the UFO again and noted that the sky appeared to be hazy now and clouding up some. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129582.html",
      "state": "WA",
      "duration": ">5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d84",
      "summary": "Oval object making no noise moving N. to S. looked transparent except for the edge reflecting sunshine.",
      "city": "arlington",
      "shape": "oval",
      "date": "2016-12-15T00:00:00",
      "story": "Oval object making no noise moving N. to S. looked transparent except for the edge reflecting sunshine. Bright clear morning looked up and thought I saw the edge of the moon, but it was too small and too faint.  It was moving quickly from North to South and seemed to be around 2000 feet up.  Object was barley visible like it was transparent.  I looked from another spot to be sure it wasn't my eyes playing tricks but it's course never wavered.   I dropped what I was holding and ran to get some binoculars but it was gone or I couldn't find it again when I got back outside.  No noise and very hard to spot.  I don't know how I saw it at first but the sun was coming up behind it and causing a shine off of its edge.    There was a commercial jet near by that had leveled off after take off and had moved only about 6 of it's fuselage lengths.",
      "link": "http://www.nuforc.org/webreports/131/S131726.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ddb",
      "summary": "String of oval shaped lights circle each other to form a larger craft.",
      "city": "arlington",
      "shape": "light",
      "date": "2017-09-05T00:00:00",
      "story": "String of oval shaped lights circle each other to form a larger craft. I looked out my bedroom window at around 10:30 PM Friday, May 26th, 2017, to see a large series of lights rotating counter clockwise.  It appeared as though the lights were forming a very large circular craft.  There appeared to be a secondary craft about half the size of the first rotating in the opposite direction than the original series of lights and hovering adjacent.  I ruled out search lights as the sky was very cloudy, and no streaks of lights indicating a ground level light were seen, just large pull shaped lights slowly circling.  There was no sound to be heard.   The phenomenon lasted an hour and a half after I had originally seen it through my window, there is no telling whether or not it had started earlier.   At 12:00 midnight I returned to the window to check on the position of the lights and they had completely disappeared without a trace.   Another thing worth nothing: during the time that the lights were visible, three conventional aircrafts were heard.  I heard one helicopter, and two planes.  I live close to Logan Airport, commercial flights are very common to see and hear, but the two planes sounded distinctly louder and were only breifly heard.  The lights remained well after the conventional aircrafts had left earshot.",
      "link": "http://www.nuforc.org/webreports/136/S136007.html",
      "state": "MA",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c71a2",
      "summary": "We sighted it from are porch about 11000 feet in the air it was mercury colored it moved in an arch pattern. Me and my two son saw it m",
      "city": "arlington",
      "shape": "oval",
      "date": "2017-07-23T00:00:00",
      "story": "WE sighted it from are porch about 11000 feet in the air.  It was mercury colored it moved in an arch pattern.  Me and my two son saw it my middle boy age 16 saw it first then I saw it and my little boy saw it age 11.  I it was hard to see but we all though it looked different then it just got out of range of sight.  This is the first one we have ever see I am not saying it could of been a jet but I do not know thanks.",
      "link": "http://www.nuforc.org/webreports/135/S135292.html",
      "state": "IN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c741c",
      "summary": "My husband, daughter and I all woke up very early and stepped out onto our back steps to look at the morning stars. One star, in the We",
      "city": "arlington",
      "shape": "light",
      "date": "2017-05-15T00:00:00",
      "story": "My husband, daughter and I all woke up very early and stepped out onto our back steps to look at the morning stars.  One star, in the Western sky, seemed brighter than all of the others.   As we were looking at it, we realized that it was moving very slowly.  At first, we thought it may be an airplane.  But we realized that it didn't have any red or blue lights, nor did it make any sound.  It was very bright steady light and larger than any stars we could see!   It continued on a straight path, heading East.  We watched until it disappeared behind some trees.  This had a very strange look to it and we all feel sure it was not an airplane.   Just not sure what it really was!   We captured it on a short video on my cell phone. But the quality is poor.",
      "link": "http://www.nuforc.org/webreports/134/S134095.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a69",
      "summary": "Multiple lights over Fort Myer.  ((NUFORC Note:  Lens flares from headlights, and a green traffic signal.  PD))",
      "city": "arlington",
      "shape": "light",
      "date": "2017-12-04T00:00:00",
      "story": "Multiple lights over Fort Myer I went outside with my dog to see the super moon.  I did not notice anything around the moon when looking at it but I took three pictures of the moon and in one picture, there are two lights near it and the other, four white lights and two other lights to the side.  One picture has no lights.  I thought it might be a reflection but I’m not sure, since one picture had no lights.   The lights were right over the entrance/exit area to Fort Myer and are viewed from a residential neighborhood across Washington Blvd. ((NUFORC Note:  Lens flares from headlights, and a green traffic signal.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137554.html",
      "state": "VA",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f10",
      "summary": "Infra red orb of light seen on security monitor moving strangely above the tree line.",
      "city": "arlington",
      "shape": "light",
      "date": "2018-05-04T00:00:00",
      "story": "Infra red orb of light seen on security monitor moving strangely above the tree line. While monitoring my security cameras @ 1:21am 4/27/18, I noticed a strange orb of light moving strangely above the tree line looking east above Arlington, Wa.  I went out to the driveway and looked for it, but did not see it.  I went back and reviewed the video footage and the orb of light was in the exact area I was looking at.   Evidently, the IR night vision of the camera was picking up an infra red light source.  Just after I turned to come back inside, the light went straight up out of frame of the camera.  The light moved up, down, and sideways like a hobby drone.  It appeared to move over a large area and would have been hard to fly without visible lighting on it.  It was in view for about 2 minutes.",
      "link": "http://www.nuforc.org/webreports/139/S139631.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c848c",
      "summary": "Sphere in sky, looked like the sky was moving.",
      "city": "arlington",
      "shape": "sphere",
      "date": "2018-10-06T00:00:00",
      "story": "Sphere in sky, looked like the sky was moving. Cousin and I saw a sphere shape moving in the sky, looked as if the sky was moving.  Looked as if it created a cloud.  There was no blinking lights, but it was easily seen if you looked.  It was in the sky for about 10-15 seconds.",
      "link": "http://www.nuforc.org/webreports/143/S143330.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c87e3",
      "summary": "Black sphere about the size of a large air plane very slowly moving then as I pointe do it out it sped off very extremely fast.",
      "city": "arlington",
      "shape": "sphere",
      "date": "2018-07-13T00:00:00",
      "story": "Black sphere about the size of a large air plane very slowly moving then as I pointe do it out it sped off very extremely fast. I witnessed a black sphere hovering and slowly moving in the distance high up in the sky and about 10 miles away.  As I told my friend to look at it, it was too far for my friend to see it his vision was not as good as mine.  It was dark clouds all over the sky.  The sphere was just below the high dark clouds.  Then it began to rain and thunder.",
      "link": "http://www.nuforc.org/webreports/142/S142195.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8809",
      "summary": "Black disc craft hovering and sped away, silent, daytime and causing involuntary temporary paralysis with telepathic communication.",
      "city": "arlington",
      "shape": "disk",
      "date": "2018-07-05T00:00:00",
      "story": "Black disc craft hovering and sped away making no sound daytime and causing involuntary temporary paralysis with telepathic communication. I witnessed a disc shaped craft   black in color matte/ metallic about twenty feet wide it had some type of lettering on the lower half of the object.  The craft seemed to be emitting a field which may have been the cause of me being as if not able to move. There was a feeling of communication through thought with my inner voice.  This was to and from the disc craft.  It moved after I came out of the state of being entranced.  Then I moved as I began to search for it in the surrounding sky I watched it move slowly away then when I pointed at it moved away horizontally and with immense speed far away as the eye could spot it and then up as if it went to space. The craft was I think somehow emitting a field that I could sense like small waves that were so intense.  As if I could almost see a ripple or an aura that seemed to be what was paralyzing me and then I felt like I should think what I wanted to communicate so I said through my mind to it, why do you not intervene to improve our world? I sensed a voice answering because of all the warring.\t I was riding a bicycle on the fish creek trail in Arlington, Texas and stopped along the trail happened to be looking up when I saw a black saucer shaped craft. It hovered   about twenty feet above the ground It was an area with trees and a creek there was a clear area about 40 feet wide where it was clear of trees. Upon noticing the flying craft I was completely consumed with awe and shock it took all my attention away from my two children who did not look up to see the craft because I could not even move my attention from the object.  They sat facing me under the shade of a tree that was to the right and slightly forward of the object.  The tree was thick with leaves so they did not see or look up at it.  When my son yelled to get my attention is when I realized that he had been calling me for about a minute already. “He shouted Dad what are you looking at you are scaring me.”  That is when I broke my stare of the object to turn to him as I looked up again the object moved. When I moved to where my children were I looked up to notice the tree was not allowing for them to get a view of the craft so they followed me as I moved over to where I looked around for where it had moved to.  Then I spotted it again as I was looking at it this time it seemed to be about two hundred feet away 100 feet high moving south it had a blue color hue on the back.  As I pointed to it to show my son where it was the craft sped away without making a sound.  It was so fast that before my finger was able to point at it the thing seemed to leave the atmosphere. I am an Officer in a Federal Agency since 2002 and have been in this country all my life. ((NUFORC Note:  We spoke with the witness, and found him to be quite eloquent and sober-minded.  We suspect that he is an excellent witness.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142084.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d0a",
      "summary": "The object was shaped like a doughnut with a large hole in the center, probably 3 feet wide in total.  ((anonymous report))",
      "city": "arlington",
      "shape": "circle",
      "date": "2019-01-24T00:00:00",
      "story": "The object was shaped like a doughnut with a large hole in the center, probably 3 feet wide in total, moving forward but flipping. The object was shaped like a doughnut with a large hole in the center, probably 3 feet wide in total.  It moved in a forward motion but was flipping and twirling at the same time.  It was flying low to the ground but above the rooftop and treetops as viewed from my window.   I am a clear-headed well-educated individual, and this was viewed in daylight.  My initial thought it that it was a type of drone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144580.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d50",
      "summary": "Tall skinny alien spotted years back crossing a regular neighborhood in the suburbs at night. Why??",
      "city": "arlington",
      "shape": "other",
      "date": "2019-01-04T00:00:00",
      "story": "Tall skinny alien spotted years back crossing a regular neighborhood in the suburbs at night. Why?? Although this happened a few years back, I am curious to know if anyone has seen the same thing I did. Driving down a regular, pretty nice, suburban street at night in Arlington, me and my bestfriend we’re headed towards the end of a street where you could either go left or right when you got the the stop sign.  You can not go straight.  (We needed to go left). As we were coming down the same street we always did, a 8 ft tall “thing” walked across the street, at the stop sign of the neighborhood which we were driving towards.  It was similar shaped to a human, but way taller and way skinnier, overall tall and lanky to the point where there was no mistaking the fact that it was not human.  It’s head was slimmer than a human too, clearly not as big as a human head would be to a body of this size.  The arms went further down then a humans would.  It walked across the street like it was somewhat in a hurry. My heart dropped instantly and I couldn’t really even say anything.  I could not believe what I know I had for sure seen just casually, somewhat in a rush, cross the street. My bestfriend spoke about 2seconds after it happened, (she was driving the car) and said, “did you just see that”  I said “YES” she replied, “well tell me what you saw so I know you’re not lying.” “It was y’all and skinny”.  She started laughing and continued driving down the street as I yelled at her to stop because I thought it would jump on the car or something like a horror movie. Instead, it must have his because it was nowhere in sight.  But if I were it in a human world, I would probably hide too. There is one video on YouTube of an alien on a roof top in Mexico in 2015. That is the only pic/video I have found of EXACTLY the thing that I saw.  I know that video is real, because I saw that thing with my own eyes.  I think he is stuck on Earth, maybe that’s why it took him 3 yrs to end up on a roof top in Mexico because he is having to walk around at night to try to stay out of sight somewhat.  Not really sure.",
      "link": "http://www.nuforc.org/webreports/144/S144165.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f4b",
      "summary": "Odd plane with bat-like wings.",
      "city": "arlington",
      "shape": "other",
      "date": "2018-11-24T00:00:00",
      "story": "Odd plane with bat-like wings I was driving: Westbound I-530 - at: 7:23am on: October 23rd.  - heading for the freeway at: Arlington/Darrington exit.  I noticed what appeared to be a plane flying slowly over the freeway exit and alongside Denny's Restaurant and the Arlington Motor Inn, higher up in elevation that most planes fly.  It appeared to: stop then:  it rotated and headed back (in the opposite) direction.  It looked like a sleek silver Jet Plane but had odd wings with (bat-like) extensions hanging off its wings.   I have never seen a plane like this before and wonder if we even produce planes like this?   I wonder what the other drivers on the road thought of this:  odd Plane?  And if they were just as puzzled as I was, wondering, \"What the heck is it?!\"",
      "link": "http://www.nuforc.org/webreports/143/S143703.html",
      "state": "WA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c917b",
      "summary": "I have seen a UFO or I believe so it had 3 lights and it made a rocket sound. The story goes like this my dog was going nuts and we tho",
      "city": "arlington",
      "shape": "cone",
      "date": "2019-12-01T00:00:00",
      "story": "I have seen a UFO or I believe so it had 3 lights and it made a rocket sound.  The story goes like this my dog was going nuts and we thought he/the dog needed to go to the bathroom so we/me and my sister took him outside and that is where we had heard  and have seen the space craft and my mother had heard the sound also and all of the dogs/I have 3 dogs/ started crying and we all ran inside",
      "link": "http://www.nuforc.org/webreports/149/S149574.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c9693",
      "summary": "Fireball 11/21/19 6:30pm, observed from Arlington, WA, arcing across the sky to the north.",
      "city": "arlington",
      "shape": "fireball",
      "date": "2019-12-01T00:00:00",
      "story": "Fireball 11/21/19 6:30pm, observed from Arlington, WA, arcing across the sky to the north. On 11/21/19 at about 6:30pm, I was driving north on I-5, just north of 236th exit 210, when a fireball shot across the sky moving east to west at about 40 degrees above the horizon. Yellowish orange in color, the fireball was much larger than a shooting star, it looked more like a close comet.  Visible longer than a shooting star, and lasting probably 3-5 seconds, with a much wider trail, the arc trail across the sky was probably 1/4 of the horizon! Brake lights appeared on several other vehicles on the freeway. There was no sound related to the event. This is the first fireball I have ever seen, though I enjoy stargazing and have viewed many shooting stars and satellites.",
      "link": "http://www.nuforc.org/webreports/151/S151018.html",
      "state": "WA",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c980a",
      "summary": "Walked out side from main house to walk to my cabin &quot;guest house&quot; and seen it in the sky triangle form and alot of lights rig",
      "city": "arlington",
      "shape": "triangle",
      "date": "2019-12-19T00:00:00",
      "story": "Walked out side from main house to walk to my cabin &quot;guest house&quot; and seen it in the sky triangle form and alot of lights rig Walked out side from main house to walk to my cabin \"guest house\" and seen it in the sky triangle form and alot of lights right when I reached in my pocket to pull my phone out it took off and disappeared  2nd sighting and 1st sighting couldn't see a shape just lights",
      "link": "http://www.nuforc.org/webreports/151/S151628.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c97e5",
      "summary": "Procession of light formatioms from S to N with no sound.  ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "arlington",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Procession of light formatioms from south to north with no sound. Moving from south to north the lights were in a formation of single lights then double lights. it lasted for 30-40 mins non stop, one after another. lost sight because of cloud cover.",
      "link": "http://www.nuforc.org/webreports/151/S151049.html",
      "state": "WA",
      "duration": "30-40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c97ed",
      "summary": "Walked out side on the phone seen pass really fast stopped above neighbors house than take off and lights and ship disappeared in thin",
      "city": "arlington",
      "shape": "triangle",
      "date": "2019-12-19T00:00:00",
      "story": "Walked out side on the phone seen pass really fast stopped above neighbors house than take off and lights and ship disappeared in thin air",
      "link": "http://www.nuforc.org/webreports/151/S151630.html",
      "state": "TX",
      "duration": "8 seconds"
    }
  ]
}