{
  "city": "atlanta",
  "fetch_timestamp": "2025-07-12T14:32:22.860019",
  "record_count": 104,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4203",
      "summary": "6 lights seen in East Texas. Moving strangely",
      "city": "atlanta",
      "shape": "other",
      "date": "2019-03-21T00:00:00",
      "story": "6 lights seen in East Texas Moving strangely It was 22:28 Thursday the 14th this March.  I was waiting outside for my girlfriend to show up, and I looked up to take in the night sky.  I’m used to aircraft flying over the area, it’s semi remote, and off towards the Bivins area (south and slightly west of where I was) was a grouping of six lights.  000 000  At first I thought it was a drone, or some sort of aircraft, because Barksdale AFB isn’t super far, and they have a lot of aircraft down there.  I watch it kind of slowly make it way south west, still not sure what to make out of it yet, and then it suddenly turns a sharp west, and slightly increased speed.  That was when I figured out that this wasn’t some formation of craft, but a single, seemingly large craft, because the way it turned was like a zero turn mower if you improved their turning radius even more. The observer is an Army Veteran, and College student, majoring in Business Administration.",
      "link": "http://www.nuforc.org/webreports/145/S145246.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b2b",
      "summary": "Extreme speed across the sky from a long distance, not the ISS.",
      "city": "atlanta",
      "shape": "other",
      "date": "2019-07-25T00:00:00",
      "story": "Extreme speed across the sky from a long distance, not the ISS. A relatively faint light, looking like a night time distant star moving very rapidly across the night sky from north to south.  It was not the ISS as I looked at the schedule.  I have seen the ISS fly over my house and even though it seems to move quickly across the sky, this object was noticeably faster.  If it was an aircraft at high altitude it was moving extraordinarily quickly!  I have never seen a distant object move this fast across the sky, including the ISS.",
      "link": "http://www.nuforc.org/webreports/147/S147789.html",
      "state": "GA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cce",
      "summary": "So honestly it didn’t look very odd at first it just looked like a plane but the more I looked at it the more I could see it looked mor",
      "city": "atlanta",
      "shape": "cigar",
      "date": "2019-06-20T00:00:00",
      "story": "So honestly it didn’t look very odd at first it just looked like a plane but the more I looked at it the more I could see it looked more like a cigar (granted it was very far away).  What really made me report it though was the distance it was covering.  Like 15ish miles a second and when I did some calculations that would be close to 60000 mph.  Which is ungodly fast, there also seemed to be some intelligent maneuvering going on which makes me believe it wasn’t a rocket.  (It continually changed direction) although I’m no expert in weapon systems.  It could have been nothing but it seemed odd, odd enough that I wanted to research and report it.",
      "link": "http://www.nuforc.org/webreports/146/S146819.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b500a",
      "summary": "Bluish-Green oblong light traveling at high rate of speed.",
      "city": "atlanta",
      "shape": "light",
      "date": "2019-03-29T00:00:00",
      "story": "Bluish-Green oblong light traveling at high rate of speed. Bluish-Green linear light moving at high rate of speed from east to west approximately 3 miles North of Hartsfield (Atlanta) Airport.  Crossed path of commerial flights taking off from airport perpendicular to flight paths.  So fast that it made commerial jets look motionless!  I estimate altitude at approximately 1,000 feet.",
      "link": "http://www.nuforc.org/webreports/145/S145393.html",
      "state": "GA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5004",
      "summary": "Blue light bounces across morning sky then disappears.",
      "city": "atlanta",
      "shape": "light",
      "date": "2019-03-29T00:00:00",
      "story": "Blue light bounces across morning sky then disappears. Stuck in downtown Atlanta morning traffic going 75 north, a blue light appears out of no where and darts across the dark sky.  The light was bouncing up and down as if it was loosing control.  Looked like someone’s headlight in the sky except it was a blue foggy light. Looked like the light was coming from behind clouds.  Happened so fast all I could say was wowwww.  Was not a plane.  The light was to big and bouncing up and down while traveling at an unexplainable speed then disappeared out of nowhere.",
      "link": "http://www.nuforc.org/webreports/145/S145397.html",
      "state": "GA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5182",
      "summary": "Light stationary in sky then ascends at incredible speed at abt 45 to 55 degree angle",
      "city": "atlanta",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Light stationary in sky then ascends at incredible speed at abt 45 to 55 degree angle Can only give an approximation, but know it was before Feb 4, 1993, possibly on the 3rd.  Don't remember the exact time but it was early twilight so probably between 6 and 6:30 PM(?),  the sun was below the horizon, no glare remaining, just a gradated deepening evening blue.  We were heading west on Ponce De Leon toward Midtown and I was a passenger in the car, front seat.  I was not on any medication, nor had I had any alcohol.   A bright white light appearing to hover near a Midtown skyscraper eventually caught my attention, about a mile distant.  Don't remember the light's  approximate elevation as far as stories go but it was to the right (north) of the skyscraper, several stories lower than the skyscraper's height but above any other buildings in the vicinity.  We were on a hill going toward Midtown and I was looking pretty much straight ahead at the light, not having to peer up into the sky.  I watched the light without thinking anything about it, then began to think about it and imagined it was the bright beam of a helicopter.  As I watched it struck me that it wasn't appearing to move.  By now I was curious because you expect the beam of a helicopter to waver as the vehicle moves and to grow brighter as it progresses, and imagining it a helicopter I had begun to watch for this as it hadn't happened yet.  I was still expecting it to be a helicopter, and so had  mentioned nothing to the driver  about it, when suddenly the light ascended at an incredible rate of speed into the sky, to the north, at about a 45 to 55 degree angle. Before you could snap your fingers it was gone, that fast, from what seemed an absolutely stationary position in the sky.  No trail.  No sound. There appeared to be no acceleration.    The amount of time I spent watching the light before it zipped off may have been as little as 30 seconds, probably no longer than a minute. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52504.html",
      "state": "GA",
      "duration": "Less than minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b56b9",
      "summary": "Sighting during Atlanta morning rush hour",
      "city": "atlanta",
      "shape": "oval",
      "date": "2008-03-04T00:00:00",
      "story": "Sighting during Atlanta morning rush hour Driving to Atlanta, the morning after my wife’s brother died, for my wife’s brother’s funeral with 3 children in the car, it was about 6:30-7am. We were at a standstill in morning traffic on the main interstate coming from Florida. It was a clear morning with no clouds in the sky.  Not moving in the traffic, I glanced up in the sky to my left and saw, very clearly, a shiny silver, object about the height and size as if a helicopter was hovering over the morning traffic.  This object had no propellers though and no wings. It hovered in that position. I turned my head to watch the slowly moving traffic. Then I quickly turned back to the object. It didn’t occur to me what I was seeing.  The shape was that of a blimp, but smooth, shiny and reflective like polished chrome.  I turned to watch traffic again and move as needed. When I turned back to see the object it was gone. I looked around and didn’t see it near by.  If this had been a plane flying into Atlanta’s airport it would still be visible making its way as would a helicopter.  This object disappeared from sight altogether.  My wife’s son also said later that he believes he saw the same object.  With thousands of cars stuck in morning traffic, I can’t believe that I was the only one to see this. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60557.html",
      "state": "GA",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d9f",
      "summary": "Single light that morphs into line of lights or triangle, then back to a light and speeds away.",
      "city": "atlanta",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Single light that morphs into line of lights or triangle, then back to a light and speeds away. I am a sixty year old Marine corps veteran who has watched the skies since I was a teenage Civilian Observation Corps volunteer.  I do not drink nor take drugs which would interfere with my vision. I hesitated for several weeks to report this anamolous phenomenon because sky conditions have not been ideal -- thunderstorms and clouds, not to mention the urban light scatter that makes observations in Atlanta difficult.  However this sighting has repeated itself a dozen times in the last few weeks and I felt compelled to report it.  In each occurance several hovering lights have been observed out of my bedroom window which faces almost due east.  This view looks out on a main air traffic corridor in and out of ATL (Hartsfield-Jackson International) and PDK (Peachtree Dekalb).  On these evenings I would observe the normal comings and goings of the aircraft, with their landing lights, wing lights, strobes, etc. and what I observed was obviously not an aircraft.  I would see one perhaps two lights hovering in position from just above the horizon, perhaps ten degrees, up to almost directly above.  On one or two occasions the light would appear just after a flash like a strobe,  On others the strobe flash was diffused by a high overcast.  The lights, which varied from a reddish white to a bluish white, would remain stationary for thirty seconds to five minutes, then would fade and in their place a line of lights would appear, usually canted from the horizontal, like a wing making a turn, or sometimes three red lights would appear in the same spot in the shape of a triangle, equilateral or isocoles, then would morph back into a light and move quickly, probably too quickly for an aircraft, to the northwest or southwest, DIRECTLY ACROSS the flight patterns of two airports.  It is extremely difficult to estimate altitude but would not be surprised if they were manuvering over fifty thousand feet.  As I mentioned the cloud cover made it difficult to track them completely across the sky but the consistency of the pattern is remarkable.   It did not seem to exhibit the flight characteristics of an airplane (unless a Harrier jumpjet which is highly inprobable) or a helicopter or a satellite.",
      "link": "http://www.nuforc.org/webreports/051/S51660.html",
      "state": "GA",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b5eb3",
      "summary": "Two separate dots in the sky merge into one and continue in straight line.",
      "city": "atlanta",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "Two separate dots in the sky merge into one and continue in straight line. I was lying with my 2 year old son on the grass looking at the beautiful blue sky -- one of those cloudless deep blue skys.  We were in the shade of the house.  I noticed a small dot moving accross the sky.  It reminded me of a sattelite that you can see at night moving accross the sky.  This one was pulsing and moving in a straight line high in the sky.  It was very hard to tell how high it was, but it was moving in a general southerly direction. I looked a little further ahead in the path it was headed and noticed a second dot.  This one was not pulsing and was moving much more slowly.  All of a sudden, this appeared to be something spectacular.  The first pulsing dot was moving right toward the second dot!  I watched as it approached, and as the 1st dot got closer, it circled 3/4 of the way around the 2nd dot, then they became one dot.  I don't remember if they pulsed after they merged or not, but they continued at the slower speed of the 2nd dot until I could no longer see them.  The dot moved too far south and I had to get out of the shade of the house, then the sun was too bright to see. At the time I didn't know who to tell.  I wasn't too good on the web at the time.",
      "link": "http://www.nuforc.org/webreports/054/S54284.html",
      "state": "GA",
      "duration": "~ 5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6a6c",
      "summary": "Hovering still curved boxy  20x25 ft. solid dark object over Atlanta freeway.",
      "city": "atlanta",
      "shape": "other",
      "date": "2008-03-04T00:00:00",
      "story": "Hovering still curved boxy  20x25 ft. solid dark object over Atlanta freeway. In full bright daylight I observed a curved boxy matte black solid object floating stationary in mid air 50 feet above the freeway in midtown Atlanta, GA from my 5th floor window. It was slightly above my eye level, 200 - 400 yards distant. The object was still. It just appeared and then disappeared without apparent motion 2-3 seconds later. The object was a fluted boxy cylinder, the side I observed had a matte black or very dark grey finish, with 4 vertically aligned portholes 1/3 down from the slightly curved dome at the top. The sides were parallel with fluted curved sections each with a shadowed porthole, matte black and indented. Each of the curved panels was 5-6 feet wide, each porthole 3ft wide by 4 ft high. The object had horizontal ovals 2 by 5 foot at the bottom of each fluted panel, which extended slightly below the bottom plane of the boxy thing, all the way around. Its overall height was about 20 ft. from top to bottom.",
      "link": "http://www.nuforc.org/webreports/061/S61689.html",
      "state": "GA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d97",
      "summary": "Around midnight, two witnesses observed a bright light in the sky that, upon observation, appeared to be a large and wingless aircraft.",
      "city": "atlanta",
      "shape": "cigar",
      "date": "2008-06-12T00:00:00",
      "story": "Around midnight, two witnesses observed a bright light in the sky that, upon observation, appeared to be a large and wingless aircraft. Driving down Houston Mill Rd (near Emory University/Emory Village) around midnight, perhaps a little before, my friend nd I saw an intensely bright light in the sky directly ahead of us.  We assumed it must be a low-flying plane, but it was extremely bright and as we speculated on what it could be (I suggested a helicopter searchlight--it was that bright) we drove under it.   Again, at first we thought it was a plane, but then we realized it had no wings and was simply a dark, oblong shape in the sky (could not tell if it was moving or not) with five green and red lights around the edges and a bright light in the front, or what I assumed to be the front.  We kept driving and soon could not see it.",
      "link": "http://www.nuforc.org/webreports/063/S63767.html",
      "state": "GA",
      "duration": "<1m"
    },
    {
      "_id": "64d005f478aba2ec5a3b6dd3",
      "summary": "UFO over ATLANTA appears near downtown",
      "city": "atlanta",
      "shape": "circle",
      "date": "2007-06-12T00:00:00",
      "story": "UFO over ATLANTA appears near downtown This object was round and small and looked as if it were changing colors or flashing and moving slightly faster and stabler than a helicopter, it was lower and slower than a plane should have been flying in that area and moving away from downtown in a southwesterly direction over the area of town known as \"Vine City\" and over and past the A.U. (college) center of Atlanta.  The early morning sky was clear blue as I viewed this object while sitting in my parked car behind the Georgia World Congress Center facing west.  After flying into the distance and getting smaller, it seemed to just disappear.",
      "link": "http://www.nuforc.org/webreports/056/S56821.html",
      "state": "GA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b708e",
      "summary": "Bright Red Pinpoint Of Light Traveling Across Sky",
      "city": "atlanta",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Bright Red Pinpoint Of Light Traveling Across Sky I just had twins and I no longer smoke in the house and late last night while smoking and  sitting in a zero gravity recliner looking straight up I saw a pinpoint of red light moving slowly across the sky. It was very bizarre looking; A tiny, tiny speck of brilliant red light traveling across the sky. Is it possible this was a satellite? The intensity of the light was incredible but the object was definitely in space, well above our atmosphere, I am assuming because of its size (it was as small as a pinpoint at arms length) and the time it took to cross the sky (I can only view about 40 degrees of the horizon in my backyard due to the trees and roof of my house) .",
      "link": "http://www.nuforc.org/webreports/057/S57692.html",
      "state": "GA",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7304",
      "summary": "Lights in a straight line that go out from left to right in the night sky",
      "city": "atlanta",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Lights in a straight line that go out from left to right in the night sky I don’t necessarily believe in flying saucers, but I do think that there are unidentified flying objects.  I would just like to know if anyone else saw what I saw.  I would also like to see if there is a logical explanation.  On May 17, at approximately 10:30 p.m. Out of the corner of my eye I saw 2 or 3 red/orange colored lights in a row, horizontally in the sky.  When I actually looked directly at the lights I saw two.  They appeared to be slightly larger than Venus.  The approximate distance between them would be about an inch if you measured at an arms length.  The one on the left faded out(it looked like it just slowly went out), then the one on the right.  They were in the western sky approximately to the 5 o’clock of Venus(I'm guessing it was Venus), about halfway between the horizon and Venus.  The entire “sighting” took approximately 5 seconds.  I didn’t hear anything out of the ordinary at the time.  I continued to watch the same area of the sky for a few minutes but didn’t see anything else.  There are no towers in that direction that I could have mistaken for the lights.  I was located approximately 1 mile east of Atlanta, Indiana.  Weather  according to weather.com: \tClear \t48 deg. F \tVisibility 10 mile",
      "link": "http://www.nuforc.org/webreports/056/S56718.html",
      "state": "IN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a8b",
      "summary": "Fixed bright white dot seen near Atlanta Airport, Feb 28 from aircraft.",
      "city": "atlanta",
      "shape": "fireball",
      "date": "2007-03-08T00:00:00",
      "story": "Fixed bright white dot seen near Atlanta Airport, Feb 28 from aircraft. I had a window seat on a small 50 person passenger plane.  We were making our approach to Atlanta Airport, but still about 75 miles out.  I saw a bright dot outside the window that I took for Venus because it was sort of scintillating.  Despite the fact there was complete cloud cover that night, I still thought it was Venus somehow breaking through.  It was too bright to be another aircraft, unless it was pointing a landing light right at us.  But it couldn't be Venus, because we were moving in relation to it.   I watched for 15 minutes, on and off again, as we \"passed\" it.  It must have been as far as 50 miles away, so it took time, but it wasn't fixed like Venus would have been.  And, it didn't move at all, like another aircraft would have. 20 minutes in, we were coming in for a landing and I could still make it in the distance.  Even at that distance it was brighter than all the other incoming planes.  It was mostly a bright white dot, but I could make out shades of red and yellow that occasionally shifted.  Waaaaaaay too high up to be a radio tower of any sort.  I had a camera, but thought \"what's the point?\"  It would just be a dot. P ease contact me if there were other reports or if there is a logical explanation.",
      "link": "http://www.nuforc.org/webreports/055/S55580.html",
      "state": "GA",
      "duration": "40 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b2c",
      "summary": "My girlfriend and I rode bikes down to the local elementary school for just a spot to sit and chill. While sitting on the swings i noti",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2006-07-16T00:00:00",
      "story": "My girlfriend and I rode bikes down to the local elementary school for just a spot to sit and chill. While sitting on the swings i noticed a large Red/White/Blue light pulsating about 25 miles away in the sky. I figured it just to be a plane, and i asked my girlfriend, ((name deleted)), what she thought it was and she figured it was the light pole on top of Stone Mountain. The object's lights where in a pattern just like this... Red  White  Blue. I still thought it was an airplane, until the lights all fused together making a brilliant shade of red and green. The object then began to move left to right in paterns that no modern day aircraft could handle. The object dissapeared behind trees, but reappeard seconds later much closer to us. The object seemed to be about 200 feet off ground about 200 yards away. As soon as it appeared it dissapeared behind the trees. When it reapeared it had to have been 60 yards away at about 150 feet off the ground. I was trying to capture this in Sarahs camera phone, it was moving slow, and made absolutely no noise at all. I could only see the two lights on either side of it. Then it vanished.  I could no see the object very well, but the light formation leads me to believe it looked something like this..  o<^>o  o = Lights V I have never seen anything like this, it was probably one of the most amazing events to ever happen in my life. WE managed to get a photo of the object on my girl's phone, but it is only a camera phone and does not offer very detailed quality.",
      "link": "http://www.nuforc.org/webreports/051/S51016.html",
      "state": "GA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e7e",
      "summary": "UFO fleet of 40 plus objects some connected by tethers float across Atlanta clear daylight skyline.",
      "city": "atlanta",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "UFO fleet of 40 plus objects some connected by tethers float across Atlanta clear daylight skyline. My wife, two guests from Denmark and me were sightseeing in downtown Atlanta.  This was a very bright, clear, deep blue, cloudless day in October a month after the WTC disaster.   We were all standing on a street corner right next to the downtown Atlanta post office and I looked up into the beautiful sky to take in all its glory and as I panned across the top of the Westin Peachtree Plaza hotel something caught my eye.  I saw what appeared to be a \"fleet\" of UFO's noiselessly drifting across the sky in a Northwest to Southeasterly direction.  It was an incredible sight to see at least forty or more objects floating at the same speed, silvery white in appearance contrasted against this crisp, beautiful deep blue fall day.   One of the most amazing views of what appeared to be inexplicable objects that I never would imagine I would see, ever.  There is one detail I have left out till now.   I would estimate that from these forty plus objects at least one third of them  there was a similar, silvery white “tether” or “cord” that connected between two of the spheres.  This was a very unusual sight.  From the distance I stood from these craft, estimated at approximately 5,000 feet, the “tether” appeared at arm’s length to be the size in diameter of thread used in sewing.  The objects themselves appeared to be the size of a very heavy “period” one would produce with a pencil on paper, held at arm’s length.  When I called attention of this remarkable sight to a local street vendor I was surprised at his reaction.  There was relatively none.  He could care less.  I thought this to be very odd behavior.  He looked up and as quickly as he looked up he went back to his business of selling handbags and sunglasses without uttering a single word.   Our friends from Denmark saw this and remarked that it looked like someone holding “parachute exercises”.  The parachutes of forty plus sky divers over Atlanta at 5,000 feet up, without a single hint of descendi! ng?   Highly unlikely!   This was a curiosity that has stayed wi! th me to -date and I just wanted to report it here and now.  I listen to you on the Jeff Rense show every single time you are on.  I didn’t want to be one of those 99% you talk about that does not report their sightings.  I always wanted to see the typical saucer shape craft with a dome on top.   Little did I think I would see an entire “fleet” of UFOs.   I’ll keep my eyes peeled over-head in hopes that I will someday catch a glimpse of my ideal saucer.  Until then, thank you for letting me share my experience of some 8 years ago.",
      "link": "http://www.nuforc.org/webreports/072/S72784.html",
      "state": "GA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7fc6",
      "summary": "Dancing lights (star-like) above atlanta, fast, erratic, playful, above clouds, 35 minutes",
      "city": "atlanta",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Dancing lights (star-like) above atlanta, fast, erratic, playful, above clouds, 35 minutes Ironically, after our media registration for Dragon*Con, I received a call from my intoxicated significant other, claiming there were lights \"not moving like planes! what ARE they?!?1\" etc etc... As a mechanical engineer, and a long-term skeptic, I promptly rushed to her aide, understanding that she was entranced by satellites or mesmerized by underlit bats. Much to my surprise, at my arrival at SunTrust plaza, located at Peachtree & Baker, I watched as what appeared to be stars swirled and danced, diving into one another, playing in my indigo southern sky. The lights that differed from stars only in their locomotion and lack of twinkling, were clearly above the cloud level, as they frequently would dim or disappear behind the occasional lazily passing cumulus. I can find no rational explanation for these playful sources of lumination.  From aircraft to projections, from critters to carefully-mounted LEDs, my scientific mind boggles at the concept.  They would rush from one end of the sky to the other in seconds, turn back, swirl curved paths, and even hover on the spot.",
      "link": "http://www.nuforc.org/webreports/072/S72059.html",
      "state": "GA",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b887c",
      "summary": "My wife and I noticed a bright light in the direction west of Atlanta tonight that became very bright and then dim and repeated the sam",
      "city": "atlanta",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "My wife and I noticed a bright light in the direction west of Atlanta tonight that became very bright and then dim and repeated the same pattern multiple times slowly over the duration of observation.  It moved slightly over the 20 minutes observed but not fast enough to be an aircarft.  The object was also far too high in elevation to be a helicopter.  It would be considered by anyone to obviously be brighter than any star or planet in the sky on even a clear night, but the clouds behind it tonight(and sometimes briefly masked by) proved it to be closer in.  The brightness and then dimming was also not the result of the clouds becasue it did this even when clear. We also caught several minutes of the light on video that reflected the pattern. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68067.html",
      "state": "GA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ac9",
      "summary": "Piedmont Park: Circular UFO with Blue Lights!",
      "city": "atlanta",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "Piedmont Park: Circular UFO with Blue Lights! We were on our way for dinner, and while on the 10th street near Piedmont Park my sister-in-law pointed out what we are quite sure was a UFO.  We could see it clearly through the left-back-seat-window, as it wasn't very high.  It was moving around quite fast, though smooth and steady enough for us to see that it was circular in shape, and had numerous blue lights on the bottom.  Furthermore it seemed to be of greyish/silverish color.  It was headed for the opposite direction, so we couldn't see it for long and make a video or even attempt to follow it. It is quite unbelievable to us that we may have seen a real UFO.  We have considered many \"normal\" explanations including: fancy spot lights, though if that were the case, we should have seen a beam of light under it, which we didn't; Likewise even a UFO remote control toy:  I have seen a remote control UFO toy, though I am sure it couldn't move around as fast, or over such a long distance in such straight strokes, besides be able to fly over buildings!  Plus it wouldn't be able to support the extra weight of the blue lights. We tried looking around on the net if anyone else had seen it, because there were many people in cars around, and some even on foot. Who knows maybe some security camera around there filmed it, hopefully!",
      "link": "http://www.nuforc.org/webreports/070/S70736.html",
      "state": "GA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c01",
      "summary": "We were on our way home from work in the middle of a mostly cloud free day loaded with great blue skies... we were on on Hwy. 285 going",
      "city": "atlanta",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "We were on our way home from work in the middle of a mostly cloud free day loaded with great blue skies... we were on on Hwy. 285 going south, near the ATL., GA. Airport...and I was in the passenger seat...I am a business owner and a very reliable person and know the differnce between planes and clouds, etc...I was just relaxing and looking up through the sunroof at the clear blue sky...(No clouds around) when I saw a large Defineately GOLD ROUND CIRCULAR DETAILED METAL OBJECT appear slowly from the highest part of the blue sky,it just appeared to be coming through the blue depths... way up ...must have been the size of 5-10+ planes in width, at that height...(It was motionless...stationary... and just appeared out of the clear blue sky?).... (There were No Clouds anywhere around it)I stared in amazement and did not attempt to distact the driver at that time...thinking maybe this is just something that is explainable...no camera...but...before I could get my! cell phone to take a picture... it seemed to slowly dissappear back where it came from ...with no movement ,except a little fog taking it back up ,into and above, the blue sky??? At first I thought maybe a satellite had come into orbit and then back out??? But this is not possible, and they are not gold and as detailed as I saw... after researching...this thing was big ,it was so detailed and defineatley a large metal object...I am dumbfounded and at the same time want to know what it was... I waited because I am just scared to tell people what I saw....",
      "link": "http://www.nuforc.org/webreports/074/S74296.html",
      "state": "GA",
      "duration": "1-2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b904a",
      "summary": "Rectangular Gray Object Seen over Atlanta GA",
      "city": "atlanta",
      "shape": "rectangle",
      "date": "2009-03-19T00:00:00",
      "story": "Rectangular Gray Object Seen over Atlanta GA I was exiting the Wachovia Bank at 2942 N Druid Hills Rd NE Atlanta, GA 30329, across from the Toco Hills Shopping Center at approximately 14:05, facing SW.  It was an overcast day, with intermittent showers.   As I was opening my umbrella, I noticed something in the air.  Looking carefully, I see a boxy, rectangular, dark gray shape tumbling through the air.  There was no sound coming from it, and it appeared to be a long way away.  It, for all intents and purposes, looked like a bag inflated with some lighter than air gas that had been released, and yet it did retain its shape rather well.  I reached for my digital camera in my pocket, and took three pictures (I will include these as attachments).  I also took a short video clip (about 1:01), but nothing was obvious when I watched it later.  Approximately 3-4 minutes after I first sighted the object, it disappeared into the cloud cover. I must say that I may not be the ideal witness for such an event.  I am a science fiction fan, as well as an amateur digital artist.  I have also been described as, \" slightly out of touch\" with reality.   However,  I do not make up stories like this.  I am not a glory hound, nor do I believe that aliens visit our planet.  Based on our present understanding of physical law, visiting even a relatively near star (like, say Alpha Centauri, 4.3 LY away) would be a tremendous undertaking.  So, my personal beliefs belie an extraterrestrial origin.  However, It was definitely something that was flying, and I have no idea what it really was, therefore it meets the requirement of being a UFO, in my book.",
      "link": "http://www.nuforc.org/webreports/068/S68421.html",
      "state": "GA",
      "duration": "approx 3-4 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b9203",
      "summary": "My daughter and I went out to look at the lunar eclipse that was to take place at 11:00pm.  We were looking in the sky for the moon and",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "My daughter and I went out to look at the lunar eclipse that was to take place at 11:00pm.  We were looking in the sky for the moon and couldn't find it.  We were watching a low flying, large airplane that was flying overhead which is unusual for this area.  My daughter looked down to talk to me and at that time I saw 2 triangles sort of adjoining or maybe it moved so fast it just looked like two.  It just suddenly appeared (maybe it was behind a cloud?) and before I could tell my daughter to look into the sky, it sped off at a right, upward angle into the night.  As far as the size, it is hard to describe because of how high it was, but compared to the airplane it was about 1/4 to 1/2 the size of the low flying ,large airplane that had already passed us.  It did not look like it was following it - but who knows it disappeared rather quickly.  I could see a trail of light as I watched it, but it didn't leave a trail in the sky.  I am truly amazed and blown away because I have always wanted to see something like this.",
      "link": "http://www.nuforc.org/webreports/065/S65846.html",
      "state": "GA",
      "duration": "3 SECS"
    },
    {
      "_id": "64d005f478aba2ec5a3b920f",
      "summary": "Object descends then ascends at breakneck speed, recorded from an aircraft.",
      "city": "atlanta",
      "shape": "circle",
      "date": "2009-08-27T00:00:00",
      "story": "Object descends then ascends at breakneck speed, recorded from an aircraft. Hello,  Please take a look at this video at the 3:05 mark. You can clearly see an object descend, then shoot back up at breakneack speed. This was recorded on a flight from Tampa, Fl to Atlanta, Ga. This is not my vid, I was merely looking at airplane videos and stumbled across this.  http://www.flightlevel350.com/Aircraft_Lockheed_L-1011_Tristar-Airline_Delta_Air_Lines_Aviation_Video-6141.html  wow! ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71700.html",
      "state": "GA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b93c4",
      "summary": "I spotted what looked like three UFOs blinking orange and white, which made strange patterns across the sky before vanishing at once.",
      "city": "atlanta",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "I spotted what looked like three UFOs blinking orange and white, which made strange patterns across the sky before vanishing at once. November 12, 2009  My dad and I were driving in Atlanta, GA (Dunwoody to be exact) when I spotted something blinking orange and white in the sky. I knew it couldnt be a plane because several planes flew by and looked much different and closer to earth. The blinking object was making strange patterns across the sky, before zooming away super fast and was gone altogether. Nearby we thought we may have sighted two fainter blinking objects as well. They all seemed to vanish at the same time.",
      "link": "http://www.nuforc.org/webreports/073/S73277.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b948a",
      "summary": "glowing red spaceship flys at car",
      "city": "atlanta",
      "shape": "fireball",
      "date": "2010-02-14T00:00:00",
      "story": "glowing red spaceship flys at car  500 Lights On Object0: Yes It began with a flash of bright light in the sky. at first i thought a plane had malfunctioned, caught on fire and was falling out of the sky. But it started to curved towards our car. At this point, as if by magic, our car had shut off, including any lights that were in the car.  Also, our friend in the backseat was thrashing around and mumbling some wierd language. If the ship had not have come so close to our car, i would have passed it off as a government test or somthing like that.  But then the ship started to gradually speed up and change it course so that it was aimed directly at us.  Our friend in the backseat was thrashing so violently now, the car felt as if an earthquake was centerd directly next to us. Suddenly, right when the ship was about to hit us, everything went white. I couldn't feel or hear anything besides a high pitched ringing in both my ears. It was like i was dead for 10 seconds. I can honestly say it was the scariest moment in my enti! re life. When we all came back to our senses, the entire car was extremely hot to the touch. The ship was gone but I can still remember the glowing red surface of the ship though. If you're wondering, the friend in the back was there, sitting straight up. He still isn't the same person he used to be. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74270.html",
      "state": "GA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b954f",
      "summary": "UFO over  drive-in theatre.",
      "city": "atlanta",
      "shape": "changing",
      "date": "",
      "story": "UFO over  drive-in theatre. This is a very old case that has had me wondering all these years what this thing was.  I was only 10 years old at the time, and my Father, Mother, aunt and uncle and cousin went to an old drive-in movie theatre just outside of Atlanta.  This drive-in had bleachers at it similar to what you would see on a small sports field. My cousin and i were watching the movie from the bleachers while our parents were still in my uncle's car when a boy on the top row of the bleachers yelled out, '' look, there goes a flying saucer!'' we all looked in the direction he was looking in and there was this brightly lit white object that looked like the lid to a round candy dish with a dome like thing on top. This thing was moving very rapidly just above the tree line and disappeared below the horizon. I didn't think about it after it disappeared and turned around and turned my attention to the movie again until the same kid that first saw it yelled, '' here it comes again!!! but this time this thing was coming directly toward us!  Every child on those bleachers including me and my cousin ran for cover.  We searched frantically for our parents but could not find the car as it was quite dark, so we ran into the building that housed the projector booth and the snack bar.  I told my cousin to look out and see if it was gone, and he said he didn't see it, so we stepped back outside and to our horror, this thing was directly overhead!   We ran again trying to find our parents in the car, and to my great relief i heard my Mom yelling, '' we are over here!'' and we ran to the safety of our parents and the car. This thing looked quite different from the way it did the first time we saw it. It had slowly rotating white lights on it like rectangles stood on end.  Nothing else could be seen but the lights in that circular pattern.  It was about 1,000 ft. AGL and looked to be about 30 ft. in diameter. This thing was dark in the center.  It moved slowly and came from the northwest and moved on toward a southeasterly direction until it disappeared behind some trees in the distance.   My Father was in the U.S. Air Force for 6 years and i asked him what that thing was, his reply, '' I don't have the faintest idea.''   I was horrified by this incident. I have never seen another UFO. I would very much like to know if anyone else has saw a UFO that looked like what we saw that night back in June 1964.  As frightning as this was, i would love to see that thing again now that i am a trained observer. If anyone could let me know what this thing was, i would sincerely appreciate it. My witness count is just an estimate, it is possible that over 50 people could have seen this UFO. ((NUFORC Note:  Date may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69893.html",
      "state": "GA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b95ba",
      "summary": "I was driving home Feb 12th 2009 at around 14:35 (2:35PM) EST. While North on I-85 I noticed a craft in the sky. The best way that I ca",
      "city": "atlanta",
      "shape": "disk",
      "date": "2009-03-19T00:00:00",
      "story": "I was driving home Feb 12th 2009 at around 14:35 (2:35PM) EST. While North on I-85 I noticed a craft in the sky. The best way that I can describe the craft is…if you hold out a coke bottle at arms length…that’s about the size it was. It was gray in color and did not move. I went to grab my phone to snap a picture of the craft. When I got my phone and looked back up it was still there. I drove under a sign that hangs over the interstate, once past this sign the object was gone. Never did see it again. The weather was perfect. No clouds in the sky, bright sunny day. Air temp around 60 degrees.",
      "link": "http://www.nuforc.org/webreports/068/S68717.html",
      "state": "GA",
      "duration": "1 minute or less"
    },
    {
      "_id": "64d005f478aba2ec5a3b97ce",
      "summary": "Ring of lights floating over Midtown, Atlanta",
      "city": "atlanta",
      "shape": "sphere",
      "date": "2009-08-27T00:00:00",
      "story": "Ring of lights floating over Midtown, Atlanta While out having dinner, seated on the patio of a local restaurant, I saw an object shaped like a circle with a ring of circular lights underneath floating above the tree line. I asked my friend to look, and he too saw the object in the distance. I looked like the object would have be directly above 5th street near Piedmont Ave, but from our view was still close enough that we were able to clearly make out the shape, individual lights underneath, and the color of the lights was white with a slight bluish hint. It moved in a fluttering pattern like a feather would if you drop it. We watched for a couple seconds until it eventually drifted out of view behind some trees. Other people would have had to have seen this object as it was just a little after 9 PM on a Saturday in central Atlanta. Tons of people were out and about.",
      "link": "http://www.nuforc.org/webreports/071/S71570.html",
      "state": "GA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b978a",
      "summary": "White spherical orb seen from airliner.",
      "city": "atlanta",
      "shape": "sphere",
      "date": "2010-06-23T00:00:00",
      "story": "White spherical orb seen from airliner. I was sitting on a commercial jet flight in a window seat located just ahead of the wing on the left side.  I was gazing out the window when a white object caught my eye.  It was traveling in the opposite direction and about three times as fast.  I lost sight of it under the wing and then spotted the object again as it came back out from behind the view of the wing.  Just then it made a large, graceful, consistent right hand arc and sped away.  I watched it for e few seconds until it disappeared into the horizon. I would describe it as a perfectly round, bright white, featureless \"ball\" about the size of a large washing machine.  It zipped by under the left wing about 400 ft. down and was traveling very fast (several hundred or maybe a thousand mph?)   As it arced a turn to the right it didn't deviate in altitude or in speed whatsoever, it just changed direction.  I was struck by how fast and how smoothly it moved through the air.  It looked like it was riding through the air on invisible rails or something.... Just REALLY fast and REALLY smooth... Not jerky or wobbly at all. ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75779.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fe7",
      "summary": "A big ring-like object with bright lights in Atlanta",
      "city": "atlanta",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "A big ring-like object with bright lights in Atlanta I saw a big circular ring with lights floating in the sky. It moved smoothly in all directions and then just went away. This was in the Midtown Atlanta area between Atlantic station and Peachtree St NW. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74290.html",
      "state": "GA",
      "duration": "2 to 3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba137",
      "summary": "Witnessed bright stationary object on the edge of a cloud suddenly dim and finally move upon chopper and two jets presense.",
      "city": "atlanta",
      "shape": "circle",
      "date": "2008-08-12T00:00:00",
      "story": "Witnessed bright stationary object on the edge of a cloud suddenly dim and finally move upon chopper and two jets presense. My father and I spotted a stationary object about 20 - 30 degrees off the horizon just above and to the right of Dobbins Air Force Base. This round object was very bright and appeared to be sitting on the edge or lip of a cloud. After a few minutes of video taping this sighting, a helicopter comes into view and upon doing so, the object dimmed it's lights but was still visible. A couple seconds after the helicopter presense, my battery on the camcorder went dead! My father ran in to get another camera as I stayed and watched the object. I then saw what appeared to be two very fast aircrafts come flying out of the A.F.B. up into the sky. A minute or so afterward, the bright object begings to move toward my right (north) about 20 degrees and then toward me (eastwardly). The object then moved right again and out of my view (behind a building). This was the last I saw of this u.f.o. The two aircrafts I saw scramble a few moments earlier then flew back into the Dobbins A.F.B. airspace and looked to be coming in for a landing. Around 10 or 15 minutes after this event, there were a lot of airtraffic in the Dobbin's vicinity which is highly unusual. I videotaped afterward, another helicopter flying around and two big aircrafts (looked to be military ) fly out of Dobbins. I recorded these events on a VHS camcorder and I will convert to digital format and send in.",
      "link": "http://www.nuforc.org/webreports/064/S64759.html",
      "state": "GA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad94",
      "summary": "Disk shaped aircraft with bubble top illuminated from within, orange pulsing light on underneath, hovering south of I-75 near Atlanta",
      "city": "atlanta",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "Disk shaped aircraft with bubble top illuminated from within, orange pulsing light on underneath, hovering south of I-75 near Atlanta Friday evening at night fall I was driving north on I-75 (Atlanta, Georgia) but was still south of Atlanta Hartsfield International Airport.  To the west of I-75 I would say a couple of miles or so away – difficult to judge distance when the object is in the air – I saw a large illuminated craft hovering in the sky.  At first I thought I was seeing an airplane coming in for a landing; I was driving and trying to look at the same time.  It was evident that the object was NOT an airplane although it could have been the size of a small plane.  The object was disk shaped and looked to have a bubble top.  There was an orange colored light on the underneath side that pulsed maybe every 10-15 seconds.  I was intent on getting to my destination in Atlanta so I did not pull over or exit the Interstate to investigate – wish I had.  I look for a logical explanation – have never seen an object in the air that I could not identify and thought that this object should be a! blimp or an advertising attention getter.  I was told that there has been a blimp in that area for around a week, but I saw that blimp and it is the wrong shape, not illuminated from within, and the light it has is on top of the craft and pulsates more frequently – and the blimp is on the move, not hovering.  I never saw this other aircraft move.  I was only able to observe it for probably 2 – 3 minutes as I was driving, but it was unusual to the extent that I thought I should report it.",
      "link": "http://www.nuforc.org/webreports/078/S78638.html",
      "state": "GA",
      "duration": "continuing"
    },
    {
      "_id": "64d005f478aba2ec5a3bafbd",
      "summary": "Cigar shaped UFO with lights all around it stationary in the sky for 10 min, then moved and stationary for 10min, took off-gone in sec.",
      "city": "atlanta",
      "shape": "cigar",
      "date": "",
      "story": "Cigar shaped UFO with lights all around it stationary in the sky for 10 min, then moved and stationary for 10min, took off-gone in sec. My sister and I witnessed a cigar shaped UFO with lights all around the sides.  It was stationary in the sky for 10 min for we timed it.   It then moved in a straight line and stopped and stayed stationary again for another 10 min.  It then shot up into the sky so fast it was out of sight in a matter of minutes.",
      "link": "http://www.nuforc.org/webreports/080/S80518.html",
      "state": "GA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb239",
      "summary": "Two bright crafts hovering & moving together in clear mis day",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2011-03-23T00:00:00",
      "story": "Two bright crafts hovering & moving together in clear mis day I went to my local driving range because it was a fantastic spring like day. I popped the hatchback to sit and put on my golf shoes.  As I was putting them on my attention was drawn to the really large American Flag almost directly above me.  I could see a normal chem. Trail going right behind it and thought it was cool looking.  This is why I was looking up. I have (knock on wood) great vision. 20/20 – And I saw two objects in the sky near another jet (not the same one that had the chem.  Trail behind the flag but a similar jet that I see in Atlanta all the time).  These crafts seemed very silver – at times the sun reflected off them – and slowly.  They seemed small, but far and very silver.  I knew right away that they were not normal crafts that I see in the air.  They were very very high in the sky.  They hovered like helicopters but didn’t look or move (left, right, up, down) like a helicopter would.  The other point I really want to underscore is they moved tog! ether.  They seemed to keep the same distance from each other and traveled in the same direction – but that direction was not just east or west – more like zig-zag –quite slowly.  I never saw anytime of spinning or jets – they were real still. I watched them as far as I could as they got smaller.  It was something I will remember forever.  It was such a clear day and such a clear image to remember. And so unlike anything I have ever seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80476.html",
      "state": "GA",
      "duration": "4:00 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4f5",
      "summary": "Large bright white light shot across sky going SSE towards Atlanta",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2010-08-24T00:00:00",
      "story": "Large bright white light shot across sky going SSE towards Atlanta I was driving south on GA 400 when a large bright white light shot across the sky going in a SSE direction ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We are in the midst of a meteor shower, on this date.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77063.html",
      "state": "GA",
      "duration": "5 secs."
    },
    {
      "_id": "64d005f478aba2ec5a3bb5d4",
      "summary": "Large, firey oval object over Atlanta, GA",
      "city": "atlanta",
      "shape": "oval",
      "date": "2011-01-05T00:00:00",
      "story": "Large, firey oval object over Atlanta, GA Large firey oval object, hanging or gently decending in the sky observed over downtown Atlanta, observed from northeast of the city looking SSW at approximately 5:30 PM on December 30, 2010.",
      "link": "http://www.nuforc.org/webreports/079/S79424.html",
      "state": "GA",
      "duration": "maybe minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb7ed",
      "summary": "Orange colored beings thats possibley from another planet",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2010-07-28T00:00:00",
      "story": "Orange colored beings thats possibley from another planet what i remember is around 1984 when i was in (Sally K) pre-k we where on our way on a field trip. There was maybe about 10 of us on the van with 2 adults.   Into our long road trip when i noticed that we made a wrong turn down this rocky area i saw big spins of electrical wire, big rocks and a small like maybe a security both.  The driver of the van all of a sudden paniced and spinned the van around in a great speed. As i looked out the window of the van i saw 2 but maybe could have been more.  i cant remember if they where short or tall but they where orange colored people dressed in all white suits.  Their heads where big, and it was plain as day that they where not from this planet.   This memory pushes my intrest in the UFO phenomenon and i would really want to know what it was i saw",
      "link": "http://www.nuforc.org/webreports/076/S76812.html",
      "state": "GA",
      "duration": "aliens"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8d3",
      "summary": "Irregular triangle cluster of 3 very bright white lights low to the west 6:35 a.m. - Southside Atlanta.",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2011-08-21T00:00:00",
      "story": "Irregular triangle cluster of 3 very bright white lights low to the west 6:35 a.m. - Southside Atlanta. On my way to work this morning, noticed very bright white lights fairly low to the west.   As I was driving along (north on Stanton Rd.), trees and buildings would block my view, got to a spot where I could clearly view it and stopped in the road to see if it was moving.  It was hovering but appeared to drift a bit to the south.  No sound was heard, too bright to be an airplane or helicopter, 3 bright white lights in irregular triangle formation.   A vehicle approached from my rear and I had to proceed as it is fairly narrow road and there was nowhere to pull over.  My first thought was \"ISS\" and then \"blimp\" but no structure could be discerned.  Sky was still mostly dark - I cannot begin to say what it was.   As I pulled onto the entrance ramp for Langford Frwy (166), I glanced back and saw 3 dim white lights moving at speed overhead to the east - I can only assume it was the same object as I had not noticed any other air traffic in the area.    Object  initially was approx. 35 degrees above horizon, maybe half mile away, maybe 1500 feet altitude or more.  Lights werre not spaced uniformly.  Diddn't appear to be any more than 10 feet across, if that much.   It is difficult to give good measurements as sky was dark and lights were very bright and in a triangular cluster rather than spread out as along a wing.  I have reported this also to MUFON.   I contacted Fulton County Airport (Brown Field) to see if they had a  blimp launch from there this morning (object was to their southeast).  Airport Mgr. replied my e-mail -  he has forwarded my info to the ATC tower and will let me know if they have any info.",
      "link": "http://www.nuforc.org/webreports/083/S83090.html",
      "state": "GA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9d3",
      "summary": "Triangular light followed by red ball of light seen in Atlanta, Georgia",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2011-08-07T00:00:00",
      "story": "Triangular light followed by red ball of light seen in Atlanta, Georgia My friend and I were sitting outside stargazing when something captured our eyes.  We had already been outside for about 15 minutes when we saw a bright light coming towards us across the sky from a distance.  It was traveling much faster than any man made aircraft or jet plane would travel at. At first we had not a clue of what it could be but at this point we knew for sure it was not an airplane or human made aircraft of any kind.   As this object passed right above us it slowed down at a very speedy rate.  The object first turned out as a large orange ball of light going at a tremendous speed, but as it got closer it appeared to have the shape of a triangle.   We could see a large orange triangle shaped light in the center. We could also see that there were 3 blue lights moving in a circular motion around this bright Orange triangle light.  We felt almost as if something in this craft were watching us back. This object was the brightest flying object we had ever seen in the sky in our life.  The object hovered for about another minute or so and disappeared within the blink of an eye.  Not even 30 seconds after this craft disappeared an enormous solid red ball of light passed by in the same path as the other UFO we had just believed to witness.  These objects were completely silent as well and flew about 500 feet above us.   My friend and I remain baffled.",
      "link": "http://www.nuforc.org/webreports/082/S82801.html",
      "state": "GA",
      "duration": "4 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bca93",
      "summary": "Green light crashes to earth near atlanta",
      "city": "atlanta",
      "shape": "light",
      "date": "2011-08-07T00:00:00",
      "story": "green light crashes to earth near atlanta We are traveling east. Bound on I20 and a HUGE green light fell from the sky out of nowhere.  It had a white tail.  And turned blue with white tail.  It was so bright and fast. It was amazing.  We where entering the city limits near i believe six flags.",
      "link": "http://www.nuforc.org/webreports/082/S82865.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdbca",
      "summary": "Verified oddity",
      "city": "atlanta",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Verified Oddity I am a UFO enthusiast. So, I spend a lot of time star gazing. I've never before seen anything out of the ordinary. But the other night, while driving, something caught my eye. A stationary blinking light that appeared to just hover and blink. The road I was driving is quite curvy, so I slowed, and watched for about four seconds.  The blink then reappeared very far away toward the east, then once again, then I never saw another blink.  I did not mention this to anyone, my friends already ridicule my UFO enthusiasm enough.  But walking with a close friend, who absolutely does not believe in UFO's, she reported seeing something &quot;weird&quot; in the sky around the same night of my encounter.  She proceeded to describe the exact same event.  I found out she, though in a different car, was on a nearby road, driving the same direction, at the same time.  She described all of this to me BEFORE I told her of my encounter.  Her description matched all of my details, incl! uding a stationary blinking white light, two blinks toward the east, then no more.  She, however, was not driving and had more time to really observe this object.  I find it most unusual she told me this, since she cringes every time I try to show her anything on UFOs. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93744.html",
      "state": "GA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bde75",
      "summary": "They all had blinking lights and were round in shape via the orientation of the bright orange lights when I took photos.",
      "city": "atlanta",
      "shape": "oval",
      "date": "2012-10-30T00:00:00",
      "story": "I saw several craft emerging in ones and twos, all from an area south of me and going in the west direction, passing the city skyline.   They all had blinking lights and were round in shape via the orientation of the bright orange lights when I took photos.  Some were appearing to be large upon entry from the south but then the got smaller in diameter when passing the city skyline.   Some of the craft doubled back towards the direction that they initially came from and some just hovered in certain spots.",
      "link": "http://www.nuforc.org/webreports/093/S93766.html",
      "state": "GA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be395",
      "summary": "I was on Delta flight 1307 from Richmond to Atlanta.  I was sitting on the left side of the plane in a window seat.",
      "city": "atlanta",
      "shape": "other",
      "date": "2012-09-24T00:00:00",
      "story": "I was on Delta flight 1307 from Richmond to Atlanta.  I was sitting on the left side of the plane in a window seat.  About seven minutes prior to landing I saw an object outside the plane.  It was moving at a good speed and passed under the wing.  It seemed close to the airplane but not close enough to hit the plane.   It had a circular, aqua colored top that appeared hard and a light, silver colored, narrow cylinder coming out of the bottom of it.  In terms of size it was not larger than the wing of the plane.  I’ve Googled weather balloons and it was definitely not a balloon.   I told the people beside me I saw something weird and they started joking around and making reference to the X-Files show.  I laughed out of nervousness.   I reluctantly asked the guy behind me when we landed if he happened to see anything odd from the plane and he said he said he saw it as well and that it freaked him out and that he was just going to pretend he didn’t see it.  He said he was ex military and it was definitely not a stealth probe.   He agreed to go to the pilot afterwards with me.  We told the pilot and the flight attendant at the front of the plane what we saw.  The pilot said it was probably a balloon (which it was not) or a tower on the ground (which it was not) and that they would \"check it out.\"   The other witness and I were surprised that they didn’t ask for our names or info.   Let me state that I have never believed in UFOs, etc. prior to this.  I don’t know if this is something being tested by our government or another country or if it was really other-worldly.  I can only describe what I saw. ((NUFORC Note:  We spoke via telephone with this witness, and she seemed to us to be exceptionally eloquent, and objective in her description of the sighting.  We suspect that she is a highly reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93024.html",
      "state": "GA",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be5b0",
      "summary": "Can be seen on Google maps at this location:  XXXX Kings Gap Rd Hamilton GA 31811-4702 United States",
      "city": "atlanta",
      "shape": "oval",
      "date": "2012-06-14T00:00:00",
      "story": "Can be seen on Google maps at this location:XXXX Kings Gap Rd Hamilton GA 31811-XXXX United States While searching an address on Google maps I saw an object above the trees at this location: XXXX Kings Gap Rd Hamilton GA 31811-XXXX United States. don't know if it's been reported before but it's there for everyone to see.  just put the address in Google maps and pan around the sky",
      "link": "http://www.nuforc.org/webreports/089/S89504.html",
      "state": "GA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be559",
      "summary": "Whirl driving home from work headed west on I-20. I saw a star like object in the sky. I have seen this object almost everyday for the",
      "city": "atlanta",
      "shape": "light",
      "date": "2012-06-14T00:00:00",
      "story": "Whirl driving home from work headed west on I-20. I saw a star like object in the sky.  I have seen this object almost everyday for the past 3 months going to work or coming from work.  I usually spot the object headed East or West on I-20 headed to Atlanta or headed towards Alabama.  My sightings are always during the day when the sky is clear. The object usually appear for several minutes and its always appear to be stationary and than it just vanishes.  When it vanishes their are no clouds in the sky. I have also seen white streaks in the sky that resemble jet fume, but I never see the actual jets that  could create the streaks.  The streaks are usually short and spaced far apart high in the sky.  It also seems that they are outside of a planes altitude. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89457.html",
      "state": "GA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be6b7",
      "summary": "Bright multy colored object..going in a zigzag motion,spinning around changing colors.  ((NUFORC Note:  Twinkling star??  PD))",
      "city": "atlanta",
      "shape": "light",
      "date": "2012-04-18T00:00:00",
      "story": "there was a bright multy colored object..going in a zigzag motion,spinning around changing colors..from blue green and yellow..object appeared to be moving away..and splinting into 3 little lights and then going back to one.. ((NUFORC Note:  Possible sighting of a \"twinkling\" star, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87734.html",
      "state": "GA",
      "duration": "hour"
    },
    {
      "_id": "64d005f478aba2ec5a3be883",
      "summary": "Space shuttle with chemi-trail head upwards",
      "city": "atlanta",
      "shape": "cylinder",
      "date": "2012-05-13T00:00:00",
      "story": "Space shuttle with chemi-trail head upwards Was driving I-85 south by 14th street. Looking west it look a single splotch of isolated chemi-trail. Looking closely it looked kind of like a conventional NASA style space craft traveling up wards. But the  trail only went so long and never longer. I think there were four boosters.I even have a crappy picture of it. It appeared to just sit still in the sky which makes Me think it was real far away.maybe it was a satellite or something.",
      "link": "http://www.nuforc.org/webreports/088/S88874.html",
      "state": "GA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb06",
      "summary": "Bright object in sky",
      "city": "atlanta",
      "shape": "light",
      "date": "2012-02-10T00:00:00",
      "story": "Bright object in sky So during the super bowl on Sunday I stepped outside to smoke a cigarette and looked up at the sky as I usually do and saw the brightest what I thought to be a star.  So I called my mom outside to see it. Well upon further observation I realized that it was not a star because it was a lot lower than any of the other stars. In fact, it was in the air space as many planes flew by it and it, I live in Southwest Atlanta off of Sylvan Rd.  The object was moving at a slow pace and the thought of it being a plane was quickly dismissed because the light did not match the direction in which it was headed and there were no additional lights.  The object was in my view for a good 45 minutes to an hour before it was no longer visible.  I do have a video recording and picture that I will send as soon as I find out how to upload it from the camera to the computer. On Monday 2/6/12, I saw the same object again also during the eight o’clock hour.  I again called my mom to verify that she saw it and then called my aunt who lives a few blocks away, to look outside and see if it was visible to her.  She didn’t see it so I went to get her so she could have a look and give me her thoughts of what it could be.  She saw it and we presumed to follow it to try and get a closer look, but we were unable to keep visual contact due to the object moving and trees blocking the view.  We did spot it again hit and miss with a clear view when we got to Cascade Rd. The only reason I am reporting it is because we could not come to a consensus of what it could be and thought maybe someone else will help us figure it out.",
      "link": "http://www.nuforc.org/webreports/087/S87079.html",
      "state": "GA",
      "duration": "about an hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bf72f",
      "summary": "Green  fireballs 2 different sightings over Atlanta.",
      "city": "atlanta",
      "shape": "fireball",
      "date": "2013-09-09T00:00:00",
      "story": "Green  fireballs 2 different sightings over Atlanta saw this same greenish fireball with a long white tail 5 months before this sighting near 285-S/20-E (15 mile distance from my first sighting.  I've noticed I am always alone when seeing this, bit I inform my mate and he says I am delusional.  I wish like I didn't have to try to prove I'm not crazy.  Reading everyone else's reports has comforted me and literally has me frightened...... I had a nervous breakdown now having knowledge of what it was that I saw. ((NUFORC Note:  For some reason, witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101971.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfab7",
      "summary": "Cylinder object seen near Downtown Atlanta.",
      "city": "atlanta",
      "shape": "cylinder",
      "date": "2013-07-03T00:00:00",
      "story": "Cylinder object seen near Downtown Atlanta My girlfriend and I were heading home when she noticed a strange object in the sky. She told me that the object wasn’t like an airplane, since we live near Hartfield International Airport.  I looked for a place to pull over to get a better look.   As we came to the top of the street near an open field, I exited the car to look for the object.  Between two trees, slightly below the treeline, facing East, I saw a white/silverfish cylinder shaped craft/object hovering in the air.  It looked to be metallic because of the way the sun reflected the light.   From the distance I observed it at, it had to be nearly ½ mile long.  It hovered without a sound for a few seconds, shifted to the right slightly, shifted to the left then shot out of sight to the left (towards the South).   I just stood there amazed.   The object was gone before I had a chance to get my camera up.",
      "link": "http://www.nuforc.org/webreports/098/S98950.html",
      "state": "GA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfaf6",
      "summary": "Two red and two green lights came across the top of our car at a fast rate of speed.",
      "city": "atlanta",
      "shape": "light",
      "date": "2013-09-30T00:00:00",
      "story": "Two red and two green lights came across the top of our car at a fast rate of speed. Stopped at a red light at the intersection of North Druid Hills and Buford Hwy two side-by-side green lights and directly behind them two side-by-side red lights came quickly toward and across the top of our car.   At first, it looked like a distant plane, but the speed, size and close location to our car spoke differently.  My husband didn't see it on the driver's side, but others my have seen it at the intersection.   Immediately, I started having electrical nerve pain in my right elbow down to my hand for a couple of days after.  It was a feeling of banging my funny bone.  May not be related, but I didn't hit my elbow and it happened immediately after it went across the top of our car.",
      "link": "http://www.nuforc.org/webreports/102/S102842.html",
      "state": "GA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c027e",
      "summary": "Very bright orange glowing object noted Atlanta, Georgia airport area.",
      "city": "atlanta",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "Very bright orange glowing object noted Atlanta, Georgia airport area. 5/30/13: While traveling through downtown Atlanta, Georgia on highway 75 at approx 9:15pm, one bright orange/red light noticed in northern sky traveling south.  Light appeared to pulsate regularly, to a brighter light.   Object was circular, with no sound noted, and was traveling separately from the many other aircraft coming into the airport area at that time.  Appeared to be lower than other planes in area, and not interfering with their flight paths.   Object appeared to ascend into sky, then disappeared.   One observer in car with previous AF history noted that the object was not a fixed wing, or rotary aircraft, saw an orange pulsating light at bottom of aircraft.  He stated that the aircraft itself as an opaque, translucent type material, with darker “lines” ,  egg-shaped, with bottom of “egg” cut off by orange light.    At least five planes noted in surrounding area sky appearing to be on approach to land at airport, but in holding pattern with landing li! ghts on to the north of city. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98284.html",
      "state": "GA",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c03dd",
      "summary": "5 lights moving southbound maybe over decatur, GA.",
      "city": "atlanta",
      "shape": "other",
      "date": "2013-02-18T00:00:00",
      "story": "5 lights moving southbound maybe over decatur ga, then all eventually stopping to hover.   Had to have been helicopters to hover but their lights were reddish and not standard white lites with red/green.",
      "link": "http://www.nuforc.org/webreports/096/S96199.html",
      "state": "GA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0504",
      "summary": "White ball of light seen by a truck driver off of I-20 west.",
      "city": "atlanta",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "white ball of light seen by a truck driver off of I-20 west I seen a ball of light moving from north to south. After watching it for about 10 sec. It shot out in front of it two more lights of similar dimensions.  The lights spread to a equal distance apart from each other. Then after 5 or 10 sec.  All three disappeared. All three lights was moving at about the speed of a small passager jet and the lights was not as bright as meter and was not losing attitude.",
      "link": "http://www.nuforc.org/webreports/096/S96074.html",
      "state": "GA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c05d7",
      "summary": "Light seen over Atlanta, GA 12/09/12.",
      "city": "atlanta",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "Light seen over Atlanta, GA, 12/09/12 I was standing in my back yard was looking 210 degrees.  4 hand width high off the horizon.  I saw a light moving way.  After a few seconds it appered to be moving not olny away but upwardly moving away.  Then was gone all together.   Weather condition tonight in Atlanta is overcast skys.  I had a clear look of the light and thoght it may be a star.",
      "link": "http://www.nuforc.org/webreports/095/S95103.html",
      "state": "GA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b6e",
      "summary": "Daytime UFO sighting, odd shaped and slow moving craft vanishes behind cloud.",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2014-02-07T00:00:00",
      "story": "Daytime UFO sighting, odd shaped and slow moving craft vanishes behind cloud. The UFO was slow moving and shaped like half a triangle It was metallic - very shiny.  It was directly above me so I watched it until it moved behind a cloud but it never came out the other side I waited sometime for it to cross the cloud but it didn't  (The cloud wasn't too big so it shouldn't have taken but maybe 5-10 seconds at the speed it was moving That's it - that's what I saw - it was an airplane or Any other typical air craft - I have never seen that Shape before or the slow moving of the craft Ill swear on a stack of Bibles that I witnessed this. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106829.html",
      "state": "GA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c113d",
      "summary": "Two Bright Metallic Objects.",
      "city": "atlanta",
      "shape": "cylinder",
      "date": "2014-01-24T00:00:00",
      "story": "Two Bright Metallic Objects Viewed from Brookhaven off Peachtree Street; very bright hovering silver-metallic cigar/cylinder shaped object; another similar object broke away; both objects started moving in opposite directions and suddenly vanished.",
      "link": "http://www.nuforc.org/webreports/106/S106500.html",
      "state": "GA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c16ed",
      "summary": "I saw a bright red light floating along like a helicopter, but I could not hear anything. The red light was all that was visible. Somet",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2014-06-04T00:00:00",
      "story": "I saw a bright red light floating along like a helicopter, but I could not hear anything.   The red light was all that was visible.  Sometimes there was an aura coming off.   It was flying south past Piedmont Park, then turned west.   Two more followed.   It is a clear night.",
      "link": "http://www.nuforc.org/webreports/109/S109542.html",
      "state": "GA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1739",
      "summary": "Triangle with green light over Atlanta, just north of downtown.",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2014-06-04T00:00:00",
      "story": "Triangle with green light over Atlanta, just north of downtown The object moved across the interstate highway as I was driving on a side road alongside the highway.  The object was triangular in shape.  My guess of its altitude is about 3000 feet.  When I lowered my window, I was unable to detect if it made any sound as the highway traffic was heavy.  Had it been an airplane, though, it was low enough that I would have heard its engines.  The light on the object was green, but it was solidly on--as opposed to an airplane light which blinks. Pulling my vehicle to the side of the road for a better view, in the moment it took me to open my door, the craft has disappeared.  I continued to look for it for several seconds, but did not see it again.",
      "link": "http://www.nuforc.org/webreports/109/S109816.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c18c8",
      "summary": "5 sphere objects in the sky no lights and moving to slow to be a plane.",
      "city": "atlanta",
      "shape": "sphere",
      "date": "2014-06-04T00:00:00",
      "story": "5 sphere objects in the sky no lights and moving to slow to be a plane. Went outside because we noticed a police drone hovering outside over midtown just off our balcony over peachtree street northeast and 11th st.  As we were on the balcony we noticed in the much further distance to the south/southeast very high in the sky 2 then 3 then 5 black sphere shaped objects moving way to slow to be planes.  They also had no lights or anything on them like we can see from the planes circling heading to and from the airport. They continued to move very slowly in the same direction.  Two we lost sight of then remaining three held a perfect triangle shape until a third seemed to disappear in a clear section of the sky and the last 2 moved behind a cloud and then were gone. Objects were to far in the distance to pick up on my camera.  Exact points in the sky can be referenced from buildings and towers in the same direction of the sighting",
      "link": "http://www.nuforc.org/webreports/109/S109478.html",
      "state": "GA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c19d9",
      "summary": "White strobe, single flash very fast, horizontal/vertical movement covering miles in 1 second.",
      "city": "atlanta",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "White strobe, single flash very fast, horizontal/vertical movement covering miles in 1 second. Observed May 20th, 2014 approximately 10:40pm  West of Atlanta IL. My daughter and I were sitting on the front porch when I observed a white bright strobe in the sky. The bright light only flashed one time similar to a camera flash. I saw a total of five flashes that placed the source literally miles away from each flash that was approximately one second apart from one another. The first flash appeared as if the source was 20 plus thousand feet in the sky and to my south west. The second flash was same approximately 20 plus thousand feet however to the north west of the sky, literally miles away from the first flash. The third flash was even higher than the first two, and was directly above where the second flash was located however thousands of feet higher as if it shot straight up. The fourth flash was directly beneath the third flash as if it had fallen straight down and appeared to be lower than all the other flashes. I could see that it literally shot back to the south with the last flash being literally miles away in one second. My daughter and I have no idea what we witnessed. I am 51 years old and skeptic to UFO’s, however I know what I saw.  There is no way that this was anything like we have on earth. This was not a jet, I see jets all of the time flying over….this was covering miles in one second bursts. There were no green or red lights. Strictly one white flash placing it miles apart from each flash.",
      "link": "http://www.nuforc.org/webreports/109/S109402.html",
      "state": "IL",
      "duration": "5 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ae4",
      "summary": "Blue/red point low in atlanta floating silently .. not aircraft 9:40 pm, July 4th.",
      "city": "atlanta",
      "shape": "light",
      "date": "2014-07-05T00:00:00",
      "story": "Blue/red point low in atlanta floating silently .. not aircraft 9:40 pm, July 4th. Floating low, purplish bright star, slowly moving left and right, then sinking behind tree when it became clear through leaves it had red and blue components.   I recorded on phone video.  Very strange total silence.",
      "link": "http://www.nuforc.org/webreports/110/S110918.html",
      "state": "GA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ea2",
      "summary": "Light in the sky close to North Druid Hills.",
      "city": "atlanta",
      "shape": "oval",
      "date": "2014-06-24T00:00:00",
      "story": "Light in the sky close to North Druid Hills. I was working my dog when I headed back home when I looked up in the sky and saw two lights following very close to each other.  When the lights passed me in the sky not more than 15 seconds later, two more lights followed right behind them and then two more lights a total of six lights.  If they were planes they were following very close to each other very close.  But I didn't hear any plane noises.  They were yellow and red in color.  I never saw anything like it these six oval shape lights were very close to each other ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110495.html",
      "state": "GA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2104",
      "summary": "((HOAX??))  green flash above tree line while on 285 between  memorial and I20exit.",
      "city": "atlanta",
      "shape": "unknown",
      "date": "",
      "story": "Green flash above tree line while on 285 between Memorial and I-20 exit I was driving 285 east bout midnight and a green flash appeared right above the treeline almost looked like a flare falling and then combusting and the green flash didn't light up everything around it like a fireworks.so what could this be?   And its so close to the city heck not to far from the airport. it was between memorial drive exit and I20 exit.   Anyone seen this green flash? ((NUFORC Note:  Date is flawed, and witness provides minimal contact information.  We wonder whether this is a serious report, or not.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108414.html",
      "state": "GA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c24a9",
      "summary": "Large stationary high altitude object above SW Atlanta Sky in broad daylight",
      "city": "atlanta",
      "shape": "sphere",
      "date": "2014-11-06T00:00:00",
      "story": "Large stationary high altitude object above SW Atlanta Sky in broad daylight Mid-afternoon, full daylight I spotted a spherical object in the SW sky. The object appeared to be much higher than aircraft presumed to be flying at approximately 30,000 ft cruising altitude. I would estimate about 50,000 ft and appeared to be larger than commercial aircraft. The object appeared to be stationary.  I site lined the object with the plumbing vents on the roof of my house for confirmation.  A neighbor was in the adjacent yard.  He also saw the object very clearly.  I also called a friend who is a Government Building Inspector.  He was able to pull into a parking lot and also saw the object. My girl friend arrived while the neighbor and I were viewing the object, and she also saw it.  We were amazed that it was stationary for over 45 minutes before the angle of the sun and cloud cover concealed it.",
      "link": "http://www.nuforc.org/webreports/114/S114459.html",
      "state": "GA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2579",
      "summary": "Lights are elaborate on craft.. reminiscent of a diamond flickering in the sunlight.. always near the airport",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2014-11-06T00:00:00",
      "story": "Lights are elaborate on craft.. reminiscent of a diamond flickering in the sunlight.. always near the airport Craft sits perfectly still and flashes multiple colors( like a diamond flickering in sunlight ) near the flight/landing track the planes take going into the airport..  I stay near the Falcons stadium.. the planes come in and make a huge U-Turn from heading eastbound toward the south.. at first I assumed that it was a a helicopter.. but i've seen helicopters leave from near Grady hospital and there is usually just one yellowish light that is on.  These lights on this craft flash in color from white, to red, to blue, to yellowish, to aqua..  i've seen this same craft a few times in the distance as the planes come in on their track toward the airport.. Hopefully i'm not misidentifying this this craft.. it could be a helicopter with an elaborate light fixture that monitors the planes landing and has lights to make sure its visible to all planes coming in?.. I will try to send a video next time I see this.. i've seen it a few times.. I've also witnessed a satellite ! in passing.. I have a keen eye and i'm able to discern what can be explained and what can't..",
      "link": "http://www.nuforc.org/webreports/114/S114893.html",
      "state": "GA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2595",
      "summary": "Two Triangular bright white lights , and one long object lighted , all very bright. All somewhat close to each other .",
      "city": "atlanta",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "Two Triangular bright white lights , and one long object lighted , all very bright. All somewhat close to each other . I emailed Atlanta Fox  5 to see if any saw these lights. I have been driving this route to work for over 10 years and never seen this before.  I know someone else had to see this. I was trying to get a good picture  - but I was being honked at. By time I could get a snap of the lights  - I didn't see the lights but had snapped a shot anyways.Did not see any cell tower or building or weather balloon. Interesting and I want to know what it is.  Two bright white lights both the shape of candy corn (Triangular) shape and one longer looking light to the right of them . This was north east on 285 Interstate near Roswell Road but before the exit and past the  river . The Military base is not far from location however I didn't hear any noise - like it may have been droids.",
      "link": "http://www.nuforc.org/webreports/114/S114962.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2866",
      "summary": "A bright blue light hovering over downtown Atlanta Ga.",
      "city": "atlanta",
      "shape": "light",
      "date": "2014-09-25T00:00:00",
      "story": "A bright blue light hovering over downtown Atlanta Ga. I was standing in a parking lot, toward downtown Atlanta, when I looked up and saw a blue light hovering in the distance, it went up straight into the sky, then it went directly right and then left, thats when I started filming, when it went right and left it didn't hesitate, it was fast and had a very smooth quick motion.  Then it finally went down and blinked off.  I'm not sure if it was a UFO or just some building light, but I don't think it was.   I have a video below so let me know if anyone has seen anything like this before. https://www.youtube.com/watch?v=_SyVNa5gwAc&feature=youtu.be ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113751.html",
      "state": "GA",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c28cf",
      "summary": "Round orb, zig zagging across sky, dimmed and changed lights",
      "city": "atlanta",
      "shape": "changing",
      "date": "2014-08-29T00:00:00",
      "story": "round orb, zig zagging across sky, dimmed and changed lights Driving home we saw neighbors looking up pointing at something.  We stopped the car, got out, saw a bright orb in the sky.  The orb moved very slowly at first.  Then began to zig zag across the sky.  At one point it changed its bright lights to peripheral lights as if it were making a landing and powering down.  Then it disappeared behind the tree line.  The general direction the object was seen was over the general vicinity of Stone Mountain.",
      "link": "http://www.nuforc.org/webreports/112/S112811.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2cff",
      "summary": "Blue/green lights around my boyfriend and me, as we walked our dog in Atlanta, GA.",
      "city": "atlanta",
      "shape": "light",
      "date": "2014-08-29T00:00:00",
      "story": "Blue/green lights around my boyfriend and me, as we walked our dog in Atlanta, GA. My boyfriend and I were walking our dog, when we suddenly saw blue/green lights (circular pattern) right around/above us.   I thought they might have been cop lights so I looked behind me but no cops.   My boyfriend on the other hand looked up and saw a round shaped object that immediately disappeared when he looked up.   We were (still) confused as to what it was.",
      "link": "http://www.nuforc.org/webreports/112/S112746.html",
      "state": "GA",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d34",
      "summary": "Orange and green lights in southwest Atlanta.",
      "city": "atlanta",
      "shape": "rectangle",
      "date": "2014-08-29T00:00:00",
      "story": "Orange and green lights in southwest Atlanta My son and his friends were outside last night - which was a clear and cloudless night sky when two bright lights flashed in the sky.   It was extremely bright and flashed orange and green (another friend said orange and blue).   They described it as being as close as the top floor on a twenty to thirty floor building and each light being about the size of a two car garage door.  It was bright enough to lite up the sky.  At least our neighborhood it flashed twice and went away.",
      "link": "http://www.nuforc.org/webreports/112/S112837.html",
      "state": "GA",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2dde",
      "summary": "2 red/orange cone shaped objects moving slowly over a building near Atlantic station and disappeared one after the other and made no so",
      "city": "atlanta",
      "shape": "cone",
      "date": "2014-08-22T00:00:00",
      "story": "2 red/orange cone shaped objects moving slowly over a building near Atlantic station and disappeared one after the other and made no sound.",
      "link": "http://www.nuforc.org/webreports/112/S112517.html",
      "state": "GA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c32a6",
      "summary": "((HOAX))  I was taken up and served as a prince, the small yellow creatures acted as if they had never seen a human before.",
      "city": "atlanta",
      "shape": "egg",
      "date": "2015-03-20T00:00:00",
      "story": "I was taken up and served as a prince, the small yellow creatures acted as if they had never seen a human before.  I then went unconscious and woke up on the ground 800 yards from my house with a scar on my leg and one on my stomach as well. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117929.html",
      "state": "GA",
      "duration": "2 days"
    },
    {
      "_id": "64d005f478aba2ec5a3c3710",
      "summary": "Not a joke.......not losing it either......got a question? For God's sake please tell me what in the world this is and where I should c",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2015-02-06T00:00:00",
      "story": "Not a joke.......not losing it either......got a question?  For God's sake please tell me what in the world this is and where I should call to report it?   My family saw something strange in the sky Tuesday am approx. 6:45am, while in the car, and took pictures of it.  We could not identify the flying object which was too close for comfort.  We kept trying to blow it up from all angles on the cell phone tonight and zoomed down towards the ground on the cell and this is what shows up.  The neighborhood trash was scattered in the street. We have several pictures of the thing and when you zoom in to the head you can see the eyes.  Later that day 2 army trucks were riding through the neighborhood which was strange but we did not pay much attention to it.   I called the non-emergency police number and the young lady told me to call back tomorrow to see if I could get appropriate numbers to call.  What do you think?  Please let me know.  I emailed it to 2 news stations here and was referred to you to file a sighting. You could see it better and blow it up from all angles on the cell phone where the pictures were actually taken from.  We e-mailed the pictures to my personal email and I saved it as a PowerPoint and zoomed in on it.  I had to brighten the contrast on it in PowerPoint because it was dark outside. (I will try to email you the pictures....I want you to see them.) ((NUFORC Note:  We have not seen the photo, at the time of this writing.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117194.html",
      "state": "GA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c3b5a",
      "summary": "I saw a bright dot in the western sky, two attached circles white and silver visible only with binoculars.",
      "city": "atlanta",
      "shape": "oval",
      "date": "2015-08-06T00:00:00",
      "story": "I saw a bright dot in the western sky, two attached circles white and silver visible only with binoculars. I was looking for birds from my deck with a binoculars, and I stumbled on this bright dot in the western sky.  I could barely see it naked eye, but it was Ok with the binoculars.   My wife and niece watched too.  It was hoovering and moving a little bit left and right (south and north).  I couldn't make out very well the shape, which looked like a to spheres attached one to the other.  The color appeared to be white and silver.  It was very far high in the sky.    That day there was a good amount of commercial airplanes flying from East to West, south of my observation point.  It doesn't happened every day to see that many planes in that point at that time, it might be a route that is taken due to weather or else, and by the way the weather was perfect that morning.  Anyway, at a certain point I am not sure where it went but it was not there any more.   I don't know what I was looking at, my niece (21 y o) doesn't either, but she says she saw a UFO.  It was a UFO to me, at least, I don't want to jump to conclusions.    Considering the shape (to spheres attached one to the other) and the fact that it was not moving and it appeared to reflect light (at that time 8 am the sun was low in the eastern sky and was shining toward west hitting this object which was reflecting the light).  It was very difficult to spot, I saw it by accident.  I don't expect many people having seen it too. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120894.html",
      "state": "GA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3cba",
      "summary": "I observed a moving light through an aircraft's window over Atlanta, Ga.",
      "city": "atlanta",
      "shape": "light",
      "date": "2015-07-10T00:00:00",
      "story": "I observed a moving light through an aircraft's window over Atlanta, Ga. I was on Delta Airlines Flight 1667 flying from Atlanta, GA, to Myrtle Beach, S.C.  The aircraft was a MD-88 and I was sitting in seat 19E on the starboard side of the aircraft, several rows forward of the wing, which I could see on the right side of my window when I leaned forward.  We took off an hour late at around 22:29.  There was an overcast of Cirrus-stratus or Alto-stratus clouds.  The full moon was not visible through this layer.  There were no lower clouds and city lights were plainly visible without obstruction during the initial climb out after takeoff.  There were no reading lights in use near me.  There were also no electronics in use with illuminated screens nearby that would have reflected on the inside of the window. Shortly after takeoff the aircraft leveled out and the lights of the city were plainly visible with a definite darker area extending out to the horizon visible under a slightly lighter sky over that.   At this point I was looking down at the city lights, when I noticed a light separate itself from the rest and begin to move.  It was a banana yellow color and was moving upward at a slow and steady pace.  There were no other details to it.  I could not judge its distance from us.   As it moved, it appeared to be heading on an opposite course to ours and was climbing at an angle of approximately forty five degrees.  From my perspective it moved from the lower left of the window to its upper right corner where I lost it to view.   The light became obscured by the leading edge of the wing and then reappeared over the rear upper edge of the wing or wingtip.  All this time which was probably a minute or so the light did not change in brightness or flicker.  The color stayed the sa! me and so did its speed of ascent.  I was unable to observe the object further as it went out of my limited field of view even by shifting my position. I don't know if anyone else on the aircraft saw this.  There was no apparent reaction. The young man sitting next to me on the left was listening to music and not looking out the window.  This whole thing occurred to quickly to try to get anyone's attention. During the initial takeoff before we leveled out there were other aircraft visible.  This light or object did not exhibit their characteristics.  I have flown numerous times at night and have seen plenty of aircraft leaving or arriving at airports.  This was not one of them. Its apparent point of origin was not from any airport. It was an urban environment.  Shortly after this we began to ascend again and banked for a course change.  I checked my watch and it was now 22:35. I am sixty two years old, male, and was travelling alone returning home from a family related trip.  I am a retired social worker and business manager.  I am an amateur astronomer and avid sky watcher.  I have no clue what this was.  I only know what it wasn't.  I considered raising this issue with the pilot upon landing at Myrtle Beach, but decided to avoid that and take this approach instead.  I don't know how he would have reacted, but I did speak with him about the natural fireworks of distant thunderstorms visible to our south during the flight at higher altitude which he was also quite enthusiastic about.",
      "link": "http://www.nuforc.org/webreports/120/S120227.html",
      "state": "GA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f5a",
      "summary": "We noticed a bright object in the sky during the day. It was strange because it did not move at all. Completely fixed like a star is in",
      "city": "atlanta",
      "shape": "circle",
      "date": "2015-06-05T00:00:00",
      "story": "We noticed a bright object in the sky during the day.  It was strange because it did not move at all.  Completely fixed like a star is in the night sky and about the size of a really bright star but during the day.  The intensity of it grew at which point a second smaller fixed object appeared next to it.  As the original bright object decreased in intensity the smaller one faded away and eventually the larger one slowly disappeared.  The object had a bright white color with a small amount of orange mixed in it.  Was so unusual.  It did not  move which makes me think it had to be outside of the atmosphere as if it were celestial.   Me and my co-workers were astonished by the event.",
      "link": "http://www.nuforc.org/webreports/119/S119230.html",
      "state": "GA",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4067",
      "summary": "Identified February 3rd, 2015, photos of alien grey to be a hoax.",
      "city": "atlanta",
      "shape": "",
      "date": "2015-05-08T00:00:00",
      "story": "Identified February 3rd, 2015, photos of alien grey to be a hoax. Hello,   I just wanted to pass along some info about one of the reports on your homepage.  I found the images submitted to be so intriguing that I decided to do a thorough search to try to eliminate it being a hoax.   Long story short, after cruising through several pages of image search for \"alien grey sculpture\" (assuming a high quality sculpture would be a great prop for hoaxing) I found an image that was from what I could tell identical to the \"alien\" in the photos just flipped horizontally.  I did a reverse image search, and found this image on a post dating back to 2008 as just a generic example image of a \"grey\". The post on your site: Atlanta, Georgia, Tuesday, February 3rd, 2015, @ 0645 HRS. (EST) - A woman reports that she, her son, and her daughter were driving to work, when they allegedly witness a strange-looking object in the morning sky.  The attempt to photograph the object, and apparently inadvertently photograph an alien creature, standing on the roadway in front of their car.   Full Report:  Alien Image 1    Alien Image 2  The link to the reverse image search:  http://tineye.com/search/360d4be8fe47d888fa66610c31a902a06e0e9479/?page=1&sort=score&order=desc   Comparison:  Image from Feb. 3rd 2015 report:  http://www.nuforc.org/S117194a.jpg  Image from website in 2008:  http://www.ufoencounters.co.uk/images/7234.jpg   I took the time to do the digging, so I figured I'd use that time to report this to you so it didn't just all go to waste. Thanks.",
      "link": "http://www.nuforc.org/webreports/118/S118841.html",
      "state": "GA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c4190",
      "summary": "Bright orange light zipped in a straight line, then disappeared.",
      "city": "atlanta",
      "shape": "light",
      "date": "2015-05-08T00:00:00",
      "story": "Bright orange light zipped in a straight line, then disappeared. A bright orange/reddish light zipped in a straight line, and then disappeared.   It appeared over the city of Atlanta on May 4, 2015. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118785.html",
      "state": "GA",
      "duration": "1 Second"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b43",
      "summary": "Large disc over downtown Atlanta.",
      "city": "atlanta",
      "shape": "disk",
      "date": "2015-08-27T00:00:00",
      "story": "Large disc over downtown Atlanta. From my window, on the 7th floor of my apartment building in downtown Atlanta, I noticed the dark silhouette of a thick disc shaped object over the Westin hotel, it appeared creased in the middle, and hovered.  Judging from the distance from my window to the Westin I could approximate the height of the object as being 1000 ft or so from the ground.  I shined a staples laser pointer at it, and it slowly flew south west over the city and banked out of view to the West. Also judging from its height and flight trajectory over buildings I know the distance to, I think it was at least 30 ft in diameter and perhahps 8-10 ft tall.  I also noticed some odd looking red flickering lights in one of the adjacent skyscrapers while the disc was present.",
      "link": "http://www.nuforc.org/webreports/121/S121111.html",
      "state": "GA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b3d",
      "summary": "Craft releases smaller object which then vanishes into thin air above Atlanta, Georgia",
      "city": "atlanta",
      "shape": "other",
      "date": "2015-09-17T00:00:00",
      "story": "Craft releases smaller object which then vanishes into thin air above Atlanta, Georgia This craft, black in appearance seemed to be a curved craft.  It came out of the clouds, hovered, dropped a smaller object which after falling a short distance from the mothership, seemed to vanish into thin air.  I saw this report on youtube, which includes pictures and a video.  A link in a comment under the video leads to a very clear picture.  A friend of mine has a friend who may have seen this.   I will update with more info soon. Link to youtube video: https://www.youtube.com/watch?v=geWuVytGqPw",
      "link": "http://www.nuforc.org/webreports/121/S121994.html",
      "state": "GA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c562f",
      "summary": "My friend and I were sitting outside of our campsite watching the sunrise over the mountains and suddenly a bright flash appeared in th",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2016-07-08T00:00:00",
      "story": "My friend and I were sitting outside of our campsite watching the sunrise over the mountains, and suddenly a bright flash appeared in the distance.  It moved very quickly away and flashed 5 times while moving.  Then it just disappeared.  I have seem aircraft and satellites, but this was nothing like that.  It was an extremely bright flash and appeared to be moving outward at a tremendous speed before just disappearing.  The sky was clear and was moving away from the mountains so there was no way it could have disappeared behind something.",
      "link": "http://www.nuforc.org/webreports/128/S128311.html",
      "state": "ID",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c579f",
      "summary": "Spotted 12 solid red lights flying in the formation of a triangle slow moving across the night sky.",
      "city": "atlanta",
      "shape": "light",
      "date": "2016-06-24T00:00:00",
      "story": "Spotted 12 solid red lights flying in the formation of a triangle slow moving across the night sky. 12:16:00 am - June 19, 2016.  Approximately 200 to 300 feet in the air, I spotted three solid bright red lights flying in the formation of a triangle slow moving across the night sky from the southeast toward the west.  Another similar formation of three lights followed the previous three lights.  I observed the set of objects (6 lights total) make a deep (simultaneous) turn right toward the northwest and disappeared from view. No sound was heard. 20 seconds later-Another second set of lights (6 lights total) in same triangle shaped formation appeared from the same direction (southeast moving toward west), made the same precise turn toward the northwest and disappeared from view like the previous six. All the observed objects passed below the full moon. 20 minutes later a nondescript helicopter with red and white flashing lights came from the same direction and race off toward the northwest, too.",
      "link": "http://www.nuforc.org/webreports/128/S128042.html",
      "state": "GA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c57b2",
      "summary": "Seven 'Light spheres' - in synchronicity moving in the sky - unlike anything my wife and I have ever seen.  Ever.",
      "city": "atlanta",
      "shape": "circle",
      "date": "2016-06-24T00:00:00",
      "story": "Seven 'Light' 'Spheres's' - in synchronicty moving in the sky - unlike anything my wife and I have ever seen. Ever. Sunday, June 19th – approximately 245am   Location of sighting:  Midtown, Atlanta, GA, (30308)   My wife and I were (sitting) on our front deck.  Second floor front deck.  In the midst of a conversation we were having about her work department (a rather important natured dialogue), my wife said to me,  “Babe- oh my god-babe.. look” (verbatim).  She stood and pointed directly past me – west, north west – I got up and turned toward the direction she was pointing at – the direction toward the sky. I turned and looked and saw SEVEN (I eventually counted) rotating lights in the sky- I (we) immediately thought they were Hollywood style sky spotlights – the ones you would see in the sky for a premier of a show, a movie.  But they were not: too late in the morning –way too late. We continued to watch these “light-spheres” and could only make them out –with the eye –when they passed through the moving puffy clouds.  Meaning that they only made themselves apparent when passing through the clouds.  When they didn’t pass through the clouds there was ZERO trace of them.  They passed through the clouds in incredibly bizarre formations-they bounced off one another–we watched for 20 minutes (approx.) until the clouds passed. It was simply surreal.",
      "link": "http://www.nuforc.org/webreports/127/S127962.html",
      "state": "GA",
      "duration": "30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c60bf",
      "summary": "White dot spotted in the sky stationary for a number of minutes then zoomed off.",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2016-10-27T00:00:00",
      "story": "White dot spotted in the sky stationary for a number of minutes then zoomed off. While out for an afternoon walk with my wife and 3-month old twins, we noticed a white dot in the sky.  The object appeared to be in a location that was not the place for a plane or helicopter to be.  The object also seemed to be too big to be a drone.  I own a couple of drones and so I am familiar with their shape, size and flight characteristics.  This white object was stationary for a number of minutes and then zoomed off.  We lost it behind a building.  A video (sorry, iPhone only) was taken at the time.  You can see the footage here:   https://www.dropbox.com/s/sd8riguvv45hq5u/IMG_5709%202.MOV?dl=0  Interested to know if anyone else reported this?",
      "link": "http://www.nuforc.org/webreports/130/S130828.html",
      "state": "GA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c64ab",
      "summary": "Triangular shaped cluster resembling Stars",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2016-08-16T00:00:00",
      "story": "triangular shaped cluster resembling Stars First I noticed, then my wife noticed and verified and photographed a triangular cluster of three stars far above 30000 feet above the approach path for airplanes 4 Hartsfield International Airport in Atlanta.  What appeared to be a triangular cluster of stars moved apart then move back together.   Could not have been a helicopter because they are not allowed to fly in this airplane pathway.   Could not have been a blimp because these were far too high. Could not have been a meteor or asteroid because they would have been inflamed when entering the Earth's atmosphere and moving.   Was definitely not a plane because we watched the lights in a stationary orbit.   We then photographed them as they separated and came closer back together.   Could not have been a drone because for a drone to be seen and that altitude, it would have to be huge and larger than a 747.",
      "link": "http://www.nuforc.org/webreports/129/S129132.html",
      "state": "GA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6930",
      "summary": "Bright light in the sky-HUGE object, going faster then anything I've ever seen, then disappeared on I-85 S.",
      "city": "atlanta",
      "shape": "light",
      "date": "2017-03-17T00:00:00",
      "story": "Bright light in the sky- HUGE object, going faster then anything iv ever seen, then disappeared on 85s My fiancé and I were driving down 85 south, we were speaking casually when all of a sudden a HUGE bright light went from Left of my windshield to Right.  It was going down in a slanted motion but incredibly fast.  At that moment, we were both like, \"Are you seeing what I'm seeing!?\"  It looked as if the object would crash but just disappeared.  This was a light so bright we immediately knew it wasn't a shooting star.  It wasn't a plane (nothing crashed) it also had no streak tail in the sky and no sound.  It looked way to large to be anything logical.   We couldn't believe what we just saw.  My fiancé is not a believer and was in shock from what we had seen.  NOTHING like it.  There would be no way nobody else driving on the interstate could have missed it.",
      "link": "http://www.nuforc.org/webreports/133/S133095.html",
      "state": "GA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b15",
      "summary": "I went outside to walk my dog and looked up and saw a object with green and red flashing lights.It was hovering right above downtown an",
      "city": "atlanta",
      "shape": "light",
      "date": "2017-02-03T00:00:00",
      "story": "I went outside to walk my dog and looked up and saw a object with green and red flashing lights.  It was hovering right above downtown and was higher then the planes flying.  It was huge and after after a few of hovering it jetted forward super fast..  It stated glowing bright green.",
      "link": "http://www.nuforc.org/webreports/132/S132326.html",
      "state": "GA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b41",
      "summary": "Saw one bright white light while grilling dinner move from SW-NE possibly bright white. ((NUFORC Note:  ISS.  PD))",
      "city": "atlanta",
      "shape": "light",
      "date": "2017-02-03T00:00:00",
      "story": "Saw one bright white light while grilling dinner move from SW-NE possibly bright white.   I immediately called kids outside, to see the Space Station, but realized this was much lower maybe 10K feet?  There were no other lights.  Even my eight year old daughter said its only bright white not another color to be seen for duration. I have heard you for years on shows to say to report these as we see them, and I have usually not done so, but now that time has passed. ((NUFORC Note:  ISS.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132367.html",
      "state": "GA",
      "duration": "45-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d11",
      "summary": "Seeing orange orbs on the ground and in the air as the airplane was taking off unbelievable!",
      "city": "atlanta",
      "shape": "sphere",
      "date": "2016-12-21T00:00:00",
      "story": "Seeing orange orbs on the ground and in the air as the airplane was taking off unbelievable!",
      "link": "http://www.nuforc.org/webreports/131/S131763.html",
      "state": "GA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e05",
      "summary": "Cone-shaped craft moving at incredible speed towards the ground with flames from behind as if crashing.  ((anonymous report))",
      "city": "atlanta",
      "shape": "cone",
      "date": "2017-09-05T00:00:00",
      "story": "Cone shaped craft moving at incredible speed towards the ground, with flames from behind, as if it was shot down or crashing.  The speed of the object was if it came from out of our atmosphere.  Weird but can't come to a conclusion of what it was… ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135895.html",
      "state": "GA",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c74d3",
      "summary": "Bright orbs in triangle formation slowly fly over Atlanta.",
      "city": "atlanta",
      "shape": "changing",
      "date": "2017-05-11T00:00:00",
      "story": "Bright orbs in triangle formation slowly fly over Atlanta. I was on my back deck with my mother and law assembling a pergola.  Something caught my mother-in-law's and my eyes in the sky in the eastern direction.  What we witnessed were four extremely bright white orbs grouped in a triangular formation.  One at each point of triangle, one perfectly in the center.   The formation was slowly moving southeast completely silent.  I thought it was airplanes flying in formation, but no sound, no exhaust trail.  The orbs were also shimmering, almost like they were changing colors from pink to green and bright white.   As they crossed the sky, they changed formation to single file.",
      "link": "http://www.nuforc.org/webreports/134/S134041.html",
      "state": "GA",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c74d2",
      "summary": "13+ white dots spotted hovering over downtown Atlanta during an EDM festival.",
      "city": "atlanta",
      "shape": "sphere",
      "date": "2017-05-11T00:00:00",
      "story": "13+ white dots spotted hovering over downtown Atlanta during an EDM festival. Around 4-5 pm in the middle of an amazing song, everyone was enthralled by, someone next to me pointed to the sky and said balloons.   At first we saw a few balloons...orange blue yellow clearly balloons that colored with strings on them...I turned around 30 seconds later.  And what seemed like a bunch of balloons behind the close balloons all of sudden were white dots floating up down left and right...  Not a ton of movement.  It seemed as if they were watching/listening/feeling the festival.   I've never seen anything like this so and I've always been interested in these kinds of things, so I decided to report it.",
      "link": "http://www.nuforc.org/webreports/134/S134013.html",
      "state": "GA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a99",
      "summary": "Triangle shaped black craft spotted near Atlanta, GA.  ((NUFORC Note:  Witness suggests Boeing drone.  PD))",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2017-11-03T00:00:00",
      "story": "Triangle shaped black craft spotted near Atlanta, Georgia. While flying from Atlanta, Georgia, to Minneapolis, MN, spotted a solid mat black triangle shaped craft flying at a speed of approximately Mach 2 at an altitude of 31,000 feet.   The aircraft was  flying towards the commercial aircraft I was in and passed on the right side of the aircraft approximately 500 yds away and 1000 ft lower than my aircraft's altitude.   Triangle shaped craft bore no markings and no stabilizers or visible fins.  The craft appeared to be smaller than most fighters or personal aircraft and appeared to not have a cockpit of any sort.   The craft appeared off the forward right side of the aircraft I was in and then disappeared under the right wing. As far as I know I am the only one to see the craft.   I am in the military and I study aircraft that are operated by the U.S. Military.  This craft does not match any current operational military aircraft. ((ADDENDUM FROM WITNESS)) Mr. Davenport, I did not inform the aircraft crew of the sighting.  For some reason the thought never occurred to me.  I have done some research however and I have found a prototype aircraft that is very similar to the aircraft I spotted.  The craft that I found is the Boeing Phantom Ray which was produced 7 years ago in St. Louis, Missouri.  I hope this helps some.  Thank you for your consideration of my report and timely reply. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/137/S137071.html",
      "state": "GA",
      "duration": "2-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d58",
      "summary": "It looked like a plane at first, but I noticed it was simply white with no wings at all. It also had a slight metallic shine to it. As",
      "city": "atlanta",
      "shape": "cigar",
      "date": "2017-09-12T00:00:00",
      "story": "It looked like a plane at first, but I noticed it was simply white with no wings at all.  It also had a slight metallic shine to it.  As my greyhound bus was entering Atlanta, GA, from Tampa, FL, (while escaping hurricane Irma), I saw it fairly low in the sky and close enough to see clearly.  It seemed to be hovering in one spot and it looked like it could have been larger than a passenger aircraft.  There was no distinguishable front or end to the craft, it looked as though the ends of the cigar shaped craft were flat.   It did start to look like it was drifting farther away from the greyhound bus, but not because were were on the highway, but because it was drifting directly away from the highway, going Eastward, even though it was pointing North/South.",
      "link": "http://www.nuforc.org/webreports/136/S136103.html",
      "state": "GA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c80bb",
      "summary": "My daughter and I were traveling I-85S going to school when I saw a blueish-greenish #shootingstar or #ufo blaze through the Atlanta sk",
      "city": "atlanta",
      "shape": "light",
      "date": "2018-03-29T00:00:00",
      "story": "My daughter and I were traveling I-85 S, going to school, when I saw a blueish-greenish #shootingstar or #ufo blaze through the Atlanta sky.  It looked like a firecracker light similar to a sparkler.  It only lasted a few seconds, then it just disappeared.",
      "link": "http://www.nuforc.org/webreports/139/S139298.html",
      "state": "GA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c81c4",
      "summary": "3rd time we have woke up to see a light floating in the sky. It does appear to move slightly back and forth. Seems to float almost as h",
      "city": "atlanta",
      "shape": "light",
      "date": "2018-01-25T00:00:00",
      "story": "3rd time we have woke up to see a light floating in the sky.  It does appear to move slightly back and forth.  Seems to float almost as high as a small plane would fly.  Try to watch it as long as we can before we go back to sleep.  We have seen the light outside of our bedroom window, facing south.",
      "link": "http://www.nuforc.org/webreports/138/S138472.html",
      "state": "IN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8454",
      "summary": "Bright orb descending over I-20 at Wesley Chapel Road",
      "city": "atlanta",
      "shape": "light",
      "date": "2018-09-27T00:00:00",
      "story": "Bright orb descending over I-20 at Wesley Chapel Road I was driving on I-20 east away from Atlanta and a bright condensed white light caught my attention ahead and to my right, so that it appeared to be south of I-20.  The light was like a shooting star but about 20 times as bright.  It was descending rapidly at a slight angle, and disappeared behind the trees.  This was definitely not a shooting star, it was moving more slowly and deliberately than that and was too bright.  As I kept driving there was an accident that had just happened on I-20 not far from where the light was headed, although the light appeared to be heading more south away from the interstate.  Also, the trajectory was as of a plane crashing at a steep angle, or a flare coming down.",
      "link": "http://www.nuforc.org/webreports/143/S143158.html",
      "state": "GA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8aea",
      "summary": "Disk shape object with illuminated white lights west of Atlanta I-285",
      "city": "atlanta",
      "shape": "disk",
      "date": "2019-09-06T00:00:00",
      "story": "Disk shape object with illuminated white lights west of Atlanta I-285 Truck driver, headed south 285, to the west was a flying object went much slower than airplane, all lights were bright white approx 10-15 lights across disk shape, occasionally lights flickering intermittently.  Then it just disappeared from sight, didn’t see it fly out of sight, it just vanished.   Lasted about 30 seconds once I saw it appear and disappear.",
      "link": "http://www.nuforc.org/webreports/148/S148630.html",
      "state": "GA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ef5",
      "summary": "Triangle shaped lights flying through the sky.  ((anonymous report))",
      "city": "atlanta",
      "shape": "triangle",
      "date": "2018-12-14T00:00:00",
      "story": "Triangle shaped lights flying through the sky I was on highway 75 going north bound getting very close to the airport when I saw through the clouds bright lights in the shape of a triangle.  The lights flashed 3 times and it appeared to be coming in for a landing.  I've never seen a plan like this and I travel this highway often. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144037.html",
      "state": "GA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9077",
      "summary": "What is it?",
      "city": "atlanta",
      "shape": "disk",
      "date": "2019-12-01T00:00:00",
      "story": "What is it? I do not know what this is but would like an expert to look at it.  I was at Atlanta airport in one of the smoking rooms.  Likely concourse A or C.  The picture is taken through glass.  I did not notice this in the photo until now and I did not see it the day i took the picture. I don't recall round lights being in the smoking room however there could be and it may be a reflection.  Just seems odd.  You can see the shadow of me in the glass.  It is not in the picture taken a few seconds before.  About 20 seconds apart.  I am emailing pictures.",
      "link": "http://www.nuforc.org/webreports/150/S150025.html",
      "state": "GA",
      "duration": "Picture"
    },
    {
      "_id": "64d005f478aba2ec5a3c9230",
      "summary": "It hard to explain but it was lights moving in a way and speed that you know it's not man made craft dancing in the sky fading in an ou",
      "city": "atlanta",
      "shape": "flash",
      "date": "2019-12-01T00:00:00",
      "story": "It hard to explain but it was lights moving in a way and speed that you know it's not man made craft dancing in the sky fading in an out",
      "link": "http://www.nuforc.org/webreports/149/S149810.html",
      "state": "GA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c9284",
      "summary": "6 LIGHTS total....... 4 blue 2 white..... the white light was blinking slowly....... u couldnt see anything else. like it was cloaked",
      "city": "atlanta",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "6 LIGHTS total....... 4 blue 2 white..... the white light was blinking slowly....... u couldnt see anything else. like it was cloaked coming out of the WESTIN HOTEL in downtown ATLANTA 3 blue lights, DIM..... 2 white lights, DIM... one WHITE LIGHT that was fading in and out as if it was a  STOP LIGHT.... just not on RED. i KNEW i wasnt trippin when i was comin from the WESTIN HOTEL. i just happened to look up and thought, must be the lights from the top of the WESTIN. LO AND BEHOLD.... i get further from the hotel to  CENTINNIAL PARK.... walkin with my head up wonderin....WHAT THE FUCK AM I LOOKIN AT IN THIS SKY? there is no CRANE and there is no SIGN in the sky. clouds did there best to cover up WHATEVER us 3 were seein. but when those clouds disappeared...........a faded green, faded blue and faded white light still remained..... and the other light just kept  FADING IN AND OUT, as if was BLINKING. i KNEW I WASNT TRIPPIN as i was talkin to myself like sum crazy person, thinkin to myself.....bruh, this CANT be what i THINK it is. on sum ol CLOAKED SPACESHIP typa shit...........................  as i make my way to the cop car..... i tell the cop to take a look at this and tell me what u see, just see if im trippin BY MYSELF........ he gets outta his parked patrol car and glances up and asks me, yo...... WHAT THE FUCK ISSSS THAT???  and i say... EXACTLY!! are u seein what IM seeing? 2 white dim lights but only ONE of them is BLINKING SOFTLY. that is no AIR BALLOON... no, it WASNT a FUCKIN BLIMP cause even blimps MAKE NOISE. no it was NOT a fuckin DRONE...  drones are NOT fuckin big. it DISAPPEARED SLOWLY after 45mins...........and as soon as me and cop went our separate ways because of the cold..... as im walkin toward marietta st. THE FUCKIN LIGHTS APPEAR AGAIN!!! i ask the VALET  to come out and see what im seein...... EVEN HIIIIIS AFRICAN ASS was askin, WHAT DA FUK IS DAAH?!? my response.......EXXXAAAAAACTLY. same lights. bruh, its a CLOAKED and prolly unfunctionable/ FUNCTIONABLE aircraft hovering above DOWNTOWN ATLANTA...........  sumhow u can see the lights but cant see the whole craft its ATTACHED to. 3 witnesses and ONE is a damn COP",
      "link": "http://www.nuforc.org/webreports/150/S150879.html",
      "state": "GA",
      "duration": "45mins"
    }
  ]
}