{
  "city": "augusta",
  "fetch_timestamp": "2025-07-12T14:36:44.363677",
  "record_count": 59,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b428c",
      "summary": "My son and I saw this in early evening.There were a string of lightd quite brite over a low hill. It was right in town and very visible",
      "city": "augusta",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "My son and I saw this in early evening.There were a string of lights quite brite over a low hill.  It was right in town and very visible.  I thought it might be fireworkd because the lights seemed to be phasing brite and low.  My son saw them and we both remarked at the same time.  I opened the window to look out the side to make sure it was not a reflection on the windshield.  As we drove closer to the place they were over, they dissapeared. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous, except for e-address; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50555.html",
      "state": "ME",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b4353",
      "summary": "It was in med. size and red and white lights. It is not an a/c. It followed our car on the road. ((NUFORC Note:  Student report.  PD))",
      "city": "augusta",
      "shape": "sphere",
      "date": "2006-05-15T00:00:00",
      "story": "It was in meduim size and red and white lights.  It is not a plane.  It followed our car on the road.  It stayed in sight distance of our car until we got home and I ran in my house with my Mom.   It was scary, very scary...I could see it but with all the trees in Maine it was blured for maybe 5 minutes.  Then it came back into view when we got out of the car.  I felt like something was going on in the air above or around us 15 minutes before it happened. ((NUFORC Note:  Report is from young student.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49639.html",
      "state": "ME",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b44a6",
      "summary": "Group of flashing rapidly moving lights",
      "city": "augusta",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Group of flashing rapidly moving lights I have been seeing this for roughly a year. What happens is at certain times of the month several lights will appear, moving around the sky in unison and flash on and off while doing so. I have had several other people see it with me at times and they all agree with me that it seems like it is being flown in such a manor, definatly not stars or weather balloons or aircraft ( there are several airports in this area including one that has some military craft at it). I finally decided to file this in the hopes some else around here is seeing it.",
      "link": "http://www.nuforc.org/webreports/050/S50036.html",
      "state": "GA",
      "duration": "few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b44c8",
      "summary": "2 reddish/orange glowing objects in southwest sky, approximately 1500 feet above ground.",
      "city": "augusta",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "2 reddish/orange glowing objects in southwest sky, approximately 1500 feet above ground. I took a short break from my job in the designated break area. I was sitting at a picnic bench, when I saw one object \"fade\" in, glowing with a reddish/orange light, and a few seconds later, another glowing object appeared to the right and slightly lower to the first object. From my location, the objects were southwest from me. I noticed a co-worker staring in the same location, when I asked if she was seeing what I was looking at, and she confirmed that there was something there. The objects did not move, and after @ 30 seconds, the first object simply faded away, followed by the second object. The weather conditions were a clear sky, no wind, the sun was already beneath the horizon, and it was almost nightime.",
      "link": "http://www.nuforc.org/webreports/050/S50170.html",
      "state": "GA",
      "duration": "@30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b47b3",
      "summary": "5 lights 4 white with 1 red in center.",
      "city": "augusta",
      "shape": "unknown",
      "date": "2019-08-23T00:00:00",
      "story": "5 lights 4 white with 1 red in center We were outside discussing plans for the upcoming weeks.  I saw the object come into the upper part of my field of vision my eyes snapped to it.  In an instant it was gone over the horizon. I looked at the person next to me and asked if they just seen it as well.  They said yes and confirmed the light that I had seen. It had 5 lights in a cross formation 4 white and 1 red.  The red light was right in the center.  Travel direction was north-east. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148227.html",
      "state": "GA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4eef",
      "summary": "Bright green light triangle shaped falling from the sky.  ((anonymous report))",
      "city": "augusta",
      "shape": "triangle",
      "date": "2019-04-08T00:00:00",
      "story": "Bright green light triangle shaped falling from the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145490.html",
      "state": "GA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b54bc",
      "summary": "We saw a never explained dark large triangular object, hanging still and silently in the night sky over our backyard.",
      "city": "augusta",
      "shape": "triangle",
      "date": "",
      "story": "We saw a never explained dark large triangular object, hanging still and silently in the night sky over our backyard. Three pre-teen boys and their older sister were the witnesses.  The boys tumbled into the house from playing, white as sheets, and the two younger prodded the oldest to talk to me the \"big sister\" babysitting for the evening.  I listened impatiently as the oldest stuttered out that there was something HUGE up in the sky blocking the stars and it was a triangle and it wasn't high up but it wasn't low either and there were stars all around it and it WASN'T MAKING ANY NOISE and ended with, \"we're scaaared!\".  (I'm not sure if I remember he noticed lights or not). I laughed and said I would check it out and they pleaded with me not to, but I told them mom and dad wouldn't believe us unless I saw it, too.   I looked outside and up and it was exactly as he said.  A big black triangular void with no noise and no movement and no emissions, yet stars all around it.  I also noticed a complete absence of bugs, birds or pets making any noise and that's when I really creeped out and fear overcame my curiosity and I backed into the house slowly, keeping my eye on the unknown object.  It seemed like it was no more than a couple of hundred feet up which would mean I should be able to hear something!   My parents thought we made it all up of course and suggested it might be a weather balloon or experimental aircraft from Bush Field Airport or Fort Gordon Military Base.  I never believed that.   When I saw the stealth bomber years later it reminded me of it, although this had what appeared to be equal angles (equilateral) but again, there was no noise, no movement, and no emissions.  Just a big black triangular void that was definitely a solid object silently hanging in the air.  I don't remember seeing lights, but my brothers might, I'm going to ask them when I get a chance. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57950.html",
      "state": "GA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b567e",
      "summary": "Flasing triangular lights in rural Georgia",
      "city": "augusta",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "Flasing triangular lights in rural Georgia    On I-20W I was driving heading towards Atlanta. I had just stopped in Augusta to get gas  at least 15 minutes before. I saw deer and put on my high beams in order to spot them in the road. After driving 15 minutes I saw a triangular shape on the opposite side of the road facing me. It flashed its lights (which were under the aircraft) and then it was darkness for about 2 seconds. Then it flashed its lights again and I got a clearer look at it. The Aircraft was hovering over the tree on the opposite side and it seemed to standing still. The aircraft appeared to be very high tech and it made no noise as I passed. I didn't fear at all I just kept driving but I knew it was not from here.",
      "link": "http://www.nuforc.org/webreports/062/S62879.html",
      "state": "GA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a11",
      "summary": "I saw a UFO",
      "city": "augusta",
      "shape": "teardrop",
      "date": "2008-06-12T00:00:00",
      "story": "I saw a UFO   Me and my friends were walking up one of our streets. My friend turned to me and said \"that cloud looks like a teardrop.\" I said Whatever because it really did look like a teardrop, but we noticed that it kept getting closer, and then my other friend noticed small little lights on the sides of it. So suddenly it starts defusing from it's melecular cloud structure into a solid teardrop-shaped object with these blinking lights and shit started dissapearing, like leaves and even trees and rocks. So suddenly their's this giant flash, and then I just remember lying in my house naked with my two other friends. So we got up and I was all freaked out because I thought I had had a fucked up dream, and I was also naked now. So when i told my friends they had had the same dream, so We looked up UFO and Alien shit on the internet and found that you guys had a subcategory for teardrop shaped spacecrafts so I was wondering if their had been similar sightings before.  Thanks,  ((name deleted))",
      "link": "http://www.nuforc.org/webreports/063/S63311.html",
      "state": "ME",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b621d",
      "summary": "Small Orb Decends from Sky, appears from no where",
      "city": "augusta",
      "shape": "cylinder",
      "date": "2008-06-12T00:00:00",
      "story": "Small Orb Decends from Sky, appears from no where Was driving home from work, on riverwatch prkwy, heading toward downtown augusta, over the old Grantiville Plant saw a bright white orb color, it came out of no where started decending really fast thought was a small aircraft at first drove around in direction i thougt it fell, saw nothing no smoke, etc. Not really sure what I saw",
      "link": "http://www.nuforc.org/webreports/063/S63153.html",
      "state": "GA",
      "duration": "10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b72a6",
      "summary": "Formation of lights flying from east to west.",
      "city": "augusta",
      "shape": "flash",
      "date": "2008-03-31T00:00:00",
      "story": "Formation of lights flying from east to west. At approximately 8:50 pm, I witnessed a formation of lights flying from east to west at a high altitude. The speed appeared to be greater than a typical aircraft, and the lights were flashing similar to the lights of  high intensity strobes from an aircraft.. I counted at least 12 objects..",
      "link": "http://www.nuforc.org/webreports/062/S62384.html",
      "state": "GA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7aed",
      "summary": "Blue Red Yellow and Green Lights",
      "city": "augusta",
      "shape": "circle",
      "date": "2006-07-16T00:00:00",
      "story": "Blue Red Yellow and Green Lights My godsisters and I went to go check on the water in our pool that we'd just got. It wasn't completely filled so we decided to lay out on the trampoline and wait. I said lets look at the stars while we wait. It was night so we had a flasflight. I said oooooooo look at the star its shining so bright...As we kept looking that star that was shining  bright started to hover and as it hovered in the sky we noticed green red and blue lights...abd this circular figure had 1 big ballish thing in the middle shining brightly...thats what made us think it was a star. I said to my godsisters do you see what i see and they said yes.so we shined our flashlight in the sky and as we did it moved closer to us...so we turned it off and another figure just like it took off before our eyes with the snap of a finger...we've never seen anything move that fast. As we looked around at other parts of the sky we noticed about 5 more. They all were hovering and a gigantic circle with their lights bliking...Red, Blue Green Yellow! In that order. And we said that they couldn't be planes because planes cant hover. And hovering is when something can move but be in one spot. Kind of like floating. This shall go down in history!",
      "link": "http://www.nuforc.org/webreports/051/S51006.html",
      "state": "GA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b7f29",
      "summary": "Silent black rectangle flying over highway Augusta, GA",
      "city": "augusta",
      "shape": "rectangle",
      "date": "2009-12-12T00:00:00",
      "story": "Silent black rectangle flying over highway Augusta, GA I was driving to work this morning traveling west on I-20.  It was about 5:45 and it was still dark, but the sky was a monarch blue color before the sunrise, so it was not completely dark. I was between Washington Rd and Bobby Jones exits when I saw a dark shape in the sky flying at about 2 o'clock to the right of my car.  It zig-zagged and started coming toward the highway. I thought...wow! That is a huge bird!...and by the time that it got over the highway, I thought that it might be a helicopter, but it had no tail and no propellers.  It had no lights and was completely silent. It got close enough for me to tell that it was black and looked like a rectangular pod of some sort and definitely mechanical-looking. I could see side pipes and what might look like vents on it.  Although it was difficult to tell just how high it was, it was not too high...as I looked to the left over my shoulder as I saw it go across me over the highway, it looked like it just skirted the tree line before it disappeared.  I was not scared, but had a car behind me and I did have to be careful, because I did not want to run my car off the road.  If it was a plane or a helicopter, it would have had lights.  Due to the low altitude, if it had been either of those, I would have heard it.",
      "link": "http://www.nuforc.org/webreports/072/S72000.html",
      "state": "GA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b93d1",
      "summary": "small round object very far away  very white   very fast    moved at high speed then stopped",
      "city": "augusta",
      "shape": "oval",
      "date": "2010-05-12T00:00:00",
      "story": "small round object very far away  very white   very fast    moved at high speed then stopped I taped the Masters Golf Tournament and was watching the tape when I saw a strange object enter the screen as the tv camera was following a golf ball into the sky i have saved the recording and it is on my TV ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75055.html",
      "state": "GA",
      "duration": "5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba686",
      "summary": "Super fast white light that turned red and disapeared.",
      "city": "augusta",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Super fast white light that turned red and disapeared. A white light appeard over by the big dipper.  It looked like a satilite lit up,moving north at high altitude and high speed. Then it turned red and faded out and disapeard. it was a ufo.",
      "link": "http://www.nuforc.org/webreports/069/S69214.html",
      "state": "ME",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3baeb5",
      "summary": "Bright orange lights in triangular formation.",
      "city": "augusta",
      "shape": "",
      "date": "2011-05-02T00:00:00",
      "story": "Bright orange lights in triangular formation. I witnessed 3 very bright orange lights in a triangular formation in the southern sky, fairly low on the horizon.  The lights were brighter and of a different color than anything I have ever observed in the sky.  The lights were stationary, and disappeared instantaneously.  The entire sighting lasting less than five seconds.",
      "link": "http://www.nuforc.org/webreports/080/S80868.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc233",
      "summary": "Orange and some red object in some formation, quickly disappearing into the atmosphere",
      "city": "augusta",
      "shape": "formation",
      "date": "2012-01-12T00:00:00",
      "story": "Orange and some red object in some formation, quickly disappearing into the atmosphere I was driving south west on Plains road in Augusta NJ heading toward rt 206N, and looking toward my left I had suddenly saw orange objects in the sky.  As I continuing driving to rt 206 ,  I had pulled over onto rt 206 and others cars where looking toward the south also.  This happened  Friday evening December 30, 2011 about 7:20pm.  These orange objects in the sky about 3000 ft high, some brighter than others, coming from the south east,off the horizon.  The size that I can compare it to would be like small private plane.  One object would be always brighter, that would take the lead or follow behind the others in a group of six or more, other orange objects would be flying be themselves, a few would look red.  These objects would be very visible and than suddenly disappear into the atmosphere.  They were coming out of the south east and it probably lasted about 20 minutes and their where about seventy five of them. Where I had seen this is on a rural county road.  The area is rural, farmland and mountains.  I was driving in my Dodge neon and than I pulled over with others and step out of my car and watch these objects that I couldn’t believe what I was seeing.",
      "link": "http://www.nuforc.org/webreports/086/S86307.html",
      "state": "NJ",
      "duration": "20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc47f",
      "summary": "Orange lights in the middle of the country.",
      "city": "augusta",
      "shape": "other",
      "date": "2011-08-07T00:00:00",
      "story": "Orange lights in the middle of the country. We were driving home and the two of us in the car saw it at the same time.  It looked really far away and looked square.   It's hard to describe, almost dark orange color.  The square would decrease in size but stay a square and then appear in the sky father to one direction, upon reappearing it would do the opposite of disappearing, it would go from small to large.   It did this about 7-9 times and that was it.   It only last about 2 mins. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82539.html",
      "state": "KS",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bc5eb",
      "summary": "Triangle of moderately bright white lights",
      "city": "augusta",
      "shape": "triangle",
      "date": "2012-01-24T00:00:00",
      "story": "Triangle of moderately bright white lights Light that got larger, brighter than airplanes have been, at first looked like a planet, but it the light rapidly got closer in a very short timeframe.  The light seemed to turn into a triangle as it got closer, and it stayed static in one place long enough for others to exit home and see it, but rapidly, and fluidly, exited line of sight laterally across the sky, which was seen by me and 2 other adults. ((NUFORC Note:  Time may be flawed.  We suspect an evening sighting, and have amended the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86675.html",
      "state": "GA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bceba",
      "summary": "ICBM Sites Augusta, Montana, 1:00 A.M.  brilliant lights, greenish red orb, with no contrails on vanishing.",
      "city": "augusta",
      "shape": "light",
      "date": "2011-05-29T00:00:00",
      "story": "ICBM Sites Augusta, Montana 1:00 A.M.  brilliant lights, greenish red orb, with no contrails on vanishing. The event occured outside of Augusta, Montana on May 26, 1:00 A.M.  The area where I was staying is dotted with ICBM sites that are in eyesight of the road leading to the cabin.   The closest site to the cabin I believe was roughly 20 miles as the crow flies from the cabin.  I also believe that numerous other ICBM sites exist in the area that are sub Terra.   Six of us were sitting around a campfire, when a large reddish greenish glow started to crest the hill which leads down to the property.  We were staring uphill from a lower location looking up the road as the light crested the hill.  When a vehicle drives at night, which is rare anyways out there, the light does not crest the hills, the dips between the roads blocks out all night until the vehicle crests the top.  The light we saw was roughly 80-100 yards away.   Our first thought was that we were not witnessing a vehicle at all, but aurora borealis.  I remember a friend saying its aurora, but i fiercely d! oubted this accusation as the object grew brighter and showered the beam across the 4 acre property.  The object on the hill became glowing with a greenish purplish hue, that flooded the entire area we were staying in.  It illuminated all the trees behind us upwards to over one hundred yards.  The light seemed to expand over the entire area, then began to pulsate with tremendous colored light.   Six of us distinctly remember the intensity of the light and its changing color structure.  I remember staring directly at the object, then having the desire to walk towards it.  Not in an abduction sense, but more so a mix of curiosity and some sort of draw towards it.   My friend and I began to run towards it with his German Shepard.  As we started running to the top of the hill the orb pulsated and vanished.  No contrails, nothing at all, just turned itself off and vanished.  Since I was running up to the craft, my friend that was stationary said that the object had a center where ! the light was radiating out from.   What happened after the UFO left was also very interesting.  Every single one of us said we could feel some sort of energy within our bodies.  It was a very intense feeling, and it was not nerves or adrenaline.  It was as if my body was charged up or another state of awareness.  Everyone I was with said they could feel this feeling as well, upwards to an hour.   Within twenty minutes of the sighting, we noticed two planes flying overhead at low altitude with no lights at all.   Just two planes within a minute of each other, jet black, and not a single emitting light.  One of my friends who was in his tent at the time of the siting, said he felt an intense light pulse through the tent and that he could feel the presence of something hes never felt before.  The dog in his tent, had erratic behavior after and during the light.   The following day on the road out, we witnessed more U.S. Government plates on SUV vehicles than I have ever seen in a population of 287 people.  At first I was not going to post my encounter, but after reading countless reports of minutemen and other military personnel that were stationed in the exact same area, and reporting exactly and very close to what I saw, I changed my mind.   I believe ICBM sites are the main focus of these lights people have been seeing since the Cold War.  The incident at Maelstrom AFB really made me interested, and an avid believer that nuclear power and ICBM are of great interest to whatever is out there.",
      "link": "http://www.nuforc.org/webreports/081/S81548.html",
      "state": "MT",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd26d",
      "summary": "2 large blue flashes in different locations late night in Maine",
      "city": "augusta",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "2 large blue flashes in different locations late night in Maine At 12:41 P.M. ((sic.  A.M.)) my wife and I were driving home from the Portland airport on route 295 north.  About 15 minutes south of Augusta, Maine, we saw a huge blossoming, neon blue explosion, north, directly in front of us just over the horizon.  Three seconds later we saw another, a little farther to the east, toward the ocean. The color was similar to the blue flames on a propane stove.  If you held your hand out straight in front of your face and spread your fingers, they were about that size. My wife and I have seen bolides (exploding meteors) before, and these were nothing like that.  The flash came from the ground up, brighter blue at the bottom, with no streak or trail in the sky to indicate anything fell.   The rest of our trip home we did not see anything else unusual Just wanted to put this out to see if anyone else reports it.",
      "link": "http://www.nuforc.org/webreports/093/S93081.html",
      "state": "ME",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd26e",
      "summary": "Thoughts on previously reported event",
      "city": "augusta",
      "shape": "",
      "date": "2012-10-30T00:00:00",
      "story": "thoughts on previously reported event Last week I reported something unusual in the sky near Augusta Maine, a blue explosion of light near the horizon. After giving it some thought and searching for explanations, I wonder if what my wife and I witnessed was entirely blue northern lights?   We were driving primarily north, and it seemed like the lights originated below the horizon.",
      "link": "http://www.nuforc.org/webreports/093/S93251.html",
      "state": "ME",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd764",
      "summary": "Moving ball of flame deploys small white light in atmosphere then disipates",
      "city": "augusta",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Moving ball of flame deploys small white light in atmosphere then disipates Myself, and two friends were walking down the street (Washington street) looked in the night sky and noticed a street light dark yellow colored object in the sky (ball of fire?). At first I thought the object was a planet but then we noticed it was much larger than a planet.  It also moved across the sky somewhat slow.  Another light (a smaller white one) detached from the object, it stayed stationary and the other object we first saw faded away like it was burning out but still travelling in the same direction. No noise could be heard from the sky, it appeared to be in the atmosphere, definitely did not appear to be a plane or satellite.  When I squinted and blocked out the street lights I almost want to say it was a V shaped craft with a rocket thruster propelling it into the atmosphere to deploy a smaller object.  That is what it looked like.",
      "link": "http://www.nuforc.org/webreports/093/S93424.html",
      "state": "ME",
      "duration": "~60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb70",
      "summary": "Disc/ball shaped object crossed the skyline faster than a conventional aurcraft and returned slowly, with no sound.",
      "city": "augusta",
      "shape": "circle",
      "date": "2012-08-19T00:00:00",
      "story": "Disc/ball shaped object crossed the skyline faster than a conventional aurcraft and returned slowly, with no sound. I was looking out the patio doors when I saw what I thought was a meteor streak by and disappear over the horizon.  The only difference being when it reached the horizon it winked out of sight instantly. 2 minutes later I decided to walk out onto out deck and I noticed a bright light heading toward my position.  As I watched it approach I began filming it with my cell phone.  It was far below the orbits of any satellite, and as it grew closer the light grew brighter in intensit. We are less than a mile from the Augusta airport and there were planes doing instrument takeoffs at the time. There were no strobes or usual aircraft lights on this object. There was no sound as it passed over head and headed Northeast. I am familiar with every form of conventional aircraft having grown up an air show kid and I keep up to date on military and civilian craft that operate I this area.  The crazy thing about this is the next day two of my students who were in Winslow Maine! , which is 15 miles north northeast of Augusta told me they were outside at about 10:00 and an object passed overhead, spun around and took off.I know these kids and they wouldn't make this up. They couldn't believe what they were seeing. I also have two videos of the object. In one video you can clearly see the object as it passes. An early video I took as it first appeared shows the object winking in and out as it slowly moves across the sky. The strange thing Is as I recorded that I watched the object as it crossed the sky and I never lost sight of it. It did not wink in and out of sight. I don't know if it is because the quality of the camera or if it was due to some type of electrical interference.",
      "link": "http://www.nuforc.org/webreports/091/S91649.html",
      "state": "ME",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf1b",
      "summary": "Nine lights on a circular object appeared and disappeared twice while I was riding on the I-20W towards Atlanta...",
      "city": "augusta",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "Nine lights on a circular object appeared and disappeared twice while I was riding on the I-20W towards Atlanta... Tonight while heading West/Northwest on I-20 towards Atlanta I saw a circular object  with 9 lights (that light up in a domino effect) light up within 1 second.  It disappeared and reappeared about 2 seconds later in a differnt point in the sky (headed Northwest) in the same sequence. It disappeared and I pulled over on the side of the road and asked the people that were following me if they had seen it.   Of the 5 people that were following me 2 others claimed that they saw it, and described it (in detail) exactly as I had seen it. ((NUFORC Note:  We spoke via telephone with this witness, a professional driver, and we found him to be exceptionally eloquent and objective in his description of the sighting.  We have the impression that he is an exceptionally good observer, and a very reliable witness.  He is a former member of the U. S. military.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92881.html",
      "state": "GA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beaac",
      "summary": "Three bright lights appear in the shape of an equilateral triangle.",
      "city": "augusta",
      "shape": "triangle",
      "date": "2012-02-03T00:00:00",
      "story": "Three bright lights appear in the shape of an equilateral triangle. At approximately 7:18pm on January 24th, 2012 my mother and I were driving down Old Evans RD, towards Bobby Jones Hwy. We saw a stationary grouping of lights (larger and brighter than stars) in the area of sky on our right side. The lights were in an equilateral triangle formation and not moving at all. After only a few moments, perhaps 45 seconds, one of the lights went away; it appeared to have been turned off.  It reminded me of how a bulb still glows slightly for a split second once it has been shut off.  After about 5 seconds, the remaining two lights went out at the exact same time (and in the same \"slow\" manner). The lights were not seen again. bright flash in bellingham area. A flash of light lit my whole house. My dog freaked out.  At the same time a friend who lives 15 miles away witnessed this same light and his dog freaked out aswell.  I was wondering if anyone else noticed this.  I have never seen a UFO and don't nessasarly beleive in them, but I can not think of another explaination.  My girlfriend has witnessed a similar occurance.  Winter lighting??? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86813.html",
      "state": "GA",
      "duration": "about 1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3beb92",
      "summary": "Rod or cylindrical object seen heading from NW to SE. Object was white on either end with a darker division in the center.",
      "city": "augusta",
      "shape": "cylinder",
      "date": "2013-09-09T00:00:00",
      "story": "Rod or cylindrical object seen heading from Northwest to Southeast.  Object was white on either end with a darker division in the center.  Object then simply vanished.  No trail was left in its wake, and it made no sound.",
      "link": "http://www.nuforc.org/webreports/101/S101977.html",
      "state": "WV",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3befd0",
      "summary": "White and Orange oval craft in the sky over State of Maine !!!",
      "city": "augusta",
      "shape": "oval",
      "date": "2013-08-30T00:00:00",
      "story": "White and Orange oval craft in the sky over State of Maine !!! This  evening  Monday  August 6th 2013 I was sitting  out on my cousins deck with his wife . Here in Augusta  Maine 04330  the sky was very clear stars are shining its about    930 pm  . I wonderd what stars were above us I grabbed my cell and went too  droid sky  view app. I thought it would be cool too observe the night sky and watch the sky for  a while my cousins wife was looking too . We began too see a orangish white glow in the sky about the size  of a star . We saw it travailing across the sky for a minute and a half till it was out of site over the roof of the house.  I looked at her   and said that was probably  a satelite going by . I got busy doing something else  for  about 7 minutes   I looked up  aigan    I could see another star like object moving very very quickly 2 times faster than the other object I had seen  this got my attention!!                 I  it was a star size object orangeish white ish in color I stood up turned my head too the right just be for the object went over the peek of the roof their was a burst of bright star like rays of light wich quickly imploded  intoo it self.   I yelled hey did you see that she said what I pointed it out too her this object  seemed  too last over a full minute .     The      direction of the object went from north west  too east off in the direction of Maines coastal Atlantic shores   . The object from first seeing did a fish hook turn best way for me too describe it !!!",
      "link": "http://www.nuforc.org/webreports/100/S100862.html",
      "state": "ME",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3ae",
      "summary": "Brightly lit fireballs appeared in the sky in a circle formation",
      "city": "augusta",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "brightly lit fireballs appeared in the sky in a circle formation Standing out side on the phone fire balls appeared in the sky forming a circle. Staying illuminated at least a min at a time. Second time lighting up in the same spot. I ran to get my mom.  By the time she made it out she had just missed it. About a min later they appeared once more on the opposite side of the street different formation",
      "link": "http://www.nuforc.org/webreports/097/S97557.html",
      "state": "GA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf75c",
      "summary": "Star like light moving slow with some impossble movement.",
      "city": "augusta",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "star like light moving slow with some impossble movement we saw a star like object move low and slow then it made 3 or 4 up and down movements that should be impossible for a aircraft. It laster looked to split into two lights but it was too far away for me to see it well after.",
      "link": "http://www.nuforc.org/webreports/095/S95812.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04d6",
      "summary": "A previously stationary \"star\" suddenly moved and then vanished.",
      "city": "augusta",
      "shape": "sphere",
      "date": "2013-02-04T00:00:00",
      "story": "A previously stationary &quot;star&quot; suddenly moved and then vanished. On the evening of Saturday, January 19, 2013, I saw something unusual. I was at Klondike Park, a sandstone-rich park in Augusta, Missouri, which is in eastern Missouri about fifty miles west of St. Louis.  The brilliant white sandstone is why it’s called Klondike Park because it sort of looks like the rocks are snow-covered. I was on a night hike. I was looking up at the stars, and it was a beautiful night for doing so, completely clear and far enough from civilization to where you could see a lot of them.  I believe I was looking up into the low eastern sky but I cannot guarantee that (I was looking up and to the right; if I had looked up and to the left I would have been looking at the Big Dipper and Orion). I happened to be looking at two ordinary stars, not very bright, right next to each other.  Since they were so ordinary, why I found myself fixated on them for more than a few seconds is a mystery. Anyway, it turns out that one of the stars was not so ordinary. Suddenly one of them starts moving straight away from the other, a very smooth movement. I thought, \"Oh it’s a plane,\" even though a few seconds before it had been completely stationary. Then, suddenly, it vanished! It was just gone. Now since it had been stationary I don’t see how it could have been a plane or a meteor or even a satellite. Barring any weird astronomical phenomena I am unfamiliar with, I would have to say that was some sort of flying object, and since I could not identify it, I guess that was a UFO. But was it an alien spacecraft of some sort? Who knows? I don’t. But I definitely could not identify it. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96044.html",
      "state": "MO",
      "duration": "~10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c05e4",
      "summary": "Bright white star like light and smaller red light alternated fading and blinking out and on under ceiling of solid cloud cover.",
      "city": "augusta",
      "shape": "light",
      "date": "2013-02-28T00:00:00",
      "story": "Bright white star like light and smaller red light alternated fading and blinking out and on under ceiling of solid cloud cover The sky was solid overcast 2/ 26/13 at 12:30 a.m. a bright white star-like light seen west of Augusta, GA.  No other stars, the moon, or objects in the sky were visible at this time.    It was seen for 20 minutes.  At first it was a single white light that was unmoving.  I thought it was an airplane but the light was in the same place for 10 minutes.   In the past plane lights would move into the landing pattern at either Bush Field or Daniel Field.   At that time a smaller red light was observed slightly south of the bright white light. The red light faded and blinked out then came on again. Just after that the larger white light faded and blinked out for 2 seconds and came on again.  The red light and white light repeated this two more times.  Then the red light blinked out and did not come back on.  The larger white light moved sharply up, down, left and right as if it were hopping or dancing.  Then stopped in prior position and was steady for another 2 minutes.   It faded off, came back on brighter than before, blinked out and then on two more times then faded out and was gone.  The observer has experience watching airplane traffic for 48 years.  The observer has been interested and an avid watcher of commercial and private aircraft, hot air balloons, meteorites and, meteor showers.  The observer is very familiar with the airport approach patterns in the Augusta, GA, area (Bush Field and Daniel Field).",
      "link": "http://www.nuforc.org/webreports/096/S96453.html",
      "state": "GA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0978",
      "summary": "I saw three bright white lights hovering in the same spot in a triangle formation.",
      "city": "augusta",
      "shape": "triangle",
      "date": "2014-03-18T00:00:00",
      "story": "I saw three bright white lights hovering in the same spot in a triangle formation. I was in the passenger set of my car as we were driving north bound down Boy Scout Rd.   To the left of my car I saw three bright white lights in a triangular formation.  At first I thought it was an airplane, but there was little to no motion.  The lights just hovered in place, keeping a triangular formation.   We kept driving but I could see the lights still in the same spot behind us.  Unfortunately, we drove far enough that I could not get another look at the lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107616.html",
      "state": "GA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ece",
      "summary": "7 flying bright orange balls of light on the sky at 9:20 PM.",
      "city": "augusta",
      "shape": "fireball",
      "date": "2014-03-21T00:00:00",
      "story": "7 flying bright orange balls of light on the sky at 9:20 PM. Me and my friend were studying and then behind the window I noticed 7 objects moving around in different directions, they were kinda yellow/red, for sure not planes, they were blinking a little bit but they were bright and moved in very different directions and then disappeared.   We called our 2 other friends to come to our apartment.  Then we've seen 4 of the same objects in the different part of the sky, just staying close to each other, looked like formation.   After ten minutes we noticed two of them, just for 3 seconds.",
      "link": "http://www.nuforc.org/webreports/107/S107963.html",
      "state": "GA",
      "duration": "30 minutes with breaks"
    },
    {
      "_id": "64d005f478aba2ec5a3c1050",
      "summary": "((HOAX??))  Quad-chopper sighting, perfect straight path for aprox 6-8 miles.",
      "city": "augusta",
      "shape": "cross",
      "date": "2014-02-21T00:00:00",
      "story": "Quad-chopper sighting, perfect straight path for aprox 6-8 miles, Was looking out the window of Medical College of Georgia hospital what I believe was around 11:00 AM.   I saw a quad-chopper (looks like the drones Amazon wants to use for delivering packages) fly over the south wing at about 200-300 feet in the air and head north-east.   It kept a perfect straight path with what seemed to be about 30-40 MPH for about 10 minutes.  Stayed straight until it went out of view range. ((NUFORC Note:  Source elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  We suspect that the report may be a hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107304.html",
      "state": "GA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1449",
      "summary": "Silver cigar shaped object crosses Augusta, Ga, sky silently around 7:15am 11/5/2013",
      "city": "augusta",
      "shape": "cigar",
      "date": "2013-11-11T00:00:00",
      "story": "Silver cigar shaped object crosses Augusta Ga sky silentlyb around 7:15 am 11/5/2013 While outside taking snapshots of the morning sky, I had seen a silver cigar shaped object in the eastern sky, no sound emitted, cross the sky from east to west keeping same altitude, estimated altitude around 25,000 to 30,000 feet.  The object was moving at the same speed during this sighting am guessing around 300 to 400 nmph. This object also gave sun reflection as it passed overhead, no sound whatsoever, then the object continued its westerly direction at same speed until disappearing from sight all while I was attempting to film this sighting. The filming showed nothing but the blue morning sky according to the first playback, my zoom was not on at the time though I had thought it was, my zoom only goes 4x, when I realized it was off, I had turned it on and set it to max, by then the object had traveled moreso to the west therefore a dot may appear once enhanced.",
      "link": "http://www.nuforc.org/webreports/104/S104134.html",
      "state": "GA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1bc4",
      "summary": "Four orange/red light appeared.",
      "city": "augusta",
      "shape": "circle",
      "date": "2014-07-20T00:00:00",
      "story": "Four orange/red light appeared. Four orange/red lights appeared one at a time and disappeared one at a time after all were lit.   Was over the Nationals golf course.   Lasted 5 seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111661.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ce0",
      "summary": "Flying circular craft in Augusta Georgia.",
      "city": "augusta",
      "shape": "circle",
      "date": "2014-06-24T00:00:00",
      "story": "Flying circular craft in Augusta Georgia At approximately 4:45 pm, while driving down Interstate 520 going south right past the 520/20 split, I saw coming east towards the south west a grey circular object.  It made no sound.  It was possible within 100 feet above my car.  I did not see any lights or markings on the craft.  At first I thought it was an airplane.   After it moved in front of my vehicle, I saw it was not a plane.  Just as I went to take a photo of it with my phone, it shot straight up into the sky at a tremendous speed.  I did not see it any longer.",
      "link": "http://www.nuforc.org/webreports/110/S110429.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c23d2",
      "summary": "There where 3 objects in an oval shape turned sideways, they illuminated in a orange yellowish color lights  in the sky, they were in a",
      "city": "augusta",
      "shape": "oval",
      "date": "2014-03-27T00:00:00",
      "story": "There where 3 objects in an oval shape turned sideways, they illuminated in a orange yellowish color lights in the sky, they were in a triangle formation for about 5 sec disappear and within 10 mins appeared again!  After the second appearance didn't see it again. ((NUFORC Note:  We suspect an evening sighting, not a morning sighting.  Hence, we have amended the time above to reflect a sighting at 21:30 hrs., not 09:30 hrs..  The witness elects to remain totally anonymous, and provides no contact information, so we are unable to contact the person to confirm the time.  PD",
      "link": "http://www.nuforc.org/webreports/108/S108042.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2527",
      "summary": "Bright orange globes moving randomly in the western sky during a rainstorm",
      "city": "augusta",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "Bright orange globes moving randomly in the western sky during a rainstorm During a rainstorm, 5-6 bright orange globes moving randomly.  Some moved erratically in a 90 degree pattern in the western sky.  There was no noise and ultimatley the pattern regressed in the western sky in a very uniform pattern",
      "link": "http://www.nuforc.org/webreports/114/S114965.html",
      "state": "ME",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c28b5",
      "summary": "Lights seen two times.  Different formations but all blinked out slowly.",
      "city": "augusta",
      "shape": "formation",
      "date": "2014-09-25T00:00:00",
      "story": "Lights seen two times.  Different formations but all blinked out slowly. I noticed the lights in the sky while at the corner of Kissingbower Rd. and Walden Dr.  There were two distinct lights that blinked off and on then disappeared completely.  As I stopped at a store a on Deans Bridge Rd. I saw them again.  This time there were 3 lights in a formation that disappeared on by one.",
      "link": "http://www.nuforc.org/webreports/113/S113677.html",
      "state": "GA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3321",
      "summary": "Black triangle with white lights at corners hovering over Furys Ferry Road in Augusta, Ga.",
      "city": "augusta",
      "shape": "triangle",
      "date": "2015-03-06T00:00:00",
      "story": "Black triangle with white lights at corners hovering over Furys Ferry Road in Augusta, Ga. Driving home from dinner with my wife and son, saw two bright white lights maybe 500 feet off the ground ahead of us.  I asked my wife what she thought and she said \"new cell tower.\"  I said they normally had red lights not white and we continued to watch.   As we got underneath it, we could see it was a dark triangle with bright white lights at the corners and a small blinking red light in the middle.  It was hovering just over to the side of the road, not moving, not making any sound.   I slowed down and watched it, it seemed to be tilting as I watched.  There was a median so I couldnt turn around right away, came back at it from the other direction less than a minute later and it had sped off, quickly heading north, if I'm not mistaken.",
      "link": "http://www.nuforc.org/webreports/117/S117446.html",
      "state": "GA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c34d8",
      "summary": "Light moving like satellite suddenly fades out and disappears",
      "city": "augusta",
      "shape": "light",
      "date": "2015-03-13T00:00:00",
      "story": "Light moving like satellite suddenly fades out and disappears. I was on my front porch looking up at the stars like every night looking up. I thought I saw a satelliteit.  It was moving like one.  Me and my wife are interested in looking at the stars.  so I open the door real quick and had my wife come out and look at it.  I pointed at what I thought was a satellite and it suddenly started to fade out from a white light to a dim blue light and disappear.   I want to remind you the skies are completely clear no cloud cover.",
      "link": "http://www.nuforc.org/webreports/117/S117720.html",
      "state": "ME",
      "duration": "0.34"
    },
    {
      "_id": "64d005f478aba2ec5a3c37cc",
      "summary": "What was this? I've never seen anything like it in person.",
      "city": "augusta",
      "shape": "unknown",
      "date": "2015-01-16T00:00:00",
      "story": "What was this? I've never seen anything like it in person. I took my daughter to the mall shopping for her birthday coming up.  As we were leaving, my daughter pointed out a light in the sky and said, \"Hey mom, what is that?\"  Let it be known, I have never seen a UFO, though I have studied the phenomenon in depth.  My children are teens and are aware of this too.  We are always skywatching when we are out and about but don't take time out of our day to do this.   I'm always looking up due to what I know has been occurring around the world in increased frequency.   Anyway, it was far enough away to not be able to make out a true shape but very large.  It was not a star, it was not an airplane, it was not a tower, airport, anything like that.   I'm a huge skeptic so I went through all of the possibilities internally...nothing fit.  There was a smaller light that seem to be fading in and out and zooming into the craft and away again.  We decided to follow it.  It was only hovering at first but then it began to move slowly away. I finally found a dark road and have two pieces of footage.  The craft was further away from us at this point and began to change colors from green, red, blue.  The little light (possible craft) was still going away from it and going back in to it but at this point it was so far away it could have been a star.   At the mall, it was pretty clear and large.  Well clear enough to know it wasn't a star, satellite, or anything remotely close to what I've ever seen in the sky on earth.   It was hovering again on the second footage.   I would like to have this footage analyzed.  How can I get someone to do this?  I want to know what this was?",
      "link": "http://www.nuforc.org/webreports/116/S116632.html",
      "state": "GA",
      "duration": "I don't know"
    },
    {
      "_id": "64d005f478aba2ec5a3c39a9",
      "summary": "I was coming home from work when I noticed 3 bright lights (red, blue, green) that where flashing in pattern.",
      "city": "augusta",
      "shape": "triangle",
      "date": "2014-12-18T00:00:00",
      "story": "I was coming home from work when I noticed 3 bright lights (red ,blue, green) that where flashing in pattern.  The craft was stationary at 120°SE.  Over the course of and hours it has slowly moved upward as if it's getting farther away.  It was silent and very bright lights.",
      "link": "http://www.nuforc.org/webreports/115/S115995.html",
      "state": "GA",
      "duration": "30 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3c40d2",
      "summary": "Jetblack/Triangle/cone shaped/I could hear it before I saw it/No markings 10-20,000 ft altitude.",
      "city": "augusta",
      "shape": "cone",
      "date": "2015-05-22T00:00:00",
      "story": "Jetblack/Triangle/cone shaped/I could hear it before I saw it/No markings10-20,000 ft Altitude I went out back on the deck to get some fresh air after an argument with my wife and saw a black plane, I could hear it that's what caused me to look up, I have 20/20 vision very high def I saw what appeared to be a spy or recon plane at around 10-20,000 Ft.  Watched it for about 45 seconds then it disappeared into the clouds.  No markings just jet black, with no tail and was wing shaped I actually thought it was a hawk at first but definitely was an object.  I would have grabbed another witness but I was in temporary shock I couldn't believe what I was seeing.  I wasn't going to tell anyone since this sighting I was the only witness but I ended up telling and reporting it anyway.   My wife is Airforce it could be a security issue so I am reporting the incident.",
      "link": "http://www.nuforc.org/webreports/118/S118995.html",
      "state": "GA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4539",
      "summary": "Saw orange flashing light moving slow.",
      "city": "augusta",
      "shape": "flash",
      "date": "2015-11-26T00:00:00",
      "story": "Saw orange flashing light moving slow. ((NUFORC Note:  For some reason, witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124251.html",
      "state": "ME",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c58db",
      "summary": "Augusta, KS; 10:00pm; Light; 5 minutes; Appearing and disappearing big light.",
      "city": "augusta",
      "shape": "light",
      "date": "2016-05-20T00:00:00",
      "story": "Augusta, Ks ; 10:00pm; Light; 5 minutes; Appearing and disappearing big light I was responsible for closing at my job at Petsmart this specific night in October.  Little did I know, that this would be a night I will always remember.  As I got done closing, I walked to my red Mustang and proceeded to drive home.  I had a thirty-minute drive ahead of me because I lived in a small town outside of Wichita.   Between Wichita and Augusta there is a long stretch of nothing but fields and small businesses.  Once you leave Andover, it is nothing but darkness on the roads.  Outside of Augusta about five minutes, there is an airport.  Anyways, as I was driving, I was talking to my friend on the phone.  The Kansas sky was dark like every other day.  It was as clear as could be that night and there was not a cloud in the sky.   As I was getting close to the airport, I seen this big, white light in the sky.  I did not think much because I knew planes were flying at this time.  But as I was looking closer at it, I realized that this object or orbs that I had see! n was not a plane at all.  A big light slowly appeared.  Then another one would appear in front of it.  Then, the orb in the back would slowly diminish and appear in the front of the other one.  It did this about three times as it went across the sky and then it completely went away.  I knew it wasn’t a plane because planes are required to have red and green lights on them.  This had no lights period.  It was just a big light. It is hard to describe.   Anyways, about a minute later, the light appeared back in the same exact spot it went off.  Now, planes don’t disappear in mid air and then appear in the same exact spot.  The light did the same thing. There was a big light, then another one appear in front of that one.  The light behind would slowly disappear and then appear in front of the other.  I tried to capture it on video but I couldn’t because I was driving.   After about two times of appearing and disappearing, the lights disappeared for good.  It just vanished in thin air.  It didn’t speed away, just went off where I last seen it.  I was waiting for it to come back on because it did that before but it did not appear again.  Still till this day, people think I am crazy, but I know what I saw that night and it is something that I cannot describe.  I seen it with my own two eyes and I know for a fact that what I seen was not an aircraft at all.   I wish someone could give me some answers or explanations of what this could be.  Until I get some answers, I am fully convinced that what I seen was a U.F.O. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127417.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5de6",
      "summary": "I'm actually not sure of the actually date but I do know this particular event happen in August. My boyfriend and I go out looking as o",
      "city": "augusta",
      "shape": "triangle",
      "date": "2016-11-11T00:00:00",
      "story": "I'm actually not sure of the actually date but I do know this particular event happen in August.  My boyfriend and I go out looking as often as possible for UFO's and do see all kinds of activity in the sky. This night though was strange. We had been sitting outside for awhile waiting to see something, my boyfriend kind of yelled out \"come on let's see something!\", then mins later we stated seeing what looked like little stars flying very high in the sky over our house 1st south to north then eventually north to south, we saw over 10 of these \"flying stars\".  During all of this we all of a sudden saw a much lower triangle shaped craft that was all lite up at 1st and  then as it flew right above my house it turned all its lights off and then turned on 1 bright white light right down on my boyfriend and I and stayed there for what seemed 5 mins but it was prob more like less then a min! I was kind of scared so I backed up and then it disappea! red and my boyfriend and I saw a blue streak go across the sky, higher then where we 1st saw this craft. I don't believe we was abducted or anything but I do believe we saw an alien craft. Oh yeah there was no sound.",
      "link": "http://www.nuforc.org/webreports/131/S131032.html",
      "state": "ME",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e0d",
      "summary": "Last night as my boyfriend and I was walking home from kmart we looked up in the sky and saw a HUGE bright white light. It was way too",
      "city": "augusta",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "Last night as my boyfriend and I was walking home from kmart we looked up in the sky and saw a HUGE bright white light. It was way too big to be a star.  The weird thing about it was the part of the sky it was in was clear and to the west the sky was black and red....I'm aware that it could of just been the sun setting and the biggest star I've ever seen in my life but this was seriously creepy!",
      "link": "http://www.nuforc.org/webreports/131/S131031.html",
      "state": "ME",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6087",
      "summary": "Went out said too let the dog out and looked too the left and it was hovering and swinging back and forth..there was only one",
      "city": "augusta",
      "shape": "circle",
      "date": "2016-10-21T00:00:00",
      "story": "Went out said too let the dog out and looked too the left and it was hovering and swinging back and forth..there was only one ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130686.html",
      "state": "GA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6078",
      "summary": "Driving home on I-20, see really bright silver light/object in sky, seems motionless, look for a few seconds at it, then its gone.",
      "city": "augusta",
      "shape": "light",
      "date": "2016-09-22T00:00:00",
      "story": "Driving home on I-20, see really bright silver light/object in sky, seems motionless, look for a few seconds at it, then its gone. Driving home on I-20 towards Atlanta.  Sun is still out.  As I'm about to cross over Washington Road on I20, I look to my left to check traffic on Washington road and up in the sky a really bright silver object/light catches my attention.  Such a bright silver color/light that I cant make out its shape.  I stare at it for atleast 3 seconds.   Traffic is busy on I20 heading home so I check the cars around me and in front of me.  I look back to where I saw the bright silver object/light and stare at it for another 3 or so seconds wondering ((what)) it is.  It's very high up in the sky.   I check all the cars around me once again but the third time, I go to look at the bright silver object/light, its gone. No clouds in the sky that day.  I've never seen a plane have sun light reflect off it so brightly during the day.  No clue what it was. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130102.html",
      "state": "GA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6de2",
      "summary": "Have aliens from outside our planetary system made contact (a base of sorts) with Earthlings in the past.",
      "city": "augusta",
      "shape": "triangle",
      "date": "2017-09-05T00:00:00",
      "story": "Have aliens from outside our planetary system made contact (a base of sorts) with Earthlings in the past. This is not actually a space craft but rather a stone that has been carved in the shape of a head.  I have moved this item to a safe place but would be willing to have it examined at a convenient time and place for me  **  This is not an attempt to get money or notoriety but rather a sincere act to notify the public and or government if they are interested. ** While working in my yard I found a strange looking stone and upon closer examination, it turns out this is some type of carving, with facial features including some type of crystal where the mouth is, this is about the size of a large kitchen toaster, I have not had any test done yet, I am real busy. I am wondering if there are any experts in the field of geology, metallurgy, geo-physics or other specialized area that might be able to help identify it's origin. By the way, I do have a Master's in Psychology and am working on my second Master's in clinical Mental Health, so I am busy and would appreciate only serious inquiries, I did attempt to take pictures but because of the lighting that was available they did not come out but will take more if it is a requisite for verification of a possible encounter or landing.",
      "link": "http://www.nuforc.org/webreports/135/S135975.html",
      "state": "ME",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c71bf",
      "summary": "Was driving on Plains rd, Sussex Co.,  NJ. 1235pm. Looked to right in sky.  Seen a dark silver/grey craft. Top and bottom were flat.",
      "city": "augusta",
      "shape": "other",
      "date": "2017-07-14T00:00:00",
      "story": "Was driving on plains rd, Sussex county,  NJ. 1235pm.  Looked to right in sky.  Seen a dark silver/grey craft.  Top and bottom were flat,  sides were slanted.  Bottom was longer than top of craft.  Was gone in seconds.  Was way up in sky, just hovering",
      "link": "http://www.nuforc.org/webreports/135/S135082.html",
      "state": "NJ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cbe",
      "summary": "My wife and i were looking out window and noticed a light appear in the sky. It got brighter and didn't move for hours.The ufo was chan",
      "city": "augusta",
      "shape": "light",
      "date": "2017-10-05T00:00:00",
      "story": "My wife and i were looking out window and noticed a light appear in the sky.  It got brighter and didn't move for hours.  The ufo was changing colors. (yellow, red, and blue)",
      "link": "http://www.nuforc.org/webreports/136/S136565.html",
      "state": "GA",
      "duration": "Lights"
    },
    {
      "_id": "64d005f478aba2ec5a3c8002",
      "summary": "Ball Of Fire.",
      "city": "augusta",
      "shape": "unknown",
      "date": "2018-04-05T00:00:00",
      "story": "I am sitting here now, trying to compose myself over these events that are taking place! 2/years ago a similar event happenened and there can be no explaining logical for this!   I have recordings of a Ball of Fire at my Backdoor window, and am in dis-belief at what I have seen!  I am afraid to tell anyone for fear I am crazy or losing my mental capacity!  I am 52/yrs old and have never seen things like this or heard things like this!  It WILL NOT STOP!   I have never believed in this, but, after what I Have To Tell from What I Have Seen and Keep Seeing.  I Believe it to be not of this place I call Home!  Please Help!  I do not know what to do!",
      "link": "http://www.nuforc.org/webreports/139/S139327.html",
      "state": "GA",
      "duration": "17 days"
    },
    {
      "_id": "64d005f478aba2ec5a3c82d7",
      "summary": "Multiple Hovering Objects.",
      "city": "augusta",
      "shape": "other",
      "date": "2018-09-27T00:00:00",
      "story": "Multiple Hovering Objects. On Thursday, September 13, 2018, my friend and I were sitting out front of  my apartment building, probably around 1 a.m. or so and I noticed what at first glance looked like a star maybe burning out.  It had reds, greens, and blue tints to it and was flashing pretty steadily. I then realized what ever this is was definitely hovering somehow.  You could see it slowly moving from left to right.   When that caught our attention we finally decided to take a look at the sky and there were MULTIPLE objects in the sky that fit the same description.  Just looking at them you could see the flashing and hovering.  Some would just appear.  We have these little toy binoculars, that still work pretty good, that we started looking at the objects better and through that they looked as if things were coming out of them sort of like flares, they seemed long, like a trail of something entering into the atmosphere.  We noticed some made up a circle formation and then some were making u! p a triangle formation.  Then there would be groups of maybe six objects swarming around each other.  They were smaller and farther off so the way I can really explain it is when you see the gnats flying around a street light,  This was going on for a few hours.  I happened to walk outside about 6 a.m when the sun was barely out and there was one left in the sky and it was so bright as if the sun was bouncing of a metallic surface.  I was able to get a video of that one, I couldn’t figure out the shape but you could easily tell it wasn’t a plane or a satellite.  It almost looked like it was breaking off into smaller pieces and coming back to its original form but it was gone by the time the sun came all the way up.",
      "link": "http://www.nuforc.org/webreports/143/S143114.html",
      "state": "GA",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c84d5",
      "summary": "Large white, red and blue blinking light that moved left to right back and forth, then blinked out.",
      "city": "augusta",
      "shape": "light",
      "date": "2018-09-13T00:00:00",
      "story": "Large white, red and blue blinking light that moved left to right back and forth, then blinked out. I walked outside to let my dog out, and looked up at the sky while waiting for her.  I saw a rather large light.   I thought at first that it was a star, however it was too big for a star, and began blinking red and blue.  I thought then, that perhaps it was a plane, as that would not be uncommon.   However, the light began to move left to right, back and forth.  I attempted to grab my phone to record it, but my phone would not pick the image up.   It lasted 2-3 minutes and blinked out.  There was no more activity.",
      "link": "http://www.nuforc.org/webreports/142/S142937.html",
      "state": "GA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a88",
      "summary": "Was stargazing around 11pm or to 12am.  I saw rectangular shape like a car.  With dim lights hover about 20 sec., and then just drop.",
      "city": "augusta",
      "shape": "rectangle",
      "date": "2019-09-12T00:00:00",
      "story": "I was stargazing around 11pm or   to 12am.  I saw rectangular shape like a car.  With dim lights hover about 20 seconds and then just drop down behind.  A huge pine tree. It made no noise.  it just disappeared. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148750.html",
      "state": "GA",
      "duration": "20 seconds"
    }
  ]
}