{
  "city": "baltimore",
  "fetch_timestamp": "2025-07-12T14:26:38.252943",
  "record_count": 103,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b41f2",
      "summary": "\tIt was late in the evening and sometimes I go on my roof and try to see the stars when it's clear I then noticed a star that seemed to",
      "city": "baltimore",
      "shape": "other",
      "date": "2019-03-21T00:00:00",
      "story": "\tIt was late in the evening and sometimes I go on my roof and try to see the stars when it's clear I then noticed a star that seemed to get brighter.  The star actually grew in size.  Initially, my first thought was it was a comment (sic.  Comet) that I was seeing coming in straight on so I couldn't see the tail when it got to what I would say is double in size it just disappeared like somebody turned off the light.  So naturally, I was then staring at the sky and called my girlfriend to come to look but it was too late that's when I noticed what I first thought was two seagulls because they were a white silverish color and quiet.  After observing for 2 or 3 minutes they came in to focus and looked as to disc or could have been just round my view was from directly underneath.  They were at about 1000 feet and traveled very smoothly until they were out of site.  The whole event lasted about 10 min.  The disk was also witnessed by my girlfriend.   I and my girlfriend are in our 30's! and I would say we are the average well respected  working Americans. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145232.html",
      "state": "MD",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b46f5",
      "summary": "Multiple UFO's flying over Baltimore Inner Harbor",
      "city": "baltimore",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Multiple UFO's flying over Baltimore Inner Harbor We went out onto our rooftop deck which overlooks downtown Baltimore and the Inner Harbor.  In the distance, over the harbor, we saw multiple bright wight spots that were moving about quickly and erratically through the sky.  There was no pattern to the movements and the objects were moving too quickly and erratically to be regular aircraft.  We were also able to rule out some type of light show as there were no beams and no events scheduled in the Harbor.",
      "link": "http://www.nuforc.org/webreports/050/S50546.html",
      "state": "MD",
      "duration": "20+ Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4c04",
      "summary": "I noticed unusually bright red lights hovering silently over Baltimore last evening.  The bright red lights appeared to be in triangula",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2019-06-27T00:00:00",
      "story": "I noticed unusually bright red lights hovering silently over Baltimore last evening.  The bright red lights appeared to be in triangular formations.  I could not distinguish if they were individual objects in formation or triangular objects with very bright red lights in each corner.   I stood watching for several minutes until they were gone.  I never witnessed any air craft with such intensely red bright lights that hovers silently in triangular formation before last evening.   A friend visited me about a hour later who said that he had witnessed the same objects",
      "link": "http://www.nuforc.org/webreports/147/S147014.html",
      "state": "MD",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fd4",
      "summary": "White light turned  very bright 2 times ...then blinked out.  ((anonymous report))",
      "city": "baltimore",
      "shape": "light",
      "date": "2019-03-29T00:00:00",
      "story": "White light turned  very bright 2 times ...then blinked out. White Dot following 2 jets this object did not have Contrail like both jets, white dot got very bright 2 times then blinked out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145353.html",
      "state": "MD",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b544d",
      "summary": "It was around 8:PM and I was walking home,it was a full moon but something made me lookup, there was no noise, but an object came in fr",
      "city": "baltimore",
      "shape": "cigar",
      "date": "",
      "story": "It was around 8:PM and I was walking home,it was a full moon but something made me lookup, there was no noise, but an object came in front of the moon like a fat black cigar, and when it passed, I could see the moon thru the windows of the object.  This object was not an airplane, it had no propellar or wings. It was moving slowly. I can still see this to this day.   I was about 11-12 years old.  I am now 70 years old and this has stayed with me all my life.  I hurried home and told no one what I had seen, but I never forgot it.  I wish I had written down the date and time, but I know it was in the fall. ((NUFORC Note:  We have assigned an arbitrary date above.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61685.html",
      "state": "MD",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b568e",
      "summary": "Object was \"V\" shaped,white  with no rounded edges travelling south east in daylight.with no visible engines or markings.",
      "city": "baltimore",
      "shape": "chevron",
      "date": "2007-11-28T00:00:00",
      "story": "Object was \"V\" shaped,white  with no rounded edges travelling south east in daylight.with no visible engines or markings. I am USAF retiree widow. Low flying military helicopter drew me to window which quickly disappeared over trees but then I saw a white 'v' shaped object high in the sky (and for hight must have been airliner size at least) headed south east.   It was peculiar in that I had never seen or heard of anything like this also there seemed to be no recognizable bulge or indication of where an engine might be and no visible markings.  It looked just like a flying printed capital \"V' off a poster.  Very plain, no embellishments. (Sketch enclosed.) It was daylight so saw no lights.  Husband deceased at time so no imput was persued.  Figured it might be experimental but it was not like the 'V' shaped, small craft flown by the black man/pilot that flies into Westminster, MD, municipal airport occasionally where I live now virtually beneath the flightline. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59883.html",
      "state": "MD",
      "duration": "15mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a7e",
      "summary": "\"Jupiter Two\"-like spacecraft, flew noiselessly, slowly just over the field in our backyard.",
      "city": "baltimore",
      "shape": "disk",
      "date": "2007-04-27T00:00:00",
      "story": "\"Jupiter Two\"-like spacecraft, flew noiselessly, slowly just over the field in our backyard. My mother, my three oldest brothers, and I walked out of our house in the evening to drive to church to attend a Coffeehouse function (that’s what they were called).  It was evening and dark but not too late – I would venture to guess it was bet. 6:30 and 7:30pm.  We saw something that astonished us in the night sky.  Looking NW we saw a huge vessel that was not very high in the sky, over the field in the back of our house.  We lived on a court and there was a 3 or 4 acre field behind our house.  The UFO was about 500 feet up, moving very slowly toward the SE, noiselessly.  I have a very good picture in my mind of it – it largely resembled the typical UFO spacecraft, just like the “Jupiter Two” from the “Lost in Space” series.  On the bottom of the craft were large, lit panels.  We all remarked upon this – how amazing it was to see.  We knew instantly that what we were seeing was otherworldly.  It was so close, so large, and moving without sound.  After it departed, at a constant but slow speed, I don’t know why we didn’t just all go back inside and call the police.  I do remember that we went inside to tell my father what we had seen (he was home babysitting my little brother), but we then just proceeded to go on to church.  We all compared notes in the car ride to church, “Yep, it looked just like the Jupiter Two” we agreed.  At church we asked folks if they had seen it – only one or two people said they had heard there was some kind of large weather balloon in the area that was being tested.  This was no weather balloon.  It was directly over the field in our backyard.  I know what I saw.  I’d love to see it again sometime.  Hopefully I’ll have the presence of mind to videotape next time!  (I do not know the exact date of this event.  I thought the year had to be ’73 or ’74.  I just chose this date because I saw some other Baltimore entries.  Specifically we lived in the suburb of Pikesville, MD.) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55867.html",
      "state": "MD",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5cf6",
      "summary": "((NUFORC Note:  HOAX.  SLICE OF BREAD IN MIDAIR.  PD))   This Is another of many Photo's I Have Taken Of Them/They/Vistors.",
      "city": "baltimore",
      "shape": "cigar",
      "date": "2007-02-01T00:00:00",
      "story": "This Is another of many Photo's I Have Taken Of Them/They/Vistors This here is just one of many Photo's I have taken I hope someone gets back to me about these awsome photo's I have been taking. I am able to view these objects just about any day unless the weather is poor and even sometimes I am able to take photo's of them on bad days too! I randomly take photo's of these objects and have a large colloection of these visiting crafts. I am emailing you these photos so that they may be viewed. This particular photo I took at an easter event on 4-15-06 this is just one photo I took that day of many I caught on film that very same day!I hope this letter is taken seriously cuase these crafts are seriously in the photos and in our world. Anyone who believes we are alone is extremely naive. They are all over the place!!!!!!!!!!!!!!!",
      "link": "http://www.nuforc.org/webreports/054/S54868.html",
      "state": "MD",
      "duration": "One shot of many"
    },
    {
      "_id": "64d005f478aba2ec5a3b5eb7",
      "summary": "Strange lights dancing in a strobe pattern from west to east.",
      "city": "baltimore",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "Strange lights dancing in a strobe pattern from west to east. I was coming home from bowling on a crystal clear quiet night when I witnessed a cluster of lights strobing in red,blue and white moving east of Brandon shores Power plant.I kept driving and pulled over to the entrance of my neighborhood when I saw another approaching directly from the west to east the same type of strobe lights appearing and reappearing in strange directions up and down across and then darting.There was absolutely no sound whatsoever.I have never seen anything with this signature and I always look at planes.It was dark I couldnt actually see the object itself.It almost seemed to be rolling and then twisting.I have never seen a ufo until now and hope my case is not considered invalid.The object appeared to be 10-20 thousand feet high in the air.",
      "link": "http://www.nuforc.org/webreports/063/S63001.html",
      "state": "MD",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5fde",
      "summary": "UFO-approx 1965-67 Bowleys Quarters MD, Silent flat oval shaped, glowing softly, colored sphere.",
      "city": "baltimore",
      "shape": "oval",
      "date": "",
      "story": "UFO-approx 1965-67 Bowleys Quarters MD, Silent flat oval shaped, glowing softly, colored sphere. I was approx 5 or 6 yrs old (1965-67), we lived in Bowley’s Quarters in Maryland. Our house had a large open field that ended in woods. My aunt & uncle lived in the house next to us, large field separated our houses. I remember the weather being a cool summer evening; remember the grass being cool on my bare feet, light warm breeze, just before dark.  I was in my Aunts kitchen when my mother took my hand and followed my aunt into her back yard where the other children were, everyone was standing still, staring about 4-6 ft maybe at one, maybe more, flat oval shaped,  glowing softly sphere, that was silent. The colors inside reminded of the colorful swirls you see in a soap bubble. I remember thinking to myself if I could touch it my hand would go right through it. It felt like it was watching us too. I stood there holding my mother’s hand, motionless, like everyone for what it seemed like an hour, more likely 15-20minutes. I remember hearing someone whisper “what is it” but no one answered, maybe for fear it would go away, we all just stared in silence, then all of a sudden…like a camera flash, it was gone? I never recall our families ever talking about it? Maybe the older ones did. I’m now 45 years old, recently, talking family and friends about UFO’s unexplained things etc... I asked my older sister, who was there that night, if she'd remember the lighted sphere or was I just recalling a stupid childhood dream that stayed with me? She immediately replied, \"Oh my God!! That is so weird! I was just thinking of that the other day and telling a co-worker about it. I had never brought it up before, just one of those things, you store away until something brings it to mind. I though it would be interesting to know if anyone else in that area around the same time recalled seeing this ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56898.html",
      "state": "MD",
      "duration": "15-20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6090",
      "summary": "June, 1964; 9;00 PM: immense counter-rotating double domed craft only 100 feet above me",
      "city": "baltimore",
      "shape": "sphere",
      "date": "",
      "story": "June, 1964; 9;00 PM: immense counter-rotating double domed craft only 100 feet above me (Not sure of exact day in June of 1964, but it was early June) At 9PM I left a friends house from a Young Life meeting in the neighborhood of Rogers Forge on Hopkins Street (an upper scale row house community) to get some fresh air when I looked up into the sky.  About 100 feet above me was a huge hovering craft with a \"Capitol\" shaped dome on top and the same shape on the bottom separated by a ring.  It hummed as the top dome spun in one direction and the bottom in another.  It was as clear as day.  Each half of the craft had rows of lighted windows.  I had never heard of UFO's before, so there was no preconceived notion to create interpret anything in my mind.  Awestruck, I looked back into the house, where I saw a friend about to exit and called him to come see.  As he stood next to me and looked up, I asked him, \"Do you see that?\", pointing to the craft.  He answered affirmatively and described what I was seeing.  Thirty seconds later, it moved off at astounding speed directly in front of us. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50672.html",
      "state": "MD",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b633c",
      "summary": "Sunlight in the dark.  ((NUFORC Note:  Missile launch from Wallops Island, VA.  PD))",
      "city": "baltimore",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "Sunlight in the dark I was driving home from a party with four friends the sat morning before christmas around 7a.m.  When one of my friends said is that a plane.  I was driving n look up n there was this lit object moving very fast in the most metaphysical ways.  Up down n back around.  It stopped in the sky in the clouds n got bright as the sun.  it was still dark out so it lit up the sky.  this was very frightening.  it looked like a black canopy with a hole cut in it with light on the other side. I thought it might b a nuke.  Then I saw two fighter jets fly toward it then it dissapeared.  The smoke trail it left was incredible. Figure eights, zig-zags, then at the top a perfect 3d cube.  None of our phones would work to take a pic.  Well bout five to nine fighter jets began flying straight up then down and all over all morning.  I was in seven 11 parkin lot n pointed them out to bystanders, who at the time were oblivious.  they were shocked at the site of the fighter jets.  I was so excited by the incident, that i called my dad to tell him of the events, n to c if he could see the jets.  I called my exgirlfriend who lives in philadelphia, n she said there were a bout 8 fighter jets in the sky up there, this was around 9a.m.  My dad called back and said there had been a newsflash of the reports.  The media said that the government shot off two missles off of an island off of virginia.  They made no mention of why, and made no other mention of it.  They blamed the smoke trail on the weather.  The smoke trail itself was incredible because it sat in the air for a good ten minutes.   i have met six other people than my friends that witnessed the same event.  The fighter jets were in the sky until dark.  My exgirlfriend told me that she saw on the news that they were saying they released a new fighter jet that day, explaining why they were in the sky.  Y did the government shoot off rockets for no reason, then have fighter jets go after it.  The hole the others from the ohare airport describe sounds similar to ! the ligh t n how it dissapeared.  It was the most amazing thing my eyes have seen.  They cant deny the truth forever. 1 ((NUFORC Note:  Witness elects to remain semi-anonymous;  provides only telephone number.  The missile launch occurred at approximately 07:00 hrs. (Eastern) on Saturday morning, December 16, 2006.  We have corrected the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54614.html",
      "state": "MD",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6806",
      "summary": "January 17, 2008-6:15pm. Triangular shaped object hovering over Belvedere Square in Baltimore, Maryland.",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "January 17, 2008-6:15pm. Triangular shaped object hovering over Belvedere Square in Baltimore, Maryland. (In my location, witnessed by six people, including two Baltimore City police officers.) The object slowly moved to the horizon and disappeared, taking approximately fifteen minutes. The police officers stated there was \"no way\" they would report this siting. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61777.html",
      "state": "MD",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b680e",
      "summary": "Falling blue glowing light object from early morning sky.",
      "city": "baltimore",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Falling blue glowing light object from early morning sky. I seen an unknown blue light object falling from night sky down in a neighborhood early this morning as I was walking home. Now I always see falling stars( falling artroils),but never one with blue light. Could they have blue glow? Or the Unknown object is so far a mystery?",
      "link": "http://www.nuforc.org/webreports/054/S54147.html",
      "state": "MD",
      "duration": "Broening Hwy"
    },
    {
      "_id": "64d005f478aba2ec5a3b6aa5",
      "summary": "Four stationary light objects at Sunrise in the Eastern sky",
      "city": "baltimore",
      "shape": "cigar",
      "date": "2008-02-14T00:00:00",
      "story": "Four stationary light objects at Sunrise in the Eastern sky 1/26/08 Was outside, noticed four stationary light objects at sunrise. Clouds were moving, but objects were not. The photos were taken within seconds of each other and the pattern remained visible until other clouds covered them. Objects seemed to be translucent and all connected. Estimate the objects to be about a mile and a half in length.",
      "link": "http://www.nuforc.org/webreports/061/S61208.html",
      "state": "MD",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c07",
      "summary": "stayed still then shot straight up then disapeared then reapeared to the left at a higher attitude.",
      "city": "baltimore",
      "shape": "unknown",
      "date": "2006-07-16T00:00:00",
      "story": "stayed still then shot straight up then disapeared then reapeared to the left at a higher attitude. I saw the object north east of baltimore MD,it was shining and staying in one position then it went straight up super fast and then disapeared.as i keep looking I then saw the object to the left at a higher attitude then went straight up and disapeared.then i think i saw the object go left right up and down it was so fast super fast i was sure it was the object or just my imagination.the day was sunni afew clouds",
      "link": "http://www.nuforc.org/webreports/051/S51243.html",
      "state": "MD",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f70",
      "summary": "UFO Streaks Past the Moon",
      "city": "baltimore",
      "shape": "unknown",
      "date": "2008-03-31T00:00:00",
      "story": "UFO Streaks Past the Moon Tonight, I had mounted by Zakura astronomical binoculars on my tripod to watch the moon. It was partly cloudy, but the moon could be seen clearly for a few minutes every 10 minutes or so. I was watching the moon for maybe two minutes when I saw and oject zip by. If you can imagine the moon as a clock face, the object zipped from the 2PM position to the 11 o'clock position and out of view into the night sky. It was black...and left sort of a motion trail. It was too small to really get a visible on shape or size. I don't know if it was a UFO, but cannot think of anything else it could be given its trajectory path.",
      "link": "http://www.nuforc.org/webreports/062/S62278.html",
      "state": "MD",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f4a",
      "summary": "Stationary long objet with dome in middle.  Red/orange & blue lights kept shining with varying degrees of intensity.",
      "city": "baltimore",
      "shape": "egg",
      "date": "2006-07-16T00:00:00",
      "story": "Stationary long objet with dome in middle.  Red/orange & blue lights kept shining with varying degrees of intensity. Saw colored lights in the sky over Baltimore from my home across the Chesapeake Bay in Queenstown, MD.  Looked through monocular and saw stationary object with orange/red and blue lights which kept increasing and decreasing in intensity.  At first it looked flat and long with a dome shape in the middle, and then as if it turned slighty on it's side it looked diamond shaped and these same colored lights outling it.  After about 15 minutes it started to fade, but don't know if it was because of clouds moving in around it.  After it seemed to disappear, just to the left of it I saw a flash of white light and didn't see it again.  If anyone else saw this or something similar, please email me at jane@vanity-fair-prints.com.  I would like confirmation that others have also seen this ufo.",
      "link": "http://www.nuforc.org/webreports/050/S50585.html",
      "state": "MD",
      "duration": "15+ Mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b71f1",
      "summary": "white light over baltimore",
      "city": "baltimore",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "white light over baltimore i was watching a jet trail when i noticed what appeared to be the north star-- then the \"star\" moved rapdly to the left then to the right and disappeard-- within 2 minutes it appeared again then faded out",
      "link": "http://www.nuforc.org/webreports/058/S58931.html",
      "state": "MD",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b751c",
      "summary": "Stationary white light then picking up speed from the east to the west; arcing across sky; too fast for plane",
      "city": "baltimore",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "Stationary white light then picking up speed from the east to the west; arcing across sky; too fast for plane Stationary light (slightly larger than a star & slightly brighter); then travelled at an increasing speed from almost due east, going towards the south. Angle of original trajectory was about 20 degrees upwards towards the south and bending in a south-southeasterly direction; slowly, at first, then increasing its speed (was much faster than a plane, that would appear as the same size). Travelled in a small arc (towards the west), until going out of sight. There were no colors; just the bright white star-like dot. No sound (although it looked too high for any sound to be detected.)When first seen, it was slightly above the tree-tops in the east of my position. Could easily be seen, even with the ground lights below it. (Had a similar sighting about 10 months ago, which was not reported)",
      "link": "http://www.nuforc.org/webreports/056/S56152.html",
      "state": "MD",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b790c",
      "summary": "Silver dots in triangle shape at noon on Saturday",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "Silver dots in triangle shape at noon on Saturday I have no shades on my window, and often lay on my bed on Saturday morning, reading, thinking, fuming, laughing, etc... .   Well, I looked-up, and saw an object movie across the day-sky.   I thought, \"It looks odd.\"  I could only see three silver dots, in the shape of the sky as they moved at the speed of normal aircraft across the sky...maybe we make triangle shaped ships.   I could not see any body structure, just three dots.   Whitish-silver, but not glowing, metallic looking.  I could see the object, assume some light, but could not discount reflection...hologram?  It was windy, and it moved consistently, way high up. ((ADDENDUM FROM WITNESS)) Description: I am rewriting my previous report b/c it lacked clarity, but not due to misspelled words...due to my not proofing my own work until it goes out. Anyway, again, on Saturdays, I lay under unshaded windows, often until noon or so, after I go out for breakfast, thinking, reading, sleeping, fuming, laughing.   This Saturday, at around 12:00 PM, I looked up and saw three silver dots, smaller than the tips of my fingers moving in the shape of a triangle...less than a tenth the  size of the tips of my finger, that's how high-up it seemed...they moved across the sky at a normal rate of speed for a craft as high-up as this one.   I thought maybe the wind, which was kicking-up, had carried something skyward, so I watched until it went out of vision's range, but it wasn't an object kicked about by the wind...too regular...watched about a minute until it went out of view.   No solid object could I see, though upclose it might be solid, but just three dots.   Can't say it glowed...may have reflected...maybe holographic...maybe we have something new up in the sky these days.    Maybe it was how the sun hit, but it seems like the sun would have changed as it glistened across a metallic cover...not a light, but more of a reflection.  Whitish-silver.  Or, maybe, it was three very distant normal craft moving in perfect formation. I just don't know...they were close, though...if they measure less one tenth the tip of my finger, then the three together measured half, or less, than the tip.  ((END ADDENDUM)) ((NUFORC Note:  Saturday was January 23, 2007.  We have changed the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54901.html",
      "state": "MD",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7999",
      "summary": "quiet, close, super-sonic, white, round white light",
      "city": "baltimore",
      "shape": "circle",
      "date": "2007-02-24T00:00:00",
      "story": "quiet, close, super-sonic, white, round white light I was up late trading foreign currency on my computer, when i saw a light moving very fast across the western sky.  It was moving south at an incredible speed...much faster and quieter (complety quiet actually) than than the L-39 and F-16 jets i have encountered  during my life.  I am a licenced skydiver and canopy pilot with 603 jumps and have \"logged\" over a year of residental (night and day) time at airports.  I have been witness to close encounters with all sorts of conventional aircraft, and this event does not fit the bill...AT ALL!  I also love to (try so far) photograph shooting stars, and have witnessed many.  Some during the day, but most at night. They always have some sort of trail of either smoke or still burning fragments.   Also, when they are traveling in the lower atmosphere, they actually burn a more red color instead of the white plasma seen in the high atmosphere stage.  This I can say for sure...It had no tail, it was close (maybe 650 feet away at 60 degree angle to horizon), it was completly quiet.  it was traveling pefectly straight/level/south, the light looked the same coming and going, it was round, and the light (which was all I saw) had a very strange quality to it. It was very clean or pure looking, and didn't blink at all.  Like a giant l.e.d light, that had a sligly stronger output of blue spectrum.   I swear on all that is good in this world, that this is not a hoax, and that I have truthfully relayed all facts in this matter in the way that I understand them to have occured.",
      "link": "http://www.nuforc.org/webreports/055/S55137.html",
      "state": "ME",
      "duration": "2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e3d",
      "summary": "saw three lights in a triangle shape as I looked to the left I saw a single light following the others",
      "city": "baltimore",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "me and two friends were star watching that night when we saw three lights in a triangle shape as I looked to the left I saw a single light following the others lights. the three lights in front stopped. the fourth light joined the others and all four took off like nothing I ever seen before.  I saw this when I was 17 then and I still share this story with family and friends today I'm 47",
      "link": "http://www.nuforc.org/webreports/073/S73658.html",
      "state": "MD",
      "duration": "1minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b848e",
      "summary": "craft observed crossing Baltimore in Canton area observed from Fleet St traveling east/west",
      "city": "baltimore",
      "shape": "teardrop",
      "date": "2008-10-31T00:00:00",
      "story": "craft observed crossing Baltimore in Canton area observed from Fleet St traveling east/west The object came from an east west direction straight over Patterson Park towards the inner harbor. There were no sounds coming from the craft. A half moon neon bluish green shape was on the front of the craft. As it passed overhead you could see two brights lights on either side which could have been some sort of engine. It cleared the entire viewing span of the sky in less then 1 minute and appeared to be only a few hundred yards above the earth. I was not going to tell anyone this until I saw the same type of reports on this website. I can say for sure it was not a helicopter nor was it a plane. It was not like any aircraft I have yet to see.",
      "link": "http://www.nuforc.org/webreports/065/S65320.html",
      "state": "MD",
      "duration": "60 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b84da",
      "summary": "Globe of white light zooms directly at me while I look out my window at night. veers off and zooms away.",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2009-03-19T00:00:00",
      "story": "Globe of white light zooms directly at me while I look out my window at night. veers off and zooms away. I was laying in my bedroom trying to get to sleep. There are large windows that extend across the entire south wall of my room.  I rolled over to face the south and look out the window.  About forty yards away, floating in my backyard, was a ball of light.  It was about the size of a large globe.  The light was a bright, pure, white.  Before I could hardly register what I was seeing, the light zoomed directly at me with incredible speed. Astonishingly, the globe was silent, and did not seem to disturb the night air.  For a split second I was face to face with this thing.  I jumped because I thought it was going to hit me.  Then it veered off quickly to the right and moved rapidly around the side of my house and was gone.  I tried to run into the other room to see if I could still see it, but I never saw it again.  This incident was the weirdest thing that's ever happened to me.  I did not believe in UFOs.  I sill don't know what to make of what I saw.  Must be either spiritual or extraterrestrial.",
      "link": "http://www.nuforc.org/webreports/068/S68286.html",
      "state": "MD",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8962",
      "summary": "it was a large aurora shape moving in a non comon aircraft way manmade it also had color type lights",
      "city": "baltimore",
      "shape": "oval",
      "date": "2008-10-31T00:00:00",
      "story": "it was a large aurora shape moving in a non comon aircraft way manmade it also had color type lights As i was stting outside my patio w/my laptop i looked up to the sky and my eyes where exactly looking straight in to the location of object it was moving side to side an up down way it had a aurora type of light around it cmpletely and i called my mother outside so she could witness what i was seing ,within seconds after this it took of in to the at an incdedible speed.this is my second expirience in my life.Shortly after an airplane was flying almost in same area but at higher altitude seem like.AS i told my mother to get my camara it was to late.from now on ill be readyi love it",
      "link": "http://www.nuforc.org/webreports/065/S65459.html",
      "state": "MD",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a80",
      "summary": "Strange looking craft and possible lost time",
      "city": "baltimore",
      "shape": "unknown",
      "date": "",
      "story": "Strange looking craft and possible lost time   I’m not sure on the exact date but it was when I was 6 or 7 which that would make it around 1967 or 1968 and the month/day/time I’m not sure of either.  What I am sure of is myself, brother, mother and father were standing in our front yard in Mt Washington, Maryland, and we saw this craft slowly drifting across in front of us about 300 feet away and 300 feet up.  It was not an airplane, helicopter, glider, balloon, inflated object (hoax) or anything we have ever seen.  It reminded me now of the Jefferson airplane blimp if you ever seen that on their album or poster.  It sort of looked like a cross between a box kite and balloon but was not either of those at all.  It was close enough that I remember seeing the operator of this craft staring at us, as it drifted by.  Time seemed to stand still and it also seemed as though we were under the control of the operator of this craft--very, very strange indeed.  I think about this often and would love some answers.  I have other experiences which have happened later on in my life which really make it seem as though I’ve been abducted several times.  I honestly don’t think these experiences were dreams and probably should have my brain tapped into to see. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64499.html",
      "state": "MD",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b93ad",
      "summary": "Square and round UFO anomalies imaged over Baltimore Maryland",
      "city": "baltimore",
      "shape": "rectangle",
      "date": "2009-03-19T00:00:00",
      "story": "Square and round UFO anomalies imaged over Baltimore Maryland While Taking pictures of a friend in Baltimore, directly by a Reservoir. I took several pictures..nothing flew by us at all, however in my pictures are square and round luminous objects.In one sample these abjects are together and moving, in the next image, the square object is stopped above us, and the round object is 100 feet above the center of the Reservoir. We both would have noticed if something had flown by? However; there are other images at this location which show orange streaks of light flying above the buildings in the distance, orange like that encountered http://www.nuforc.org/webreports/065/S65053.html http://www.nuforc.org/webreports/065/S65048.html Forensically sampled in HD 1080 i using D700 Nikon. Objects imaged were 100% silent, we would have seen them flyby? This is very unusual, imaged exceptionally well.",
      "link": "http://www.nuforc.org/webreports/068/S68576.html",
      "state": "MD",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b97dd",
      "summary": "Two UFO\"S  in flight over Baltimore leaving trails no sound that influence me.",
      "city": "baltimore",
      "shape": "oval",
      "date": "",
      "story": "Two UFO\"S  in flight over Baltimore leaving trails no sound that influence me. They flew at a angle about 45 degree from us. They were 2.  One lag to the right of the first.  No sound.  They looked oval, but I believed they were circular,because of the angle we were observing.   They were a dim yellow orange color.  I believe their color glow were not intentional, but was due to friction of the air.  Large and beautiful.  Their edges were sharp and defined.  They left a trail that was thin like white thread about 2.5 their length and at the end it disputed with a short white wiggly trail.  Mother and sister and others were the observers.  I was too young to do anything then, but it influence my career in physics.   I know someone must have reported it.  I can't find any information of UFO over Baltimore.  Please Help,  Thanks ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  We do not know how we can help, except to invite everyone who has been witness to a UFO to submit a written report of the event.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69485.html",
      "state": "MD",
      "duration": "8 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b97fb",
      "summary": "((HOAX??))  white lights over baltimore..",
      "city": "baltimore",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "white lights over baltimore.. I was sitting at my computer on the third floor of my row house I noticed an aircraft flying in front of the window. This was odd because aircraft was flying low within the city. I looked out the window into the sky and saw three lights flickering in the sky. I got out my binoculars to see what the object was. It was hard to see because it was hovering and moving very quickly in and out of binocular view. The original aircraft was joined by two others who circled the orb's location for about 90 minutes. Another craft came into view quickly with three candlelight colored lights. It was chased off by the aircraft to the northwest ((NUFORC Note:  Date is flawed.  Hence, possible hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67374.html",
      "state": "MD",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a7e",
      "summary": "U.F.O SEEN IN HAMPDEN IN THE FALL OF1995",
      "city": "baltimore",
      "shape": "disk",
      "date": "2008-07-05T00:00:00",
      "story": "U.F.O SEEN IN HAMPDEN IN THE FALL OF1995 I HAVE TOLD THIS STORY TO ALL MY FRIENDS AND FAMILY AND NOW I'M TELLING IT TO YOU! IT WAS FALL 1995 AND I WAS 16 & MY BROTHER WAS 13,WE WERE AT THE SUPER FRESH IN HAMPDEN IN THE PARKING LOT ON OUR WAY HOME,WHEN MY BROTHER ASK ME IF A BRIGHT LIGHT IN THE SKY WAS THE NORTH STAR,SO WE WERE LOOKING UP IN THE NIGHT SKY WHEN SOMETHING CAUGHT MY EYE,SOMETHING STRANGE WAS FLYING AROUND THE T.V TOWERS LOCATED IN MEDFIELD (VERY HIGH T.V STATION TOWERS WITH LIGHTS ON TOP CHANEL 13,11 AND 45 HAS IT'S OWN TOWER, SO IT'S TWO TOWERS NEXT TO ONE ANOTHER)WE STOPPED AND KINDA LOOK AT IT AND DIDN'T KNOW WHAT IT WAS,SO WE CONTINUED TO WALK HOME,WHEN WE NOTICED A LIGHT AT FIRST COMING FROM BEHIND US ALL THE WAY TO THE SIDE OF US TO THE FRONT OF US THEN IT JUST STOPPED AND HOVERED THERE.A FEELING OF WHAT IF THIS THING TAKES US OR DOES SOMETHING TO US,WHO WOULD HELP???I KEEP ASKING MY BROTHER DO YOU SEE THAT!!!AND HE ANSWERED YES I SEE IT,WE SAID A FEW THINGS TO EACH OTHER LIKE WHAT IS THAT,OH MY GOD...THE U.F.O WAS SAUCER SHAPED WITH WHAT LOOKED LIKE WINDOWS OF SOME KIND ALL AROUND IT,THERE WAS TWO LIGHTS IN CIRCLING IT ONE RED AND ONE BLUE GOING IN THE OPPOSITE DURATION OF EACH OTHER,IT MADE NO NOISE AND MOVED LIKE NOTHING I'VE EVER SEEN BEFORE IN THE SKY BEFORE,IT WAS NOT A PLANE,NOT A HELICOPTER,IT WAS SOMETHING I'VE EVER SEEN BEFORE AND I KNOW IT WAS NOT OF THIS WORLD.IT BEGAN TO MOVE TOWARD A RETIREMENT HOME ABOUT 15 STORY'S HIGH AND IT WHEN RIGHT OVER IT SO CLOSE TO THE TOP OF THE BUILDING IT LOOKED AS IF IT WAS GOING TO LAND,ONCE IT WAS OUT OF OUR SIGHT WE STARTED TO RUN HOME AND ONE WE GOT THERE WE TOLD MY MOTHER WHAT HAPPENED AND WHAT WE JUST SAW,AND SHE WAS LIKE SURE YOU DID,IN A TONE LIKE SHE DIDN'T BELIEVE US,BUT WE KNOW WHAT WE SAW AND THE QUESTION IF UFOS ARE REAL HAS BEEN ANSWERED FOR ME,THEY DO EXIST AND THEY COME AND GO AS THEY PLEASE IN & OUT OF OUR PLANT.IT'S SCARY TO THINK OF THE UNKNOWN,BUT THERE IS SOMETHING AMONG US NOT OF THIS PLANET.SEEING IS BELIEVING!!!",
      "link": "http://www.nuforc.org/webreports/063/S63983.html",
      "state": "MD",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9bb0",
      "summary": "At about 8:30 on Tuesday, October 10, I looked out the third story window of my dorm room and saw a really bright white light that had",
      "city": "baltimore",
      "shape": "changing",
      "date": "2008-10-31T00:00:00",
      "story": "At about 8:30 on Tuesday, October 10, I looked out the third story window of my dorm room and saw a really bright white light that had flickers of red and almost seemed to be rotating, far out over top of the trees. It seemed stationary at first, then it started moving very slowly side to side...as I kept looking, I could see what first appeared to be an airplane coming in from the left, but when I looked at it closer there were a series of white and red lights that were flashing side to side - it was small from my angle, but I could still tell it wasn't a plane. It came in fairly near to the first bright light and stopped in mid air, then started getting brighter and brighter like someone was turning on a light switch. They both stayed stationary, and alternated between dimming and getting stronger. Then, out of nowhere, a light just flickered out of the darkness and appeared, creating a triangle - one that started moving slowly in formation, all of the lights together. Then it changed shape a bit as each light moved, and a couple of them flickered out...weirdly, though, the one bright light was still there (it never went away until the very end). For the next hour or so, more and more ships or whatever they were would come in...at one point, there were five of them, all really bright and at all different levels of the sky. These ships, again, looked like airplanes at first - but they would change direction, go directly vertical in the air, and also stop completely and become stationary. Many times, the lights would also descend below the trees so that I couldn't see them, making them too close to the earth to be a plane. Occasionally they would all go away and I would think that it was over...only to look back out a minute later and see another triangle. About an hour and a half into this, I went out to the hallway of my dorm and called 5 more people in, all of whom saw the same thing. So with me and my roommate, that makes 7 witnesses that I now know of, and I think they were going to! tell mo re people as well. The climax was near the end, when there were actually five lights that made a large V-formation, two on either arm near the top and one in the center. It very slowly rotated, and then the lights went out. This just stopped happening about five minutes ago...actually, wait - I just looked back out again and there are two more lights back in the sky, with the same pattern as before. Overall now, this has been going on for two hours.",
      "link": "http://www.nuforc.org/webreports/066/S66105.html",
      "state": "MD",
      "duration": "3-4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3ba701",
      "summary": "Large light traveling east to west, no sound, then flashed and instantly disappeared",
      "city": "baltimore",
      "shape": "oval",
      "date": "2008-08-12T00:00:00",
      "story": "Large light traveling east to west, no sound, then flashed and instantly disappeared Unidentified object/light in sky  On Sunday night August 3 2008 between 10-10:30pm EST over a section of Baltimore City, Maryland I witnessed an extremely unusual event.  We often see and hear helicopters as we are in an urban area and just a few blocks from a major shock trauma center so there is much activity.  This night however as I sat on my deck I noticed to my left in the eastern sky what appeared to be a low helicopter heading west, the bright light on it however was larger than normal and was of a light green color which I’ve never seen in the three years of living here.  As it got closer to being overhead it appeared to be oval shaped and I realized there was absolutely NO NOISE, no engine sound, and no propeller sound.  All at once the light seemed to flash one time and go dark, completely dark, nothing, not a sound.  I mean it just went out as if someone had turned off a switch.  It was incredible.  And in the sky where the light had just been extinguished, there was nothing but clear sky. Can anybody give me any explanation for this?   Thank you.",
      "link": "http://www.nuforc.org/webreports/065/S65026.html",
      "state": "MD",
      "duration": "Approx 45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6bd",
      "summary": "Large object that changed colors in night skies over Baltimore,Maryland.",
      "city": "baltimore",
      "shape": "teardrop",
      "date": "2008-08-12T00:00:00",
      "story": "Large object that changed colors in night skies over Baltimore,Maryland. It was Sunday, August 3, 2008, at approximately 9:40 p.m. just outside the Baltimore City limits, when I saw in the eastern sky what I thought was a headlight of a plane coming towards me. It was the size of a large star but, as the object came closer overhead, it grew almost to the size of a full moon. It suddenly veered off towards the south and only a white tip, the size of a large star, was visible with the exception of a black rectangular shadow that seemed attached to the tip. There were small sparks/flames from the tip (like a firework}. It moved exceedingly rapidly.  It then vanished for a split second. Suddenly, in its place appeared a huge, clearly defined horizontal teardrop shaped object--with 2 extending tips on each end at the middle - that was a brilliant orange. This object was the size of at least two (2) full moons not including the tips. The object was not moving.  Just as suddenly this entire object turned beautiful neon green. The shape did not change nor did object move. Then, all of a sudden there appeared, at the top middle and middle rear part of the object, what appeared to be cartoon lightening streaks. In other words these streaks were jagged, had width but were very small in comparison (approximately 3 - 4 regular stars in length). They were gold in color. They did not move nor did they glow. They did not seem like rays and their shape was clearly defined. Just as suddenly the entire object completely disappeared without any trace. There was no noticeable sound at any time. This entire episode lasted approximately fifteen (15) minutes",
      "link": "http://www.nuforc.org/webreports/065/S65005.html",
      "state": "MD",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba703",
      "summary": "Orange Disc anomaly imaged in HD over trees in Baltimore Maryland",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2008-08-12T00:00:00",
      "story": "Orange Disc anomaly imaged in HD over trees in Baltimore Maryland On August 03, 2008 along with 18 other individuals, witnessed a fast moving bluish green sphere, which was on fire, though the flames were green, streak through the sky and then disintegrate. I grabbed my camera and pointed it in the direction of the anomaly as it disintegrated. And took an image. What I imaged was not seen. Above the tree tops was an orange disc with several translucent discs in formation?",
      "link": "http://www.nuforc.org/webreports/065/S65053.html",
      "state": "MD",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baa90",
      "summary": "White Rectangle no wings or windows climbed fast at steap angle from below clouds then into clouds",
      "city": "baltimore",
      "shape": "rectangle",
      "date": "2010-11-21T00:00:00",
      "story": "White Rectangle no wings or windows climbed fast at steap angle from below clouds then into clouds Time:   6:10 pm EST 09-09-2010. Location:  Baltimore Maryland. Over Baltimore City east side near Harford rd and 25th street near Clifton Golf course.  UFO appeared to be coming from the direction of the Montebello lake fresh water shed and moving south towards Clifton park area around 25th street. Description: Rectangle, square edges not rounded. White in color without marking or windows. It  was a soild object not a light or reflection. Movement: UFO was low in the sky about two miles in front of me. I was facing east on 25th about 1o miles west of Harford road. I belive it was moving from the north to the south and climbing when I first saw it. It continued to climb at about a 45 degree angle while moving to the south. I watched  it for about three seconds before it disappeared into a fluffy white cloud. It moved fast and  steady at an angle more steap then an airplane would climb.",
      "link": "http://www.nuforc.org/webreports/077/S77745.html",
      "state": "MD",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3badc7",
      "summary": "Three white lights flying in formation.",
      "city": "baltimore",
      "shape": "other",
      "date": "",
      "story": "Three white lights flying in formation. Three white lights similiar in magnitude to Orion's belt were seen travelling together. Distance was above 30,000 feet. Lights were emitted facing the ground, not in the direction of the craft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77046.html",
      "state": "MD",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb16a",
      "summary": "Recurring Sighting Over Parkton Maryland July 27th thru 30th.",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2010-08-24T00:00:00",
      "story": "Recurring Sighting Over Parkton Maryland July 27th thru 30th. Over Northern Baltimore County, July 27, 28, 29 & 30 2010.  Recurring each night between 11:00pm & 11:30pm.  Western sky, just above horizon, to the left of where the sunsets.  This white light begins as a speck in the sky, then quickly grows bigger & brighter within seconds.  It lingers for approx 2 seconds, it then moves to the right before it gradually fades out.  On  July 27th it was spotted for the first time by my daughter.  July 28th, it appeared twice, this time I saw the second appearance at 11:19pm.  The following night, July 29 it appeared 2 times at 11:19pm, and again at 11:29pm.  Last night, there were 5 appearances, beginning at 11:05 and ending at 11:29.  I believe it will happen again tonight and I just hope someone else reads this, see it and has an explanation.  Height approximately 10,000 feet.  My location is on York road in Parkton MD (Baltimore County) I am just 2 miles from the Pennsylvania line.",
      "link": "http://www.nuforc.org/webreports/076/S76904.html",
      "state": "MD",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2a2",
      "summary": "UNBELIEVABLE!",
      "city": "baltimore",
      "shape": "circle",
      "date": "2011-04-03T00:00:00",
      "story": "UNBELIEVABLE! Extremly bright light hovering with a distinct red laser for about 1 min.  Then red laser disappeared and the brightness of the craft dimmed and then brightening continously.   Was traveling at high speeds faster than any helicopter or airplane I ever saw.   Then vanished in thin air!!!",
      "link": "http://www.nuforc.org/webreports/080/S80682.html",
      "state": "MD",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb850",
      "summary": "Orange orb floating over Baltimore",
      "city": "baltimore",
      "shape": "light",
      "date": "2010-08-30T00:00:00",
      "story": "Orange orb floating over Baltimore An unexplained orange light was observed by over 15 to 20 patrons on the roof terrace of a nightclub in Baltimore, MD, at approximately 12:15 AM on Sunday, August 29, 2010. I first noticed an unusual glowing orange shape in the sky, perhaps a few thousand feet above the roof of the club, about 80 degrees above the horizon.  I then looked around to see if others had seen the object, and noticed that several other patrons were already staring skyward.  We began to ask each other if we were seeing the same thing, and if we had any idea what it was. My initial reaction was that I was seeing some sort of balloon suspended in the sky with a light shining on it.  However, I quickly realized that the light was being emitted from the object itself.  I felt very strange as I stared upwards in disbelief along with several others.  The orange orb appeared to be changing its shape.  Its movements during this time are hard to describe, but seemed to be pulsing. The nightclub featured many patrons with glow sticks and other flashing lights.  A DJ was playing electronic music from the roof terrace.  I began pointing at the object with two glow sticks to help others see what I was talking about.  At this time, it began to pull back further up into the sky.  The light became dimmer and it moved near what appeared to be a star in the sky, slightly to the west at about 60 degrees above the horizon. Over approximately the next twenty to thirty minutes, the orange glowing orb would generally move in a methodical fashion between several stars / planets in the night sky.  Sometimes it would move slowly and deliberately, while other times it would move in quick movements.  On one occasion, while pointing the light out to another individual, we watched as it slowly approached a star, and then made a semi-circle movement around the star, and then proceed in a straight line.  Based on my own amateur use of a night sky computer program, I believe that this star may have been Altair. I tried to take a picture of the object with my phone's camera. The object did not appear on the camera, however, an unexplained square orange shape appeared on one image, which I would be happy to provide if needed.  I did not see any square shapes with the naked eye. At least 15 to 20 patrons witnessed the same event over the course of approximately 20 to 30 minutes.  After I went to find others and return, patrons could no longer locate the object. The coordinates of the sighting location are 39.293' North, 76.611' West. I am currently a ((deleted--graduate)) student at a university in the Washington, DC, area.",
      "link": "http://www.nuforc.org/webreports/077/S77510.html",
      "state": "MD",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb92c",
      "summary": "Sighting of capsule shaped object, front and back identical with glowing light with a dark middle space.",
      "city": "baltimore",
      "shape": "oval",
      "date": "2010-07-10T00:00:00",
      "story": "Sighting of capsule shaped object, front and back identical with glowing light with a dark middle space. On July 3, 2010, 9:15 PM, I was in my back yard, between the barn and the house.  I have four bats that come out at night and was watching them eating insects.  Something caught my eye and it looked like it might be a half mile up in the sky. The object was not exactly oval shaped, but not really cigar shaped, but rather like a capsule. The back half was lit, but not with a light bulb.  The middle section was dark, and the front was identical to the back half lit, more glowing.  There was no sound, no wings, no gondola, and it appeared to be moving as if by equipment, and not the wind. I watched for approximately 4 minutes.  This object was going from approximately north to south. It disappeared by just going away in the distance. Also, it the light was not brought on by the sunset, as the sun was already down for the night. To give an estimate of how large this object may have been if on the ground it is hard to say, but my estimate would probably be in the 25-30 feet range, the height maybe 8 feet or so.  My neighbor asked me, when I told him of this, wanted to know if there were any smaller lights on it, such as what airplanes use, and there were not.",
      "link": "http://www.nuforc.org/webreports/076/S76241.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb961",
      "summary": "Circular white light flies over Baltimore on July 4th",
      "city": "baltimore",
      "shape": "circle",
      "date": "2010-07-10T00:00:00",
      "story": "Circular white light flies over Baltimore on July 4th On July 4th, at approx 9 pm, 9 of us were sitting on a porch on Eastern Ave across from Patterson Park waiting for the fireworks to start.  It wasn't completely dark yet and we were looking up because of fireworks and helicopters.  I saw a light above that was a circle shape, the light was white.  It was very high in the air, way too high to be a helicopter with a spot light on, and was definitely not a plane.  I don't know the exact direction, but it came from the inner harbor area, and went over Patterson Park.  I asked everyone to look up at the light and everyone agreed it was definitely not a helicopter due to how high it was.  It seemed to be in the height of where commercial planes fly, but it was definitely not a plane.  It was about a pen cap size, definitely bigger than a star or a planet you can see with your eyes.  It moved slowly, it didn't zig or zag, just in a slow fluid way.  Then, towards the end, it was hard to see as it was like it was shimmering out of sight.  You really had to look for it to find it towards the end, then it just disappeared.  It was a clear night with barely any clouds in the sky so it wasn't like it disappeared behind a cloud. The light, was very solid in the center, then it was like a very slight black ring, and more light, almost like a halo around the center light.  I hope that makes sense, I feel like I'm having a hard time explaining it",
      "link": "http://www.nuforc.org/webreports/076/S76331.html",
      "state": "MD",
      "duration": "about a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe55",
      "summary": "On video",
      "city": "baltimore",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "On video I saw what appeated to be a plane. Flying at a steady pace pause anjod stay still f¡or a hour or so. Slo",
      "link": "http://www.nuforc.org/webreports/084/S84945.html",
      "state": "MD",
      "duration": "120 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc07c",
      "summary": "Rotating circular object with blinking lights hovers over I-95 in Maryland",
      "city": "baltimore",
      "shape": "cigar",
      "date": "2012-01-12T00:00:00",
      "story": "Rotating circular object with blinking lights hovers over I-95 in Maryland While driving I-95 North toward Baltimore Between 100 and 195 I witnessed an unidentified object flying over the interstate.  The interstate became very bright as this circular object moved slowly hovering over the vehicles.  It had bright white lights which were blinking with a few colored lights and was spinning in a circular motion heading south toward Elkridge/Jessup, MD.  It was so close that there was no doubt that it was an UFO. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86021.html",
      "state": "MD",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc225",
      "summary": "Object in mid air with 3 distinct lights",
      "city": "baltimore",
      "shape": "unknown",
      "date": "2011-10-10T00:00:00",
      "story": "Object in mid air with 3 distinct lights I was driving from the bank on Ritchie Highway in the Brooklyn area neighborhood near my home when I noticed a low flying object which I thought at the time was an airplane. However, as I proceeded up the highway, I noticed that the object had decended dramatically and was actually just above tree top level.  I though - what is wrong with this plane - why is it so low? Then, it stopped in mid air and just sat there. It was dark at the time - but it was not a helicopter. There were lights on what appeared to be the front, the middle and the back of whatever this was.There was also a haze or cloud like vapor around the object. No noise at all. There was no traffic coming in the opposite direction or behind me at the time. I had almost come to a complete stop looking at it. I then proceeded to drive and as I looked back - it was still there - not moving.",
      "link": "http://www.nuforc.org/webreports/084/S84034.html",
      "state": "MD",
      "duration": "approx. 2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bd661",
      "summary": "Two Orange Orbs flanked by four smaller ships.",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Two Orange Orbs flanked by four smaller ships. saw one orange orb heading  south west in the sky... and was flanked by four smaller ships, the smaller ships could have been planes or jets because I saw light on them but they moved in off ways which made me second guess myself on that, they flew so close to each other that they looked as if they went in and out of each other...... the orange orbs were just circles in the sky ... all the crafts were very high up in the sky... the four ships seemed to move in various directions... and when almost overhead... two of the smaller four ships took off in two different directions... one to the east and one to the west... the other two stayed close to the orange orb... then another orange orb appeared from out of nowhere about 200 yards from the other orange orb and this happened when they were directly overhead of me... and the two orbs and the two smaller ships continued to head south... the two smaller ships also did some strange maneuvers in the sky... flying ! very close to one another and seemed to blend into each other and then out...... the orange orbs disappeared after a little while... but I could still see the two smaller ships. the other odd thing is that all of the street lamps on our block have all gone out. There were no sounds or noises coming from the crafts in the sky and I was on the phone to a friend when I saw them. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90769.html",
      "state": "MD",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc1a",
      "summary": "Orange Objects In The Sky",
      "city": "baltimore",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "Orange Objects In The Sky On Tuesday, September 12, 2012 around 23:45, I noticed in the North East sky a bright object.  At first I thought it was a star.  But I noticed that it changed to a Bright Orange as it stood still.  Then 2 other Bright Orange Objects moved close to the first Bright Object.  Then 3 more of the same Bright Orange Objects came and formed a V-Shape.  When The V was completely formed, it moves just a little.  Then it formed a circle.  When the circle was completed, each object one at a time moved off into a different direction until it disappeared.  The last object to move was the very first one I saw. None of the objects made a noise.",
      "link": "http://www.nuforc.org/webreports/092/S92727.html",
      "state": "MD",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be21a",
      "summary": "Ufo in baltimore.",
      "city": "baltimore",
      "shape": "",
      "date": "2012-06-20T00:00:00",
      "story": "ufo in baltimore   well iam just a regular guy that would like to share my experience,i live in baltimore m/d and i started listening to coasttocoastan after 9/11 ,thats when i started following politics,came midnight was this show called coasttocoastam that speaks on subjects and theory that was perplexing my mind ever since i was a kid...now let me explain what i did and i am even fearful at this moment because it was unlike anything i ever saw before in my life.okay, one early afternoon  while i was out in my backyard summer of 08 09 or even 07 i tried to block it out for so long forgive me ,i actually said to my self let me try to summon a ufo and i was really headstrong on this thought believe me or not no more than ten minutes and i looked up and for the first time in my life i saw a ufo in a cloud it  was a clear day with only a couple of clouds but in the cloud closest to me,a small cloud there a triangle shape object inside the cloud a delta shaped winged body craft,i! t was the same size as the cloud but inside and the edge of the craft had a counterclock wise v gray and silver movement,so in other words the outline of the craft had a silver and gray v shaped counterclock wise movement and except for the outline you could not see this thing no sound it just passed on by over my head,and my eyes follow it for as long as the cloud was in sight,i went inside my house when i came back out later lights flash directly over my head that i couldnt make sense of i was so afraid that i tried to cancel my invite because i did summon them be careful what you ask for you just might get it.i canceled it the same way i called them..so they are real and i think i have the power to summon the but im so afraid, i know theyre not humans because humans dont show up just because of mental thougt",
      "link": "http://www.nuforc.org/webreports/089/S89736.html",
      "state": "MD",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3be65d",
      "summary": "Our alien ancestors are really starting to make there present felt.",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2012-06-20T00:00:00",
      "story": "Our alien ancestors are really starting to make there present felt. June17, 2012, fathers day weekend down my moms house on the eastside of Baltimore having a good time, when my moms took a glance at the sky in observe something strange flying past an airplane  I took a look just as well did everybody else, scanning the sky with my own two eyes, seeing more than two dozen sphere shape objects cruising the skies.  Metallic colored crafts with the suns reflection shining off of some, amazing.  Some were in a cluster formation, others wre flying in sets of twos and threes, the remaining was just like roaming behind.  Most of the witnesses was saying wow you see what I'm seeing, remarkable. I have seen my fair share of U.F.O.'s in the recent past but not of that magnitude.  What was really on the back of that truck in Washington D.C?  makes you ponder.",
      "link": "http://www.nuforc.org/webreports/089/S89678.html",
      "state": "MD",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be9d9",
      "summary": "Objects were flying together as one, then circled each other and disappeared into the sky",
      "city": "baltimore",
      "shape": "changing",
      "date": "2012-03-13T00:00:00",
      "story": "objects were flying together as one, then circled each other and disappeared into the sky Object flew over a full-moon lit skyline of the city from south to north (I was looking into the western sky).  Object appeared to be an airplane with no blinking lights until it separated into 2 objects.  The two objects circled one another, gained speed and then disappeared into the sky.",
      "link": "http://www.nuforc.org/webreports/087/S87532.html",
      "state": "MD",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0d0",
      "summary": "9 glowing orbs over Baltimore MD",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2013-02-04T00:00:00",
      "story": "12/30/2012 9 glowing orbs over Baltimore MD On Sunday, Dec 30th, 2012, I was in Baltimore MD it was at 20:50 when I heard people over my CB radio saying what was that and then again I'm like what was what and then I saw them there was 9 orbs glowing purple and Blue coming from the bay I pulled over to look they were pretty big in size silver with a glowing purple and blue light some were moving fast some were moving slow and one had stopped over the wood line and had on the blue light comming from the bottom of the craft like it was scanning or looking for something it did that for about 5 mins I tryed to get pictures but they came out fuzzy and scrambled this went on about 30 to 45 mins I be leave and the the 9 crafts huddled back up and went back towards the Bay flying fast there was no sound they were very quite and that was alarming to me I never seen any thing like this before the size of the craft looked to be big enough to fit about 5 to 10 people or what ever was flying them then I heard over my ! radio they they had flew inside a much larger craft that was described as a battleship and then disappead  that I did not see I just seen the 9 orbs head back from the way they came from",
      "link": "http://www.nuforc.org/webreports/095/S95827.html",
      "state": "MD",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf38e",
      "summary": "Red and green light over north east Baltimore.",
      "city": "baltimore",
      "shape": "light",
      "date": "2013-09-30T00:00:00",
      "story": "Red and green light over north east Baltimore Noticed a small very red and green light rise above neighbor’s house to the southeast. Moved almost straight up.  Moved in less than five seconds from roughly 20 to 45 degrees above where horizon would be if not interrupted by structures.  Stopped hovered and moved up and down about 10 degrees of elevation several times.  Disappeared below house and trees.  Went outside to see better.  It repeated same maneuvers before dropping out of sight.  It seemed less than a mile away but I saw no structure associated with light.  No sound.  Definite not a helicopter or fixed wing aircraft.  Looked like a firework but lasted too long, more than five minutes .",
      "link": "http://www.nuforc.org/webreports/102/S102091.html",
      "state": "MD",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf976",
      "summary": "Glowing orbs over Baltimore MD 12/30/2012.",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2013-02-04T00:00:00",
      "story": "Glowing orbs over Baltimore MD 12/30/2012 They were round silver balls flying low over the chesepeake bay glowing purple and blue    Some were moving fast and some were hovering with just the blue light favoring towards the ground   Like they were scanning or looking for something very strange. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95614.html",
      "state": "MD",
      "duration": "30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa02",
      "summary": "Looked and saw 3 orange lights, small dots in the east, in a triangle formation.  Went in to tell my family.  Came back out with two of",
      "city": "baltimore",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Looked and saw 3 orange lights, small dots in the east, in a triangle formation.  Went in to tell my family.  Came back out with two of them, triangle was gone, but small orange lights were moving up slowing from the east horizon.   First one would appear, travel slow and steady to the north, then a second would appear, where there first one originally appeared.   It slowly moved in the same line and toward the first.  Then a third orange light would appear, same way.   While this was happening, the first orange light would fade and disappear.  This same pattern repeated for about 10 -15 minutes.   There was no sound.  I assumed whatever it was was far away, don't know.   I did get my binoculars during all this, the lights looked like orange dots.  No other colors.  Very steady. ((NUFORC Note:  This reports was first posted to the reports for Massachusetts.   We corrected the error on 04/28/2015.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101303.html",
      "state": "MD",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c019f",
      "summary": "DISCS WERE ALREADY SIGHTED UPON MY ARRIVAL.",
      "city": "baltimore",
      "shape": "disk",
      "date": "2012-12-20T00:00:00",
      "story": "DISCS WERE ALREADY SIGHTED UPON MY ARRIVAL. date           city     state       shape      duration             summary  5/19/2012   BALTO. CO.      MD.       DISC.       20 MINS.      3 UFO'S SIGHTED  11/29/2012  BALTO. CO.    MD.         DISC.       8 MINS.       6 DISCS. SIGHTED",
      "link": "http://www.nuforc.org/webreports/094/S94917.html",
      "state": "MD",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0281",
      "summary": "Me and a buddy was driven on belair rd coming towards rossville. We take the towson exit and when we do i see green lights stayin still",
      "city": "baltimore",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "Me and a buddy was driven on belair rd coming towards rossville.  We take the towson exit and when we do i see green lights stayin still  about 60~70 of them.  So i tell my friiend to takr his glasses off and look.   When he does he straight said oh my god ((name deleted)), what is that? Itold him we gonna hit n u~turn and take puctures of it.  Wen we hit the U~turn n came back to take the picture they was gone nothin else to see ((NUFORC Note:  We wonder whether this is a serious report.  We will contact the witness about the report.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98267.html",
      "state": "MD",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c0768",
      "summary": "I was in the car; all of a sudden there was a bright orb that emitted another orb and it looped or twisted.",
      "city": "baltimore",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "I was in the car driving with my girlfriend and all of a sudden there was a bright orb that emitted another orb and it looped or twisted around each other then pulled appart and slowly glided in the opposite direction straight ahead up I the sky about helicopter height.   To the west another orb appeared and hung there in the sky stationary.  I pulled over to take a picture  as well.",
      "link": "http://www.nuforc.org/webreports/106/S106101.html",
      "state": "MD",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c07bc",
      "summary": "An extremely large black rectangle or triangle ufo floating at tree top level outside our house.",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2014-03-18T00:00:00",
      "story": "An extremely large black rectangle or triangle ufo floating at tree top level outside our house. When I was a teenager, my parents and I were heading to the symphony when we saw an extremely large black rectangle or triangle ufo outside our house. The symphony started at 8pm.  My dad never wanted to be late so we left a little after 7pm to make sure we made it there in plenty of time.  Our house is on a small hill near the end of our block.  It was twilight to dark.  As we left the house and started walking down the front steps down to our car – we saw this black object floating just barely above the tree tops. It was enormous and hardly moving.  It spanned from one end of our block to the other end.  I don’t know how long our block is but the object was more than the length of our block and there are 6 three story colonial houses between our house and the end of the block and the object was long enough to cover them all.  It was wide covering houses on both sides of the street.  The object was also tall or thick (maybe one story or more thick) and not aerodynamic at all.  There is no way that should be flying.  It was so large that we could never see the far side of it.  We really only could ever see 2 sides of it so it could be a rectangle or a triangle. We walked down the steps and into the middle of our street and stood directly underneath it.  It was very close nearly touching the tree tops (large oak trees in our neighborhood).  It was a matte black and blocked out the sky from our view because it was so massive.  It had lights on the underside -some large, some small, but the lights were dull and not bright.  I can’t remember where the lights were but know some were different colors.  The side of the object had a window like opening which had dim lights. With an object flying so close, it should have been loud but this object didn’t make a sound but you could sort of feel it in your chest.  Even blimps make sounds but this object just didn’t make a sound. We stood directly underneath it for several minutes looking up and then it slowly drifted up the side street next to our house.  It went from moving straight ahead to moving at a 90 degree angle without turning.  We kept walking with it up the side street while it was directly overhead.  It was gliding so slowly that it was easy to keep walking with it. We could have kept walking with it but my dad said that he didn’t want to be late for the concert and we had to go.  In the end, we watched the object for about 15 minutes.  I didn’t want to go but we did.  When we got into the car, I asked my dad what it was and he said that he didn’t know and didn’t want us to talk about it ever again.  I tried to bring it up several times and he made it clear that we were to never discuss it.   Years went by without talking about it– when my dad was dying I asked him about it and he couldn’t remember it happened.  I thought maybe it was all in my mind so a few years after my dad died I asked my mom if she remembered and she did.  This made me both relieved and uneasy.  We’ve talked about it several times since then.  My father was a physician, my mother is a nurse.  I am a medical researcher. While I wasn’t afraid while we were watching the object (it was oddly peaceful), those moments seeing it have haunted me almost every day since.  I’ve been uneasy sleeping at my house since that initial night and have had to sleep with a light on only when I’m there.  Every time I felt the slightest low hum, I rushed to my bedroom window to see if it is there. I’ve since moved away but my mom still lives there.  I moved to a very large city and oddly I sleep better in this large city than at my childhood home. I can be contacted by an investigator if needed. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107894.html",
      "state": "MD",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c08fa",
      "summary": "On the evening of September 3rd, I was smoking a cigarette on my deck looking up at the westerly sky. This is a nightly routine for me",
      "city": "baltimore",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "On the evening of September 3rd, I was smoking a cigarette on my deck looking up at the westerly sky.  This is a nightly routine for me as I enjoy observing satellites and shooting stars.  Several civilian and military airports are in the region as well, so I understand the energy and the sound associated to these aircraft. So that is why I find what I have observed in the above mentioned evening very peculiar. So like I said, I was looking up at the stars facing west, nothing in the s.ky.  Not even any aircraft the neighbors cat sort of distracted me so I briefly looked away from the sky.  As I looked back up I noticed what I thought were headlights to a passenger jet (above 35,000 ft.)  Traveling south to north..  No sound associated to this craft what so ever.  Also moving extremely slow for any aircraft I have ever seen from t any era.  As I was thinking to myself how it was funny how I did not notice this craft approach; the light suddenly dimmed to what looked like a satellite or a star for about ten seconds.. Then fading away into into the nights sky.",
      "link": "http://www.nuforc.org/webreports/103/S103522.html",
      "state": "MD",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a15",
      "summary": "Baltimore MD BWI a formation of more than 20 orange lights strung across the eastern horizon at a elevation of 35 degrees",
      "city": "baltimore",
      "shape": "formation",
      "date": "2013-11-11T00:00:00",
      "story": "Baltimore MD BWI a formation of more than 20 orange lights strung across the eastern horizon at a elevation of 35 degrees From an overpass (Long Gate Pky) on Route 100 looking East in the direction of BWI Airport  approximately 35 degrees above the horizon and covering approximately 10% of the visible sky was a formation of orange points of light in a snaking arrangement beginning with a close cluster of around 10 lights low toward the horizon at the northern end then rising, falling and rising again in a curving string of lights ending with a dispersed group of 4 lights.  The formation hung suspended in the air.   I could not tell if the lights were moving away to the northeast, or fading from view.  I drove to a safer vantage point at a church parking lot on Rt 103 but fewer lights were visible and they were gone from view within another two minutes.  The last of the lights were those at the extreme right side of the formation, the lights to the east.  At first glance I thought I was looking a fireworks, but the formation covered to large an area and did not fall through the ! sky or move the way fireworks would and they remained visible for minutes not seconds the way fireworks would.  Best guess would be some sort of flares, but very unusual.  Also way too many lights to be simple air traffic.  I've lived here for the past 22 years and this was not air traffic.  Some such traffic was visible in the sky and the lights from those craft was much whiter.",
      "link": "http://www.nuforc.org/webreports/103/S103686.html",
      "state": "MD",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c14d1",
      "summary": "Triangle shaped and very bright moving at the same time.",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2013-12-02T00:00:00",
      "story": "Triangle shaped and very bright moving at the same time. It was really bright in the sky there where 3 bright lightnings looking like the shape of a triangle they were moving at the same time looking like it was only one craft after i saw it the other person looked up saw it and within moments it just..... Disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104923.html",
      "state": "MD",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1526",
      "summary": "2 vertical lights relatively low moving quickly across sky and then disappeared.  Did not reappear, outside for 20mins.",
      "city": "baltimore",
      "shape": "other",
      "date": "2013-12-12T00:00:00",
      "story": "2 vertical lights relatively low moving quickly across sky and then disappeared.  Did not reappear, outside for 20mins.",
      "link": "http://www.nuforc.org/webreports/105/S105252.html",
      "state": "MD",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c15fe",
      "summary": "Very bright sphere in sky, thought it was planet but had one blinking light.",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2013-11-20T00:00:00",
      "story": "Very bright sphere in sky, thought it was planet but had one blinking light. Standing on top of a hill, my friend and I thought we saw a plane.  Then we realized it wasn't moving and thought perhaps it was a planet.   Then we noticed a blinking light on the bottom of it.   It didn't seem to be moving but was stationary for a few minutes, and we left. ((NUFORC Note:  We suspect that the sighting occurred at nighttime, although the witness indicates a time of 10:00 a.m..  We suspect he/she may have meant 10:00 p.m..  Witness remains totally anonymous, so we are unable to confirm the time.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104573.html",
      "state": "MD",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1822",
      "summary": "Bright orange light.",
      "city": "baltimore",
      "shape": "light",
      "date": "2014-07-20T00:00:00",
      "story": "Bright orange light. Just north of the Parkville area a very bright orange light hovered motionless in the sky for about 30 seconds.   It turned a dimmer light color as it began to move in a strange and unpredictable way.  It swerved around for about 10 seconds.   It briefly stopped still again and strobed between bright orange and the fainter (yellow/green?), before jetting off northward and dipped below the tree line of my neighbor's backyard.",
      "link": "http://www.nuforc.org/webreports/111/S111421.html",
      "state": "MD",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c24c7",
      "summary": "Bright green red and yellow.",
      "city": "baltimore",
      "shape": "unknown",
      "date": "2014-11-06T00:00:00",
      "story": "Bright green red and yellow. Bright colorful craft flew from north to south direction at fast speed, suddenly stopped then moved several quick directional changes in sort of circular pattern then hovered still made several more different direction moves and moved at slow pace to a north east direction till out of site.",
      "link": "http://www.nuforc.org/webreports/114/S114451.html",
      "state": "MD",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c32db",
      "summary": "9:24 PM I know it was because Gadget made it very clear we had to take one more walk in the park before bedtime.",
      "city": "baltimore",
      "shape": "fireball",
      "date": "2015-03-20T00:00:00",
      "story": "9:24 PM I know it was because Gadget made it very clear we had to take one more walk in the park before bedtime. Reluctantly I took him out the back and over to Patterson Park.  It was a crystal clear night, very pleasant weather and only 1 or 2 other dog walkers out.  As we rounded the Pagoda on the home leg of our walk I was looking south and could clearly see the constellation Orion just off to the SSW.  I remember saying to myself, \"So clear, I’ll bet I can see Taurus  (my Zodiacal sign).\"  Started to swing my head to the west and out of the corner of my eye, approaching from the south, I saw something I cannot explain. At least 9 amber/orange lights in formation and 3 or 4 more lights not in formation, meandering around the formation, were rapidly moving across the sky from almost due south to due north.  I was dumbfounded.  I observed this for about 15-20 seconds. The formation consisted of 3 v-shaped flights in a chevron that was rock solid, all flew in unison.  The meanderers seemed to circle and wander around the solid chevron as they tore across the sky at incredible speed. Flabbergasted, I muttered a few expletives.  Trying to get a grip on myself I struggled to get my phone out but just as it cleared my jacket pocket the phenomenon disappeared over the horizon to the north. I looked around to see if anyone else in the park saw this.  There was nobody around except Gadget who, sensing my astonishment, looked at me with concern as if to say, “What’s up with you, ((name deleteed))?  Why so frantic?”  Completely blown away we stood there for a few moments.  I Goggled the number and called in the report to UFOReports.com right there from the park. Bewildered we walked home and I made an online report of the sighting. I tried to explain it to myself most of the rest of the night. Was it reflections of street lights off my glasses?  Their color was similar to sodium vapor street lighting.  No I surmised.  I had to swivel my head from south to north to track the lights and they never wavered in their flight path.  Arrow straight the formation flew, no wavering or smearing you would expect if it was a reflection. Space junk?  Maybe, but the formation was so solid the flight appeared to be on an intentional course.  And to have 9 lights in solid formation and 3 or for in a seemingly random formation is a mix of trajectories and not likely to be a single object that broke up on reentry.  Such junk would all follow the same path and would leave a trail of some sort.  There was no flaming trail. Aircraft?  I've never seen anything move that fast in the atmosphere.  I've seen satellites, the ISS, Skylab, these moved just as fast if not faster across the sky.  The meandering lights also seemed to take a non-ballistic course and moved in ways no aircraft I know of could reproduce. So, there you have it. ((NUFORC Note:  The source of this report appeared on the Jeff Rense Radio Program on March 13, 2015, in order to describe his sighting.  He also submitted a report about his sighting in Tehran, Iran, in September 1976.  At the request of this witness, a colleague of his submitted a second report for that same sighting.  They both witnessed the same event, from different vantage points, in Tehran.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117786.html",
      "state": "MD",
      "duration": "15-25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c34d7",
      "summary": "I can tell that it was really high in the air but it was so visible that it had to have been a very large craft.",
      "city": "baltimore",
      "shape": "changing",
      "date": "2015-03-13T00:00:00",
      "story": "I can tell that it was really high in the air but it was so visible that it had to have been a very large craft. the  craft started out as a small whitish orange light.  I kept my eye on it and it seemed to turn to its side when it revealed a sort of triangular shape with to harangue orbs under it. the two orbs were only visible when it turned to its side.  Once it turned facing you I guess it looked more round and would seem to go away really far and then come back really quick. it could have been getting smaller.  Then enlargening?   I have 3 videos from a distance.",
      "link": "http://www.nuforc.org/webreports/117/S117737.html",
      "state": "MD",
      "duration": "2 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c35ca",
      "summary": "Flight of 9 to 12 amberish lights traveling south to north in a 3 chevron formation with wandering companions.",
      "city": "baltimore",
      "shape": "formation",
      "date": "2015-03-13T00:00:00",
      "story": "Flight of 9 to 12 amberish lights traveling south to north in a 3 chevron formation with wandering companions. I am a Security Systems Sales Engineer.  I design surveillance, access, and intrusion detection systems.  I have been a security professional for 13 years.  Before that I had a number of experiences.  One of witch was being in Tehran in 1976.  This was totally different. Standing on Hempsted Hill, Patterson Park I was looking for Taurus on an unusually clear night.  As I found Orion and started to look north a flight of lights entered from my left. Three perfect chevrons of 3 lights each and some meandering, looping lights, maybe 3 or 4 just looked loose, unco-ordinated. I thought it might be some sort of reflection but off my glasses, but I had to swivel my head to watch, and they maintained a straight line of flight, as I observed them. Freaky, It's rare I see something that I cannot explain. Contact me anytime. ((personal information deleted))  Baltimore MD 21231 443.((number deleted)) ((NUFORC Note:  We spoke via telephone with the source of the report, and he seemed to us to be quite sober-minded.  We suspect that he is a highly reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117766.html",
      "state": "MD",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c400c",
      "summary": "Grey, hovering object.",
      "city": "baltimore",
      "shape": "cigar",
      "date": "2015-05-22T00:00:00",
      "story": "Grey, Hovering object My friends (about 8 of us) and I attend a high school 15-20 minutes outside of Baltimore, Maryland, and have seen this Unidentified Object hovering above the city.   At first glance it looks like a plane going to BWI airport but it has not moved for 3 months at least.   It is a grey object with a haze around it and it appears to change form if you stare at it for a minute or more.",
      "link": "http://www.nuforc.org/webreports/119/S119056.html",
      "state": "MD",
      "duration": ">3 months"
    },
    {
      "_id": "64d005f478aba2ec5a3c4057",
      "summary": "White egg shaped sphere hovering at a high altitude.  I had to get binoculars to get a clearer picture. When it went behind some trees,",
      "city": "baltimore",
      "shape": "egg",
      "date": "2015-05-22T00:00:00",
      "story": "White egg shaped sphere hovering at a high altitude.  I had to get binoculars to get a clearer picture.  When it went behind some trees, I tried to change my position and it was gone.",
      "link": "http://www.nuforc.org/webreports/119/S119049.html",
      "state": "MD",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4055",
      "summary": "((HOAX??))  Hovering Craft seen for nearly one year close to Baltimore, MD.",
      "city": "baltimore",
      "shape": "cigar",
      "date": "2015-05-22T00:00:00",
      "story": "Hovering Craft seen for nearly one year close to Baltimore, MD. Sighted from the third floor of a school building on the sighting date, then noticed again unmoving in the sky approximately 6 months later.  3 months after this second sighting, the craft was still in the same exact location and has not yet moved to the current date (05/15/15).  It is dark gray or black and rectangular or cigar-shaped, and doesn't move from its position in the sky.  It hovers lower than a plane, and is close to the air path of planes destined for BWI Thurgood Marshal Airport.",
      "link": "http://www.nuforc.org/webreports/119/S119057.html",
      "state": "MD",
      "duration": "1 year"
    },
    {
      "_id": "64d005f478aba2ec5a3c4054",
      "summary": "Floating, hovering gray object.",
      "city": "baltimore",
      "shape": "cigar",
      "date": "2015-05-22T00:00:00",
      "story": "Floating, hovering gray object. There has been a mysterious object continuously floating in the distance for several months.  Everytime we look out of the window on the 3rd floor of the building we are in there is just an odd shaped dark object in the distance.  It just sits there unmoving. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119055.html",
      "state": "MD",
      "duration": "3 months"
    },
    {
      "_id": "64d005f478aba2ec5a3c4486",
      "summary": "Two very large objects reflecting the afternoon sunlight hanging just above the clouds in the sky west of Baltimore.",
      "city": "baltimore",
      "shape": "unknown",
      "date": "2015-10-29T00:00:00",
      "story": "Two very large objects reflecting the afternoon sunlight hanging just above the clouds in the sky west of Baltimore. It was the middle of the afternoon and I was driving eastward, when I glanced upwards to admire the beauty of the clouds which were lit up by the sun behind me.  That’s when I noticed the first object, which was hanging just above the clouds and gleaming in the sunlight far more brightly than they were.  It was also angular, which made it stand out from the clouds. \tI noticed the second object, just like the first, a little farther beyond it.  They appeared to be stationary.  The clouds passing beneath them, they’d reemerge in the same spot.  At one point a passenger jet passed below the clouds but still at some distance between me and the closer of these two objects, and then I realized how unbelievably large they must have been. \tThey seemed to be taller than they were wide.  And as I traveled round them, turning to the north, I saw their shape from another angle.  What appeared at first to be a box with a triangular projection below it became something like a very large “X” shape, with the upper legs being much taller than the bottom ones.  Then, viewed from the north, the side facing the sun appeared to be curved, almost like a sphere with a smaller sphere projecting below it. \tThey seemed to be hanging in the sky somewhere between White Marsh and the Aberdeen Proving Grounds northwest of Baltimore.  I was driving to New York, so eventually they were too far behind me to see anymore.",
      "link": "http://www.nuforc.org/webreports/122/S122895.html",
      "state": "MD",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c44e7",
      "summary": "In Baltimore City, around 10:00 PM, I think.  Saw a streak of light, roundish, move fast from one above the building across the street.",
      "city": "baltimore",
      "shape": "flash",
      "date": "2015-11-06T00:00:00",
      "story": "In Baltimore City, around 10:00 PM, I think.  Saw a streak of light, roundish, move fast from one above the building across the street which was about 20 feet high, and downward in a diagonal.  Happened quickly.   Impression was round and glowing.   Happened just East of North Charles at around the 900 block.  Halloween lights?  Weird weather? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123223.html",
      "state": "MD",
      "duration": "brief"
    },
    {
      "_id": "64d005f478aba2ec5a3c452e",
      "summary": "A bright moving white round object was caught on photos in downtown Baltimore.",
      "city": "baltimore",
      "shape": "circle",
      "date": "2015-11-19T00:00:00",
      "story": "A bright moving white round object was caught on photos in downtown Baltimore. I went to the top floor of the parking garage at UMB and took 8 pictures of beautiful sunset within 1 minute.  When I examined my photos, I found a bright white round object with pinkish ring was caught in my pictures.  The positions of this white object in these pictures are quite different, suggesting it was moving during the minute I took the pictures.",
      "link": "http://www.nuforc.org/webreports/124/S124024.html",
      "state": "MD",
      "duration": "few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c457b",
      "summary": "Very large bright light over Baltimore skyline. Light pulsated then dissappeared. Took video",
      "city": "baltimore",
      "shape": "unknown",
      "date": "2015-11-19T00:00:00",
      "story": "Very large bright light over Baltimore skyline.  Light pulsated then dissappeared.  Took video",
      "link": "http://www.nuforc.org/webreports/124/S124057.html",
      "state": "MD",
      "duration": "15-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c48bd",
      "summary": "Large, slow moving aircraft that appeared to be triangular with a bright glowing sphere at the top center, flew over Canton/Baltimore",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2015-09-25T00:00:00",
      "story": "Large, slow moving aircraft that appeared to be triangular with a bright glowing sphere at the top center, flew over Canton/Baltimore City, MD, last night.  They were completely silent.  We watched as the slow moving aircraft moved north-east in a horizontal motion.   Out of no where, a second aircraft appeared where we saw the first one.  There were no clouds in the sky for the object to go behind.  The second aircraft moved just as slowly, and began to follow the first one until they were both out of view. There were 3 of us that witnessed these crafts.  We also live in a city where airplanes fly over all the time.  These were not airplanes.  We shot a video from our phone, but all it shows is two glowing dots.  The only value is to show how slowly they move, and the flickering glow of the sphere.",
      "link": "http://www.nuforc.org/webreports/122/S122196.html",
      "state": "MD",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c498b",
      "summary": "Looked like a blimp but i never saw it move.",
      "city": "baltimore",
      "shape": "other",
      "date": "2015-10-09T00:00:00",
      "story": "Looked like a blimp but i never saw it move. I was sitting in the airport looking out of the window and saw to objects in the sky side by side and they didn't move for roughly an hour or two.",
      "link": "http://www.nuforc.org/webreports/122/S122567.html",
      "state": "MD",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c50ad",
      "summary": "Three oval-shaped objects came together and flew in formation before separating and flying away.",
      "city": "baltimore",
      "shape": "oval",
      "date": "2016-02-26T00:00:00",
      "story": "Three oval shaped objects came together and flew in formation before separating and flying away. Three brown oval shaped objects appeared in the distance from the 6th floor of Americas best value inn.  The objects were flying separately and then came together in a circular formation and started flying up, down and around in a circle. There were no lights or sounds.  After a minute of flying in formation, two objects flew straight up out of sight while the third remained for a couple of seconds before flying in the opposite direction.  About 15 minutes later two military helicopters came and circled the area for a couple minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125990.html",
      "state": "MD",
      "duration": "2.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c517a",
      "summary": "In West Hampden. Swirling pulsing noise prompted me to look outside where I saw a large floating illuminated object by the tower/antenn",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2016-02-04T00:00:00",
      "story": "In West Hampden.  Swirling pulsing noise prompted me to look outside where I saw a large floating illuminated object by the tower/antennae things over by TV Hill.  Extremely bright, white with red in center.  Like a mass of lights.  Blinked off VERY briefly twice over the course of one or two minutes until it slowly flew SE towards the city.  I then saw the triangular shape of these lights.  Lights clumped together, not spaced like a regular plane.",
      "link": "http://www.nuforc.org/webreports/125/S125516.html",
      "state": "MD",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c51b1",
      "summary": "https://www.youtube.com/watch?v=Gq-yIuNsRtk  ((NUFORC Note:  Good video of a large cluster of orange lights.  PD))",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2016-02-04T00:00:00",
      "story": "https://www.youtube.com/watch?v=Gq-yIuNsRtk   Look at this video taken last night. ((NUFORC Note:  Good video of a large cluster of orange lights.  Perhaps lanterns, but we cannot be certain.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125580.html",
      "state": "MD",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c5208",
      "summary": "Backwards flying, triangle, no sound ship 3 lights",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2016-02-04T00:00:00",
      "story": "Backwards flying, triangle, no sound ship 3 lights. Coming home from work with son and daughter.  My daughter yelled, \"Mom, look!\"   As I got out of the car, both son and daughter was looking at the sky.  When I saw it I couldn't believe it.  Low slow flying backwards triangle shape craft.  3 lights in the shape of a triangle but close enough to see the shadow of the ship.   Absolutely no sound from the ship.",
      "link": "http://www.nuforc.org/webreports/125/S125606.html",
      "state": "MD",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5910",
      "summary": "Confirm sisters report.",
      "city": "baltimore",
      "shape": "disk",
      "date": "2016-05-26T00:00:00",
      "story": "Confirm sisters report I am one of the brothers that my sister described in her report as being witness of Jupiter 2 looking ufo.   I was discussing this siting this evening with another brother who saw it and happened to come across my sisters report when looking for old ufo articles in baltimore.  Just wanted to confirm that as my sister described is exactly what i and brother recall and he believes he can narrow down the year after checking with parents.  I feel it is very similar to what other baltimore report saw.   I believe our parents called police and would have been one of those 200 calls that evening.  That night was clear and the saucer low and moved soundlessly and slowly.  You could make out the outter diameter outline as perfectly circular.  Not blimp shaped.  It had smaller diameter of a dozen or so lights on underside.  I remember thinking at the time how ironic that a ufo would look exactly like the underside of jupiter two of lost in space but i suppose the tv model is modelled after actual sitings.  This was early 70's suburban area.  No hot air balloon and no testing site for aircraft.  Never saw anything like it since even on tv shows showing debunked cases. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127474.html",
      "state": "MD",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bf6",
      "summary": "Saw what I thought was a star that was changing colors red green blue white, i watched it for about half hour thinking it was celestial",
      "city": "baltimore",
      "shape": "oval",
      "date": "2016-04-01T00:00:00",
      "story": "Saw what i thought was a star that was changing colors red green blue white, i watched it for about half hour thinking it was celestial and it began moving across the sky out of my line of sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126636.html",
      "state": "MD",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c5c12",
      "summary": "Report of six orange glowing objects flying at high altitude coming from the southwest flying northwest over Baltimore, Maryland at app",
      "city": "baltimore",
      "shape": "oval",
      "date": "2016-04-01T00:00:00",
      "story": "Report of six orange glowing objects flying at high altitude coming from the southwest flying northwest over Baltimore, Maryland, at approximately 8:30 p.m. on Saturday, March 26, 2016.  Video",
      "link": "http://www.nuforc.org/webreports/126/S126569.html",
      "state": "MD",
      "duration": "3-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d19",
      "summary": "Bright light fell from the sky and disappeared I've seen comets before but nothing like this.",
      "city": "baltimore",
      "shape": "flash",
      "date": "2016-12-05T00:00:00",
      "story": "Bright light fell from the sky and disappeared I've seen comets before but nothing like this.",
      "link": "http://www.nuforc.org/webreports/131/S131490.html",
      "state": "MD",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6085",
      "summary": "The objects appeared star like in nature. Upon first sight they are indistinguishable from stars until prolonged observation reveals th",
      "city": "baltimore",
      "shape": "light",
      "date": "2016-10-21T00:00:00",
      "story": "The objects appeared star like in nature. Upon first sight they are indistinguishable from stars until prolonged observation reveals they are actually within our atmosphere and doing manuvers unlike any known commercial or military aircraft, such as up, down, left, right, making perfectly angled turns,and circles almost only when being looked at.  They remained in patterns that resembled triangles, straight lines and constellations.  Due to my area being close to BWI airport, many commercial aircraft come within close range of the objects but they fly higher than the objects.I have been observing them for a 3 day period between 10/16/16-10/19/16 right outside my home and neighborhood they return every night and I have seen them as far as in the randallstown area. I have only seen them 3 times during the day and that was months ago.",
      "link": "http://www.nuforc.org/webreports/130/S130693.html",
      "state": "MD",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c60a5",
      "summary": "3 glowing fireball-type objects with trailing fireball, seen flying at dusk over east Baltimore, MD. ((anonymous report))",
      "city": "baltimore",
      "shape": "fireball",
      "date": "2016-09-22T00:00:00",
      "story": "3 glowing fireball-type objects with trailing fireball, seen flying at dusk over east Baltimore, Maryland. My wife and I witnessed three glowing fireball-type objects coming very slowly out of the east (~ Middle River, MD).  From our perspective, each object had a slightly smaller fireball trailing slightly below the main object.  The lights remained steady (not blinking or flickering) and had the appearance of an orange-ish flame.  I did not have my distance glasses on, so a bit blurry for me.   The objects were travelling in a tight, linear formation. Seemed to be about several hundred yards distance between each.  As the lead object approached a thin, wispy cloud it seemed to dissipate.  The second and third dissipated as well before reaching the cloud.  After a minute or two a single object appeared in the same location (again, with a trailing object) and quickly disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129997.html",
      "state": "MD",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c687e",
      "summary": "Binary lights dancing through the clouds in large crisscrossing circle.  ((anonymous report))",
      "city": "baltimore",
      "shape": "light",
      "date": "2017-04-07T00:00:00",
      "story": "Binary lights dancing through the clouds in large crisscrossing circle While driving towards Baltimore, I watched multiple lights dancing through the clouds.  I told the other passengers in my car to look and they too watched the lights.  I thought they must be from the ground shining up in the clouds, as we were soon to enter the city,   As we passed through the city, the lights continued dancing through the clouds, but did not remain above any landmark on ground.  I looked for ground based lights shining upwards but found none.  As I continued to drive north through the city the lights remained in front & to the right and above my vehicle.  All the passengers in the car were watching the lights keenly and noted they appeared to be traveling with us. For several miles, traveling on city streets, and then on HWY 83 north through the city, the lights continued to dance above and to the right of my vehicle. 20 minutes after initially seeing the lights while driving, I parked on a hilltop to watch the lights. For an additional 25 minutes all occupants of my vehicle watched as the lights danced and pulsed brightly then faded, then getting bright again, all while dancing through the clouds.  We took a short video of the lights and several photos. The lights in total had a large circular shape, but the lights appeared to be moving in binary groupings. There were at least 20 individual lights, grouped into at least 10 pairings.  While parked the lights faded and the cloud appeared to grow dark grey in a large oval shape. The lights were very faint while I could see the grey outline.  It was getting late and the lights were distant and dimming and so we left the remarked sight to go to bed. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133364.html",
      "state": "MD",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6bea",
      "summary": "Saw one orange-colored light making abrupt turn abrupt turn then two more suddenly appear side by side of each other with the first one",
      "city": "baltimore",
      "shape": "light",
      "date": "2017-01-19T00:00:00",
      "story": "Saw one orange-colored light making abrupt turn abrupt turn then two more suddenly appear side by side of each other with the first one up ahead then all three vanish",
      "link": "http://www.nuforc.org/webreports/132/S132210.html",
      "state": "MD",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c70c6",
      "summary": "Was camping out, and saw a bright object standing still, then moved randomly at extreme speeds changing direction and velocity.",
      "city": "baltimore",
      "shape": "light",
      "date": "2017-07-07T00:00:00",
      "story": "Was camping out, and saw a bright object standing still, then moved randomly at extreme speeds, changing direction and velocity. I was camping overnight during summer camp in tents.  I got out of my tent in the middle of the night to look at the stars, and noticed a brighter object near the horizon.  It looked just like a planet, but brighter, so I originally thought it was Venus, until it moved towards me quickly.  I thought it could have been a shooting star, until it sped at great speeds right over me, sometimes slowing down, in a zig-zag motion.   Then, when it was around 2/3 of the sky, I heard a VERY loud sonic boom, followed by an explainable sound.  It was like a plane, but higher pitched, mixed in with a siren.  It quickly disappeared in seconds.  Clearly, it was traveling at extreme speeds, and only about a few miles above the ground.  This happened around Baltimore.  I was surprised to notice that no one woke up.  My father had also experienced a very similar event many years ago, only the object was too far away to hear.",
      "link": "http://www.nuforc.org/webreports/134/S134865.html",
      "state": "MD",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c71ea",
      "summary": "Huge black aircraft with green lights, moving incredibly low and slow over the trees.",
      "city": "baltimore",
      "shape": "chevron",
      "date": "2017-07-14T00:00:00",
      "story": "huge black aircraft with green lights, moving incredibly low and slow over the trees. Was driving on highway through Baltimore and a huge black chevron-like aircraft (the wings went against each other in about a 60 or 70 degree angle and were shaped like rectangles with one side slightly slanted).   Moving incredibly low and slow with a small bright green light on each wing.  I saw it come from the west (above the trees over the highway, and slowly make its way past the threes to the east.  I couldn't take my eyes off of it.   Never thought I'd see anything like this in my lifetime.  It was probably a hundred feet above the treetops.  And enormous.   I couldn't hear any sound being emitted from the UFO.",
      "link": "http://www.nuforc.org/webreports/135/S135089.html",
      "state": "MD",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c72f3",
      "summary": "I noticed one blazing and shining object away from me just two or three blocks.  I am an MD. ((anonymous report))",
      "city": "baltimore",
      "shape": "light",
      "date": "2017-06-15T00:00:00",
      "story": "I had been reading something related to medicine.  And also that night, I drank lots of coffee.  So I could not sleep very well.  I am an MD.  I literally am used to going to bed late. My bed settles in my bathroom in front of the window.   So, I had prepared to bed, I noticed one blazing and shining object away from me just two or three blocks.  My backyard is so opened air placed and my apartment is on the 16th floor.  That light had been there when I realized.   So, just I had watched for 1.5 hours and then went to bed, but still light was in the sky and a little bit came towards my building at the time of the drawn and the sun popped up. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134525.html",
      "state": "MD",
      "duration": ">90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c739d",
      "summary": "4 lights in a perfect square in sky.  I watched as stars moved across the sky and only those 4 lights did not move.((anonymous report))",
      "city": "baltimore",
      "shape": "sphere",
      "date": "2017-06-15T00:00:00",
      "story": "Four lights in a perfect square in sky.  I watched as stars moved across the sky and only those 4 lights did not move. ((NUFORC Note:  Possible advertising lights??  PD)) ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134534.html",
      "state": "MD",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c74b5",
      "summary": "Bright star-like light in the early morning (~5 AM) sky.  ((NUFORC Note:  Sighting of Venus in E sky?  PD))",
      "city": "baltimore",
      "shape": "light",
      "date": "2017-05-11T00:00:00",
      "story": "Bright star-like light in the early morning (~5 AM) sky. I woke up to use the restroom and saw a really bright spot in the sky.  At first, I thought it was a star, an incoming plane, or a helicopter flying over the city, but the light isn't moving.  The light resembles a star, but way bigger.   As it begins to dawn, the light is becoming dimmer, but it is still there.  It does not appear to be moving.  Perhaps it moved up, higher in the sky, but it's difficult to tell.  Even the binoculars aren't helping much.  The light is still in the sky (5:15). (NUFORC Note:  Sighting of Venus in E sky?  PD)) ((NUFORC Note:  Source of the report elects to remain anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133990.html",
      "state": "MD",
      "duration": "Since when I woke up at 4"
    },
    {
      "_id": "64d005f478aba2ec5a3c75c3",
      "summary": "Multiple colored dome shaped UFO that sparkled.",
      "city": "baltimore",
      "shape": "disk",
      "date": "2018-01-12T00:00:00",
      "story": "Multiple colored dome shaped UFO that sparkled. I believe it was back in 1970 that my brother and some of our neighbors saw a colorful flying object that had multiple colored lights around it and a sparkle effect to it...almost like a sparkler.  We could even here the sound coming from it.   It hovering above us and came close to some of the telephone poles.  It moved it such a peculiar way, sweeping back and forth in the sky.  We reported this to one of my neighbor's parents, but they concluded that it was just a weather balloon.   At that time I was very naive, but to this day I don't believe it could have been a weather balloon.  If anyone else has seen this during that time period please let me know.   I heard that someone from Chestnut Ridge, Pa, area had a similar experience. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138270.html",
      "state": "MD",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c5d",
      "summary": "Circle like object UFO moves and does dance in sky.",
      "city": "baltimore",
      "shape": "circle",
      "date": "2017-10-05T00:00:00",
      "story": "Circle like object UFO moves and does dance in sky. I noticed it from my bedroom apartment building window, then I went up to the rooftop to see it as clearly as possible it ws extremely small from my vantage point but it ws like a star in the sky but it wasn't ... I look out this window every day and I am well aware of the positioning of the stars from my window ... at night but it was bright and beautiful weather and sunny... it started moving slowly then it would drift down slightly as if it were a balloon but it wasn't I am one HUNDRED Percent SURE !!! then it would drift up ward and stay put!!!! And I tryied to video and take pictures because people are so fickle nobody believes things of this sort but I wasn't seeing things that's for sure ... a plane would fly pass it and it would drift as if it was falling out of the ski then once the plane was pasted it would drift upwards as it it were going backwards in no particular direction but far off ... I did capture as much as I could I am still in awe of it I! had been waiting to see a UFO for as long as I can remember but looking upwards all the time isn't something a person in the city does that often if at all ... I wanted to share this because it intrepid and scary yet fascinating all at the same time",
      "link": "http://www.nuforc.org/webreports/136/S136500.html",
      "state": "MD",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d50",
      "summary": "15 white dots visible for minutes, changing formations. Moving in multiple directions at steady speeds and even movement. No lights",
      "city": "baltimore",
      "shape": "disk",
      "date": "2017-09-12T00:00:00",
      "story": "15 white dots visible for minutes, changing formations. Moving in multiple directions at steady speeds and even movement.  No lights I witnessed and have numerous pictures of white dots that moved like satellites, but in multiple directions, but even and steady like satellites.  Not balloons, not birds.  White dots.  Very very high up.  May have been triangular in zooms.  12 then 3.  Pictures show changing formations of dots.   They started to move west and disappeared.  They are currently on my instagram \"lanadelmama\" in two posts that are blue skies (to identify which posts.)",
      "link": "http://www.nuforc.org/webreports/136/S136099.html",
      "state": "MD",
      "duration": "3 to 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c82ef",
      "summary": "Flash about 5 seconds South Western Sky Baltimore.",
      "city": "baltimore",
      "shape": "flash",
      "date": "2018-11-09T00:00:00",
      "story": "Flash about 5 seconds South Western Sky Baltimore. Saw flash in the sky about a quarter at arm's length wide.  Started small but grew in intensity then vanished.  Appeared in the South Western sky I was in Western Baltimore. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143674.html",
      "state": "MD",
      "duration": "~5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c84e5",
      "summary": "((NUFORC Note:  No information provided by witness.  PD))",
      "city": "baltimore",
      "shape": "cigar",
      "date": "2018-08-10T00:00:00",
      "story": "((NUFORC Note:  No information provided by witness.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142371.html",
      "state": "MD",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c857f",
      "summary": "Slow moving round object in the sky, rotating slowly and heading north.",
      "city": "baltimore",
      "shape": "disk",
      "date": "2018-08-31T00:00:00",
      "story": "Slow moving round object in the sky, rotating slowly and heading north. I was in my back-yard working in the yard, around 3pm on Friday Aug 24, 2018, when I heard a helicopter fly above, and looked up.  To the right of the helicopter (helicopter was heading west) I saw a round object moving slowly thru the sky heading north.  The helicopter didn’t appear to be chasing it, as it just flew by and kept going west (though quickly fell behind the house/tree line so I don’t know if it turned back towards the object while out of my view.)  Very rough guess, but comparing to the helicopter that was at about 1000 feet, it had to be comparable in size to the helicopter, maybe slightly bigger.  I live near an airport, and see helicopters a lot, this was just an average size common helicopter.  (local news and police take off from there, and it just looked like the standard news or police copter, nothing military).  This airport is a Maryland National Guard base as well though (in Middle River Maryland.)  The object was slowly moving to the north, while slowly rotating.  Would say approximately 1500 to 2000 feet in the sky.  It was circular in shape, but if you think of it as a burger, it was round with a small bite taken out of it.  As it rotated, the side without the “bite”, it was reflecting a lot of sunlight off the top of the object.  As it rotated the “bite” toward me, it was reflecting much less sunlight.  That was how I could really tell it was a spinning object, but indented on one side (i.e. the bite).  It seemed to make a full rotation every 10 to 15 seconds.  I could not take my eyes off of it, kept trying to rationalize what I was seeing.  After 2 or 3 mins, it finally dawned on me to pull out my phone and record some video.  With the bright sunny day, I was having a hard time seeing my phone’s screen.  By the time I adjusted the screen brightness, got my camera app open and looked up, it was gone.  With how slow it was moving, I would have expected it to still be there.  I’m so upset I did not take out my phone sooner.  It had to have moved quickly out of view, I would say it took me about 30 – 40 seconds to get my screen brightness adjusted, and get the camera app open, and look back up.  It could not have been a plane, it was moving far too slowly.  A plane would have fallen from the sky at that slow of speed.  I did not see any helicopter blades on top, no wings, nothing.  Just a round spinning object, indented on one side.  Feel free to email me at address I left in the report, I'll answer any other questions I can.",
      "link": "http://www.nuforc.org/webreports/142/S142908.html",
      "state": "MD",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d05",
      "summary": "3 distinct objs, Solid white lights, in Triangle formation, traveling same speed.  at high alt. traveling NE above city. ((anonymous))",
      "city": "baltimore",
      "shape": "triangle",
      "date": "2019-02-01T00:00:00",
      "story": "3 distinct objects, Solid white lights, in Triangle formation, traveling same speed.  at high altitude traveling northeast over the city.  Lights were slowly dimming, then disappeared.  I know the flight paths into and out of BWI, these did not fit anything that would have came from there.   Also, I am up every morning, same time.  NEVER seen these lights, or anything resembling them before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144723.html",
      "state": "MD",
      "duration": "&lt;1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c98ba",
      "summary": "Large disc with extremely bright white lights",
      "city": "baltimore",
      "shape": "disk",
      "date": "2019-12-01T00:00:00",
      "story": "Large disc with extremely bright white lights It was a very large disc and extremely white lights all around it. It hovered, then moved very slowly until it was out of my sight range. I am positive it was a UFO. When hovering I thought it was a street light or the moon. But when it started moving I was convinced",
      "link": "http://www.nuforc.org/webreports/150/S150483.html",
      "state": "MD",
      "duration": "10 minutes"
    }
  ]
}