{
  "city": "birmingham",
  "fetch_timestamp": "2025-07-12T14:36:29.214670",
  "record_count": 61,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b464d",
      "summary": "Me and my 6 siblings, my parents and 2 neighbors saw the lights in the sky. It was triangle and or circular but stationary. For a long",
      "city": "birmingham",
      "shape": "triangle",
      "date": "2019-06-07T00:00:00",
      "story": "Me and my 6 siblings, my parents and 2 neighbors saw the lights in the sky. It was triangle and or circular but stationary.  For a long time.  My mother yelled for us to come inside. I'm the youngest of 7 but I still remember to this day what I saw.  Our parents have passed and our neighbors also.  I still have vivid dreams of it.  Thought I was having regular dreams of similar dreams like typical\"falling off a cliff\" but no.  3 years ago I walked in on 2 of my brothers talking about that incident.  I said I thought it was just me and my dreams, because I was only 4, 5 or 6 when it happened.  No one spoke of it.  My brothers said no!  We all saw it. I asked them if they have dreams and they said yes, all the same and changes every year. Advance, as if its a story or a movie.  My brother that passed 2 yrs ago had dreams frequently. Ive had no more than 3 dreams a year or at least 1.  But each dream feels so real and unfortunately with unbelievable out comes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146505.html",
      "state": "AL",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fe0",
      "summary": "Long Cigar Shape Objects",
      "city": "birmingham",
      "shape": "cigar",
      "date": "2019-03-29T00:00:00",
      "story": "My family and I was driving down I-65 when I noticed 4 or more cigar state objects. I didn’t say anything because I knew that it was probably natural.  But the more I look at it, it seems like a long cigar shape objects that is camouflage.   I’m not sure if anyone else saw it.",
      "link": "http://www.nuforc.org/webreports/145/S145315.html",
      "state": "AL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b50c8",
      "summary": "I was suddenly aware of most of the sky being filled with a white light. No sound. It moved away quickly (one to three seconds) with no",
      "city": "birmingham",
      "shape": "unknown",
      "date": "",
      "story": "I was suddenly aware of most of the sky being filled with a white light.  No sound.   It moved away quickly (one to three seconds) with no sound. ((NUFORC Note:  Date of incident is approximate.  We have assigned an arbitrary date.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52818.html",
      "state": "AL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5404",
      "summary": "Weird thing over high school",
      "city": "birmingham",
      "shape": "cigar",
      "date": "2008-06-12T00:00:00",
      "story": "Weird thing over high school First of all, i wish to assure NUFORC that this report is in no way a hoax. Some of my past reports have been labeled as such (ex. metallic sphere tailing fighter jet((HOAX)). I assure everyone that reads this report to be 100% truth.  I am a student at (name withheld) high school in Alabama. On the morning of April 3, 2008, at 7:15 a.m., I was leaning on my car in the parking lot of (name withheld) high school, waiting for the first bell to ring. I got bored and looked up. First I saw a puff of smoke or steam appear in the sky. I then saw a small, fast aircraft appear out of it. After it traveled for a short distance at a great speed, I saw another puff of smoke or steam appear. It came out of the cloud, and then sped up so fast my eyes had trouble keeping up. I t ust not have been made of metal, because it did not glint in the rising sun. Are there any other kinds of aircraft that don't use metal in their full construction? At this point, I coyuld discern the shape, which was a cigar. A cloud was ditrectly in the way that the object was travelling. What happened next didn't make anyy sense to me at all. I looked at the cloud, and part of the cloud just disappeared. Completely cut in half. I know this sounds pretty wierd, but the flight path of the shape where it would intersect with the cloud had completely disappeared. The shape went through the small hole.",
      "link": "http://www.nuforc.org/webreports/063/S63323.html",
      "state": "AL",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b57ce",
      "summary": "Large dark chevron, silently passing overhead in early AM hours, only seen because against star fields.",
      "city": "birmingham",
      "shape": "chevron",
      "date": "2007-11-28T00:00:00",
      "story": "Large dark chevron, silently passing overhead in early AM hours, only seen because against star fields. Date of sighting is approximate.  It was either in 2003 or 2004, on a cold, fall/winter night.   The sky was especially clear (e.g., low humidity/haze) with a lot more stars visible to the naked eye than is usually the case.   I live in Vestavia Hills, directly south from Birmingham.  I had gotten up to take our dog outside to go to the bathroom.  It was after midnight, and likely around 2AM or 3AM.  I was looking up at the stars when something obstructed my view.  At first I thought it was just a cloud, but as this thing moved across a star field, I could clearly see that its leading edge was triangular or chevron shaped.  I could not make out the shape of the rear of the object.  Also, I did not hear any noise.   At the time, I figured it must be a B-1 bomber and was listening for the sound of engines but heard none, or none that could be heard over a background of light, late-night traffic noise.   The object appeared to be large (3 or 4 moon diameters across), and at a relative low altitude for aircraft, and traveled across a quarter of the sky in about 10 to 15 seconds.  Its speed appeared to be the same as a commercial jet at low altitude on a landing approach.  It was traveling in an approximate S to SSW direction.   At the time i figured the B-1 must be heading to Maxwell Airforce Base in Montgomery, Alabama (or Eglin Air Force Base on the Gulf Coast). ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59658.html",
      "state": "AL",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b5803",
      "summary": "Bluish-Green Light over Alabama",
      "city": "birmingham",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Bluish-Green Light over Alabama I tried submitting this report last year, but no one would take it seriously. I assure you that this is in no way a hoax.  My friend and I were leaving a detention session at a high school about 30 minutes before this happened.  I was waiting to get picked up by my parents (my friend and I were the only ones left waiting to be picked up). I was staring up into the sky, lost in thought, when a light caught my attention. It was a bluish-green light that travelled from one side of the sky to the other in about 10, maybe 12 seconds. It looked like it was surrounded by a kind of haze or aura.  As my eyes tried to focus on it, it disappeared behind a cloud bank and vanished from my sight.  The object seemed to be emitting sparks and left a trail, almost like the haze emitted by jet aircraft flying at a low level. After I saw it, I only had to wait about 3 seconds before I heard a very odd noise, which sounded like a car backfiring, with a whistling noise that followed.   am telling this event to the best of my recollection and testify that is 100% true to the letter.",
      "link": "http://www.nuforc.org/webreports/060/S60107.html",
      "state": "AL",
      "duration": "8-12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b58c9",
      "summary": "bright white-greenish object appears, hovers in place, quickly travels zig zag pattern and vanishes",
      "city": "birmingham",
      "shape": "fireball",
      "date": "2007-11-28T00:00:00",
      "story": "bright white-greenish object appears, hovers in place, quickly travels zig zag pattern and vanishes Birmingham, Alabama (Cahaba Heights area)  I have not reported this incident to anyone other than some family members and a few close friends.  It was either October or November 2006.  I was sitting out on my back porch around 1:00 A.M., clear sky.  Out of nowhere a bright white-greenish colored object appeared from my right, traveling East to West.  Cannot be sure as to distance, but it was closer than airplanes travel.  It came from East to West, moving too “quick” to be an airplane or shooting star; then came to sudden stop and hovered in place for about 5-10 seconds as its illumination increased to a brighter green (pulsating to a brighter degree illumination) .  The illumination reduced to the level it was when I first observed it, at which time it traveled very quickly to the right, back to the left, then back to the right in an upward direction – then just disappeared into thin air.  I would describe the way this object “exited” as an extremely quick zigzag motion or Z pattern.  I have never seen anything even close to this before.  I used to be skeptical when I would hear people report things like this – but I know what I saw.  I wanted to report what I saw that very night, but did not know exactly who or where to report this.  I learned about this sight earlier today.  Hopefully, there are others who saw this unmistakable and unforgettable event which occurred in either October or November 2006. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59762.html",
      "state": "AL",
      "duration": "10-15 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b08",
      "summary": "UFO Sighting over townhome community in Birmingham Alabama.  ((NUFORC Note:  We cannot certify that this is a serious report.  PD))",
      "city": "birmingham",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "UFO Sighting over townhome community in Birmingham Alabama   On the night of August 19th 2007 at 8:30 P.m. my wife and I were driving home taking a road we drive very normally during the week. The road is Old Springville Road in Birmingham, Alabama, in a part of town called Clay, in Jefferson County.  We were about driving down Old springville road, and were about to pass a townhome community named Sommersby. When turning the curve right in front of Sommersby my wife ectstatically yelled, \"Look, Look right there.\"  What we both saw was very surreal and chilling.  Off in the distance some 100 yards away, and about 50 ft above this particular grouping of town homes a multileveled, disc-like, object hovered.  It had rectangular lights solidly lit around the perimeter of the disc. It was saucer shaped, and appeared to have four banded levels.  I immediately drove into the neighboorhood to get a closer look, but upon doing this the craft must have been aware and either manuvered away to fast to observe, or cloaked itself.  The real scary thing about this event is that we have seen a disc hovering above this same group of houses before several months ago. It was a nearly identical disc.  I am afraid for the people of this neighborhood, and can only wander have they seen this too being in such closer proximity than myself on the road? ((NUFORC Note:  We cannot certify that this is a serious report.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58296.html",
      "state": "AL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f58",
      "summary": "CLEAR DAYLIGHT SKY  SILVER SAUCER WITH BLINKING LIGHTS  OLD SPRINGVILLE RD 1975",
      "city": "birmingham",
      "shape": "disk",
      "date": "2008-02-14T00:00:00",
      "story": "CLEAR DAYLIGHT SKY  SILVER SAUCER WITH BLINKING LIGHTS  OLD SPRINGVILLE RD 1975 IT WAS SUMMER AND STILL DAYLIGHT.  WE HEARD TWO PEOPLE AT THE APARTMENT BELOW SCREAMING FOR ANYONE TO LOOK OUT THEIR WINDOW.    I WENT TO A LARGE WINDOW AND SAW THE UFO FLY OVER OUR BUILDING.  YELLED AT MY HUSBAND AND WE WENT OUT AND STOOD IN THE PARKING LOT WITH 4 OTHER PEOPLE AND WATCHED IT HOVER.  NONE OF US COULD BELIEVE WHAT WE WERE SEEING. TWO BOYS SAID THEY HAD BEEN FOLLOWING IT FROM CAMP COSBY (SPRINGVILLE, AL) DOWN OLD SPRINGVILLE LAKE ROAD (TOWARD HUFFMAN HIGH SCHOOL), WHEN IT LIFTED ITSELF,  AND WENT BACK THE WAY IT HAD COME. IT WAS SILVER, SAUCER SHAPED, WITH BLINKING LIGHTS AROUND THE MIDDLE.   I WILL ALWAYS WONDER IF WE HAD THOUGHT TO GRAB A CAMERA, IF WE WOULD HAVE BEEN \"BEAMED UP.\" MY HUSBAND AND I WILL BOTH TELL YOU, UFO’S EXIST. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60175.html",
      "state": "AL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6161",
      "summary": "A cylinder of blue pulsing light and some sort of craft concealed in a thick low hanging cloud",
      "city": "birmingham",
      "shape": "cylinder",
      "date": "2008-03-04T00:00:00",
      "story": "A cylinder of blue pulsing light and some sort of craft concealed in a thick low hanging cloud On December 15, 2007 around 9:30 p.m.  my husband and I were heading home.  We were on the Southside of Birmingham and were driving up Arlington Avenue South to cut through to Montclair Road via Carlisle Road.  We live in the Crestwood/Irondale area of Birmingham.   The weather was in the low 60's and overcast and a bit gusty and there was rain in the forecast.  Not really unusual for the south but for some reason it just felt odd almost the way it feels before a thunderstorm or even a tornado.  When we turned onto Montclair from Carlisle, we drove just a short distance approximately a quarter of a mile to where the Pilgrim Church is and we noticed through the trees and up to the left a flash of a very bright blueish light that lasted maybe a second.  We both expected to hear thunder or a boom from a transformer but we heard nothing.  As we continued on maybe another quarter of a mile, we were approaching a red light and intersection.  It should be noted that there is a ridge to the left that runs parallel to Montclair and at the intersection there is a post office to the left and just up from there is another building that houses the Orthopedic Specialists.   This ridge is mostly residential.  As we were about to pass under the red light (speed limit is 25)  to our surprise the brilliant blue light reappeared on the ridge just behind the Orthopedic Specialists building. We were maybe 500 feet from it so you could see it very clearly.  What we saw was truly amazing and we have never ever seen anything like it.   The light was a brilliant plasma blue. It seemed to pulse, it was bright but not blinding.  The cylinder was very large, approximately about 50 - 60 feet across and about 100-120 feet tall.  There seemed to be a cylinder within a cylinder.  The outermost cylinder had a very 3D appearance and the best way to describe it...a Hexagon.  It was slowly rotating counterclockwise.  The innermost cylinder was smooth but it didn't really seem to rotate. You could pretty much see through the cylinder but because of the light it definately had a hazy glow to it.   The cylinder extended up towards what appeared to be a circular stack of levels starting with the lowest level closest to the cylinder, which was made up of rectangle shaped lights arranged around the perimeter of possibly the bottom of a craft.  It too was rotating in a counterclockwise direction.  The next  3 levels stepped up and out and disappeared into a very dense low hanging cloud.  You absolutely could not see what was up in the clouds and I have to say that the cloud was unusually low and very dense and despite how windy it was seemed to just hang there.  The craft just hovered there and it lasted approximately 5 seconds.    Then just like a light switch it turned off.  There was no way to tell if the craft disappeared or if the light just turned off.  We continued traveling down Montclair and trying to put our minds around what we saw.  We had probably travelled less than a quarter of a mile and that took less than a minute when just like before it appeared again.  It seemed to be travelling very slowly along the top of the ridge.  When the light appeared it just seemed to hover over the houses along the top part of the ridge. Again, concealed in the cloud. This time we pulled over and rolled down the window.  There was no noise, no whir, no sound at all.  All of a sudden all of the lights to the left of Montclair Road where the craft was hovering all went out.  The entire neighborhood was cast into darkness.  Of course, curiosity getting the best of us, we decided to turn up into the neighborhood towards the area that the craft might be to see if by some chance we might catch a closer glimpse.  All of the houses were dark, no street lights....very eery but it was obviously gone.   As we made a U turn to go back down towards Montclair there was a very clear view of another ridge that is a few miles away and we could see transformers blowing one after another, maybe 5 in all . The saddest part is I actually had my camera in the backseat, why o why didn't I pull myself together enough to get out my camera and record the event.  At any rate, this was absolutely the most amazing thing that either of us have seen or experienced.    I have to say I have always been a skeptic but I just have no idea what this could have been but it definately seemed to have some purpose or intention in what it was doing.  What would that be?  I have no idea.",
      "link": "http://www.nuforc.org/webreports/061/S61308.html",
      "state": "AL",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6247",
      "summary": "I was working security at a local hospital and was sitting in security truck, which had a monitor for the Birmingham Police Dept instal",
      "city": "birmingham",
      "shape": "teardrop",
      "date": "2007-06-12T00:00:00",
      "story": "I was working security at a local hospital and was sitting in security truck, which had a monitor for the Birmingham Police Dept installed in it. I was looking west when I saw it. It was HUGE and moving very slowly and silently and low to the ground from the West to the East, N/E.  I just sat watching in awe.   Then I heard a Birmingham Police Officer yell over the radio \"WHAT IS THAT?\"  No other car nor the dispatcher responded.  He didn't say anything else, either. As the object began to go behind a hill and trees, I asked my buddy who was in the other truck on the other side of the hospital if he saw anything and he said no.  I never mentioned it again to anyone. It honestly looked kind of the Enterprise",
      "link": "http://www.nuforc.org/webreports/056/S56658.html",
      "state": "AL",
      "duration": "10 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6989",
      "summary": "Two objects possibly one moving quickly across the sky.",
      "city": "birmingham",
      "shape": "other",
      "date": "2007-06-12T00:00:00",
      "story": "Two objects possibly one moving quickly across the sky. I am unsure if what I saw was a single object, or two objects moving one in front of the other.  I was out walking my dog and happened to look up to watch a low flying private airplane, and saw above that what appeared to be two lights moving fast and much higher than the aircraft.   They were only visible for a few seconds.  I saw them in the east part of the sky, flying towards the north.  They stopped, changed direction then reversed and continued north.  I lost sight of them when they reached the tree line.  They were visible even though it was a full moon.",
      "link": "http://www.nuforc.org/webreports/056/S56477.html",
      "state": "AL",
      "duration": "several seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ccd",
      "summary": "Light blue triangle over Southern Pines subdivision",
      "city": "birmingham",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "Light blue triangle over Southern Pines subdivision I was out in front of my house with my telescope, just looking at stars. It was an average night for astronomy, nothing amazing, as the moon's light was blocking out most of the good views. All of a sudden, the computer that controls my telescope went dead. I pulled out my cell phone. It was dead also. Even my watch wasn't ticking. Then, i heard this odd whistling noise. I looked up, and there was a bright blue triangle traversing the sky at what i would guess to be about 600 mph(just a guess). I sat there watching it for about 10-20 secs before it sped up(no sonic boom) and disappeared from sight. What gets me about what I saw is that it is eerily similar to the reports of november 2006 of the statewide balls of light. Just like the other(which i saw, submitted a report, but it was deleted for some reason) it made a sound, it left a trail, and there was a haze around it.",
      "link": "http://www.nuforc.org/webreports/062/S62227.html",
      "state": "AL",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6cdf",
      "summary": "ufo seen over  3-day period",
      "city": "birmingham",
      "shape": "disk",
      "date": "2007-02-01T00:00:00",
      "story": "ufo seen over  3-day period i was outside finishing up our fireworks stash when i noticed a pulsing red light in the sky behind the trees. i dont know what it was. we dont live near those bulky radio towers at red mountain (they have red blinker lights). after about 1 or 2 minutes, whatever it was faded out of sight. the next day, i was watching tv when i noticed something moving among the trees about a mile away. i submitted a report on that one separately. it slowly descended behind the tree line. I then saw it rise up, make a 90-degree turn to the west and it was GONE. The next morning, i saw a saucer-type thing higher up that was red and blue. i think they were all the same thing, but i can't be sure. it might have even landed! ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54639.html",
      "state": "AL",
      "duration": "3 days, 2-3 minutes each "
    },
    {
      "_id": "64d005f478aba2ec5a3b7420",
      "summary": "Hanging object in Southeastern sky US 11-06-06",
      "city": "birmingham",
      "shape": "teardrop",
      "date": "2006-12-07T00:00:00",
      "story": "Hanging object in Southeastern sky US 11-06-06 While driving back from a trip to Memphis Tenn.  My husband and I was in the car driving on 78E and in the sky there was a light hanging in the sky  I told my husband  What kind of plane just lingers in the sky like that.    I took a picture with my disposable camera and have to get it developed.  There were jet flying back and forth like they were checking it out.  It did not seem the norm, something strange was and is going on.  Then when we got to South Carolina, Home we saw it again.  Just hanging there.  I got my to daughters to come back out to the car and we drove around so I could show them.  It was there and the jets were flying in the skys as well.  I do not know what is going on but I do know it was not a plane. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53273.html",
      "state": "AL",
      "duration": "few hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b743c",
      "summary": "southwestern skies of Birmingham, black object dart and zig zag then flee without trace",
      "city": "birmingham",
      "shape": "chevron",
      "date": "2007-08-07T00:00:00",
      "story": "southwestern skies of Birmingham, black object dart and zig zag then flee without trace I woke up early Sunday morning and went outside to have a cigarette.  After sitting down and looking up, I noticed how clear the sky and how thinly transparent the clouds were.  Right before sunrise.  I noticed a black object in the in the clouds.. thinking it was a big black bird, I watched it.  Then it made sharp movements and seemed to zig-zag then shot like a bullet and left no trace.  I searched the skies for several minutes to see if it was traveling thru patches in the clouds but it was gone.  I had a very clear open view of the sky. Birds and planes are easy to follow at the height that I saw this object, but this just vanished in a flash!",
      "link": "http://www.nuforc.org/webreports/057/S57814.html",
      "state": "AL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b75c9",
      "summary": "Two pinpoints of light over DoubleOak Mtn.",
      "city": "birmingham",
      "shape": "unknown",
      "date": "2007-08-07T00:00:00",
      "story": "Two pinpoints of light over DoubleOak Mtn. My friends and I were on our way back to our band practice house when I saw these two small, distant points of light travelling over the top of double- oak mountain. I decided not to tell my friends, as they are not inclined to believe. I kept my eyes on it as we moved towards Chelsea. It seemed to rise and fall thousands of feet with relative ease(I used clouds as a background marker to help determine altitude). I do not think it was an airplane. Airplanes normally have flashing lights turned on at night. This one was either not an airplane, or the pilot received a very nasty letter from the FAA the next week. It eventually faded from view. There were also 2 other planes in the area. It is unknown to me whether they were chasing it or if they were just \"there\".",
      "link": "http://www.nuforc.org/webreports/057/S57884.html",
      "state": "AL",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c46",
      "summary": "I noticed a light streaking across the sky and thought it was a large meteorite, but it was too slow and was unmistakably green.  The t",
      "city": "birmingham",
      "shape": "sphere",
      "date": "2006-12-07T00:00:00",
      "story": "I noticed a light streaking across the sky and thought it was a large meteorite, but it was too slow and was unmistakably green.  The trail was much thicker that a meteorite so it seemed to be close to the ground.  It was in full view until it went over a Mt. and out of my line of sight.  It never stopped or chaged direction. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53679.html",
      "state": "AL",
      "duration": "45 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b7c47",
      "summary": "A large green glowing round object was seen flying above  the Birmingham, Alabama  area  at 5:30 pm on November  28, 2006.",
      "city": "birmingham",
      "shape": "fireball",
      "date": "2006-12-07T00:00:00",
      "story": "A large green glowing round object was seen flying above  the Birmingham, Alabama  area  at 5:30 pm on November  28, 2006. Around 5:30 pm November 28 a neighbor and I saw a ball of fire streaking thru the sky.  It came from the west and was heading eastward.  It was not very high in the sky, maybe a mile up, and it was much larger than a plane.  It was round, light green in color and surrounded with a glowing white light.  It had a tail similar to that of a comet.  It traveled at a very slow speed and it never burned out (we thought it might be a shooting star).  It kept flying eastward.  We watched it about 30 seconds until it flew over the tree line.  Later that night I heard on the news that it was a meteor but the next day the local news called it a UFO becuase they were not sure what it was.  The news said NASA had no signs of meteors in our area when this object was spotted.  The news said that many people saw it in our area.",
      "link": "http://www.nuforc.org/webreports/053/S53744.html",
      "state": "AL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c1a",
      "summary": "Brilliant green light across the Birmingham Sky...Definitely not a plan.",
      "city": "birmingham",
      "shape": "light",
      "date": "2006-12-07T00:00:00",
      "story": "Brilliant green light across the Birmingham Sky...Definitely not a plan. My friend and I were stopped at a traffic light in the middle of my neighborhood...we observed the green light towards the northeast from our position moving quicker than a plane at about a 45 degree angle towards the earth.  It was moving from left to right.....we lost it in the horizon over the trees....we had never seen anything like it.  I've seen a shooting star, it was nothing of the sort.  It was a brilliant light green and was moving in a direct path.",
      "link": "http://www.nuforc.org/webreports/053/S53728.html",
      "state": "AL",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c1f",
      "summary": "meteor passing tangent to earth atmosphere",
      "city": "birmingham",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "meteor passing tangent to earth atmosphere While facing north from the top of Red mountain in Birmingham I watched at 5:25PM 11/28/06 a large round bright green glow move from WNW to ESE appeared to be a tangent pass of meteor that entered and exited earth atmosphere without any impact. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53716.html",
      "state": "AL",
      "duration": "ONE MINUTE"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c21",
      "summary": "We saw a greenish-blue ball of light in Clay Alabama, on Tuesday, November 28.",
      "city": "birmingham",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "We saw a greenish-blue ball of light in Clay Alabama, on Tuesday, November 28. My mother and I were driving down Old Springville Road, Clay AL, when we saw a single greenish-blue ball of light in the sky.  At first it was going along side of us (we were going north) and then a few seconds later it disapeared behind trees.  There was a short delay, and then it looked like it was falling diagnally in front of us.  Then it was gone.",
      "link": "http://www.nuforc.org/webreports/053/S53722.html",
      "state": "AL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7cab",
      "summary": "((HOAX??))  metallic sphere tailing fighter jet",
      "city": "birmingham",
      "shape": "sphere",
      "date": "2006-12-14T00:00:00",
      "story": "metallic sphere tailing fighter jet i regularly go out on my roof to look for ufos as i am an enthusiast. me and my sister were up on my roof i think around the 20th but it was a while ago. like any other home, we're subject to the occasional flyover by military aircraft. as what looked like an f-14 flew overhead, i noticed a small metallic object keeping pace with it. the pilot of the f-14 either didn't see it or was escorting? it. it wasn't a missile, as it left no smoke trail. it wasn't a drone, as it was way too small. and i dont know of any aircraft that will drop fuel drop tanks on a populated area. it freaked me out really bad ((NUFORC Note:  Source of report indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  One of several reports from same source.  Possible hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53968.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8387",
      "summary": "I was camping with my friends in a restricted area.  I went off 20 yards by my self to use the restroom and smoke a cigarette since my",
      "city": "birmingham",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "I was camping with my friends in a restricted area.  I went off 20 yards by my self to use the restroom and smoke a cigarette since my friends didnt like smoke.  When I looked up into the sky I saw a an oval shape beam of light that was surounded by a glowing beam of red.  It seemed as if it was getting closer but every time I moved closer it disappared.  No one has believed me",
      "link": "http://www.nuforc.org/webreports/065/S65404.html",
      "state": "AL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b87ff",
      "summary": "Strange light(s) in the sky over Birmingham, Alabama for  2 consecutive days",
      "city": "birmingham",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Strange light(s) in the sky over Birmingham, Alabama for  2 consecutive days In the Western sky around 6:15-7:00pm central time in Birmingham,AL I was outside on my back porch when I looked up (as I always do to look at the stars), and I observed a light in the sky that at first I thought was a star. The thing that caught my eye was the fact that it was a bit larger than a star and a lot brighter. I've seen this in the sky for the last few weeks, and I simply thought it was Jupiter or Venus or some other planet that I thought I had heard someone on TV talking about being in the night sky at this time in the year. Well, on this night and on the next, the \"star\" moved. I don't mean it moved a tiny bit, it really moved! If you hold your hand out at arm's length to measure the distance that it moved, it moved about 3-4 inches in any given direction. Sometimes it would perform a circle type movement, but most of the time it would just kind of \"float\" around, going from one side to the other, back and forth. I observed this for 40 minutes or so, until I could no longer see it (it seemed to sink in the sky as time went on). It would seem to be moving in a straight line at times, almost like it was deciding on a direction to take, and would travel in this straight line for a couple of inches (at arm's length) and then it would stop, only to move around aimlessly, without purpose again for a while. I'm not sure how many points of light there were coming from the object, but at times it seemed to have more than one, maybe three or more. Maybe it was disk shaped, because at times it would dim as though the lights were turning away from my direction. There were no flashing lights of any color, only whitish light. I hope to see it again the next few nights to take a picture or video of it.(I have no camera, but my girlfriend does)",
      "link": "http://www.nuforc.org/webreports/068/S68052.html",
      "state": "AL",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b56",
      "summary": "Three Silver Boomerang shaped objects spotted in broad daylight",
      "city": "birmingham",
      "shape": "other",
      "date": "2010-02-14T00:00:00",
      "story": "Three Silver Boomerang shaped objects spotted in broad daylight I was leaving work and was looking up at the traffic light (in a SE direction) in a highly wooded area waiting for the light to turn green. Something shiny reflecting the sunlight caught my eye above the trees. There were three, boomerang shaped objects hovering right above the tree tops making no sound. They were larger than the size of a motorcycle but smaller than the size of an SUV. They were chrome silver in color, very shiny - unlike anything I have ever seen. I lost them over the tree tops. The traffic light changed and I had to turn onto the parkway to keep traffic moving. There were a lot of other cars on the road, this was during rush hour in broad daylight. There was not a cloud in the sky, it was beautiful weather conditions. I dismissed it thinking I may have been hallucinating since I couldn't make sense of it and they had disappeared... My Cell phone rang as I was driving and it was my mother.  I told her what I saw and she started asking me questions.  By this time I had pulled up to the light to get onto the very busy HWY 280.  I was in the turn lane to go NW onto HWY 280.  I was facing North and still on the phone with my mother looking up in the sky trying to see if I could find the objects again.  Sure enough they had made a circle from where I had originally spotted them and were flying over HWY 280 going in the same circular direction I had spotted them going in the first time only this time they were at a much higher altitude.  I told my mom I had to go b/c I was going to report this to 911 since this sighting was close to the eighth anniversary of September 11th and I didn't want to take the chance of it being some kind of terrorist surveillance or something of the sort. The light changed and I started to move away from the objects.  I pulled over into a parking lot and had my digital camera in my purse.  I pulled it out and got out of the car and waited for them to circle again.  They did return in the same flight path that I had seen them twice before but they were flying at an even higher altitude than they were the second time.  I tried to snap a picture but they were too far away from me at this point. I waited for them to circle around again but they disappeared.  I called 911 and the operator said she was getting similar reports and she was sending a sheriff's deputy to check it out.  I gave the operator my information and got back into my car and waited for them to fly over again.  Every single time i saw them they were flying in a V formation.  They were all the same size and color, hovering with no sound and could take off at speeds so fast that they seemed to disappear.  I watched them fly over the same restaurant but this time instead of continuing the circular flight path I had watched them make before they turned and flew NW over HWY 280 following the Westbound traffic.  They were flying lower than airplanes but higher than the tree line.  This time they disappeared but it wasn't like they took off it was as if they were invisible, they were there one minute and then the next they were not.  I didn't see them take off at a higher speed I just watched them disappear into thin air, it was as if they could make themselves invisible. I called my younger brother since he had a sighting near this area a few years before on a fishing trip to see if the shapes of the object were the same.  Mine were different in that they weren't completed triangles, they were shaped like boomerangs and were smaller in size than the object he saw.  He saw his at night and mine were in broad daylight and made no sound.  I didn't know who to report them to so I wrote down my experience and I found this website and I'm reporting it for the first time in writing.  I still don't have an explanation for what I saw that day and I wonder if I ever will.  (These directions are approximate since I didn't have a map or a compass at the time of the sighting). ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74111.html",
      "state": "AL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b92d5",
      "summary": "I saw a triangular shaped air craft that had three bright white lights and a dime one in the center of it.",
      "city": "birmingham",
      "shape": "triangle",
      "date": "2009-12-12T00:00:00",
      "story": "I saw a triangular shaped air craft that had three bright white lights and a dime one in the center of it. I agree with the sightings of an triangular shaped ufo I saw it this pass Tuesday morning on November 10th, 2009 at 1:00 AM. Across the street from my house. My dog broke out of our back yard and I went out of the house to retrieve him. I was able to get him and at the same time from about 120 feet away I saw three bright white lights and a dime one in the center hovering over my neighbors house approx. 20 feet over his house near a tree. The night was cold and misty the sky very cloudy so it was resting in the cloudy mist that hung some where about 25 to 30 feet above ground, my neighbors house is on a little hill so it is higher than ours. This object was floating like it was observing my dog and I from the distance, and when I notice it, it started to move. It moved very slowly my guest would be about 5 miles per hour and it made no sound and moved as if gravity had no force on it at all. The other strange thing is the very bright white lights on it did not illuminate the trees around it as it glowed. When I first noticed it I thought it was an airplane because I live 15 miles from Birmingham's AirPort, but the object was quiet and it did not have the normal light features that an airplane would have like the small red and green lights. After, it had pass over and disappeared in the cloudy mist a real airplane flow over my head with the red and green lights that I mentioned and it was very loud. I have always believed in them but I am truly convinced that they are real now. My only concern is why are they more noticeable now. Something major is going to happen down the road for us I do believe.",
      "link": "http://www.nuforc.org/webreports/073/S73326.html",
      "state": "AL",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b990f",
      "summary": "description of a spaceship spotted over Birmingham Alabama in 1967.",
      "city": "birmingham",
      "shape": "oval",
      "date": "",
      "story": "description of a spaceship spotted over Birmingham Alabama in 1967  ((NUFORC Note:  We spoke with this witness, and we found her to be an exceptionally good witness.  She speaks quite eloquently about her sighting, and she will have the other two living witnesses submit reports, as well.  PD)) The year was 1967. I was 32 years old. I was driving out Montevallo Road, going from the mall to my home. My ten year old son, my nine year old son and my thirteen year old stepson were with me.  I was driving a convertible and the top was down.  It was dusk, I don't know the exact time. All of a sudden we looked up, I do not know why, and saw, hovering above the trees on the right side of the street, a huge craft.  It was oval in shape with a smaller dome on top.  Around this smaller dome was a row of windows and there were lights in the windows.  I heard a soft whirring sound, smooth and barely perceptible.   It stayed there for five minutes or so and then zoomed off to the west with a speed that was incomprehensible.  I pulled off on a side street and pulled over to the curb and parked the car.  The boys and I were all stunned.  I asked them to tell me what they had seen.  We each spoke in turn and we all saw the same thing.  At that time my husband owned a large company in Birmingham and any negative or questionable activity was a threat to his reputation so I told the boys that we would tell their dad when we got home and then we must never talk about it again.  We could not risk losing customers.  The people in Birmingham were peculiar in some ways and it was better to keep quiet.  We did tell my husband when we got home and then we never talked about it again for many years.  A few years ago I began to tell some of my close friends about it.  As you get older you worry less and less about what other people might think and I wanted to share my experience.  My son who was ten at the time has passed away but I asked my son who was nine at the time if he remembered that everning and he said, \"Oh, yes.\"  I cautioned them so much he has not talked about it much but he still remembers it exactly the way I do.  My husband died many years ago and I have lost touch with his children but I am sure his son, who was thirteen at the time, still remembers.  You cannot forget because it changes everything you ever thought ab out the world you live in.   I loved the experience and would love to see another one but realize I probably never will.  It was a beautiful ship and so far advanced from anything we have on this planet.  The material it was made of reminded me of one of those globes you see over a hall light, a glass or plastic globe that allows the light to shine through.   The ship had a yellowish, or golden glow, as if it was lit behind the material it was made of.  The lights in the window were brighter than the soft glow of the ship itself.  I don't know how big it was, it seemed quite large though not as large as a football field.  But I am not good at judging distances so I don't know how high it was but it seemed rather close, though not directly  above the trees.  I am 73  now and did want to make some official report before it is too late.  I don't know if this is the right place to do it but I will continue to search websites in regard to this. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63941.html",
      "state": "AL",
      "duration": "five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3babcc",
      "summary": "Black triangle materialized overhead and proceeded southbound",
      "city": "birmingham",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Black triangle materialized overhead and proceeded southbound While stargazing app. 12:30CT early Monday morning, 10/4/2010, I sighted a low- flying aircraft that I could not identify. I was in the back parking lot of an apartment complex in a south-western Birmingham suburb, near the top of the tallest hill in the area (which slopes northwards,) stargazing.  No one was about and there was little to no air traffic at that time.  It was a moonless night I was watching Taurus rise in the eastern sky.  Out of the corner of my eye and towards my left field of vision, I noticed a large optical blur- like a wave effect- directly over the constellation Cassiopeia.  A triangular or, perhaps, wide wedge shaped object seemed to materialize into existence at that point against the star field.  The exact shape was difficult to ascertain, because my eyes were dazzled by an absolute matte blackness which seemed to cloak the thing and travel with it, and was profound and visually confounding; but I was able to discern that it was roughly triangular in shape. Each of its three blunt or rounded corners was steadily illuminated, but these stripes of luminosity did not seem mechanical.  Rather, they appeared dim and phosphorescent, of a sickly yellow-green hue, reminiscent of a weak glow-stick. The object first appeared roughly 50- 60 degrees above the horizon, north-north-east, at an altitude of approximately 300- 400 feet, headed due south, skirted the Pleiades to the west, and passed almost over my head and behind the top of the hill.  Its initial flight-path was slow and deliberate, like a helicopter or a glider.  It could not have been either one of these vehicles, though, because it was absolutely silent and was traveling almost against the wind.  It was much too slow for a prop plane or, especially, a jet.  I will reiterate: the thing was silent as death.  I estimate its diameter (point to point) to have been about 20- 30 feet.  This first sighting lasted 8- 10 seconds. It is perhaps irrelevant, but noteworthy, that within 10 seconds after this sighting I witnessed a brilliant white falling star in the east, very near on the horizon, directly behind what was the object’s flight- path. About three minutes later, it (I assume it was the same object) proceeded back the way it came- this time at a much higher altitude and at an impossibly high speed.  Had I not still been scrutinizing the sky, or had I even blinked, I would have missed it.  This second time it was only recognizable as a distant black point of mass that blanked out the highest stars as it passed.  Any object traveling at that speed should have (according to my understanding of Newtonian physics) produced a sonic boom, but it was, again, completely silent. I will add a final, perhaps irrelevant, detail.  For sake of a complete record I state here that I have never in my life felt such a prescient sense of dread and malevolence as I did while witnessing this object and after the fact.  I soon departed the area.  Since that time, I have been plagued with vicious nightmares and a disrupted sleeping pattern.",
      "link": "http://www.nuforc.org/webreports/078/S78224.html",
      "state": "AL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc28a",
      "summary": "Red circular object travelling at high rate of speed",
      "city": "birmingham",
      "shape": "circle",
      "date": "2012-01-12T00:00:00",
      "story": "red circular object travelling at high rate of speed This sighting occurred in Birmingham AL approximately 9:00 PM Saturday night, December 31, 2011. I was on my back deck when I saw a small red glowing circular object about twice the size of the northern star at approximately 45 degrees above the Eastern horizon, moving south to north at a high rate of speed. The airport is approximately 10 airline miles north of my house so I see airplanes crossing the sky all the time and I would estimate this object traveled at least two to three times the rate of a normal passenger jet. Being New Year’s Eve I dismissed it as fireworks but it traveled on a flat trajectory across the sky at what had to be an extreme altitude. It took about ten seconds to cross my field of vision before it blinked out and disappeared.",
      "link": "http://www.nuforc.org/webreports/086/S86240.html",
      "state": "AL",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd34e",
      "summary": "Red-Orange ovals flying across hwy 280",
      "city": "birmingham",
      "shape": "oval",
      "date": "2012-08-05T00:00:00",
      "story": "Red-Orange ovals flying across hwy 280 I was outside smoking a cigarette and saw a orange-red light, moving silently and slowly from my right to left at about a 30 degree angle from my viewpoint.   A second, then third object came into view, so I ran up onto my porch and called my mom and dad to come out.  As they did a fourth flew by.  It was the first one they saw, then 3 more also flew by.   The first few objects flew in a straight line, but the last 3 were varying their direction slightly.   One moved up and down a little, the other 2 flew in an arc away from the direction of the preceding 5 objects due east.",
      "link": "http://www.nuforc.org/webreports/090/S90433.html",
      "state": "AL",
      "duration": "7-9 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdbd0",
      "summary": "Blue and red light, other object(s)",
      "city": "birmingham",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "blue and red light, other object(s) I came outside for a smoke with my brother and noticed that it was not cloudy anymore. It was actually quite clear. All of the stars were very bright. My brother pointed out a red and blue &quot;star&quot; facing northwest.  I noticed it not only changed from red to blue, but that it also was illuminating something above it.  It was silent.  It took about 15 minutes to disappear. I verified it was not any known object I.e. star, planet with Google Sky Map.",
      "link": "http://www.nuforc.org/webreports/093/S93631.html",
      "state": "AL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bddb0",
      "summary": "Metallic object rolling across morning sky",
      "city": "birmingham",
      "shape": "egg",
      "date": "2012-11-19T00:00:00",
      "story": "metallic object rolling across morning sky Walking to my car this morning, I looked up into the sky and looked at a pair of stars for a moment.   All of the sudden a spherical/oval - metallic object (almost looked like it had a line down the middle) was moving past the first star, almost as if it was &quot;rolling&quot;.  Object continued moving past second star and over my head.  All I could do was stand there with my jaw dropped.  Checked satellite trackers and the only one that came through the area thirty five minutes prior - lasting for a duration of 5 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94414.html",
      "state": "AL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdfdc",
      "summary": "Unknown object over Birmingham metro flashing rapidly, changing directions for over an hour. ((NUFORC Note:  Possible star?  PD))",
      "city": "birmingham",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Unknown object over birmingham metro flashing rapidly, changing directions for over an hour. Began around 20:07 light was rapidly changing color from red to white to blue to green. Started high in the sky, slowly moving in several different directions.  Continued to descend very slowly and diagonally - every once in a white stopping in place and flashing lights in a pattern and then returning to rapid flashing and moving once more.  What caught our eyes was the fact that it started moving horizontally to the left ( opposite of what it was originally doing) and back to the right.   Repeated this pattern for about an hour until it began to fizzle out (possibly from heading into the far distance). ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92926.html",
      "state": "AL",
      "duration": "over an hour"
    },
    {
      "_id": "64d005f478aba2ec5a3be23c",
      "summary": "Fast Light Moving.",
      "city": "birmingham",
      "shape": "unknown",
      "date": "2012-11-19T00:00:00",
      "story": "Fast Light Moving a bright light moving extremely fast over the red mountain express, with a tail of fire, lasted about 5 secs and the light went out.",
      "link": "http://www.nuforc.org/webreports/094/S94617.html",
      "state": "AL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be5b6",
      "summary": "Strange white light in the sky with red lights that circled around it",
      "city": "birmingham",
      "shape": "cross",
      "date": "2012-05-13T00:00:00",
      "story": "strange white light in the sky with red lights that circled around it I live in an apartment complex that is high up on a hill. I have an amazing view of the city from my balcony; I can clearly see the airport. Often, I sit and look out while smoking a cigarette. The past few nights I have witnessed a strange light. At first, I thought it was just a star. The longer I looked at it, the more details I could see. It almost seems shaped like the symbol from the Blair Witch films (best way to describe it). It's a cross with ends pointing out in different directions. Two red lights can be seen circling around it at times. It appears in the same general location of the sky almost every night. It seems to move at a painfully slow pace.  It just hovers for a long time. I check back on it every few minutes and it has barely moved from view behind a large tree outside my apartment. The even stranger thing is that very small looking planes seems to fly right past it constantly.  These are tiny red lights that flash quickly and fly fast.  One night it seemed like two of them were harnessed together and then the one in the back just dropped from the sky and vanished. Tonight my strange star in the sky, slowly shrunk until it was almost invisible to me.  It was strange because at first I thought a cloud had passed in front of it (though I believe it may be too low in the sky for that).  But it just appeared to get more and more hazy until it was just a pin prick of what it once was. So, I have no idea what to call this thing that appears here nightly.  I'm beginning to be a bit freaked out, though.  I urged my boyfriend to look at it.  While he had no explanation for what it was, he didn't seem nearly as intrigued as me.",
      "link": "http://www.nuforc.org/webreports/088/S88732.html",
      "state": "AL",
      "duration": "20  - 30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bee8b",
      "summary": "Grey alien drills into my back when I was a child in the 1950's",
      "city": "birmingham",
      "shape": "unknown",
      "date": "",
      "story": "Grey alien drills into my back when I was a child in the 1950's This is a True (two part) story about alien contact. Here goes Part One:  I was approximately 6 years old I believe,(not exactly sure) but it was the mid-late 1950's.  I resided in the suburbs of Detroit, Michigan, with my family.   One night I was awakened by the sound of muffled panicked cries coming from the other side of my bedroom.  It was my brother Mickey who was a year younger than me, and I became immediately and fully terrified.  I was facing the wall away from him, and I knew there was no way I would look in his direction, because I knew something or someone was in the room and from the disturbing intensity of Mick's whimpering noises, I knew it was not Santa Claus.  I did not move a muscle or make a sound hoping that whatever IT was, would not know I was there.  So I literally played dead, as I desperately did not want the 'boogey man' to know I even existed.  My heart was pounding in my ears from fear, and my fears were not unfounded, as the next thing I hear is, “Look Out Jimmy!” , and I think Oh NO! He just told it I'm Here! Now folks, those words sent me crashing into a terror, that in a few moments would increase a thousand fold, for I am lying on my stomach and suddenly there is a long fingered claw/hand planted firmly on the middle of my back/spine, ( a witches claw?  An evil Monster?!, I was going to die for sure!! I am not kidding folks; this was Thee most frightening moment of my life. Suddenly I realize there is tremendous Heat coming thru its hand, so much so I could feel the heat coming clear thru my body, thru my chest/solar plexus area and onto the bed lying beneath me. And now shockingly, I am, without a doubt in my little boy’s brain, being stabbed to death with a knife as I felt the knife slowly 'corkscrew' deep into my body, though I never flinched or made a noise. That was my brave but useless way of hoping it might think I was already dead!  Accompanying this penetration is a deafening noise in my head, a hissing type noise which I took to be the monsters breathing over me! The sound was sort of “haaaaaaaa” which only intensified my terror.  Please note, that during these moments, I was unable to appreciate the fact that it actually was not painful. What I felt was more of a thick bluntness turning its way into me. Not long afterward, I felt the 'knife' come back out of me, I was shocked that I was still alive, though I did not want the 'invader! ' to know that. Then the heat stopped and its hand was removed from my back. And I Neither Made a Sound, nor Budged An Inch, Nor Opened My Eyes, Till The Sun Came Up!!  Before I finish this story, which is the second part. Let me make a few things clear. 1.  I Never for a moment forgot this experience, as it was clearly 'drilled' into my memory. 2.  For several days to a week, I snuck a knife from the kitchen that I was not supposed to have, and hid it under my pillow.  It was the only defense I could think of. But my mother soon found it, and took it away. 3.  I do not have any conscious remembrance of the following day or morning.  But I ‘feel’ like we were probably told, “you just had a bad dream”, by our parents.  It would also be reasonable to believe my parents may have checked my back, and saw nothing.  Or if they did, they never told me so. 4.  I Knew it Happened and I was Not sleeping, and it Was Not a dream. 5.  As life went on, and growing up, I Never discussed it At All with my brother Mickey, and as an adult, I totally assumed he would not remember that night. He was probably five or six at the time. I was wrong about that assumption, as you will see in Part Two of this story.  Part Two: Fast forward from about 1957 to about 1994 or so.  I am in my living room, here in Montana, with my wife (my beloved, who passed away in 2006), entertaining ourselves by sharing ghost stories and strange experiences, etc. and between my wife and I, we had lots of events to weave into the conservation. I had just finishing telling the above story, when one of the group asked if Mickey had ever said anything about that night.  I said “Well no, I am sure he won’t remember anything”. But suddenly, for the first time in my life, I thought, “why don't I ask him”? I have nothing to lose, but I hope he doesn’t think I am crazy. So right then and there, I pick up the phone and called him. He was living in Portland Oregon. The following is the basic conservation that took place minutes later in front of my wife and friends. “Hello Mick, hey, were telling scary stories and I am going out on a limb here, but Mick, do you remember a night, back on Dorchester......? (That’s the name of the street we lived on as children) Well folks, I swear, that's as far as I got in my question, when he interrupts me before I can say another word and says, “Yeah, I woke up to find what I thought was Casper the Ghost 'floating' over to the side of my bed and it was peering down into my face, with its hands held up in front and just above me. It had a big head and big black eyes, and I was completely terrified and totally freaking out. It just kept looking down at me and I was frantically crying or something, when finally it moved away from me, and went over to the crib that held Tim (my toddler age brother that slept in the room with us), and it raised its hand over the crib opening, and ITS Hand LIT UP!!! (I about fainted when I heard those words and the following: “Then it moved away from the crib and I saw it go over to you and I tried to warn you and I said “Look Out Jimmy!” as it bent all the way down over you and looked like it was touching you!!”  Well, I then told Mickey my end of the story (for the very first time), and of course the pieces of that puzzle now fit perfectly in my mind. He, however, remembered a few other details. He says he remembers some days/weeks afterwards, being taken to a doctor and having his brain x-rayed, because he said he was afraid to go to bed without the lights being left on, and he remembers night after night waking up shrieking with nightmares. I am sure my parents would have been very worried about him and he believes that for a period of time, he was under a great deal of stress, since mom and dad said “nothing happened, it was just a bad dream, and everything is ok”. All of which makes sense as to why I would have been sneaking a knife under my pillow. Mom and dad, of course, would naturally have been reassuring us that it was just “bad dreams”, but I (we), knew,  that night was No dream, so that, I am sure, left us feeling very Unprotected.  In summation, I am sure now that Casper the big head, big black eyed ghost, was a visiting ‘Grey’ alien. What I am unsure of is what did it do to me?? I figure that it either 'fixed' something in me, or, took DNA and /or left an implant, or all of the above? I suspect it left a tracking gizmo and took DNA, though of course, I don't know any of that for sure, but I since have had several uniquely close experiences with UFO's that occurred later in my adult life that lead me to believe we are connected somehow, for some purpose that I hope to understand perhaps sometime in the future? This is indeed a fascinating universe we journey upon. I thank you for your time. Sincerely james ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98464.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf83e",
      "summary": "Bright orange fireball seen for a about a full minute.",
      "city": "birmingham",
      "shape": "fireball",
      "date": "2013-07-14T00:00:00",
      "story": "Bright orange fireball seen for a about a full minute. Stuck my head out of the window to smoke a cigarette when I saw a slow moving bright orange light.   It looked like something would as if were falling through the atmosphere with a tail.   It appeared to be going one direction.   The light slowly dimmed as it went into the clouds. ((NUFORC Note:  We suspect that the sighting occurred at night, and have changed the time to reflect that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99758.html",
      "state": "AL",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa70",
      "summary": "Bright light object floating in night sky, disappears when another craft comes up.",
      "city": "birmingham",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Bright light object floating in night sky, disappears when another craft comes up Walked outside to my car, took a moment to look at the stars when I saw a bright round light floating in the sky, passing between other stars.  There was no navigation lights or any other type of flashing light attached to this object.  There is an airport very close to here, so I know my fair share of what aircraft fly over this area and what they look like at night.  The strangest part of all of this is a small drone like craft with blinking navigation lights was coming up behind the object, when it seemed to simply disappear.  This is not my first sighting of these objects in this area.  Have witnessed close to 5 within the past 9 months. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97385.html",
      "state": "AL",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0331",
      "summary": "Luminated orb.",
      "city": "birmingham",
      "shape": "sphere",
      "date": "2012-12-20T00:00:00",
      "story": "Luminated orb Walking outside to my car for work, saw an orb like object floating quickly across the sky moving south/ south east.  At first I thought the object was a star due to its intense brightness until I realized it was in motion.  It wasn't flying low, but it wasn't outside of our atmosphere either. Could still see its lumination as it went behind a small patch of cloud cover.   Ran inside to grab my boyfriend and he was amazed as well.  It looked incredibly similar to footage from Eceti ranch of their UFO phenomenon.   This is the third out of fourth sighting I've had in the past month.  There was no sound, and it resembled craft I have seen in the area, although the others were no laminated in this manner.   Fourth sighting was this morning 12/06 at 545am, driving I noticed a metallic object moving quickly across the sky, slightly luminated (not very intense)   In Hoover Alabama on hwy 150.  Object had no lights, no signal lighting or navigation lighting of any kind.   I am very excited to see what's to come in the future with this many sightings thus far. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95016.html",
      "state": "AL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f1c",
      "summary": "20-30 bright orange spheres flying in two's or three's, travelling from southwest to northeast without sound",
      "city": "birmingham",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "20-30 bright orange spheres flying in two's or three's, travelling from southwest to northeast without sound Birmingham Alabama, 8:10 to 8:18 pm.  Many orange spheres (20-30) flying in pairs or in threes travelling very fast from south west  to north east.  No sound. Three of us were standing in the front yard, and saw some orange/red lights coming up from the south west to the north east.  There were no sounds coming from any.   They were moving quite quickly.  They tended to be in groups of 2 or 3.  No flashing lights as would be on an aircraft.  The light was very bright.",
      "link": "http://www.nuforc.org/webreports/107/S107896.html",
      "state": "AL",
      "duration": "8-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c13b0",
      "summary": "Red and white lights appearing to be connected.  Large string of lights.",
      "city": "birmingham",
      "shape": "formation",
      "date": "2014-01-16T00:00:00",
      "story": "Red and white lights appearing to be connected.  Large string of lights. Looking north towards Birmingham, was parking my car and saw a string of several red lights and a white light heading west.  I don't remember an exact number, but I believe there were 4-5 red lights, then a white one, then 1 or 2 more red ones.    There appeared to be one red one below the main line as well.   The lights appeared to be connected as they remained at an equal distance from each other for the duration of the sighting.  The object was fairly large and was too long to be an airplane.   The full moon is out tonight and the whole string of lights would have been approximatly 4-5 full moons wide. The object was not going particularly fast.  I saw it along with my boyfriend.  We watched until it disappeared behind the treeline.  No sound was observed, but it appeared to be pretty far away and was roughly in the flight pattern of BHM. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106328.html",
      "state": "AL",
      "duration": "~1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c141d",
      "summary": "Rotating lights moving rapidly across the sky.",
      "city": "birmingham",
      "shape": "formation",
      "date": "2014-01-16T00:00:00",
      "story": "Rotating lights moving rapidly across the sky. One object coming from east and heading west across the sky.  The object had 6 lights that were blue, red, yellow and white.  The lights appeared to be rotating as the object moved rapidly across the sky.  Then, the lights disappeared one by one until it completely disappeared.",
      "link": "http://www.nuforc.org/webreports/106/S106364.html",
      "state": "AL",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1520",
      "summary": "A cylindrical ship, blue in color, heading accross and down, and then dissapearing.",
      "city": "birmingham",
      "shape": "cylinder",
      "date": "2013-12-12T00:00:00",
      "story": "A cylindrical ship, blue in color, heading accross and down, and then dissapearing. The ship came down from the sky, it was a whitish blue light, the object was cylinder like.  It came across the sky and down and then disappeared.  I looked at my son who is 11 and asked,” did you see that?”  He said very excitedly yes, I saw it too.  We described to each other what we saw and marked the time at 6:00 P.M. exactly.  It did  not have a tail but looked more like a computer cursor.  It headed into the trees, but we saw no explosion like we expected, instead it just disappeared..",
      "link": "http://www.nuforc.org/webreports/105/S105246.html",
      "state": "MI",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a4d",
      "summary": "Red glowing object in the sky.",
      "city": "birmingham",
      "shape": "egg",
      "date": "2014-06-04T00:00:00",
      "story": "Red glowing object in the sky. Driving back from the store and then we see a small red glow like it wasn't a light it emitted its on glow we thought it was one of those balloons with the candles but as we looked closer we saw it was in a weird egg shaped disc with a slightly pointed nose and we stopped the car and looked out the windows and it stopped over some houses about 300 feet away in the distance.",
      "link": "http://www.nuforc.org/webreports/109/S109620.html",
      "state": "AL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c20",
      "summary": "2 fireballs floated from opposite side of lake 50 meters over head. Crossed over our heads and disappeared 30 meters passed us. Objects",
      "city": "birmingham",
      "shape": "fireball",
      "date": "2014-07-05T00:00:00",
      "story": "2 fireballs floated from opposite side of lake 50 meters over head.   Crossed over our heads and disappeared 30 meters passed us.   Objects were of flame.",
      "link": "http://www.nuforc.org/webreports/110/S110952.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c31f4",
      "summary": "It flew from one end of runway to the other shoot straight up turn back shine bright light shoot straight down do it again 100 mph",
      "city": "birmingham",
      "shape": "cylinder",
      "date": "2015-04-03T00:00:00",
      "story": "it flew from one end of runway to the other shoot straight up turn back shine bright light shoot straight down do it again 100 mph it happend at the birmingham airport clear blue skies it was flying above the run way like to land and when it reached the end of the run way it would shoot straight up in a gentil way and about 100 miles an hour it would fly up like 1/4 of a mile and turn back to the start of the run way half way back it would shine very bright lite it would continue and then it would  turn straight down before it reached the ground it would turn horizotal gently at same speed act like to land and go to end of run way and do the same thing again i must say it made no noise no smoke no sign of propulcion as if defying gravity no wings propeller size of about a small car and metalic color at the time my brother and i felt anoyed by it but now i realize it was something special happening i will take a poligraph test to prove this is true. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118076.html",
      "state": "AL",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c38d3",
      "summary": "Disappearing star.",
      "city": "birmingham",
      "shape": "light",
      "date": "2015-01-09T00:00:00",
      "story": "Disappearing .Star I was observing what looked to be a really bright star as I walking to my car.   The star-like object literally blinked out (disappeared) before my eyes.",
      "link": "http://www.nuforc.org/webreports/116/S116591.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a1b",
      "summary": "UFOs moving fast like fireballs or individual rockets.",
      "city": "birmingham",
      "shape": "fireball",
      "date": "2014-12-12T00:00:00",
      "story": "UFOs moving fast like fireballs or individual rockets. We were leaving Centerpoint, Alabama.  When we got past the airport, we sighted 6 of what looked to be white dots from our car.  Then, as we got closer to downtown, we got a better view.  The objects look like fire balls, or meteors, flying through the sky.  I recorded one of them moving toward Tuscaloosa, Alabama.  All the others moving fast and out of sight fast, moving in no specific sequence, but at one point, in a T-formation, then a V-formation, then breaking off in a scatter, but a close scatter.",
      "link": "http://www.nuforc.org/webreports/115/S115924.html",
      "state": "AL",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3fc4",
      "summary": "(UFO) over I-20 bright light.",
      "city": "birmingham",
      "shape": "light",
      "date": "2015-06-15T00:00:00",
      "story": "(UFO) over I-20 bright light. My wife and I were heading west on I-20, when we noticed a bright light out of the driver’s side window (South).  The object was extremely bright even at the distance of about 5 miles from our location.   The light just popped up and while my wife was still looking at it, it vanished.  Not behind a cloud, it did not take off or fade into the distance, it just vanished.   As a computer engineer, and her as a data analyst, we both used the process of elimination and there is nothing that can account for the object.",
      "link": "http://www.nuforc.org/webreports/119/S119560.html",
      "state": "AL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5343",
      "summary": "What is this type of object without lights?",
      "city": "birmingham",
      "shape": "other",
      "date": "2016-01-14T00:00:00",
      "story": "What is this type of object without lights? During the early morning Friday, Jan 6, 2016, I woke up, looked out of my bedroom window, and saw an object that looked like a silver chandelier.   I said to myself there are no flashing lights.  This is not an airplane.   What could this be?  I know I could not get this sight out of my head.  I'm physically challenge and could not get out of my bed in time to see what had happen next.  \"Sorry\".",
      "link": "http://www.nuforc.org/webreports/125/S125198.html",
      "state": "AL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5aab",
      "summary": "8/15/1979 Birmingham, MI, formation of at least 5 red, silent, UFO's.",
      "city": "birmingham",
      "shape": "formation",
      "date": "2016-04-15T00:00:00",
      "story": "8/15/1979 Birmingham, MI, formation of at least 5 red, silent, UFO's. At 10:45 p.m., just after it became dark, we walked outside of our house and noticed several people looking up at the sky.  It was cloudless and the stars were out.  There was no wind. We looked up and observed 5 very large red round lights, about a mile up in the sky. They were about 3 times larger than a small plane.  We concluded this because as  we watched about 15 minutes into it, we saw a small aircraft racing towards the red crafts.  But they disappeared before the plane could catch up to them. They were silent the entire time, not pulsating but staying bright red and and slowly following in sync formation, from the North West to the North East. There may have been more than 5 red craft but we observed 5 by the time we walked outside and noticed them.  We estimated this line of formation was at least a mile in length.  I used a tree branch as a point of reference and watched them each disappear at the same point when they reached the tree branch. After 20 minutes, they disappeared completely and we all discussed what we just witnessed for about 10 minutes.  Everyone felt they were genuine UFO's because we knew there was no current technology at the time to be able to create such an event.  Then we drove to the closest police station and told the police they would think we were crazy because we jsut saw UFO's but they replied that they must be crazy too because they also watched them. I kept watching the local news and reading the local paper every morning and night and became frustrated because the media wouldn't report a story on it.  Finally a week went by and the paper wrote a small story on it.  The article showed a photo of a weather balloon and the paper stated they were merely weather balloons.  But it was too obvious they weren't.",
      "link": "http://www.nuforc.org/webreports/126/S126737.html",
      "state": "MI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6189",
      "summary": "Saturday me my sister mom and dad went to coyote drive in movies in Leeds Alabama  at first as we were watching the movie i seen what h",
      "city": "birmingham",
      "shape": "triangle",
      "date": "2016-10-11T00:00:00",
      "story": "Saturday me my sister mom and dad went to coyote drive in movies in Leeds Alabama  at first as we were watching the movie i seen what had appeared to be a shooting star but as i started to follow it it disappeared i thought i was seeing things but then things got weirder It was around 10 pm when my mom got out of the car to smoke and i also went outside just to look at the stars but as i was looking i seen a weird object a triangle shaped object that i thought at first it was a air balloon because it seemed to be floating my mom was on the other side of the car i yelled to my mom \"what is that!\" she then looked up and told my dad and my sister then got out of the car We then tried to follow the strange object but it just disappeared from my moms angle she said she seen lights up under it then we say one of those what appeared to be a \"shooting star\" again that was such a weird sighting and it felt like we were the only ones to see it Till! this day i still have questions regarding to what that was, this story which sounds unrealistic but strange?",
      "link": "http://www.nuforc.org/webreports/130/S130555.html",
      "state": "AL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6c33",
      "summary": "Heard low rumbling sound, saw a big ?? In the sky before it disappeared.",
      "city": "birmingham",
      "shape": "changing",
      "date": "2017-01-12T00:00:00",
      "story": "Heard low rumbling sound, saw a big ?? In the sky before it disappeared. I was asleep in bed with my girlfriend, having a random simple normal dream about a supermarket, when the dream abruptly switched to an empty white room where men in blue hoods were rushing toward me, I awoke with a gasp for air and a balled fist.  I then noticed a low rumble sound coming from outside.  I opened the window to see a large black and purple amoeba-like object in the sky. It looked as if it were made of gel or some type of thick liquid.  It stayed for about five minutes before completely fading away and the sound shortly followed. It didn't fly away, it's like it simply became invisible. Tried to take a picture but my battery died as soon as I opened my phone. I feel like I should also note that our cat was running around the room which is not normal for him at all. I am a 25 year old male, and I've never seen anything like this before.  It has been over two and a half years since my last experiment with psychedelic drugs.",
      "link": "http://www.nuforc.org/webreports/132/S132096.html",
      "state": "AL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e80",
      "summary": "Twinkling amber lights in formation.",
      "city": "birmingham",
      "shape": "formation",
      "date": "2017-08-17T00:00:00",
      "story": "Twinkling amber lights in formation My fiancé and I were traveling home in my vehicle after grocery shopping.  He suddenly said, \"Look up!\" as he leaned forward over the steering wheel.  When I leaned forward and looked up I saw what I estimated to be a dozen or so twinkling/blinking/phasing objects flying in a close V-formation.   He pulled over immediately, and I turned on my phone's camera to record video. (Due to technical error on my part, I missed recording most of the sighting.)  Initially, they were overhead.  I had difficulty understanding what I was seeing, as the twinkling was disorienting, especially that if one blinked out completely, it might reappear elsewhere suddenly.  They did not maintain formation for very long, due to the leap-frog-like blinking in and out.  (The objects both twinkled and blinked out completely.)  The color of the lights/ objects was a light amber color.  There was no sound beyond traffic (we were near an interstate on-ramp).  The shape was basically spherical. The twinkling sometimes gave the hint of an egg-shape, but I believe that to be an optical illusion. I witnessed the objects seeming to disappear and reappear from the V-formation, some of them failing to reappear.  They were moving from the western suburbs of Birmingham toward the city of Birmingham.  Eventually, the lights were either too far away to see or they had just disappeared.  I was able to get a fairly poor quality video (33 seconds of one or two of them in the distance) that demonstrates the \"twinkling.\"  Sometimes the lights moved toward their destination before blinking out.  That's how I was able to comprehend they were reappearing elsewhere after they blinked out. My fiancé said he did not see as many ibjects as I did.  He saw about half as many, but he was driving in traffic, and I was completely focused on the sighting from the moment he pointed out lights in the sky. The objects were flying far too close together to be any manned craft of which I am aware.  Initially, I had assumed it was military exercise, then I thought it was helicopters.  Logically, it could not have been helicopters.  Not only was the light-color wrong for any aircraft I've seen, but - beyond Blue Angels, I've never seen aircraft fly so closely in formation. The number of lights dwindled to two, then one, and I lost sight.  I didn't get the impression that they were moving especially fast, but I don't know how low they were flying.  I had an overwhelming sense of disorientation which certainly contributed to guessing at their altitude.  They flew over radio towers, but before I saw that, I would have said they were flying very low overhead. To be clear, it was dark and I saw no physical objects beyond the lights.  I have spoken about them assuming that the twinkling was somehow a part of a physical object.  I can't conceive of how the twinkling wouldn't be attatched to a physical object of some sort.",
      "link": "http://www.nuforc.org/webreports/135/S135652.html",
      "state": "AL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7235",
      "summary": "Round object viewed from airliner.",
      "city": "birmingham",
      "shape": "disk",
      "date": "2017-07-14T00:00:00",
      "story": "Round object viewed from airliner I snapped this picture from my seat on a flight from San Francisco to Atlanta. The picture was somewhere northwest of Birmingham, Alabama.  I noticed it outside my window, and figured it was another airliner.   After observing it a few seconds, I noticed it didn't look like another jet.  I couldn't see any wings or tail fin. It was in view for maybe 20 seconds or so before it changed directions and went out of my view. I am not sure of the time. The only reason I have a rough idea of a location is because I noticed the guy beside me had his flight tracker up on his seat monitor about 3 minutes after my sighting. I was heading East, the object appeared to be heading southeast at a 45 angle to us but never seemed to get closer or farther from us unti it changed its direction to south. The object looked whitish in color, shaped almost like a blimp or a football.  My best guess would be 10-20 miles away from our aircraft.",
      "link": "http://www.nuforc.org/webreports/135/S135113.html",
      "state": "AL",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7493",
      "summary": "I heard a low humming sound.",
      "city": "birmingham",
      "shape": "unknown",
      "date": "2017-05-06T00:00:00",
      "story": "I heard a low humming sound. About 3 am, I was up watching tv, when I felt a low humming in the air.  It had a wide range of volume so I knew it couldn't be in the house because of the brick structure I was in.  I walked outside as the humming got stronger, looked up and saw nothing but complete darkness which was normal but the humming was right above me and moving.   Then about thirty seconds later, I noticed the black sky I thought I was seeing was moving cause now I can see the back of it moving away making view of the real night sky with stars and night light.  The black object slowly moved on over my back yard which is three acres but the object was at least one mile long and one mile wide cause of the duration of time it took to become noticed by sound and the time it took to disappear.  It was about a quarter mile above my trees.  The sound was a air humming sound with no detonation.",
      "link": "http://www.nuforc.org/webreports/133/S133878.html",
      "state": "AL",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c756f",
      "summary": "I saw a black oval shaped large ufo go straight up through trees into the clouds. Seemed 1 mile away.  ((anonymous report))",
      "city": "birmingham",
      "shape": "oval",
      "date": "2017-04-28T00:00:00",
      "story": "I saw a black oval shaped large ufo go straight up through trees into the clouds.   Seemed 1 mile away from my eye sight. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133779.html",
      "state": "AL",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7710",
      "summary": "Object that is the size of a small star changed size, light intensity, and rapidly dropped to the ground after 40 seconds of observatio",
      "city": "birmingham",
      "shape": "light",
      "date": "2017-12-21T00:00:00",
      "story": "Object that is the size of a small star changed size, light intensity, and rapidly dropped to the ground after 40 seconds of observatio My Sighting:  \tAt approximately 3:47, I observed a light in the sky, too small to be a plane even at its biggest shape.  The object was moving in an alarmingly strange fashion, which is what initially caused me to observe it.  I will state my location, which is Birmingham, Alabama, traveling northward at the time on Highway 280, but waiting in the turn lane to turn on I-459 South.  I noticed the light intensity on this object was changing in an unpredictable way, much like the movements.  While the movements and shapes of this small star shaped light were sporadic, it did move in a general direction of east to west. About 40 seconds after observing said object,  I noticed it got harder to follow.  When it became visible again, it dropped to the ground at an extremely fast speed.  I should also mention that it was daytime and my visibility was clear.  I spoke to the hotline manager at 3:55 to report my sighting.",
      "link": "http://www.nuforc.org/webreports/137/S137767.html",
      "state": "AL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d64",
      "summary": "Unusual silent penney sized at arm's length object crossed sky rapidly unusual brownish pale orange band in shape.",
      "city": "birmingham",
      "shape": "other",
      "date": "2017-09-12T00:00:00",
      "story": "Unusual silent penney sized at arm's length object crossed sky rapidly unusual brownish pale orange band in shape. Object moving East to West silently approx 75 degrees above horizon.  Apparent size that of a penney held at arms length. Object was moving above or through broken clouds which may have contributed to a bit of transluscence.  Color of object was indistinct but seemed to have a brown overtone with some other hints of yellow pale orange that seemed to partially frame a rectangular subshape-curved on the front, squaarish in the rear.  Perhaps oval overall, hard to say. Object went across about a third of the sky in 2 seconds before disappearing behind trees.  I am a regular observer of the night sky, having a telescope for many years.  Never saw an object like this, ever.  Perhaps could have been much higher if perhaps it was a bollide or some object in the upper atmosphere- it would have to have been moving extremely fast.  Did not really look like any shooting star I've ever seen, and I have seen many. ((NUFORC Note:  We spoke via telephone with the witness, and he sounded to us to be quite sober-minded.  We suspect that he is an exceptionally capable, and reliable, witness.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136113.html",
      "state": "AL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b9e",
      "summary": "14 objects with bright red/orange lights.  ((NUFORC Note:  Husban is former FBI Special Agent.  PD))",
      "city": "birmingham",
      "shape": "unknown",
      "date": "2019-02-27T00:00:00",
      "story": "14 objects with bright red/orange lights The following event occurred between 9:15PM and 9:45PM on 2/18/19 at Birmingham, AL: To set the stage for what my wife and I observed, I need  to mention that our bedroom has a large bay area with seven windows which have plantation type shutters, covering the lower half of the windows, leaving  the upper portions open to the sky.  We can lie in bed and look out at the stars or passing aircraft in the sky.  On this particular night, the sky was clear. During the above time  frame, I was watching TV when my wife remarked, “What in the world is that? I looked out of one of the windows to observe something moving in the sky from a northwestern direction toward the southeast.  What we were looking at was something with a very bright red light on top of an orange light.  We at first thought it was a helicopter but I have never seen a helicopter with that type lighting.  My wife then said, “Look, there is another one.”  I remarked that there must be a bad wreck, and they are sending two helicopters.  (It is noted that we live near a hospital, and it is not unusual for us to see and hear helicopters at night).  We the saw a third object ; and then a fourth; fifth and sixth.  All of these objects looked alike with the same red and orange lights.  All six of  these objects were visible at one time. My wife jumped out of bed and went to the other end of our house to see where these objects were going.  They kept coming about fifteen seconds apart.  We observed a total of fourteen of these object, all with the same lights. All of these objects followed the same path and seemed to be traveling at  about  the speed of a helicopter. Some of them seemed to be at an altitude of about 2,000 feet and some at about 1000 feet although this is only a guess.  As they passed not far from our house, they seemed to climb to the southeast and then disappear. The fact that we never heard any sound from these objects caused us to think they might be  drones but why would there be fourteen of them all going the same route?  We were never able to see any frame as all we could focus on were the bright red and orange lights. There is nothing of interest known to us that would be on the course that these objects took. ((NUFORC Note:  We spoke via telephone with the husband, and we found him to be exceptionally eloquent and serious-minded.  We suspect that both he and his wife are unusually reliable witnesses.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145014.html",
      "state": "AL",
      "duration": "30 minutes"
    }
  ]
}