{
  "city": "boston",
  "fetch_timestamp": "2025-07-12T14:25:48.220908",
  "record_count": 65,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4161",
      "summary": "Observed strange large disk like craft.",
      "city": "boston",
      "shape": "disk",
      "date": "",
      "story": "Observed strange large disk like craft. Observed a strange \"craft\" in a local golfcourse/reservation area.  Was not a commercial aircraft.  It landed and appeared to hover over the ground, was very large and was emitting a strange whirling sound and eletrical looking sparks. There were no markings visible are lights on \"craft,\" the craft itself was very dark colored. A very scary experience. Saw by four people, and they were all quite terified. It suddenly shot upwards, and disappeared or vanished just above tree line. Left behind something similiar to a vapor trail. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49679.html",
      "state": "MA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b43ba",
      "summary": "3 totally black and silent cigar shapes flying at a low height through edge of city center",
      "city": "boston",
      "shape": "cigar",
      "date": "2006-05-15T00:00:00",
      "story": "3 totally black and silent cigar shapes flying at a low height through edge of city center Traveling home in a taxi at 21.30 on Friday 24th March. Driving through city center. Looked to my left away from city as something caught my eye. Saw 3 totally black cigar shaped objects flying in a perfectly straight line, almost in formation, 1 behind the other at slightly different heights. They had no lights at all and were sillouetted against a bridge in the distance. They seemed to be even lower than a helicopter would fly. I drew a picture of these 3 cigar shapes when I got home and only have reported this now as I read about identical descriptions. I saw them for maybe 20 seconds before they passed. They weren't flying that fast but seemed to be silent. No noise like an aiircraft.",
      "link": "http://www.nuforc.org/webreports/049/S49813.html",
      "state": "MA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b43ff",
      "summary": "At 12:52 am on Saturday morning April 1, I saw a large fiery orange ball arch across the sky from NW to SE (I think).  It was the about",
      "city": "boston",
      "shape": "fireball",
      "date": "2006-05-15T00:00:00",
      "story": "At 12:52 am on Saturday morning April 1, I saw a large fiery orange ball arch across the sky from NW to SE (I think).  It was the about 1/4 size of the full moon streaking across (arching) the sky.  It seemed to break up, and get smaller the closer it got to the horizon, it also appeared first as a fiery ball and then broke down (got smaller and smaller with a tail.)  I have seen shooting stars before, but,never this large or bright.  I posted this on a photography website, asking if anyone else saw this--no one did.  I was told it was probably a shooting star or meteror...",
      "link": "http://www.nuforc.org/webreports/050/S50021.html",
      "state": "MA",
      "duration": "less than 2sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b4a5d",
      "summary": "Myself and a friend have been terrorized and tortured by alien entities since October 2011",
      "city": "boston",
      "shape": "light",
      "date": "2019-06-27T00:00:00",
      "story": "Myself and a friend have been terrorized and tortured by alien entities since October 2011 I was around the Mass General Hospital around may 2016 when I noticed unusual light in the sky the light did not come from a plane or searchlights on the ground a month later I witnessed the same light in the sky over Nahant in Essex County",
      "link": "http://www.nuforc.org/webreports/147/S147082.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b53dd",
      "summary": "Boston Harbor light show",
      "city": "boston",
      "shape": "sphere",
      "date": "2007-10-08T00:00:00",
      "story": "Boston Harbor light show    Several of us were outside the Boston aquarium, looking into the clear night sky over Boston Harbor when we witnessed a fairly extensive display of light lasting several minutes. The phenomina included a single sphere of light ranging from light gold to pure white and varied from barely visible to, at one point, bright enough that it lit up the entire harbor so that we could see our shadows from what could have been several miles away! \tMostly flying in linear patterns which at times teased what appeared to be military fighter jets, the ball of light seemed to accelorate and decelorate either immediatly or at rates reflecting an absense of enertial consequense. When it finally left the area it did so at a constant rate of acceloration far beyond the capability of the jets. The demonstration of so many inconsistancies with what I had previously considered possible left me sure i was being left out of some informational loop. Date is best guess ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58227.html",
      "state": "MA",
      "duration": "10-15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6d11",
      "summary": "Large cylinder moving north at great speed without sound over logan airport. ((NUFORC Note:  Possible contrail??  PD))",
      "city": "boston",
      "shape": "cylinder",
      "date": "2008-02-14T00:00:00",
      "story": "Large cylinder moving north at great speed without sound over logan airport. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  Possible contrail??  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61282.html",
      "state": "MA",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b7459",
      "summary": "fast moving odd shaped craft",
      "city": "boston",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "fast moving odd shaped craft Saw only briefly and only saw the back of it, not sure of the entire shape. Craft was moving very fast, when it first caught my eye, I thought it was 3 fighter jets in formation, because of the speed. On closer look, it definately was one large craft and very unlike fighter jets.  It was silent, almost appearing to be gliding, but gliding very, very fast.  much faster then a jet, and flying very low.  Only saw the back - had distict dark 3 cylindar shapes. Two cylindar shapes appeared parallel,with distinct round ends and one smaller cylindar shape below.   View obstructed by buildings and trees, but it was moving so fast it would have been out of sight range quickly anyway. Just wondered if anyone else saw something odd.",
      "link": "http://www.nuforc.org/webreports/052/S52666.html",
      "state": "MA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7587",
      "summary": "green light streaks over the middle of the Charles River in the area of the Hatch Shell",
      "city": "boston",
      "shape": "fireball",
      "date": "2007-02-01T00:00:00",
      "story": "green light streaks over the middle of the Charles River in the area of the Hatch Shell A green cohesive light streaked at incredible speed about 500ft above the Charles River heading due west  almost colliding with an on-coming low-flying aircraft; seen at dusk from the north facing Charles St T Station platform by myself and at least 2 other witnesses.",
      "link": "http://www.nuforc.org/webreports/054/S54713.html",
      "state": "MA",
      "duration": "1-2sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b83cf",
      "summary": "large lights flashing rapidly",
      "city": "boston",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "large lights flashing rapidly 2 are blue 3are yellow 1 was not a color ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66915.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8855",
      "summary": "Bright light in the sky",
      "city": "boston",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "My boyfriend, our friend, and I were sitting on our second floor front deck that looks out towards the Peter's Hill section of the The Arnold Arboretum in Jamaica Plain (an area of Boston proper) having dinner. Our house is up on a hill so we can see well over the few rooftops below us that look to the South West sky towards Needham and Route 128/95 - it's all tree tops from the park looking towards the horizon. As we were eating I looked up to speak to my BF and a very bright light in the sky behind him caught my eye - it wasn't there a minute before. No other stars were out since the horizon was a pale yellow and the sky above shades of blue - it was just starting dusk - but not nearly dark yet and a very clear night. I pointed out the light and the two people saw it and agreed it was really bright  - and stationary in the sky. They were puzzled by it as was I. I said it's probably a planet but I'll watch it and see if it moves across the sky. I would estimate it was 20-30 degrees above the horizon. I observed it for about eight minutes without it moving in the slightest. I then went inside to grab something from the kitchen (maybe 15 seconds) and when I returned it was nowhere in sight... and it couldn't have possibly moved behind something since we were so high up and could see for miles around it - nothing would have obstructed the view. It just vanished. We didn't see it again. Other aircraft were visible and easily identifiable and nowhere near this light. No sound was heard but that's not surprising seeing how we felt it was miles away.  We are all professional men and women. Ph.d., Actuary and an I.T. Director. None of us were inebriated.",
      "link": "http://www.nuforc.org/webreports/065/S65390.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ab5",
      "summary": "hovering lights over Boston pre-dawn",
      "city": "boston",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "hovering lights over Boston pre-dawn 4 disc shaped lights moving at high speed in erratic eliptical patterns, mostly counter-clock-wise, at times appearing to move two at a time in unison as a pair, appearing low in the sky above downtown business district, visible steadily, 1st spotted pre-dawn around 5:40 am and visible until about 6:10 am. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72822.html",
      "state": "MA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8c1c",
      "summary": "Two cigar shaped craft spotted lowering object into the boston side of the charles river.",
      "city": "boston",
      "shape": "cigar",
      "date": "2009-03-19T00:00:00",
      "story": "Two cigar shaped craft spotted lowering object into the boston side of the charles river. I saw 2 large cigar shaped craft quickly enter an area over the Charles River basin. The first craft appeared to be glowing red and I would imagine, very hot. At 23:00 I could not get to bed, so I got up to hangout in the living room. Then all of the sudden, I heard an eerie droning sound. Scared, I got up to look out the window. There were 2 craft that seemed to be lowering a kind of large tray in to the river. This lasted for 30 minutes, and then the craft silently sped off to the west. After that period of 30 minutes, I started to feel nauseous and had a headache. I threw up and then went to bed.",
      "link": "http://www.nuforc.org/webreports/068/S68247.html",
      "state": "MA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9340",
      "summary": "Smooth moving orb with four rotating lights !",
      "city": "boston",
      "shape": "oval",
      "date": "2009-12-12T00:00:00",
      "story": "Smooth moving orb with four rotating lights ! We were driving to the train station at 915 when we saw an orb like bright light moving in our direction aprox. 200-300 feet above the ground. We both were amazed and I stuck my head out of the window to get a better look.  It was almost directly above us and it was no longer a bright white light but an oval shaped craft with a square compartment on the bottom that was spinning clockwise.  There were 4 colored lights on the bottom (2 red and 2 blue) after looking at it for about 2 minutes it vanished.  My eyes couldnt stop watering for about an hour.  Crazy ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73244.html",
      "state": "MA",
      "duration": "2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fcf",
      "summary": "Giant white glowing Star like object (diamond shaped) above Boston MA",
      "city": "boston",
      "shape": "diamond",
      "date": "2009-08-05T00:00:00",
      "story": "Giant white glowing Star like object (diamond shaped) above Boston MA My friends and I were driving to a club in Boston.  We got lost and I looked up into the sky and noticed a giant bright white star.  To my eyes, it appeared diamond shaped. I watched it as we drove towards it and noticed it did not change directions or even move.  It stayed perfectly still. My friend thought it was a star until we noticed clouds moving behind it.  We had no idea what it could of been. As we turned around to try and find our way through the city on search of the club we were going to. We moved away from the giant star like object.  I could no longer keep it in my eye of view. But for 5 whole minutes during that time of driving towards it, I watched it from the car window.  Did not take my eye off of it.  I wanted to make sure it wasn't a plane or something more explainable. We ended up getting lost again until we were right back where the giant white reflective star was and I saw it again.  This time it had moved towards the west side and again was sitting perfectly in the sky that had no stars in it.  Since Boston is very bright, you normally don't see stars. We ignored the object and drove away to find our destination.  At 2:30am after we got out of the club, I looked for it again on our drive home and did not see it. Description:  This object seemed large, diamond or circular shaped.  It was silent.  Stayed perfectly still. All electronic devices in our car were working (cellphone and other gadgets)  If it did move, it moved very slowly then paused.  Moved up and down behind the clouds then back out again to where you could noticed the clouds behind it.  Very bright and color was off white.  It was Glowing. No other star or aircraft was in the area.  Just clouds and dark sky.",
      "link": "http://www.nuforc.org/webreports/071/S71306.html",
      "state": "MA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5e5",
      "summary": "The object was metallic and spherical, and a light silver in color. It glided through the air slowly and seemed to hang in the air for",
      "city": "boston",
      "shape": "sphere",
      "date": "2009-05-12T00:00:00",
      "story": "The object was metallic and spherical, and a light silver in color. It glided through the air slowly and seemed to hang in the air for a while. It moved very strangely because it seemed to travel in a very straight line.  The air around the object seemed like it was vibrating or the object had a haze around it. It flew much higher than the buildings around it but not as high as a plane passing by.  It was hard to tell if it was close to me or far away so I could not tell the size of it.  The bottom of the object was hard to see, but it looked black and flat.",
      "link": "http://www.nuforc.org/webreports/069/S69956.html",
      "state": "MA",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba97c",
      "summary": "large V shape ufo responded to my calls. ((NUFORC Note:  We cannot be certain that this is a serious report.  PD))",
      "city": "boston",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "large V shape ufo responded to my calls. On december 23rd i was praying outside to the creator.  i asked him questions about existence and i was feeling suicidal.  after making my prayer i seen a large object.  7 of them glowing orange, flying low to the ground.  i inquired about certain things i read about ancient aliens.  after about 5 minutes this craft appeared in the sky for about 5 seconds.  i know they heard me and decided to give me a chance to see there magnificent ship.  it was low enough that i seen that they where mettallic and there were 7 of them flying in a v formation.  I  know they were reaching out to me. ((NUFORC Note:  We cannot be certain that this is a serious report.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78915.html",
      "state": "MA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bac46",
      "summary": "Bright UFO above Boston, Ma",
      "city": "boston",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "Bright UFO above Boston, Ma Saucer shaped object with 3 different color lights.  Center light was red and outside that green lights and on the outside of the saucer it was bright white lights.  It stayed still for like 5 mins. and then moved slowly, then super fast and disappeared all lights dimmed and Poof gone.  Completely disappeared and haven't seen it since then.",
      "link": "http://www.nuforc.org/webreports/078/S78367.html",
      "state": "MA",
      "duration": "5+ mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bac20",
      "summary": "Orange lights in the sky",
      "city": "boston",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Orange lights in the sky Two orange colored lights in sky appeared suddenly... side by side, no sound , no commercial flashing tail or wing lights seen  moving east to west  south of Boston. I believed to see what was a triangle shape, but what was odd was the fact that the ‘whatever it was’ was near invisible. I saw the two orange lights clearly, but could also make out what appeared to be a triangle shape of ‘diffused light’ as if I was looking through water. The lights themselves were somewhat diffused as well, round and large, and never changing position relative to each other.  I thought to myself, ‘what was that?’ as I was standing in an area south of Boston and near Logan airport… after a moment of contemplation I thought ‘not a plane’ still looking up suddenly another object of similar shape, with two diffused orange lights, side by side, this one much smaller and following the same path as the larger ‘craft?’ Again, as if I was watching a flying triangle made of water, diffusing the light, but when looking directly at it, one could absolutely see it moving across the sky. Both were moving much faster than what I’d describe as normal speeds for an aircraft -plane or helicopter.",
      "link": "http://www.nuforc.org/webreports/078/S78274.html",
      "state": "MA",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2f7",
      "summary": "Changes shape and flashing lights- one dark window- blue beam came down- picked up something  5",
      "city": "boston",
      "shape": "changing",
      "date": "2010-08-24T00:00:00",
      "story": "Changes shape and flashing lights- one dark window- blue beam came down- picked up something   The craft changed shape and woosh, it dissappeared!!!  plus it picked up something with a strange bluish beam.",
      "link": "http://www.nuforc.org/webreports/077/S77107.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3ec",
      "summary": "bright light changing shape and moving quickly away",
      "city": "boston",
      "shape": "changing",
      "date": "2010-11-21T00:00:00",
      "story": "bright light changing shape and moving quickly away I'm a bartender and had just got off of work,and was driving home.  Suddenly,i noticed a bright light in the distance.I knew it wasn't a plane.I pulled over to the side of the road and continued to observe.  This object,as it got closer to me,changed shape from a round or cylindrical object,to a somewhat rectangle.It then bolted at an incredible speed,away from me and out of sight.",
      "link": "http://www.nuforc.org/webreports/078/S78867.html",
      "state": "MA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3eb",
      "summary": "seeing flashing ,red,white and green round object. that moves in a cicular motion very fast.  ((NUFORC Note:  Twinkling star??  PD))",
      "city": "boston",
      "shape": "flash",
      "date": "2010-11-21T00:00:00",
      "story": "seeing flashing ,red,white and green round object. that moves in a cicular motion very fast if u dont watch it carfully u cant see it. I have been seeing the same craft for over a month now and it flashes red,white,and green.it moves in a circular mostion and very slitly ,and about 3 weeks ago i saw 5 of them flying in a formation that made a huge triangle that looked to be ove a few miles wide and i thought i was crazy. but i dont think i am but i dont have a camcorder to video it ... but i c them almost every nite. have not seen them in formation but only the one time...",
      "link": "http://www.nuforc.org/webreports/078/S78827.html",
      "state": "NY",
      "duration": "1 hr"
    },
    {
      "_id": "64d005f478aba2ec5a3bbff1",
      "summary": "Dark triangular craft glided over Boston on 11-05-11 at 5 AM",
      "city": "boston",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "Dark triangular craft glided over Boston on 11-05-11 at 5 AM Viewed from a patio on 65 chelsea st. in charlestown,  facing south.   At dawn I witnessed an unlit and silent triangular craft glide toward the financial district in downtown boston.  My best guess as to it's size is 60-80 feet across.  I estimate its speed at 150 miles per hour.  It glided without wing tip down from the northeast and over the city then took a southward curve.",
      "link": "http://www.nuforc.org/webreports/085/S85207.html",
      "state": "MA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2ea",
      "summary": "Second sighting. First on Cape Cod, Second in Boston",
      "city": "boston",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "second sighting.  First on Cape Cod, Second in Boston very clear ball of light.  Was not too high up nor close enough to touch any building.  The object flew from my right to left fast enough to not be identified as a plane. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85483.html",
      "state": "MA",
      "duration": "11 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc525",
      "summary": "The light just vanished and come back then vanished again.",
      "city": "boston",
      "shape": "light",
      "date": "2011-10-25T00:00:00",
      "story": "The light just vanished and come back then vanished again. I was watching the eastern sky towards the Atlantic ocean and i noticed a very very bright light maybe around 4 to 5,000 feet in the sky.  I looked at it and i disappeared for about twenty seconds and the it simple just vanished.  Then about twenty seconds later the light appeared but much higher than the first sighting and not in the same location. It was to high to be any type of aircraft.  For about another ten to fifteen seconds the light was moving very slow then it just simply just vanished again. The color of the light was very strange and I couldn't really describe the color. I want to say maybe a combo of red and yellow,It was just a very bright steady light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84688.html",
      "state": "MA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc683",
      "summary": "The chasing red lights over Boston.",
      "city": "boston",
      "shape": "light",
      "date": "2011-10-25T00:00:00",
      "story": "The chasing red lights over Boston. it was around 0:30 and two of us looked up over the eastern part of the city and noticed these two red lights very very high up in the sky, two high to be any type of aircraft.  from what we saw was the red lights were chasing each other, back and fourth and around and around.  This happened for about a good twenty minutes and the two red lights stop for a about one minute and all a sudden just disappeared.  The red lights very a very bright color and they were just a steady red, no flashing our strobe effects at all. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84689.html",
      "state": "MA",
      "duration": "twenty minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc789",
      "summary": "Orange blurry fireball observed flying over Boston during the early evening. Flying South over Allston.",
      "city": "boston",
      "shape": "fireball",
      "date": "2011-12-17T00:00:00",
      "story": "Orange blurry fireball observed flying over Boston during the early evening. Flying South over Allston. My roommates and I (we are all engineering students), were on our deck, and I noticed an orange object coming in our direction.  The object was moving south-southeast and flew directly over us. No real definition of shape could be made out other than the fact that it was glowing and flickering. The shape seemed to be an oval or circular type shape.   Initially we suspected a possible plane on fire or something of that nature, but the plane was flying AWAY from the airport and not falling in altitude.  Constant speed was maintained. I'm not able to say exactly how fast it was moving, but it was fairly quick.  About 30 seconds after flying directly over us, the object steered in the south-southwestern direction and seemed to gain stay very horizontal. My most detailed memory of the event is when the object flew directly over us and it seemed to be on fire. It was fairly low altitude.  The object was also very blurry.",
      "link": "http://www.nuforc.org/webreports/085/S85834.html",
      "state": "MA",
      "duration": "2-3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc788",
      "summary": "I was looking up at the sky real quick and i noticed a green flaming ball shape object with a blueish and green like flame coming out o",
      "city": "boston",
      "shape": "fireball",
      "date": "2011-12-17T00:00:00",
      "story": "I was looking up at the sky real quick and i noticed a green flaming ball shape object with a blueish and green like flame coming out of the back of it.  It came down pretty fast and all a sudden it went down some were over the ocean.   I tried to take a picture of of but I was not able to en time.   From what I noticed it made no sound at all and didn't really see anything following it our coming off of it except for the flame.    And that is my Report. ((NUFORC Note:  We have changed the data above, to reflect a sighting in 2011.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85853.html",
      "state": "MA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc93",
      "summary": "Sat outside and saw lights appear and disappear in the sky.",
      "city": "boston",
      "shape": "light",
      "date": "2011-06-27T00:00:00",
      "story": "Sat outside and saw lights appear and disappear in the sky. a friend and I were sat outside enjoying a beer, roughly around 11pm at night and we both saw lights in the sky appear and then disappear over a duration of a few seconds.  At this point we were both confirmed with each other what we saw which we thought was a small plane.  There was no noise, just lights and came from nowhere and disappeared into nowhere.",
      "link": "http://www.nuforc.org/webreports/081/S81944.html",
      "state": "MA",
      "duration": "4 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfb2",
      "summary": "Dark shape landed on roof top, than flew away as bright light, no sound.",
      "city": "boston",
      "shape": "unknown",
      "date": "2012-09-24T00:00:00",
      "story": "Dark shape landed on roof top, than flew away as bright light, no sound. I was working security on t4he 30th of March, 2012 for the MCHC on Blue Hill Ave. in Mattapan (Boston) along with a co-worker. At approximately 4:00am I noticed a large dark shape, almost like smoke on the building directly next to the health center on the roof. The object or entity appeared to glide along the roof top and stop for a few moments. I could see what looked like eyes and got the distinct impression whatever it was new I was looking at. After about 3 min of observing it, it gained a tremendous amount of speed and jumped or flew off the building. I than observed it. I’m not sure if the object was generating light or if it was the reflection of the moon on it, but it was a observable bright light flying in an odd pattern of an up and down, side to side motion. It was headed in the direction of Milton and Quincy. I than rejoined my co-worker in her car and told her I just saw the strangest thing. She replied “you mean that dark, misty, looking thing that was on that roof over there?” I couldn’t believe she saw the exact same thing and described it before I even said anything.",
      "link": "http://www.nuforc.org/webreports/092/S92906.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1c6",
      "summary": "23AUG2012, 2030Hrs., Boston City Hall Plaza, Triangular Craft...",
      "city": "boston",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "23AUG2012, 2030Hrs., Boston City Hall Plaza, Triangular Craft... I am a US Navy veteran, and was with a friend of mine, who is a US Army veteran, on the evening of 23AUG2012 at approx. 2030Hrs, when we both noticed a unique light array approaching us from the north.  We were both sitting on the open plaza at Boston City Hall Plaza this night.  This light array resembled nothing we had ever seen before, as we are closely familiar with military, commercial, and private aircraft, as well as blimps, dirigibles, hot air balloons, and ultralight craft. As this light array got closer, we noticed that there were NO red & green (port & starboard) lights, NO wing lights, nor were there any type of landing (approach) lights seen anywhere on this craft.  Also very noticeable was the fact that there was absolutely NO sound whatsoever associated with this craft. Less than 5-10 minutes before we noticed this light array, there was an airplane on its approach to Boston's Logan Airport, and this light array did NOT resemble any other known craft. I estimate the approximate speed of this craft to be between 25-35MPH, which gave me sufficient time to get a detailed look at it, and later to sketch out the details that I saw. Sketch to follow in a separate mailing, as I have no current access to a scanner to electronically email it out to NUFORC. As this light array passed directly overhead, we both noticed that it was definitely triangular in shape, the outer body being a very black color, with an inner structure a light black or dark gray color. There were 3 white lights on each corner (rimmed in a gold/yellowish color), with a very large bright white light in the direct center of this craft, also rimmed in the same gold/yellowish color, and at the stern of this craft were 2 red lights, near the rear points of this triangle shape, equidistant apart from one another. This craft did NOT cast any shadow or reflected light to the ground, had NO sound even as it passed overhead, and continued directly south until it disappeared behind some tall buildings. Less than 5 minutes later, a twin-engine airplane passed overhead, going from east to west, and this craft we witnessed was nothing like the plane we saw moments later. Being military veterans, we both discussed what exactly we witnessed that evening, ruling out all known aircraft very familiar to us, and have no answers to this unique UAP/UFO sighting. But we know exactly what we DID see that night, and this triangular craft is something not of our current military, as we do not have this type of current technology at this time.",
      "link": "http://www.nuforc.org/webreports/092/S92519.html",
      "state": "MA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1c7",
      "summary": "Triangular Craft Over Boston City Hall Plaza, August 23, 2012, at Approx. 2030hrs…",
      "city": "boston",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "Triangular Craft Over Boston City Hall Plaza, August 23, 2012, At Approx. 2030hrs... I am a US Army veteran, familiar with most military, private, and commercial aircraft.   On August 23, 2012, at approx. 2030hrs, a friend, who is a US Navy veteran, and myself observed an odd araingement coming in from the north, which passed over Boston City Hall Plaza at a slow, steady speed and in a straight line, and which continued south to disappear over some buildings.  The craft was triangular in shape, clearly in its shape, and made absolutely no sound whatsoever.  Its body lights were clearly visible as it passed over going to the south.   Please refer to my friend's sketch, as I cannot draw, but his sketch is an accurate drawing of the craft we witnessed.",
      "link": "http://www.nuforc.org/webreports/092/S92738.html",
      "state": "MA",
      "duration": "Approx. 4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd236",
      "summary": "Large white illuminated oval shape above city of Boston.",
      "city": "boston",
      "shape": "oval",
      "date": "2012-09-24T00:00:00",
      "story": "Large white illuminated oval shape above city of Boston Traveling up the expressway into Boston, my girlfriend and I noticed a large oval object in the sky. It appeared to be somewhat transparent and illuminated white lights.  After seeing the object we tried to figure out what it was.  I thought it might be a blimp.  We pulled over to investigate further. It appeared to hover very slowly across the horizon.  Upon inspecting this object it couldn't have been a blimp. It was almost as if it were in a haze of white light, it did not appear to be solid or opaque like a blimp would be.  It eventually ended up hovering just above the high rise buildings in Boston as though it were further beyond the actual city towards the North Shore.  There is an airport around that area as well.  We tried to drive into the city to see it better but once in town the buildings obstructed our view. We observed it for about ten minutes.",
      "link": "http://www.nuforc.org/webreports/092/S92238.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb85",
      "summary": "I was outside in the parking lot in jamaicaplain neibourhood.It was 7:05pm and it was dark.Accidentally i saw in the sky and the sky wa",
      "city": "boston",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "i was outside in the parking lot in jamaicaplain neibourhood.It was 7:05pm and it was dark.  Accidentally i saw in the sky and the sky was very clear, all of a sudden from west side of the sky i saw a bounch of bright lights moving to the east they are bigger than the star and they were many.  they were moving a steady move.no one will be faster or slower they are aproxmetlly b/n 100-200.  Please if any one has the same encouter please let me know",
      "link": "http://www.nuforc.org/webreports/093/S93675.html",
      "state": "MA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be016",
      "summary": "Fighter Jets Chase UFO's over City of Boston",
      "city": "boston",
      "shape": "cylinder",
      "date": "2012-05-13T00:00:00",
      "story": "Fighter Jets Chase UFO's over City of Boston Friday April 20,2012 ___  1.That at around 4:30pm to 8:00pm that around 8 Disc Aspirin Shape UFO Type Objects were in Sky. The out of nowhere a Fleet of 25 Military Type Crafts were in chase of Objects.  2.  There were around 10 Military Fighter Jets in chase of Disc's from City Boston to out in the Atlantic Ocean. 3.  These Crafts caused Safety Hazards by getting within 75 Feet to 125Feet of Skyscraper Buildings. 4./5.  These Crafts were all Flying at Massive Speeds  beyond  anything known. 5a. There needs to be a full investigation by multiple Agency's as soon as possible.",
      "link": "http://www.nuforc.org/webreports/088/S88549.html",
      "state": "MA",
      "duration": "3 Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3be080",
      "summary": "Reddish/orange light moving really fast across the sky.",
      "city": "boston",
      "shape": "fireball",
      "date": "2012-08-19T00:00:00",
      "story": "i was sitting on my porch and looked and saw this glowing reddish/orange light moving really fast across the sky. i took out my phone and took a video.",
      "link": "http://www.nuforc.org/webreports/091/S91773.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be1a5",
      "summary": "Two pin point lights trailing each other very quickly in a very non linear path",
      "city": "boston",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "two pin point lights trailing each other very quickly in a very non linear path, faded in and out out of view, if still would have appeared to be faint stars.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91807.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be91b",
      "summary": "Large metallic-object, oblong shaped--disappeared completely from cloudless sky.",
      "city": "boston",
      "shape": "cigar",
      "date": "2012-05-29T00:00:00",
      "story": "Large metallic-object, oblong shaped--disappeared completely from cloudless sky. Driving east on the Massachusetts Turnpike near Newton, Mass.  Saw what appeared to be a jet plane but appeared to be no exhaust or jet lines tailing it, was just moving through the sky reflecting the sun brightly.  Pointed it out to people in the car, they recognized there to be no exhaust or typical trail.  Seconds later, it completely disappeared from the sky.   Clear sky, broad daylight, no clouds--completely gone from the sky.  It's direction of travel would have put it directly in front of our sight.",
      "link": "http://www.nuforc.org/webreports/089/S89241.html",
      "state": "MA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf21c",
      "summary": "2 small consecutive black dots over Charles River",
      "city": "boston",
      "shape": "sphere",
      "date": "2013-02-04T00:00:00",
      "story": "2 small consecutive black dots over Charles River I work on the 42nd top floor of a luxury residence apartment building in downtown Boston.  I was on the deck outside when I saw a tiny miniscule black dot rising into the sky over the Charles River at a 30 degree angle in a direct path with no flaws in it's motion.   At first I passed it off as a balloon, after it disappeared out of my line of site behind me.  However when a second black dot followed it's direct path a minute after.  The exact same forward motion that a balloon could not make.  I tryed to film it on my camera before it disappeared, but it was too small!   I have no clue what it was!   Just a small black flying dot.",
      "link": "http://www.nuforc.org/webreports/095/S95728.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5b1",
      "summary": "Distant unmoving object with no lights during the day on July 4th.",
      "city": "boston",
      "shape": "other",
      "date": "2013-07-14T00:00:00",
      "story": "Distant unmoving object with no lights during the day on July 4th. While waiting for the sun to go down sitting in a kayak on the Charles River, my fiance' and I happened to look above us before the sky darkened for the fireworks and saw an unidentifiable object.  Mind you, I was completely sober and there were no waves to rock us back and forth.   The object caught our eyes especially because it didn't move, grow or decrease in size, or blink with light.  It just stayed in place.   For those on the river or downtown waiting for dusk to deepen, they may all tell you that the sky itself was odd that night, with a streak of light peach colored \"atmosphere\" across its entirety.  It's described this way because it was unclear whether it was clouds or some trick the sun was playing on us.   Anyway, we remember the craft being greyish to light blue, in a somewhat triangular shape with ridges on its side.   Just as we observed more of its features it seemed to quickly evaporate away into nothingness. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99958.html",
      "state": "MA",
      "duration": ":30"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7a5",
      "summary": "Glowing neon green ball... Falling very fast and perfectly vertical over Boston.",
      "city": "boston",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "Glowing neon green ball... Falling very fast and perfectly vertical over Boston. Driving from lynn to revere on lynn marsh road...Saw what looked to me like a neon green meteor falling perfectly vertical and extremley fast over Boston.  I'm very suprised to google this and not have seen any other reports. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97301.html",
      "state": "MA",
      "duration": "1.5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9b3",
      "summary": "Solid Non-Flashing Light",
      "city": "boston",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Solid Non-Flashing Light We looked up in the sky and saw a very bright solid (non-flashing) light flying silently across the sky. What could this be?",
      "link": "http://www.nuforc.org/webreports/101/S101310.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc5a",
      "summary": "Two colored flashes of light lasting about 5 seconds each until ending in a ball of light.",
      "city": "boston",
      "shape": "flash",
      "date": "2013-09-30T00:00:00",
      "story": "Two colored flashes of light lasting about 5 seconds each until ending in a ball of light. Driving on the highway, the sky is very clear with no clouds at all; a streak of light appears across the sky and flashes down about 100 feet and it disappears after exploding into a colorful ball (the first flash was a red colored light, the second was  a teal colored light).   There were only two flashes seen, about two hours apart from each other.  The shape was a thin, rectangular shape and a spherical ball of light right before the streaks disappeared.",
      "link": "http://www.nuforc.org/webreports/102/S102767.html",
      "state": "MA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe79",
      "summary": "Bright light traveled quickly across sky.",
      "city": "boston",
      "shape": "oval",
      "date": "2013-09-09T00:00:00",
      "story": "Bright light traveled quickly across sky. I am located 25 miles south of Buffalo New York in Boston Valley, which is a partial rural environment.   Tonight, September 5, 2013 at approximately 10:20 PM EST, I was outside admiring the night sky when a bright object flew west to east at great speed.  The object was low on the horizon.  I was unable to see where it continued to due to hills being in the way.  There was no sound and the event lasted maybe 2 seconds.  It did not appear like a meteor; the brightness remained constant, and was colored a hint of yellow /gold.  There were no wires or lines in that direction or height.",
      "link": "http://www.nuforc.org/webreports/101/S101949.html",
      "state": "NY",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fe6",
      "summary": "Over Boston, 4 bright orange lights approach separately, hover, then recede to the South East.",
      "city": "boston",
      "shape": "egg",
      "date": "2014-01-10T00:00:00",
      "story": "Over Boston, 4 bright orange lights approach separately, hover, then recede to the South East I live on the edge of Boston  Common and was walking my  dog at 7:45pm on Jan 1. I walked onto the Common from the NW corner and immediately saw a bright orange light in the sky. At  first, through the trees, I thought it might be a planet and marked its position so I could check on it again when I got to open space. When I did, it had moved and was closer. Being near Logan Airport, I first thought plan or helicopter but there were no blinking lights and it receded to the South South East. At this time I was out on open ground and the first light was out of sight, I saw another single orange light approach from the SW (from my perspective, approaching from the left side of the Hancock tower). It approached at speed, hovered for a minute or two, and then receded to the SSE. At this point there were other people walking through the Common and also looking up, seeing the bright orange light and remarking at it. After the second light was out of sight a third fo! llowed the exact same trajectory in, hovered and receded to the SSE. I decided to go inside, proceeded to tell my wife about the lights and looked out the window to see if there was another out there and there was. I grabbed my binoculars and what I thought I could see was the bright orange light and 2/3rds of whitish eggish shape to the bottom.  This light, like the others, receded to the SSE. I periodically checked out the window the remainder of the evening and saw no other lights.  A couple of other notes: While I was out on the Common, I saw 2 large jetliners take off from Logan and come relatively close to these lights. One of those two times, I thought it was dangerously close,  but it allowed to give a guess at the altitude of the lights, which I would say was between 1,000-2,000 feet.  Also, while I could clearly hear the sound that the jets taking off we're making, and a helicopter to the North, these lights made no sound that I could hear. While I am aware of Chinese Lanterns, these lights each approached at what I would call \"aircraft speeds\", hovered and receded at 90 degree angle from origin at a similar speed.",
      "link": "http://www.nuforc.org/webreports/106/S106006.html",
      "state": "MA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1328",
      "summary": "White circular UFO outside Boston disappears--then reappears atop neon orange vertical-ellipse-shaped cloud & witnessed to Hartford CT.",
      "city": "boston",
      "shape": "circle",
      "date": "2013-12-02T00:00:00",
      "story": "White circular UFO outside Boston disappears--then reappears atop neon orange vertical-ellipse-shaped cloud & witnessed to Hartford CT. Immediately after emerging from the Boston tunnels, headed Westbound on I-90, I saw a constant stationary illumination, circular and white, directly ahead of us.  Too large and too early in the day to be a star, I pointed it out to my husband, who was driving.  We joked about it, but I kept watching.  Heading due-west, I realized it was moving North and South, but there was no smoke trail.  As soon as I opened my mouth to mention it to my husband, he exclaimed, “It’s moving!”  Very soon after, it seemed to stop moving North-South, but the light got smaller and smaller until it disappeared from sight. Minutes later, we were passing over a body of water by a Framingham exit.  The reflection looked orange, so I looked up, expecting to see sunset starting.  Instead, the sky was bright blue and clear of clouds, except for one, which was directly ahead of us.  It was neon orange in color, a vertical ellipse in shape, about 40 azimuth from the horizon, about 10 azimuth in height.  I joked in less technical terms that it looked like female genitalia. I do a lot of sky gazing, I’ve never seen a cloud like this, my jaw was in my chest, eyes trained on it.  I remarked that it looked like it was glowing brighter, and the constantly white UFO reappeared at the very top of the elliptical cloud, growing from pinpoint in size to the same size as we had originally seen it.  The cloud dissipated within seconds, from the top down, looking more purple as it dissipated.  There was a bright white flash at the very top of the UFO, and a few seconds later it seemed to momentarily change from white to a faint green, but I don’t remember if this was before or after the cloud dissipated. It was difficult to gauge if the UFO was moving or hovering after that, due to the winding roads. It fell out of sight a few times when we dropped in altitude, (particularly Westbound on I/84). The diameter of the illumination was consistent until we neared the Hartford, Connecticut area, when it seemed to grow larger, and appeared to be hovering South of Hartford. We lost sight of it when we exited in New Britain, Connecticut, and we couldn’t see it at our final destination.",
      "link": "http://www.nuforc.org/webreports/104/S104909.html",
      "state": "MA",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d05",
      "summary": "((HOAX??))  Small lights at high altitude wobbling across the sky.",
      "city": "boston",
      "shape": "light",
      "date": "2014-06-20T00:00:00",
      "story": "Small lights at high altitude wobbling across the sky. The 4 of us were hanging out at my dads and we noticed how clear the sky was.  We saw some planes and such but then noticed very small looking lights (they looked pretty high) cruising across the sky.  A little faster than youd see an airliner go over but these looked much higher.   The weird part that made us think that they were not planes was that they seemed to wobble or swerve back and forth.  We all noticed it fairly quick.  The first one went across and disappeared and then another came over and did the same in a perpendicular direction. ((NUFORC Note:  Possible hoax, we suspect.  We cannot find a \"Boston, NY,\" and the date supplied by the witness is flawed.  We have amended the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110336.html",
      "state": "NY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c20cb",
      "summary": "Four light, red center, yellow light emitted as it moved in orb manner.",
      "city": "boston",
      "shape": "other",
      "date": "2014-04-18T00:00:00",
      "story": "Four light, red center, yellow light emitted as it moved in orb manner. I went outside after I learned a friend was killed on his way home after work on his motorcycle.  I went outside to pray and get some air.  It was about 3 AM EST, USA. I was looking at the sky and there was this object. It was between two stars.  We are in the city and don't see many stars here so it was clearly something different. It appeared to be four stars grouped together but it moving very fast.  I went in the house and got my husband and camera with video on it and went back outside with him.  I started filming it, zooming in you could then see it was like two Z shapes attached at the center.  It was moving in an orb manner emitting a yellow light- as if a centrifuge force.  It was huge! It was moving very fast. I know aircraft and it was not an aircraft of Earth origin. I have a video of it I uploaded to youtube if your interested contact me for the link.",
      "link": "http://www.nuforc.org/webreports/108/S108618.html",
      "state": "MA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c28be",
      "summary": "Reddish orange orb floating through the sky.",
      "city": "boston",
      "shape": "fireball",
      "date": "2014-10-03T00:00:00",
      "story": "Reddish orange orb floating through the sky. Me and  my mother were driving north bound on i93 over the bridge coming from quincy into boston when we both noticed what could only be  initially described as \"a kite on fire\" BUT after taking into consideration the time of day (6 pm) and the fact that it was moving south at what seemed to be 20 to 40 mph at what seemed to be 40 to 100 feet i the air. This was very strange and fascinating.  I'm both perplexed and compelled to find out what that was!!!",
      "link": "http://www.nuforc.org/webreports/114/S114015.html",
      "state": "MA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2fef",
      "summary": "Disk with blue lights sequencing with white light emanating in spray in Boston MA 8/19/14 330 AM.",
      "city": "boston",
      "shape": "disk",
      "date": "2014-08-22T00:00:00",
      "story": "Disk with blue lights sequencing with white light emanating in spray in Boston MA 8/19/14 330 AM I was outside smoking holding my cat, looked up, there was a round object in the sky.  Blue lights on the bottom and the lights appeared to be rotating.  A white light emanated from the craft in a spray around the object.  It was just hovering above Copley Square in Boston MA.   It stayed there long enough for me to go outside again and take a photo, though it was too distant and too dark for my camera to catch.  All it looks like on the photo is a pulsing star but this was no star and no stars have circulating blue lights on the outside on the bottom that go in sequence.   Clearly this was some other kind of craft.  One if many I have seen this summer in Boston MA.  Though the others were spheres and multicolored.",
      "link": "http://www.nuforc.org/webreports/112/S112704.html",
      "state": "MA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c3081",
      "summary": "Three points of white light moved across the cloudy sky, one flashed once, and when their paths met they shook.",
      "city": "boston",
      "shape": "light",
      "date": "2014-08-15T00:00:00",
      "story": "Three points of white light moved across the cloudy sky, one flashed once, and when their paths met they shook. In Boston, Massachusetts, at around 9:20 am  (sic.  p.m.), I saw a white light traveling from east-southeast to west-northwest.  It was about twice as large and bright as the few stars visible through light pollution and clouds.   It flashed once about a quarter of the way across the sky.  At around the middle of the sky its path crossed two others, similar in size, traveling from the opposite direction, though not parallel.   Their trajectories didn’t meet exactly, but when they were close they shook slightly, and continued on their paths.   All were visible until below the horizon, which was obstructed by trees and buildings.  There was at least one plane in the sky during this, to the north and heading west.",
      "link": "http://www.nuforc.org/webreports/112/S112395.html",
      "state": "MA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b30",
      "summary": "While at the beach with my family I noticed 4 military helicopter flying low, across Boston.  This is unusual so I took a picture.",
      "city": "boston",
      "shape": "unknown",
      "date": "2015-08-06T00:00:00",
      "story": "While at the beach with my family I noticed 4 military helicopter flying low, across Boston. This is unusual, so I took a pic with my phone.   When I looked at pic, there was something I.  The image that you could not see with the naked eye ? So I took a few more pics of sky only to see something in pics that no one could see with their eyes.  I thought it was worth reporting, first the military heli's the. Something weird above them, it seems to have an aura of maybe heat around it, so do the heli's?  But it's close to their size?   If someone would like to contact me I could maybe send pics but not sending them around just to everyone, I googled where to report and found this sight.",
      "link": "http://www.nuforc.org/webreports/120/S120835.html",
      "state": "MA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4114",
      "summary": "Hovering white light orb above and to the east of the Hyatt Hotel near the Prudential Center in Boston’s Back Bay.",
      "city": "boston",
      "shape": "light",
      "date": "2015-05-08T00:00:00",
      "story": "Three students (myself included) simultaneously observed a large, hovering white light orb above and to the east of the Hyatt Hotel near the Prudential Center in Boston’s Back Bay.  The orb remained perfectly stationary for about 10-15 seconds then, at a speed unknown to anyone present, dropped and vanished behind a nearby building.  It took our breath away and one witness let out a scream.   The size of the orb and intensity of the light gave the impression of nearness—it seemed to be no more than a quarter of a mile away. There was no accompanying noise.  We walked in the direction of the occurrence and found no evidence of aircraft, fireworks, drone, spotlight, etc...   Immediately after the orb dropped a brief period of silence was experienced by everyone in the group, not only the witnesses. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118767.html",
      "state": "MA",
      "duration": "<30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c45a7",
      "summary": "Craft on fire hurls through sky and disappears within seconds.",
      "city": "boston",
      "shape": "circle",
      "date": "2015-11-19T00:00:00",
      "story": "Craft on fire hurls through sky and dissapears within seconds. A bright light looked to be on fire came hurling down from the sky and disappeared within a matter of seconds.",
      "link": "http://www.nuforc.org/webreports/124/S124050.html",
      "state": "MA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c464e",
      "summary": "Some large craft spotted over Boston, too low to be a plane. appeared and gone in a flash",
      "city": "boston",
      "shape": "",
      "date": "2015-11-19T00:00:00",
      "story": "some large craft spotted over Boston, too low to be a plane.  appeared and gone in a flash what looked like a massive craft of some kind suddenly appeared extremely low at the end of prince st north end. appeared to be a steel blue color, midnight blue steel look.  had windows, similar to an airplane in appearance, at the same time didn't look like an airplane. it looked as if the side of an airplane was magnified and placed at the end of the street. was spotted for 30 seconds.  other individual I was with said \"listen for a crash\". a plane flying that low couldn't have pulled up in time to not hit a building. it was both there and gone in a flash. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124111.html",
      "state": "MA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4797",
      "summary": "A green planetoid looking sphere orbiting around the moon during the eclipse.",
      "city": "boston",
      "shape": "sphere",
      "date": "2015-10-09T00:00:00",
      "story": "A green planetoid looking sphere orbiting around the moon during the eclipse I was taking pictures of the eclipse and, when checking my pictures, as we were sitting there, I noticed a green planetoid looking object in the picture near the moon.   I took more pictures and noticed the sphere was moving around the moon.  It was not visible to the naked eye but both my camera and a neighbor's camera picked it up in pictures.  It didn't give off any light itself, but light from the sun reflected on it so that it could be seen.",
      "link": "http://www.nuforc.org/webreports/122/S122525.html",
      "state": "MA",
      "duration": "30+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b1b",
      "summary": ">30 glowing specks in a massive group flying north from the east over the ocean.",
      "city": "boston",
      "shape": "unknown",
      "date": "2015-09-29T00:00:00",
      "story": "&gt;30 glowing specs in a massive group flying north from the east over the ocean This was too far east over the ocean to be coming from any land strips.  At first I thought it could have been a bunch of those candle lanterns released from a boat, but there were far too many, and they were moving far too fast.   It then looked like an arsenal of planes, however their flight pattern was too random.   These objects were specs, but were glowing like breathing bright and then dull slowly, and there were at least 30, maybe more. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122319.html",
      "state": "MA",
      "duration": "~15"
    },
    {
      "_id": "64d005f478aba2ec5a3c4cf7",
      "summary": "Bright fiery elongated object seen in sky northeast of Boston Ma, on Sept 8, 2015 at 6 am.",
      "city": "boston",
      "shape": "rectangle",
      "date": "2015-09-11T00:00:00",
      "story": "Bright fiery elongated object seen in sky northeast of Boston Ma, on Sept 8, 2015 at 6 am. Driving to work at 6 AM, heading North on route 24 towards Brockton, MA, saw orange/pink wide streak in sky.  It looked like it was northeast and possibly over or near Atlantic Ocean.  It was slowly working its way downward.   I watched it until I could no longer see it behind the trees.  I don't think it was a craft.   It looked fiery, but perfectly formed in a wide line that was rectangular. It had beautiful colors.",
      "link": "http://www.nuforc.org/webreports/121/S121847.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e09",
      "summary": "I was driving south on I-90 coming out of Boston just before the turn onto 95/128 when I saw what looked like 5 diamond shaped objects",
      "city": "boston",
      "shape": "diamond",
      "date": "2016-11-11T00:00:00",
      "story": "I was driving south on I-90 coming out of Boston just before the turn onto 95/128 when I saw what looked like 5 diamond shaped objects that were stationary in a curved pattern, all glowing brightly,  the top object super radiant.",
      "link": "http://www.nuforc.org/webreports/131/S131000.html",
      "state": "MA",
      "duration": "Ongoing?"
    },
    {
      "_id": "64d005f478aba2ec5a3c604e",
      "summary": "Multiple Amber-Red lights over South Boston heading North over Boston-Logan International Airport.",
      "city": "boston",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "Multiple Amber-Red lights over South Boston heading North over Boston-Logan International Airport. It was about an hour after sunset, I was getting relieved from watch and happened to look out of the window to the ESE and caught 3 amber-red lights heading North towards Boston Logan International Airport at approximately 1,500-2,500 feet in a triangle formation; one of the trailing lights made a sudden maneuver and crossed the other that was trailing and proceeded North; As the lights crossed in front of me and headed away, the lights faded out as they were closing on the the airport. It was after I had lost the first three that I looked back to the South and saw more lights in no particular formation, but on the same heading and altitude, about 15-20 went by in total.  By the time these showed up, 5 other witnesses had spotted them from below my vantage and confirmed what I had seen.  On the level I was, there had been another witness as well.  Also, of note was a cruise ship that had departed and been in the channel fairly close by at the time. There were no clouds, but I could not make out any stars prior to or during the event; winds minimal and temperature mild. The lights moved at a steady speed, approximately 50-70 knots, a steady altitude, and in full unison towards the North. No sounds could be heard emanating from them, or other lights.  Shape and exact size could not be determined. The lights/what they were attached to were clearly under intelligent control whether it is ours or not I can not say. I was able to get two cell phone videos but they did not catch very well the extent of what I saw. I did notice that after all of the lights had passed, a helicopter had followed close behind and proceeded towards the North, but avoiding Logan airspace-it did not appear military and was plainly visible.  It should be noted that these lights continued through Logan airspace without regard to it. Of note is that a line of landing airplanes could be seen coming from the North and landing at Logan-very close together and I had not seen them do this for the two months I had been here-once the objects passed, some planes had refrained from touching down and began to gain altitude to continue their flights.",
      "link": "http://www.nuforc.org/webreports/130/S130219.html",
      "state": "MA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c62c9",
      "summary": "A large, bright, strange shaped object that moved fast, disappearing then reappearing three times.",
      "city": "boston",
      "shape": "other",
      "date": "2016-09-15T00:00:00",
      "story": "A large bright strange shaped object that moved fast, disappearing then reappearing three times. I saw it from my big picture window first, then went outside.  It was across the road hovering over a large field.  It was silent with red lights on the left side.  It was almost banana shaped with the end resembling a triangle.  It would go up and down and side to side really fast.  It would disappear then reappear a few minutes later.  It would also reappear in a different spot, not far away.  It did  this three times then was gone.  By the time I went back and got my iPad, it was getting pretty dark, so not very plain.  I am not a very good computer person, so hope I can get the images to you. Thank you very much.  It was quite an exciting evening!",
      "link": "http://www.nuforc.org/webreports/129/S129880.html",
      "state": "GA",
      "duration": "30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c734e",
      "summary": "I saw what looked like a very twinkly star, kind of white but with red and possibly bluish.  ((NUFORC Note:  Possibly a star??  PD))",
      "city": "boston",
      "shape": "fireball",
      "date": "2017-06-15T00:00:00",
      "story": "I saw what looked like a very twinkly star, kind of white but with red and possibly bluish flashing so I figured it was a plane, but it was very bright and not moving so I thought it must be a planet.   At first I looked from my window, then outside and when I came back inside and looked out the window again it had disappeared. ((NUFORC Note:  Source of the report elects provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134499.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7479",
      "summary": "TR3B Absolutely Certain!",
      "city": "boston",
      "shape": "triangle",
      "date": "2017-05-06T00:00:00",
      "story": "TR3B Absolutely Certain! I saw the TR3B in the sky in Massachusetts in 1997.  It hovered for 15 minutes, then accelerated from 0 to like MACH 10 in a fraction of a second.  It is real!  A US Navy recon space ship that defied the laws of inertia right in front of me!   I was driving on the highway and saw the triangular shaped craft in the sky.  I pulled over into the breakdown lane and stared at it.  I could see 3 bright lights at each corner of the craft.  It twisted clockwise and counterclockwise like it was floating and was light as a feather.   After 15 mins, it took off at an incredible speed.  I was 100% confused by this when it happened and for years didn't tell anyone for fear of being ridiculed.   And now 20 years later thanks to YouTube.  I now know I'm not crazy!!!!!!!!!!!! ((NUFORC Note:  Many people seem to believe in the existence of a craft called the TR3B, but no photos have been forthcoming, as far as we know, over the course of the past several decades.  If such a craft exists, we have to wonder why it would be being flown over Boston, MA.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133907.html",
      "state": "MA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a95",
      "summary": "((HOAX??))  I was driving home and saw 2-3 aircrafts.  Might have been jets, but I am just not sure.  ((anonymous report))",
      "city": "boston",
      "shape": "triangle",
      "date": "2017-11-09T00:00:00",
      "story": "I was driving home and saw 2-3 aircrafts.  Might have been jets but I am just not sure.  They lit up a bright green. ((NUFORC Note:  Witness provides no valid contact information.  We suspect that the report may be a hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137117.html",
      "state": "MA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c814e",
      "summary": "Bright light heading east at a rapid rate of speed originally thought it was a crashing aircraft but there were no reports of such even",
      "city": "boston",
      "shape": "circle",
      "date": "2018-03-02T00:00:00",
      "story": "Bright light heading east at a rapid rate of speed originally thought it was a crashing aircraft but there were no reports of such events. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138946.html",
      "state": "MA",
      "duration": "2.5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ab7",
      "summary": "Fast green lights formed three crosses in sky.",
      "city": "boston",
      "shape": "cross",
      "date": "2019-09-12T00:00:00",
      "story": "Fast green lights formed three crosses in sky. At approximately, 04:20 hours, I was sitting with friends on a fire escape when we noticed fast moving lights in the sky.  The lights were green colored, moved independently and would, at times, converge into a cross formation.  The spectacle lasted about 20 minutes at which the lights dimmed and vanished from the sky.",
      "link": "http://www.nuforc.org/webreports/148/S148727.html",
      "state": "MA",
      "duration": "20 minutes"
    }
  ]
}