{
  "city": "brownsville",
  "fetch_timestamp": "2025-07-12T14:36:52.534051",
  "record_count": 22,
  "pages_fetched": 1,
  "api_calls": 2,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b5baa",
      "summary": "2 triangular shaped objects spinning around each other over the roof of an apartment in Brownsville, Texas.",
      "city": "brownsville",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "2 triangular shaped objects spinning around each other over the roof of an apartment in Brownsville, Texas. I was getting ready to take a shower at my girlfriend's apartment at around 3:00 a.m. when I forgot to bring the soap that was in my car. When i went to my car about 50 feet away from the front door of the apartment, which i couldn't find it and needed to sit down (front passenger side). I looked over at the front door of the apartment because I thought saw someone in the corner of my eyes open the door thinking it was my girlfriend but no one was there. But right above the roof, when i happened to look up(maybe about 20-30 feet from the roof) I saw 2 triangular shaped objects about the size of 3 6-foot man that can fit in a triangle, spinning around each other with a light on one corner of the 2 triangle objects. when i stared at it, i was still blinking my eyes but kept my line of sight straight at the objects trying to identify what kind of object it was. But after realizing that the wind was stagnant and no sound was present except for the air condition that was behind the apartments. I saw the objects slow down from the spinning motion and paused for 1 second and took off to the left going up....quickly, very fast and awakening. then after about 10 more seconds, the wind started blowing for the next 5 to 8 seconds and stopped again. but the objects did not make any noise or sounds.",
      "link": "http://www.nuforc.org/webreports/051/S51631.html",
      "state": "TX",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c9a",
      "summary": "Object & airplane almost collide",
      "city": "brownsville",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Object & airplane almost collide I saw a extremely bright yellowish-white light moving south across the sky. I kept my eye on it for around 10 minutes. In the opposite direction moving north was an airplane with it's lights flashing as usual. Closer and closer they got to each other. I thought they were going collide. All of a sudden the objects light turned completely off. I couldn't see anything anymore. The plane then pass through the objects path. Soon after the plane passed, the object turned on some lights but this time they were strobing colors. The colors were red, yellow, blue, purple, cyan just an amazing array of different colors. One thing I noticed was that everytime the lights would flash the object seemed to advance about 500 yards more or less. I would see the object then in a millisecond of it's flashing lights the object would be further south. I live at the tip of Texas. Mexico is about 3 mile from where I live. That object was moving south towards Mexico. I kept my eye on it until I couldn't anymore. The entire sighting last for about 30 minutes",
      "link": "http://www.nuforc.org/webreports/062/S62704.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7169",
      "summary": "BROWNSVILLE,TX USA  Date and Time of Sighting? 2-25-08    6:15 PM  Clear weather blue skys conditions at time of sighting.",
      "city": "brownsville",
      "shape": "cylinder",
      "date": "2008-03-04T00:00:00",
      "story": "BROWNSVILLE,TX USA  Date and Time of Sighting? 2-25-08    6:15 PM  Clear weather blue skys conditions at time of sighting.  Sighting was a cylinder shape UFO with a white/yellow/orange glow flying south to Mexico. I did not see any wings from an airplane or any light at the tail.",
      "link": "http://www.nuforc.org/webreports/061/S61928.html",
      "state": "TX",
      "duration": "3 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b830f",
      "summary": "Nighttime headlight looking objects on the road doing a 90 degree turn in front of my truck (twice).",
      "city": "brownsville",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Nighttime headlight looking objects on the road doing a 90 degree turn in front of my truck (twice). On Dec. 24, 2007 at approximately 00:15 on FM 1421, Brownsville, Cameron County, Texas, we were headed South in my Ford Ranger at about 40 to 50 mph when we observed what appeared to be the head lights of an on-coming car in the opposite lane about 500 feet ahead of us bearing North.  As the “headlights” got closer (about 50 feet before passing us) they made a complete 90 degree turn in front of my truck, passed into the farm field next to us and disappeared.  This was witnessed by myself and the passenger of my truck.  At that point I slowed down to about 20 to 30 miles an hour the passenger of my car and I turned to each other and almost at the same time exclaimed, “Did you see that?”   About 10 seconds after this event and both of us being somewhat confused but alert we noted another set of “head lights” coming down the road in the same lane in the same Northerly direction as the previous set of “head lights.”  Although not expecting these second pair of “head lights” to perform in the same manner, that’s exactly what they did (a completely perfect 90 degree turn about 50 feet in front of us) vanishing, again into the field next to us (our right).  It is important to note that the second instance was a more pronounced experience as myself and the passenger of the truck had just witnessed the first incident and were, by then, in a state of high sensory alertness but also completely dumbfounded and confused.  After the second instance, I immediately stopped and got out of the car to look into the field were the lights went and could find no trace of either object.  Please note that the color of the lights were off-white and seemed to be set farther apart then normal head lights.  As the lights passed in front of the truck they also seemed to have a tail…like a comet.  Also important to note is that if these “head lights” had just gone by us I would have thought nothing of it and would have assumed they were normal cars despite the headlights being set slightly farther apart.  It was agreed by myself and the passenger that evening and over many, many recounts of the event at later times (these recounts continuing to the present) that neither of us had ever seen anything maneuver like these lights.  We also both agree that if there would have just been one event then we would have probably discounted it…but both events happened in succession…one after the other.  I can’t even begin to guess what those lights were.",
      "link": "http://www.nuforc.org/webreports/065/S65237.html",
      "state": "TX",
      "duration": "3 to 4 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e47",
      "summary": "triangle in backyard,, i have knowledge and they know,, i know.",
      "city": "brownsville",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "triangle in backyard,, i have knowledge and they know,, i know. Triangle impressions on site my back yard during lightning storm Have video , not a hoax.. send someone immediately been having visions .. about the future since young ,, more intense now… listen too me.. I am seious,,, I will give this technology to the bidder who can do the most for free energy, and use the ideas of the furuure too profit billions.. want some thing now? ,,, this is no hoax.  My email is venomkiss44@yahoo.com... I am not a lie.",
      "link": "http://www.nuforc.org/webreports/065/S65901.html",
      "state": "TX",
      "duration": "2 days"
    },
    {
      "_id": "64d005f478aba2ec5a3b90c2",
      "summary": "I saw a wheel within a wheel",
      "city": "brownsville",
      "shape": "circle",
      "date": "2010-05-12T00:00:00",
      "story": "",
      "link": "http://www.nuforc.org/webreports/075/S75330.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fae",
      "summary": "I saw a ufo for 3 seconds by my house.",
      "city": "brownsville",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "I saw a ufo for 3 seconds by my house. Just about 20 minues ago i saw a ufo speeding trough the skies and a trail of light blue light was behind it like a shooting star. At first i tought it was a shooting star, but i noticed that it was bigger and it had a shape. I always believed in ufos, but now i kinda wish i never saw it because i can't stop thinking about it. It feels like no one will believe me.",
      "link": "http://www.nuforc.org/webreports/066/S66184.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7f2",
      "summary": "I saw 3 lights in the form a triangle and it was flying very low and slow,",
      "city": "brownsville",
      "shape": "triangle",
      "date": "2011-08-07T00:00:00",
      "story": "I saw 3 lights in the form a triangle and it was flying very low and slow, I was walking down the road to go home and every dog on the street was barking.   I heard a very low flying object and I thought it was an airplane.  When I looked up I saw 3 lights in the form of a triangle, so I got my phone out to try to take a picture and nothing would show up.   It lasted for about 10 seconds and it was gone.",
      "link": "http://www.nuforc.org/webreports/082/S82607.html",
      "state": "KY",
      "duration": "10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd8b",
      "summary": "Large oval shaped object seen over Brownsville Texas.",
      "city": "brownsville",
      "shape": "oval",
      "date": "2012-08-19T00:00:00",
      "story": "Large oval shaped object seen over Brownsville Texas. On August 10, 2012, at 5:45 AM CST, an oval/egg shaped bright silver glowing object was seen hovering about 10 feet above the street lights in the Brownsville Country Club.  The object was about 30-50 feet in height and almost same width with a more oval shape.  Object made no sound as it moved/glided very slowly over the neighborhood.  Witness felt watched by the object as it moved in their direction. Witness became frightened and moved indoors. The light could be seen through the windows and front door as it moved slowly by. Witness was left perplexed because it was neither the moon or the sun. The object gave off its own glowing light but its metalic nature could be seen. It was moving South to Northeast based on its movement direction. When light was no longer seen, the Witness went back outdoors and object had either moved on or had disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91701.html",
      "state": "TX",
      "duration": "5 MTS"
    },
    {
      "_id": "64d005f478aba2ec5a3bf84d",
      "summary": "Oval shape light,gliding within some clouds at high speed, 2-3 min.it went at a upright angle,sat in a clound then it just vanish.",
      "city": "brownsville",
      "shape": "oval",
      "date": "2012-12-20T00:00:00",
      "story": "oval shape light,gliding within some clouds at high speed,2-3 min.it went at a upright angle,sat in a clound then it just vanish. At 0515, approx.15nov12,an oval uliminating bright light was moving at a very swift speed from left to right,then it shot up in an upright angle.It did this motion 3 times in which i witness.  The oval light moved for the last time in the upright angle and it sat thier for 3 secounds then it suddendly vanished into thin air right before my eyes.  This oval bright light was moving within a set of parrallel clouds in the south.  There was no other lights source eminating from any other direction of the ground or the sky.  That morning the sky was clear and calm. i was facing south the direction to Matamoros, Mexico.  It was a radiant light enough to penetrate the set of white clouds that was their.  The clouds never moved,only the traveling oval light.It was strange.  I could not believe what i was seeing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94712.html",
      "state": "TX",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04f1",
      "summary": "((HOAX??))  Magnetic field something weird was happening to my compass.",
      "city": "brownsville",
      "shape": "diamond",
      "date": "2013-04-12T00:00:00",
      "story": "magnetic field something weird was happening to my compass we were heading to los fresnos tx and saw this boomerang with lights just there next to a hospital near the mall ((NUFORC Note:  For some reason, witness, who chooses to remain anonymous, indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97039.html",
      "state": "TX",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b68",
      "summary": "19-Oct-13 Brownsville Oregon on Kirk Ave. in a large clearcut.",
      "city": "brownsville",
      "shape": "disk",
      "date": "2014-01-24T00:00:00",
      "story": "19-Oct-13 Brownsville Oregon on Kirk Ave. in a large clearcut. On the above date at 1810hrs., (give a min.or 2)  On a sunny warm evening with clear skies no smog smudging the sky North East of Brownsville, Or., on a road called Kirk Ave.  We were in a clear cut no overhead obstruction for line of sight.  We were hunting. Witness 1 asked me (W2) if he was looking at the \"evening star.\"  I replied no it is to early after I looked to the SW evening sky.  He stated \"no over here\" and pointed to the NE direction.  I looked and explained I was looking at a jet which was climbing to the south from Portland, Or.  I asked if he was stupid for asking about a jetliner and W1 responded no over there! I looked in the direction he was pointing and noticed another jet passing under a blinding bright evening star looking object.  I was stunned to see a jet descending directly under the object.  From where I was standing the UFO was directly on top of my position of observation.  The distance from myself and jetliners was I would! say 30k in feet give or take a few feet.  The UFO was higher than that and I can only guess the distance from the aircraft flying right below it.  I am saying all object had to be in the 60k feet range, guessing at best.  I told W1 to \"grab glass\" and as I glassed the object with my binos I could not dial in a clear sighting. I remembered my Bushnell spotting scope 16x32x50 and was able to dial in a fuzzy disk which I could tell why it was sparkling by the sun as it was wobbling. As I dialed the spotting scope in tighter I was able see an irregular geometric shape on the bottom of the disk as if it was an exhaust port.  I passed off the scope to W1 and he looked and confirmed my sighting, turned called out that's it I am calling it is a UFO and I responded with nope IFO.  I asked W1 to fire up his camera and by the time we did that the saucer was no where to be seen.  This the second time this year I have seen bright shiny stars in the late afternoon/early evening and ! the first sighting was March and I did not have a chance to id! entify t hat one.  This is the 3rd sighting for people residing in my home in 2013. Willamette Valley is hot this year!  What I am wondering is I know that if I was standing almost directly below and the airliners were right underneath as they passed the saucer could the pilots help but not see the craft.  There was no indication that they deviated off there flight path but flew right under the saucer both ways.  I am sure both jets were outbound and inbound Portland Or.  After listening to Ground Zero recently I decided I better check in and report.",
      "link": "http://www.nuforc.org/webreports/106/S106380.html",
      "state": "OR",
      "duration": "4-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c84",
      "summary": "2 orange fiery, round objects flew over brownsville, tx near east price road.",
      "city": "brownsville",
      "shape": "circle",
      "date": "2013-11-11T00:00:00",
      "story": "2 orange fiery, round objects flew over brownsville, tx near east price road The neighbors and I saw them.  They were 2 round objects, fiery irange in color and they looked like balls of fire.  We thought they were comets because they were going down like falling but then they stopped falling, suspended in mid air, kept flying and the lighting changed from fiery to just lighted orange. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103580.html",
      "state": "TX",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0db7",
      "summary": "Four white objects and one red object observed red object negotiated incredible maneuver and high rate of speed.",
      "city": "brownsville",
      "shape": "circle",
      "date": "2014-01-16T00:00:00",
      "story": "Four white objects and one red object observed red object negotiated incredible maneuver and high rate of speed On the evening of April 17, 2013, I was returning home after work at 9:25 PM when upon exiting my vehicle I looked up and witnessed the following.   It was a clear night with very few clouds, and the stars were easily visible and very distinct. As I looked up I saw a formation of four faint white round objects that were about the size of a small star, but not quite as bright.  They were traveling from east to west at an approximate speed of a conventional aircraft.  I first thought they were the wing tip lights found on military jets.  There were no anti collision lights operating and they were in a formation of two groups of two that with about five times as much distance between each group of two.  Each pair of lights was about a distance apart equal to the width of my index finger with my arm outstretched.  What made me believe they were military craft was the fact that they were so close to each other.  What was strange was there was no noise and I could not make out the outline of a fuselage.  What occurred to me later, upon reflecting on what I had seen was that they were each a separate object.  I realize the human mind must rationalize everything, so my mind had to rationalize them as being wing lights on a con! ventional aircraft. I first saw the lights above me and slightly to my right.  A few moments later out of the corner of my right eye I noticed another brighter object.  It was traveling toward the smaller lights from the East North East at a much faster speed.  This object was extremely bright compared to the other objects. It was about the size of a quarter inch ball bearing held at arms length.  The object was almost white in the center with a reddish cast at the outer edges.  It over took the other objects in a matter of a few seconds and came close to the group of lights on the right.  As it arrived at the group of lights on the right it made an incredible left turn that was almost a right angle.  When it negotiated the change in direction it intensified in brightness and it became a deeper color red, it also increased in speed at an astounding pace. The larger object went south at an incredible speed and was out of my field of vision in about a second.  I must also explain that the southern horizon was not visible to me because it was obscured by my house and the other houses around me.  I therefore could not observe the object as it traversed the sky to the southern horizon.  The four objects proceeded west till they no longer visible to me; their speed remained the same through out the event.",
      "link": "http://www.nuforc.org/webreports/106/S106198.html",
      "state": "PA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c32d3",
      "summary": "Big, bright, orangish, hovering light that blinked colors.",
      "city": "brownsville",
      "shape": "changing",
      "date": "2015-04-03T00:00:00",
      "story": "big, bright, orangish, hovering light that blinked colors My husband and i were lying in bed looking out the window from our home thay sits 800 ft in elevation. We saw what we originally believed to be a very big bright star.  We stared at this,  bright orangish yellow object that blinked colors of red, yellow and orange, for atleast an hour.  It eventually was out of view but hovered and moved in a wobble type pattern for about 30 minutes until eventually only the brigjtness and lights could be detected seeming to move towards I5.",
      "link": "http://www.nuforc.org/webreports/118/S118117.html",
      "state": "OR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c354d",
      "summary": "Orange, orb like lights hovering above Turnpike 43.  Multiple witnesses from multiple vehicles slowing to witness.",
      "city": "brownsville",
      "shape": "light",
      "date": "2015-02-06T00:00:00",
      "story": "Orange, orb like lights hovering above Turnpike 43.  Multiple witnesses from multiple vehicles slowing to witness. While traveling toward Brownsville, Pa, my son, I, and a lot of other drivers witnessed 8-10 Orange Orbs Floating above Turnpike 43.  These things were no higher than 50 feet above the trees.  They Held steady and did not move around.   It was nearing dusk when we witnessed them and could not stop on the turnpike.   When we reached the next exit we turned around and in that time they disappeared.   There were no visible wires, nor did they move like a drone or some r/c.",
      "link": "http://www.nuforc.org/webreports/117/S117099.html",
      "state": "PA",
      "duration": "8-12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36b0",
      "summary": "Dome object with natural daylight emission.",
      "city": "brownsville",
      "shape": "diamond",
      "date": "2015-01-16T00:00:00",
      "story": "Dome object with natural daylight emission. \tThis event happened around 5:10am, as I go in at work at 5:30am.   My mother and I got out of the house that morning,  As I got out of the house and proceed to enter the car with my mother,  I look around my surroundings to see how was the weather, it look hot and dry.   Then as my mother was driving, I notice some fog clouds on the west side of the my view up in the sky.  Then I look around to look for more clouds because the morning was hot and it wasn't any reports of raining.  I notice that there was no clouds around except those on the west side of the sky and they where like only a  little spot, not on the whole sky.   Then while my mother was driving we became aware of a circular dome object that was emerging from those clouds.  The object was very close.  There was no way it could have been an airplane because the object was dome form and suspended on the air very close, it emitted no sound but it emitted a natural daylight light.  But instead of the object havi! ng lights on it. It seem that the actual object itself was emitting that bright light.  What I mean is that the actual metal that formed this object was emitting the light.   I tried to grab my iPhone in order to take a picture, but the object disappear hidden in the clouds.  As we continue to drive I could not spot the object no more… ((NUFORC Note:  Contact information for witness is defective.  Hence, we are unable to correct the error above regarding the time indicated for the sighting.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116719.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4715",
      "summary": "Saw a bright unidentified object in the sky while driving.",
      "city": "brownsville",
      "shape": "light",
      "date": "2015-12-03T00:00:00",
      "story": "Saw a bright unidentified object in the sky while driving. We spotted a bright light as we got onto our exit (216) and noticed a bright white light getting brighter (Like headlights) and closer going South and stopped our car to observe.  It went over us and curved East.  There were orange/red lights on the bottom and on the back and we noted it had a triangular shape.  It was moving too fast and low to be an airplane with no blinking lights but too slow to be a meteor.  It seemed to zig-zag as it flew away and disappeared in the distance.",
      "link": "http://www.nuforc.org/webreports/124/S124434.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c48ea",
      "summary": "Visited by three grey beings in my bedroom.",
      "city": "brownsville",
      "shape": "unknown",
      "date": "2015-09-17T00:00:00",
      "story": "Visited by three grey beings in my bedroom. First of all, my personal history is sketchy.  I could be very easily discredited.  I am a known iv meth user and alcoholic.  I have always had very vivid dreams almost every night for as long as I can remember.  I have also experienced occasional sleep walking, as well as sleep paralysis, since childhood, and as an adult.   That being said, I am also known for my honesty.  I have never met another person who is as truthful and trustworthy as I am.  People closest to me have heard the story I'm telling now and they all believe me because they know I am almost incapable of lying.  However, most of them believe I was dreaming or that obese experiencing some kind of hallucination due to my drug use.  I was not using for several days when this happened, nor had I been drinking. I have hallucinated many times from drug use and I know this was not anything like a hallucination.  Also, I know very well what nightmares and vivid dreams are like.  This was not a dream. Sleeping alone in my bedroom I woke up groggy and experiencing sleep paralysis.  I felt like there was something \"coming to get me\" and I was terrified.  I tried to move my head to see who it was but I could barely move my eyes or even open them.  I saw what I believe to be a tall grey alien in my bedroom doorway.  I did not get a very good look at him but he resembled the classic description of grey aliens.  Large head and large dark eyes, no ears and a small mouth.  He was wearing a long white or silver robe. He telepathically told me to go back to sleep and I did.  I then remember (very vaguely) just briefly standing in front of another grey alien.  I think I was still in my room but not sure.  He also looked similar to the classic description of grey aliens but with darker grey skin.  He was slightly taller than me and wearing a red long sleeve shirt or jacket with a cut out in the neckline similar to a priests collar.  We just stood staring at each other.  The next thing! I remember is waking up in my bed again with sleep paralysis.  This time I was much less groggy.  I was paralyzed but fully awake.  I am %100 positive I was awake and VERY VERY AWARE AND ALERT.  I could feel the presence of them before I even opened my eyes.  Opening them was very difficult.  When I did finally open my eyes I saw another grey alien sitting next to my bed right beside me.  There was another being standing at the foot of my bed.  I could only see him out of the corner of my eye because I could not move my head at all.  He was wearing something red and I believe that he (the one at the foot of the bed) was the same one I had previously stood in front of, but I can't be sure.  I feel like there was a third one in the room as well but ,again, I can't be sure as I did not even get visual on a third...just a sense that another was there. I did get a good look at the one sitting beside my bed.  He looked similar to the classic description of grey aliens.  He was dark grey/lar! ge eyes/no ears/small mouth etc....but with swirly kind of freckles(ma rkings similar to tattoos?)on his face near his eyes. He was wearing a black long sleeve shirt or jacket and possibly a silver metallic necklace but I'm not sure.  He stared at me for only a few seconds but I was aware of at least some of his thoughts as well as the telepathic communication between him and the others.  He told the one at the foot of the bed that I was awake and I was going to remember.  The one at the foot of the bed told him to put me back to sleep.  He stared at me a few more seconds and I could hear his thoughts, which are very difficult to explain except that they were positive thoughts.  He did put me back to sleep and that is all I remember. The next morning I found a bruise and a possible injection mark on my right arm.  I also had a tender spot on the lower left base of my skull.  For the next several nights I would wake up with sleep paralysis and a feeling that they had been there but no clear memory of it.  I have not had any more memories of encounters or sleep paralysis since. ((NUFORC Note:  Source of report indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121911.html",
      "state": "OR",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3c769d",
      "summary": "Glowing disk crafts in night sky.  ((anonymous report))",
      "city": "brownsville",
      "shape": "disk",
      "date": "2018-01-12T00:00:00",
      "story": "Glowing disk crafts in night sky On December 28, 2017 @ approximately 8:30 pm I noticed a very large stationary bright orangish yellow light in the southeastern sky so I hurried and got my spotting scope to get a better look. Whenever I returned and started to look at it through the scope it slow started moving north just above the trees maybe 50-100 ft.  I debunked it being a plane or helicopter because there was no noise and no flashing four lights.  It also wasn't a satellite cause it was too low.  Fully zoomed in on it the shape of the craft was very distinguished and appeared to pulsate going dim to bright.  I watched it for about a minute or two, until it was out of sight. Three hours later I was outside smoking again and noticed a similar craft moving from south to north but on the opposite side of the house.  When zoomed in all the way I saw a disk shaped craft that appeared to be spinning while moving forward.  The craft also had a rotating ring of lights dividing the craft in two.",
      "link": "http://www.nuforc.org/webreports/138/S138054.html",
      "state": "PA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c817b",
      "summary": "Object capable of hovering and flying really fast in weird patterns with different colors of lights",
      "city": "brownsville",
      "shape": "unknown",
      "date": "2018-02-22T00:00:00",
      "story": "Object capable of hovering and flying really fast in weird patterns with different colors of lights It was flying low over my house, as I drove down my street.  I commented that someone was flying way too low.  It appeared large and had a red light.  By the time I pulled in my driveway, it went high up in the sky (appearing much smaller) and was flying around like in an arc.  Then as we sat in the car and watched it stopped and appeared to just hover in the sky in one spot for awhile.  Then it went from red light to a green and white flashing light for a few seconds.  Then back to red and still hovering.  Then it flew impossibly fast in a kind of little circle.  Then it had the different color flashing lights again and hovered.  Then it flew really fast down until it was behind the house and I couldn’t track it anymore.",
      "link": "http://www.nuforc.org/webreports/138/S138829.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c91fa",
      "summary": "THE OBJECT WAS ROUND, BRIGHT LIGHT AND JUST WENT UP STRAIGHT INTO THE AIR IN LESS THAN 5 SECONDS",
      "city": "brownsville",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "THE OBJECT WAS ROUND, BRIGHT LIGHT AND JUST WENT UP STRAIGHT INTO THE AIR IN LESS THAN 5 SECONDS LOCATION OF SIGHTING WAS ON 10/11/2019 AT 3:00AM IN BROWNSVILLE TEXAS BETWEEN 12TH AND 13TH STREET IN EMPTY LOT. AS I WAS ASLEEP THE SOUND OF STRONG WINDS WOKE ME UP. I WAS THINKING IT WAS THE A/C COMPRESSOR GOING OUT OF ORDER AND MAKING LOUD NOISE. I WENT TO CHECK THE FRONT DOOR TO THE HOUSE TO CHECK A/C COMPRESSOR AND NOTHING. I WENT TO BACK DOOR FACING THE ALLEY AND SAW BRIGHT, STRONG LIGHT ALONG WITH STRONG WINDS GOING IN CIRCLES IN THE MIDDLE OF THE EMPTY LOT OF THE BACK OF OUR HOUSE. AS I OPEN THE DOOR IT WAS MORE SCARY TO SEE AND WITNESS A BRIGHT LIGHT AND WINDS WITH PRESSURE JUST GOING IN CIRCLES. IT WAS NO HELICOPTER. IT WAS A VERY BRIGHT ROUND OBJECT. AS I FAST CLOSE THE DOOR AND LOOKED THROUGH MY KITCHEN WINDOW WHICH WAS LESS THAN 5 SECONDS THE LIGHT STARTED TO DECREASE AS IT SHOWED HOW IT JUST WENT UP STRAIGHT UP INTO THE AIR. THE LIGHT WAS SO VERY BRIGHT AND NOISE WAS LOUD. I AM STILL IN SHOCK TO HAVE WITNESS THIS AND THINK PEOPLE WILL NOT BELIE! VE ME IF I WAS TO MAKE A REPORT TO POLICE. ALL I CAN SAY IS THAT I AM TELLING THE TRUTH AND NEED FOR SOMEONE TO COME AND CHECK THE SCENE FOR ANY KIND OF EVIDENCE. I AM EVEN AFRAID TO GO OUTSIDE. I BEG TO PLEASE DO AN INVESTIGATION REFERENCE TO THIS SERIOUS MATTER.",
      "link": "http://www.nuforc.org/webreports/149/S149768.html",
      "state": "TX",
      "duration": "<2 minutes"
    }
  ]
}