{
  "city": "buffalo",
  "fetch_timestamp": "2025-07-12T14:35:26.056706",
  "record_count": 98,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4df3",
      "summary": "The ship was close to my house and hovered over trees on the next street and then zipped off like the speed of light.",
      "city": "buffalo",
      "shape": "disk",
      "date": "2019-05-09T00:00:00",
      "story": "The ship was close to my house and hovered over trees on the next street and then zipped off like the speed of light. My brother and I were waiting for the school bus and we were standing inside our house behind a glass door.  So I see look up at the sky and I turn my head to the left and I see the ship zip across the house and street and stopped and hovered over the trees on the next street over and just sat there for a minute and the zipped off and never saw it again.  It was silver saucer like ship but I did see the top of the ship because I think it was camouflage or it was a small top.  I didn’t see any aliens just the silver ship that didn’t make any sound or make the trees mover because of how low and fast it was when it went over the trees.",
      "link": "http://www.nuforc.org/webreports/145/S145994.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5201",
      "summary": "Sighting of a traingle object the size of a small jet plane with a few light hovering over trees and moving in a slow circular motion.",
      "city": "buffalo",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "Sighting of a traingle object the size of a small jet plane with a few light hovering over trees and moving in a slow circular motion. Well I would have to say the sighting was about 6 years ago or so and I had never really thought about it until a friend of mine had told me about a similar sighting near or around the same time mine took place.  My mother and I were driving back from Lancaster, NY into the city of Buffalo at about 10pm when we noticed a black triangle type object about the size of a small jet plane. Immeditaly my mother and I knew something was wrong because the object was hovering above a bunch of trees and slowly spinning in a circular motion. This made us look at it closer. We then noticed that it did not have wings of any kind, it was a solid traingle with bright white lights in each corner and a few little red lights in the middle of the object. I think what was weirdest about the object is the way it was hovering...I can't really explain it but it was like nothing I had ever seen, it was so still and moving in a perfect circle...the lights in the middle of the craft were moving in a circle also but at rapid speed.  We watched it for a bit and the more we looked the more freaked out we got and my mom decided that she wanted to drive away. We had never stayed to see what it would do next and to this day I get chills talking about it. It was really really weird. ((NUFORC Note:  We have assigned an arbitrary date above, which corresponds to the statement by the witness that the event occurred \"about 6 years ago.\"  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52806.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b54d1",
      "summary": "Black triangle with the orange lights at each corner",
      "city": "buffalo",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "Black triangle with the orange lights at each corner I have seen a lot, it's just that simple.  Since the first evening my mom pointed out two strange lights in the evening sky that eventually took off at light speed, up and at an angle.  Not something a plane can accomplish, especially back in the mid seventies.  There were to white lights, kind of moving back and forth, slowly.  It would move to the right, stop, move back to it's origanl position, then to the left, and then back to it's position again.  It would do this all the time for nights at a time, when it was a clear starry night.  Finally one night when I watching it, it just shot up at an angle at unbelieveable speed and it was gone.  I never experianced it again.  I've seen lights that illuminated, in a strobe like matter, starting with a large bright white light, to a green, red, blue, back to a brillant white again.  Seen that all the time.  Mainly in the fall months when the sky was clear.  My most favorite happened in the late 90's when I used to go out almost every night just to see what I could see.  I was getting ready to head in for the evening when suddenly a black, triangler object, about the size of a small plane hovered like a kite over my head. It was triangler shaped, black, thin, it had 3 round orange lights at each corner.  It was completely silent.  When it finished going over, and I couldn't see the underneth any more, it turned on its side, so I could until it was out of sight.. ((NUFORC Note:  Source of report indicates that date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58417.html",
      "state": "NY",
      "duration": "30 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b60c7",
      "summary": "Large rectangular shape- gray in color.",
      "city": "buffalo",
      "shape": "rectangle",
      "date": "2007-02-01T00:00:00",
      "story": "Large rectangular shape- gray in color.  Traveling Northwest very fast.  In and out of horizion within 3 min.  There were military craft chasing and vastly outran.",
      "link": "http://www.nuforc.org/webreports/054/S54485.html",
      "state": "MN",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b655d",
      "summary": "My kids and I were sitting outside by the fire camping in Darren Lake theme park and my oldest son 19 said look up there, I saw the sam",
      "city": "buffalo",
      "shape": "oval",
      "date": "2007-10-08T00:00:00",
      "story": "My kids and I were sitting outside by the fire camping in Darren Lake theme park and my oldest son 19 said look up there, I saw the same thing last night but only 1, tonight there was 2 orange lights flying in a line a ways apart then the one in the rear caught right up to the one in front and stoped moving for a minute or more we heard no sound and it was so high up no way it was from the park and the night before when my son say just one it was in the sky behind us. ((NUFORC Note:  The witness suggests an evening sighting.  We have changed the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58663.html",
      "state": "NY",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b46",
      "summary": "Two small, dim orange lights abruptly do a 180 turn, one engaging in eratic zig-zag motions",
      "city": "buffalo",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Two small, dim orange lights abruptly do a 180 turn, one engaging in eratic zig-zag motions This observation occurred at approximately 2300 hrs EDT on 5/3/07 in Buffalo, NY.  The sighting was also observed by my 26 year old son.  We were standing in a downtown parking lot (near Shea's Theater) when I spotted the bright star Arcturus in the eastern sky. As I looked at the star I noted a small (smaller than the star) object emitting dim, non-blinking orange light moving toward and somewhat above Arcturus from the south (my right) heading north.  At first I thought it must be a very distant aircraft, but its later behavior negated that assumption. \tAs this first object moved past the star, I noticed a second, identical object following behind the first, and moving just below Arcturus.  Once past the star, the top object (first one sighted) seemed to slow while the second object caught up with it.  They moved close to one another – and then completely reversed course, now moving south (toward my right).  As they did so, the bottom object engaged in a rapid up-down zig-zag pattern, which removed all doubt that these things were ordinary aircraft. \tThe two objects then flew off together, maintaining a constant separation, and appeared to circle around the city to the south, west, and then north.  We were passengers in a car with other people so finally had to quit our observations before the objects disappeared.  Again, these were tiny (compared to most visible stars), dim reddish or orange lights.  We could not make out any shapes beyond that. \tI am a PhD professor, geologist and planetary scientist.  I teach college astronomy courses and have been avidly observing the skies for over 50 years.",
      "link": "http://www.nuforc.org/webreports/056/S56528.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6daa",
      "summary": "Two red lights (about the width of the pink finger held away from the body) in the sky almost directly moving at a very fast rate.",
      "city": "buffalo",
      "shape": "unknown",
      "date": "2007-04-27T00:00:00",
      "story": "Two red lights (about the width of the pink finger held away from the body) in the sky almost directly moving at a very fast rate. Basically, I was just stargazing this night instead of using the telescope.  Orion was well to the west and setting and Gemini was in the southwest and Saturn was SSW to the right of the constellation Leo.  The condition was clear for a change and I was noting the light pollution due to an article I recently read in Sky & Telescope. Just as I was gazing near Castor and Pollux a pair of red lights set evenly apart was moving at a very fast rate from those star locations towards the east.  There was no noise.  The width these light were apart was just about the width of a finger held at arms length away from the body.  The lights remained evenly apart the whole duration.  I could not determine any kind of shape between or around the lights or if it was one or two objects. The only aircraft that was near was a plane coming from the NNE and headed south towards Buffalo and that made a definite noise.  About 12:15 or so I went inside to consult the NASA http://spaceflight.nasa.gov/realdata/tracking/ website to verify where the ISS was located, which was New Zealand at the time. The only thing I can conclude it was too fast to be a normal passenger aircraft and not quite a communication, ISS or other satellite and I have witnessed the ISS before.",
      "link": "http://www.nuforc.org/webreports/055/S55909.html",
      "state": "NY",
      "duration": "less than 3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b737f",
      "summary": "Streaking Light during field goal kick Patriots vs Bills Sunday Night Football",
      "city": "buffalo",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "Streaking Light during field goal kick Patriots vs Bills Sunday Night Football Patriots vs Buffalo Bills.  Look at footage of the field goal where the Ball hit the camera.  There are one if not two lights streaking up in the sky.  Should be checked out.  The network only showed the replay once.  My husband and I noticed it right away.",
      "link": "http://www.nuforc.org/webreports/059/S59939.html",
      "state": "NY",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b778c",
      "summary": "Bright white light moving south from Buffalo, NY at nominal speed",
      "city": "buffalo",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "Bright white light moving south from Buffalo, NY at nominal speed (5:15 to 5:30 AM), I was riding my bike along Nottingham Terrace along Delaware Park in Buffalo, New York. I was looking at the sky and spotted a light coming in from the North. I stopped and watched as is got closer and passed overhead.  The things that interested me most was 1) It was NOT flashing. 2) There was NO sound. 3) There was no trails of any kind and NO smoke. 4) It was an incredibly bright white light.  It never dimmed. In fact it stayed the same brightness as it passed over me and only faded as it got far away. I could see it for a good 20 miles after it passed over me. I compared it with the few stars left in the sky and it was incredibly big and very far away, or close, and so bright it just looked big. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57928.html",
      "state": "NY",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b78e0",
      "summary": "Bright white circular like light moving north, northest from the Elmwood strip in Buffalo, New York.  ((NUFORC Note:  ISS??  PD))",
      "city": "buffalo",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "Bright white circular like light moving north, northest from the Elmwood strip in Buffalo, New York. This is the second sighting of exactly the same craft so i am going to post the same report with some small additions.  Between 8:45 pm (eastern time) and about 9:30pm the object was traveling over Buffalo, (where I was at was on Elmwood Ave. and Bryant streets at work) coming this time from south, southwest and traveling roughly north, northwest. The object was incredibly bright, and I would say as bright as Venus when it was visible here.  The things that interested me most was 1) It was NOT flashing. 2) There was NO sound. 3) There was no trails of any kind and NO smoke. 4) It was an incredibly bright white light that seems to be round.  The size was either massive because it was close, or it was the light it was emitting was just very bright. It never dimmed. In fact it stayed the same brightness as it passed over me and only faded as it got far away. Had the hospital not been blocking a further view, I estimate I would have seen it for a few miles. I compared it with the few stars left in the sky and it was incredibly big and very far away, or close, and so bright it just looked big.  The last time I saw this was on July 31, 2007 at approximately 5:30am (eastern time) traveling in the exact opposite direction. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD)) ((NUFORC Note:  ISS??  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57964.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c9f",
      "summary": "These were not  fireworks",
      "city": "buffalo",
      "shape": "disk",
      "date": "2006-07-16T00:00:00",
      "story": "These were not  fireworks My wife and I were outside with two other cuples and there son when three disc shaped objects moved towards our home from a distance. There were alot of fireworks going off that night,and we were unsure what it may be until they contiued to move closer it was our belief that it was an ufo they moved closer until they were about 200 feet from us and about half mile above. They hovered over us for nearly a minute and then in the blink of an eye they were gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51193.html",
      "state": "MN",
      "duration": "45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7dc1",
      "summary": "Yellow streak seen on Buffalo state college.  ((NUFORC Note:  Possible Geminid Meteor??  PD))",
      "city": "buffalo",
      "shape": "light",
      "date": "2006-12-14T00:00:00",
      "story": "Yellow streak seen on Buffalo state college I was walking with a friend north on Buffalo State College campus.  We were in front of tower 3 about 1/8 mile away.  It was a dark cloudy night.  We saw a round yellow streak of light that appeared in the sky.  It moved very fast, made a sharp turn and went behind Tower 3.   The sighting lasted about 2 seconds.   We called campus police shortly afterwards. ((NUFORC Note:  The Geminid Meteor shower peaks on this date.  Hence, possible meteor.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53977.html",
      "state": "NY",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8748",
      "summary": "UFO seen through Dobsonian scope",
      "city": "buffalo",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "UFO seen through Dobsonian scope Weather \tMostly clear. A few very small higher up cumulus clouds, mostly see through. Air temperature 79° F. There was an approximate wind of 5.76 mph east. Visibility 10 miles. Humidity 44% Dew point 55° F  Telescope \t10” Zhumell Dobsonian \t\tEyepieces:       Main - 2” Zhumell 32mm Wide Field View Lens \t\t\tHigh Power -  1.25” Meade 9mm Lens   8:15 - Notice light in sky. Believe its Jupiter. 8:16 - Not Jupiter. Possible mars, don’t fully believe it's Mars though. 8:18 - Notice object is dimming 8:26 - Go to set up scope 8:28 - Scope is on porch 8:29 - Object is in finder scope 8:30 - See Mars like object in main eyepiece 8:31 - See second small point of light orbiting main object 8:33 - See tether/ tractor beam “connecting” two objects 8:35 - Wife is on porch with me and looks through scope 8:37 - Attached tension spring 8:37 - Tried to put in high power eyepiece 8:38 - Put in main eyepiece again 8:39 - Found main object and saw it was blue 8:40 - Neighbor is with us 8:43 - Tried to use high power eyepiece again 8:43 - Moon filter off 8:44 - Object no longer visible  It was about 8:15 PM EDST in Buffalo, NY. I as well as my wife and a neighbor were sitting on our neighbors porch as the sun was setting. We were talking about various things when I spotted a light in the sky. It was reddish orange at first sighting and fairly bright. It was stationary to the naked eye and no other visible objects or distinct lights around it. At first I though it was Jupiter and continued to watch for a minute. I then realized that it was to close to the zenith to be Jupiter and began to think it could be Mars but I was not sure due to my not seeing a star chart in about a year and wasn’t sure if Mars was visible yet. So I proceeded to my apartment next door and went upstairs to put my telescope on our porch and try to view it. As time went on the object dimmed very slowly. It was about 8:30 EDST when I got my scope out and had the object in my viewfinder. I then viewed it through my main eyepiece. What I saw looked almost exactly like Mars in size, shape, hue, and reflectivity. It appeared to have an atmosphere/clouds. The object had the orange/ red color but was not emitting the light on its own. As I stared I though what I saw next was caused by my eyes playing tricks on me. I saw a tiny point of white light orbiting the main object extremely fast in a teardrop shape around the object. If the main object were the point of a teardrop than the tiny point of light was moving in a clockwise motion as viewed through the scope. The point of light moved out towards the 10 O’clock  position of the main object and went out approximately 5-8 lengths of the main object in the teardrop fashion. It concluded 1 rotation at about the 1 to 2 O’clock range of the main object. One rotation was approximately 2 and ½ seconds. I started shouting to my wife, who was still downstairs on our neighbors porch, to come up to my scope quickly because I am seeing something amazingly not natural. It is now about 8:35 EDST and she is up with me. Whilst she was coming up though, I continued to view the object throu! gh my sc ope and noticed something amazing. I saw some form of a tether/ tractor  beam that appeared to be connecting the small point of light with the main object. The tether appeared to be the same hue of the main object, reddish/ orange, but it was very faint but defiantly there. My wife looked through my scope and saw what I saw, the point orbiting the main object, minus the tether due to her wearing glasses.  I looked back one more time and stared for about 1 minute than began to adjust my scope, as I hadn’t attached either tension springs.  I attached one tension spring to the left side of the scope. When I finished that I got out a 1.25” 9mm lens and tried to find the object again. I couldn’t so I put on the 2” eyepiece again and found it rather quickly but what I saw surprised me once again. The object had turned blue. It still looked the same as before with all the same features but it was just blue.  Also the small object orbiting had disappeared and so was the tether/ tractor beam. It is now about 8:40 and our neighbor is now up with us and looked through the eyepiece. He saw the blue object and was disappointed that it wasn’t something waving at him. Well I watched it for a few more minutes  and then decided to try the higher power lens. I put the lens in and noticed right away that I had forgot to take the moon filter off and so I quick took it off. It was now about 8:43. Once I put the eyepiece back in I lost sight of the object.  I immediately ran inside and began typing this for accuracy of time/description. This is the best I can do without have the right questions asked. Feel free to contact me for anything more that I may have no added in as I didn’t know the info was needed.",
      "link": "http://www.nuforc.org/webreports/065/S65337.html",
      "state": "NY",
      "duration": "30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8877",
      "summary": "Bright, white object with flashing red, yellow, green, and blue lights hovering in the night sky seen from Buffalo, Minnesota",
      "city": "buffalo",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Bright, white object with flashing red, yellow, green, and blue lights hovering in the night sky seen from Buffalo, Minnesota On January 15, 2009, I witnessed an Unidentified Flying Object from my home in Buffalo, Minnesota.  Here are the event details:  my husband and teenage daughter went out to run some errands.  I’m not exactly sure what time it was when he called me to see if I could see it from our house.  Indeed I could.  I studied it for a moment and concluded that it was not an airplane; I am familiar with the light patterns of airplanes, and this craft was flashing red, yellow, green and blue and seemed to be hovering in the night sky.  I grabbed my digital camera and took some pictures.  Looking at the craft with the naked eye, there were no “tails”, however, the “tails” were captured using the camera.  I then proceeded to use my digital camera to record a video of the craft.  In the video, we could see the movement: back and forth, up and down, and side to side, with no regular pattern.  My husband proceeded to tell me on the phone that he and our daughter were trying to drive to the craft’s location, but every time they got close, the craft would shoot to another location within view.  Duration of sighting was at least two hours.  Only one craft was sighted, its shape was hard to determine due to the distance, but seemed to be a bright light (extremely bright) with flashing red, yellow, green, and blue colors.  Its motion was sporadic at times, but seemed to hover in the same general area in the sky.  The weather conditions were as follows: very cold (approximately -20o) with clear skies.  It was evening (after 6 pm Central time).  The next day, January 16, 2009, a relative from Mason City, Iowa called to say that their family of three also saw the object in the sky (I posted the video on the internet and sent them pictures as well).  Our teenage daughter also captured some pictures with her digital camera, showing more erratic movement and green “tails”.  Distance was very hard to determine since the movement was not visible with the naked eye.  I was standing at my patio doors, filming above my h! ead slig htly.  From where I was standing, in order to cover it in the sky, I would have to have held up a dime.",
      "link": "http://www.nuforc.org/webreports/068/S68069.html",
      "state": "MN",
      "duration": "at least 2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b04",
      "summary": "Green and red Lights spotted over Buffalo making a 90 degree turn before travelling at a high rate of speed over my car",
      "city": "buffalo",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Green and red Lights spotted over Buffalo making a 90 degree turn before travelling at a high rate of speed over my car Driving home from work on the I-190 South just passed the route 5 exit going right between some of the taller buildings in Buffalo I spotted two lights next to one another well above the buildings but not too incredibly high up. A green one on the left and red one on the right. Neither were blinking. The object or objects flew without sound (at least none I could hear with my window rolled down over the sound of my rather quiet 4 cylinder Honda Civic engine) on an upward diagonal toward HSBC arena and the lake (lake Erie) to my left. I could not see a defining shape in the black night sky. Pondering if it was a plane or not and if so wondering where any blinking lights were-The craft or crafts made a 90 degree angle and flew directly over my vehicle at a high rate of speed (again I heard no audible sound.) Being on the expressway I had no way to easily turn around to see where the object or objects went and could not safely see them from any of my mirrors.",
      "link": "http://www.nuforc.org/webreports/065/S65525.html",
      "state": "NY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c32",
      "summary": "While traveling north on I-190, a friend and I saw a shiny object in the sky close to the horizon line. It appeared as if it was a brig",
      "city": "buffalo",
      "shape": "cigar",
      "date": "2009-12-12T00:00:00",
      "story": "While traveling north on I-190, a friend and I saw a shiny object in the sky close to the horizon line.  It appeared as if it was a bright light, though some how we could tell that it was in fact reflecting light more than any other object we have ever seen.  I saw it first and pointed it out to my friend saying, \"is that a UFO\", and he responded that he too thought it was a UFO.   The craft then moved swiftly to the right, the movement was swift and odd to watch as it did not move like any other air craft we had ever seen. It then came to a complete stop, then it backed away until it disappeared into the sky. It was the most incredible thing I have ever seen.  I no longer question the existance of UFO sightings.",
      "link": "http://www.nuforc.org/webreports/073/S73181.html",
      "state": "NY",
      "duration": "brief"
    },
    {
      "_id": "64d005f478aba2ec5a3b924d",
      "summary": "Changing Light near Buffalo, Texas",
      "city": "buffalo",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "Changing Light near Buffalo, Texas At 2037 (looked at clock right afterward)  tonight traveling south on I45 in Texas near Mile Marker 166 my friend and I witnessed a bright white light that turned red then green and faded out.  It came down at about a 45 degree angle and turned horizontal before winking out.  The light was also heading in the southern direction parell to the interstate.  It was approx 150’ feet of the ground when it disappeared.  I could not tell its shape that it happened very quickly.  We saw it for only about ten seconds.  I remarked to my friend that he just saw his first ufo.   I have personally seen several ufos that I have reported- I am a Professional Truck Driver.  My friend is a Professional Oil Field Equipment Salesman.",
      "link": "http://www.nuforc.org/webreports/074/S74560.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b96b4",
      "summary": "Fast moving light curves in sky",
      "city": "buffalo",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "Fast moving light curves in sky Outside of a theater, 2 observers witnessed what appeared to be a \"shooting star\" streak across the Eastern part of the sky, headed in the northeast direction.  It was seen in peripheral vision at first, and upon looking up, a solitary white/yellow orb of light quickly raced across the sky, curved right, then left, then right again, in an \"S\" form, before disappearing.  The local airport was nearby, but the object was moving much too quickly to be any kind of commercial aircraft (and had been moving away from the airfield).  If it had been military or an otherwise highly-technical aircraft, there was no sonicboom, nor could an aircraft turn so sharply.  One of the observers was a former US Air Force personnel.",
      "link": "http://www.nuforc.org/webreports/074/S74034.html",
      "state": "NY",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9812",
      "summary": "5 Bright lights float over home",
      "city": "buffalo",
      "shape": "formation",
      "date": "2010-04-13T00:00:00",
      "story": "5 Bright lights float over home Total of 5 candle like glowing crafts seen in different formations gliding over house.  First began at approx. 23:00 with a large, fast moving, blue lighten (6 blue lights), curved, arch like formation over some trees in the distance. 2 witnesses saw this event, the third missed it by a fraction of a second.  About 15 minutes later, a similar craft with 4 lights was seen moving much faster in a different direction across the sky, except this time it was a light grayish-brown shade.  Moments later, in the opposite side of the sky, 5 very distinct, very bright lights slowly glided across the sky.  These lights had a symmetrical formation and moved in and out like a flowing organism.  All three witnesses were taken by the sight, and amazed at the possibility of three sightings in a matter of minutes.  Then, about 10 minutes later, out of the center of the sky appeared two, candle like lights floating symmetrically across the sky, to the edge of the horizon.  Flowing i! n and out in perfect motion. And again these two appeared in the same way another 5 minutes later.  Next, after about 15 minutes of waiting, a single glowing object appeared on the far side of the horizon and floated behind the home, out of sight to the witnesses.  Then, to conclude the experience, 5 very prominent, bright candle like objects, floated very slowly, very low over the home.  They drifted further and closer to each other and seem to have a distinct pattern to them.  They drifted slowly across the sky, and went out of sight approximately 45 seconds after they appeared. the last event was significantly longer than any other sighting of the night.  After this, we saw nothing else and clouds rolled in from the south east.  We noticed that all crafts traveled in the direction of the stars, and each of them had a distinct, candle glowing like form.  However, the first were bright blue.",
      "link": "http://www.nuforc.org/webreports/074/S74732.html",
      "state": "NY",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b98f1",
      "summary": "Red Glowing Ball",
      "city": "buffalo",
      "shape": "unknown",
      "date": "2010-06-03T00:00:00",
      "story": "Headed north on 65 about 9 miles south of Buffalo.  Conditions were cloudy. A large red glowing ball appeared though cloud cover and seemed to pulse for between 5-10 seconds, then went out.  Object did not move left or right and was not a radio station tower, as I live nearby and know the locations of those. I stopped my vehicle and got out to view object if it reappeared so I could photograph it as I had a digital slr with zoom lense with me.  No futher sighting occured after 5 minutes.",
      "link": "http://www.nuforc.org/webreports/075/S75487.html",
      "state": "MO",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9949",
      "summary": "Triangle shape object floating in air.",
      "city": "buffalo",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Triangle shape object floating in air. As I was driving on the threway past the city exit, saw an object in the sky with many lights coming out of clouds. I thought it was a plane but there were no airports directly in the city. It kept declining till it was only a few thousand feet in the air about a half mile to a mile in the distance. It looked like it was in the shape of a triangle, but just the lines  pointing to the triangle, like a Y sort of. I kept driving slowly, and continued to observe the object till I drove out of sight.",
      "link": "http://www.nuforc.org/webreports/067/S67410.html",
      "state": "NY",
      "duration": "2 Minuites"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c79",
      "summary": "Bright light moving towards plane getting bigger and brighter, dissapears before contact",
      "city": "buffalo",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "Bright light moving towards plane getting bigger and brighter, dissapears before contact One evening as we were living the driveway, facing west, I spotted a bright light, which at first I thought was a plane, but there was already one in the same area in the sky and looked different. This light at first was just sitting there, then started moving towards the plane getting bigger and brighter as it moved. I thought for sure it was going to hit the plane, but once it got to it it disappeared. How fast it was going and how the light got much bigger and brighter as it moved closer couldn't have been anything other than a UFO. My boyfriend at the time looked at me and asked what was wrong because my face expression showed shock and excitement. It doesn't sound that intense, but it was amazing to me. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69322.html",
      "state": "NY",
      "duration": "30-45 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b9d36",
      "summary": "First of all let me say that I'm not entirely sure whether what i saw were a UFO or simply aircrafts flying in a unusual formation.  --",
      "city": "buffalo",
      "shape": "rectangle",
      "date": "2008-08-12T00:00:00",
      "story": "First of all let me say that I'm not entirely sure whether what i saw were a UFO or simply aircrafts flying in a unusual formation.  --I live in Buffalo and we have some pretty heavy air traffic around our area, if you look at the night sky for a few minutes, there is a good chance that you'll see some kind of light moving...  What makes my \"sighting\" different, however, is that the way that the lights were positioned relative to their direction of movement.. -- i saw 4 lights  arranged in a square shape, moving toward the direction of the one of the sides...  if you think of an aircraft with 4 lights ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64706.html",
      "state": "NY",
      "duration": "1 minutes?"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ff4",
      "summary": "Low altitude , fast moving cigar/rectangle shaped craft",
      "city": "buffalo",
      "shape": "rectangle",
      "date": "2008-08-12T00:00:00",
      "story": "Low altitude , fast moving cigar/rectangle shaped craft I was driving to work this evening on the I-190 heading north into Buffalo, NY.  As I passed the Hamburg Street exit (Exit 5), I noticed a peculiar light arrangement to my right approximately 1.5~2 miles away.  The lights were in a vertical alignment, like what you would see if a commercial jet banked 90-degrees.   At the very top was a pulsating white light (not flashing).  Below that were two blue lights.  Much further below (50 to 100 feet) the blue lights was a single red light. As I followed it moving away, it seemed to be a shape like a vertical cigar.  It caught my attention and I tried to keep it in view.  I but it disappeared behind some taller buildings in the city to the North.  I then drove around another mile to the Church Street exit (Exit 7).  While exiting the thruway, I saw the same light pattern over my left shoulder.  This time, it was much larger and the light pattern was now 30-degrees from horizontal.  The craft was heading southeast towards Lake Erie and was travelling without making any detectable noise.  If it were a commercial jet, it would definitely have been very audible at the low altitude it appeared to be flying.  The exit I was on is off of an elevated section of the thruway so I quickly descended to a point where my view of the craft was blocked by the thruway. I raced to get to a location where I would have a clear view over Lake Erie.  I reached an opening about 20-seconds later, but to my dismay, the craft could not be found.  In the close up view (2nd sighting), the red light was bright and not flashing.  The blue lights now appeared to be more of a blue glow like from some type of propulsion system.  I would compare it to the blue lights on the rear of the starship destroyer in the movie Star Wars. The white light was now on the far right side of the craft.",
      "link": "http://www.nuforc.org/webreports/064/S64757.html",
      "state": "NY",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba031",
      "summary": "Red/green lights seen over Buffalo New York from Fort Erie, Canada.",
      "city": "buffalo",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Red/green lights seen over Buffalo New York from Fort Erie, Canada. I was driving home from work in Fort Erie,Ontario, Canada, which is on the border of Buffalo, New York.  I stopped at a red light and noticed above the tree's 2 pinkish red blinking lights.  I noticed this because of the colour and the fact that the lights were on top of each other, not beside each other like an airplane.  I watched for a few seconds when the lights suddenly changed to a bright green colour, then immediately afterwards, they changed direction on a dime and started going in the other direction. I thought this was wierd so I decided to follow them.  I drove down to a rest area beside the water about a kilometer away, and could see that the lights were directly over Buffalo, New York.  The lights floated around, changing directions quickly, going left, right, up and down and backwards and forwards.  Then the lights started going up and to the left, slowly slowing down until they came to a stop.   At this time they changed colours again back to the pinkish red colour.   All of a sudden directly below the lights another set of lights appeared out of nowhere.  These lights were an orangish yellow.  It slowly went up towards the first set of lights and then passed it.  The red lights then started moving again, following the orange lights.  Then as quickly as the orange lights appeared, they disappeared.  Then the red lights started moving closer to the water, then turned left and went deeper into Buffalo, getting smaller.  I watched this for about 2 minutes and then left.",
      "link": "http://www.nuforc.org/webreports/073/S73591.html",
      "state": "NY",
      "duration": "20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0dc",
      "summary": "Low flying starlike orbs in urban area, triangle formation make for the sky silently at at unseen speeds",
      "city": "buffalo",
      "shape": "formation",
      "date": "2010-06-03T00:00:00",
      "story": "Low flying starlike orbs in urban area, triangle formation make for the sky silently at at unseen speeds Buffalo, New York, June 1, 2010 05:00 No footage or photos, sighting experience of 5-10 seconds in duration. For self descriptions, my wife and I (mid 30s) are generally open minded and politically moderate individuals, our first such experience. From our 2nd floor patio swing in the downtown area, gazing east we observed 3 very bright objects, possibly orbs which appeared from over the downtown rooftops (amazed so bright despite all the light pollution of our downtown neighborhood), possibly 1500 ft altitude at a distance of less than 2 miles.  These bright white starlike objects were in triangle formation, flying low with a sort of tilt or plane to our view that sheared the shape of the triangle. The objects then appeared to get much dimmer as they appeared to move at an alarming speed ascending, silently and maintaing perfect triangle form. Now also more at a perpendicular plane to our view as it ascended, this triangle was a perfect right triangle, it ascended slightly northward and completely zenith out of our view due to our own rooftop. Whether it left the atmosphere is something left to question. My wife and I chased out into the streets to see if we could still see more, but other buildings and canopied trees blocked our view.",
      "link": "http://www.nuforc.org/webreports/075/S75661.html",
      "state": "NY",
      "duration": "10 Sec."
    },
    {
      "_id": "64d005f478aba2ec5a3babd9",
      "summary": "Kite shaped object  bright white, above deleware park",
      "city": "buffalo",
      "shape": "changing",
      "date": "2010-11-21T00:00:00",
      "story": "Kite shaped object  bright white, above deleware park Driving Along the 33 expressway, I saw what could be described as a kite flying in the air but much larger, higher and lite up.  It was above albright knox art gallery, and as a sky watcher i know it was not a helicopter or plane. it went from where i first noticed it, down almost below tree line back up, stayed stationery for aprox 30 sec and then up higher away and out of sight,  Totally threw me for a loop, there were other cars on 33 that were slowing down behind and in front of me, i know someone else saw what i saw,",
      "link": "http://www.nuforc.org/webreports/078/S78579.html",
      "state": "NY",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bac8d",
      "summary": "Bright white object with blue, red, green and white lights close to Buffalo International airport... 1.5 hrs",
      "city": "buffalo",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Bright white object with blue, red, green and white lights close to Buffalo International airport... 1.5 hrs Time 3:30am - Walking to my car when I looked to the south east sky and noticed a bright object flash across the sky and come to a full stop. This object had white, red, blue and green lights around the outside of the object.  Time: 3:35am- went inside my apartment to get my binoculars to get a closer look. Object still appeared to have white, red, blue and green lights flashing around the object. Called the police department, they seemed to have no interest in what was happening.  Time: - 3:40am drove car to the convenient store 1/20th mile from my apartment to see if I could get the attendant to witness what I was seeing. He was sweeping the parking lot. He was more than willing to give me a few minutes of his time and was as amassed as I was at what we were witnessing.  Time: 3:50am - Went back to my apartment parking lot to watch some more.  Time: 4:00am - Walked across the street to the local supermarket where a truck driver delivering product had just pulled in. I walked to his truck and asked him if he had a video camera and if he would like to see something strange in the sky. He didn't have a video camera, but was willing to take  time and look at the object in the sky. I had my binoculars with me and we both continued to look at the object through the binoculars for over 15 minutes.  Time: 4:10am Police department called me back and asked me where I was located. 5 minutes later a police officer showed up at the supermarket. After exchanging a few words I handed the police officer my binoculars, he thought it was moving and said it could be any number of terrestrial objects, but was strange. He saw the colored lights...  Time: 4:20am - went back to my apartment parking lot to continue watching the object.  Time: 5:10am - Was clear sky's all night, at 5:10am cloud cover was moving in and was now blocking the object so I decided to call it a night.  Well I tried all night to find someone with a video camera, but was unsuccessful. Also tried to see if my neighbor had a telescope, but was also unsuccessful...  I did everything I could to get credible witnesses and video footage...  Also would like to mention I was located 3 miles east of the buffalo international airport... The object in my and the truck drivers opinion was with in distance for the airport radar...",
      "link": "http://www.nuforc.org/webreports/078/S78384.html",
      "state": "NY",
      "duration": "1.5 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3bade6",
      "summary": "Green Orbs, Western NY, 1-2AM 4/9/11",
      "city": "buffalo",
      "shape": "circle",
      "date": "2011-05-02T00:00:00",
      "story": "Green Orbs, Western NY, 1-2AM 4/9/11 The objects in the sky were in the eastern sky, about 30 degrees above the horizon, travelling north in an arc, not a straight line.  The orbs were a brilliant green; a glowing center of green with green halos surrounding them.  The looked quite similar to a firework except far too large to be a firework.  Event occurred between 1:00 AM and 2:00AM.",
      "link": "http://www.nuforc.org/webreports/080/S80825.html",
      "state": "NY",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb311",
      "summary": "Black dinner plate size crab like object that moved on the ground.",
      "city": "buffalo",
      "shape": "disk",
      "date": "2011-01-05T00:00:00",
      "story": "Black dinner plate size crab like object that moved on the ground. the object moved across the highway during a cold foggy night.  If came from one side of the road towards the center cutting in front of our car.  (Driver thought she hit it but no evidence.) The object was the size of a dinner plate and looked like a crab but moved like it hoovered not walked.  It was black with two bubble like eyes on the top.  There may have been, not sure due to the split second appearance, another stick like object that moved away the other direction.  The object had \"legs\" that I can only say were not functioning to move it.  First thought was it was a creature or something being blown across the road however there was not a breath of air, just very cold (10 degrees at most).  It did not move in a this world order.  It may have had a gray or silver ring around the outer edge.  This all happened in a matter of two to three seconds.  Driver and myself, a back seat passenger leaning over the front seat, saw the object and both saw the sam! e thing as we discussed it.  A visit to the site the next morning turned up NO sign of tracks or anything that would suggest something had been there.",
      "link": "http://www.nuforc.org/webreports/079/S79324.html",
      "state": "WY",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb52",
      "summary": "Unknown silent, lighted craft hovered overhead, Buffalo NY",
      "city": "buffalo",
      "shape": "unknown",
      "date": "2011-05-29T00:00:00",
      "story": "Unknown silent, lighted craft hovered overhead, Buffalo NY A craft of unknown shape and size, at an altitude of 4,000 to 5,000 ft. approached from the east, making no noise, and emitting an intense red glow, with yellowish back-lighting.  The craft initially maintained a straight forward motion and consistent speed (although it was much slower than a jet plane). As the craft approached the apex of the sky above me, slightly to my north, it slowed even further, it came to a complete stop, and hovered in that position for about a half minute. then it appeared to lift straight upward at a high rate of speed, still silent, as it lifted away, the lights became smaller and dimmer, until it was no longer visible. The sky conditions where partly cloudy, and I did see jet plane traffic overhead at their normal 30+ thousand feet.",
      "link": "http://www.nuforc.org/webreports/081/S81555.html",
      "state": "NY",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd66",
      "summary": "Grayish star/object moving across sky and then moving upward near Freedom NY",
      "city": "buffalo",
      "shape": "other",
      "date": "2011-10-10T00:00:00",
      "story": "Grayish star/object moving across sky and then moving upward near Freedom NY Hi, I'm a 55 yr old male, I live in Buffalo, NY, and I own a small hunting cabin in Freedom NY. I had never before witnessed any type of a UFO sighting before in my entire life.  I was alone at my cabin the evening of Fri, Aug 26, 2011.  I had been there all day doing some outside work, and then started a small fire in the late evening.  As my fire died out, I decided to look up at the sky for any shooting starts.  About 10 secs after I looked into the eastern sky, I did see my first shooting star.  I then looked into the western sky and I saw another shooting star, or so I thought. This star was moving west to east laterally, and then just stopped and faded out.  After about 2 or 3 secs, it got bright again, and then moved again, and again faded out. It did this at least 7 or 8 times, moving at a equal distance each time and then fading out again.  It then moved at a upward and outward angle from me, again getting very bright when it first moved, and then fading o! ut.   It then moved upward in a straight line, then stopping and fading out again. Then in moved inward and upward toward me, forming a backward letter 'C\", then it just shot straight up into the sky until it dissappeared.  I then looked at my watch, and it was approximately 10:35 pm.  I would say that I observed this star/object for about 3 mins. The stars in the sky appeared to have a blueish hue to them, but this star/object appeared to be more of a bright gray color.  Also of the 12 movements that I observed, the last 5 of 6, the object seemed to have a redish/orangeish glow to it after it moved, and then got gray again.  Like I say, I had never before seen any type of UFO in my life, but I will leave you my contact info, if need be, feel free to contact me, and I'm also very curious if any one in my area reported anything similar.  Thank you",
      "link": "http://www.nuforc.org/webreports/083/S83676.html",
      "state": "NY",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc034",
      "summary": "My husband was on the back deck and called for me to come out and up in the sky was two orange dots following each other then the first",
      "city": "buffalo",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "My husband was on the back deck and called for me to come out and up in the sky was two orange dots following each other then the first dot slowing went out and then the other one went out and disappeared into the sky.",
      "link": "http://www.nuforc.org/webreports/083/S83837.html",
      "state": "NY",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc1bb",
      "summary": "Four dimly lit triangular objects whistle as they pass low over Buffalo, NY",
      "city": "buffalo",
      "shape": "formation",
      "date": "2012-01-12T00:00:00",
      "story": "Four dimly lit triangular objects whistle as they pass low over Buffalo, NY A friend and I were standing on the roof of a 10-story building at night, around 9:15 on December 26th (2011) in Buffalo, NY.  I noticed four dimly lit objects over the city, moving in a straight line from the direction of Lake Erie towards the northeast.  At first glance I thought these were the lights on the wings of a far away commercial aircraft, but appeared too low in the sky and were approaching too quickly. I noticed a corresponding whistling sound as they approached.  The sound was not unlike the sound from those whistling Nerf balls.  It was changing and varied, as if there were more than one Nerf ball sounding at once. It was not loud, but clearly audible.  I could then see that there were four separate objects.  They were black or dark gray, seemingly lit on the underside from the lights of the city. There was also the dim yellow light coming from each, probably coming from the leading tip of the object, because the light was less visible once th! e objects passed overhead. The four objects were flying very near to one another in a flexible delta formation. The formation was like a small flock of birds; imperfect and changing, but they were moving inexplicably quickly with no visible wings.  I noticed them just before they were directly overhead, and were out of sight and earshot within 10 seconds.  I was not able to discern the shape clearly, but my best guess would be rounded triangles, similar to the “flying wing” design of the F117 Nighthawk. They all appeared identical to one another. As they passed, the sounds diminished accordingly, and I quickly lost track of them in the night sky.  Both my friend and I were duly creeped out and went back inside immediately.",
      "link": "http://www.nuforc.org/webreports/086/S86109.html",
      "state": "NY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc667",
      "summary": "Unusual aircraft",
      "city": "buffalo",
      "shape": "other",
      "date": "2011-10-10T00:00:00",
      "story": "Unusual aircraft This doesn't fit a typical UFO report.   At 5:13 pm 5 miles south of Buffalo, MO,  I was outside with my gps and heard a very loud noise that made me think a military jet was passing within site of my location.  After stepping into a location where I could see a larger section of sky, I finally located a sillhouette of what would appear to be a passenger 747 at standard crusing altitude for commercial traffice in the area.  This had no visible contrail and compared to a typical passenger jet appeared to be flying at around 3 times a normal jet.   Based on the altitude the jet could be heard as well, very loud as well as clearly which was unusual in this area, much less at that volume. Based on my normal views of airplanes this should not have been heard, again it was the sound that caught my attention to begin with thinking a military jet was approaching as I had seen f-14's in the area a few days prior.   My cell phone has a compass on it and after tracking the object for approximately 10 seconds by sight it dissapeared much quicker than any 747 at that altitude I had ever observed.  I had aproximately 20 seconds of hearing something approach and 10 seconds of visual on the jet.  Using my compass, it was headed at aproximately 225 degrees sw of my location. I know this doesn't fit into a typical report, but the whole scene did not fit the general feel of a typical 747 commercial jet , altitude, sound and speed of what you would normally think. If it can be determined this was a normal commercial flight, at least maybe weather patterns and temperature etc would help identify other things that you get reported.",
      "link": "http://www.nuforc.org/webreports/084/S84366.html",
      "state": "MO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc791",
      "summary": "Large Oval object hovering with bright, \"blinking\" rotating colors of Red/blue/green/yellow/white.  ((NUFORC Note:  Star??  PD))",
      "city": "buffalo",
      "shape": "oval",
      "date": "2011-10-25T00:00:00",
      "story": "Large Oval object hovering with bright, \"blinking\" rotating colors of Red/blue/green/yellow/white With the naked eye we saw an object in the SE sky that was unusually bright and “blinking” many rotating colors.  Through high-powered binoculars, we saw the distinct colors - red, blue, yellow, green and white, and the shape, which appeared oval with a smaller oval protrusion at one far end of the object.  The object is hovering with little movement, with small intervals wherein the lights appear to dim for a few seconds.  It is a very clear sky with minimal cloud cover, and all the stars/constellations are completely visible.",
      "link": "http://www.nuforc.org/webreports/084/S84666.html",
      "state": "MN",
      "duration": "2 Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9be",
      "summary": "three UFOs seen over Buffalo, NY",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2011-08-21T00:00:00",
      "story": "three UFOs seen over Buffalo, NY Going down the driveway on way to work and just passing sister's house {lives at other end of way} and noticed an orange oblong object in the sky and thought it was a plane in distress, I then realized it wasn't a plane.  Got out of the car and yelled for sister & nephew to come outside.  I went back to my car and seen 2 red orbs in the sky {house hid them at 1st}.  The 3rd {orange} one was now also red and round and followed behind the other two.  They went from west to east. The first 2 turned headed upwards and went further into space.  They turned white before going out of view.  The 3rd one took a minute, following the same path, before turning white and disappearing.  Took a photo with my cell phone of the 3rd red orb but photo appears as a boomerang.  Could this be a camouflage by the craft?  http://wtv-zone.com/onegal/UFO2011.gif",
      "link": "http://www.nuforc.org/webreports/083/S83154.html",
      "state": "NY",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bca74",
      "summary": "Hovering silent craft, size of small plane, maybe spherical",
      "city": "buffalo",
      "shape": "unknown",
      "date": "2011-08-21T00:00:00",
      "story": "Hovering silent craft, size of small plane, maybe spherical Pulled off the side of county road to observe craft in a field. Object hovering treetop high over a field. The craft was between 150 to 200 yards away.   Could see a red and green light a distance apart like a small aircraft would have been.   When craft moved from west to east, a bright white light appeared to come on at the rear.  The three lights together made a triangular appearance, but I personally could not see any space between any of the lights.  There was no sound from the craft.  The craft did not wobble when it made its exit from field, nor did it move forward to turn.  It simply left.  My passenger said that the craft had a spherical shape.  Conditions were clear. Looking at video of V22 osprey, Harrier and F-13 aircraft, it was none of these.   Closest military installation is 60 miles to east but none of these are stationed there. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83270.html",
      "state": "MN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd25f",
      "summary": "One orange, red \"fireball\" circle Buffalo for about an hour.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "One orange, red \"fireball\" circle Buffalo for about an hour. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91219.html",
      "state": "NY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bd383",
      "summary": "6 orange reddish, flashing lights,  slowly coming off the horizon joining in formation",
      "city": "buffalo",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "6 orange reddish, flashing lights,  slowly coming off the horizon joining in formation \tLast night at about 8:30 p.m. is when the event took place. However let me start by saying  the original object I observed has been in the sky for months. I first spotted it in March, looks like a bright star, only its strobing and blinking different colors. I grabbed my friends cheap telescope,  got it in view, and once the object was in focus, I was shocked to see it was 4 lights in a straight line, evenly spaced(also nothing was flashing, as appose to out of focus). I was very surprised and exited, as I’m very into this type of thing, and always wanted to personally witness something. This got me very interested in this “star” , and anytime I’d be outside at night I’d look for it. As said, I’ve observed it for months now parked in the same spot moving across the sky with the rest of the stars, like nothing irregular(other than the strobing lights) and was there the whole time until yesterday.  Sorry for the little pre -story but I felt it was necessary  \tSo last night around 8:15 I started walking to my buddy’s house to hang out, and as always when I’m walking, I look for my star. I take a look at it in the gaps between trees and houses.  As I’m nearing my friends house I see there’s now 2 of the strobing stars next to each other.  This other one hasn’t been there any other time I look. As I get to another gap where I can see the objects again, I notice they are now spaced farther apart. I’m all worked up now, and go sprinting to my friends house, I really didn’t want to be the only one to see this.  My friend wasn’t home right then so I grabbed his neighbor to come out.  Now there were three of these lights, flashing and pulsating an orangish reddish glow, all in a misshapen triangle form, with another one of the lights drifting up from the horizon to join the other three.  Then there was a smaller triangular formation that looked almost identical in formation just smaller, slowly drift up from the horizon.  At this point it was! me, my friends neighbor, and his wife and daughter. \tJust then  my friend pulled in his house, and my other friend who lives up the street came down, and then we had my 2 friends, and my friends mom and sister come look. At this point is when the objects started slowly dissipating. The lower, smaller triangle formation all dimmed slowly until they were gone, then what was left was the larger triangle formation. However now they were equidistant from each other, in a symmetrical  triangle until they all slowly dimmed out. What I thought was interesting, was the fact that atleast the one light, I’ve observed for months, and the fact that last night I just watched this happen and now that light is gone, it‘s truly an awesome experience. A few details I forgot to put in, was that it was quite cloudy, and no stars we’re visible, these were the only visible lights in the sky. And the movement of the objects was all very slow, they slowly came up and they slowly disappeared. Hoping that others have seen this, maybe even got video, I! know my friends mom and nieghbor got a few pictures  towards the end of it all, but a video would really be nice. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93191.html",
      "state": "NY",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5ba",
      "summary": "Seven silent white objects very high in the atmosphere hovering",
      "city": "buffalo",
      "shape": "chevron",
      "date": "2012-08-05T00:00:00",
      "story": "Seven silent white objects very high in the atmosphere hovering On a very bright day, and two coworkers and I were outside.  I was wearing polarized sunglasses which made the seven objects much easier to see.  They seemed very high up in the sky.  The objects were flying very closely together at first and then starting splitting off - one group of two and a group of five.  There was no sound to be heard nor a trail.  At first my coworkers and I thought that it could be gliders, but, not only because of the altitude, the objects changed direction, this seemed unlikely.  They moved very smoothly through the air.  They would stop briefly and continue moving.  We could see them only barely with the naked eye, but through polarized sunglasses they were unmistakeable, white chevron shaped objects.  The hovered around back and forth for nearly five minutes before moving out of view to the east beyond the building we work in.",
      "link": "http://www.nuforc.org/webreports/090/S90921.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd61f",
      "summary": "Orange, slow moving light in Buffalo, NY",
      "city": "buffalo",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "Orange, slow moving light in Buffalo, NY UFO sighting near Wegmans on Amherst Street off Elmwood Ave.  Got this info second hand and afterwards found the following URL which confirmed that several people saw this.  I also see that there were several other reports on the same night in western NY.  http://www.ufostalker.com/ufostalker/UFO+Sighting+in+Buffalo+New+York+United+States+on+March+14th+2012/36496. Several people saw an orange light that was moving very slowly for several minutes.  People tried to record it on their cel phones but when they played the video back it did not show up, even though it was clearly visable and bright.   It was silent and disappeared in a flash.  A few mins later 3 other craft were up there, presumably U.S. planes or helicopters.",
      "link": "http://www.nuforc.org/webreports/087/S87750.html",
      "state": "NY",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bd745",
      "summary": "Balls of fire floating (not dropping) across the sky in Buffalo, NY 10-15-10.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2012-07-04T00:00:00",
      "story": "Balls of fire floating (not dropping) across the sky in Buffalo, NY 10-15-10. I stepped outside of a night club on the night of October 15, 2010 at approximately 9:27pm.  I saw several objects in the night sky floating by from my viewing right to my viewing left.  I was in a suburb of Buffalo, NY.  I grabbed my cell phone out of my pocket and took a few pictures.  My cell phone at the time didn't have any zooming capabilities.  The objects looked like balls of fire floating by.  They did not appear to be dropping in altitude like flares do.  They seemed to be orangeish/reddish/yellowish in nature....like fire. I even sent the pictures to a local TV station who put one of the pictures on the air in a short story reporting that a viewer (myself) saw some unexplained lights in the skies of West Seneca, NY. I showed the pictures to several people asking if anyone else had seen them.  Only one person told me that they saw something similar 2 hours earlier several miles away in the skies before dark.  My experience occurred during the dark night.  I remember pointing and asking a few strangers outside to look and asked what they could be.  They thought it was odd and didn't know.  I couldn't count the number of objects due to them moving as well as some appearing further away.  Trees also cut off the viewing capabilities. The objects all seemed to be moving at the same speed in the same direction.  They didn't appear to be dropping or rising in altitude.  They were moving slow enough for me to observe, but too fast to keep observing and taking pictures for more than a few minutes.",
      "link": "http://www.nuforc.org/webreports/089/S89849.html",
      "state": "NY",
      "duration": "several mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bd753",
      "summary": "UFO with Yellow and Red spotlights which sped off or vanished.",
      "city": "buffalo",
      "shape": "oval",
      "date": "2012-08-19T00:00:00",
      "story": "UFO with Yellow and Red spotlights which sped off or vanished. What basically happened was 2 of my friends and I were playing football in my front yard. We saw this oval shaped object in the sky with two spotlight like lights coming out of the bottom.  One was yellow and the other was red.  The thing about these lights was that they stopped in mid-air perfectly, probably around 20 feet from the UFO. When it was overhead from us, we all recall this very strange feeling.  Then it vanished or accelerated extremely fast and speed off. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91780.html",
      "state": "NY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd823",
      "summary": "Orange \"fireball\" witnessed in the sky west-by-northwest of Buffalo.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2012-05-13T00:00:00",
      "story": "Orange \"fireball\" witnessed in the sky west-by-northwest of Buffalo. We observed an orangeish \"fireball\" shape in the sky, west by northwest of north Buffalo.    (We were on Main Street, slightly south of Northrup St., for what that's worth.)  It appeared to be a single rapidly and irregularly flickering light source.  There was conventional air traffic visible in the same general region of the sky at that time, and the difference between this light source and the planes was pretty obvious: those had regular blinking and distinct lights, even at a great distance, while this thing did not. It did not keep a perfectly straight course as near as I could tell--there appeared to be some \"wobbling,\" although not all of us agreed on that.  (At least one of us thought it was an illusion caused by the light flickering.)  My first thought was that it was a large flying paper lantern, but it was much too bright, much too high up, and after a minute it was clear that it was ascending too quickly for that. It was very clearly visible in the middle of a heavily light-polluted metropolitan area, so it wasn't a faint light. It appeared to be ascending very rapidly, much faster than I have ever personally seen a conventional aircraft rise.  Closest thing I could compare it to from my own experience is a space shuttle launch I saw about ten years ago, but this left no exhaust trail.  After about two minutes, it began to dim and disappeared completely over a ten second period.",
      "link": "http://www.nuforc.org/webreports/087/S87870.html",
      "state": "NY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc19",
      "summary": "Blinding blue/white light over Buffalo, NY.",
      "city": "buffalo",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Blinding blue/white light over Buffalo, NY I was smoking a cigarette at approx. 12:50AM EST.  I looked down to toss my butt, and as I looked up a blinding blue light was moving extremely fast across the southern sky over the city of Buffalo.  The light was blue on the outside and had a white core.  As soon as I saw it, it was gone. Vanished completely into the sky.  I was recently on a flight to Florida and I would estimate the altitude of the object to be under 5,000 feet.  There is an air port here in Buffalo, and for a minute I thought it was a plane crash, however there was absolutely no sound whatsoever.  Remained standing there waiting to see more for about five more minutes, and saw nothing.  The trail left by the object was remarkably short and moved with it, not like a comet or a meteor.",
      "link": "http://www.nuforc.org/webreports/092/S92726.html",
      "state": "NY",
      "duration": "less than 5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bde05",
      "summary": "Glowing White Orb/ Starlike/ Changed direction and stoped on a dime..",
      "city": "buffalo",
      "shape": "other",
      "date": "2012-05-13T00:00:00",
      "story": "Glowing White Orb/ Starlike/ Changed direction and stoped on a dime.. On april 12 2012, my younger brother and I were outside our home when my brother told me hurry look up!!  I looked up and right above our heads about maybe a mile up a bright glowing starlike white orb was moving slowly from west (canada) to east direction.... by the time i pulled out my camera phone it was now more so infront of us rather then above like it was when we first spoted it.. I first took a picture then i switched over to video and started filiming.. while filming i kept losing sight of it and then we couldnt see it anymore..  However when i went into the house i watched the video on my computer... while watching i see the orb of white light go out..  then two seconds later it appears to the left of the screen.. i watched it over and over and started to mess with the video settings.. anyway i figured out that when i turn the brightness up a little bit and the contrast you can actual see the orb switch direction and shot from south to north then sto! p on a dime.. It then moves a little back east and vanishes... I have the adjusted video and picture...",
      "link": "http://www.nuforc.org/webreports/088/S88424.html",
      "state": "NY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bddb5",
      "summary": "I saw a bright light off in the sky, no airplains were around",
      "city": "buffalo",
      "shape": "light",
      "date": "2012-11-19T00:00:00",
      "story": "i saw a bright light off in the sky, no airplains were around i was walking from school to the bus stop at the amtrak bus station in downtown buffalo and off in the north eastern sky i saw a star like object, it looked like a light from a  plane with the light directly towards you, i kept walking a few more steps and decided to second guess what i saw and absolutely nothing was in sight in the sky, i kept on looking in the skies until the bus came and saw nothing",
      "link": "http://www.nuforc.org/webreports/094/S94412.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdfc4",
      "summary": "Orange fireball in the sky going from East to West.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Orange fireball in the sky going from East to West. An orange flickering fireball was seen in the southern sky.  It was travelling from east to west for about 1 minute after which it seemed to disappear into a cloudbank. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91266.html",
      "state": "NY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be1be",
      "summary": "Bright orange orb moving swiftly",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Bright orange orb moving swiftly Sunday night, 7/29, at around 10pm I saw a definite UFO.  Was BRIGHT orange (I mean very very orange), yet very distant.  Easily 10x brighter than Venus.  It seemed distant, but was moving VERY fast in what seemed to be a straight line.  Probably moved across about 90 degrees of sky in about 1-2 minutes.   This is about 10 miles south of Buffalo, NY.  It was moving from southwest to northeast.   The sky was clear, starry, yet in the direction the thing was moving I had seen very strong lightning minutes earlier, possibly heat lightning.   The flashes illuminated the sky/clouds in that direction.  I checked weather radar and did see a small thunderstorm cell in that area.   I know for a fact it was not a passenger jet or helicopter.   I found it incredibly unusual and immediately told my girlfriend about it.   We went back out and watched for a while but saw nothing else unusual.",
      "link": "http://www.nuforc.org/webreports/091/S91370.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be27a",
      "summary": "Bright orange dots in sky NE of Buffalo NY",
      "city": "buffalo",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "Bright orange dots in sky NE of Buffalo NY While getting out of a backyard pool at about 10:40 PM, we saw a very bright orange dot over the house, up maybe 25 degrees from the eastern horizon.   When we backed further away from the house, we saw two more.  The area where they seemed to be is NE of the Buffalo airport, but we're used to seeing aircraft all the time, and this was really unusual.  It was too late for the setting sun to have illuminated anything.  The dots faded one at a time, while appearing to move slightly.  They weren't close enough to each other to be connected.  The observers were four sober adults in their sixties who don't believe in UFOs.",
      "link": "http://www.nuforc.org/webreports/091/S91885.html",
      "state": "NY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be45d",
      "summary": "Unidentified flying object or anomaly caught on HD video appears to be diamond shaped with light.",
      "city": "buffalo",
      "shape": "diamond",
      "date": "2012-06-14T00:00:00",
      "story": "Unidentified flying object or anomaly caught on HD video appears to be diamond shaped with light. While waiting for my child's soccer practice to end, I was shooting with a new HD CAM to get practice for a forthcoming project.  I was shooting some leaves in a tree and other things in the park. When I returned home and viewed the footage on my computer, I saw an anomaly.  Did not think much of it at the time.  I got more experience with the edit suite and came across the footage again recently and decided to slow it down and zoom it in.  The anomaly seems to have shape of a diamond and possibly a light in the middle.  Would like to have it analyzed, though. Please see video on youtube:  http://www.youtube.com/watch?v=akrtHZXBz_w&feature=channel&list=UL   OR...  Download original MXF files and view the footage in your high end edit software. (Shot at 24 fps on a Canon XF 300 pro-sumer video camera)   To open the shared files, click or copy the link below: https://backup.filesanywhere.com/fs/v.aspx?v=8c6a678e60646fb19e69",
      "link": "http://www.nuforc.org/webreports/089/S89556.html",
      "state": "NY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be5e3",
      "summary": "Reddish glow over Buffalo, TX",
      "city": "buffalo",
      "shape": "flash",
      "date": "2012-03-13T00:00:00",
      "story": "Reddish glow over Buffalo, TX I was outside walking my dogs and looked up into the sky to the north of Centerville, TX, and saw a bright redish orange glow that was big and bright at first and dimmed out like a massive fire in the sky that just withered out.   It was very high in the sky and isolated!  Kind of like an aurora borealis glow! ((NUFORC Note:  Possible display of the aurora borealis??  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87224.html",
      "state": "TX",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3be6bb",
      "summary": "Slow moving red, glowing spheres in the sky, hover, get smaller then disappear one after the other",
      "city": "buffalo",
      "shape": "sphere",
      "date": "2012-04-18T00:00:00",
      "story": "Slow moving red, glowing spheres in the sky, hover, get smaller then disappear one after the other My husband called me outside around 8:00 pm, and showed me two glowing red spheres in the sky, one ahead of the other, moving very slowly, almost hovering.  First one moved up into the atmosphere, got smaller then vanished.  The second one stayed hovering, then moved off and up in the same direction as the first, gradually becoming smaller, and vanished in the same spot as the first one.  Never saw anything like it, too slow to be an airplane/helicopter.  They made no noise at all.",
      "link": "http://www.nuforc.org/webreports/088/S88032.html",
      "state": "NY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be954",
      "summary": "Witnessed triangular shaped craft using clouds possibly as a cloaking device in the Ozarks.",
      "city": "buffalo",
      "shape": "triangle",
      "date": "2012-05-29T00:00:00",
      "story": "Witnessed triangular shaped craft using clouds possibly as a cloaking device in the Ozarks. Early this morning I was on my way to work in Buffalo Missouri, a construction job, headed south from Springfield, MO.  The sun had already come up. I could see the horizon of Buffalo and noticed a very dark, odd looking, little rain cloud hovering low above the city, directly above the shortest of the cities three water towers and as high as the tallest.  The cloud was as wide as the town, which has a population of a little over 3,000 people.  It had been storming during the night but this strange cloud was the only one left.   Suddenly I watched as at least two (possibly a third on the far side) gigantic triangular shaped craft emerged from the north side (toward me) but pointing west.  The front one was about twice as big as the rear object. Both were the biggest aircraft i've ever seen, including a few stealth bombers.  They were black in color however the rear one never fully emerged and I never got a clear view of the bottom.  However I could tell that they we! re both pulsating a light from their centers.  The cloud seemed to cloak them both and the light strobed in the color of the very dark, almost black cloud, back to nothing, to dark cloud.  The light emitted looked like a tractor beam from a movie for a better visual reference.  The two crafts seemed to actually be one craft possibly as they were connected in the middle by what looked like piping.  Both seemed and covered in athe haze.  The cloud acted in the most unnatural way, wrapping around the craft as if it was pulling it back in, or the craft was pulling the cloud around it.   I honestly didn't believe what i was seeing and looked down.  When I looked up it was still there, so I pulled over to find my phone that was in the back to try to take a video.  When I finally found it the entire slow moving cloud, not just the craft,  was gone.  I only saw it for at most 45 seconds, the entire incident only lasting 2 minutes. And thats the end of it. I will be emailing an illustration a! nd a map within the next day or so.   Thank you. ((NUFORC Note:  We spoke by telephone with the witness, and he sounded to us to be quite sober-minded.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89270.html",
      "state": "MO",
      "duration": "35-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beda1",
      "summary": "Loud noise heard in sky.",
      "city": "buffalo",
      "shape": "",
      "date": "2013-08-30T00:00:00",
      "story": "loud noise heard in sky I did not actually see any UFOs.  I did hear an incredable roar in the sky.  It sounded like a sonic boom or an explosion.  I thought it was an earthquake. The hum phonomenon aka \"bristol or taos hum\" has also occured in our area lately. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100601.html",
      "state": "NY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bee14",
      "summary": "Balls of fire.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "balls of fire Me and girlfriend was on top porch smoking a cigarette. and we look in the sky. and I noticed a fireball.  and me and my girlfriend seen the one on July 4th too. it was the same things seem to my 4th but smaller 6 of them.  I'm on me was looking at the top of the porch I scene fireballs in the sky.  they were behind each other about 3 miles apart from each other. the fireballs were fly and then they went out.  my girlfriend said to me she think the portals in Went through ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100683.html",
      "state": "NY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf03c",
      "summary": "Massive Flat Black triangle  with 3 red lights.",
      "city": "buffalo",
      "shape": "triangle",
      "date": "2013-09-30T00:00:00",
      "story": "Massive Flat Black triangle  with 3 red lights. Ok I was driving home around 01:50 on 90 west about 68 miles from PA after the lost of the Bills game.  When I was driving listening to HLN on my Sirius radio.  When a diamond shape object went over my car or at least the wing of the craft did.  It looked like it was flying around 60-70 miles gliding. It had 3 big red lights and the body of the craft was that flat black.  If they didn't have them 3 lights on the front and one on each side of the craft I wouldn't have even known that it was just over me.   Now I thought it was maybe a Stealth but the thing that amazed me is that it was gliding so slow for such a massive, craft and that it made no noise when it was over me when it passed.  I'm just pissed at myself for not stopping and trying to get a pic.",
      "link": "http://www.nuforc.org/webreports/102/S102294.html",
      "state": "NY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6d0",
      "summary": "Bright orange fireballs seen on 4th of July in Buffalo N.Y.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2013-07-14T00:00:00",
      "story": "Bright orange fireballs seen on 4th of July in Buffalo N.Y. We were watching the fireworks, and at about 9:30 p.m., I heard the neighbor across the street say to his daughter, \"What the hell is that?\"  He was very excited; so I looked up and seen an orange fireball object traveling South to North at a steady pace and then it would just fade away.   Altogether within about an hour, I seen 3 of them, all above us, but not next to each other.  The pictures I took did not come out good, it just looks like a light in the sky, it didn't even pick up the orange color.   This is the very first time that I seen something, and I was very excited...I already was a believer.",
      "link": "http://www.nuforc.org/webreports/099/S99852.html",
      "state": "NY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c0140",
      "summary": "I saw a yellow-orange, spherical glowing light in the early evening sky, moving horizontally at first and then changing direction.",
      "city": "buffalo",
      "shape": "unknown",
      "date": "2013-07-22T00:00:00",
      "story": "I saw a yellow-orange, spherical glowing light in the early evening sky, moving horizontally at first and then changing direction Tonight around 9:30 p.m. Eastern Time, I was observing the moon which was in the southern sky.  Then I happened to notice a glowing light in the eastern sky, approx. 20 degrees up from the horizon.  The sky was dark and rather hazy from clouds and I did not see a craft; it was just the light that I saw.  I did not hear any sound.  The light was spherical or oval shaped, yellow-orange in color, and it moved horizontally at first (from south to north).   Next, it changed direction - appearing to go up and down slightly, and it shifted toward the south a bit.  Finally it appeared to move toward the north and east, and the glowing began to fade (became seemingly smaller) to what looked like a tiny dot, possibly orange or red.  eventually the light disappeared from my view.   The total elapsed time of my viewing was approximately 20-30 seconds. This was the first time I have ever seen such a thing.  The light didn't seem to be coming from an airplane, nor from a helicopter.  I am a male in my early fifties.   My daughter, age 6, was with me and asked me if it was an \"alien spaceship.\"",
      "link": "http://www.nuforc.org/webreports/100/S100304.html",
      "state": "NY",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0308",
      "summary": "Round craft with orange lights seen in Buffalo, New York",
      "city": "buffalo",
      "shape": "disk",
      "date": "2013-07-05T00:00:00",
      "story": "Round craft with orange lights seen in Buffalo, New York I was compelled to go to my window and look up into the sky, when I saw a round object with orange lights around its rim sought of flashing but not always.  It was moving in a southwest to northeast direction. no sound.  Then a second object with same description maybe 1000 meters behind the first object. There was I think 6 orange lights, no sound and moving in a determined direction. not floating.  The height was same as a small plane flying. The size of object was about 100 feet round. The center of the object was dark.",
      "link": "http://www.nuforc.org/webreports/099/S99657.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0452",
      "summary": "Tiny flying dot doing loops in the air and flashing colors.",
      "city": "buffalo",
      "shape": "flash",
      "date": "2012-12-20T00:00:00",
      "story": "Tiny flying dot doing loops in the air and flashing colors. Saw a tiny dot in the sky doing loops and changing color.  It was flashing from golden to red to green to golden again.   It was a tiny dot and it looked extremely far away from us.  It flashed around for about 5 minutes, and then vanished.",
      "link": "http://www.nuforc.org/webreports/094/S94994.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0537",
      "summary": "4 flame colored lights moving east to west",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2013-02-28T00:00:00",
      "story": "4 flame colored lights moving east to west I was walking my dog when I noticed a bright flame colored ball moving faster than a typical plane.  It was also flying much lower. As I moved to the front of my house I saw 3 more of the same thing.   No noise, no trail all moving east to west, and they were so bright that you couldn't make out a shape.  There is an air force base at niagara falls, which could explain what the objects were, however, there is a post from Rochester, NY, dated 2/16 which describes the exact same thing I saw.",
      "link": "http://www.nuforc.org/webreports/096/S96402.html",
      "state": "NY",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0db6",
      "summary": "((NUFORC Note:  Source of report provides no information.  PD))",
      "city": "buffalo",
      "shape": "cylinder",
      "date": "2014-01-16T00:00:00",
      "story": "((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Source of report provides no information.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106307.html",
      "state": "MN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c143f",
      "summary": "Re-occurring for last month hovering light with 30 min duration, descends below mnt horizon .  ((NUFORC Note:  Venus??  PD))",
      "city": "buffalo",
      "shape": "light",
      "date": "2013-12-12T00:00:00",
      "story": "reoccurring for last month hovering light with 30 min duration, descends below mnt horizon but we can still see its glow over mnt For the last month or so we have seen a bright light over the mountain, South West of Buffalo.  It lasts up to an hour, same time of night but not every night. We have video of it and it is about three finger widths above mountain horizon, then within fifteen min either disappears or goes down until it is below mountain's horizon.  However we can still see the \"glow\" of its light coming from the horizon.  There are four witnesses to this. myself, husband, and our two daughters. It can be seen for miles and I believe it to be within our atmosphere, it does move, too fast to be a star or satellite, but also stays in the same place for the majority of its appearance. It dims and come back as well as descends.  It has no flashing lights nor other common aircraft lights. It is too far away to see exactly the lighting but we do see changing colors, blue, green, with white most steady; white/yellow headlight-like intensity.",
      "link": "http://www.nuforc.org/webreports/105/S105208.html",
      "state": "WY",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b61",
      "summary": "I saw 2 unknown flying objects on sequential nights.  The one the night before was cigar shaped like a blimp.",
      "city": "buffalo",
      "shape": "circle",
      "date": "2014-07-26T00:00:00",
      "story": "I saw 2 unknown flying objects one the night before and the night of.  The one the night before was cigar shaped, like a blimp with orange and white lights and the next day saw something about the size of a basketball going straight orange with a red light in it I got to videotape both sightings but my phone has poor quality but up close these were both equally amazing objects that made no sound and whizzed straight by and no one blinked twice except me I guess.    I've attached the videos as well.",
      "link": "http://www.nuforc.org/webreports/111/S111785.html",
      "state": "NY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1df9",
      "summary": "4 or 5 moving objects appeared on fire then disappeared. move like an airplane.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2014-06-24T00:00:00",
      "story": "4 or 5 moving objects appeared on fire then disappeared.  Move like an airplane. The first one, I thought maybe it was an airplane on fire.  It was moving.  Then it disappeared.   Then 3 or 4 more appeared, looked like they were on fire and one at a the time the disappeared.   They were moving at the pace of an airplane.   The 3 or 4 were close to each other.Got a few images on cell ph.",
      "link": "http://www.nuforc.org/webreports/110/S110475.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c295c",
      "summary": "Slow-moving diamond-shaped object slowly traverses Southern Buffalo NY sky and winks out.",
      "city": "buffalo",
      "shape": "diamond",
      "date": "2014-10-03T00:00:00",
      "story": "Slow-moving diamond-shaped object slowly traverses Southern Buffalo NY sky and winks out. Live North of Buffalo, went outside for a cigarette, looking South. Saw object moving slowly East to West.  Lost it in the trees and it did not reappear in the proper amount of time had its speed been steady.  Continued at slower rate of speed once it reappeared and then stopped (hovering?) for 2+ minutes.  Lights dimmed and winked out in roughly 2-3 seconds. Object appeared as 5 lights; in orientation to me they were top/bottom/left/right/center making a diamond shape. Lights were white with an orange-ish tint.  Orientation did not change as it moved. No aura, no trail, no haze. Sky was completely clear, light pollution was typical but negligible.  Took a picture with cellphone camera but it's garbage.",
      "link": "http://www.nuforc.org/webreports/114/S114022.html",
      "state": "NY",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c64",
      "summary": "Black \"thing.\"",
      "city": "buffalo",
      "shape": "other",
      "date": "2014-09-10T00:00:00",
      "story": "Black \"thing.\" I was walking with my 3 kids to bus stop waiting for bus decided to take some pics of my kids I turned camera on phone to selfie cam trying to get right spot for keep and my daughter to fit for a pic I look in camera I see dark black spot like a ball over my head in pic I turn around I couldn't see anything I show my daughter she saw exact same thing going bigger then smaller like a dialating eye I snapped a pic quick turned phone to front cam it was still therethe gone nothing it didn't fly away it disappeared I walked home with shaking hands I'm a sceptic but I can't explain that no matter how hard I try if I zoom on pic u can see what look like heat waves around it even stranger I have a new phone and when I tried to video it would kick me out of the camera",
      "link": "http://www.nuforc.org/webreports/113/S113296.html",
      "state": "NY",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3014",
      "summary": "Fireballs appear twice in sky then disappear.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2014-08-22T00:00:00",
      "story": "Fireballs appear twice in sky then disappear. A bit after 9:00 p.m., I went outside.  It was dark out, the sun had set, and the only light came from the houses of neighbors.   I sat out there for a while and noticed an orange light in the sky.  After a few seconds, I immediately knew this wasn't any normal craft, as it moved around in a way that would be impossible for an airplane or a helicopter.  I watched it as it moved through the sky, relative to me, it moved two or three inches.   Soon enough it began to blink, and then disappeared in the sky.   I came back outside about half an hour later, and after watching the same spot in the sky, saw it again. It followed a course very similar to the one before, moving in all the same directions, and then disappearing again.",
      "link": "http://www.nuforc.org/webreports/112/S112670.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c37f5",
      "summary": "Hovering bright white light surrounded by pulsating green and red lights.",
      "city": "buffalo",
      "shape": "unknown",
      "date": "2015-01-26T00:00:00",
      "story": "Hovering bright white light surrounded by pulsating green and red lights Seen from 4th floor of Tri Main Center Buffalo, NY.   Looking west I saw the \"Lake Erie Lights\"  From about 21:30 to 22:00 hours.  There were two sets of lights.  Each individual set was a bright white light centered within (two?) red and green lights.  The red and green lights were pulsating like emergency vehicle lights.  They were not blinking lights.  There were not aircraft.  They hovered or slightly drifted for about 15-30 mins.   The one set of lights moved gradually to one side of my vision and then disappeared.  I don't think it moved into cloud cover.  There was very little cloud cover if any last night.   I did not have a camera.  The reports of these lights is that they repeat on numerous nights in a row.",
      "link": "http://www.nuforc.org/webreports/116/S116899.html",
      "state": "NY",
      "duration": "15-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a27",
      "summary": "It was around 12:10 AM when I saw this bright light like red Moving a little faster. It wasn't a plane because it didn't flash like a l",
      "city": "buffalo",
      "shape": "light",
      "date": "2015-05-08T00:00:00",
      "story": "It was around 12:10 AM, when I saw this bright light like red Moving a little faster.  It wasn't a plane because it didn't flash like a light bulb.  My location was buffalo N.Y.",
      "link": "http://www.nuforc.org/webreports/118/S118850.html",
      "state": "NY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d52",
      "summary": "Egg-shaped orb.  Red/orange on top and bottom w/green lights in the middle. Steady, then moved, then shot up and away.",
      "city": "buffalo",
      "shape": "egg",
      "date": "2015-07-10T00:00:00",
      "story": "Egg-shaped orb.  Red/orange on top and bottom w/green lights in the middle.  Steady, then moved, then shot up and away. There were several people (friends and family) outside at several stages of inhibriation remaining from the 4th of July fireworks that ended 1/2hr prior.  The sky was overcast with some bright stars and, I believe, the constellation Sagitarius visible directly above.  I'm not sure of exactly which one, whatever, but I then looked NW along the ridge line, we live along the Kanawha River Valley, and saw the UFO. It was a bright red and orange egg-shaped object, no more than 2-5mi away, in a stationary position and that is when I went for my iPhone 5s and started to record video after all were in agreement that it was what I was seeing.  In the video you will hear a female voice describe its movement, but it remained in a still position for a few minutes and then headed along the ridge line toward us.  As it came closer I was able to notice the lights in the middle and they were a greenish color, the lights were extremely bright so it was hard to be certain of the middle color, but from there it appeared as if the top and bottom were disjointed leaving me to believe that it was also \"wobbling\" as it was in motion. After the motion it once again stopped for a few moments and I got a straight on look at it once again. It was now in a steady position as if it were \"checkin us out,\" and from there it headed straight upwards.  Now to explain the \"vanishing\" is kind of hard to detail due to it being night and also being unaware of the specific cloud cover, but I can only give two theories as to what I saw from there.  Regardless of clouds the lights were so bright that it would have been hard for the clouds to hide so much of it so easily right away.   What I saw is it looked like it dissipated as if it went through a \"worm-hole\" kind of like Einstein explained in his Theory of Relativity and the 4th plane or dimension.   I'm not a UFO enthusiast and I'm not college educated, but I am a Navy veteran and was taught attention to detail, so that is the basis for the recollection…",
      "link": "http://www.nuforc.org/webreports/120/S120250.html",
      "state": "WV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c445a",
      "summary": "The were 6 round objs. flying in triangular formation and the dist. between each one started to change, but the speed of the fligh",
      "city": "buffalo",
      "shape": "formation",
      "date": "2015-11-19T00:00:00",
      "story": "the were 6 round objects flying in triangular formation and the distance between each one started to change, but the speed of the flight did not. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123904.html",
      "state": "NY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4549",
      "summary": "Disk shaped, four lights, humming noise.",
      "city": "buffalo",
      "shape": "disk",
      "date": "2015-10-29T00:00:00",
      "story": "Disk shaped, four lights, humming noise. One UFO spotted, had four circle shaped lights, two red and two green, shape not very clear due to clouds, appeared to be a disk.  Flew diagonally at about the speed of an airplane, seemed to be tilting or rotating.  Was making a humming noise, hard to describe, sort of like a mechanical howl.  Couldn't see color, I would assume black, but it was dark, so color might have just not been visible. ((NUFORC Note:  We suspect that the original date is flawed, and that the witness intended a date of October 18, not September 18.  Witness elects to remain totally anonymous, and provides no contact information, so we are unable to contact him/her, in order to confirm the date.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122946.html",
      "state": "NY",
      "duration": "~4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c49a2",
      "summary": "4 YELLOWISH/ORANGE TRIANGULAR SHAPE OBJECTS IN THE BUFFALO, NY, EAST SIDE SKIES.",
      "city": "buffalo",
      "shape": "triangle",
      "date": "2015-10-29T00:00:00",
      "story": "4 YELLOWISH/ORANGE TRIANGULAR SHAPE OBJECTS IN THE BUFFALO, NY, EAST SIDE SKIES. THE DESCRIPTION OF THE OBJECT(S) WHERE TRIANGULAR SHAPE WITH BRIGHT ORANGE BLINKING LIGHTS.  THEY CAME FROM THE NORTH AND MOVED SLOWLY ACROSS THE SKY TO THE SOUTH, MAKING A 90 DEGREE TURN TO THE WEST, AND THE FOURTH ONE CAME OUT OF NOWHERE WITH BRIGHT ORANGE LITE, NOT FLASHING, AND I SEEN TWO JETS CHASING THEM AWAY, AND THEN THEY DISAPPEARED.  FOUR OBJECTS WHERE OBSERVED.  THE BACKGROUND WAS NOTHING BUT THE SKY. ((NUFORC Note:  We spoke via telephone with the witness, and he sounded to us to be quite sane and sober-minded.  We suspect that he is a very good witness.  We have amended the time above, believing that the sighting occurred at 8:00 p.m..  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123192.html",
      "state": "NY",
      "duration": "1:43"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b7d",
      "summary": "UFO sighted in Buffalo, New York.",
      "city": "buffalo",
      "shape": "other",
      "date": "2015-08-27T00:00:00",
      "story": "UFO sighted in Buffalo, New York I went to my car to get a box and I decided to look up into the sky because the Perseid meteor shower was going on.   To my surprise in the horizon I saw a craft with two blinking lights white to green flashing.  It was lower than a normal jet airplane would be and the rate of travel was quite fast.   The color was clear and blended in with the night sky I could literally see through the craft the outline of the craft was shaped like a piece of toast.  It's the best way that I can describe it.   No sounds it just came over the horizon, flew above me, and went over top of the tree and house next door to me in less than a minute.",
      "link": "http://www.nuforc.org/webreports/121/S121304.html",
      "state": "NY",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b58",
      "summary": "Very bright reddish orange color diamond shaped object.",
      "city": "buffalo",
      "shape": "diamond",
      "date": "2015-10-02T00:00:00",
      "story": "Very bright reddish orange color diamond shaped object. At approximately 23:15 my wife called me out to our screened porch and pointed south. Upon looking at the direction she was pointing to, I/we seen what appeared to be  a diamond shaped object about 3-4 thousand feet in the air traveling from northeast direction to the south west direction.   The object appeared to be emitting reddish orange color and traveling without any sound. It was traveling about the same speed as an aircraft would be approaching a runway several miles away (we have an airport about 5 miles away.)  As the object then faded  from our view and then disappeared,  An identical object came in from the northeast direction and travelled the same route with the same end results.   In closing, it was apparent that both objects remained at the same height throughout our viewing",
      "link": "http://www.nuforc.org/webreports/122/S122442.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d56",
      "summary": "Black cloud hovering close to ground disappears in front of my eyes",
      "city": "buffalo",
      "shape": "other",
      "date": "2015-09-11T00:00:00",
      "story": "Black cloud hovering close to ground disappears in front of my eyes Today is a beautiful day, the sky is a bright blue color, and the clouds are all white.   I was driving on the thruway next to Lake Erie and I noticed a small black cloud hovering maybe 200 feet above the thruway over the water.  The cloud was easy to differentiate because it was so close to the ground.   I slowed down and started watching it.  I was wearing tan-colored lens sunglasses, and when I took them off, I could hardly notice the black cloud.  When I put them back on, the cloud was very visible.   I watched it for about 15-20 seconds, and right before my eyes, it disappeared! I have never seen anything like it before.",
      "link": "http://www.nuforc.org/webreports/121/S121843.html",
      "state": "NY",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5878",
      "summary": "The sighting my mother and I saw was at approximately 10:00 pm at night, 10 miles before hitting our town Buffalo, MO.",
      "city": "buffalo",
      "shape": "light",
      "date": "2016-06-10T00:00:00",
      "story": "The sighting my mother and I saw was at approximately 10:00 pm at night, 10 miles before hitting our town Buffalo, MO. We were on our way home from work and we were on the highway and came up over the hill and we saw this glowing light, so I immediately started recording on my phone.  The shape is unclear but the light eventually went into three lights then back to one, and then joy disappeared for a split second, then repeated itself once or twice again and then just disappeared for good.   It was located by a cellphone or some kind of tower with its red lights to warn pilots.  So I thought it was weird something in the sky seemed to be so close to it and not moving exactly.   The color of the lights were white, kinda relish tint and yellow tint color to it as seen in the video.   This happened within a 3-5 minute period and that's about it.",
      "link": "http://www.nuforc.org/webreports/127/S127779.html",
      "state": "MO",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c59c8",
      "summary": "FLUORESENT GREEN SHAPED LIKE A ACTUAL CIGAR IN SIZE NO NOISE 6 FEET AWAY",
      "city": "buffalo",
      "shape": "cigar",
      "date": "",
      "story": "FLUORESENT GREEN SHAPED LIKE A ACTUAL CIGAR IN SIZE NO NOISE 6 FEET AWAY. I RAN FROM MY BEDROOM AT ONE END OF THE HOUSE DOWN THE HALLWAY AND TRIPPED OVER OUR CAT,  DURING A THUNDERSTORM I ALWAYS WENT TO MY PARENTS ROOM AND WENT BACK TO BED.  WHEN I TRIPPED ON THE CAT I PROCEEDED TO MY PARENTS BED AND GOT IN THE MIDDLE.  MY PARENTS ROOMS DOOR WAS LOCATED RIGHT NEXT TO MY SISTER'S ROOMS DOOR WHERE THE CAT LAID RIGHT IN FRONT OF BOTH DOORS.MY SISTER'S ROOM WAS A BRIGHT GREEN COLOR AND MY CAT WAS WATCHING THE CIGAR SHAPED UFO COME FROM MY SISTERS ROOM 3 FEET ABOVE THE CAT AND TURNED TOWARDS THE HALLWAY AND WENT DOWN THE HALLWAY, NO MORE THEN 6 FEET AWAY WITHOUT A SOUND.MY HAIR STANDS ON END AND THE BACK OF MY NECK TINGLES EVERY TIME I THINK OF IT",
      "link": "http://www.nuforc.org/webreports/127/S127143.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6101",
      "summary": "My wife and I saw a reddish-yellow, pulsing light in the night sky.",
      "city": "buffalo",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "My wife and I saw a reddish-yellow, pulsing light in the night sky. The night was clear and the sun had set approximately two hours before I observed a reddish-yellow, silent, pulsing and stationary light, high in the night sky and an indeterminate distance away.  At first I thought I was observing a plane or helicopter, but quickly decided that was not the case.   After one minute or so I called my wife to see what she made of the light.  She saw the light described it as \"odd\" and was frightened by it, and after watching it briefly ran to get binoculars.  I observed the light for approximately 30 seconds with binoculars but could not make out any shape, although it was definitely pulsing (red to yellow).   It then disappeared from the same place I first noticed it.  Total time of observation was about three minutes.",
      "link": "http://www.nuforc.org/webreports/130/S130181.html",
      "state": "NY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61f8",
      "summary": "Cargo fleet through Buffalo, NY, 14204 near Canadian border.",
      "city": "buffalo",
      "shape": "",
      "date": "2016-09-30T00:00:00",
      "story": "Cargo Fleet Through Buffalo New York, USA, 14204 near Canadian border We were outside and we looked up in the sky.  We saw what appeared to look at a very bright star moving across the sky.  We kept watching it for a few minutes in and it beyond the clouds.  We then saw a few more less bright \"moving stars\" following behind.   I pointed them out to my friend because he didn't think the first one was a craft saying stars move.  I explained that they don't move like that.  '' About a minute later, we saw another six crafts in a different formation.  I commented that they are really moving under the cover of the clouds in our area.  When I scanned the sky again I saw two crafts in front of the original very bright craft that initially caught my attention.  I have seen many crafts moving in the sky, but never this many - this close together.  My friend said they were likely planes.  I explained planes do not fly that high.  Possible that they could be drones operated remotely, but I do not think this many in these particular formations or! at these speeds.  Possible that it could be satellites but again not in these formations moving at these speeds or this many at one time.  The crafts were moving from North Easterly to South Westerly direction.  I never have reported sightings in the past and wasn't going to report this one.  A quick search online showed a few articles indicating that a \"cargo fleet\" was moving through our inner solar system.   I was very fortunate to view this from Buffalo, N.Y. 14240, USA under a partly cloudy sky with a dark backdrop beyond the sky.  I just wish I had 1 - a scope & 2 - another enthusiast to witness this event!   Note:  The shapes of the crafts were not identifiable from the distance and I was viewing with my naked eye. ((NUFORC Note:  We have added the time, date, and location of the sighting, based on a telephone conversation with the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130250.html",
      "state": "NY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c62da",
      "summary": "I was driving down I-25 about 20 miles south of Buffalo.  I witnessed a 5 ft black, tulip shape craft hovering about 30 ft off the grou",
      "city": "buffalo",
      "shape": "rectangle",
      "date": "2016-09-09T00:00:00",
      "story": "I was driving down I-25 about 20 miles south of Buffalo.  I witnessed a 5 ft black, tulip shape craft hovering about 30 ft off the ground.  This area is very desolate and at first I thought it was some kind of drone but if it was it would be used for movies as it was very intricate.  I kept driving because it didn't seem possible but I can't stop thinking about it.  This was definitely some kind of craft either the highest tech military craft we have or alien.  It was too small to have a human pilot. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129670.html",
      "state": "WY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b61",
      "summary": "Loud thunder sounding noise green Object went by",
      "city": "buffalo",
      "shape": "light",
      "date": "2017-02-03T00:00:00",
      "story": "Loud thunder sounding noise green object went by",
      "link": "http://www.nuforc.org/webreports/132/S132424.html",
      "state": "NY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f75",
      "summary": "My wife and I was laying in bed and watching the stars in the bighorn mountains at our cabin. All the sudden from the southwest of the",
      "city": "buffalo",
      "shape": "circle",
      "date": "2017-08-04T00:00:00",
      "story": "My wife and I was laying in bed and watching the stars in the Bighorn Mountains at our cabin.  All the sudden from the southwest of the sky a large white circle was traveling northeast fairly quickly.  We went outside and watched it from our porch.   Within about a minute, the object passed through the sky from one end to the other.  It was strange.  White circle like the moon close up in our atmoshpere.  It had no sound at all and was flickering a little bit.   Then, about 5 mine later after it disappeared.  A commercial jet flew over from north headed south with its two lights and very clear jet engine sound.  We definitely never seen anything like the white circle.  It was unique.",
      "link": "http://www.nuforc.org/webreports/135/S135462.html",
      "state": "WY",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7013",
      "summary": "I was sitting on my deck and look up at stars.  My 2 friends and I saw them at first and thought it was a plane. ((anonymous report))",
      "city": "buffalo",
      "shape": "flash",
      "date": "2017-08-24T00:00:00",
      "story": "I was sitting on my deck and look up at stars.   My 2 friends and I saw them at first and thought it was a plane, but then we see the lights flashing slowly and extremely bright.  Then we saw another.   It would randomly move location after a few flashes maybe 20 seconds apart. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135873.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c70ea",
      "summary": "Bright, oval shape flew silently through lower branches of trees after dark, west-east direction.",
      "city": "buffalo",
      "shape": "oval",
      "date": "2017-08-04T00:00:00",
      "story": "Bright, oval shape flew silently through lower branches of trees after dark, west-east direction. Buffalo, NY    7/31/17  Sometime between 9-11 pm, while sitting in my backyard, I saw a low flying oval shape for a split second, flying through lower branches of trees in my yard, moving in a west easterly direction.  I believe it was bright green in the front and bright white in the back, about the size of a football and completely silent.  I have never seen anything like this in my life. Background of observer:  62 year old woman, Masters Degree in Psychology.  Worked for State of NY for 31 years. ((NUFORC Note:  We spoke via telephone with the witness, and she seemed to us to be both quite sincere, and sober-minded.  She reports that the object was back-dropped by the nearby trees, and not just against the nighttime sky.  Hence, she was able to deduce that the object was fairly close to her position.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135477.html",
      "state": "NY",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c70e3",
      "summary": "Two objects discharged from glowing craft.",
      "city": "buffalo",
      "shape": "light",
      "date": "2017-07-27T00:00:00",
      "story": "Two objects discharged from glowing craft. Sitting on front porch with roommate around 00:30, noticed a object incredibly high in the sky moving much faster than any craft I've seen moving west.  On course, the object dishcharged two objects that became bright and dimmed out, as if they were shooting into space.   Once the objects discharged, the original object changed course to NE, stalled out, became increasingly bright and dimmed as if it was moving deeper into space. Minutes later, another object was seen moving incredibly fast in a NW direction.  Object made a couple sharp zig zag maneuvers, changed direction to North and became increasingly bright to only dim out like the previous objects.",
      "link": "http://www.nuforc.org/webreports/135/S135317.html",
      "state": "NY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c70c3",
      "summary": "At ~1:52 AM, my cousin and I were sitting on the patio and saw an extremely large and  brilliantly lit teardrop shape green light.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2017-08-04T00:00:00",
      "story": "At approximately 1:52 AM, my cousin and I were sitting on the patio and saw an extremely large and  brilliantly lit teardrop shape, fluorescent green, light blazing across the sky, from east to west.  There wasn't any sound coming from it, nor were there any flashing lights.",
      "link": "http://www.nuforc.org/webreports/135/S135450.html",
      "state": "NY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c70f6",
      "summary": "3 orange-ish to reddish dots.  We were facing abound and seen 3 lights that staid lit for roughly 8 mins. ((anonymous report))",
      "city": "buffalo",
      "shape": "changing",
      "date": "2017-07-14T00:00:00",
      "story": "3 Orangeish to redish dots.  We were facing abound and seen 3 lights that staid lit for roughly 8 mins.  One light to the left.  One light to the right and one light lower of the right light.   The lower right light slowly merged into the upper right light, then the left light disappeared, then the lower right light separated slowly then those two disappeared as well. Myself, one retired fire fighter, and one person with a Master's degree.  ((initials deleted))... in unexplainable. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135070.html",
      "state": "NY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7425",
      "summary": "Extremely large bright teardrop shape fluorescent green light flew across the sky horizontally, with a bright white flash of light.",
      "city": "buffalo",
      "shape": "fireball",
      "date": "2017-06-02T00:00:00",
      "story": "Extremely large bright teardrop shape fluorescent green light flew across the sky horizontally, with a bright white flash of light. I went outside and looked up at the sky.  All of a sudden an extremely large bright elongated teardrop shape fluorescent  to dark jade green light flew across the sky horizontally.  It was moving so fast, it was a matter of seconds and I couldn't see it anymore as it made its way from the western sky to the eastern sky.  It seemed like it was flying low. It was far below the stars or the path of a plane.  There was a very bright white flash of light behind it.  There wasn't any noise.  No other visible objects or colors were seen.",
      "link": "http://www.nuforc.org/webreports/134/S134339.html",
      "state": "NY",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7688",
      "summary": "Witnessed whitish \"tic tac\" shaped craft hovering above tree tops for approximately 5 minutes.  Made no noise at all.",
      "city": "buffalo",
      "shape": "cigar",
      "date": "2018-01-12T00:00:00",
      "story": "Witnessed whitish \"tic tac\" shaped craft hovering above tree tops for approximately 5 minutes.  Made no noise at all.  witnessed whitish \"tic tac\" shaped craft hovering above tree tops for approximately 5 minutes.  made no noise at all.  Then changed color to bluish glow, rotated and accelerated up and to the south at incredible speed.  Literally disappeared in about 2 seconds.  Several sonic booms were heard as it left.  Neighbors' dogs were barking.  Our pet cat was visibly upset.",
      "link": "http://www.nuforc.org/webreports/138/S138079.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c773a",
      "summary": "Everyone saw this thing, including The Buffalo Police.  ((anonymous report))",
      "city": "buffalo",
      "shape": "cigar",
      "date": "2017-11-03T00:00:00",
      "story": "Everyone saw this thing, including The Buffalo Police I remember this like it was yesterday. My parents had taken us for ice cream followed by a trip to the waterfront to get a breeze off the lake.  It was something we did quite a bit in the summer because of the hot humid Buffalo summers and we didn't have AC then . Well, as we were driving in Our station wagon , all 8 of us . While on Tifft St. headed towards the lake, my mother and father pointed out something strange in the sky.  It was shape like a cigar and had multiple colors revolving on it.  It was silent and slowly moving in an odd diagnol manner, side to side, up and down . Thing was very bright and hovered as well from time to time.  It scared to hell out of everyone in the car.  I remember how loud and frantic us kids got. It was there for what it felt like was forever.  People were pulled over and out of their cars watching.  There were Buffalo Policemen doing the same.  People came out of local businesses and their homes to watch this thing.  It was a mass sighting!  Then in an instant it went left then it went right on an upward angle a it was gone in an instant.  People in the neighborhood talked about this for years.  Nothing ever came about it.  It was just one of those things that happened in our neighbor hood.   My brother and I talk about it occasionally and we were discussing it at work one day and another guy overheard us and he said remembers seeing it too.  This was at least 20 + yrs later.  We consider ourselves extremely lucky for witnessing this UFO. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136952.html",
      "state": "NY",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c881b",
      "summary": "I didn't see any light in the sky while taking the photos, the light anomaly was visible after the photo was taken.",
      "city": "buffalo",
      "shape": "disk",
      "date": "2018-07-05T00:00:00",
      "story": "I didn't see any light in the sky while taking the photos, the light anomaly was visible after the photo was taken. I took a series of photos from my bedroom window down buffalo, NY, because the sky was beautiful.  4 photos were taken one after the other with my android phone at 9:13 pm, June 19th, 2018. On June 29, I looked for the photos I'd taken as reference for a painting using the colors of the sky, that's when I saw the unusual light anomaly in the sky.  There was no light behind me, I did not notice anything in the sky when I took the photo. ((NUFORC Note:  One photo shows an image of a small source of light, backed by an evening sky.  We do not know what the light is, but do not have enough information, we believe, to be able to conclude that it is an authentic alien spacecraft.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142052.html",
      "state": "NY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c885a",
      "summary": "UFO hoovering over watching fireworks then takes off.",
      "city": "buffalo",
      "shape": "disk",
      "date": "2018-07-05T00:00:00",
      "story": "UFO hoovering over watching fireworks then takes off me and my friends was watching fireworks and a red beam appeared in the sky im like bra look, it was just sitting there hoovering then it changed to green lights but it was 5 points like a pentagon each point was green then there was a green point flashing directly in the middle of it, then it changed back to red all in the same spot but this time it was just two dots next to each other two red dots my friend was watching aswell, then in the end of the video it takes off flashing green it looked like a disk but when i seen the five dots then just two lol i didnt know no wtf was going on",
      "link": "http://www.nuforc.org/webreports/142/S142075.html",
      "state": "NY",
      "duration": "8 minutes and 44 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8939",
      "summary": "Glowing sphere at a distance.",
      "city": "buffalo",
      "shape": "light",
      "date": "2019-09-06T00:00:00",
      "story": "Glowing sphere at a distance At approx. 9:15pm, I was hanging out in Niagara Square with my girlfriend and observed a possible helicopter over the lake.  Once noticing no FAA flashing lights, we continued to observe the glowing sphere go out of view behind a building.  We waited approx. 30 sec for the object to be viewable again, it was now either further away or far less bright.  It was observable for an additional 20 or so seconds, flickered and then disappeared. (originally reported to mufon)",
      "link": "http://www.nuforc.org/webreports/148/S148504.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c920b",
      "summary": "Glowing Green Orb and Vapor Trail of it's path",
      "city": "buffalo",
      "shape": "other",
      "date": "2019-12-01T00:00:00",
      "story": "Glowing Green Orb and Vapor Trail of it's path Was standing in my back yard looking in the sky, saw a vapor trail rising up from the ground, pointed it out a friend ans we both watched it for a minute or two as it continued to  gain altitude.  At that point i decided to take a picture, during the time i was getting my phone ready to take a picture, the UFO had done a 180 degree loop and cut across it's vertical vapor trail and continued in an eastward direction...  Afterwards when I looked at the photo you could very clearly see the object as a glowing Green orb.",
      "link": "http://www.nuforc.org/webreports/149/S149868.html",
      "state": "NY",
      "duration": "3-4 minutes"
    }
  ]
}