{
  "city": "chandler",
  "fetch_timestamp": "2025-07-12T14:35:34.329508",
  "record_count": 95,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b42d7",
      "summary": "Response to orange balls of light seen: I've seen them since 2004",
      "city": "chandler",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "Response to orange balls of light seen: I've seen them since 2004 I have seen these orange balls of  lights over the valley south of my location, that of which being Scottsdale. I am guessing that they were located over Chandler or the Queen Creek area. I have always viewed them at around 9:00 at night around 5 times since February of 2004. The last time I saw them was September of 2005.  My father used to be a pilot for many years and he too is unsure of what they are. He knows  that they are not flares since they stay at the same elevation for the entire 20min or so that they are in the sky and no smoke. When they disappear they simply blink out. I usually see a minimum of 2 lights parallel to one another, but I have seen 3 before.  I had never intentionally looked for these lights, each instance I just so happened to see them. I wish we knew what they were, but who knows if we will ever find out. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49612.html",
      "state": "AZ",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b42eb",
      "summary": "big light moving fast",
      "city": "chandler",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "big light moving fast three big lights moving very fast",
      "link": "http://www.nuforc.org/webreports/049/S49830.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5677",
      "summary": "Glowing orange sphere spotted hovering and performing angular flying at various speeds.",
      "city": "chandler",
      "shape": "sphere",
      "date": "2008-06-12T00:00:00",
      "story": "Glowing orange sphere spotted hovering and performing angular flying at various speeds. On 04/15/2008 I was leaving work at approximately 11:15 P.M. from a restaurant I work at in Chandler Arizona.  As I was waiting outside for my wife to pick me up I noticed a spherical orange glowing ball in the south sky at roughly a 40-degree angle from my position. The sphere appeared to be at an altitude of about 5,000 feet. The object was hovering and appeared to be wavy like the surface was hot. The look was similar to magma and distorted like the surface of hot asphalt.  The object did not have what looked like conventional lights on it, but rather the whole object seemed to give off an orange fluorescence. After the object hovered for about 4-5 seconds approximately 2 miles to the south, it bolted off directly north, passing overhead and stopping about a half mile north of my location.  Again the sphere halted to an immediate stop and hovered.  When directly overhead the object appeared to be about the size of a house (1,500 square feet) the object at this point was at about a 120-degree angle.  The object traveled that distance in about 2 seconds.  The object then sped off at a 90-degree angle and immediately stopped again.  The object would not slow down and come to a stop, but rather come to an instant stop.  While accelerating the object would maintain a constant velocity and achieve its maximum speed at the instant of its movement from a stop.  After hovering in its location, the object bolted off to the N-NW in an upward 45-degree angle, disappearing from sight in less than a second. The object while in motion about 5,000 feet high was traveling a speed of approximately 4,000 to 5,000 MPH.  When the object sped off into the sky the final time, its speed was at least 4 times faster then its previous speeds.  The whole sighting lasted about 10-17 seconds.",
      "link": "http://www.nuforc.org/webreports/062/S62616.html",
      "state": "AZ",
      "duration": "10-17 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6223",
      "summary": "Traveling west on I-8, when my friends and I noticed bright lights behind us. When we looked behind us we realized it was a UFO",
      "city": "chandler",
      "shape": "circle",
      "date": "2007-04-27T00:00:00",
      "story": "Traveling west on I-8, when my friends and I noticed bright lights behind us. When we looked behind us we realized it was a UFO My friends and i were on our way back to base, traveling down I-8. About 5 minutes after we passed though Chandler, we notice some extreamly bright lights behind us. At first we thought that it was another vechile pulling on to the hghway, until we looked behind us. Our intensions were to tell the driver to turn off his brights but then we realized that wasn't a car. We watched the item hoover behind us for a few moments then shoot off towards the south and disappear. We know this can't an aircraft from our panet becuase it was so low to the ground (no higher than 10 feet) but we felt no rumbling of the truck, and heard no air craft noises like that off a plane. Also when it flew off it flew much faster than any aircraft I'd ever seen-and I see them everyday being in the military. This was undoubtingly a UFO.",
      "link": "http://www.nuforc.org/webreports/055/S55916.html",
      "state": "AZ",
      "duration": "<8"
    },
    {
      "_id": "64d005f478aba2ec5a3b6541",
      "summary": "Pulsating triangular shaped object flying low, fast and silent over South Eastern Phoenix",
      "city": "chandler",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "Pulsating triangular shaped object flying low, fast and silent over South Eastern Phoenix Object was first observed flying very low from east to west from the Santan Mountain range from the Gila Indian Reservation. The Object was tiangular in shape and was pulsating red. At first I believed it was a low flying aircraft. Then object changed colors four times. First it was red than green, than white, and back to red.When I say it changed colors I mean the whole object changed colors to include the lights.  The object was completely silent.Then lights were larger than the street lights in front of my residence.I am retired Military and Law Enforcement and very familiar with Military and Law Enforcement Aircraft and I have never seen any aircraft or weather balloon change color in the manner this object did. It was traveling very fast from East to West than switched direction and flew North towards Mesa and The Superstition Mountains.I realize there are many airports in the area but this object was silent,changed colors,direction,and moved at a high rate of speed. ((NUFORC Note:  Second report from same source.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52173.html",
      "state": "AZ",
      "duration": "1min 30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b67e0",
      "summary": "Silver Metalic object with strong pulsating light.",
      "city": "chandler",
      "shape": "flash",
      "date": "2007-10-08T00:00:00",
      "story": "Silver Metalic object with strong pulsating light. Appeared in Northern sky. Silver, Metalic looking with strong pulsating strobe light near it's top. I watched it for about 20 minutes as it drifted to the East.  It was shaped (looking through binoculars) like the letter \"F\" or \"E\" with star like qualities. Strobing actions continued throughout it's drifting East",
      "link": "http://www.nuforc.org/webreports/058/S58690.html",
      "state": "AZ",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3b69c9",
      "summary": "A shiny metallic sphere noticed for less then 2 minutes before it suddenly vanished.",
      "city": "chandler",
      "shape": "sphere",
      "date": "2008-03-31T00:00:00",
      "story": "A shiny metallic sphere noticed for less then 2 minutes before it suddenly vanished. From the corner of Gilbert & Baseline Rd. looking in a west direction toward South Mountain I spotted a shiny round metallic object. I was going to pass it off for a plane but there was a plane in the same direction that had a chem trail coming from it. Why didn't this object have a chem trail? Adding further to the mystery it vanished without a trace. around 5:00 pm AZ    My girlfriend was a witness.  Same direction of numerous UFO sightings. fits the same area and description of a UFO scene by a close friend. ((NUFORC Note:  Date is flawed.",
      "link": "http://www.nuforc.org/webreports/062/S62133.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b70c8",
      "summary": "Triangular object with 3 lights hovered and disappaered",
      "city": "chandler",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "Triangular object with 3 lights hovered and disappaered At approx. 8:10 PST on 3-24-08  I witnessed a large triangular object to the south east. The object had no sound. The object had bright white lights at each end of it. It moved slowly and hovered for about 30-45 seconds, it then suddenly disappeared.",
      "link": "http://www.nuforc.org/webreports/062/S62339.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b71e0",
      "summary": "ufo?? good reason to believe so.",
      "city": "chandler",
      "shape": "chevron",
      "date": "2006-10-30T00:00:00",
      "story": "ufo?? good reason to believe so. straight above me i happened to look up as  either an L shaped or chevron shaped object was floating in a southwest direction. there was either very dim reddish lights or no lights on it at all. there was no sound emitted from the object as well. it was hard to tell how high up it was but it was not that far. me and a buddy witnessed this as it either floated or flew in a straight line in the southwest direction. it continued until we could not make it out any longer.",
      "link": "http://www.nuforc.org/webreports/052/S52604.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7295",
      "summary": "Hard to see with the moving of the camera, but the object seemed to be moving at a slow speed. Has a dark spot in the middle.",
      "city": "chandler",
      "shape": "circle",
      "date": "2007-10-08T00:00:00",
      "story": "Hard to see with the moving of the camera, but the object seemed to be moving at a slow speed. Has a dark spot in the middle. The sighting was recorded onto a video camera and uploaded to Video Sharing Site \"YouTube.com\". The full video is available here: http://youtube.com/watch?v=YGeNIR6ELDQ  The username used to submit the video is not my real name and is an online alias.",
      "link": "http://www.nuforc.org/webreports/059/S59008.html",
      "state": "AZ",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b753a",
      "summary": "pulsating UFO sighted in Arizona, USA.",
      "city": "chandler",
      "shape": "circle",
      "date": "2007-06-12T00:00:00",
      "story": "pulsating UFO sighted in Arizona, USA. BACKGROUND INFORMATION ON OBSERVER:  I have been, for quite some time, extremely interested in the contents of our universe.  Of course, aliens being one of these things.  Ever since young age, these potential entities have perplexed my mind.  There were points in my life where I was almost literally addicted to the investigation of these phenomena.  ACCOUNT:  I witnessed, for the first time, a UFO at approximately 4:00 AM on the date of May 24, 2007 in the city of Chandler, Arizona.  Not being able to sleep, I decided to do some stargazing in the front of my home.  The object, which first appeared to resemble a star, moved at a steady rate.  The pulsating of light (which appeared to be spontaneous), was one of my determining factors that this was some form of advanced technology.  The UFO seemed to move at an almost constant rate of speed toward the southern hemisphere.  Then, in abrupt fashion, the object disappeared.  Almost immediately after I lost track of the UFO, a helicopter passed by overhead.  Do these two have any correlation to each other?  I’m not sure, but I think it is definitely worth mentioning.",
      "link": "http://www.nuforc.org/webreports/056/S56794.html",
      "state": "AZ",
      "duration": "approx.  5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b76d6",
      "summary": "Colorful, flashing spheres in the Chandler, AZ night skies on 10/05/07.  ((NUFORC Note:  Sighting of Sirius??  PD))",
      "city": "chandler",
      "shape": "sphere",
      "date": "2007-10-08T00:00:00",
      "story": "((NUFORC Note:  Sighting of Sirius??  PD)) Colorful, flashing spheres in the Chandler, AZ night skies on 10/05/07 My sister has been observing what she called an object or colorful orb in the SE Chandler, AZ night sky for weeks now.  Each night she observed this through binoculars & the object appeared like flashing red, blue, green & white lights & even honeycomb shapes appeared on this object. On various nights this object could be seen in the NE & S Chandler, AZ sky. Tonight, Friday, Oct. 5th, 2007 at approx. 9:15 pm we saw the object from my house in Chandler in the due north sky. This object is definitely not a star as we’ve never seen or heard of stars being colorful or that move. Our planet doesn’t rotate that quickly. We observed this object with both binoculars & a telescope. We noticed the object was moving rather slowly but on a due east course tonight. The colors were absolutely brilliant & something none of us have ever seen before. Not only was it colorful & sphere-shaped but it seemed to rotate, spin, & turn sideways. It also would move just enough for us to lose sight of it from our telescope without us moving the tripod. We wanted to know what this thing was, so we came in to look up anything we could find on the internet that might relate to this object being seen by others & we found nothing.  At 12:15 am we went back out to see just how much further this object had moved, when we were amazed by the fact that not only had this object moved further east, but there were two additional objects exactly the same as the one we’d been following all night in a perfect triangular formation. They were not there prior to the earlier observation! We observed all three of them & all were exactly the same. One might say that they were hovering, but you could see them move slightly & yet all remained in perfect triangular formation. We really got a little freaked out, besides being cold & we came back in again. So this was going on for over 3 hours & then some! They are still out there very visible even now.  Has anyone else seen anything like this before, or know what is going on in our skies?    Inquiring sisters want to know Chandler, AZ",
      "link": "http://www.nuforc.org/webreports/059/S59114.html",
      "state": "AZ",
      "duration": "3+ hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b7846",
      "summary": "driving north on I-10 south of Chandler, AZ saw  shiney, silver object in north/ northwestern sky for 5 - 7 secs",
      "city": "chandler",
      "shape": "rectangle",
      "date": "2006-12-07T00:00:00",
      "story": "driving north on I-10 south of Chandler, AZ saw  shiney, silver object in north/ northwestern sky for 5 - 7 secs driving north on I-10 in south of chandler. looking north/northwest thru the mountains saw a shiney silver oblong shaped object in the sky just above mountain tops. had earlier sighting at 10:30 AM of same shaped object and it disappeared, so i watch this one closely. after about 7 secs it disappeared. i thought damn 2 in 1 day.",
      "link": "http://www.nuforc.org/webreports/053/S53443.html",
      "state": "AZ",
      "duration": "5 - 7 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b7938",
      "summary": "4 sliver round objects moving East to West at High Altitude",
      "city": "chandler",
      "shape": "circle",
      "date": "2007-02-24T00:00:00",
      "story": "4 sliver round objects moving East to West at High Altitude 4 silver circular objects moving in loose and random formation. Objects would change position relative to one another as they moved across sky.   Appeared to be at extreme high altitude.  Moved in an East to West direction at a relative slow speed but hard to be sure since altitude of objects was unknown.  Weather CAVU.  Note: date of sighting was Super bowl Sunday.",
      "link": "http://www.nuforc.org/webreports/055/S55329.html",
      "state": "AZ",
      "duration": "5 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a3c",
      "summary": "Lights similar to the Phoenix Lights sighted in SW Chandler, AZ.  ((NUFORC Note:  Possibly flares over Gila Bend Firing Range.  PD))",
      "city": "chandler",
      "shape": "triangle",
      "date": "2007-02-24T00:00:00",
      "story": "Lights similar to the Phoenix Lights were sighted in SW Chandler, Arizona south of what is the Gila River Memorial Airfield While on my way to Safeway Shopping Center  South on Alma School about 100 feet south of Ocotillo Road in SW Chandler I looked up to the right over a fence and saw 4 Lights in a Triangular pattern and another to the center rear.  It appeared as though the object was dipping in the forward direction because the light in the rear was somewhat higher.   All the lights were the same color as I has seen on the reported Phoenix Sighting several years ago.    I turned right on Lake Street (west) at the next intersection.   The lights were still there but the rear light was no longer visible.  I sat in my car and watched the lights for a couple of minutes.  They appeared to be dropping to the right, and my visibility was being blocked by trees.   I turned around and went back to Alma School Rd And turned south and went to the next road by the Safeway Shopping center,  just north of Chandler Heights Rd.  The lights were more visible again for about a minute and then it lowered out of my line of sight.   So I went into the shopping center lot went into the store to purchase a few things.   The lights were gone when I left the store at approximately 20:15.   At that time there were the lights of several planes in the area where I saw the object. ((NUFORC Note:  Because of both the location, and nature, of the bright objects, we strongly suspect that the bright objects may have been aerial flares, launched from aircraft over the Barry M. Goldwater Firing Range, located near Gila Bend, AZ.  That is what official military sources apparently reported, shortly after the event had occurred, and we have no reason to doubt that claim.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55173.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b80fd",
      "summary": "dot light in sky north northeast of chandler, az, it did not move, clouds passed it by",
      "city": "chandler",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "dot light in sky north northeast of chandler, az, it did not move, clouds passed it by facing north looking northeast about 35 to 40 degrees northeast, single pindot light in the sky, did not move, clouds passed by it, cloud covering it now makes light appear orange.  it is now dark out now and light still appears",
      "link": "http://www.nuforc.org/webreports/072/S72240.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b84d2",
      "summary": "Diamond Shaped Black Object Hovering In Chandler Field",
      "city": "chandler",
      "shape": "diamond",
      "date": "2009-03-19T00:00:00",
      "story": "Diamond Shaped Black Object Hovering In Chandler Field My brother confided this story to me a month after his observation. I believe 100% his story and observation as he is a very credible and responsible person. My brother who works for my company overseeing my night operations of my business got off work at 3AM. He lives in Maricopa so he travels from Phoenix to his home driving I-10. At around 4AM while traveling eastbound on I-10 as he approached the queen creek exit in Chandler he observed a dark diamond shaped object to his left rise up from a field about 100 feet and it then headed in a easterly direction towards casa grande. My brother said he was driving about 75-80 MPH and there were a few other cars on the road. He said the object made a few moves that made him think this was not a known civilian or military aircraft. It had 3-4 lights similar to navigation lights and it moved faster then his vehicle. He guessed it speed to be around 100-125MPH. He turned off his exit to queen creek/Highway 347 and proceeded on to the Town of Maricopa where he lives. He did not see the aircraft anymore once he left the Interstate freeway. I have lived here since 1996 after getting out of the military. I was in aircrat maintenance for F-14's and have been exposed to many types of military aircraft. What he described and its movements and speed along with no typical aircraft sounds associated with a jet engine aircraft or any normal chopping sounds of a helicopter type aircraft I conclude what he saw was either extremely new military technology not yet known to the general public or it was a UFO. I know there have been many unexplained events and sightings in the Phoenix area since I have lived here. Bottom line, I believe my brother saw exactly what he described as described. In my opinion, there has been to many sightings by too many people of various types of aircraft doing maneuvers that are just not known to be capable of modern aircfraft both military and civilian. Our current aircraft designs and more specifically, their power plants do not a! llow for this. Even a Harrier jet can not stop on a dime and hover, and when it is hovering, it is very loud because of the nozzel thrust it produces in the downward position. His sighting was a very silent aircraft leading me to believe it utilizes a high energy magnetic type power plant propulsion system and the earths natural magnetisym. Opposite type polarity propulsion system that have been engineered to allow for quite flight, speed, and maneuverability such as the new high speed trains technolog that use magnetics and ride on a cushion of air exist today, just not known to exist on aircraft at this time.",
      "link": "http://www.nuforc.org/webreports/069/S69108.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b852a",
      "summary": "Bright Lights in vertical formation with top craft moving as another came up from below to get in formation.",
      "city": "chandler",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "Bright Lights in vertical formation with top craft moving as another came up from below to get in formation. On August 12, 2008 approximately 8PM in Chandler, AZ  I walked out front to smoke a cigarette when I noticed 2 bright lights on the West horizon in a vertical line just hovering. I chalked it up at first just to be 2 planes coming this way in some sort of flight pattern creating an optical illusion. However, my husband walked out to smoke a cigarette and said \"Come here and look at this\". Just over the tree lines where I had seen the 2, were now 4 bright lights all in a vertical formation. I tried to logically evaluate what I was seeing but logic soon flew out the window.  As we watched these very bright lights, which were much larger than what you see on jets, the top one in formation dimmed the bright light and red and blue lights began flashing on it as it began to pull away from the vertical line moving in a Northeast direction. The craft that was moving was very low to the ground, lower than I see any jets in this area fly and the sound was different than jets. It made a noise but there was no \"rumble\" if that makes sense like a jet makes, it was rather quiet no more noisy than perhaps a car makes. The lights undernderneath and behind it were unfamiliar to us as well. As we kept watching, we then realized that this was a pattern that kept taking place. As the top one would begin to pull away from formation, another would \"appear\" to come up from beneath and get in this vertical line. We watched this trying to reason what was going on but it just wasn't making sense to us. If it had been planes in a flight pattern, logic would reason that the lights would be of different size and radiance if they were lined up behind each other. These lights looked like huge bright balls of light. My husband and I when we first saw them giggled and said \"Oh no, someone else is playing a hoax with flares and balloons\", however, as the top one moved away, we clearly saw the craft and it's flight pattern. Whatever they were, whoever they were, they were definitely craft. I lost count after watching 6 of these follow this pattern. \"That's 6\" I said to my husband, and then just quit counting at that point.  I began getting very nervous as we kept watching this take place as it appeared they began lining up in a perimeter around an area. I could see them on the horizon from the back yard, clearly to the north, clearly to the east and cleary to the west, the trees were blocking my southern view. However, as they followed this flight pattern, they appeared to be randomly stopping out on the horizon, not moving at all. Just hovering. Some we could follow moving following a rather large circle pattern on the perimeter. The red and blue lights flashing on them looked different than jets and some seemed to only have a steady red glow.This has to be one of the most bizarre things I've seen.  Within a few minutes of watching this, 3 helicopters appeared in the area and there was 1 helicopter that actually kept a distance from the line of lights, but was flying what appeared to be from an \"observing distance\".  This went on for approximately an hour with these things all over the sky. I kept thinking, someone else surely has to see this. We came in to turn on the news around 9Pm thinking that what might be happening would definitely make the news, we watched all the way through the 10PM news, but no mention. I began checking here last night to see if anyone else had reported anything, but soon realized this isn't kept in real time, so thought I'd check back this morning and there'd be a plethora of reports, so far nothing. This truly rattled me last night, I had knots in my stomach because what we were seeing was so bizarre. This went on for over an hour. There was not a single jet in the sky during this, just the balls of light and crafts and a few helicopters.  If anyone else has seen this, or has an explanation as to what was going on, please post it here.My husband and I walk out front and sit on our porch nearly every evening and have never witnessed anything like this in the past. We'll definitely be watching again this evening.",
      "link": "http://www.nuforc.org/webreports/065/S65200.html",
      "state": "AZ",
      "duration": "1 hour +"
    },
    {
      "_id": "64d005f478aba2ec5a3b879b",
      "summary": "a ball of light wth incredible speed",
      "city": "chandler",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "a ball of light wth incredible speed i was driving home with my cousin at 7:33 PM and i saw a flash of light and it suddenly flew away at a really fast speed ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68029.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b97b0",
      "summary": "smoke like cloud appeared then four lights moving diffrent directions fast disappearing in to cloud for about 10 minutes",
      "city": "chandler",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "smoke like cloud appeared then four lights moving diffrent directions fast disappearing in to cloud for about 10 minutes sitting out side fiance in pool looking up when a cloud out of no where appeared about 4:30 pm then these four lights moving indiffrent directions going in and out of the small smokey looking cloud one by one disapearing the last one spirailed don then disappearred the cloud disappeared as well i took pictures with cell phone but the lights did not show up this is strange",
      "link": "http://www.nuforc.org/webreports/075/S75437.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba193",
      "summary": "Huge amber lights, intermittant, zooming and stationary, South of Chandler, AZ - 2200 & 2203 hours; 11MAY2010.",
      "city": "chandler",
      "shape": "formation",
      "date": "2010-05-12T00:00:00",
      "story": "Huge amber lights, intermittant, zooming and stationary, South of Chandler, AZ - 2200 & 2203 hours; 11MAY2010. I am a security guard on patrol in Chandler, AZ (currently). I observed the UFOs first at about 2200, and saw two through trees.  I knew they were far away based on how fast I was moving and how the objects remained still as the trees obscuring my view of them zoomed past me as I drove by them. I saw two first.  They appeared as oval shaped amber lights.  My view of them vanished as houses obscured my view of them. I then proceeded with a patrol for work, then moved to another location. At this location about 8 miles North of the first, I again saw them; about 30 minutes after the first sighting.  This time I saw 8 or more of these large lights. The first illuminated, about 3/4 the size of the full moon in the sky.  Then many more appeared to the left, and in a sort-of strobe like way the lights on the right went out and ones to the left came on.  They also zoomed around (though never moved far) they were not stationary. I pointed it out to some residents in a pool of the community I was at.  Only one of them locked eyes on it and only saw the tail end of it.  I told them to keep their eyes open in that direction. The event occurred South of my position in Chandler, AZ.  It is possible they were South of Queen Creek and Mericopa, two nearby cities.",
      "link": "http://www.nuforc.org/webreports/075/S75383.html",
      "state": "AZ",
      "duration": "30 minutes / intermittant"
    },
    {
      "_id": "64d005f478aba2ec5a3ba398",
      "summary": "2 large oval shaped objects with oscillating illumination in the eastern sky over phoenix,Az",
      "city": "chandler",
      "shape": "oval",
      "date": "2009-08-05T00:00:00",
      "story": "2 large oval shaped objects with oscillating illumination in the eastern sky over phoenix,Az On 07/29/2009 My wife and I were out in our backyard and this particular night we had observed the same object we had been noticing for the last month or so . But this night the two larger of the objects have been very low in the sky and very brightly illuminated. The two objects were changing colors very frequently from red to white to green . They were about 20 to 30,000 feet in altitude.Now at the same time we had noticed 4 other objects that were alot higher than these 2. From my perspective they are very large objects and all of them had remained vertually stationary for the entire duration .",
      "link": "http://www.nuforc.org/webreports/071/S71390.html",
      "state": "AZ",
      "duration": "04:30"
    },
    {
      "_id": "64d005f478aba2ec5a3baf00",
      "summary": "large object sillouted in sunset hovering over estrella mountain.",
      "city": "chandler",
      "shape": "rectangle",
      "date": "2011-01-05T00:00:00",
      "story": "large object sillouted in sunset hovering over estrella mountain. while driving down old price road to work at Intel Corp, I looked west to the sunset and saw an immense object silhouetted by the sunset. I stopped the car and tried to figure out what object was. The object was stationary or headed straight towards me. it was in my best judgement either behind or above the southern end of Estrella mountain. torwards and slightly north the town of Maricopa. The object had no anti collision lights whereas i could see other aircraft in the sky flashing their anti collision lights. It eas immense and I tried to figure out if it was a blimp or maybe a hot air ballon that was actually closer than I though it was. I stopped the car and tried to take pictures with my Nikon S3000 however it was very difficult to get the settings right in the failing light.  I watched the object hover until I had to report to work (about 15 min).",
      "link": "http://www.nuforc.org/webreports/079/S79090.html",
      "state": "AZ",
      "duration": "10 min +"
    },
    {
      "_id": "64d005f478aba2ec5a3bb494",
      "summary": "Orbs West of Casa Grande, AZ",
      "city": "chandler",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Orbs West of Casa Grande, AZ Traveling from Chandler towards Casa Grande, AZ on I-10 East. Approx 9:30pm.  Observed bright object while fueling vehicle at Wild horse pass.   Clear night with a crescent moon.  Object was clearly not an aircraft.  Continued to periodically watch object while driving.   At a point I lost sight of object.  At one point I saw the 2 orbs in a formation and they appeared to make a sweeping turn, somewhat closer to my position, and then fade out... Periodically the objects appeared to fade in an out.   Size was relative to a streetlamp at about 300 meters.  Object was bright amber in color.  At one point when I viewed the object it appeared to split into 2 objects and then fade out.   Continued traveling past rest stop when object was viewable again.  Lost object behind mountains and when I was up to the 387 exit, I was clearly able to see the objects again, now there were 2.  Clear and bright.  I wish the cellphone I had could take pictures of the night sky.   Objects were very bright.  Mostly stationary.  I stopped for a few moments to look.   Proceeded to the Casa Grande Municipal airport to see if anyone would know what these objects were but the terminal was closed.  Formation of objects had changed, before being horizontal, now they were stacked vertically.  I tried to get the attention of a DPS vehicle to no avail.  Objects are very bright but I am unable to judge the distance.  Proceeded back home.  I want to ask if these objects have any correlation to the Gila Bend bombing range as I do not know.",
      "link": "http://www.nuforc.org/webreports/078/S78840.html",
      "state": "AZ",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb68b",
      "summary": "Lights in the sky that look like stars or satelites, but do not move accordingly per the laws of physics.",
      "city": "chandler",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Lights in the sky that look like stars or satelites, but do not move accordingly per the laws of physics. First off, I am not under the influence of drugs or alcohol; and I am a rational person.  I was standing in my drive way outside my house in Chandler, Arizona haveing a cigarette and watching the stars. I then noticed one \"star\" moving across the sky and I thought to myslef, \"Its just a satellite.\" but as it was moving I notice three more following behind the one I originally saw in a vertical column behind it, at the same speed. I then thought, \"  Just more satellites...\"; but then they stopped completely and looked just like stars again.  If you call the starting point from the first \"star\" started moving as 0 degrees, and directly behind me as 180 degrees, they moved aproximetly 35 degrees to the west over the course of about two minutes.  After that two minutes, they remained still for about another eight to ten minutes before I went inside. It is entirely possible that this can be explained with rationality, but I have never seen this before in my 23 years ! of existence, nor have I ever heared of this happening before. I should also mention that I am a college student that is a Science/Engineering major, and know that this doesn't normally happen.  Unfortunately, I did not have a camera or video camera that can effectively record light sources such as stars in the night sky.",
      "link": "http://www.nuforc.org/webreports/078/S78985.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc131",
      "summary": "Bright Red Light in Sky in Southeast Phoenix Area",
      "city": "chandler",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Bright Red Light in Sky in Southeast Phoenix Area I live in the Northwest Chandler area, near Phoenix, and while leaving my apartment heading to our local store I noticed a bright red light in the eastern sky. I asked my girlfriend, \"What is that?\"  We both stared at the red light for about 15-20 seconds trying to make sense of what we are seeing. I glanced back at my girlfriend to question the sighting as possibly a helicopter when it moved slowly east for 2-4 seconds.  It slightly flickered as if it was pulsing and disappeared into the night sky. The light source was bright red and unnaturally large to be a star or planet.  Since living in the city, the light pollution tends to overpower most stars/planets, this one seemed to dominate the night sky.  I would approximate its distance at 500-700 feet in the air. No audible sound was heard.",
      "link": "http://www.nuforc.org/webreports/083/S83945.html",
      "state": "AZ",
      "duration": "15-30 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc123",
      "summary": "Observed a grey unidentified rectanular object in the sky that paused and then moved quickly.",
      "city": "chandler",
      "shape": "rectangle",
      "date": "2011-12-12T00:00:00",
      "story": "Observed a grey unidentified rectanular object in the sky that paused and then moved quickly. While heading north on Rt. 87 saw rectangular grey object to the far left of the road approximately flying at a height of a blimp.  This object was not a blimp, and had squared corners. Moving from east to west, at a good rate of speed, then stopped, remained at that location about 30 seconds, and then almost disappeared to an area farther west where we again saw it.  I thought it was a blimp, covering a football game until I saw the rectangular shape and asked my wife what that was.  Broad daylight, grey rectangular craft no means of support or propellant.  No windows visible.",
      "link": "http://www.nuforc.org/webreports/085/S85283.html",
      "state": "AZ",
      "duration": "10 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc1cd",
      "summary": "Tear Dropped Shaped Object and Orb Cluster Observed In Arizona",
      "city": "chandler",
      "shape": "teardrop",
      "date": "2011-10-10T00:00:00",
      "story": "Tear Dropped Shaped Object and Orb Cluster Observed In Arizona At approximately 6am I saw an object between east and southeast of my position.  The sun had come up over the horizon and the sky was lit up with no clouds in that area of the sky.  Initially I thought the object looked too bright, to big, and oddly shaped to be any standard object found in the sky.  There were no other visible objects in the morning sky.  The object was approximately 30-40 arc-degrees above the horizon. I grabbed a pair of binoculars to inspect further.  Using the binoculars I saw a tear dropped shaped object that was approximately 10-20 times the size of a planet when viewed through the same binoculars.  The tear drop was orientated with the largest part of the shape towards the zenith and the narrowest point of the shape towards the horizon.  The shape wasn’t a perfect tear drop.  Along right hand side from the mid-point to the bottom there was a slight inward notch on the form. The object was a solid luminescent bluish white color with no interior features and fairly bright, possibly as bright as Venus maybe brighter.  Along the upper right edge of the shape the color was a little different being a very vibrant violet-blue in color, almost like light coming from a prism. I watched the object for approximately 40 minutes in this state.  During that time it appeared to move a short distance through the sky as if it was in a fixed position (i.e. Earth’s rotation was moving it through the sky). I wanted to rule out any planets being in the area so I went into the house to look up sky charts.  After looking at the star charts and ruling out the possibility of any planets being in that position I returned outside.  This was approximately 6:40am.  At that time the tear drop shaped object was gone and there were two other objects in that area.  My assumption is that the tear drop shaped object broke apart into these objects, but without seeing the transition I can’t say with certainty. The two new objects were approximately 3-4.5 arc-degrees apart from each other.  One was slightly below and to the left of the other.  The upper most object appeared to be a reddish orange object that changed shapes during the time that I observed.  It was approximately 1/5th the size of the original tear drop shaped object.  It brightness was significantly less than that of the tear dropped shaped object.  It kept changing shapes at one point it looked like Saturn with a ring around it, then it changed to a circle, then to half circle.  After that it appeared to rotate between circle, half circle, and an oval shaped object. The second object appeared to be a cluster of small individual white orbs.  The orbs within the cluster moved around in a chaotic fashion.  Every once in a while an orb would shoot up towards the zenith from the cluster.  It would travel for about 10 seconds or so in a slow, straight, trajectory before it faded out.  I studied the orb cluster for several minutes watching this same activity repeat itself until the cluster could no longer be seen. I then switched back to the reddish orange object.  I observed it for several more minutes.  It continued to cycle shapes, circular, oval, half circle, before I couldn’t see it anymore.  The event lasted till approximately 6:55am. I have spent some time studying the daytime and nighttime sky, as an amateur astronomer.  My daytime profession is that of an engineer.",
      "link": "http://www.nuforc.org/webreports/084/S84018.html",
      "state": "AZ",
      "duration": "~1hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bc453",
      "summary": "Large bright \"star\" moving slowly then changing directions and making jumpy movements.",
      "city": "chandler",
      "shape": "changing",
      "date": "2011-12-12T00:00:00",
      "story": "Large bright \"star\" moving slowly then changing directions and making jumpy movements. The sky was very clear, no clouds.  Stars were very visible because there are not that many city lights in our area.  This \"star\" seemed to stand out, so I started to watch it.  I noticed it was moving, but very slowly.  It was heading west.  There were no flashing lights like that of an aircraft, and it wasn't twinkling like a star.  It just appeared as a very bright star.  I noticed it stop, then change direction and head south.  The ufo stopped again, and started making jumpy movements.  It would quickly move in a small circle, then go through a series of zig zags.  After watching for approximately an hour, it would repeatedly travel north and south while making it's jumpy movements.  We noticed the shape of the light coming off the object would change like it was rotating or something.  It would get very bright and round, then change to a long shape, and finally go back to it's original dimmer shine.  We have never noticed anything like this before.  Our! thoughts at first was the ISS, but the movement of the ufo are not that of the space station.  It did not continue in a slow straight line as if it were in orbit. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85562.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bd42c",
      "summary": "8 red-orange lights flying in formation near the 202 in South Chandler, Arizona",
      "city": "chandler",
      "shape": "formation",
      "date": "2012-09-24T00:00:00",
      "story": "8 red-orange lights flying in formation near the 202 in South Chandler, Arizona I was driving south on the 101 in Chandler, Arizona, right where the 101 becomes the 202 Santan Freeway, eastbound. I noticed two round lights (similar to the size of a car’s standard headlight from 100 feet away, viewed at night).  These two lights were due south of the highway’s bend.  I then saw that there were 6 more of these lights, all making a constellation-like formation, including these two in the middle (Total of 8 lights).  The lights were reddish-orange, with their inner light source, being a type of energy that seemed fluid-like within (molten might fit as a better description).  They were moving west at approximately 40mph to 45mph.  The lights were approximately 300 or so feet from the ground and looked fairly close.  While I was observing them, they did not drop nor travel any higher than their constant altitude.  They appeared to be between the 202 and Germann Rd. area.   I took the off ramp at Alma School Rd. and headed south to Germann Rd. where I then headed west for two miles, to see where they had gone.  All the lights were gone, except for one.  The light that was l! eft was now much higher and heading towards the Sierra Estrella Mountains, where it got slowly dim and disappeared over the course of about one minute.  I viewed this dimming from a parking lot off of Price Rd. and near W. Willis Rd.  I should also add that I had noticed a bright white blinking light (at a rate of once a second for the duration of ~10 seconds or so) that was miles away to the North.  I saw this earlier, when all the lights were still visible.  This white light seemed like an aircraft flashing its lights in the direction of these unknown lights.  This white blinking light seemed to be around the Sky Harbor eastern side flight path, moving west.  This would have been about 10 to 12 miles north of my highway position near the bend.  I have to assume there is a pilot that saw these and was signaling for some reason.  This aircraft did not change its course south.  I believe that aircraft was landing, but for some odd reason was flashing its lights in this direction.  I did not see any other planes flashing their lights in this manner.  I am an Electronics Engineer and an avid skywatcher.  I have also been known to chase storms on occassion. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92345.html",
      "state": "AZ",
      "duration": "~15 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd44c",
      "summary": "Witnessed several orange orbs in the southern skies of greater Phoenix area July 7, 2012.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Witnessed several orange orbs in the southern skies of greater Phoenix area July 7, 2012. I was taking the dog out for the last time last night and happened to look at the southern sky through my eucalyptus trees in my back yard.  I saw 7 or eight orange orbs in the distance all moving west to east at an airplane speed.  The sizes were all the same, about the size of a larger venus to a naked eye.  They were in some sort of formation and remained in this order.  One more came up from the rear to join the others.  I ran back inside and told my very level headed wife to get out here quick, which she did.  We both watched them as they all moved east and then eventually flickered out about mid &quot;east/west&quot;. I can read online that I'm not alone in seeing these orange ones.  I've never heard of this color of &quot;UFO&quot; before and was surprised to discover it's quite common lately. I know there are &quot;worlds without end&quot; that populate our universe as it's nuttier to believe anything else, especially since the Hubble Telescope let u! s take a peek, however, I believe they are all populated with humans just like us.  So I'm thinking these orbs I saw last night are simply man made &quot;somethings&quot;.  End of report.",
      "link": "http://www.nuforc.org/webreports/090/S90667.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be321",
      "summary": "Three fireballs flying close to the ground",
      "city": "chandler",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Three fireballs flying close to the ground Three UFO’s were observed overhead flying close to the ground.  They appeared to be flickering, as if on fire, and were of an orange color and round shape.  They started flying in a straight-line pattern and then moved to a triangular shape.  Objects moved much faster than a plane would move.  There was no sound present during their flight overhead.  The objects were very vibrant and bright.  Observers of the event were an educator, nursing student, financial analyst, hospital chaplain, two retired persons, and a nurse practitioner.",
      "link": "http://www.nuforc.org/webreports/093/S93937.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be302",
      "summary": "Single flashing orb appearing just above the horizon",
      "city": "chandler",
      "shape": "circle",
      "date": "2012-06-20T00:00:00",
      "story": "Single flashing orb appearing just above the horizon I was standing on my front porch looking east one night sometime between January 2012 and May 2012.  I can't remember what time it was, but I know the date was after December 2011, as that's when I got the camcorder used. I noticed a line of horizontal lights close together just above the horizon.  I thought it was aircraft at first. But then a second line of lights rose just above the first line, moved slightly to the left, tilted slightly down to the left, and started shaking up and down.  I ran inside to get my camcorder, but it was gone by the time I got outside.  I dismissed it as an optical illusion and forgot about it. On June 5, 2012, just after 11 pm, I was standing on my front porch looking east when I noticed the same thing again.  I ran inside to get my camcorder, and that's when I remembered that I had seen this same thing before.  When I got outside and started filming, I was able to capture it, though it had apparently turned into a flashing orb hovering in the same location.  It never appeared to move and eventually just faded away.  The whole event lasted maybe 2 minutes.  It all happened in the same spot in the sky.  It was hovering 1/2 mile south of Ray Road and somewhere east of Alma School Road, though it's hard to tell how far away it was.  It was a clear night, the moon was bright and just past full, and was located about 15 degrees to the south and about 5 degrees above the object. Because I had seen this twice, and in the same part of the sky, I set my camcorder on a tripod, turned it on, and placed it on the porch around 11pm.  On June 15, 2012, I captured the object again, and this time from the start.  However, it only appears as the orb and does not first exhibit the line of lights as I had seen before.  Near the end of this second video, some lines are noticeable going into the object from the left and right side near the bottom. This has to be something explainable simply because it keeps appearing at the same time and in the same location.   Nobody else appears to be reporting it, and if I didn't have videos of it, I wouldn't be either. ((NUFORC Note:  Witness states that the date of the sighting, indicated above, is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89725.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be4eb",
      "summary": "Bright green light, Southeast sky over Chandler,AZ",
      "city": "chandler",
      "shape": "flash",
      "date": "2012-08-05T00:00:00",
      "story": "Bright green light, Southeast sky over Chandler,AZ Toward the Southeast sky in Chandler, AZ, I caught a glimpse of a very bright green light ripping across the sky from Northeast to Southeast. In the first second or two it had crossed my field of vision from left to right, and off over the horizon. Following behind were two choppers; the choppers out here fly at angles different than the planes here. They seemed to be pushing pretty fast directly after the bright green light. The light itself shot off across the horizon and vanished within a few seconds, if that. That's all I saw. Observer background: Systems Administrator, IT",
      "link": "http://www.nuforc.org/webreports/091/S91450.html",
      "state": "AZ",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be517",
      "summary": "Orange orbs/ black amoeba object",
      "city": "chandler",
      "shape": "changing",
      "date": "2012-05-13T00:00:00",
      "story": "Orange orbs/ black amoeba object At dusk ther were 2 orbs of orange amber color moving in unison. They were not next to each other, probably a few hundred feet apart.  I was driving so I pulled over to try and see what kind of craft the orbs belong to, but I couldn't tell. I thought possibly they were helicopters, but there was no noise. Definitely not lights from an airplane. I kept eye contact with them until I pulled into my garage. When I walked out of the garage,the lights were gone, but I saw an extremely large black amoeba looking object moving low above the houses a few blocks down. I watched it and it just disappeared within a matter of seconds.",
      "link": "http://www.nuforc.org/webreports/088/S88733.html",
      "state": "AZ",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3be848",
      "summary": "02-25-2012 - 9pm- I-10 to Tucson from Phx. Strange group of pulsating lights-",
      "city": "chandler",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "02-25-2012 - 9pm- I-10 to Tucson from Phx. Strange group of pulsating lights- My boyfriend & were driving to Tucson from Phoenix on Saturday night around 9 pm.  Heading south on the I-10 before the first rest stop my boyfriend asked me what were these 3 lights, in the sky, forming a triangle-  When I looked over (West)I saw 3 bright, very distinct lights in the sky.  I assumed, at first glance, they were stars.  He then said, “those are not stars”, & when I looked again, the lights took off, going south, at a rate of speed I cannot even predict.  Faster then anything I have ever seen in the sky-They were gone.    We continued, driving south on the I-10 when we both saw these unusual, lights that were moving very slow, going north.  When they were directly over us we could see that each object was 2 lights, (I don’t know if they were 2 different objects flying next to each other or 1 object with 2 lights) they did not blink but most definitely pulsed,they were a very bright, bluish light and they were going slower than any aircraft I have eve! r seen.  Two of them flew over, and when we got to the rest stop and got out we noticed the third one, flying north in the same direction as the others, same characteristics, no sound, and then it was gone.  Very strange, (and I saw the Phoenix lights & KNOW they were not flares)  I am not alarmist, this was as weird as the Phx. Lights.  I don’t know. Hope someone else saw them  or can explain them.",
      "link": "http://www.nuforc.org/webreports/087/S87387.html",
      "state": "AZ",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bea92",
      "summary": "I was taking my two children to their mother’s house in Chandler for the weekend. My daughter is 14 my son is 11. It was 10:30 pm and w",
      "city": "chandler",
      "shape": "circle",
      "date": "2012-02-03T00:00:00",
      "story": "I was taking my two children to their mother’s house in Chandler for the weekend.  My daughter is 14 my son is 11.  It was 10:30 pm and we were traveling east on Elliot rd between Dobson and Alma School. Just north of Elliot at roughly 400 feet were three circular orange globes.  Two were at 400 feet one was another 100 feet or so above the two.  I knew immediately it was a technology that officials claim doesn’t exist. We drove back and forth doing several u-turns while I told the kids, \"I told you UFO’s were real.\" If we went more than a block or so from the spot next to the road where they were hovering they looked like stars.  At one point while heading back west on Elliot my daughter said, \"Oh dad they are real close to the ground.  OHHH DAD they’re right there, I’m scared.\" All of the other cars were oblivious and obviously were not seeing the objects.  I would have missed them as well except at the exact moment that we were in the spot where they were visible my son asked me, \"Is it a new moon tonight?\"  So at that moment I looked up and made the initial sighting. On our last pass I had an image of seeing myself from their perspective in my mind and I blurted out, \"It’s a father with his two kids.\"   The moment I said that, the globe that was hovering higher floated up at a 90 degree angle, then instantly shot west at a 45 degree angle, then stopped in a position that made it look like a star.  We then left for their mothers as my daughter had become frightened.",
      "link": "http://www.nuforc.org/webreports/086/S86929.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf540",
      "summary": "4 flare like lights in the eastern sky.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2013-09-30T00:00:00",
      "story": "4 flare like lights in the eastern sky. In the eastern sky.. 4 flare or fireball type objects floating.  The flare like lights would burn out and then egnite again.  Theses flare-lights began to drift downward. Appeared to be in line.",
      "link": "http://www.nuforc.org/webreports/102/S102514.html",
      "state": "AZ",
      "duration": "3 to 4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7a0",
      "summary": "Triangle amber yellow lights over Chandler Arizona",
      "city": "chandler",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "Triangle amber yellow lights over Chandler Arizona I wanted it to be a airplane or airplanes in air traffic but it was 3 bright amber lights and they would stay stationary and then move all together in a triangle formation other planes and air traffic were all around so you could really tell the difference on the motion and the lighting of the aircraft.  I was 30 minutes out on the freeway going home from my friends house wich was a 30 minute drive away in maricopa, I spotted them because of how bright they were , as we got closer to my house we got closer to where the lights were wich was in chandler, by chandler and frye rd. so we get closer up and then you could see that it just stayed and floated in one position or another all in the form of a triangle. . moving and shifting from one position to another, it was also at lower altitude then some planes in the sky at the time , I would say the lights were 3 or 4 miles from me at chandler and frye rd. but saw them more then 30 minutes away from my house",
      "link": "http://www.nuforc.org/webreports/097/S97302.html",
      "state": "AZ",
      "duration": "30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfda7",
      "summary": "I saw these lights as I was driving from the 101 South onto the 202 East San Tan Freeway. I saw the lights first in front of me as I wa",
      "city": "chandler",
      "shape": "triangle",
      "date": "2013-07-22T00:00:00",
      "story": "I saw these lights as I was driving from the 101 South onto the 202 East San Tan Freeway.   I saw the lights first in front of me as I was pointed south on the on ramp.   I continued to see them to my right when headed east, but had to look away to stay attentive to the road, then I dropped to low.   I exited the freeway to go back to the location, but saw nothing.  I would estimate they were at a 45 degree angle up from my vantage point.   I have driven on this ramp 5 nights a week for the last 3 years and 3 months and have never observed any lights in this particular position.",
      "link": "http://www.nuforc.org/webreports/100/S100192.html",
      "state": "AZ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0395",
      "summary": "Orange flame like balls floating across the sky, and some \"taking off.\"",
      "city": "chandler",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Orange flame like balls floating across the sky, and some \"taking off.\" Orange flame like balls floating across the sky going higher and farther away heading north from loop 202 and cooper area.   At first there was about 7, and as some got nearer to each other, some seemed to dissapear.  I looked around some trees that were blocking my view and could see them \"taking off\" from below the tree line rapidly in 1 second intervals at a 45 degree in the direction of the other ones.  \"Chinese latern\" hoaxes?",
      "link": "http://www.nuforc.org/webreports/097/S97747.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04e1",
      "summary": "Swift moving, round shaped, white light in southern Chandler, AZ sky around 3:15 AM..",
      "city": "chandler",
      "shape": "circle",
      "date": "2013-02-28T00:00:00",
      "story": "Swift moving, round shaped, white light in southern Chandler, AZ, sky around 3:15 AM. It was approximately 3:15 AM and I was heading out my backdoor that faces to the south sky to take our puppy to the restroom.   As I walked out onto our back patio I saw a light shoot across the sky heading south.  At first glance I thought I had just seen a shooting star until the light returned and swiftly moved from the west to the east before disappearing.   The early morning was overcast so I saw nothing except a round light in the sky.   I was hesitant that this could be a \"spotlight\" but there were no other lights in the sky and the movement seemed too quick before disappearing completely.",
      "link": "http://www.nuforc.org/webreports/096/S96384.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c09df",
      "summary": "Craft moved from West to East across South Chandler sky.",
      "city": "chandler",
      "shape": "disk",
      "date": "2013-11-11T00:00:00",
      "story": "Craft moved from West to East across South Chandler sky. I was driving home from the grocery store at 9 pm on 24 Oct 2013, and turned southbound on Coronado Street.  I looked up towards the southern sky and saw a craft. The craft was almost saucer-shaped and had 2 to 3 dozen lights on it (in circular patterns starting from the middle outwards).  The lights were different colors (which is what caught my eye in the first place).  They were red, yellow, and blue; mostly yellow, though.  The craft was of a grey color (it did not match the black of the evening sky). I stopped the car because I couldn’t believe what I was seeing.  While parked, I watched as the craft moved West to East.  It was rather slow, but in total, I only saw it for twenty or thirty seconds.  I could not take pictures, as it was too dim to show up on my phone camera.",
      "link": "http://www.nuforc.org/webreports/103/S103568.html",
      "state": "AZ",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f08",
      "summary": "3 Orange \"orb\" shaped objects over Southwest Arizona, followed by a fourth.",
      "city": "chandler",
      "shape": "egg",
      "date": "2014-01-10T00:00:00",
      "story": "3 Orange \"orb\" shaped objects over Southwest Arizona, followed by a fourth. On 12/31/13 at 1:00am ((sic.  January 1st, 2014.) I was standing outside listening and watching fireworks.  I noticed three orange \"orbs\" that looked like Chinese Lanterns.  However, these shapes would ascend and descend frequently, meeting up at the top.   Then a fourth came in from below and traveled across the horizon, then lifted up to meet the other three. It seemed like there was always a rotation of one being below the other three.  The area would have been over Southern Arizona (over Casa Grande) when looking from Chandler to the South. We watched, wondered and then went inside.",
      "link": "http://www.nuforc.org/webreports/105/S105924.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fb0",
      "summary": "Slow-moving orange light crossing overhead, then slowly burning out.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2013-12-02T00:00:00",
      "story": "Slow-moving orange light crossing overhead, then slowly burning out. Orange fuzzy light coming from East looked like aircraft landing light but orange.  Crossed overhead at several thousand feet and started to dim and shrink in size until it burned out completely.  No discernible sound from object.  Flight observed for about 90 seconds.  Less than one minute later three military aircraft passed overhead at low altitude circling the area. Observer is licensed pilot and airframe mechanic.",
      "link": "http://www.nuforc.org/webreports/104/S104729.html",
      "state": "AZ",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c12e6",
      "summary": "THERE WERE 3 RED FIERY SHAPES IN THE SKY.  THE 3 RED THINGS WERE FLYING IN THE FORM OF A TRIANGLE.",
      "city": "chandler",
      "shape": "other",
      "date": "2013-12-02T00:00:00",
      "story": "THERE WERE 3 RED FIERY SHAPES IN THE SKY.  THE 3 RED THINGS WERE FLYING IN THE FORM OF A TRIANGLE.",
      "link": "http://www.nuforc.org/webreports/104/S104859.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1594",
      "summary": "6 or 7 orange flickering orbs in a line formation over Chandler and Gilbert AZ on 10/5/13.",
      "city": "chandler",
      "shape": "sphere",
      "date": "2013-10-23T00:00:00",
      "story": "6 or 7 orange flickering orbs in a line formation over Chandler and Gilbert AZ on 10/5/13. I was driving home from work in Gilbert, AZ, approximately 7:40 PM, turned left onto Alma School Road (heading south) from Guadalupe Road. After driving for about 10-15 seconds, a light in the sky to my left caught my eye.  It was travelling in the same direction as my truck, but much faster.  It immediately appeared to be something unusual as it was an orange flickering orb, flying at about the speed of a small plane, and probably a little lower. I was trying to get a better look, while not causing an accident, and finally had to pull into a small parking lot as I was now sure that this was not a plane or helicopter. After stopping, I got out of my truck and noticed there was another one behind the first.  I watched them going by for a few seconds before getting out my cell phone and taking a video.  Just as I started the video, the second one turned 90 degrees and headed east (it can be seen in the video doing this).  There was no sound whatsoever emanating from them. Only road noise is heard in the video. Looking to my left (North), I suddenly noticed that there was another one, then immediately after, three more behind the first three, in a straight line formation, all heading south except the one that broke off to the East.  The line appeared to stretch almost to the horizon.  As the line progressed south, another one headed east from the same spot that the first did.  I am not sure, but I think it was the 4th in line.  Seeing how far the line went, I kept wondering how many more would show up. Because I was trying to watch and describe what I was seeing on the video at the same time, I lost count.  The total was 6 or 7. Also, it was impossible to see any real shape to them because I couldn't see any defined edges.  It was almost as though it was \"approximately round\", with the edges constantly fluxuating. Because they were orange, and flickering, I thought that they could be Chinese Lanterns, however they were travelling at a fairly high rate of speed, and when I got home I immediately checked the current wind speed on the Internet, which happened to be zero.  I took a screen shot of this, however it doesn’t show the date. I still have the video which is 2:42 and 291 MB, MP4 format.",
      "link": "http://www.nuforc.org/webreports/103/S103304.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c168d",
      "summary": "Object looked like it was on fire",
      "city": "chandler",
      "shape": "fireball",
      "date": "2013-10-23T00:00:00",
      "story": "Object looked like it was on fire My wife and I were going to the store and I saw a light  that appeared to be an object on fire in the sky slowly moving from west to east.  There was no noise. We got out of the car to watch it and it continued at the same pace due east.    After it passed over the car thru a tree the direction changed to north-east for about a minute and then it faded out and disappeared.   It had the same exact coloring as a bonfire but it moved like a slow helicopter but with no noise.   I was about the same altitude as most light planes but moved much slower.    We live close to an airport and it was not  like any other planes",
      "link": "http://www.nuforc.org/webreports/103/S103369.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1866",
      "summary": "Trianglular lights that made no noise, dogs barking.",
      "city": "chandler",
      "shape": "triangle",
      "date": "2014-06-04T00:00:00",
      "story": "Trianglular lights that made no noise, dogs barking. All the dogs in my neighborhood started barking, so I looked outside to see what was going on.  Then, I saw a triangle formation of lights that were in an elliptical orbit.  They made no noise, ruling out any helicopters or airplanes.  They faded in and out, for a few minutes.  Eventually, as the last light faded, all the dogs stopped barking.  Weird stuff man, I aint usually one to believe ufo stories,",
      "link": "http://www.nuforc.org/webreports/109/S109501.html",
      "state": "AZ",
      "duration": "five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1bc9",
      "summary": "Chandler lights.",
      "city": "chandler",
      "shape": "formation",
      "date": "2014-06-20T00:00:00",
      "story": "chandler lights Myself, daughter, friend and several other drivers pulled over to watch the formation of possibly 16 lights.   Flying slowly in formation, all lights were the same size, color, and seemed to fade away. not fly up, across, but just disappeared.",
      "link": "http://www.nuforc.org/webreports/110/S110236.html",
      "state": "AZ",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ebe",
      "summary": "Round orange fireballs in the sky, made a triangle shape then disappeared.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2014-06-27T00:00:00",
      "story": "Round orange fireballs in the sky, made a triangle shape then disappeared. Was driving with my wife and son headed north on the 101 and took the price exit.  The first stop light we saw 3 bright orange like fireballs crossed our path up in the sky.  They looked like they were flying low and they were round and glowing orange.  We were stopped and the were headed east. we turned around to get our camera and they turned into a triangle shape and then disapeared.  Couldn't get any photos.  They were moving to fast I guess.",
      "link": "http://www.nuforc.org/webreports/110/S110708.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f35",
      "summary": "Orange round looking fireballs flying in the sky over Chandler, AZ.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2014-06-27T00:00:00",
      "story": "Orange round looking fireballs flying in the sky over Chandler, AZ. We were driving and got off 101 onto Price rd heading south and 3 to 4 firballs flew across us they were going east.  They seemed to be flying low and then they formed a triangle with the 3 the other one disapeared.  Then about 5 min later they disapeared.",
      "link": "http://www.nuforc.org/webreports/110/S110710.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f4e",
      "summary": "Circular craft flying low with one steady green light and two alternating red lights.",
      "city": "chandler",
      "shape": "circle",
      "date": "2014-06-24T00:00:00",
      "story": "Circular craft flying low with one steady green light and two alternating red lights. Made a noise inconsistent with a plane flying at that altitude.  There were flashing lights similar to those of a plane, but unusual: one steady green light, and two alternating red lights all in a line.   The object passed directly over me, and the lights revealed the shape of the craft - looking circular -- no wing shapes, just a circle.   It continued in the line and turned left out of sight.   Multiple aircraft were nearby, though none seemed to respond. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110571.html",
      "state": "AZ",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c21d4",
      "summary": "Fireball Streaks downward across the estern sky.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2014-04-18T00:00:00",
      "story": "Fireball Streaks downward across the estern sky. A ball of fire streaked across the Eastern sky as I was driving East on Pecos crossing Dobson Rd.  It appeared to be a crash, as the ball went down VERY rapidly. We heard nothing.  We continued East to see if we could find evidence of a crash, but it was impossible to tell just how far away it was.",
      "link": "http://www.nuforc.org/webreports/108/S108574.html",
      "state": "AZ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c27c0",
      "summary": "I witnessed a black, cylinder-shaped UFO in Phoenix, Arizona.",
      "city": "chandler",
      "shape": "cylinder",
      "date": "2014-11-21T00:00:00",
      "story": "I witnessed a black, cylinder-shaped UFO in Phoenix, Arizona. On 11/14/2014 at 2:15 pm, I witnessed a black cylinder shaped object floating in the sky at the Interstate-10 entrance on Chandler Blvd. in Arizona. I did not have a chance to pull over and study it very closely because I was waiting to turn left at a red light.  From inside my car it appeared to be about 1 to 2 feet in length and it was vertical. I was about to turn left (west) on the I-10 freeway when I noticed the object in the North sky sitting low and motionless above oncoming traffic.  It was definitely not a balloon.  It was low enough to tell there were no strings attached and the object looked really solid.  That is, it wasn’t bobbing or weaving like a balloon. At first I thought it might have been a drone but there were no propellers or wings.  There were no lights on it that I could see.  I couldn’t tell if it was making any kind of sound because I was in the car.  There were no streetlights or power lines near it so it couldn’t have been attached to anything.  However, there was a street light about 20 yards in front of it and it appeared to be hovering at about the same height, maybe a little higher.   No one else seemed to notice it.  That is, no one pulled over to take a closer look.  Was this a drone? Has anyone seen something similar or am I going crazy? I’ll check again tomorrow on my way home from work to see if it’s still there. Although I doubt it, I drive the same route every day and this was the first time I’ve ever seen something like this.  P.S. My mom has had multiple UFO encounters over the years. I’m in my 30’s and this is the first experience I have ever had. I’m usually the smug skeptic that rolls her eyes at these sorts of stories. Maybe I should change my tune. &#61514;",
      "link": "http://www.nuforc.org/webreports/115/S115404.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a8f",
      "summary": "Fire trails in the sky, changing direction and descending.",
      "city": "chandler",
      "shape": "unknown",
      "date": "2014-09-25T00:00:00",
      "story": "Fire trails in the sky, changing direction and descending. While driving north on Cooper Road, my daughter and I witnessed four objects in the sky with fire trailing behind them.  The objects seemed to be travelling back and forth, and each time they changed direction, the fire trail subsided, as if the object was changing direction and we could not see the exhaust at that time. This gave the appearance that the four objects would randomly disappear, and then reappear nearby. The objects seemed to be descending, zigzagging in the same area of the sky.  In just a few minutes, they disappeared. All we could really see was the fire trails, or exhaust plumes of the objects.  Something was obviously leaving fire trails, as they appeared very thick at the source of the trail and thin at the rear of the trail as it burned out. This area of the sky commonly has aircraft passing by, since Sky Harbor airport is nearby.  We could see the light of jets as well, but those were MUCH higher in the sky and further away.  These fire trails seemed less than 5,000 feet in the air, and less than 10 miles away from our location. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113749.html",
      "state": "AZ",
      "duration": "<5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a91",
      "summary": "Four balls with flaming tails floating down slowly from the sky with directional changes.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2014-09-25T00:00:00",
      "story": "Four balls with flaming tails floating down slowly from the sky with directional changes On 9/20/14 at approximately 7:20pm my husband, 2 kids and myself were driving back from Casa Grande, AZ, and my husband and I saw the following:  We were driving north on Gilbert Rd. just past Ocitillo Rd. in Chandler, AZ when I saw two red/orange balls in the northeast sky quite a distance from us.  They were sitting at a diagonal from each other but too close together to be airplanes.  I pointed them out to my husband who commented that they may be an antenna tower.  I commented that it must be one crocked antenna because of the diagonal line they made instead of vertical. I dismissed them until 20 minutes later when we were on the 202 E just before the Val Vista Rd. exit.  I looked up at them and they were white now and, to my eye, looked to be about the size of the old large satellite dishes until they broke up into four separate balls about the size of basketballs.  I guesstimated them to be around 3-4 miles northeast from us and approximately 500 feet from the ground.  We pulled off to the side of the highway and watched them as they seemed to be floating down from the sky in a diamond shaped pattern.  As they were doing this each ball of light intermittently changed in brightness going between glowing bright with red flaming tails (like a comet) to dim white balls of light to barely visible.  They floated down slowly like a feather.  Each time one flared up the others did not. Also as they were coming down individually they were slowly changing direction in circular motions.  They eventually fell out of our line of sight behind buildings. They were moving to slowly with weird directional changes to be a meteor or something else falling from the sky.",
      "link": "http://www.nuforc.org/webreports/113/S113780.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3431",
      "summary": "A small bright blue orb shaped ball of light diving at a angle and lasting around three to five secounds",
      "city": "chandler",
      "shape": "light",
      "date": "2015-03-20T00:00:00",
      "story": "A small bright blue orb shaped ball of light diving at a angle and lasting around three to five secounds I witnessed what looked like a small bright blue orb type light as the sun was setting.  The light just dive bombed at a slight angle.  I researched the sightings and found multiple witnesses across the country and world reporting the same thing (A light blue orb falling from the sky lasting around three to five seconds)",
      "link": "http://www.nuforc.org/webreports/117/S117854.html",
      "state": "AZ",
      "duration": "3-5 secounds"
    },
    {
      "_id": "64d005f478aba2ec5a3c39a5",
      "summary": "5 orange fireballs seen from Chandler close to Skyharbor Airport",
      "city": "chandler",
      "shape": "fireball",
      "date": "2014-12-18T00:00:00",
      "story": "5 orange fireballs seen from Chandler close to Skyharbor Airport We were talking in the backyard when we noticed 5 orange light in the NW, the direction on Skyharbor airport.  These lights were just there, not moving, and then moved very slowly until two of them disappeared.  The other 3 were visible for 2 more minutes and then faded away, one by one.  After 2 more minutes, one more light appeared above us, got bright white and rapidly faded away also.",
      "link": "http://www.nuforc.org/webreports/115/S115990.html",
      "state": "AZ",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a18",
      "summary": "1-7 bright orange spheres seen for over an hour in Chandler, Arizona, near the Gila River Reservation.",
      "city": "chandler",
      "shape": "sphere",
      "date": "2014-12-12T00:00:00",
      "story": "One to seven bright orange spheres seen for over an hour in Chandler, Arizona, near the Gila River Reservation. At approximately 8:30 PM on Dec 10th, 2014, while driving home from the Phoenix farmers market, I witnessed 3 orange spheres in a triangular formation.   I was traveling southbound down Gilbert Rd, approaching the stop light at Queen Creek Rd, and the objects were to the southwest of my location.  They were solid orange and very bright.   I continued southbound on Gilbert Rd to Ocotillo Rd and they remained stationary or moved very slowly.   At 8:35 I arrived at my home near the intersection of Gilbert Rd and Ocotillo.  The neighbors across the street from my house were putting up their outdoor Christmas decorations.  I pointed the lights out, and they saw them too.  The objects had moved southwest from the original sighting, but were still clearly visible and unusually bright.  We watched them for a few minutes and I began getting things from my car.   The neighbors said, “The lights are gone,” and a few minutes later, they said, “There they are again.”  I stepped out of the garage to look, and snapped a photo with my phone.  This time there were two of them horizontal to the ground instead of three in a triangle pattern and they stayed lit for three or four minutes until they disappeared.   I went inside and told my father in law about the sighting.  A few minutes later, after getting my son ready for bed, I looked out the 2nd story window.  I saw that the three orange balls of light had reappeared in a straight line, parallel to the ground but were further west than before.   I ran downstairs to get my father in law so he could see them and we went into our backyard for observation.  They lasted for about 10 minutes before finally disappearing.   I finished getting my son ready for bed and sat on the couch to continue looking out the window. Around 8:55 the lights reappeared and I went to get binoculars.  The binoculars didn’t help due to low magnification capability and a few minutes later all of the lights faded out.  I went back upstairs and kept an eye on the area through the window.  Then at approximately 9:00 pm two lights appeared further away than they before, so I went to the upstairs balcony for a different perspective.  I took a few more pictures with my phone.  This time they lasted for ten or fifteen minutes before disappearing.  At 9:25 a single light appeared in the same area so I went back out to the balcony.  The light had moved closer to my position from the last appearance but I still could not tell what it was.  While I was observing this light, two more lights which were evenly spaced appeared to the far right of the original light,  a few seconds later two more evenly spaced lights appeared to the left, and finally two more lights which were also evenly spaced appeared to the left the other! four. There was a total of seven lights in a straight line. There were three sets of two lights evenly spaced from each other with the original light further to the left. They were above the height of the street lights from my point of view and above the tree line in the distance.  They lasted for a few minutes before they disappeared but I managed to take some more photos with my phone.  They all disappeared at 9:31 and I went inside. At 9:35 a helicopter flew slowly through the area. I continued to look out the window for a couple more hours but they never reappeared. The objects appeared to be near the Gila River Indian community and south of the Chandler Municipal Airport.  Being a former Air force Security Police K-9 handler and living near the municipal airport I know what planes and helicopters look like.   These objects made no sound, they did not have navigation lights, they were not Chinese lanterns, or any kind of drones that I am aware of.   After doing a bit of online research I found that lights like these have been seen in this area more than once this year and sometimes they occur multiple nights in a row usually between 8:00 and 10:00. I called the Chandler Municipal airport and the Chandler police dispatcher but they had no reports of unusual activity. I will keep an eye on the sky and maybe I will get a better glimpse of the objects next time.",
      "link": "http://www.nuforc.org/webreports/115/S115920.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c3de0",
      "summary": "I saw a glowing orange light that was ascending and accelerating very slowly. When it was pretty close it just blasted into the clouds",
      "city": "chandler",
      "shape": "sphere",
      "date": "2015-07-06T00:00:00",
      "story": "I saw a glowing orange light that was ascending and accelerating very slowly.  When it was pretty close it just blasted into the clouds at very high speed.  It covered alot of ground,  very, very quickly! ((NUFORC Note:  Date may be flawed.  We have attempted to contact the witness.  PD)) ((ADDENDUM FROM WITNESS)) Sorry I missed your call, I was still stuck on july 4th, the event actually took place this morning  07/05/15 at 12:30am.  Also this was definitely not a Chinese lantern, or anything like that, I've witnessed those being launched before and they're really slow, the object I saw was very, very high in the sky and then it just took off soo dang fast ive never seen anything like it ever before! ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/120/S120089.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3fc5",
      "summary": "Black disk shaped object with 3 large yellow/orange lights spotted over Phoenix, AZ area.",
      "city": "chandler",
      "shape": "disk",
      "date": "2015-06-15T00:00:00",
      "story": "Black disk shaped object with 3 large yellow/orange lights spotted over Phoenix,AZ area My son first spotted this object.  I thought it was a commercial airliner, but it moved too slow, and also moved in wide circles.   At first, the look was metallic, reflecting in the setting sun.  But through binoculars, it looked completely black and donut/disk shaped, like a flattened basketball.  On one side (bottom?) were 3 or 4 really large circles that emitted yellow light that pulsed.  Sometimes the lights were almost invisible as the craft seem to tilt on its side.   It moved slowly to the South East until we lost sight of it.  The altitude was quite a bit lower than commercial airlines, my guess would be half that.   The size of the object, its diameter, was something like a school bus (guess).  Given out location the object must been been above Queen Creek or San Tan Valley, AZ, moving South East.",
      "link": "http://www.nuforc.org/webreports/119/S119558.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c40ba",
      "summary": "Flashing white parallels lights moving up and away as though connected.",
      "city": "chandler",
      "shape": "light",
      "date": "2015-05-22T00:00:00",
      "story": "flashing white parallels lights moving up and away as though connected I was driving and observed two flashing white lights that were moving up and away in a parallel fashion as though they were connected.  No other lights were present and I could not see a form that they were attached to. I slowed my vehicle and pulled out my phone to video it, but it moved past the houses on the road. I turned the corner to see if it was still visible so I could document it, but it was gone.",
      "link": "http://www.nuforc.org/webreports/119/S119009.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4150",
      "summary": "Triangle shaped UFO hovers over Ostrich Festival.",
      "city": "chandler",
      "shape": "triangle",
      "date": "2015-04-30T00:00:00",
      "story": "Triangle shaped UFO hovers over Ostrich Festival Triangle shaped object floated from the South and stopped over Ostrich Festival.  It hovered over the carnival area for about 4 seconds, then continued North slowly, and disappeared within a blink of an eye.",
      "link": "http://www.nuforc.org/webreports/118/S118623.html",
      "state": "AZ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c429a",
      "summary": "5 black spheres in East sky.",
      "city": "chandler",
      "shape": "sphere",
      "date": "2015-04-23T00:00:00",
      "story": "5 black spheres in East sky. In the East I see 5 black spheres in the sky.  Ran and grab my binoculars and the objects were silver.   Ran and grabs my husband and daughter by then they were invisible to the naked eye, but visible threw the binoculars, but only 2 were visible and a red almost diamond shape.   In a few seconds only one was visible and it was black. ((ADDENDUM FROM WITNESS)) Date was April 21st.   ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/118/S118554.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4416",
      "summary": "Unidentified craft with possible military escort.  ((NUFORC Note:  Possibly the U. S. Navy missile launch.  PD))",
      "city": "chandler",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "unidentified craft with possible military escort Driving west bound down Elliot road at Arizona avenue around 19:45..  I saw a bright light similar in color and size to the moon (about 60-70% as large) maneuvering through the western sky with the what appeared to be three military helicopters with large bright lights on them surrounding in the sky in a triangle formation at a distance..  This went on for about two minutes until I lost sight due to heavy traffic.. ((NUFORC Note:  Possibly the U. S. Navy missile launch.  We have corrected the date.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123842.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4577",
      "summary": "Multiple Aircraft circling and 1 bursts into a fireball and falls out of the sky.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2015-11-06T00:00:00",
      "story": "Multiple Aircraft circling and 1 bursts into a fireball and falls out of the sky. In the North Eastern Sky over phoenix as I walked to my car, I noticed several lights in the sky.  They looked like normal plane lights saw green, red and white lights.  They were moving oddly however.  They appeared to be circling and darting in and out.   After watching this for a minute or two, one of them burst into a ball of flame.  Then the fireball appeared to fall at about a 45 degree angle after a bit it started spiraling down, kind of like a tornado.  It soon disappeared below the roof tops.   Still ten minutes later I saw lights circling the area that it appeared to have gone down at.   I was facing more east then north.   If I had to guess at what I saw, I would swear I saw a plane get shot out of the sky.",
      "link": "http://www.nuforc.org/webreports/123/S123250.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f0a",
      "summary": "Heard a loud helicopter so I knew it was military and I ran outside right after my house began to tremble. Saw a helicopter fly right o",
      "city": "chandler",
      "shape": "light",
      "date": "2016-03-04T00:00:00",
      "story": "Heard a loud helicopter, so I knew it was military, and I ran outside right after my house began to tremble.  Saw a helicopter fly right over my house escorting/chasing 3 clear lights that didn't have any navigation lights.   The craft was in a triangle type formation from my perspective, heading southwest with the helicopter tailing at the exact same speed.",
      "link": "http://www.nuforc.org/webreports/126/S126059.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4fd4",
      "summary": "Flashing red/orange  light looking like it was on fire in the sky near Warner & Dobson Rds in Chandler, Az then disappeared!!!",
      "city": "chandler",
      "shape": "triangle",
      "date": "2016-03-04T00:00:00",
      "story": "Flashing red/orange  light looking like it was on fire in the sky near Warner & Dobson Rds in Chandler, Az then disappeared!!! On our way to dinner in Chandler this evening, our son saw a red, kind of orange-ish flickering light in the sky & it wasn't making any sounds but just flickering as if it was on fire but then it started moving!!!  Thought it was a helicopter or plane but showed no other signs to being one except by the semi-triangular shape & then all of a sudden it disappeared!!! I believe we saw a U.F.O. & with it so close to our famous anniversary of \"Phoenix Lights\",  I wouldn't doubt it!!  After we got out of dinner a half hour later we saw three helicopters heading to the area of our sighting.  Nothing in the sky anymore at that time.",
      "link": "http://www.nuforc.org/webreports/126/S126114.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c513d",
      "summary": "Daytime silver streak.",
      "city": "chandler",
      "shape": "light",
      "date": "2016-02-26T00:00:00",
      "story": "daytime silver streak In the early morning, at about 9:05am, bright clear day.  A slightly diagonal streak of light that looked silvery, like a reflection on a single strand of spider web.  The light moved from top to bottom, like a reflection.  Only one other person walking by saw the exact same thing.  Nothing other after that. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126045.html",
      "state": "AZ",
      "duration": "~2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c516c",
      "summary": "Two clusters of orange flashing/flickering objects over Chandler",
      "city": "chandler",
      "shape": "light",
      "date": "2016-02-19T00:00:00",
      "story": "Two clusters of orange flashing/flickering objects over Chandler. From Apache Junction, two clusters of bright orange lights could be seen approximately over the Chandler area.  One was higher than the other, and the lower was about level with the mountain.  The objects appeared square in nature, though the lights shimmered in a random fashion. Soon after spotting them initially, the lower faded away, and minutes later the other one did the same.  They faded away slowly, as if they were turned off. An image was captured, though low in quality, it clearly shows multiple sources of the same orange light.",
      "link": "http://www.nuforc.org/webreports/125/S125914.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5446",
      "summary": "Extremely loud noise shook the house; a huge oval light flying past my house.  It was not an a/c.",
      "city": "chandler",
      "shape": "oval",
      "date": "2015-12-21T00:00:00",
      "story": "An extremely loud noise shook the house, and I looked out the window to see a huge oval light flying past my house.  It was not an airplane or helicopter or any aircraft I've ever seen before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124741.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a53",
      "summary": "Orange Oval near Chandler",
      "city": "chandler",
      "shape": "oval",
      "date": "2016-05-06T00:00:00",
      "story": "Orange Oval near Chandler I saw 3 sighting of the craft though I could not tell if they were the same craft or different ones. Each of them were orange ovals with a small dark antenae like darkness within the oval. I attempted to record the object on my cell phone on the second viewing of the object. That video appears to be lost. The third attempt I was able to upload it to youtube. https://youtu.be/ixpqxQCsYjQ   The video is absent the details that were visible from human eyes adjusted to the dark.  The \"star\" was very orange and vibrant compared to the sky.  And the darkening on top of the object was noticable.  The planet next to the UFO is also not visible though I have a picture that shows the comparison with it and the local street light.",
      "link": "http://www.nuforc.org/webreports/127/S127138.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c60c3",
      "summary": "We were driving east on the Loop 202 San Tan freeway, and I saw what appeared to be balls of amber light appearing in the sky due east.",
      "city": "chandler",
      "shape": "formation",
      "date": "2016-10-27T00:00:00",
      "story": "We were driving east on the Loop 202 San Tan freeway, and I saw what appeared to be balls of amber light appearing in the sky, due east. At first, my husband and I thought they were flares, but they were not progressing across the sky - it was almost as if they were rotating on a disc, appearing to move left to right.",
      "link": "http://www.nuforc.org/webreports/130/S130836.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c60ea",
      "summary": "The UFO had amber lights circulating around it.  It was dark so I could not see any shape.  The event only lasted 1 minute.",
      "city": "chandler",
      "shape": "unknown",
      "date": "2016-10-27T00:00:00",
      "story": "The UFO had amber lights circulating around it. It was dark so I could not see any shape. The event only lasted 1 minute. The event took place about 7:00pm and we were driving east down Hunt Highway.  We looked up and saw lights that looked like they were circulating around an object.  The event lasted about a minute and then it disappeared.   We stopped the car and got out to try and see if we could see anything but there was nothing.   This is my third sighting out here in Chandler. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130846.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c667e",
      "summary": "Dropping off my son at school and we saw a black line going north to south across the moon",
      "city": "chandler",
      "shape": "",
      "date": "2016-12-15T00:00:00",
      "story": "Dropping off my son at school and we saw a black line going north to south across the moon",
      "link": "http://www.nuforc.org/webreports/131/S131751.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c689a",
      "summary": "Exiting of the freeway, my son told me to look out to the west kind of higher in the sky.",
      "city": "chandler",
      "shape": "light",
      "date": "2017-04-13T00:00:00",
      "story": "Exiting of the freeway, my son told me to look out to the west kind of higher in the sky. We saw an amber circular light blink out, then blink in a little south of the original light,  blink out again, further south, then it blinked out again and two amber circular lights blinked in further south, then out and then a single light blinked in further south, blinked out and the sighting was done. No aircraft lights, seemed to move in a straight line, no trails or falling movement and not in the direction of the Goldwater range.  This was looking out towards SE Mesa/Gilbert,  due east from our vantage point on the McQueen exit off of the 202 E.",
      "link": "http://www.nuforc.org/webreports/133/S133550.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c692a",
      "summary": "Orange orbs in southeastern Phoenix sky, March 20, 2017, around 8-9 pm.",
      "city": "chandler",
      "shape": "fireball",
      "date": "2017-03-23T00:00:00",
      "story": "Orange orbs in southeastern Phoenix sky, March 20, 2017, around 8-9 pm. I was sitting on my balcony last night around 8pm-9pm.  I looked up in the southeast sky and started seeing orange reddish balls of light.  Some in formation others on their own.  They were going from west to east and what looked like up as opposed to down but gradually not fast.   I ran inside to get my mother and her phone to take pictures.  It lasted about 15 minutes to half an hour.  My mother saw the same objects.   No reports on the news or internet.   Others must have seen them they were very apparent.",
      "link": "http://www.nuforc.org/webreports/133/S133239.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6996",
      "summary": "Four, red white blue and green, glowing objects flew overhead.  Did not make a sound.",
      "city": "chandler",
      "shape": "sphere",
      "date": "2017-03-17T00:00:00",
      "story": "Four, red white blue and green, glowing objects flew overhead.  Did not make a sound. Me and my girlfriend were in my backyard, sitting on our patio furniture facing west.  I first observed at a distance, facing west, a white sphere.  Then right behind it I saw green sphere, then red then blue.  I first I thought the white sphere was the light from a plane or helicopter.  This is common where we live.   However, as the objects got closer, I was expecting a sound but never heard any.   I kept looking at them because had never seen such glowing colored lights on any aircraft before.  They were not blinking.  More resembling glowing balloons.  Were moving way too fast to be just drifting.   I caught on video from my gf's cell but was hard to make out.  Only some of the green glowing object could be seen.  It appeared to me that they were not connected together, but more like flying in a group, with no visible pattern that I could tell.   They flew overhead, not making any sound, and continued into the distance to the east keeping the same pace. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133121.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c69cb",
      "summary": "3 bright red lights in triangular formation.",
      "city": "chandler",
      "shape": "triangle",
      "date": "2017-03-17T00:00:00",
      "story": "3 Bright Red Lights in Triangular Formation I saw 3 bright red lights flying in a triangular formation very low to the ground and in complete silence.  The objects were very low to the ground and heading west over Chandler.   The red objects would move closer to one another and then further apart while maintaining a triangular pattern varying from equilateral, to iscoseles, to scalene, in nature.   The frequency at which these lights were blinking were mutually exclusive.  They all seemed to make up part of a whole, but they were emanating light on their own accord with complete autonomy.  I immediately ruled out radar on a commercial aircraft because of the nature of the blinking of these objects.   After a minute, they disappeared out of my line of vision.  Shortly after, 2 helicopters appeared to give chase to whatever this thing was.",
      "link": "http://www.nuforc.org/webreports/133/S133150.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b31",
      "summary": "3 Large Orange lights hover over Chandler, AZ.",
      "city": "chandler",
      "shape": "light",
      "date": "2017-02-03T00:00:00",
      "story": "3 Large Orange lights hover over Chandler, AZ. Around 8:20 PM, January 28th, 2017,  in Chandler, Arizona, I walked to the mailbox and notice 3 large orange lights hovering above.  They were group in a triangular shape, not moving for around  for ~1 or 2 minutes.   Next thing I know, 2 shoot off and disappear, while the 3rd light stays behind for about another minute, before disappearing, as well.    During this time, it was easy to distinguish airplanes flying in the distance.",
      "link": "http://www.nuforc.org/webreports/132/S132348.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c3e",
      "summary": "One round ball of fire.",
      "city": "chandler",
      "shape": "sphere",
      "date": "2017-01-12T00:00:00",
      "story": "One round ball of fire. Bright reddish light with darker red undulating 'aura' around it. It seemed to be moving upwards, getting smaller.  It eventually began to fade and went out as if extinguished.",
      "link": "http://www.nuforc.org/webreports/132/S132107.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7127",
      "summary": "((NUFORC Note:  Witness provides no information about sighting.  PD))",
      "city": "chandler",
      "shape": "sphere",
      "date": "2017-07-23T00:00:00",
      "story": "((NUFORC Note:  Witness provides no information about sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135203.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7288",
      "summary": "Strange three light object seen swooping over a field in Chandler, AZ.",
      "city": "chandler",
      "shape": "other",
      "date": "2017-07-14T00:00:00",
      "story": "Strange three light object seen swooping over a field in Chandler, AZ. I am a truck driver who was driving in the state of Arizona on interstate 10 east bound between mile marker 181 and 182.  I initially noticed one circular bright light in the sky swooping down over a field then back into the sky at a high rate of speed.  As I noticed the light coming back around repeating the the same motion, I was closer to the object than before.  As I noticed the object swoop down almost touching the field only one light was on, then a second, and then a third circular light appeared.  Each light was evenly spaced in a straight line.   As this was happening, I turned my head out the window and looked back as the object was ascending back up toward the sky.  With the lights pointing up I was able to see the shape of this object. The shape of this object resembled a large rectangular wing similar to a wing on an old time wwII plane.  The side of this object opposite of the three lights had the middle part of this wing purtrud out in the center of the wing like a tab.  So that side was not completely straight,   The other side with the lights was straight with three large white circular lights in a row. I attempted while watching this to take a picture but was unable to while driving.   I have never seen anything like this during my 15 years on the road as a truck driver and wanted to report this and hopefully get a logical explanation on what this may have been. I have a sketch of this object as well that I can mail to you. ((NUFORC Note:  We spoke via telephone with the witness, and he seemed to us to be unusually eloquent in his description of the object, and quite sober-minded.  We suspect that he is a highly capable, and highly reliable, witness.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135144.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c72e0",
      "summary": "I noticed something strange flying in the sky.  It was a red circular orb.  It flew around.  ((anonymous report))",
      "city": "chandler",
      "shape": "fireball",
      "date": "2017-06-15T00:00:00",
      "story": "I went in my backyard to let the dog out and noticed something strange flying in the sky.  It was a red circular orb.  It flew around in a complete circle.  I almost felt like it noticed me.  I was recording and taking photos of it.  It then hovered directly above me in one place for at least 20min.   I ran inside to take the dog in the house and then came back out to finish looking.  The red orb had disappeared. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134563.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7679",
      "summary": "2 Solid round Orbs, one white/one red.  Stopping/ starting, in the sky above me.  Both orbs very clear, solid.",
      "city": "chandler",
      "shape": "",
      "date": "2018-01-12T00:00:00",
      "story": "2 Solid round Orbs, one white / one red.  Stopping/ starting, in the sky above me.  Both orbs very clear, solid. One solid red round Orb like light.  One Solid white Orb like light.  Red Object at a standstill, white object came into view, and looked like the white Light was going to crash into the red light in its trajectory. but white object veered off And came to a stop, past the red object.   Then white object began moving again, and and zipped past the red light again, as If the two lights were playing a Game of \"Chicken\"   This went on for approx. 4-5 mins, then White light speed off out of sight.  Approx. 1 min later the red light took off until it was out of sight..  This was at Approx. 6:10, 6:15 PM At Chandler, Az.  Cross streets,  Cooper rd/Pecos rd.  85225. ((NUFORC Note:  We spoke via telephone with the witness, and found her to be quite sober-minded.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138112.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c79c3",
      "summary": "We saw 2 lights that seemed to be a helicopter but we didn't hear any noise. There was no flashing wing or tail light. Just an orangish",
      "city": "chandler",
      "shape": "triangle",
      "date": "2017-10-19T00:00:00",
      "story": "We saw 2 lights that seemed to be a helicopter but we didn't hear any noise.  There was no flashing wing or tail light.  Just an orangish light.  I was going to take a picture or movie with my phone, but didn't think of it fast enough.",
      "link": "http://www.nuforc.org/webreports/136/S136622.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7afa",
      "summary": "Synchronous blinkings silvery lights in a formation across entire SW sky above South Mountain.  ((NUFORC Note:  Meteor?  PD))",
      "city": "chandler",
      "shape": "formation",
      "date": "2017-11-17T00:00:00",
      "story": "Synchronous Blinkings Silvery lights in a formation across entire SW sky above south mountain, Phoenix AZ. Usual planes flying in for landing @ sky harbor & then the whole sky above south mountain lit up like a Christmas tree while walking dog.  There was 4-5 silver lights blinking & began synchronizing with each other & 3 were in a triangle!  Wondering if anyone else saw it!",
      "link": "http://www.nuforc.org/webreports/137/S137282.html",
      "state": "AZ",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d24",
      "summary": "Intermittent pulsing, green, stationary, then moved an hour later.  ((NUFORC Note:  Star or planet, we suspect.  PD))",
      "city": "chandler",
      "shape": "teardrop",
      "date": "2017-09-21T00:00:00",
      "story": "Intermittent pulsing, green, stationary, then moved an hour later. I Woke up from sleep at 3:30 am and noticed my phone was dead (odd because it was fully charged a few hours ago) I go to the outlet near my bedroom window and happen to look out.  It is an east facing window.  I saw a bright white light that I pushed off as a star. I went to the kitchen and back and looked out again.  I now saw the light now flashing red and blue. I think ok its a plane.  I decide to look one more before I get back in bed. It is now pulsing green with  almost laser  looking lights all around except for the top left corner also pulsing green in a   clockwise circular pattern.  I was shocked and rushed outside.  I had no way to photograph because of the dead phone.  I watched until 4:15 it was stationary the entire time and would pulse green with long starburst formation then go back to a plain white light and sometimes flash red and blue in the center. Like I said, this was stationary the entire time until I went in at 4:15 am . I looked out one more time from my window and it was no longer visible directly from my window. I crouched down and the green light was now directly above my apartment building(still stationary). I went to bed and had strange dreams and thought I was hearing loud noises all night.",
      "link": "http://www.nuforc.org/webreports/136/S136248.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e91",
      "summary": "Lighted object larger than a commercial a/c hovering above a tree line.  ((MUFON Report))",
      "city": "chandler",
      "shape": "other",
      "date": "2018-05-04T00:00:00",
      "story": "Lighted object larger than a commercial a/c hovering above a tree line. Witness had walked outside to his truck, then noticed something unusual above the field at the end of the road.  A lighted object, much larger than a commercial aircraft, was hovering over the tree line.  He lost the object behind the trees for a moment when he took some items from the truck, inside.   When he went back outside, the object had started ascending upward slowly like a leaf falling, sometimes zig zagging back and forth as it ascended.  He yelled for his wife to check it out and she witnessed it traveling upward in a zig zag fashion.  It finally disappeared behind a cloud.  After his wife went back inside,  When he turned around on the porch to go inside he saw an identical object in the sky to the NW ASCENDING in the same leaf like manner. 10 mins. (MUFON 54145)",
      "link": "http://www.nuforc.org/webreports/139/S139692.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c84d7",
      "summary": "Stationary object that suddenly took off like a rocket.",
      "city": "chandler",
      "shape": "light",
      "date": "2018-10-06T00:00:00",
      "story": "Stationary object that suddenly took off like a rocket. I was heading northbound on McQueen Road.  As I approached Warner Road, I noticed a bright light in the sky at approximately one o’clock from my position and at 30 degrees.  The light seemed like a streetlight at first, then I noticed it was too high up and farther away.  Then I thought maybe a star since the sky was clearing up and the stars were out. The light went from a bright light to a flashing series of lights.  OK, must be a plane.  I looked around and saw other planes in the sky.  One was to my left at eleven o’clock and heading toward the light.  I continued driving northbound and saw it out of my peripheral vision. As I neared W. Guadalupe Road, the light seemed to have shifted position slightly to the east, but was at the same elevation, however the plane to the left had slowly moved past it.   As I watched it, it suddenly seemed to pick up speed and took off like a bullet out of a gun, heading straight east and was gone in less than a second. I continued scanning the skies all the way to US 60 to see if it would come back.  It was gone.",
      "link": "http://www.nuforc.org/webreports/143/S143346.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8872",
      "summary": "Multiple fast solid white lights appearing at different times and locations in the sky.",
      "city": "chandler",
      "shape": "light",
      "date": "2018-06-28T00:00:00",
      "story": "Multiple fast solid white lights appearing at different times and locations in the sky. This is the second incident where I've seen the same occurrences.  I saw a solid  white dot racing through the upper atmosphere of the night sky.  I thought it could've possibly been a satellite until I saw another one, then another at the same time.   I went and grabbed my binoculars and my high powered telescope and my daughter and I continued to scan the sky.  I tried to keep up with an object with my telescope but it was extremely fast. I couldn't make out a shape but it was a brilliant, white, solid, light.  I yelled for my boyfriend to witness what we were seeing and he saw the same things.  They were way too high to be an airplane or drone.  If they didn't slow down, speed up, change direction and sometimes completely just vanish, I would think they were just satellites.",
      "link": "http://www.nuforc.org/webreports/141/S141916.html",
      "state": "AZ",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c89e7",
      "summary": "There were two sets that with the naked eye appeared round. They were above us in Chandler, Oklahoma for about 10 and 20 minutes. Throu",
      "city": "chandler",
      "shape": "other",
      "date": "2019-09-19T00:00:00",
      "story": "There were two sets that with the naked eye appeared round.  They were above us in Chandler, Oklahoma, for about 10 and 20 minutes.  Through a pair of binoculars they reminded us of wheels inside of wheels.  They lifted up and out rather quickly then one returned and stayed for a bit longer before fading out.",
      "link": "http://www.nuforc.org/webreports/148/S148863.html",
      "state": "OK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9408",
      "summary": "I am sending a video electronically. There was a main light that blinked and changed colors. However what caught my attention was I cou",
      "city": "chandler",
      "shape": "changing",
      "date": "2019-12-01T00:00:00",
      "story": "I am sending a video electronically.  There was a main light that blinked and changed colors.  However what caught my attention was I could tell the object was much bigger than the light portrayed.  There was a strange magnetic or electrical field or haze camouflaging the craft.  The light would be in one spot and almost instantly be across the sky.  It moved kinda like in a zig zag way.  Seemed like erratic movement.  It was absolutely silent.  No sound whatsoever.  At first I thought a strange aircraft was emitting a dangerous gas on the entire city.  It seemed to stop and I saw a strange electrical aura like gas descending from out the bottom.  Then I realized the craft was just descending straight down because it suddenly shot straight up and over and the auto around it went with it.  It was like I could see through whatever field was around it and could tell the objective was to be stealth. Never witnessed anything like it in my life.  I have a 4.5 minute video of it.",
      "link": "http://www.nuforc.org/webreports/150/S150479.html",
      "state": "AZ",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c97d3",
      "summary": "Well I heard a rumbling sound outside and then when I went outside I looked up into the sky and saw a jet chasing a circle orb it was y",
      "city": "chandler",
      "shape": "circle",
      "date": "2019-12-19T00:00:00",
      "story": "Well I heard a rumbling sound outside and then when I went outside I looked up into the sky and saw a jet chasing a circle orb it was yellow Orange in color and it went towards north Mesa then they went towards Phoenix I guess and went around and came back towards Chandler 10 minutes later I saw it again right north of Ray Road about 3,000 ft High it was the jet was chasing a UFO",
      "link": "http://www.nuforc.org/webreports/151/S151615.html",
      "state": "AZ",
      "duration": "15 minutes"
    }
  ]
}