{
  "city": "charlotte",
  "fetch_timestamp": "2025-07-12T14:19:00.350632",
  "record_count": 160,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b432d",
      "summary": "We saw two UFOs chasing an airplane.",
      "city": "charlotte",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "We saw two UFOs chasing an airplane. My friend and I were sitting in my backyard and all of a sudden our phones and watches stopped working. We looked up and saw two UFOs heading in the direction the moon was in. Then we heard an airplane coming and the UFOs changed direction and started chasing it. They were sort of a bronze color and looked like an oval with shrp pionts on the end.",
      "link": "http://www.nuforc.org/webreports/049/S49605.html",
      "state": "NC",
      "duration": "10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b4344",
      "summary": "my friend and I saw 4 white flying ovals.",
      "city": "charlotte",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "my friend and I saw 4 white flying ovals. Me and my friend , Joseph, were playing on his trampoline when we saw 4 white flying discs in the air they looked like ovals and they were going about 30 mhp am 11 years old and my friend 'Joseph, is almost 13 and there 3 in a line and one in the back.",
      "link": "http://www.nuforc.org/webreports/049/S49608.html",
      "state": "NC",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4565",
      "summary": "two UFOs crashed near my house",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2006-05-15T00:00:00",
      "story": "two UFOs crashed near my house I was at my friend's house , looking at the moon. then there was an flashing object just sitting by  the mooon. i stared at it for 5 minutes and then another one appeared. they started circling each other for a couple of minutes and then one started going down at a diagonal and looked like it crashed near my house. then as soon as the other one was gone it went down to the same place. the next day i went to my house and my dad said that there were some trees that fell last night.",
      "link": "http://www.nuforc.org/webreports/050/S50234.html",
      "state": "NC",
      "duration": "10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b47ae",
      "summary": "As I was driving home, I saw a plane in the sky and another object. I began to get alarmed as I thought it was two planes about to coll",
      "city": "charlotte",
      "shape": "circle",
      "date": "2019-08-23T00:00:00",
      "story": "As I was driving home, I saw a plane in the sky and another object.  I began to get alarmed as I thought it was two planes about to collide.  The plane passed the object and it was right underneath the moon.  The object was round and all black and I could only see it as the moonlight glinted off of it.  I could see it from my home and immediately had my mother come view it as well.   The object didn't move and we observed it for approximately 45 mins.  The object just hovered and didn't seem to move though once it disappeared for a second but then came back.  I also face timed a friend to view it as well.  The object is still out there.",
      "link": "http://www.nuforc.org/webreports/148/S148221.html",
      "state": "NC",
      "duration": "Unsure"
    },
    {
      "_id": "64d005f478aba2ec5a3b49d3",
      "summary": "More than 100 flying objects of bright light",
      "city": "charlotte",
      "shape": "light",
      "date": "2019-07-25T00:00:00",
      "story": "More than 100 flying objects of bright light. Friday, July 19, 2019 - At 9:50 PM EST, I was in the swimming pool at Post Ballantyne, when I saw a bright object, like a star (but three times bigger) or a satellite (four times bigger), flying north at about 15,000/20,000 feet.  I am always fascinated and very interested in flying objects, and I know that this was not a star, not a shooting star, not an airplane, not a drone and not a helicopter.  There was no engine sound.   A minute later a saw a second one, and then a third one, and a fourth, fifth, sixth and seventh.  Two minutes later I saw ten more, and ten more and then ten more.  Three minutes later I saw twenty more, and twenty more, and twenty more.  They were not flying in formation, rather randomly.  There were three other people with me in the pool, a man, a woman, and a child.  I asked them if they could see what I was seeing and they were totally surprised to see the flying objects.   We tried to take photographs with our phones, but they were too smal! l for the cameras.  The objects were flying in direction south to north, slightly west (5 degrees) from where we were.  They kept coming for the next 20 minutes.  Between 10:00 and 10:10 PM was the largest number of objects flying at one time.  Always flying at the same altitude, same direction, and same speed.  Then they started to decrees (contrary as they had started) until I saw the last one at about 10:20 PM.   I am a pilot and a keen observer of the sky, and I do not believe in UFOS, BUT THIS WAS SOMETHING very fascinating that I had never seen before.  Quite intriguing and fascinating. I need to investigate this event more and try to find a logical explanation, but if I do not find an explanation I feel I might become a believer in UFOS.",
      "link": "http://www.nuforc.org/webreports/147/S147672.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4bd3",
      "summary": "Whooshing sound with 1-red and 3-white lights that went silent",
      "city": "charlotte",
      "shape": "other",
      "date": "2019-07-12T00:00:00",
      "story": "Whooshing sound with 1-red and 3-white lights that went silent. At approximately 3:30 a.m. EST while on work break in South Charlotte I heard a strange whooshing sound for about 5 minutes, I looked up and did not initially see anything.  The sound continued, but did not get louder nor distant, then I saw a single red blinking light followed by 3 very bright and vibrant white lights (brighter than those that come from Xenon gas bulbs) that flashed one at a time making a line pattern in a different direction than the red light, making it appear as if the object was changing course,  however,  when the red light would re-appear, it was at the front of the direction the object was moving, and the white lights were angled off to the side. .  If all those lights were to be illuminated at once, it would have made an “L” shape.  I see all types of commercial and military air craft here at night especially being in the flight pattern of the airport, I have also seen weather balloons, satellites (no blinking to their lights) and the international space station fly over.  None of which had the sound or light patterns I experienced tonight.  The strangest part of this experience was that when my eyes focused on those lights as it was directly above my head, the sound ceased.  Even as the object passed, and what you would usually hear from the rear of a craft as it passes by, there was complete silence as I watched it move overhead then eventually out of sight.  I have to add, I am a total skeptic and I have tried for hours to make logic of this experience, but the more I try, the more questions I have.  Most importantly, if it were a military type jet propulsion aircraft the sound is more like a constant distant thunder (even when it is very high in the sky) that gets louder as it gets closer, then the sound gradually fades.  This was not at all like anything I have ever heard…the sound was more like the noise an MRI machine makes at top speed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147514.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ea1",
      "summary": "Green and white fireball coming toward Earth.  ((anonymous report))",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2019-04-08T00:00:00",
      "story": "Green and white fireball coming toward Earth At the dog park alone, I saw one unidentified fireball/comet like object.  Its tail was white, and the fireball was neon green.  It was traveling quite fast at a 45 or so degree angle toward the earth.   I did not hear an impact, which surprised me, nor did I hear any noise associated with it.  It was much to large to be a drone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145409.html",
      "state": "NC",
      "duration": "6-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ece",
      "summary": "Dark object in sky.",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2019-04-08T00:00:00",
      "story": "Dark object in sky. Hello,   I am here to be telling you of my encounter.  I am ((male name deleted)), from Brazil, and have lived in US States for several years, all legal, mind you. I was working late, from home, as my company does their month end close at end of each month and I am required to monitor the process. After it was done, I walked outside at my new home to have a smoke, and walk the dogs, and wonder why my HOA still hasn't approved my fence.  When I notice a feeling like I am not alone.  The hair stands up on my back, and trust me, I have a lot.  I look around and then I see it over the tree tops about 100 meters south of my house. A large shape hover over the tree tops.  I cannot tell you if it round or flat just that it make a buzzing sound and no lights, but it block out the stars. I yell to my friend ((name of male #2 deleted)) to get out here.  He run out saying what happen what happen, and stub his toe on brick. We both stood and looked at this thing while it moved back and forth over the tree tops, terrified beyond words.  We were unable to move and I have left my phone in house so not able to take picture. When it left we just look at each other and say nothing.  My dogs ran back into the house whimpering. I have not sleep or eat since this happen.  I am scare it will come back for me. what can I do?  Please help. Gonzalo",
      "link": "http://www.nuforc.org/webreports/145/S145474.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5288",
      "summary": "In mid conversation we both looked up  to the sky simultaniously. We  saw  what we thought was a  shooting star  very high in the eveni",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "In mid conversation we both looked up  to the sky simultaniously. We  saw  what we thought was a  shooting star  very high in the evening sky. It then very quickly changed directions and increased its speed and sped away. Neither one of us could believe what we saw. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63694.html",
      "state": "NC",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b53c9",
      "summary": "This disk with various colors of light 'oozing' around the bottom section was seen just above the trees at the corner Dotger Avenue and",
      "city": "charlotte",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "This disk with various colors of light 'oozing' around the bottom section was seen just above the trees at the corner Dotger Avenue and 7th Street (above 2420 E. 7th Street) sometime around 1975. I was only a child when my mother call me from the kitchen with a certain urgency in her voice that was never heard before or ever again after the event.  I suppose I was only six or seven (1974 or 1975) when her eerie cry had me running from the living room where the TV had been keeping me company.  I joined her at the window and witnessed something less than 60 meters away. “Do you see it?” she asked. I did see it.  I saw it.  Beautiful!  How flawless in form, size, and color for a vehicle.  A big, rounded flying… car?  The bottom section of the disk had a bright blue glow that was being replaced by a new color from left to right as it seemed to ooze into view.  A new color followed it around (always counter-clockwise) very slowly as I heard my mother ask a new question. “What is it?” “I think it is a…”  Then I thought, ‘My mother is asking me what it is?  You mean she doesn’t know?  Was she testing me?  The color red began to ooze in behind the last color and then just as slowly came another.  Mesmerized, my mother and I watched this thing hover just above the trees and give us the lava lamp show of our lives.  Before long we were saying the colors in unison as they came into view and waited a few seconds for the next color to appear.  I remember wanting to be the first to guess the next color or say what it was as soon as I could see any hint at what the color would be as it slowly made it’s appearance. “Blu-u-u-u-u-u-u-u-u-u-e… gre-e-e-e-e-e-e-n…” “Hey Mom, can we go outside?\" After several minutes my panic-stricken mother moved me to the dining room where I watched it from a bay window and she made phone calls to police, the airport, my dad, and then gave up from frustration at being laughed at or hung up on.  I watched the flying saucer and for so long that I actually got bored of it and went back to the TV set only to return to the window during commercial breaks.  Alas, it was out of view.  What could have been the most remarkable encounter of the first kind, was over and done without even a single photo.  The heavily used camera was out of film.  I had one of the most extraordinary experiences ever and it never really sunk in until the day I told someone what I saw and they laughed at me.  I would give everything I own if intelligent extra-terrestrial life was be COMMON KNOWLEDGE.  Thank you. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58261.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5bbc",
      "summary": "Disk-Shaped Objects w/ Red and White Lights Over Incoming Flight Path of Charlotte-Douglas International Airport",
      "city": "charlotte",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "Disk-Shaped Objects w/ Red and White Lights Over Incoming Flight Path of Charlotte-Douglas International Airport Charlotte, NC.  August 21, 2007, approximately 8:45 p.m.  Noticed a blinking disk-shaped object in the northeastern sky above downtown Charlotte that appeared from nowhere, moved around a small area of the sky, blinking and disappearing, then appearing again, hovered for several minutes.  I went inside to get my boyfriend as a witness and a pair of binoculars, and when we got back outside, the craft had disappeared from its location.  After watching for several minutes, another disk-shaped object appeared in the north-northwestern sky above the incoming flight pattern to Charlotte-Douglas International Airport for a few seconds, and disappeared.  Another craft then appeared directly afterward, hovering still, slightly more westerly and lower in the sky.  This craft hovered for approximately 5 minutes before disappearing below the tree line.  We were both stunned that the object was in full view and seemed to be right in the landing path of incoming flights; several planes came in over the craft while it was present.  These three (or maybe it was just one on the move?) had red and white blinking lights.  Boyfriend looked directly up from our vantage point and pointed out what he described as a bar-of-soap shaped object with a satellite that looked like a glowing white orb.  I did not witness this particular object.  I am located just south of center-city with a direct view of the Charlotte city skyline and often sit on my deck at night.  I have witnessed these things for months (and often grab the binoculars and my boyfriend to witness - if nothing more than for confirmation that I’m not seeing things), most of the time over the airport or in the northeastern sky.  The objects have appeared nightly for months until about the second week of July, and were gone completely until this week when they reappeared.  They are most often saucer or disk shaped with blinking lights or steadily but dimly glowing orbs.",
      "link": "http://www.nuforc.org/webreports/058/S58346.html",
      "state": "NC",
      "duration": "10 minutes total"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c98",
      "summary": "BRIGHT WHITE TO BLUE LIGHT",
      "city": "charlotte",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "BRIGHT WHITE TO BLUE LIGHT STANDING ON THE DOCK @ WORK LOOKING WEST SOUTHWEST I SAW A BLUE TO WHITE LIGHT APPROACHING CHARLOTTE AT A VERY SLOW SPEED.  THE LIGHT WAS SLIGHTLY BIGGER THAN THE NORTH STAR AND IT WAS DEFINATELY MOVING-JUST SLOWLY.  IT SEEMED TO CHANGE BRIGHTNESS FROM A WHITE LIGHT TO A BRIGHT BLUE.  I WATCHED IT FOR MAYBE A MINUTE AND IT SEEMED TO TURN NORTHWARD AND JUST DISAPPEARED.   I'VE SEEN PLANES APPROACHING W/A SHIMMER FROM THE SUN AND THIS WASN'T THAT.   THE AREA OF SKY THE LIGHT DISAPPEARED IN WAS CLEAR OF CLOUDS AND THERE WAS NO OUTLINE OF A PLANE OR ANYTHING-IT JUST DISAPPEARED.  IT WAS HARD TO BE SURE BUT THE LIGHT APPEARED TO BE AT MAYBE 15,000 FEET, BUT DUE TO ANGLE AND DISTANCE-I CANNOT SAY FOR SURE.  I'M EX-MILITARY AND HAVE TAKEN A FEW BASIC VISUAL RECOGNITION COURSES.",
      "link": "http://www.nuforc.org/webreports/054/S54935.html",
      "state": "NC",
      "duration": "60 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3b6159",
      "summary": "it felw constant changing shapes",
      "city": "charlotte",
      "shape": "changing",
      "date": "2008-03-04T00:00:00",
      "story": "it few constant changing shapes me and my neighbor was out blowing the leaves off the yard when i spotted what looked like a balloon caught in a jet stream displaying rotation but as we watched it was moving in a stright line and a good rate of speed. it was flying low and quiet. it continued on a path the indicated the it was perpelled by something yet fliping like a balloon",
      "link": "http://www.nuforc.org/webreports/060/S60369.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6136",
      "summary": "Bright orange flame, low in sky moving in a NE direction over Charlotte, MI",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2007-10-08T00:00:00",
      "story": "Bright orange flame, low in sky moving in a NE direction over Charlotte, MI I was driving home from the store and happened to look out my drivers window because something caught my attention. Low in the sky was what looked like an orange flame. It was moving slowly in a NE direction. I drove around the block trying to get a better look but by then it had moved almost completely out of sight. Never seen anything like this and have no explanation of what it could be. Freaked me out!",
      "link": "http://www.nuforc.org/webreports/058/S58505.html",
      "state": "MI",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b617b",
      "summary": "On 5-14-2008 at about 0030 hours I observed a very bright glowing green object(almost neon green) descending from the sky towards the g",
      "city": "charlotte",
      "shape": "cylinder",
      "date": "2008-06-12T00:00:00",
      "story": "On 5-14-2008 at about 0030 hours I observed a very bright glowing green object(almost neon green) descending from the sky towards the g The date was 5-14-2008. The time was about 0030 hours. I was at work. I was parked at the intersection of The Plaza and Eastway Drive(Charlotte,NC). I was facing towards uptown Charlotte. I observed a very bright glowing green object(almost neon green) descending from the sky towards the ground. It was very fast. It disappeared behind the tree line in front of me. I observed it for only about 3-4 seconds. The object appeared to be a cylinder shape (in a upright position).  My window was down and I did not hear any sound. A friend of mine was parked next to me but facing the opposite direction. It happened so fast that by the time I could get any words out of my mouth, when he turned around it was over. It was without a doubt nothing from this planet. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63161.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6264",
      "summary": "two balls of light, the second was only 40 to 50 yard away, the experience gave us a feeling of joy inside.",
      "city": "charlotte",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "two balls of light, the second was only 40 to 50 yard away, the experience gave us a feeling of joy inside. My girlfriend and I have seen a few ufos in nebraska, but, never two in less than a minute. The first was a fast moving ball of white light above us. The next occured just thirty seconds later just to the left of my grandmothers farmhouse. This time it was much larger becuase it was only about fifty yards away. It was a ball of light with a blue glow emminating from it. It moved in a zig zag pattern, then disappeared all in a matter of about two seconds. We felt an overwhelming sense of joy, but the sight of the seconf one almost made my heart jump out of my chest.",
      "link": "http://www.nuforc.org/webreports/052/S52158.html",
      "state": "MI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b627b",
      "summary": "Grayish object flying fast North to south over Independence Blvd",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2007-10-08T00:00:00",
      "story": "Grayish object flying fast North to south over Independence Blvd On September 02, 2007, at 2339, I was looking up during a cigarette break at work, standing at the Carmax on Independence Blvd in Charlotte, NC.  There is a low to medium level of light pollution, and looking almost straight up under an overhang cuts out most of that.  I was outside about 5 minutes, and I was looking up, as I usually do at night, looking at constellations, and I happened to notice and watch a very high flying airliner flying approximately east to west.  I then noticed an object flying very fast approximately north to south.  It was a dark grayish shape, with a tiny spot of an orangish color that really seemed like a reflection of light versus an active light, and it was almost unnoticeable except for the movement.  I would say it was almost oval-ish.  It first appeared directly overhead, and was flying at a much higher rate of speed than I've seen any aircraft at a visible level.  It was going slow enough to follow it with the naked eye, however.  I first thought it might be a helium ballon due to the characteristics of appearing smaller but moving faster than a plane may.  However, there is no wind during this incident. I have no idea how high or the size of the object, but I would guess possibly 2000 feet up, possibly more, but no where near the height of the airliner.  It traveled in a straight line, jinked to the right similar to a bat would move, about 6-10 degrees, flew about a second on that heading, then jinked back to the left, again in the same instantaneous motion, a smooth, quick motion, while continuing on.  I would say from noticing it almost directly overhead, until I could not see it, lasted about 5-7 seconds.  I shouted at a coworker to look up, but they had just stepped out of hearing range at the time.  I am not taking any medication, do not drink, and have been at work about 6 hours when this happed, so I am fully awake and alert.  I called Charlotte Douglas airport and asked for a controller to ask if they saw anything, they replied the only thing they had was a plane flying around to land at the airport. I know there is no way this thing was a plane.  No flying lights, no blinking lights, the 2 smooth curves it made while flying.  If there was a helicopter that could angle that fast, I might believe that is what I saw, however there were no lights and I don't believe helicopters fly nearly that fast. I spent 10 years in the Air Force and have seen a few planes fly.  Nothing this fast, seemingly lower height, and the turns/curves it made.  Would like to hear if anyone else saw anything.",
      "link": "http://www.nuforc.org/webreports/058/S58531.html",
      "state": "NC",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b62b9",
      "summary": "a very high, fast, orange UFO over Charlotte NC",
      "city": "charlotte",
      "shape": "oval",
      "date": "2007-04-27T00:00:00",
      "story": "a very high, fast, orange UFO over Charlotte NC Charlotte, NC UFO  This happened around the middle of February.  I was working and had to go outside. I looked up to my right, and saw a very, very fast orange object go over the horizon. I don't know what it was. It was very high in the nighttime sky. The only thing I know for sure is that it was faster than anything I have ever seen. It was so high, that is looked very small. As fast as you can snap your fingers, it was gone.",
      "link": "http://www.nuforc.org/webreports/055/S55854.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b68de",
      "summary": "We were under brilliant illumination that was much brighter than the 2:30 pm afternoon clear day sunlight.",
      "city": "charlotte",
      "shape": "disk",
      "date": "2006-12-07T00:00:00",
      "story": "We were under brilliant illumination that was much brighter than the 2:30 pm afternoon clear day sunlight. I noticed intense but unusual ground effects lighting all around us before I noticed what was causing it.  There were no clouds, it was a bright, sunny, blue sky, October afternoon with the sun shining to our right, casting long shadows in the sand. I had sat down on a swing for about 5 minutes, watching my son playing in the sand to my left, when all of a sudden I physically felt an extremely intense, powerful double shock wave that initially seemed strong enough to stop my heart momentarily from beating. When I looked around me, everything was lit up brilliantly in a strange light grey light, and then looked over at my son 7 feet away from me, I could clearly and obviously see that we were being intensely illuminated from directly above. When I looked over at my son, his own shadow below his body was razor sharp around him on the sand, but when I looked straight up in the sky, the two round objects were actually about 3-4 miles over to our right instead, which was confusing because the light they were emitting made it seem as if they were only 100 feet straight above us.  His bright red jacket appeared only grey, there was no color vision at the time of the sighting.  The light seemed brilliant grey, and actually eradicated all of the shadows eminating from the bright sunlight.  They were heading south to north, same speed, same line of movement, second one behind the first one about a mile or two behind, and were the same size each, circular in shape with about 7 concentric non-contacting rows of brilliant but separate and staggered, huge, stationary sparks underneath them, but coming out of the underside of the objects. The sparks were static and appeared photographic due to total non-movement, but with random, smaller bright shards of blue and red in each of the white and also each of the yellow sparks. The first, outer, ring of sparks was white, the second two smaller inner, concentric rings were yellowish in color, the next smaller ring was white and the next two were yellowish ag! ain in c olor, with the final, smallest ring being white sparks. But in the exact center of each object was a huge black circular discharge of downward facing uneven energy, like an enormous jet black spark, as was all of the other sparks, each facing downwards as well.  I could tell the black energy was larger because it was blocking out the few rows of sparks that were behind it.  The second, trailing object then zoomed quite rapidly up to the first one, as they each continued northbound, and then immediately bounced off of without ever hitting it in two or three tiny little loops to the right of it, then instantly approached it again, and once more seemed to be deflected somehow by the first one in 4-5 little swirling looping motions on the left side of the first object.   The first object remained perfectly stationary at both times.  Then the second object went all the way back to its original distance and position and once again approached the first object again, same speed, but this time, apparently making a smoother approach, because it went slowly under the first one, because the first one started disappearing as in a crescent shape above it, and then the top one dissappeared completely, apparently as it overlapped the second one now below it.  Due to their similar size, they now appeared as one object.  Then, after traveling another few miles towards the north, above to my left, they rapidly and suddenly flung apart from each other, the top one seemed to deflect to the right where I could still see the rings of sparks on the bottom of it and then the second one deflected to the left of it flipping almost on its side at an angle towards my direction because I could see the top of it, that it was covered in a greyish brownish material, soft looking, and it had no windows or doors and had a smooth dome shape directly in the middle of its center. When they both instantly flung apart from each other, they also instantly and abruptly stopped at the same exact time completely in mid-air.  At that instant, that ! they bot h stopped in mid-air for perhaps two seconds that I could tell, then they both, at the same precise instant, disappeared from view completely without any indication of speed, flight trails or even any apparent flight direction whatsoever.   I used to work in the financial accounting field, so paying attention to details was very important.  I also did not feel threatened or afraid at any time of the sightings even because of the strange light because they made no movements towards us, they simply seemed to be maneuvering in the sky, and the way they moved so effortlessly, made it seem to me as if they were floating on top of a solid surface, even though they were so high up in the sky. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53365.html",
      "state": "NC",
      "duration": "1/2 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b38",
      "summary": "5 bright flashing  lights hovering horizontally in Charlotte NC sky at night",
      "city": "charlotte",
      "shape": "formation",
      "date": "2008-02-14T00:00:00",
      "story": "5 bright flashing  lights hovering horizontally in Charlotte NC sky at night My husband, 7 year old son and I  were driving on I 77 Northbound towards I 85  around 7 pm (dark) and saw a bright light  in the dark sky, slightly larger than a close by helicopter would be. It was stationary so we thought it WAS a  police helicopter. Then it dawned on us that our police dept most likely doesn’t  own that many helicopters! They had flashing lights but were not flashing lights on the ground like police helicopters do when they are looking for someone etc. They just hovered ther and were very bright. As we merged onto I85 we saw 2 then 3, then 4 more similar objects/lights in the distance all what appeared to be exactly the same distance away from one another. We live in the city, at the end of a street  near a hospital ,with helicopters landing and taking off many times of the day and night, so we know what they look and sound like day and night.  We are also very familiar with the airports traffic patterns and what several airplanes coming in towards the airport on the horizon look like.  This was not like that. These objects hovered like helicopters had flashing lights of red gold and white all at the same altitude over the distance of about 10 miles altogether. As we drove down the road, (about 8-10 miles or so, we saw all of the lights remain where they were, but began to notice in between them were VERY small objects (tiny red lights) that travelled at very high speeds  between the brighter larger main objects. We stopped the car and witnessed several of these small objects travelling very fast in different directions.   Our son became worried because we were shocked and very interested to the point that we stopped the car, so we continued on to the grocery store and went inside.",
      "link": "http://www.nuforc.org/webreports/061/S61219.html",
      "state": "NC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ba5",
      "summary": "Moving Craft Overlooking Charlotte, NC",
      "city": "charlotte",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "Moving Craft Overlooking Charlotte, NC What we thought was a bright star started moving and then would stop from a long time (Sometimes 15 minutes) till it would move. It would move little by little and then at 3:45am it just got smaller and smaller till it just wasn't there anymore. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63707.html",
      "state": "NC",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c56",
      "summary": "((HOAX??)) I am actually a little freaked out that I am even in a position where I reporting something like this.",
      "city": "charlotte",
      "shape": "sphere",
      "date": "2007-04-27T00:00:00",
      "story": "I am actually a little freaked out that I am even in a position where I reporting something like this,  but I have nowhere to turn.  I have had an encounter with something not of this world.  I am a 21 year-old college student studying to become a teacher.  One night, about 1 a.m.,  I was returning home from studying late at the library.  I was suddenly forced off the road by a blowout.  I stopped the car and began to change the tire when suddenly my car radio started changing channels rapidly and the car lights began to flicker and dim.  All of a sudden everything just stopped, even my cell phone was off.  I could barley see anything as my eyes didn't have time to adjust to the darkness.  Across the road right at the tip of the tree line I saw a small orb-like object hovering and slowly changing color red, orange, yellow, green, and blue.  It hovered for about 15 seconds and then started moving rapidly in a square pattern around me, about 50 feet up for another 15 seconds. At this point, I remember feeling a warm paralyzing sensation through out my body. The next thing I remember is opening my eyes, and finding myself directly in front of the car tire with the tire iron in my hand.  The only difference was the time, it was 5:30 a.m. and starting to get light.  The spare was changed and leaning up against the car, I don't remember getting that far with the tire change.  I drove home in a state of shock and when I arrived in the house I went to the bathroom and looked in the mirror.  My right eye had a red mark on the outside corner; I had red marks in the back of my throat and soreness ((deleted)).  For the next 3 days, none of my body functions were operational, meaning I did not defecate or urinate for that period of time.  Usually, I am very regular.  Since that time I have not slept and my appetite has all but vanished.  My desire to study or do anything productive is gone. I am really scared that something has been done to me physically, or there is some underlying trauma that my mind is blocking out.  Please help me, I can't stop thinking about it, and I feel I am going crazy.  ((deleted/obscene)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  The obscenity included in this report, in its original form, makes us wonder whether it was intended as a serious report.  We include it here, nevertheless.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55879.html",
      "state": "NC",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e65",
      "summary": "Two lights in the sky as the sun came up",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2008-02-14T00:00:00",
      "story": "Two lights in the sky as the sun came up It was about 6:45 when I got off of the school bus then as I looked into the sky about SW i saw two lights in the sky. The objects were not moving. there was a big light then a smaller light wat sitting below the bigger light. As the sun came up I figured the light would go away if it was a star but as the sun came up the light got brighter. Then after about an hour the lights faded. I don't know exactly what it was but i was anything you normally see in the sky.",
      "link": "http://www.nuforc.org/webreports/061/S61340.html",
      "state": "NC",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ec4",
      "summary": "My first true UFO sighting!",
      "city": "charlotte",
      "shape": "circle",
      "date": "2008-03-31T00:00:00",
      "story": "My first true UFO sighting! After my co-worker called me on the nextel, I rushed outside to see what he was watching. From the time I step outdoors, I observed a circular object follow behind a passenger jet. This lasted for approximately 20-25 seconds before the object made a sudden 90 degree turn towards the south and raced off through a cloud formation and disappeared from my sight.",
      "link": "http://www.nuforc.org/webreports/062/S62272.html",
      "state": "NC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ed9",
      "summary": "Slow moving then became still light in the sky over Lake Wylie 01/03/07 5:30pm",
      "city": "charlotte",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Slow moving then became still light in the sky over Lake Wylie 01/03/07 5:30pm I saw a light over Lake Wylie just before sundown there were planes in the sky but none had their lights on.  It moved extremely slow south/southwest about 1/2 to 1 mile then stopped.  I could not have been a plane, I watched other planes fly passed and out of view.  What ever it was it was able to just sit.  I thought it could have been a reflection from the sun on the underbody of a plane but there were no such reflections on any planes that flew in and out of my sight.  Clearly the light was its own, weird.  Now that it is dark the sky is clear and there is no stars in the same spot. UFO",
      "link": "http://www.nuforc.org/webreports/054/S54387.html",
      "state": "NC",
      "duration": "30min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ec7",
      "summary": "Bright green light disappeared above Charlotte skyline.",
      "city": "charlotte",
      "shape": "light",
      "date": "2008-03-31T00:00:00",
      "story": "Bright green light disappeared above Charlotte skyline. My husband and I were driving towards Uptown on South Blvd.  Between the tops of two of the tallest buildings, we saw what looked like a huge bright green-glowing light.  It appeared much closer to the buildings, and we ruled out planes since there were a few flying overhead at the same time.  It suddenly arched up and to the left and just disappeared all within about 2-3 seconds.  We were wondering if anyone else saw this as well.  It was just about 8pm on Friday evening, March 21, 2008.",
      "link": "http://www.nuforc.org/webreports/062/S62287.html",
      "state": "NC",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ec3",
      "summary": "white circular object falls in behind commercial liner-middle of day",
      "city": "charlotte",
      "shape": "circle",
      "date": "2008-03-31T00:00:00",
      "story": "white circular object falls in behind commercial liner-middle of day standing outside facing east i was watching a plane approach that seemed to be heading west northwest towards charlotte douglas. as it approached my 1200 overhead position i noticed a white circular object on an intersecting course coming from the north towards south southwest. it appeared to be 1/2 the size of the commercial liner. for maybe 10secs i watched it approach, slow down, and fall in approx. 500 yards behind the plane. when this occurred-i grabbed my nextel and called my co-worker outside for a 2nd witness.  the dot sped up behind the plane and appeared to be persay weaving left/right behind the plane. my coworker saw the 2 from about 115degrees overhead to the 135degrees mark-at that point the object turned left(s.w.) and sped off. the plane continued on over charlotte douglas area. the sky was carolina blue clear with straight con/chemtrails creating borders here and there.  beautiful carolina day. height guess was prob. 28,000 to 30,000 feet.  this thing was at least 1/3 if not 1/2 the size of the plane with NO wings.",
      "link": "http://www.nuforc.org/webreports/062/S62271.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b74f9",
      "summary": "4 DOTS OF LIGHT AROUND MOON  MID MORNING TODAY",
      "city": "charlotte",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "4 DOTS OF LIGHT AROUND MOON  MID MORNING TODAY STANDING OUTSIDE MY WORK THIS MORNING @ 0945 I WAS LOOKING EAST AT THE MOON AND I NOTICED 4 STARLIKE LIGHTS IN THE SKY BORDERING AROUND THE MOON.  AT FIRST MYSELF AND ONE OF THE OFFICE LADIES DISCUSSED STARS, ECT. UNTIL ONE WENT OUT AND THE OTHERS APPEARED TO BE MOVING.  I WENT IN THE BLDG AND GOT MY BOSS AND HAD HIM COME OUT AND SEE FOR HIMSELF.  HE SAW THE THREE AND WATCHED THEM WITH ME FOR 10 MINUTES EASY.  THE LIGHTS WERE VERY STEADY AND THEY EVEN CROSSED AND PASSED EACH OTHER A FEW TIMES.  THEY SEEMED TO TRIANGULATE AND THEN PASS SLOWLY.  JUST DOTS OF LIGHT.  NOT STARS, NOR SATELLITES, AND DEFINATELY NOT PLANES.  I CALLED MY WIFE AT HOME ON THE OTHER SIDE OF TOWN AND SHE SAW THEM ALSO.  AT 1015 I HAD TO GO BACK INSIDE TO WORK AND WHEN I RETURNED AT 1025, THEY WERE GONE.  AT ARMS LENGTH THEY WERE IN A GROUPING 3\" BY 2\" AND WERE JUST BRIGHT DOTS.  VERY COOL BECAUSE MY BOSS AND AN OFFICE LADY SAW THEM WITH ME.  AND BY THE WAY, IT IS A BEAUTIFUL CAROLINA BLUE DAY WITH A FEW STRAIGHT CHEM/CONTRAILS OUT.  NO VISUAL OBSTRUCTIONS AT ALL.  WISH I HAD MY CAMCORDER!",
      "link": "http://www.nuforc.org/webreports/059/S59035.html",
      "state": "NC",
      "duration": "20MIN"
    },
    {
      "_id": "64d005f478aba2ec5a3b759c",
      "summary": "Weard light moving southeast of Charlotte, oval shape moving really slow",
      "city": "charlotte",
      "shape": "oval",
      "date": "2007-04-27T00:00:00",
      "story": "Weard light moving southeast of Charlotte, oval shape moving really slow,no sound or nothing, then picking up speed and disappearing in a blink of a eye!!",
      "link": "http://www.nuforc.org/webreports/056/S56164.html",
      "state": "NC",
      "duration": "6 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b776d",
      "summary": "2 BLACK OBJECTS SLOWLY TUMBLING ACROSS SKY PERFECTLY SPACED APART",
      "city": "charlotte",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "2 BLACK OBJECTS SLOWLY TUMBLING ACROSS SKY PERFECTLY SPACED APART MYSELF AND A CO-WORKER WERE STANDING ON THE DOCK @ MY JOB LOOKING WEST @ THE SETTING SUN WHEN I NOTICED 2 BLACK OBJECTS AT ABOUT 20,000 FEET SLOWLY MAKING THERE WAY FROM NORTHWEST TO SOUTHEAST.  WE OBSERVED A COMMERCIAL JET PASS ABOVE THEM AND THAT'S HOW I ESTIMATED THEIR DISTANCE.  MAYBE THE SIZE OF PENCIL TIP @ ARMS REACH, THEY STOOD OUT AGAINST THE CLEAR SKY.  IT WAS HARD TO TELL, BUT THEY APPEARED TO KEEP PERFECT DISTANCE(ONE SLIGHTLY HIGHER THAN THE OTHER) AND THEY SEEMED TO ALMOST TUMBLE AS THEY SLOWLY MOVED.  I WATCHED THEM TILL THEY WERE BACK OVER THE BUILDING OUT OF MY LINE OF SIGHT.  THEY WERE DEFINATELY NOT PLANES OR HELICOPTERS OF ANY KIND-JUST ROUND, BLACK, TUMBLING OBJECTS.  I SERVED IN THE US ARMY MILITARY POLICE CORPS AND HAVE BEEN TRAINED ON OBSERVING AERIAL OBJECTS.  HAVEN'T SEEN THESE BEFORE.",
      "link": "http://www.nuforc.org/webreports/053/S53390.html",
      "state": "NC",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b794f",
      "summary": "Saucer shaped object hovers then suddendly dissappears, only to reappear again",
      "city": "charlotte",
      "shape": "disk",
      "date": "2007-08-14T00:00:00",
      "story": "Saucer shaped object hovers then suddendly dissappears, only to reappear again The outside was dark, but you could see stars and the sky was clear.  An object was seen hovering about 2000 feet in the air from a distance.  The object was shaped as a \"saucer\" and was metallic looking. The saucer was on a tilt and moved around a little for about 10-15 seconds and then it suddenly jerked west and disappeared.  About 3 seconds later a rapidly blinking light appeared and started to move around.  It then started to depict a pattern and change it every 2 seconds as it moved at an extraordinary speed across the sky. The object moved in a non-uniform line and covered a large area in 15 seconds. I lost visibility as the object flew past trees that obstructed my view.  The night before at 2:00am there was also activity in the same area in the sky; however, it was much more distant than this occurrence.",
      "link": "http://www.nuforc.org/webreports/058/S58175.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b79c8",
      "summary": "UFO spotted over NC & SC.",
      "city": "charlotte",
      "shape": "other",
      "date": "2007-02-01T00:00:00",
      "story": "UFO spotted over NC & SC. Charlotte Observer, The (NC) January 26, 2007 Section: MAIN Edition: ONE-THREE Page: 1A     WHAT WAS THAT LIGHT IN THE SKY? UNKNOWN FREAKY ORB DREW EYES, IMAGINATIONS ACROSS AREA   Earthlings, you've had an otherworldly experience, a cosmic encounter.  About 8 p.m. Wednesday, something peculiar flashed in the sky - something twinkly, something colorful, something eye-catching. Something strange. And blue. Or green. Or blue-green.  \"Bright blue-green ball with a white tail,\" says one man from Shelby, who spotted it just west of Blacksburg, S.C., after dinner at a Steak House.  \"A greenish-like light low in the sky,\" says a woman, driving home from church with her kids near Matthews. \"We thought a small plane or helicopter was going to crash.\"  \"A slow-moving bluish glow,\" says a man from Polkton and who watched it while soaking in his hot tub.  \"Large, bright green ball,\" says another man, who was headed to Chick-fil-A in Gastonia with his wife and four children after church. \"Had a haze about it.\"  \"Almost looked like a flare,\" reports a lady, who was on Interstate 485. \"Kind of creepy.\"  Venus, perhaps? It's often a suspect in UFO sightings, particularly when it's as bright as it is right now.  Not Venus. It vanished beneath the horizon about 7 p.m.  Stricken plane?  Nope. All aircraft accounted for.  Space junk? Errant satellite?  Negative, says NORAD. No re-entries of the sizable man-made objects they track.  OK. So ... alien object?  Bingo. But not the E.T. variety.  \"A fireball,\" says the observatory director and astronomy professor at Appalachian State University in Boone.  Based on the reports, the director believes it was an unusually bright meteor that burned up about 30 miles high in the atmosphere somewhere above Charlotte. Sightings came from more than 100 miles away.  Many witnesses say the light appeared to fizzle at the end and break into pieces, making it a special kind of fireball called a bolide. In the universe of meteors, they're A-List entertainers, known for their splashy finales.  Each day, an estimated 4 billion meteors burn up in Earth's atmosphere. Most are the size of sand grains, but rocks tumble in, too. NASA estimates that the Earth packs on several tons a day in meteors.  Some witnesses who contacted the Observer on Thursday wondered whether it could be debris from the recent anti-satellite test by China.  Probably not - but maybe, says a spokesman for the North American Aerospace Defense Command near Colorado Springs, Colo., which tracks satellites and space junk - everything from lost screwdrivers to astronaut gloves. He says he's been getting an unusually high number of calls this week about things spotted in the sky.  China's satellite-zapping exercise has probably increased space litter by about a million pieces, making it nearly as untidy as Interstate 77 in Charlotte.  \"It's anybody's guess,\" the spokesman says, \"what direction this stuff has gone.\"",
      "link": "http://www.nuforc.org/webreports/055/S55058.html",
      "state": "NC",
      "duration": "About an hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a1d",
      "summary": "I thought it was a firework at first...then I realized it was too big and way too fast.  We live about 15 miles from airport....this wa",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2007-04-27T00:00:00",
      "story": "I thought it was a firework at first...then I realized it was too big and way too fast.  We live about 15 miles from airport....this was 20 times faster than anyplane I have ever seen (and I have seen a lot). Just a bright streak, but you could tell there was a mass at the front.  It was not like a shooting star. Probably a comet, but I swear it was in the atmosphere. The object made no sound ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56380.html",
      "state": "NC",
      "duration": "split second"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a88",
      "summary": "Very disturbing sight. Bright lights, tones of blue and white, and EXTREMELY loud rumbling noise.",
      "city": "charlotte",
      "shape": "circle",
      "date": "2007-03-08T00:00:00",
      "story": "Very disturbing sight.  Bright lights, tones of blue and white, and EXTREMELY loud rumbling noise. Passing EXTREMELY low in the sky, roaring type noise.  It was extremely bright with red, blue tones, and bright white lighted center. NOT AN AIRPLANE!",
      "link": "http://www.nuforc.org/webreports/055/S55472.html",
      "state": "NC",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ad5",
      "summary": "bizarre orange lights over south charlotte",
      "city": "charlotte",
      "shape": "light",
      "date": "2007-03-08T00:00:00",
      "story": "bizarre orange lights over south charlotte At least 4 witnesses observed very bizarre orange lights.  Random in timimg, certainly not weather related (it was raining.)  Event was caught on digital camera video.  The lights resembled explosions of orange light, but no sound accompanied the flashes.  I would estimate that we were anywhere from 2 to 5 miles from the brilliant flashes.  Their duration was only about two minutes, but as mentioned before there were at least 4 witnesses and the event was caught on camera.",
      "link": "http://www.nuforc.org/webreports/055/S55501.html",
      "state": "NC",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b9f",
      "summary": "BRIGHT LIGHT TRAVELING IN STRAIGHT LINE FROM HORIZON TO HORIZON",
      "city": "charlotte",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "BRIGHT LIGHT TRAVELING IN STRAIGHT LINE FROM HORIZON TO HORIZON I LIVE JUST NORTH OF CHARLOTTE-DOUGLAS INTL AIRPORT FOR ABOUT 5 YRS NOW AND AM VERY FAMILIAR WITH INCOMING,OUTGOING AND PASSING AIR TRAFFIC.  I WATCH ALL THE TIME.  LAST NIGHT MY WIFE AND I WATCHED A STEADY BRIGHT LIGHT, JUST BRIGHTER THAN THE BRIGHTEST STAR PASS OVERHEAD FROM NORTHEAST TO SOUTHWEST IN A PERFECTLY STRAIGHT LINE FROM HORIZON TO HORIZON.   IT WAS HARD TO TELL THE OVERALL HEIGHT OF THE OBJECT DUE TO DARKNESS-BUT IT WENT ACROSS THE SKY FASTER THAN ANY PLANES AND IT WAS DEFINATELY NOT A \"SHOOTING STAR\".   I CONCEED IT COULD HAVE BEEN A SATELITE, BUT I DON'T THINK SO DUE TO THE BRIGHTNESS AND SPEED.  JUST WANTED TO REPORT WHAT I SAW BECAUSE IT WAS UNUSUAL.  THANKS FOR THE SITE AND GREAT JOB YOU DO... ((NUFORC Note:  Satellites do not travel to the west.  We do not know what the witness observed.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52951.html",
      "state": "NC",
      "duration": "10 SECS"
    },
    {
      "_id": "64d005f478aba2ec5a3b7fb3",
      "summary": "Bright, spherical object flying over Charlotte, NC",
      "city": "charlotte",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "Bright, spherical object flying over Charlotte, NC I was outside in a small park called The Green, located at 400 South Tryon Street in the middle of downtown Charlotte, NC, when I witnessed a single sphere flying in the sky approximately three miles south of my location, and approximately 2000 feet high.  The object was round and either white or silver in color.  It was quite far away, and very small, but definitely visible as the sun was positioned in the northeast sky and so was reflecting very well off the object.  The sky was filled with lots of clouds, but with much blue sky in between.  The day was bright and quite windy. I first noticed the orb moving in a straight horizontal line across the sky from northwest to southeast.  Given the proximity to Charlotte Douglas International Airport we see airplanes in the sky all the time, and initially I assumed that was the case here.  But the object did not look like a plane, even from a distance.  It was definitely round.   Within one minute of my first noticing the object, it slowed, then came to a complete stop. It hovered for a moment, then slowly descended.  I can only guess at the distance of the descent, but it must have been at least a couple hundred feet.  It was a smooth, seemingly controlled, descent that took less than one minute. The object hovered again for a couple of minutes.  It was not entirely stationary, rather it moved around a little bit, perhaps just moving with the wind.  It was very windy on the ground, so it was probably even more so up in the sky where the object was.  Even so, all of the movement I saw seemed very controlled and stable, not as though it were just a balloon being blown around. After this, the object started rising.  It rose back to its original height, in a mostly straight line, but now it was also moving south - away from me.  The object continued to rise while moving south for about 2 more minutes until I lost sight of it. The obvious conclusion is that this was just a balloon being driven by strong winds. And it may have been.  But the object was very visible even though it was very small and far away.   Perhaps a mylar balloon would have this effect, especially with the sun being opposite in the sky.  But given the distance it was from me, I really think the object was much larger than a balloon otherwise I would never have been able to see it. Also, the movements seemed very controlled; it was not being whipped about.  It's path may have been affected by the wind, but given that it initially was going in a straight line, slowed, stopped, descended, stopped then ascended in a uniform manner it just did not at all appear to be a balloon.",
      "link": "http://www.nuforc.org/webreports/072/S72025.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b81bf",
      "summary": "Faint chevron-shaped object over Charlotte, NC",
      "city": "charlotte",
      "shape": "chevron",
      "date": "2009-12-12T00:00:00",
      "story": "Faint chevron-shaped object over Charlotte, NC (09/13/2009, apx. 5 AM)  I was standing in front of my house.  Looking to the east, I saw what appeared to be sort of a bow or boomerang shape (135 degree angle) about two or three inches from tip to tip \"visual size\".  It was dim, perhaps transparent; I could barely make it out.  I just noticed the movement - it would have been easy to miss.  It did not have any details or color I could make out.  My impression was that it was anywhere from a few feet from tip to tip to maybe 10 feet.  It seemed to be around 50 to 100 ft. away, moving 10-20 mph.  The bow center or angle corner was the front.  It moved silently in a straight line towards the south or southeast.  It went behind the trees, and I didn't see it again after that.  The total duration of the sighting was about five seconds. I will admit that what I saw could have very well been an owl or something (or even a trick of the eyes, e.g. a \"floater\"), but I cannot be certain, so I thought it would not hurt to report it, especially since I witnessed a very similar phenomena a year or two earlier.",
      "link": "http://www.nuforc.org/webreports/072/S72298.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b83f8",
      "summary": "I witnessed a rapid moving and stopping light in the sky.",
      "city": "charlotte",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "I witnessed a rapid moving and stopping light in the sky. I was walking my dog early, before sunrise, and saw this thing that looked like a star suddenly bolt down towards the treetops and stop.  It then suddenly bolted back out into space (I assume) at a slight angle.  I remember the constellation Orion was in the West-southwest sky.   I can't imagine any technology on this earth that could do what I saw, except on a smaller scale, flicking a laserpointer at a dark wall. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70643.html",
      "state": "NC",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8678",
      "summary": "small roving light turns to two, then comes toward us and changes size and color again.",
      "city": "charlotte",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "small roving light turns to two, then comes toward us and changes size and color again. I saw from my back porch what I thought was a pen light going back and forth over my 6ft privacy fence from my kids slide to the end of the swing set, back and forth about 8 ft in a sweeping motion.  Thinking it was kids scoping out the yard/house for something to steal I sent my rotti out who did not react at all. Then the one sweeping light became two that were perfectly parallel and coming forward towards the house. I then thought it was intentional, and having an X with a restraining order, I thought for a moment he had someone out there and ducked under a glass table, that’s when the two parallel lights, about 10 ft off the ground, moving towards the house, went from a pinpoint white light, to a yellow silver dollar sized light, and I said, “ nothing does that, nothing moves parallel like that and comes at you!” my friend ran out and said, “there is nothing behind it!” I think meaning a light source. Still, my dog who goes off at squirrels, was not at all alarmed, and h! e’s 70% blind. There was no sound.  But the two yellow lights came about 20 ft into my fence line, and when my friend got to where it was, it just stopped and was gone.  We got a mag light and looked behind the fence for footprints, but there were dead tree limbs I threw out a week ago, that obstructed the path and there were no broken limbs, even on dried, dead limbs.  There was no way for someone to stand near my fence and with the dramatic angle behind my house for someone to shine any light up my 20 degree angled yard without being at the fence line aiming up.    There was no sound and my dog never reacted as if anything was out there. It was the most amazing and unexplainable thing I’ve ever witnessed.",
      "link": "http://www.nuforc.org/webreports/072/S72865.html",
      "state": "NC",
      "duration": "2-5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a18",
      "summary": "Hot UFO spot in Charlotte NC",
      "city": "charlotte",
      "shape": "oval",
      "date": "2010-02-14T00:00:00",
      "story": "Hot UFO spot in Charlotte NC This report is to inform people in an area that they are in a hot spot for UFO activity.  The area is in a 2 to 3 mile radius of North Carolina University of Charlotte where Interstate 485 belt highway and interstate 85 intersect.  First sitting was 2 or 3 years ago 4:00 AM while traveling within 1 mile or less I observed 3 perfectly round objects glowing extremely bright, almost to the point of blinding me.  They were motionless and hovering about 10 feet directly over the rooftops of houses.  At first glance I thought they were streetlights.  But they were way to high and large.  I pass this area every morning and have never seen thing that looked like that. Sitting number 2, about three weeks ago I was coming home and had just traveled through the interchange from Interstate 85 going north unto Interstate belt road 485 going south and it was raining heavily and something catch my eye, it was dark in color, looked like a tube 10 ft. wide and 40ft. long, a cylinder shaped and turned vertical, like a barrel flowing in sky, but this was glowing at the bottom end, very strange.  I flipped my eyes back to the highway not wanting to cause or be in an auto accident.  I believe this area is a hot spot for UFO activity. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73801.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e44",
      "summary": "Large dark gray rectangle hovering in northern sky",
      "city": "charlotte",
      "shape": "rectangle",
      "date": "2008-10-31T00:00:00",
      "story": "Large dark gray rectangle hovering in northern sky I was on NC 51 at around 10:00 heading into Mint Hill, when I looked out the window and saw the craft on the horizon to the north. The craft did not appear to be moving. I initially thought it could have been a banner of some sort, but after stopping the car and observing for a few minutes, it was obvious this was not the case. First, the craft was much too large to be pulled by a plane and had no text or picture of any kind. It was a flat dark gray color. From it's position relative to mine and the apparent size in the sky, it appeared to be much larger than an airliner. I drove down Lawyers Road toward NC 27 to get a closer look at the object as it appeared to drift westward. I did not seem to be getting any closer to the craft as it was still a considerable distance away when I got to NC 27. I turned around and returned to Mint Hill and was unable to see the craft once I had stopped again. About 15-20 minutes later, I was outdoors again and looked to the north to see if the craft was visible. The craft was emerging from behind a cloud on the horizon, which gave good indication of it's distance. There were very few clouds in the sky. The craft appeared much smaller, probably further away. It was drifting westward once again and disappeared behind the trees.",
      "link": "http://www.nuforc.org/webreports/065/S65664.html",
      "state": "NC",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8eaf",
      "summary": "2 red glowing lights in the distant sky moved left to right matching speed slowly until disappearing after 2 minutes.",
      "city": "charlotte",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "2 red glowing lights in the distant sky moved left to right matching speed slowly until disappearing after 2 minutes. I was playing tennis at night with my wife on the Fourth of July, when my wife guided my attention behind me to the pitch-black  Northwestern sky.  Fireworks were going off in the distant western sky far from the 2 red pinkish glowing lights that were moving slowly from Northwest to North. I watched for a moment and realized they weren't anything I’ve seen before. We moved away from the court so that we could get out from under the overhead lights and get a better view. I'm 38 and have seen planes, helicopters, flares etc. and the glow that came from these objects was unlike anything I'd seen. The moon was in the opposite southeastern part of the sky. The objects seemed to move at the same speed in a straight line for a minute then hovered for approximately 20 seconds then continued moving simultaneously together. I was blocks from a camera so I decided to just watch it. After a minute and a half the light following disappeared either going suddenly beyond sight or just fading. Then another thirty seconds passed and the last one faded. The entire event lasted approximately 2 and a-half minutes. I’ve never seen a UFO or have any need to make crap up. It maybe explainable but I felt compelled to report it.",
      "link": "http://www.nuforc.org/webreports/070/S70855.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b90bc",
      "summary": "Long silver obgect, no noise or sound, floating.",
      "city": "charlotte",
      "shape": "cylinder",
      "date": "",
      "story": "Long silver object, no noise or sound, floating Across the road from my house is an old junk yard where old cars are mashed and taken away well this day I saw a long silver thing floating about five feet off the ground and there was no noise or sounds at all,I heard some people coming out of the old store and I glanced at them when I looked back the silver thing had left in a flash and still no noise, It could be seen far away to the north several miles away.  Have not seen any thing like this since ((NUFORC Note:  No date provided by witness.  PD))",
      "link": "http://www.nuforc.org/webreports/028/S28403.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9dd2",
      "summary": "Weird object goes across sky and boards a sationary object.  ((NUFORC Note:  Student report.  PD))",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2010-02-14T00:00:00",
      "story": "Weird object goes across sky and boards a sationary object Saw a dim light travel across the sky it wasn't emoting any lights or anything just a steady yellowish white.  I first noticed it left of the constelation cassiopeia so I watched it for a few seconds about thirty then it colilded with  another dim object but no exsplosion it was like it boreded a mothership or something.  the object that was stationary was located between the stars caph and errai and I thought at first it was a satelite.  Once I located the stationary object with a telescope it was rectangular in shape and gave off a faint glow. ((NUFORC Note:  Student report.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74215.html",
      "state": "NC",
      "duration": "20:30-20:31"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f17",
      "summary": "UFO seen over NASCAR race in Charlotte, NC - Memorial Day weekend - May 25, 2008",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2008-07-05T00:00:00",
      "story": "UFO seen over NASCAR race in Charlotte, NC - Memorial Day weekend - May 25, 2008 Seen during Memorial Day Weekend NASCAR Race in Charlotte.  UFO visible during military air show before race.  Several people around me watched the UFO for several minutes, as it hovered in and around a cloud.   It was definitely not a helicopter, plane, or balloon. It was black, round in shape, but I couldn't tell if it was round, egg, or disc shaped because of the way it hovered and darted in and out of the cloud.  We had gone down to the track to attend the drivers meeting and to stand in line to shake hands with drivers after they were introduced.  No cameras were allowed in the driver's meeting, so we had left them in the window box seat room, so unfortunately I wasn't able to capture a photo.  It seemed to be watching the military aircraft show going on at the racetrack, which was really impressive.",
      "link": "http://www.nuforc.org/webreports/063/S63970.html",
      "state": "NC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9f99",
      "summary": "2 White Oval Balls moving across Charlotte NC sky",
      "city": "charlotte",
      "shape": "oval",
      "date": "2010-05-12T00:00:00",
      "story": "2 White Oval Balls moving across Charlotte NC sky While @ Work... I went outside @ 1227 for a Smoke-Break.  As I was standing there facing NorthWest I noticed an small odd cloud sitting @ about a 50 degree angle from where I was and @ my 1100. I looked down, then back up and the cloud was gone. In it's place was a small white oval looking ball.  The sky was clear Carolina Blue so it was obvious. I immediately pulled out my Nextel and got a Co-Worker outside to see it too.  We watched it sit still in the sky kind of morphing shape for roughly 3-4 minutes and then it started easing slowly East.  Right then, my Boss drove up and started watching it also. Just before the Sighting ended, I noticed another Ball just East of the 1st one. After maybe 20 Seconds, they both just Vanished. You could see them kind of Fade Out of sight. Not due to distance, they just Faded out. I watched them Fade in/out a few times before finally disappearing. I am the Gen. Mgr for a Logistics Co. in Charlotte and have had Military Experience. I am an avid plane spotter and ALWAYS watching the skies. Lastly, as an observational note. The objects were hard to see without my Polarized Sunglasses. I kept pulling them off and passing them around so everyone could get a clear view. Had I not had my Glasses, I probably would have never noticed either object.",
      "link": "http://www.nuforc.org/webreports/075/S75325.html",
      "state": "NC",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba040",
      "summary": "Distant light became bright and then dim and then slowly moved to the South.",
      "city": "charlotte",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "Distant light became bright and then dim and then slowly moved to the South. In the high eastern sky saw a star that suddenly became brighter and brighter and then became dim again.  It then began to slowly move south and away until it completely disappeared.  The space Station is not viewable here in this date so it isn't that.",
      "link": "http://www.nuforc.org/webreports/075/S75345.html",
      "state": "NC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5f8",
      "summary": "Strange lights over the highway not a plane or helicopter.",
      "city": "charlotte",
      "shape": "other",
      "date": "2008-10-31T00:00:00",
      "story": "Strange lights over the highway not a plane or Helicopter   When driving home on hgwy 485 heading north I noticed 2 lights that were not moving or moving very slowly as I got closer I noticed that one was lighted up with about 5-6 lights that where in a striaght line east to west none flashing and all white no tail or nose to it ,just stright the second was the same shape but their where only 2 lights on and it was about few yards higher and to my left facing it I did open my window and slowed down to see it but it dindt help I did not here any noise.",
      "link": "http://www.nuforc.org/webreports/066/S66390.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba772",
      "summary": "Bright White/Chrome Cylinder against Carolina Blue clear sky.",
      "city": "charlotte",
      "shape": "cylinder",
      "date": "2009-04-14T00:00:00",
      "story": "Bright White/Chrome Cylinder against Carolina Blue clear sky. I stepped outside for some air and right there when I looked up was a White/Chrome Cylinder up in the air.  It was just North of where i was and it was at least 30,000 ft up and that guess is based off commercial air traffic that was passing through.  It could have been higher up, but I couldn't determine the size of it to gauge height. It was slowly moving from North to South and either Spinning or Wobbling.  Definitely was a Cylinder shape, and standing straight on end. After 30 Seconds of watching it it move about 14inches across sky in about 3 seconds. (Both Arms Extended Pointing, the Distance Between)  That put it @ my 1200 slightly West of me.   I ran inside and got a Co-worker to come and look.  When we returned it was still moving South and at about my 1100.  A Commercial Liner was passing by it when we returned.  Within 4 inches @ arms length, the Liner appeared roughly 30,000-40,000.  The Cylinder was about 1/3 the size of the Plane.  It continued to move South Wobbling or Spinning, it just looked slightly distorted.  It finally stopped @ our 1000 and just kind of stayed there, stopped for 20 Seconds or so, as 2 other Commercial Liners passed close by.  Then it just started slowly Wobbling/Spinning Due East.  It seemed to Fade in and Out when it was moving, but it was perfectly visible when still.   It eventually just disappeared.   Total Sighting time-6 minutes-0812 to 0818-it was a Clear Blue Sky with a little haze way off to our south.",
      "link": "http://www.nuforc.org/webreports/069/S69588.html",
      "state": "NC",
      "duration": "about 6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba771",
      "summary": "Rotating Cylindrical object passes overhead.",
      "city": "charlotte",
      "shape": "cylinder",
      "date": "2009-04-14T00:00:00",
      "story": "Rotating Cylindrical object passes overhead. While at work, my partner stepped outside to take a break.  Approx. 5 min. later in ran in and asked me to come outside.   When i stepped out onto the porch, he pointed to a Silver or White cylinder shaped object in the sky just North of our location moving at approx. 20 knots to the South.  Judging the altitude to be about 30-40,000 feet based on several passenger planes that were flying over at the time.  (I am not a big UFO watcher and somewhat skeptical, but todays sighting for me was the FIRST time I clearly saw an object that I knew wasn't a typical aircraft and for all intent and purposes shouldn't have been able to do what it did.)  While watching the cylinder, it continued South in a counter clockwise rotation or woble until turning East and then disappearing after about another minute.",
      "link": "http://www.nuforc.org/webreports/069/S69594.html",
      "state": "NC",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba811",
      "summary": "Stars moved as group, not airplane.",
      "city": "charlotte",
      "shape": "cross",
      "date": "2008-10-31T00:00:00",
      "story": "Stars moved as group, not airplane. I am watching it right now.  My wife is asleep.  As in the neighborhood.  It looked like far away stars.  And I thought, wow what a pretty constellation, I wonder why I never saw that before.  Then they started slowly moving in different directions. The stars or lights would swirl slightly chaning from 4-7 stars.  The positions would change of each individual light, as well as a together as a whole.   It moved very slowly and not in a straight line.  It would meander in the same area, but definetly move across the sky.",
      "link": "http://www.nuforc.org/webreports/066/S66515.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baad1",
      "summary": "I was traveling in Charlotte, NC south bound on I 485 in between the Northlake mall exit and HWY 16 exit. I saw what appeared to be an",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "I was traveling in Charlotte, NC south bound on I 485 in between the Northlake mall exit and HWY 16 exit. I saw what appeared to be an airplane fall strait down from the sky about 4 mile's in front of me. As I traveled closer I realized that it had fallen in or around Mountain Island lake.  This object appeared to be an airplane because it had blue, red and white flashing lights.  However I was unable to determine the shape. Several motorist were pulled over near hwy 16 exit for Mountain Island lake and more on down.  There seems to be several wittiness.  Nothing on the news.  Also there were several aircraft in the area. One appeared to be following it at the time it went down. 9/13/10  12:31 or 9:31 PM",
      "link": "http://www.nuforc.org/webreports/077/S77808.html",
      "state": "NC",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bac8e",
      "summary": "Silver to turquise in color size of a car near charlotte motor speed way.",
      "city": "charlotte",
      "shape": "cigar",
      "date": "2010-11-21T00:00:00",
      "story": "Silver to turquise in color size of a car near charlotte motor speed way. Clear sky no clouds. was not moving hovered then vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78395.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bad67",
      "summary": "5 pulsating lights above Charlotte, NC",
      "city": "charlotte",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "5 pulsating lights above Charlotte, NC One October night I was walking from the parking lot outside my mother's apartment building, to her apartment.  At night, I like to look at the stars and constellations.  I looked up as usual, and saw about 5 lights in a straight diagonal line.   I am not an expert at constellations, or the stars, but I know these were not stars.  I commonly view about 5 planes every night and the sky, but these objects were not moving, but in fact, pulsating.  I have not seen these lights since. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79429.html",
      "state": "NC",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad8e",
      "summary": "3 lights in a row, red mix then dim white",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2011-01-05T00:00:00",
      "story": "3 lights in a row, red mix then dim white 3 lights in a row that flashed red/blue mix then a dim white going at an incredible speed.   I couldnt tell what shape it was, no clouds or bad weather outside and it still had no figure. i watched it the whole time and it just dissapeared after 15 seconds ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79231.html",
      "state": "NC",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb689",
      "summary": "saw a group of bright orange (30) lights moving from east to south",
      "city": "charlotte",
      "shape": "formation",
      "date": "2010-11-21T00:00:00",
      "story": "I had went to the store to buy something.  Coming back into the APT complex i turned East and saw a group of bright orange (30) lights moving from east to south.  Cruising at a speed and altitude of an airplane slowly disappearing in the night sky one by one.",
      "link": "http://www.nuforc.org/webreports/078/S78982.html",
      "state": "NC",
      "duration": "7.00 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb68a",
      "summary": "Reddish orange and yellow little circle not blinking but moving in slowish motion than disappearing into thin air.",
      "city": "charlotte",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "Looked like fire works at about 10:20pm near the west of oryan's belt.   Redish orange and yellow little circle not blinking but moving in slowish motion than disappearing into thin air. ((NUFORC Note:  We received several reports of this event, and local television news stations received reports, as well.  We do not know what the orange lights were.  Some observers reported that there were an estimate 30 orange lights in the cluster.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78983.html",
      "state": "NC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb6fc",
      "summary": "A red  Sphere Followed my car , then vanished the minute it was  noticed.Then car turned  back on.",
      "city": "charlotte",
      "shape": "sphere",
      "date": "2010-07-19T00:00:00",
      "story": "A red  sphere followed my car, then vanished the minute it was noticed.  Then car turned  back on. Husband was driving home at night.  He got just outside town, when his car shut off.  He said he saw a red light just behind the car, but it was moving strangly.  He saw it for a split minute, when it just vanished.   There were no other cars on the road, and there was no roads leading either direction for it to have gone off the road.   We have always seen things at our ranch in Charlotte. Neighbors have also seen the same things. There is always a diffrent experience each time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Date may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76530.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bbcd9",
      "summary": "Strange balls of light in the sky",
      "city": "charlotte",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "Strange balls of light in the sky On this particular incident, me and my sister were outside on my balcony in South Charlotte, NC.  I happened to be telling her that she should observe what goes on in the sky at night.  The skies were clear and we could see the stars very well.  I have on two other occasions, in Virginia Beach, have witnessed an incident of a ball of light that I could not explain what it was.  While staring over the night sky, I noticed a light, that was, it seemed to me was trying to disguise itself as a star.  It was like at first glance it looked like a star but after staring at it, I could tell that it was not outside of this atmosphere.  Then it started to move.  It moved horizontally thru the sky, It was completely silent.  It was far away.  We lived in an area that was in a busy flight/landing path of the Charlotte Douglas Airport. There was not a flashing light on this object as airplanes have.  As it moved, it was on a horizontal glide and trailing it was a faint t! rial of light.  It definately was not exhauaust from a plane that will linger after the plane passes.  This light was like a smear behind this object that was flying.  There was no 'exhaust' trail left behind. The further it traveled across the sky, the dimmer the light was.  I have seen many shooting stars and meteor showers and cannot compare this object to what I saw.  I know that it was not ordinary because my sister was becoming uncomfortable looking at it. This object was not a sudden fade like a shooting star...This was a calculated, dimming of the light that I had witnessed before. The very first time I had seen something like this was at my home in Virginia Beach, VA...Right near the Chesapeake border.  I have always liked looking up at the stars and one day I stepped out of my house to smoke a cigarette and while waiting for my sister to come outside, I looked straight up.  That is when I saw a star that was very bright but it has a dull yellowish tint to the light....it was not pure white light like a star...but it looked like a star.  I stared at this object for about a minute and then it started to move. First a slow sway back and forth then it started raising it's elevation.  Even though it did not look like the size was shrinking siginficantly I could tell that the swaying was moving away from me.  For about 30 seconds, this object swayed back and forth like a metronome and as it swayed the ligth gradually got fainter and fainter until it was completely gone.  There was no noise and I know that this object was not a plane or a helicopter. After that, also in Virginia at the same home, I went outside on the porch again to smoke a cigarette.  This time it was right about when the sun was going down.  The sun would set behind my home and it was down far enough that the only thing that was lit was the sky.  The shadows from the house and trees were at their max 'stretch'.  I looked over to my right at the sky.  Some stars were already visible.  I saw this one star that was unusually bright that I know was not the North Star.  It just seemed like it was out of place. We lived in this home for almost 30 years and I had never noticed a star that bright in that area of the sky at that time of the day before.   While staring at this object after about two minutes, I noticed that it was moving...back and forth...It was almost like it moved becuase I wouldn't stop staring at it.  The way that it moved back and forth, made me feel like it was staring at me too.  There was no noise and this light was a perfect sphere.  It ! didn't twinkle like other stars.  As it moved back and forth, I could clearly see that it was raising its elevation and that same trail of light was following it. The higher it climbed, the dimmer it got, still bouncing back and forth until it completely disappeared.  That took about a minute or two from the time that it started moving for it to fade completely out and when the light was completely gone, there was nothing that made me think it was a plane or chopper or any other man-made vehicle.  It is disturbing that I have had three incidents that I have seen an object flying in the sky that I could not identify.  I am originally from Virginia Beach and this is a highly active military area w/ airforce bases and naval bases nearby.  I am not a stranger to seeling military planes and have also seen a stealth bomber fly by...  These objects were not planes. Hopefully this information will be helpful to you in your research.  One thing that resignated with me from watching programs about UFO's is that if there is a race of anything in outer space that has the capability to make it to our planet, how so far we are behind in their technology as we cannot get a human past the moon. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85627.html",
      "state": "NC",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfa1",
      "summary": "Two orange orbs flying NW to SE over Douglas Int. Airport.",
      "city": "charlotte",
      "shape": "formation",
      "date": "2011-12-12T00:00:00",
      "story": "Two orange orbs flying NW to SE over Douglas Int. Airport. While getting ready to go home after ending my shift around 4:30 am at the Douglas International Airport in Charlotte, NC,  I saw two Orange orbs flying side by side from the NW to the SE they appear to not be flying very high,    It was a very night clear with no clouds, there was no sound coming from them but they were flying right above the airport then they start to zig zag between each other and coming back side by side until they vanish.  When I saw the first zig zag  between them I call one of my coworkers and we look at them until, as said before the vanish.",
      "link": "http://www.nuforc.org/webreports/085/S85115.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3a1",
      "summary": "Orange colored super fast object",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2011-12-12T00:00:00",
      "story": "Orange colored super fast object Initially i thought it was a shooting star but it was an orange colored object (it felt like fire), the object was traveling quite fast (faster than anything i saw flying in the sky).  I could see it for 2 to 3 seconds before i lost it in the buildings.  It felt like it was heading down to earth.",
      "link": "http://www.nuforc.org/webreports/085/S85510.html",
      "state": "NC",
      "duration": "2-3 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc556",
      "summary": "3 Glowing Orbs glide across the night sky in triangle shape.",
      "city": "charlotte",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "3 Glowing Orbs glide across the night sky in triangle shape. Friday, January 6th, 2012 Charlotte, NC 28209  \t A group of friends and I were playing a game of night Frisbee at the local middle school.  At approximately 9:15 pm someone shouted, \"Look up at the sky!\"  We all shifted out attention to the clear dark sky, where 3 balls of white light were swiftly gliding in perfect unison.  Even more bizarre, was how these foreign balls of light moved.  Not only did they glide with a solid white glow, (didn't flash like an airplane), they moved in a perfectly symmetrical equilateral triangle shape.  One light guided the other two across the sky, all of which appeared to be the exact same distance from one another, forming three perfect 45 degree angles. We were all dumbstruck by the phenomenon and attempted to make sense of it while continuing to admire its beauty.  Each of us announced our individual ideas in hopes of deriving a logical explanation for the triangles existence, whilst smothering the immediate idea that lingered in all of our hearts - could it be a UFO? \tPerhaps it just seemed too unlikely for us to be blessed enough to actually witness, first-hand, a true UFO sighting.  I remember watching the lights glide across the sky and debating whether or not to take a picture from my phone, not wanting to appear juvenile, I decided against it. After watching the lights glide for approximately one minute, the rear two lights began to reduce their distance apart from each other making the guiding light's angle (Far Right) more acute and the other two light's angles more obtuse (Left & Center).  The possibility that their paths were not predetermined by the front light (Far Right) began to cross our minds.  However, surely enough the rear lights settled into their new position and the three glowing lights maintained there new triangular shape and continued to travel across the night sky, once again, in perfect unison.  This proceeded for approximately 30 seconds.  Then, the far left light suddenly vanished from sight. The group burst into uproar, attempting to decipher the cause of the disappearance.  The consensus from the other witnesses was that it must have disappeared behind some clouds.  However, I was not convinced for two reasons. First, the sky appeared completely absent of clouds, no reflection from the moons glow indicated any cloudy haze whatsoever.  Secondly, even if it did disappear behind the clouds, eventually it would have reappeared - it never did. Approximately 15-20 seconds after the far left glow disappeared from sight, the front guiding light also disappeared (Far Right).  Leaving the last light to dwindle for approximately 20 seconds until it, too, disappeared.   The lights never revealed themselves to us again. One day later, a friend of ours who was at a neighboring mall the night of the occurrence, approximately 3-4 miles a way from our sighting, also saw the glowing orbs in the sky that night.  He took a picture of his findings and sent it to us; it is the image that I have sent you. I researched the phenomenon somewhat and have found other sightings of these glowing orbs in the North Carolina area.  I hope that my story proved interesting, feel free to contact me about any questions you might have.",
      "link": "http://www.nuforc.org/webreports/086/S86454.html",
      "state": "NC",
      "duration": "1-2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc74f",
      "summary": "Fluorescent green teardrop fireball falling to earth.",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2011-12-12T00:00:00",
      "story": "Fluoresent green teardrop fireball falling to earth larger traveling north to west at a 45 degree estimated angle. It looked like it was crashing because I know how they can maneuver.   I see ufo’s all the time disappearing and reappearing in different locations in all spectrums of colors but this was different this was so close.  I’ve seen meteor showers they are bluish to bluish white and large.  Shooting stars (meteorites) are distant smaller this was not a normal It was a flaming fluorescent green fireball teardrop shaped about the length  of an average full moon or larger and thick width wise with no sound absolutly silent.  I wanted to be an astronomer  all my spare time goes into exploring my little area of sky  I know what is normal and what isn’t.  if you want to talk you know my number  North carolinia",
      "link": "http://www.nuforc.org/webreports/085/S85752.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc828",
      "summary": "On December 14th I was outside walking around my neighborhood with a friend of mine. Out of the corner of my eye, I saw a white circle",
      "city": "charlotte",
      "shape": "sphere",
      "date": "2011-12-17T00:00:00",
      "story": "On December 14th I was outside walking around my neighborhood with a friend of mine.  Out of the corner of my eye, I saw a white circle quickly flying across the sky.  It was enormous, at least 1.5 times the size of the moon.  It was a circle and was completely white.   It zoomed from behind me and went about 3/4ths of the way across the horizon before completely disappearing.  I asked my friend if he saw it and he had not.  I just assumed it was my imagination then and forgot about it.   About half an hour later, I was sitting on a bench by myself listening to some music and gazing at the stars when I noticed a huge blue circle zoom across the sky.  It had a blue edge to it with a black center with what looked like blue electric bolts connecting in the center of it.  It was massive and like the first, disappeared about three quarters of the way across the horizon before entirely vanishing.  Stupified, I stared at the sky for the next half hour when I saw a shooting sta! r, so I know what that looks like, so I am positive I did not confuse the two.  Picture of the second one is posted below.  It was the one that I saw perfectly clear.",
      "link": "http://www.nuforc.org/webreports/085/S85865.html",
      "state": "NC",
      "duration": "2.5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8fa",
      "summary": "a circular object with colored lights, moving at medium speed with a swoosh sound but no motor sound",
      "city": "charlotte",
      "shape": "circle",
      "date": "2011-08-21T00:00:00",
      "story": "a circular object with colored lights, moving at medium speed with a swoosh sound but no motor sound On Friday, August 12, 2011, about 8:45, my grandson and his friend sighted an object in the early evening sky.   In the east, I saw an object with colored lights, about three times larger than a star.  It was circular in shape, with blue, red, green and white lights.  It moved across the sky at about the speed of a nearby plane or helicopter.  It made a \"swoosh\" sound, but no motor sounds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83152.html",
      "state": "NC",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc921",
      "summary": "Yellow/orange cigar shaped object over Charlotte, NC",
      "city": "charlotte",
      "shape": "cigar",
      "date": "2011-10-25T00:00:00",
      "story": "Yellow/orange cigar shaped object over Charlotte, NC I was not sure what I was seeing.  The object was cigar shaped, yellow and orange in color with a short white tail.  At first I thought that someone had shot off a firework, but I didn't hear the whoosh sound which typically precedes flight.  I watched it travel in a a fast, horizontal trajectory, no sound at all.  I then lost it as it passed over a grove of trees. This observance was at 7:25 pm in Charlotte, NC.  It was a very clear dark evening and I know that it was not s shooting star as it was very bright.  I was the only one in my family to see it and unfortunately did not have a digital camera at the time.  Very strange.",
      "link": "http://www.nuforc.org/webreports/084/S84787.html",
      "state": "NC",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9c3",
      "summary": "me and my friends were at a youth rock concert and we saw 2 to 4 cross shaped craft hover over the football field. I am pretty sure tha",
      "city": "charlotte",
      "shape": "cross",
      "date": "2011-07-17T00:00:00",
      "story": "me and my friends were at a youth rock concert and we saw 2 to 4 cross shaped craft hover over the football field.   I am pretty sure that i saw 1 of the craft split away from the group and touch down ten or so miles away.  I didn't have a camera on me so all I could do was wait and watch.  I know it wasn't an airplane because the craft just stopped for a minute and then just stopped. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82335.html",
      "state": "NC",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc80",
      "summary": "A couple dozen orange lights traveling against the wind.  ((NUFORC Note:  Very reliable and convincing  witness.  PD))",
      "city": "charlotte",
      "shape": "light",
      "date": "2011-07-04T00:00:00",
      "story": "A couple dozen orange lights traveling against the wind Around 3 am Eastern time I happened to notice 3 orange circular lights traveling North by Northwest.  I was looking South when I saw them and the speed and trajectory they were traveling was consistent with a commercial jet.  These lights were not blinking or fading and they were roughly 4 or 5 times the size and brightness as the largest visible planet.  They were close to being in a straight line, made no noise whatsoever, and left no trail.  Had they left a trail, I would have guessed they were meteors. At the time I was with 2 friends who also saw the objects and thought them to be odd enough to quickly call their wives outside to check them out before they disappeared over the horizon.  It was then that one of the wives exclaimed there were more coming, and sure enough 3 or 4 more appeared from behind the treeline and followed the same path at the same speed.  More kept coming in random intervals for the next couple minutes, sometimes only 2 at a time, sometimes up to 5.  There were no patterns I could discern except for a couple groups seemingly forming a perfect triangle.  There were about a couple dozen total over the course of 3 or 4 minutes.  We managed to get videos on cell phone cameras, but they are what you would expect from filming with such a device against a dark sky. We were amazed and baffled to the point that we called 911.  While we admitted to the officer who came out that we felt a little silly calling and that we had been drinking all night, we felt a burning need to let authorities know what we had seen. I checked wind direction for that time frame, and it was blowing South at 5 mph which pretty much discounts the possibility of chinese lanterns or flares.  I have absolutely no clue what these things could have been, and I feel very fortunate that I had friends with me to witness this.  We are all in our 30s and have careers in retail, insurance and teaching.  I am sharing this experience in the hopes that someone else saw these and can possibly explain what they were.  The random formations discount (to me) the possiblility of military aircraft, the wind direction rules out lanterns or flares, it was a clear night so they weren't reflections, and no trails tell me they weren't meteors.   Absolutely unexplainable, and the quantity made it somewhat of a scary experience.   For a brief time I wasn't sure if they would stop coming. ((NUFORC Note:  We spoke via telephone with this witness.  We found him to be exceptionally objective about the sighting, and he seemed to us to be quite eloquent and sober-minded.  We suspect that he is an excellent witness.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82097.html",
      "state": "NC",
      "duration": "3 or 4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bce68",
      "summary": "bright light or object moving rapidly across sky",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2011-05-29T00:00:00",
      "story": "bright light or object moving rapidly across sky I had just parked my car and was heading to a bar for a friends birthday party, when I noticed a bright light in the sky.  Now with all this end of the world hooey going around I was starting to get a bit worried.  Then I realized this event probably wouldn't include me.  So I paid more attention to the object.  It was really fast and left no contrail, so I don't believe it was a plane.  I nearly had to lay down on the parking lot to keep a track on it!  It eventually moved out of my field of vision. I have never seen anything move that fast!  I am not a spring chicken and have seen a lot of stuff in my days, but this takes the proverbial cake.  I went on the party and didn't say a word about it... I am not sure what it was, but thought I'd report it.  Thanks for listening.",
      "link": "http://www.nuforc.org/webreports/081/S81496.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1c4",
      "summary": "5 orange objects over Charlotte, two mins apart",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "5 orange objects over Charlotte, two mins apart 5 orange sphere/fireball shaped objects over s. charlotte tonight.   Does anyone know what these could be? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92098.html",
      "state": "NC",
      "duration": "10.minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3d9",
      "summary": "Green fireball with orange trail following.",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Green fireball with orange trail following. Standing in the backyard looking at the sky and out of no where observed a burst over the tree line then saw a illuminated neon green fireball hold a consistent altitude and speed shoot across the sky with an orange trail following.",
      "link": "http://www.nuforc.org/webreports/092/S92291.html",
      "state": "NC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd82b",
      "summary": "Black triangle 36 sighted in backyard early AM that leaped from ground to higher branch or line.",
      "city": "charlotte",
      "shape": "triangle",
      "date": "2012-08-19T00:00:00",
      "story": "Black triangle 36&quot; sighted in backyard early AM that leaped from ground to higher branch or line. On July 13, 2012 at 3:27am while taking my dogs out to the backyard for an unexpected bathroom visit, I saw a black triangular shaped about 36inches from the top of the triangle to its base, go from the ground level to a high branch or just away….  My Golden Retriever approach the area of &quot;fly-up&quot; very slowly, sniffing the aire and walking very slowly.   My German Shepherd at the same time was slowly approaching the area looking upwards and moving in a questioning manner. It was very dark outback, however I had flipped on the back lights, that lit up the yard for me watch the dogs from the porch.   And, I was on the porch frozen and quizzled as to what in the world I had just seen.  I have questioned different people about what this could possibly be.   A large owl, osprey were the answers.  I have bird watched quite a bit and know my silhouettes.   This shape does not match any bird descriptor I have referenced or observed.  There were no flapping wings or wing spread nor was there a tail visible.  I did find however, bird feathers of birds possibly consumed. It's the triangular shape that has me puzzled.  And, the power this thing had to have to leap to a higher branch or line.  I stayed on the porch frozen while my dogs continued to sniff and look upwards.  They finally gave up did their business and came in.  I could not sleep all thinking about what this thing could be.  When I question or tell other people about this experience I am laughed at or brushed off with a silly look or remark.  I know what I saw.  And, if the dogs could talk they would back me up!",
      "link": "http://www.nuforc.org/webreports/091/S91963.html",
      "state": "NC",
      "duration": "9-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdccf",
      "summary": "Several pulsating lights performing impossible maneuvers in the night sky",
      "city": "charlotte",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "several pulsating lights performing impossible maneuvers in the night sky the objects were all the same visually looking. they had lights that pulsated like fire light. the first object i encountered was directly over the intersection of wheaton rd and kinsel hwy, about 100 ft in the air. the object moved south about 20 feet at about 30 mph and then it made several 15 ft circles in the sky.  It continued to do these movements with no set pattern. after about an hour the object had very slowly drifted towards the north west. i observed 5 others that had similar lights and moving patterns through out the night in several different locations in the sky. the last one i observed was the exact same as the first (lights, location, movements) and that was at 5:35 am.  i was just outside of the door at the factory on the west side, where there were no lights, no other doors, and in front of me was a field about 60 yards long and then cochran rd (north to south) and then a corn field as far as the eye could see.",
      "link": "http://www.nuforc.org/webreports/091/S91099.html",
      "state": "MI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3be06e",
      "summary": "Bright orange light a luminating  northwest from my home",
      "city": "charlotte",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "bright orange light a luminating  northwest from my home Me and my son was out on the porch and i saw a orange light thought it was the moon for a second until it started to disappear very slowly and about 30-45 seconds later it started to grow into a large orange light again and it did it once more but the second time it had moved over  to the right from the land mark i viewed it from the firs time just to see if it was moving and it had moved",
      "link": "http://www.nuforc.org/webreports/090/S90105.html",
      "state": "NC",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be45e",
      "summary": "A fireball type ufo is seen outside my house frequently and the light dies after a few minutes.",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2012-06-14T00:00:00",
      "story": "A fireball type ufo is seen outside my house frequently and the light dies after a few minutes. I started noticing an unblinking orange fireball-like object off in the distance showing no similarities to an airplane.  After a few minutes it would simply disappear.  I know that no pilot would just turn off all external lights this close to night time.  I began checking everynight to try and find it again and i did.  And everytime id look away for a second and it would be gone.  I've only seen this happen twice. After about the third or fourth occurrence, I looked at the southeast part of the sky and something completely different.  It was an unmoving white light, brighter than the moon. It was disk to oval shaped, kind of oblong.  The moon was out on this occasion and it was full so im not sure what i actually saw there, but it wasnt swamp gas or venus.  And once again after a few minutes the light simply went out.  More recently, it was a lot closer than usual and had a kind of hazy spotlight projecting in front of it.  The spotlight was the same color as the ufo itself, bright orange. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89549.html",
      "state": "MI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be51a",
      "summary": "Red Lights Over East Meck High",
      "city": "charlotte",
      "shape": "triangle",
      "date": "2012-05-13T00:00:00",
      "story": "Red Lights Over East Meck High After a 9-10 year old football game we were coming out of the lights on the field,  3 red lights were spotted in a triangular, then a straight line pattern above and could not have been too high as a low cloud cover had rolled in.  The front light went out first then the rear light followed by the middle.  They all stayed stationary and there was no noise detected.",
      "link": "http://www.nuforc.org/webreports/088/S88745.html",
      "state": "NC",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be61d",
      "summary": "My grandson and I was traveling south bound on I_85 from Charlotte, NC toward Atlanta, Ga on 12/15/11 sometime around 12:00 AM. O ur lo",
      "city": "charlotte",
      "shape": "light",
      "date": "2012-04-18T00:00:00",
      "story": "My grandson and I was traveling south bound on I_85 from Charlotte, NC toward Atlanta, Ga on 12/15/11 sometime around 12:00 AM.  Our location was somewhere close to South Carolina and North Carlina line (?).   A row of 3 or so white lights appeared just in front of our vehicle approx 3 to 5 hundreds yards (?) away traveling at a smooth but very quick speed.  It crossed from left to right from a cell tower to another tower on other side of expressway.  It then proceeded to travel back across highway toward another cell tower further down the highway, then traveled south bound, following I-85 until it eventually dissappeared from our view on the horizon. It took about 12 to 17 seconds from first site to end of site.  No sounds, no hesitation, just a very smooth flight.  The row of lights never changed even though it moved from right to left then left to right, then traveling straight away from us.   I've never encountered anything like this before and has me checking the skies most nights.  I've searched online for sitings on this date but not found any such reports.   My grandson and I agreed the speed to be extremely fast due to the time it took to travel from our location to horizon, which we couldn't agree on.  He seemed to think the horizon was 50 or more miles away and I thought it could be no more than 10 miles away.   Even at 5 miles an object to travel that far in less than 12 to 17 seconds would be traveling at a very high rate of speed.",
      "link": "http://www.nuforc.org/webreports/088/S88454.html",
      "state": "NC",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be5f1",
      "summary": "Two orange circles moved slowly, then proceeded faster separated and disappeared in cloud",
      "city": "charlotte",
      "shape": "circle",
      "date": "2012-06-14T00:00:00",
      "story": "Two orange circles moved slowly, then proceeded faster separated and disappeared in cloud. Two orange star/sphere shaped moving slowly then went behind tall trees, proceeded moving faster separated and disappeared into clouds.",
      "link": "http://www.nuforc.org/webreports/089/S89482.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be78e",
      "summary": "Triangle ship seen",
      "city": "charlotte",
      "shape": "triangle",
      "date": "2012-04-18T00:00:00",
      "story": "Triangle ship seen I was walking my dogs around 9: 50 Pm in the evening for their last run.  Noticed in the north direction there were flashing lights of greenish blue, white and red blinking lights.   At first I thought it was a plane but as it came closer, there were no sounds and the lights didn't appear to be of those on airplanes.   As it came closer passing over my house, I noticed its shape to be triangular with a white light on the tail point.  It was not going fast but not too slow either.   Was kind of shock to see its shape as a triangle with hardly no sounds at all.   Everyone knows what the plane sounds like and this had hardly no sound at all.",
      "link": "http://www.nuforc.org/webreports/088/S88053.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be84a",
      "summary": "Large white cross flying over Charlotte, NC",
      "city": "charlotte",
      "shape": "cross",
      "date": "2012-03-13T00:00:00",
      "story": "Large white cross flying over Charlotte, NC One very large white cross shape object was seen shooting across the sky from SE to NW direction at approximately 10:45 pm (est) on Saturday 2/25/2012.  It lasted about 3 seconds and after seeing the object you were left feeling as if a jolt of energy had struck your body and taken your breath.  Within a minute the feeling subsided. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87361.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be9dd",
      "summary": "Red, blue, and green twinkling lights in western Charlotte, NC sky.  ((NUFORC Note:  Possible sighting of Venus or Sirius??  PD))",
      "city": "charlotte",
      "shape": "light",
      "date": "2012-04-18T00:00:00",
      "story": "Red, blue, and green twinkling lights in western Charlotte, NC, sky. One object hovered for a long time then moved away at a crawl.  Was very twinkly with red, blue and green lights.  No shape was visible.   It started out due west and moved northwest. ((NUFORC Note:  Possible sighting of Venus or Sirius??  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88446.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beba0",
      "summary": "My husband and I saw silent orange orbs of light in the sky.",
      "city": "charlotte",
      "shape": "light",
      "date": "2013-09-09T00:00:00",
      "story": "My husband and I saw silent orange orbs of light in the sky. My husband and I witnessed 30-40 orange orbs of light moving from north to south over eastern parts of Mecklenburg county.  They would disappear at a certain point in the sky.  The objects were totally silent.  The lights would get bright and dim.  They would pulsate.  My husband looked at some of the objects through binoculars and they appeared to be triangular in shape.  I called someone in the neighboring county to see if they could see the objects.  They saw flashes in the sky, but nothing else.  We called several news stations and no one reported anything.  The lights were moving in straight lines in no certain pattern at various heights above treeline in the sky.",
      "link": "http://www.nuforc.org/webreports/101/S101770.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf33a",
      "summary": "Five billowy oval reddish lights passing west to east at 18:55 EST over Charlotte, MI on 12/22/12",
      "city": "charlotte",
      "shape": "oval",
      "date": "2013-02-04T00:00:00",
      "story": "Five billowy oval reddish lights passing west to east at 18:55 EST over Charlotte, MI on 12/22/12 At 18:55 EST on 12/22/12 over Charlotte, Michigan, two adults and a 13 year old saw 5 reddish lights passing west to east in the dark evening sky.  They somewhat resembled Chinese lanterns as they seemed kind of billowy, but they were moving very fast.  They were so far up in the sky it was impossible to recognize anything except that they had a reddish color and appeared oval shaped. It took about 15 seconds for the lights to pass.  They took turns passing each other as they headed east.  They were visible in the eastern sky as red dots making the eastern sky reddish in appearance for fifteen minutes. Then the sky went dark.",
      "link": "http://www.nuforc.org/webreports/095/S95418.html",
      "state": "MI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3ee",
      "summary": "At a tball game, looked up at ball overhead, saw a white box. directly overhead. it did not move for 10 minutes. no bigger no smaller (",
      "city": "charlotte",
      "shape": "rectangle",
      "date": "2013-05-15T00:00:00",
      "story": "at a tball game, looked up at ball overhead, saw a white box. directly overhead.  it did not move for 10 minutes.  no bigger no smaller (like a balloon may do as it rises) it was very high in the sky hard to judge how high.  it was not as high as planes (that were in the air) but not as low as kites or other things. there was not a cloud in the sky.  after 10 minutes it disappeared. completely gone.",
      "link": "http://www.nuforc.org/webreports/097/S97186.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5bc",
      "summary": "The object was orange in color, rectanglar in shape at first but, yet transparent, I could see trees through it.",
      "city": "charlotte",
      "shape": "changing",
      "date": "2012-12-20T00:00:00",
      "story": "IT WAS ONLY ONE OBJESCT.  The Object was orange in color, retanglar in shape at first but, yet transparent, I could see trees through it, floating across the center,diagonally across my back yard.  It was approx. 20 inches long and 15 wide, floating about 15 meters above the ground when I noticed it.  Once I noticed it, it stop,dropped @ a forty five degree level, even with the top of the den windows top level.  Once @ top window level it changed shape to oval, the color changed from orange to a golden yellow and became very bright.  The object centerd the three set den windows and begin a downward decent.  It noticed me looking at it and came to search for me. part 2-  As stated earlier, I was lying on the floor in 6ft in front of the tv and 8ft from the set of den windows, when I noticed the object in my back yard.  Once I saw the object, it stop, dropped in a forty five degree angle to the middle of the den window set sa though it was looking for me. Here is where it gets strange.  Once in position it changes shape from rectangle to oval, changes color from orange to a golden yellow and gets extremely bright as it starts a downward decent. With a pillow, only my head is uncovered as I did not move, I froze in position,covered with a throw & blanket. The object probed the my den and me.  Not knowing what to expect, I waited approx.30 minutes before I got up. Being a career firefighter and military man, I never knew the fear I experienced tonight.  My privacy and home was invaded without my permission.  Who or what would do that, and why.  I am retired and believe in God.Nothing is the same!",
      "link": "http://www.nuforc.org/webreports/095/S95007.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc9e",
      "summary": "Ball/sphereical shape passes over me while driving and implodes blue then disappears",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2013-07-22T00:00:00",
      "story": "Ball/sphereical shape passes over me while driving and implodes blue then disappears Was leaving my neighborhood and saw the sky illuminate and then I looked left up in the sky and I saw a ball of light as if it was falling at a very high rate speed and it seemed to be on fire.   Then imploded but with no sound at all(my window is down), and the object just goes blue and disappears heading west over I-85 away from UNCC. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100249.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfdc2",
      "summary": "Me and my grandson were on hwy 49W and we saw a flat shiney silver object in the sky while driving.",
      "city": "charlotte",
      "shape": "rectangle",
      "date": "2013-06-02T00:00:00",
      "story": "Me and my grandson were on hwy 49W and we saw a flat shiney silver object in the sky while driving. Flat and silver object in the sky.   Me and grandson were driving and it was above us in the sky not moving w/no sound.   I was coming into town on hwy 49 west.  This area is close to Ft. Campbell Tn.",
      "link": "http://www.nuforc.org/webreports/098/S98107.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bff3f",
      "summary": "Cigar UFO, made call in at 11:51.",
      "city": "charlotte",
      "shape": "cigar",
      "date": "2013-07-14T00:00:00",
      "story": "Cigar UFO, made call in at 11:51 I was heading back to the office in Charlotte with my friend from work, coming from Mint Hill after working our territory... I got bored along the way and talked about becoming a free lance photographer, once I explained myself he pointed ar the uptown city of Charlotte as we passes telling me it would be a good picture.  I missed the shot the multiple times so decided to just keep trying once I looked at my 3rd shot I cought a flying ”UFO” which was somewhat hidden in the clouds..  We were going 60mph, the photo was takin at 8:51pm with my HTC Glancer.",
      "link": "http://www.nuforc.org/webreports/100/S100034.html",
      "state": "NC",
      "duration": "photographed"
    },
    {
      "_id": "64d005f478aba2ec5a3c0006",
      "summary": "Orange and blue oval lights lit up! the night sky like daylight  & dissapeared very hight rate of speed.",
      "city": "charlotte",
      "shape": "oval",
      "date": "2013-07-14T00:00:00",
      "story": "Orange and blue oval lights lit up! the night sky like daylight  & dissapeared very hight rate of speed. My teenage son & friends franticly, bust through the door saying that an Orange and blue lights lit up the night sky like daylight & this oval fireball/meteor like object hoovered, bounced around about 5 seconds and then took off @ high rate of speed   It was thought to be an meteor or shooting star @ first untill friends confirm they saw the same thing and it looked very strange to forget. around 12:10 am July, 12th in Charlotte, Nc in Tryon Hills Park. (4-5 witnesses)  I Reported this to the local news wsoc-tv 9 to see if any thing was in the viewing area.  They are checking into it!  As of now I'm convinced it was an UFO.  So Unexplainable!",
      "link": "http://www.nuforc.org/webreports/100/S100074.html",
      "state": "NC",
      "duration": "1-2 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c03e6",
      "summary": "Massive dark bow shaped flying object over Uptown Charlotte.",
      "city": "charlotte",
      "shape": "other",
      "date": "2013-04-12T00:00:00",
      "story": "Massive dark bow shaped flying object over Uptown Charlotte. I live on 5th and Graham in Uptown Charlotte and at approximately 10:15pm, I was smoking a cigarette on my balcony and coming from the middle of the city over the high rises was a massive flying object.  I would describe it as almost having the look of a bow.  It was moving at about the pace you would see an airplane in the sky moving, but there were some significant differences.   First, this thing was massive, maybe the size of 5 airplanes in the sky.   Secondly, this flying object was not lit up at all and was very difficult to see (you wouldn't even notice it if you were just glancing at the sky).   I couldn't believe what I was seeing and expected it to  be gone in a flash, but after a few seconds I called out for my girlfriend to come see and she came out.  I pointed up and asked her what the heck we were seeing.  We both were shocked and couldn't explain it.   Crazy experience and it is the first sighting for both of us!",
      "link": "http://www.nuforc.org/webreports/096/S96598.html",
      "state": "NC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c043a",
      "summary": "I went to my balcony at 4 am and looked over the city, there was a bright star, white in color that looked liked it was powering up and",
      "city": "charlotte",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "I went to my balcony at 4 am and looked over the city, there was a bright star, white in color that looked liked it was powering up and then it slowly dimmed as it went in a North Eastern direction over the city.  It was amazing,  I was not scared but more fascinated then anything. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97734.html",
      "state": "NC",
      "duration": "9 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0470",
      "summary": "Small kidney bean shaped UFO over plaza-midwood (east side of charlotte) midmorning",
      "city": "charlotte",
      "shape": "other",
      "date": "2013-02-18T00:00:00",
      "story": "Small kidney bean shaped UFO over plaza-midwood (east side of charlotte) midmorning Two of us (one adult male and one adult female) were witnesses to this sighting.  At the intersection of North Davidson and 11th street, near the onramp to 277 we observed an object hovering stationary in the sky toward the East/South, roughly over the Eastern side of Plaza- Midwood area, could be directly over Central and Hawthorne. It was on a Monday morning at around 8:55 AM.   Upon entering 277, we watched the object stay stationary and kept it in visual range until the beltway passed the exit for 4th and 3rd street, roughly 2 minutes.  During that time the object did not change position.  It struck us as odd because it was not behaving like an airplane or bird, and was too low in the sky for an airplane other than for an approach to landing or takeoff.  It was in the right location for a large bird, but it was not flapping any wings or gliding.   The oddest part was the shape, which is difficult to describe but I will do my best:  It was kind of a lopsided \"kidney bean\" shape, vertically oriented and proportioned so that the upper half was slightly larger than the other, rounded, and slightly curved or -c shaped.   It was too far away to make out any discernible details, but it appeared to have a surface texture or facets, and did not appear smooth and shiny. After we were out of visual range, and I was dropped off at work, my counterpart returned to the area about 10 minutes later, but the object was missing.",
      "link": "http://www.nuforc.org/webreports/096/S96195.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ca9",
      "summary": "4 bright orange balls with 3 smaller red balls with one of the bright balls flashing as if igniting.",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2014-02-07T00:00:00",
      "story": "4 bright orange balls with 3 smaller red balls with one of the bright balls flashing as if igniting. I was on my way home and I noticed what I thought was a bright constellation I've never seen before.  There were four bright orange balls of light aligned in a similar shape as the cup of the big dipper, but were perfectly spaced apart making a much more symmetric shape.   Then I noticed three smaller lights, same color at first and slowly turned redder, in a triangle pattern inside of the cup pointing upwards (or pointing SE from where I was located).  The smaller lights disappeared and then the larger lights began to fade in and out until they were realigned as a straight line (SW - NE) with the second ball a bit lower than the rest but still evenly positioned from first and third ball.   Then the fourth ball began get really bright (looked momentarily like a fire ball igniting) and then changed to a blue color.  This happened a couple times until one by one the lights began to fade out.",
      "link": "http://www.nuforc.org/webreports/106/S106780.html",
      "state": "NC",
      "duration": "10 minutes after noticed"
    },
    {
      "_id": "64d005f478aba2ec5a3c0da2",
      "summary": "Alien Abduction with provable markings left on the body.",
      "city": "charlotte",
      "shape": "other",
      "date": "2014-03-21T00:00:00",
      "story": "Alien Abduction with provable markings left on the body. ((NUFORC Note:  We have not seen the alleged photos, yet.  We have encouraged the witness to the alleged visitation to get photos of the creatures.  We will have to see the photos, before we will conclude that visitation by aliens is occurring.  We are willing to be proven wrong, if solid evidence is provided by the witness.  We post this report, principally because our policy on posting virtually all of the report that people are kind enough to compose, and to submit to our Center.  When there is any degree of doubt, on our part, we usually act so as to benefit the witness.  PD)) The aliens were actually in my home.  There were two about 3 to 4 feet tall.  The aliens were making a very high-pitched sound and it was very fast. the only way to describe the sound was that it was (di ga diggi di ---a digga dii ga di) repeating over and over again like frequency.   The alien did have the typical big eyes but not the same shape head as seen on tv for a typical alien.  The alien was white or a tannish color rounder shaped oval head.  It had the typical alien nose but the mouth was bigger and wider.  I was paralyzed but could only move my eyes and also there was one behind me because I was laying on my side rocking me back and forth.  I was trying to break free but could not move and then wend fully unconscious.  I do remember being levitated and pulled or dragged out of my bed.  The next day I went downstairs and asked my nephew did he sleep ok that night.  He said to me unc I could hardly sleep there was this giggi diggi di sound going on and I thought! it was the radio. Well later that day I went into the shower and when i came out I gasped and my heart started beating fast.  There were patterns all over my body red scratches hand prints and they stung a little.  I called my sister who took picture, I as well took pictures and had a friend of mine with a high quality camera come and take pictures of all the patterns on my body.  I have been visited before but NEVER has it been like this.  My friend said man they really got you and he was in shock.  He said it looks like someone strapped you down to do all of this.  I have the pictures I will be happy to share.  One pattern on my back that stood out looks like the eye of Horus.",
      "link": "http://www.nuforc.org/webreports/107/S107978.html",
      "state": "NC",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c0eb7",
      "summary": "ET's are making themselves visible.",
      "city": "charlotte",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "ET's are making themselves visible. Early Sunday morning coming out the house I looked up in the sky and seen what seemed to be a space craft.  It hovered right above the moon (a full moon that night) the was what looked like two rings around the craft.  One was green and the other bluish.   That night/early morning sky was a little cloudy but visible.  I've seen a craft before when I lived in NY but not like this one.  It wasn't moving just hovering over the moon.   I got online and couldn't find any other scientific explanation of what it could have been.  We aren't alone.",
      "link": "http://www.nuforc.org/webreports/107/S107885.html",
      "state": "NC",
      "duration": "night time"
    },
    {
      "_id": "64d005f478aba2ec5a3c10ff",
      "summary": "We saw about  13 bright reddish orange cirle lights with two diamond lights in between flying in a line formation.",
      "city": "charlotte",
      "shape": "circle",
      "date": "2013-11-20T00:00:00",
      "story": "We saw about  13 bright reddish orange cirle lights with two diamond lights in between flying in a line formation. MY HUSBAND AND I SAW CIRCLE REDDISH ORANGE BRIGHT LIGHTS IN THE NIGHT SKY,  HE FIRST SAW 3 IN A FORMATION OF A STRAIGHT LINE THEN A DIAMOND SET OF LIGHTS AND YELLED FOR ME TO COME OUTSIDE,  WHEN I CAME OUTSIDE I SAW ANOTHER 3 GO BY ONE BY ONE THEN A DIAMOND SHAPE AND THEN 4 TO 5 MORE, THEY WERE JUST GLIDING IN THE AIR AS IF THEY HAD NO GRAVITY AND HAD NO NOISE AT ALL.  ONE LIGHT FLICKERED AND THEN JUST WENT OUT AS IF IT DISSAPEARED.   A PLANE WENT BY WHICH IN THE SAME TIME AND YOU COULD SEE AND HEAR THE PLANE BUT NOT THESE.  WE WERE SO AMAZED WE DIDNT HAVE THE TIME OR THINK TO TAKE AS VIDEO AT THE TIME.  THEY WERE ALL TRAVELING IN A LINE ABOUT THE SAME DIRECTION AS OUR PLANES FLY.  THEY WERE FLYING LOWER THAN A PLANE.  WE DO HAVE AN AIRPORT WITHIN 30 MINUTES SO THE PLANES FLYING ARENT EVEN AT THEIR HIGHTEST POINT AND THESE LIGHTS WERE FLYING EVEN LOWER THAN THAT.  I CALLED TSA AND THE NEWS AND THEY HAVE NOT HEARD ANY REPORTS ON THIS.  OTHER PEOPLE HAD TO OF SEEN WHAT WE SAW.",
      "link": "http://www.nuforc.org/webreports/104/S104425.html",
      "state": "NC",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c118b",
      "summary": "I caught two UFO's side by side over Bank of America Stadium during the Playoff game of SF 49ers vs NC Panthers om Sunday 1-12-14",
      "city": "charlotte",
      "shape": "cigar",
      "date": "2014-01-16T00:00:00",
      "story": "I caught two UFO's side by side over Bank of America Stadium during the Playoff game of SF 49ers vs NC Panthers om Sunday 1-12-14 I was watching the Play Off Game between North Caroling Panthers and SF49es on my big Screen HDTV and during a Field Goal by San Francisco, the replay showed the field goal cam under the field go aiming at the sky in the path of the football then I noticed 2 strange objects in the sky.  I can't believe no body saw it.   This was broadcasted Nationally so since no one noticed, I decided to record my TV screen with my iphone to catch these objects.  I have even posted the video on youtube.  It is unaltered.  The only altercation I did was to circle the location of these crafts.  They are just hovering over the stadium way high up in the sky. I believe it was not visible to the naked eye for those attending and it can only be seen thru this HDTV, especially that the HDTV is very detail, so I circled it.   The video is 38 seconds.  So I really don't know how long these things have been up there.   Here is the video:  http://youtu.be/GSe0PVmsMwQ",
      "link": "http://www.nuforc.org/webreports/106/S106264.html",
      "state": "NC",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c1528",
      "summary": "3 lights in sky, all moving very very fast.",
      "city": "charlotte",
      "shape": "changing",
      "date": "2013-12-12T00:00:00",
      "story": "3 lights in sky, all moving very very fast. I was standing out at my bus stop when I saw two lights right next to each other, one looked as if it was floating and it was hovering back and forth, then I noticed the one next to it get really bright and it flashed across the sky, at first I thought it was a satellite or something until it came to an almost complete stop. (It traveled from one side of the sky to the other in about 1 second)  afterwards I saw it just sit there and out of nowhere another one zips straight infront of the other one.  They both just hover for about 30 seconds and I see them turn and I could see the craft, it massive, then they both got really bright and flashed, then they were past the tree line so I couldn't see their lights anymore.   I looked back at the first ship still in the original spot and I noticed its lights got bright and zipped away in the same direction as the other two.",
      "link": "http://www.nuforc.org/webreports/105/S105258.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1607",
      "summary": "White object slowed to a stop.  Remained motionless about a minute and disappeared.",
      "city": "charlotte",
      "shape": "sphere",
      "date": "2013-10-23T00:00:00",
      "story": "White object slowed to a stop.  Remained motionless about a minute and disappeared. THE OBJECT WAS WHITE IN COLOR, DID NOT REFLECT SUNLIGHT. TRAVELED FROM EAST TO WEST. SLOWED TO A STOP!!!  THEN DISAPPEARED!!!!  THOUGH IT WAS A SATELLITE, IT WAS THAT HIGH IN SKY.",
      "link": "http://www.nuforc.org/webreports/103/S103330.html",
      "state": "NC",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1697",
      "summary": "Three orange orbs seen by me and a witness at Food Lion parking lot.",
      "city": "charlotte",
      "shape": "sphere",
      "date": "2013-10-23T00:00:00",
      "story": "Three orange orbs seen by me and a witness at Food Lion parking lot. My report, On October 19, 2013 at 21:53 hours I saw three orbs of orange lights moving from west to east in Charlotte, NC. I had my clock set for 22:00 hours to alarm, but I could not sleep so I got up at 21:30.  When I left the house I noticed a light in the sky.  I thought it was an aircraft but looking again I did not see any of the anti collision lights aircraft have.  I was heading up to Beatties Ford Rd, keeping an eye on the light.  I made a right and saw there were two lights and also noticed that they were orange with a red hue at times.  I hurried up to the parking lot of Food Lion on Beatties Ford Rd, got out of the car noticed there were three. They ranged from 85 degrees to something like 60 degrees above the horizon.  Each object disappeared once they reached the 60 degree mark from horizon one by one. I needed a witness and pointed them out to a guy that was passing by.  He said he did not know what they were but he kept walking.   Tried to take a picture with my phone camera, but that did not work since the moon's light was too bright and the objects were too high.   I watched till they all disappeared.",
      "link": "http://www.nuforc.org/webreports/103/S103434.html",
      "state": "NC",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c175c",
      "summary": "Saw 3 objects in sky and a creature.",
      "city": "charlotte",
      "shape": "changing",
      "date": "2014-06-04T00:00:00",
      "story": "Saw 3 objects in sky and a creature. UFO sighting, chase and possible abduction.  Charlotte N.C., May 5th, 2014. I am submitting this report because I feel that people should know what my adult daughter (28 years old) and I went through.  After over three weeks later we are still upset and still not our usual selves.  I guess we are both still in shock and we are not sure what to do about it. It’s hard because we only really have each other to talk to about it and my daughter is still having stomach problems and just wants to forget what we saw.  I can’t get it out of my mind.  I am still scared. I still can’t believe that it happened at all.  But, I know it did! We know it did. On May 5th, 2014, around 8:30-8:45 PM, we were driving through Charlotte, NC, on the Southbound side of I- 77.  I noticed a really bright light off to the right of us up in the sky.  This huge thing was just floating there in the sky.  It was no plane.  It was silent.  My daughter was driving and I was in the passenger seat.  I just kept asking, “What is that?”  Her reply was that it was a plane because it had blinking lights.  It did have blinking lights but they were pretty insignificant compared to the huge bright white string of lights that seemed to be at the front of this thing.  The smaller lights looked like they were on top of it. One to each side of the center.  The white lights were very large.  I couldn’t see past the lights to see what shape the object was.  We were kind of arguing about what it could or could not be. I grabbed my cell and took some photos.  I actually caught two pictures of the lights and I also turned on my cell’s video to try and catch it that way.  I caught it on video too but it is very small and all you can see is a white light off in the distance.  It’s pretty shaky.  I’m not sure if I can pull it in to see it better or not. As we drove through Charlotte on 77 we came to an area where there are street lights right next to the highway.  Tall orange/yellow street lights.  I could no longer see the object because the street lights were so bright.  All of a sudden a huge round ball of solid bright white light came right at the windshield.  Out of nowhere! It took up most of the windshield and she drives a four door Toyota Corolla.  When it came for the windshield I braced myself for impact. But it didn’t hit the car.  It just kind of seemed as though it evaporated into it.   At that moment my daughter was driving over 70 mph.    As I sat there dazed, I was thinking that one of the street lights must’ve fallen on the car but there was no sound at all and I was having a hard time trying to grasp what had just happened.  I hadn’t said a word to my daughter about the light when she asked me, “What was that light?”  I was like, “You saw that too?”  Then I told her “I don’t know what that was!”   That scared us pretty badly.  Her stomach started to hurt really bad and she was nauseous and my stomach was hurting too.  It seemed to just take all of my daughter’s energy away. She started feeling really bad.  Not only did this light scare the crap out of us but it “STUNNED” us.  We were actually dazed by it.  We don’t know where the ball of light came from, but we didn’t see it again.  We both remember actually feeling it on the skin of our faces and upper arms. I remember that I looked in the side mirror a few moments later and nothing was there.   A little while later a huge helicopter flew right over and in front of our car. It was so close that we could see the two greenish/blue light domes stuck underneath it and a tiny little blue light on top of it, under the blades.  It was a huge helicopter and it was very loud. Because of the blue light I thought it must be police or military. All in all we saw the chopper three times or three different choppers. They were circling the area where we were. So, we couldn’t have been the only ones who witnessed the object. Not sure if anyone saw the round light that came after us. I did notice that the helicopters didn’t actually seem to approach the white lights that were still in the sky. They just circled around the interstate. The last time I saw one of these helicopters was when we were leaving the Charlotte area. Once we cleared the street lights we could still see the lights in the sky were still there. Then the road turned so that the object ended up behind us. I was determined to get some pictures of it so we took the next exit so that we could see it from on top of the over pass. Well, the next exit didn’t go up to an overpass. It angled down. We ended up surrounded by trees and buildings. So, we couldn’t see it anymore. We were going to go to the next exit to see if it had an actual overpass where we would be able to see it again and that’s when my husband called. It was 9:08 PM. I frantically told him all about the lights in the sky and the ball of light that came at us and about the helicopter. I wasn’t paying any attention to my daughter who was still driving until she said, “Mom, I don’t feel good!”  That’s when I noticed she was driving about 85 mph and she told me that she couldn’t stay awake. I told her to slow down. I got off of the phone.  She told me that she had been nodding off and that she couldn’t drive anymore.  We had eaten in Huntersville and we left at dusk.  I’d say a little after 8:00 PM, she was full of energy.  Our trip to where she lives was only 3 ½ hours away from Huntersville and she was fine.  She was fine until the white ball of light came at us. I told her to pull off of the interstate so that she could rest and that I would drive the rest of the way.  The exit we took had a Denny’s so we went in there. This Denny’s is located in Rock Hill, S.C.  As soon as we walked in, we realized it was freezing.  So, we reluctantly walked back outside to the car and opened the trunk to get our jackets.  Everything in the trunk was hot. Even the metal of my camera’s tripod was hot to the touch.  Our jackets were toasty as though we had just pulled them out of the drier.  That was when we started to worry about radiation.  Worried about where that ball of light might’ve come from. Everything being so hot really shook us up all over again. (We don’t know where to go to have something like that checked out. Who do you call to see if your car or you have been exposed to radiation? If anyone out there knows; please get the information to me.) When we went back inside we sat down and ordered coffee. We sat there trying to rationalize what had happened. She was still nauseous so she decided to get something to eat hoping she would feel better. I didn’t eat. My stomach felt bad and I had no appetite at all. Strange thing is that the clock on her cell and the register receipt didn’t match. The receipt said we left there at 10:05 and my daughter had gotten a call from her husband while we were at the table and the time read 10:46. That would mean that by her cell we left there after 11:00 PM. I know we weren’t sitting there for that long. I called the Denny’s last week and spoke to a manager to see of the register’s time was off. But, it was accurate. I can’t explain the difference. I wish I could say that our experience ended there. But, it didn’t. We got into the car and I drove back to I-77.  After I had been driving a little while, I spotted the lights again. We couldn’t believe it!  They were over to the right of the interstate, just like before.  (When we had left the restaurant I made sure that we got my video camera and Cannon camera out of the trunk.)  So, I told my daughter to grab it to film the object, so she did. I couldn’t help her with it because I was driving.  As she opened the view finder she tried to focus on the object when it seemed to come straight towards our car! She just said “ It can see us, it’s looking at us!” She said the white lights went out and now there was a line of red lights under it. Then it flew over the car. It went from the front passenger side to the rear driver side and then across the street. By this time it was moving very slowly and low. The whole thing turned slowly like it was facing our car while staying in the! same spot. She is so scared and at this time I can’t see it. She can, because she is looking over the seat through the window behind me. I pull the car off to the right side of the slow lane. Strangely there is no traffic except for us. Now, I can see it! As we watch this thing together; it started changing shape. I ask you, how does something just change shape? The fact that it was in the air is what scared me! We could see what looked like metal beams drop down from I guess inside of this thing and it looked like they were interlocking. The beams looked like 2 x4s but seemed to be made of metal. It was changing shape right in front of us. We could clearly see it because it was right there and the red lights illuminated it. It’s outer shape was starting to look like some sort of a triangle. That’s when I put the car back into drive, hit the gas and took off. I need to say this now; my daughter doesn’t own and has never used a video camera. (Except for one time when I was recording something and handed it over to her to use.)She thought that just because the view finder lights up and the screen is showing what you are pointing at that what you see is being recorded. She never hit the little red button. Later when we realized this we were crushed. I do not blame my daughter. Now, here is where I made the worst decision of my life. At this time we are in South Carolina and are between Rock Hills and Columbia. As before, I wanted to see more of the object so since it was behind us I started to look for an overpass again so that we could sit up high and maybe my daughter could get some more footage of this thing. When I took the overpass to the right, stopped at the stop sign then headed left onto the bridge/over pass as we looked at the trees in front of us there was a large glowing hovering bright creamy white object that was about 50 feet wide if not more. I don’t know if it was the same object we had just seen but if it was it had changed color and shape again and was chasing us and waiting for us. As soon as I saw it I slammed on the brakes. I remember hearing the sand and gravel crunch under the tires as I skidded to a stop. I had driven all the way across the bridge and was sitting in the middle of the road on painted lines that showed that ! the lanes were separate. We were in shock. It was at tree level and we could see the outline of the tops of the trees on both sides of the road. I could see that the road we were on went in between those trees and looked like it headed off to the right. There were no lights anywhere on or around this overpass. We were just sitting there, stunned.  Staring at that bright light. When my daughter said, “You aren’t going near that thing? Are you?” I told her no. But, as I realized later; I still wasn’t leaving either. I can’t explain that. I was terrified but I wasn’t leaving. I don’t know how long we sat there. I think it was just a few minutes. Then we were hit with headlights from the right side of us. Someone had taken the exit from North bound side and had pulled up to the stop sign facing right at our car. That snapped me out of it. I took my foot off of the brake and swerved to the right and around to the left to make a u turn in the street and headed for the ramp back to I-77 South. I am ashamed to say that we did nothing to alert the other car. We have no idea if these people saw it or not. All I know is that the object was still there when I took my u turn. I never looked back. Once back on the interstate I drove for quite some time when finally I just had to pull off. By this time it was after midnight. I took a well lit exit and saw a Wendy’s but it was only open for drive through. All of the gas stations were closed. All the while I’m checking the skies. So, I got back on I-77 and looked for another exit. That’s when I saw a Shell station sign and took that exit. It was on the left side so we had to go over the overpass. We could tell it was closed as soon as we came over the overpass. All of the parking lot lights were on but it was closed. I was in pain because my bladder was hurting now. I pulled partially into the entrance of the Shell station and then made a u turn. As I completed the u turn we saw a guard rail right in front of us. At the very end of the guard rail as we were swinging around we saw something  standing there. I couldn’t take my eyes off of it. It was right next to the road. Right next to the door of the car. It seemed to be! bristling. Like it was luminescent in some way, but it was really darkly colored like it was camouflaged. I actually thought it was someone dressed up in that camouflage netting stuff when it moved towards the glass right next to my daughter. She put her hands and arms up over her face and head and tucked her head downwards. That is how close that thing was to her door. I honestly thought it may have been a poacher until I could make out the shape of it. I could see a larger than normal rounded top of a head then it came down to a short little neck area then straight out to both sides to shoulders. (Human shoulders aren’t shaped that way.) Then it’s arms dropped straight down.  The thing that made me realize that it wasn’t human was mostly that it’s waist was only like 8 inches wide and that it was about maybe 4 feet tall.  I could see from the top of it’s head to its hip area through her window.  I remember thinking “It’s so skinny!” Next thing I know we are past it and my  daughter is asking me, “Was that a person?”  I remember looking  back over my right shoulder through the window behind her and still seeing the thing.  It was moving and I had never been so terrified in my entire life.  My daughter said that she didn’t look at it but then moments later she said that it was really thin.  I remember asking her how do you know that if you didn’t look at it?  She still can’t answer that question, but is adamant about not looking at it. ((NUFORC Note:  We spoke with the witness via telephone, and she assures us that the report is sincere.  She will have her daughter submit a supplementary report.  The mother has offered to send two photos she asserts she took of the object(s).  PD)) I somehow find the ramp back to the interstate and just drive. Finally, I spot what looks like a truck stop. I know they are open 24/7. As we take the exit there are semi’s parked to the right side of the exit. As I passed them I could see that it was open and now I had a place to use the rest room.  Even after seeing that thing I had to use the bathroom so I just had to stop.  Once I was finished inside I came back outside to the car.  We sat there for a couple of moments trying to absorb what we had just seen. I didn’t know what time it was then and just got back on the road.  My daughter had to get back home that night because there was no one home to take her three dogs outside to the bathroom.  That is the reason we hadn’t stopped and gotten a hotel. While driving I ran into construction three separate times where signs with arrows pointed us over to the slow lane and the speed limit was only 45.  After the third road maintenance/construction site I had had it.  I told my daughter that I just couldn’t take it anymore.  I had to pull off and get a hotel.  Two exits later we found hotels and stopped for the night.  It was 2:00 AM.  The hotel was in Orangeburg, SC.  We were so shook up that we didn’t get to sleep until 5:00 AM.  We turned all of the lights on in the room and bathroom. We jumped at every little sound.  Even sounds the little refrigerator made.  I woke up at 6:00 AM and realized that we had fallen asleep.  We were both sitting up leaning on pillows stacked up against the headboards.  I finally turned off the room lights when the sun came up enough to light the room. I just can’t get the image of the creepy little thing out of my mind.  Even right now, I can still clearly see it in my mind.  Every time I get the same feeling of outright fear.  We think we were still being followed.  Then again, maybe this creature was separate.  We don’t know. I do guess that the larger lights that we saw were not what we saw change shape.  That object was much, much smaller.  So was the glowing light we saw at that over pass. We are still afraid. Writing this down has taken me all day long.  It’s still very upsetting. We don’t understand why it chose us.  Was it that we were taking too much interest?  Again, that would be totally my fault.  At points during all of this she was begging me to get far away from what we were seeing. All in all it took us four hours to get 1 hour and 43 minutes away.  The time it usually takes to drive from Rock Hill to Orangeburg.  We got off of the road a couple of times but still feel that we are missing time somewhere. ((ADDENDUM FROM WITNESS)) Dear Mr. Davenport, Can you tell me where people who have witnessed a UFO go when they want to speak out loud to someone about what they saw? Do people ever get answers to what happened? It took me about 7 hours to physically write down all of what happened that night. It was very hard to have to keep reliving it so that I could write it down. My daughter and I went over it a hundred times while I was still at her house but now it's like pulling teeth to get her to talk about any of it. She feels that we never should have been there. Never should have seen what we saw and that we shouldn't tell anyone. She doesn't understand why I feel the need to let people know what happened to us. What we witnessed I think it's important! All of it!  I want to know what that ball of light was!  Did it leave radiation in/on her car? What happened to my left ear?  Why is there a \"New\" bump behind my right ear and why does my daughter have one in the same area? Why were my triglycerides through the roof when my blood was tested 7 days after May 5th? They were so high that my doctor called me at home to give me the results. I remember that I was asked by the tech' when my blood was drawn if I was on any blood thinners when he drew my blood. I am not!  I am still very scared at night.  If I have to go outside for something alone at night now, It takes everything I have not to fly into a panic and run when I see any lights moving in the sky.  What if it knows where I am or worse, where my daughter is?  Please, accept my apology for being so rude in my reply to your email before.  I have not been myself lately.  ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/109/S109660.html",
      "state": "NC",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c18a0",
      "summary": "Was in downtown Charlotte on the 4th to watch fireworks saw a couple helicopters and you could clearly see and hear that they were heli",
      "city": "charlotte",
      "shape": "light",
      "date": "2014-07-11T00:00:00",
      "story": "Was in downtown charlotte on the 4th to watch fireworks saw a couple helicopters and you could clearly see and hear that they were helicopters then before any fireworks were shot off a bright orange light that appears close due to the size was moving at a slow pace not dropping or gaining altitude had no noise flying over us was completely silent thought at first it might have been some type of firework on fire floating but wasn't going with the wind and we sat watching it leave trying to prove what it could logically be and we couldn't come up with anything blimp, airplane, helicopter was easily ruled out......just one solid light and even with light of city couldn't see any other structure of it had no marker lights",
      "link": "http://www.nuforc.org/webreports/111/S111265.html",
      "state": "NC",
      "duration": "22:02"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a33",
      "summary": "Bright orange light circling a disk shaped object.",
      "city": "charlotte",
      "shape": "disk",
      "date": "2014-07-05T00:00:00",
      "story": "Bright orange light circling a disk shaped object. I witnessed the object approaching from the north heading south.  At first it appeared to be some sort of orange light in the distance as it grew closer I saw it shift from side to side slightly, once I realized it wasn't an airplane I yelled to my wife to direct her attention to the light.   As it passed us overhead we could make out the round disk shape and the light was moving around the outer rim of the disk, but not completely around.  It would start moving one way and the reverse direction, once it passed it started to fade until it was no longer visible.  There was another guy that came up to us and asked if we were looking at light in the sky and said he thought he was the only one to see it.",
      "link": "http://www.nuforc.org/webreports/111/S111034.html",
      "state": "NC",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c4f",
      "summary": "6-10 star like objects moving in quickly in patterns and raced out of sight over Charlotte sky.",
      "city": "charlotte",
      "shape": "light",
      "date": "2014-07-11T00:00:00",
      "story": "6-10 star like objects moving in quickly in patterns and raced out of sight over charlotte sky Walking my dog noticed several objects that looked like stars moving unusually.   Stopped to observe with another witness and noticed the objects moving in patterns and eventually raced out of sight.  Above city less than a dozen visible stars in the sky at the time.   This is what really made me notice the objects. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111297.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d04",
      "summary": "Black, morphing shape object sighted for almost ten minutes with my neighbor in plain sight.",
      "city": "charlotte",
      "shape": "changing",
      "date": "2014-06-20T00:00:00",
      "story": "Black, morphing shape object sighted for almost ten minutes with my neighbor in plain sight. I have never really believed in this sort of thing, but I just saw an object in the sky over south Charlotte at 8:00 p.m., 6/15/2014.  It was black and seemed to be a semi-circular shape but seemed to change shape in a slow, wobbly manner.  Almost like a blob or jellyish type structure.  It did not look natural. It either had a bright white light or some sort of reflection of the sun, but it was slowly spinning so the light would come and go. It was directly over me and in plain sight at low altitude.  Someone with terrible eyesight could have easily seen it.  I watched it for over five minutes, probably closer to ten.  It moved very slowly, gaining in altitude pretty steeply in regard to how quickly it became too difficult to see.  I recorded it from my phone, but it has no zoom.  By the time I decided to find my phone and record, it had floated quite a distance.  It was indistinguishable on the screen because of its altitude and the sun and lack of zooming ability.   My neighbor walked out as I was filming.  He watched it with me.  By the time he saw it, the object was at a greater distance and higher altitude so he asked if maybe it was a weather balloon.  It was not, though.  It was almost thickly transparent-like, but then it would “morph” into a jet black with absolutely no plasma look to it.  It did not look like it was “made of matter” in the sense that we usually perceive matter. I am somewhat shocked because I am a hard sceptic of almost any phenomena reported on any subject.  I called the airport.  They said that they know of nothing in the sky, that there is a National Guard Base nearby.  Really though, I’m not sure why I called them because this “object” did not look natural and moved in a very unnatural manner as well.  It was not a “vehicle” per se.  I am truly at a loss for words. I saw it earlier this week too, but it was very far away so I didn’t call or make a report because I wasn’t sure what I saw.  On that day, it seemed to hover in a completely still position and darted off at an extremely high speed.  I was intrigued as to what it could be, but it was very far away and pretty much a small, dark spot in the sky.  I am certain now that this was this object or something very similar that I observed.",
      "link": "http://www.nuforc.org/webreports/110/S110261.html",
      "state": "NC",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d5e",
      "summary": "I have a video to prove it. We were at the pool and across the sky we saw 10 flying objects. They were flying very close in the same di",
      "city": "charlotte",
      "shape": "light",
      "date": "2014-07-04T00:00:00",
      "story": "I have a video to prove it.  We were at the pool and across the sky we saw 10 flying objects. They were flying very close in the same direction.  But in the film they appear as flashing lights.  Everyone at the pool saw it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110751.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ece",
      "summary": "3 pyramid shape ships going very fast.",
      "city": "charlotte",
      "shape": "other",
      "date": "2014-06-04T00:00:00",
      "story": "3 pyramid shape ships going very fast I was walking home from work and I was looking up at the sky and 3 Pyramid shape ships where flying very fast then there went up very high into the sky and out of view.",
      "link": "http://www.nuforc.org/webreports/109/S109833.html",
      "state": "NC",
      "duration": "59 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2256",
      "summary": "Over 20 ufos seen flying towards charlotte nc airport.",
      "city": "charlotte",
      "shape": "disk",
      "date": "2014-04-24T00:00:00",
      "story": "Over 20 ufos seen flying towards charlotte nc airport. There were over 20 ufos hovering over the park ministries church.  they looked like they were on fire and when camera were pulled out they made themselves disapper.   they apperared to be headed in the direction of the charlotte airport.   a bigger aircraft was seen hovering over the smaller aircrafts. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108872.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c249d",
      "summary": "6 large circular orange lights moving across the sky from west to east. No noise. No apparent formation.",
      "city": "charlotte",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "6 large circular orange lights moving across the sky from west to east.  No noise.  No apparent formation.",
      "link": "http://www.nuforc.org/webreports/114/S114533.html",
      "state": "NC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c26ae",
      "summary": "Very bright white light moving at a good rate of speed, not an airplane or satellite.",
      "city": "charlotte",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "Very bright white light moving at a good rate of speed, not an airplane or satellite. I observed a UFO.  I first saw it in the center of sky moving southeast. It looked like a very bright star, but it seemed to close to earth to actually be a star or a satellite. The flight was airplane speed or faster. It moved from 12 o'clock to 3 or 4 o'clock and then faded out. There were no blinking lights, fire trail, vapor trail or sound.  It was moving southeast.",
      "link": "http://www.nuforc.org/webreports/114/S114761.html",
      "state": "NC",
      "duration": "30-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c282a",
      "summary": "Saw a white greenish Ball descend in ballantyne. Clear sky no noise. Appeared out of nowhere and was gone behind the trees in no time",
      "city": "charlotte",
      "shape": "circle",
      "date": "2014-10-03T00:00:00",
      "story": "Saw a white greenish Ball descend in ballantyne.  Clear sky no noise.   Appeared out of nowhere and was gone behind the trees in no time",
      "link": "http://www.nuforc.org/webreports/113/S113926.html",
      "state": "NC",
      "duration": "1.5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f7c",
      "summary": "Multiple lights and strange star like objects seen.",
      "city": "charlotte",
      "shape": "cone",
      "date": "2014-08-08T00:00:00",
      "story": "Multiple lights and strange star like objects seen. I was outside on my back porch having a cigarette and some coffee early that morning while it was still dark and noticed a formation of whitish blue colored star like objects in a formation moving left across the night sky.  Some of them would push in closer to the other or move up higher.   I also noticed to my right another whitish blue object that was actually bigger than the other objects to the left and it seemed to be moving upwards in the sky and would dim it's lights and then become faint then glow really bright. I think that particular light was originally lower in the sky and when i looked at it through my binoculars it seemed to be shaped like a spherical galaxy or what you would call a saucer.   The most eerie aspect of these sightings was the last object i saw not far from that one which was a yellow light that was the same size as the blue whitish one and it was also moving across the sky even farther right to the last one.  It was a yellow color but! it flickered red at first as if it had rotating orb like lights on it and i thought i noticed it rotating as i looked at it through my binoculars but it was hard to say for certain from that distance. Upon closer inspection it seemed as though it may have been shaped like a cone or and upside down pyramid of sorts.  The light rays coming from it even bent like it had a very different shape than any average type of aircraft upside down boomerang.  I thought it looked strange.  It seemed to change it's direction a lot.  It would continue its path to the right yet it would simultaneously be going up but then seem to go towards the left.   My brother also saw this as he was with me at the time and we were talking out on the back porch when i pointed it out to him.  One last thing that i noticed while this was happening was a sudden flash of blue light that radiated out like a perfect circle from a very small circular point in the sky and it was in between the objects that were seper! ated by distance. It also happened to be in the middle of clou! ds.  I ca n rule out thunder or lightning because it never followed suit with more flashes or any thunder or rain.  The sky was clear save for a few clouds and the flash was a circular shape and very bright.  I do live close to an airport but i did not hear any sounds whatsoever and they were all sighted very high in the night sky.   This happened on Tuesday the 29th of July 2014.",
      "link": "http://www.nuforc.org/webreports/112/S112259.html",
      "state": "NC",
      "duration": "30-60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3144",
      "summary": "Fast speeding steady electric blue light followed by helicopter.",
      "city": "charlotte",
      "shape": "light",
      "date": "2014-08-08T00:00:00",
      "story": "Fast speeding steady electric blue light followed by helicopter. Sky was somewhat cloudy, I went out to backyard to close windows of my car and heard what sounded like a helicopter approaching, looked up and saw a bright electric blue light fly at an unusual fast speed, sw to ne in direction.   The light was steady, not blinking, it looked too small to be a plane and there was only that one light no other lights blinking and by judging from the size next to the clouds it could not be too high, immediately after the helicopter appeared, I could not see what kind of helicopter (police, military, etc,), but I could tell it was a helicopter by its shape and white and red lights flashing.   The electric blue light flew ahead much much faster, and the helicopter seemed to follow same route.",
      "link": "http://www.nuforc.org/webreports/112/S112267.html",
      "state": "NC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c319d",
      "summary": "Strange green and red lights hovering over the Charlotte/Concord, NC area.",
      "city": "charlotte",
      "shape": "formation",
      "date": "2014-08-01T00:00:00",
      "story": "Strange green and red lights hovering over the Charlotte/Concord NC area I had went out side in front of the house, my wife and I.  We smell something burning and I thought a fire was near.   So I looked in the sky to see if I could see bright light to indicate a fire was burning.  Looking up in the sky I noticed the bright light that had green and red lights.  There were about 10 sightings, moving in and around (I went back out at 10:15 pm and they were headed south toward SC).   Not to think I was crazy I called my wife and showed them to her it appeared that they were darting in an out from behind the clouds.   Then it was crazy patterns and formations and then they spread apart heading south.",
      "link": "http://www.nuforc.org/webreports/111/S111978.html",
      "state": "NC",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c32cd",
      "summary": "Green light shooting straight down from the sky.",
      "city": "charlotte",
      "shape": "light",
      "date": "2015-04-03T00:00:00",
      "story": "Green light shooting straight down from the sky. Was driving home from work and saw a green light sit in the sky a bit and then shoot down toward the ground.  Some other drivers had stopped their car to watch.",
      "link": "http://www.nuforc.org/webreports/118/S118094.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c39a6",
      "summary": "Multi-colored flashing lights around a stationary orb.  ((NUFORC Note:  Probable sighting of Sirius.  PD))",
      "city": "charlotte",
      "shape": "other",
      "date": "2014-12-18T00:00:00",
      "story": "Multi-colored flashing lights around a stationary orb My friend called me to report two bright \"stars\" in the sky flashing multi-colored lights. He gave me the approximate location so I went outside with my phone and binoculars and saw the larger orb.  I could see the flashing lights with my naked eye - green, red, white, blue. When I used my binoculars, they were very bright and clear, like an LED light, not blurry, and flashing in a rotating pattern around a glowing orb. I live near a flight line and witnessed several planes pass by.  This was not a plane.  It hovered in the same spot for about fifteen minutes and then began to slowly drift south.  Not fast.  I could barely tell it was moving. At one point it disappeared then reappeared within a few seconds.  As it drifted south, the flashing lights lessened in intensity.  I could only see them with binoculars at that point as the light seemed to be getting a bit smaller and looked more like a bright star to the naked eye. I brought my husband outside to w! itness the phenomena.  He is ex military and said it was not a plane or helicopter.  There was no sound. I took a video with my phone.  Granted, it's not the greatest and the orb looks small but you can still see the flashing lights.  I'm not sure what it was.  I've tried to debunk but honestly, I can't come up with an answer.  At one point on the video, I describe it as resembling a flashing Christmas tree full of multi-colored lights. What impressed me most was the brilliance of the lights.  It may not be anything but I wanted to report it since it was so unusual. ((NUFORC Note:  Probable sighting of Sirius.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115966.html",
      "state": "NC",
      "duration": "1 hour +"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a70",
      "summary": "Small white oval shaped UFO over Charlotte countryside airspace",
      "city": "charlotte",
      "shape": "other",
      "date": "2015-07-31T00:00:00",
      "story": "Small white oval shaped UFO over Charlotte countryside airspace I was flying from Charlotte to Richmond, and had a window seat.  It must have been 30 minutes-1 hour out of Charlotte, while flying over a very big lake that looked like a scar in the ground, when I saw it.  It was a small white object.  It was hovering, and the plane was passing over it.   It wasn't a helicopter, and it was just bellow the clouds, so it couldn't have been a commercial drone.  It almost looked like a shark.   It was white, and had a small tail fin, which went into an oval shaped body with kind of a dark center.  From the small oval shape, it looked like a sideways wing was jutting out (like if a plane was flipping left, and the wing was sticking out at an angle).   It did not look very big, and I continued to look at it until our plane passed it entirely.  It was moving, but very slowly, slower than cloud speed, and it was just sort of hovering there.  I would have taken a picture, but my phone was dead, which is ironic timing. ((ADDENDUM FROM WITNESS)) Hi Peter, Yes it was around 8:15-8:30 AM.  No one but me saw it (that I'm aware of).  I was flying by myself and didn't really want to be that freak in the window seat who was trying to get people to look at the UFO haha. It's amazing to me how many reported sightings there are. Thanks,",
      "link": "http://www.nuforc.org/webreports/120/S120680.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d36",
      "summary": "Four evenly spaced lights.",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2015-07-03T00:00:00",
      "story": "Four evenly spaced lights. Four, evenly spaced, bright, star like lights moving from East to West at approximately 60 degrees in the sky.   The lights did not trail, fall, or speed up.   They vanished.",
      "link": "http://www.nuforc.org/webreports/119/S119818.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e68",
      "summary": "Reflective solid object hung motionless in the sky before shooting off at an extremely high rate of speed.",
      "city": "charlotte",
      "shape": "sphere",
      "date": "2015-06-15T00:00:00",
      "story": "Reflective solid object hung motionless in the sky before shooting off at an extremely high rate of speed. Around 12:30 in the afternoon, I and one other person noticed a round metallic object hovering in the sky.  I'm making an educated guess based on the cirrus clouds in the sky with the object, that it was around 17000 feet in the air.   Although it was so high it was very easy to notice because it had a very shiny, metallic surface (like tin foil or stainless steel) and reflected the sunlight.  It appeared to be a single, solid object.  I am unable to to determine how large it was, only that it was very easy to see, as the sky was almost totally clear.   The object made no sound as it hung there motionless for about 1 minute.  I had enough time to point the object out to my friend and give him at least 20 uninterrupted seconds to observe it too.   The object then took off so fast that it almost seemed to have disappeared.  It left so quickly that I would have missed it had been blinking.   At that point I realized what we saw wasn't an aircraft.",
      "link": "http://www.nuforc.org/webreports/119/S119362.html",
      "state": "NC",
      "duration": "1.5 to 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f0b",
      "summary": "Flying disc stationary in clouds about NC.",
      "city": "charlotte",
      "shape": "disk",
      "date": "2015-06-05T00:00:00",
      "story": "Flying disc stationary in clouds about NC I was on a flight somewhere above northern North Carolina between 1900 - 2000 hrs.  We were beginning our decent and were going through the clouds and I looked out my window and observed a UFO of some sorts stationary in the clouds.  It was a disc shaped UFO.  I can best describe it as shaped liked Saturn.   It was round in the middle, a ball almost with the typical disc shape around it.  It had rotating lights around the perimeter of the disk portion of it and the front of the top of the circular area towards the left of the craft.   I don't know if anyone else on the flight saw it but I know for a fact that I saw it. ((ADDENDUM FROM WITNESS)) I wasn't able to take a picture.  I saw it and I had to look again and by the time I got my phone out we had passed it.  In all it was about 10 seconds that I was able to see it I think.  It was not moving, it was stationary.  It was in the clouds and it just happen to be in the upper portion of the clouds and thin enough that I was able to make it out.  The lights around the perimeter were rotating but I don't know if the craft itself was rotating or if it was just the lights.  ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/119/S119313.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ff4",
      "summary": "At least 15 unidentified orange objects in the night sky.",
      "city": "charlotte",
      "shape": "triangle",
      "date": "2015-05-22T00:00:00",
      "story": "At least 15 unidentified orange objects in the night sky. At 23:09 my dog was barking and alerted my attention to the sky with her growling. I then went outside and saw that there were at least 15 triangle shaped orange colored objects against a dark sky on the Eastern side. The objects were flying in an arch formation and some of them started disappearing behind the clouds. They were all the same color and shape, and moving quite slowly.  The objects were close to each other, and silent. When I grabbed my phone to take a picture, there were only 4 objects left in the sky. I cannot see the objects on the camera phone clearly.",
      "link": "http://www.nuforc.org/webreports/119/S119030.html",
      "state": "NC",
      "duration": "2.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4037",
      "summary": "I walked outside on my to get into the car and while I was in my driveway a blue beam of light zipped across the sky then disappeared.",
      "city": "charlotte",
      "shape": "light",
      "date": "2015-05-22T00:00:00",
      "story": "I walked outside on my to get into the car and while I was in my Driveway a blue beam of light zipped across the sky then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119070.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c41b7",
      "summary": "Silver egg-shaped objects following aircraft around Charlotte International Airport",
      "city": "charlotte",
      "shape": "egg",
      "date": "2015-04-17T00:00:00",
      "story": "My wife and I lived on Lake Norman from late 1992 to mid 2002.  Starting around 1998 we began to notice silver egg-shaped objects following aircraft around Charlotte International Airport.  I would estimate dozens of clear sightings from 1998 until 2001.  Most of the sightings were on clear, sunny days but some on cloudy, overcast days.  The craft were mostly viewed following south to north, which would be more with departing aircraft but on occasion they would follow aircraft on high-approach, north to south.  Sometimes above and behind and sometimes below and behind. I am ex-career Air Force so I have a pretty good knowledge of aircraft and flight behavior.  This was always a formation type pursuit as if they were pacing the aircraft.  If I were to judge distance I would estimate up to a quarter of a mile behind at times but on occasion we would see one directly above or below usually 300+ feet from the aircraft.   Objects would pace the aircraft from seconds to a few minutes and sometimes it was not uncommon to see the object switch and follow another aircraft.  This would go on from five to ten minutes and sometimes more.  Altitudes generally ranged from 3000 feet up to 5000 feet. The objects were always silver-metallic and egg shaped.  About a third of the size of the aircraft, generally a commercial airliner, 135 or DC-10.  There were no other markings on the object but you could clearly see it was sphere shaped and no flat surfaces visible.  A very polished and smooth looking object.  When the object left it was in an instant like a bolt of lightning.  Just a streak across the sky and then gone!  Can't imagine the G-Force it had to undergo when it disappeared. Never did set a pattern to when they would appear but it was often enough that neighbors and people we knew from around the general area would see them and talk about it.  Occasionally would witness objects with pulsating, multi-colored lights pacing aircraft at night but not very often.   Spent most of my young adult life on or around Air Force bases but have never witnessed anything like that before, or since I left the Lake Norman area. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118468.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42a8",
      "summary": "triangle shaped ufo seen in charlotte/huntersville are with only lights at points of triangle and made no sound.",
      "city": "charlotte",
      "shape": "triangle",
      "date": "2015-04-17T00:00:00",
      "story": "triangle shaped ufo seen in charlotte/huntersville are with only lights at points of triangle and made no sound. Driving back from Huntersville heading into Charlotte and saw triangle shaped craft, approximately size of football field.  Pulled into my destination and couple on deck was looking at same object. lights on points of triangle looked man made, so it was probably military, no telling though.  Event lasted about 5-10 mins then just disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118387.html",
      "state": "NC",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3c47c2",
      "summary": "I saw one bright, non-blinking object, high in the sky which gave no sound nor did it leave a streak as a meteor would.",
      "city": "charlotte",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "I saw one bright, non-blinking object, high in the sky which gave no sound nor did it leave a streak as a meteor would.   The object was travelling at a VERY high rate of speed - much, much faster than the space station - and was out of my view within 10-15 seconds, moving due NW to due SE with no vector, i.e. banking or turning in its route.",
      "link": "http://www.nuforc.org/webreports/124/S124162.html",
      "state": "NC",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c484c",
      "summary": "Orbs moving in sequence.  ((NUFORC Note:  Possible advertising lights, we wonder?  PD))",
      "city": "charlotte",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "Orbs moving in sequence. 5 orbs of lights moving in an in and out sequence joining in the middle.   Was seen on 11/17/15 at about the same time but near Huntersville, NC. ((NUFORC Note:  Possible advertising lights, we wonder?  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124179.html",
      "state": "NC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c484b",
      "summary": "Four orbs of light moving in a around each other consistantly.  ((NUFORC Note:  Possible advertising lights, we wonder?  PD))",
      "city": "charlotte",
      "shape": "circle",
      "date": "2015-11-19T00:00:00",
      "story": "Four orbs of light moving in a around each other consistantly ((NUFORC Note:  Possible advertising lights, we wonder?  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124180.html",
      "state": "NC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4846",
      "summary": "Bright white lights form pyramid in the sky, which then changed into a straight line of lights whose trails connected them together.",
      "city": "charlotte",
      "shape": "changing",
      "date": "2015-11-20T00:00:00",
      "story": "Bright white lights form pyramid in the sky, which then changed into a straight line of lights whose trails connected them together. I was driving back from school where I attend at ITT Tech North Charlotte campus.  I was driving down I-485 inner southbound towards exit 13 which led to the I-85 southbound ramp when I had caught sight of a strange pattern of bright lights behind the tree line.  It looked like a mountain was lit up with stadium lights, triangular in shape but very very bright.  I tried my best to catch a better glimpse of it and when I did catch a better glimpse the object in question had changed from a triangle pyramid like structure to a straight line in the sky.  I stared at this in awe for a moment, tried to make sense of it.  I almost missed my exit from staring for so long.  Just as i was turning each light appeared to leave a long trail behind it connecting to the next as if they were all moving in unison.  When I had merged onto I-85 southbound the structure was now behind me and I could no longer see it however I obsessed over the thought of it on the rest of the way home, and filed this report immediately.  I had thought that they may have been planes but I had also seen a plane on my car ride home and the two were not similar at all.",
      "link": "http://www.nuforc.org/webreports/124/S124196.html",
      "state": "NC",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ce3",
      "summary": "Light formation near uptown Charlotte.",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2015-09-02T00:00:00",
      "story": "Light formation near uptown Charlotte. My significant other and I saw a light formation flying from the area of uptown Charlotte, moving south, at about 9:15 p.m. Friday, August 21st.  We live just a few blocks outside of uptown.   The lights were spotted as they moved over an apartment building on the uptown side of the condo, and they flew directly over the condo.  There were a couple helicopters in the area at the time (due to a ruckus at a baseball game uptown that was occurring).  An airplane also flew by/below the light formation.   It took about two minutes from the time we spotted it over the next door building to the time it had disappeared over our building and was out of sight.   My SO grabbed binoculars and reported that the lights looked like discs with lights, but he also could not get the binoculars focused (I grabbed the iPhone).",
      "link": "http://www.nuforc.org/webreports/121/S121508.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d07",
      "summary": "((NUFORC Note:  No information provided by witness.  PD))",
      "city": "charlotte",
      "shape": "circle",
      "date": "2015-09-11T00:00:00",
      "story": "((NUFORC Note:  No information provided by witness.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121822.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4eea",
      "summary": "Strange lights.",
      "city": "charlotte",
      "shape": "circle",
      "date": "2016-03-18T00:00:00",
      "story": "Strange lights. My wife and I spotted 12 or more orange lights coming from the southeast.   They kept coming over the horizon and disappeared one by one.  There was no sound, contrails, nothing!  Bizarre! ((NUFORC Note:  We have confirmed that the sighting occurred at 2200 hrs., and have amended the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126323.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f5c",
      "summary": "Daytime sighting of Boeing 737s suspended motionless in air over 485 outside Charlotte.",
      "city": "charlotte",
      "shape": "other",
      "date": "2016-03-04T00:00:00",
      "story": "Daytime sighting of Boeing 737s suspended motionless in air over 485 outside Charlotte My mom and I witnessed several motionless jets in the sky over 485 outside Charlotte, NC, on our drive from 85 north to 77 north.  The jets appeared to be Boeing 737s and they were only a few hundred feet above the highway. The weather on Sunday, February 28, 2016, was sunny and completely clear with only light winds.",
      "link": "http://www.nuforc.org/webreports/126/S126105.html",
      "state": "NC",
      "duration": "5 minutes+"
    },
    {
      "_id": "64d005f478aba2ec5a3c557d",
      "summary": "White light that made no noise, moved very fast, low moving, very bright, pulsates, able to disappear and reappear in a blink of an eye",
      "city": "charlotte",
      "shape": "circle",
      "date": "2016-07-08T00:00:00",
      "story": "White light that made no noise, moved very fast, low moving, very bright, pulsates, able to disappear and reappear in a blink of an eye I was outside star gazing with my new telescope I recently purchased.  I look up at the sky towards the airport and I see nothing, I turn around and then look again to see a small but bright pulsating light (white light) appear from no where.  This light was away from any airplane routes that planes take to either land, or take off from the airport.  It was hovering for a few seconds then started to move north (left on my camera.  I did get a recording of this object) it made no noise, and was not very high up.  Moved very fast, was able to come to a complete stop in the sky within seconds.  I followed this object for about 30 seconds until it started to flicker.  The object/light.  Disappeared after flickering.  It reappeared again only to disappear within a few seconds. Note:  there were NO clouds in the the path of the object.  There were clouds but very far in the distances...No way clouds could have made this object \"disappear\"   This light was very strange, I have seen other lights like this over the years, but in many different colors.",
      "link": "http://www.nuforc.org/webreports/128/S128147.html",
      "state": "NC",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5639",
      "summary": "3 orange/yellow lights in a triangle on E Independence.",
      "city": "charlotte",
      "shape": "triangle",
      "date": "2016-07-22T00:00:00",
      "story": "3 orange/yellow lights in a triangle on E Independence. Driving down E independence toward uptown Charlotte around 11:50 pm, I saw 3 orange/yellow lights in a triangle….it was a lot bigger than a plane and seemed a lot lower than a plane would fly and there was no sound that I heard. I have never seen anything like this and I was so freaked out I wish I could go back because I should have pulled over and filmed it.",
      "link": "http://www.nuforc.org/webreports/128/S128519.html",
      "state": "NC",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c58a5",
      "summary": "Several orbs in the morning sky off Alexander Road near Provindence Road.",
      "city": "charlotte",
      "shape": "formation",
      "date": "2016-06-10T00:00:00",
      "story": "Several orbs in the morning sky off Alexander Road near Provindence Road. I was on my way to work this morning and I saw an interesting cloud formation in the sky. I took a photo of it, and when I reviewed the photo, I saw several glowing orbs in the lower right hand corner of the photo.  There was a larger one behind a tree and several in a line formation above it. Very interesting craft. ((NUFORC Note:  We have reviewed the photo, and the only definitive image, located in the right hand lower corner of the photo, are multiple objects which appear to be reflections off the inside of the windshield.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127780.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c598b",
      "summary": "Blue orb with aura seen on American Airlines flight near Charlotte, NC, airport.",
      "city": "charlotte",
      "shape": "circle",
      "date": "2016-05-20T00:00:00",
      "story": "Blue orb with aura seen on American Airlines flight near Charlotte, NC, airport. On an American Airlines flight \"Leg\" with my wife and daughter from Orlando, FL, to Charlotte, NC, I looked out my window as the airplane was slowing and beginning its decent to the airport (at cloud altitude) on May 14th, 2016, at approximately 6:45pm.  The weather outside was blue sky and partly cloudy. I saw a blue orb not far from the plane at our altitude (just above and aft of the right wing) in a mix of clouds and blue sky.  The orb was distinctly circular, small, and stood out because the shade of blue did not match the sky around it.  It definitely had an aura to it. It appeared to be standing still because our plane did not zoom past it.  I had a clear view of it long enough to watch it slowly pass my window, turn to tell my wife, \"Do you see that?\", then turn back and see it go by the passengers window sitting behind me.  It was clearly not a strange reflection in the window because I saw it from the second vantage point through the other passenger's window at a different angle.  The lights in the cabin were also turned off.   It was difficult to determine an approximate distance since I had no reference.  Very strange.",
      "link": "http://www.nuforc.org/webreports/127/S127343.html",
      "state": "NC",
      "duration": "6-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5df2",
      "summary": "White very bright burst of light.",
      "city": "charlotte",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "White very bright burst of light Very bright white burst of light appeared out of nowhere that was extremely high in the sky.  Then it dimmed to a medium intensity and streaked straight down at incredible speed leaving a trail from its starting point and then it and its trail disappeared half way down to the ground.  I was approximately half mile from light burst driving straight towards it and it was almost in the very top center of my windshield.  The sky was dark.  I could not see any object associated with this light burst.  Just the light itself.",
      "link": "http://www.nuforc.org/webreports/131/S131495.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5df9",
      "summary": "11/03/16; 15 white lights traveling west to east in Charlotte NC at 19:10. 2-3 minutes observing them",
      "city": "charlotte",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "11/03/16; 15 white lights traveling west to east in Charlotte NC at 19:10. 2-3 minutes observing them In Charlotte, North Carolina (28227) at approximately 7:10pm, on Thursday, 11/03/16, my wife and I observed 15 white lights (circular) moving in formation and they appeared to be independent of each other.  They were no brighter than the surrounding stars.  They moved from the west going east (75 degrees WNW according to my cell-phone compass). They were directly overhead and appeared to us to be at an altitude of in-flight commercial aircrafts.  They traveled as fast as commercial planes at cruising altitude. There was no sound and they traveled in a straight path.  There was some position changing within the formation.  According to weather.gov, the wind was calm at 18:53 and 5 mph from the SW at 19:53.  Our observation was at 19:10. We did not feel or observe any wind. At first sight, I was alone. I saw 10 white lights (round) in a staggered row from left to right with 5 trailing in a 2-1-2 pattern.  I went to get my wife so she could see/confirm.  This took 15-20 seconds.  Upon our return outside, the staggered row contained 12 white lights and three were trailing in a 2-1 pattern.  They did not appear to blink, but periodically, a few would indiscriminately fade out then back to full glow.  This process took 2-3 seconds.  It was a clear, cloudless night.  The total observation took 2-3 minutes.  The lights were very similar to the lights videoed in Charlotte, NC, on 10/15 and posted to YouTube.    .   .   .   .                                            .    .     .    .   .   . .    .   .   .                                               .   .   .   .   .   . .    .                                                          .        . . .     .                                                             .  The first pattern                                                 The second pattern",
      "link": "http://www.nuforc.org/webreports/131/S131040.html",
      "state": "NC",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f1c",
      "summary": "I viewed a glowing orb pulsing bright periodically and move slowly hovering.  ((anonymous report)) ((Star??))",
      "city": "charlotte",
      "shape": "circle",
      "date": "2016-10-27T00:00:00",
      "story": "I viewed a glowing orb  pulsing bright periodically and move slowly hovering. This happen at 3:00am clear skyies It was not a airplane did not fly like a plane it was not a star. i was ruling out every logical explanation.  It didnt move for a while just a glowing orb or sphere of light silver in a single color the light will pulse brighter periodically the light was on the whole time, but the light would pulse bright.  When it did move, it was Wobble like hovering or moving slowly then made a shape right and left it was fast but at an angle not straight.  It was gone in a blink of an eye.  This was the second time I have seen it.  Did not believe it the first time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130860.html",
      "state": "NC",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c612e",
      "summary": "Starting on Tuesday, October 18th around 6:30pm in North Carolina, I noticed that just above the sunset was what I thought was a star..",
      "city": "charlotte",
      "shape": "light",
      "date": "2016-10-21T00:00:00",
      "story": "Starting on Tuesday, October 18th, around 6:30pm, in North Carolina, I noticed that just above the sunset was what I thought was a star.. albeit really bright star, but seemingly just a star.  Not to be confused with the Nibiru idea.  This does not resemble a second sun, but it looks like a star that just happens to be about 2-3 times larger than even the brightest star visible from here..not as large as the sun, or moon.  It stood out because I stare at the sky everyday into the evening and night and have never noticed it.  Apon watching it, I realized it was moving extraordinarily slow with the help of the trees as a reference.  It was not moving like a plane, or at plane speed, nor did it resemble a plane..or even a satellite.  I watched it for about 25 minutes and then it was just gone..not out of the line of sight, or over the horizon, but simply gone.   The next day it was there again.  And today it was there again.  At first I believed it was simply a star, but then upon research found that several people over the past week, or so have noticed it worldwide.  So far the only reports from the US have been from southern states.  Most reports from Australia and other countries.  There have been photos.  It appears to be more of a circular ripple rather than a 3 dimensional object.  There have also been infrared images of the sun with this thing showing up in them.  I do not believe it is Nibiru.  I'll try to find more on it, but as of now it still seems fairly new.",
      "link": "http://www.nuforc.org/webreports/130/S130737.html",
      "state": "NC",
      "duration": "3 days"
    },
    {
      "_id": "64d005f478aba2ec5a3c6233",
      "summary": "Blue light object traveling like a flash light disappeared in to clouds.",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2016-09-22T00:00:00",
      "story": "Blue light Object travelling like a flash light disappeared in to clouds. I see a Blue light coming out of object.It was travelling very fast like a flash. It disappeared in to clouds in few seconds.",
      "link": "http://www.nuforc.org/webreports/130/S130059.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c628f",
      "summary": "During a power blackout in Highland Creek about 3AM, a cluster of 4 lights at tree top level passed quickly. ((anonymous report))",
      "city": "charlotte",
      "shape": "unknown",
      "date": "2016-09-15T00:00:00",
      "story": "During a power blackout in Highland Creek about 3AM,  A cluster of 4 lights at tree top level passed quickly by my bathroom window.  One of the 4 lights was blinking red.  I could not identify the shape of the craft but It was clearly one craft with 4 lights.  I made no sound as it went by.  I could see the light from object clearly because there was no other light source in the area at the time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129917.html",
      "state": "NC",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6aee",
      "summary": "Cigar shape craft with lights inside over Charlotte",
      "city": "charlotte",
      "shape": "cigar",
      "date": "2017-02-03T00:00:00",
      "story": "Cigar shape craft with lights inside over Charlotte, NC.   My ex-wife and I were sitting at a red light at the intersection of Independence blvd. and Idlewild Road.  We were facing North.  We notice to our right about half a block away some type of flying craft just above tree top level.  It was moving very slowly.  It appeared to be silver in color, cigar shaped and had a row of windows on its side.  It appeared to have lights on inside.   At first I thought that is was a airliner flying very low and I even tried to see any people sitting in the craft.  However, we soon realized that this was not a airliner.  When the light at the intersection turn green, we crossed the intersection and went into the parking lot of a large bargain store.  I parked the car facing east.  We observed the craft continuing to travel across Independence Blvd. at a very slow rate of speed.  We also noticed that everything became real quiet.  We could not hear the traffic nor could we hear our vehicle running although we could hear each other talking.   We were able to get a good look at it as it crossed the highway.  Although it appeared to have lights on inside, we did not see anything or anybody inside the craft.  As the craft reached the center of Independence Blvd., it stopped, hovered for about a minute and then began to travel toward the east over the highway.  Although it was now heading away from us, we never lost sight of the row of lighted windows that were facing us.  We watched the craft until it disappeared heading east. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132339.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7016",
      "summary": "I seen a light go across the sky tonight, and for about an hour, I heard booms every couple minutes.  ((anonymous report))",
      "city": "charlotte",
      "shape": "flash",
      "date": "2017-08-24T00:00:00",
      "story": "I seena light go across the sky tonight and for about a hour I heard booms every couple minutes and when my wife came out it stopped but we still seen the lights but sh thought it was thunder then, but I know what I seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135864.html",
      "state": "NC",
      "duration": "3:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c721e",
      "summary": "Round and round they went and in and out also.  ((NUFORC Note:  Possible advertising lights??  PD))",
      "city": "charlotte",
      "shape": "disk",
      "date": "2017-06-02T00:00:00",
      "story": "round and round they went and in and out also lighted disc about 10 feet in front of me kept going round and round in circles in and out for about 11 minutes I just stood and watched they seemed to come close then move back and then they were gone. ((NUFORC Note:  Possible advertising lights??  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134175.html",
      "state": "NC",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7283",
      "summary": "Flock formation of unidentified craft, appearing as blue strobing lights.",
      "city": "charlotte",
      "shape": "formation",
      "date": "2017-07-14T00:00:00",
      "story": "Flock formation of unidentified craft, appearing as blue strobing lights First spotted four lights coming across the horizon in a diamond formation.  These were followed by several more in a flock.   The lights appeared far away, behaving like fireflies, but it was obvious they were MUCH larger.  Definitely not airplanes (there was a plane elsewhere in the sky at the same time and it was nothing similar in appearance or behavior).   The lights flocked across the sky slowly, glowing off and on like fireflies.  The lights were slightly bluish in color.   Spotted from the smoking patio of The Milestone Club on Tuckaseegee ((sic.  Tuskegee??)) Dr. Did an internet search to see if there were any other reports of this sighting, found this video of an almost identical sighting also in Charlotte from 10/15/16:  https://youtu.be/qxLEnqsUYS4",
      "link": "http://www.nuforc.org/webreports/135/S135138.html",
      "state": "NC",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b73",
      "summary": "Bright starlike light that moved erratically",
      "city": "charlotte",
      "shape": "circle",
      "date": "2017-11-03T00:00:00",
      "story": "Bright starlike light that moved erratically It appeared to be a bright star that was noticed while taking the dog out.  An airplane caught our eye and led our sights to a bright light that seemed to be an airplane, but moving erratically.  It moved up and down in a graceful movement bet then would go side to side in a jerking movement.  It was seen with just the naked eye and it seemed to have some colored lights.   Occasionally one witness saw what appeared to be some white streaking light beams in thin lines around it but the other two witnesses did not see that.  It was cold out so we did not stay out long.  We looked on an app called sky view and it seemed to be in the vicinity of Taurus and the Pleides seven sisters stars.",
      "link": "http://www.nuforc.org/webreports/137/S137060.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7be2",
      "summary": "Cylinder object with lights and green light and/or beam observed by family in Charlotte, NC.",
      "city": "charlotte",
      "shape": "cylinder",
      "date": "2017-10-05T00:00:00",
      "story": "Cylinder object with lights and green light and/or beam observed by family in Charlotte, NC. Observed what I thought was a drone, or satellite, 9/26, 9/27, 9/28 of this week.  I started taking pictures and the object would move as I was taking the the shots in fast short movements, almost triangle pattern.   The object had lights that would come on and off when another aircraft flew nearby.   When I started to review my pics, I have a green bar or laser coming down from object in distance in one shot, and in others when object right over head the green light is focused on me.  The object has been over our house all week includingl last night.  I have pictures and video and need someone to help explain this.   I made my wife and our 14 son come out and see last night..they noticed it turn lights out when commercial plane came close",
      "link": "http://www.nuforc.org/webreports/136/S136455.html",
      "state": "NC",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d3b",
      "summary": "Bright orange orbs.  ((anonymous report))",
      "city": "charlotte",
      "shape": "triangle",
      "date": "2017-09-14T00:00:00",
      "story": "Bright orange orbs My son was outside waiting for his school bus to come and he called me and said “Mommy, remember the thing we saw last year on July 4th?  Well, it’s outside again.\" I was in shock, and immediately told him that I was going to look outside from my bedroom window to see if I can see it.  I saw it and told him I was going to call him back, since I had to record it on my phone.   I looked and saw the orange orbs.  It was getting brighter, then it would fade, then reappear. I saw it was getting closer to where I saw an outline of a triangle and I started to get scared because this was the closest I have seen it and I do not want to see it that close because it creeps me out.   I had to get ready for work so I had to stop looking outside.  I went back to look out the window and it was back again.  Outside was getting lighter and I saw it and recorded it.  I recorded it 3 separate times on my phone. This is the second time we have seen this in our neighborhood. ((NUFORC Note:  We have not received the photos, and have no means of contacting the witness, since she provides no contact, or personal, information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136141.html",
      "state": "NC",
      "duration": ">20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c80f9",
      "summary": "Saturday night, I saw a staggered line of 15 or 20 large round orange balls flying over my backyard with no sound.",
      "city": "charlotte",
      "shape": "circle",
      "date": "2018-03-08T00:00:00",
      "story": "Saturday night, I saw a staggered line of 15 or 20 large round orange balls flying over my backyard with no sound. On Saturday night, around 7:15pm, I went out onto my back deck to grill out.  As soon as I hit the deck, I immediatly saw a line of large round orange balls, heading from north to south towards our airport.  They were in a straight line as far as I could see.  From left to right the sky was full of them, I would say about 15 to 20 orbs, but each was staggered behind each other, all at the same altitude, approx 1,000 to 2,000 ft above my location, and approx 75 to 100 feet apart from each other.   As soon as I saw them, I went back into the house and yelled for my wife to come out here, she came immediately and saw what I was seeing.  As they flew by the last ones about 4 or 5 of them started to go dim and then they went totally dark, it was mind blowing, they had no sound and were very bright orange they had no red, green or white nautical (sic.  navigation?) lights on them.   About 5 or 6 minutes later, I called 911 and reported what we saw. ((NUFORC Note:  We spoke via telephone with this witness, and he sounded to us to be quite sincere, and sober-minded.  We suspect that he is a highly reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139058.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c820a",
      "summary": "At approximately 3:00 p.m., I was driving in the car and had parked in a carpool lane to pick up my kids from elementary school. The sk",
      "city": "charlotte",
      "shape": "other",
      "date": "2018-01-25T00:00:00",
      "story": "At approximately 3:00 p.m., I was driving in the car and had parked in a carpool lane to pick up my kids from elementary school.  The sky was perfectly blue but I noticed it had rivers of chemtrails.  They were not clouds.  I counted at least 2 \"planes\" initially spraying the chemtrails.  See photos for how robust the trails were.  The \"planes\" were spraying and then the trail was dissipating and flowing like a river in the sky. After picking up my kids, I parked the car in the parking lot to get a better look at the planes.  This was about 3:12 p.m. The \"plane\" closest to us looked to be right overhead, and looked white or metallic and very bright.  It was spraying a chemtrail and then it ran out of spray and continued flying in a straight line heading back into the blue sky over the school.  I thought it looked more like a TUBE than a plane.  It also was low enough that I would have expected to hear an engine noise, but it was silent. I looked away for just a few moments to get my camera phone from the car.  My 14-year-old daughter, in the meantime, had her phone camera and was snapping shots.  When I looked back up at the sky, the \"plane\" had completely disappeared and was nowhere to be seen in the expanse of the blue sky.  It just vanished. With 3 kids in the car, I started to drive home, and on our way, saw several other \"planes\" in the sky--I counted about 6 of them in the distance, in close proximity to each other, all spraying straight chemtrails.  I pulled over to the side of the road to observe them and pointed them out to the kids.  I asked my daughter to get shots of the many planes, but she was unable to capture the shot with all of the planes, but she did get the chemtrails in criss-cross patterns. With the kids in the car, and very astonished, I decided to drive around the corner block and return to the point where I could view the planes again.  It took us no more than 2 minutes to drive around the block to the same spot.  By then, every single plane had completely vanished, just like the other one.  This was simply not possible. We caught the photos and now see that the vehicle closest to us did not look like a plane, but a SHINY, METALLIC, TUBE WITH OVAL SEGMENTS IN AN ANT-LIKE SHAPE and there seems to be some kind of black tubing wrapped around the side.",
      "link": "http://www.nuforc.org/webreports/138/S138561.html",
      "state": "NC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c82aa",
      "summary": "Saw a small orb with a bright blue light shining at plane on takeoff out of Charlotte, NC.  ((anonymous report))",
      "city": "charlotte",
      "shape": "circle",
      "date": "2018-11-09T00:00:00",
      "story": "Saw a small orb with a bright blue light shining at plane on takeoff out of Charlotte, NC. Was on a flight taking off out of Charlotte Douglas en route to Boston, MA.  A few minutes into take off (but close to cloud line), I looked out the window and saw a small grey orb with a bright led like blue light moving in the opposite direction of the plane's travel. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143608.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8523",
      "summary": "Black rectangle object moving East over Charlotte, NC in CLT airspace",
      "city": "charlotte",
      "shape": "rectangle",
      "date": "2018-09-13T00:00:00",
      "story": "Black rectangle object moving East over Charlotte, NC in CLT airspace. Black box/rectangle-shaped object moving from West to East (approximately from Gastonia towards Monroe) over Charlotte, NC, above commercial aircraft landing airspace for CLT.",
      "link": "http://www.nuforc.org/webreports/142/S142980.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8628",
      "summary": "Uncountable orbs similar to millions of fireflies Flying high in sky. Travelling from Nw to SE then slowly disappeared.",
      "city": "charlotte",
      "shape": "circle",
      "date": "2018-08-10T00:00:00",
      "story": "Uncoutable orbs similar to millions of fireflies  Flying high in sky.  Travelling from Nw to SE then slowly disappeared.",
      "link": "http://www.nuforc.org/webreports/142/S142461.html",
      "state": "NC",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c86e4",
      "summary": "Bright orange orb travels and disappears.",
      "city": "charlotte",
      "shape": "fireball",
      "date": "2018-08-17T00:00:00",
      "story": "Bright orange orb travels and disappears. Wife and I where driving eastbound on Arrowood Rd towards Walmart when we looked towards the sky and the thin crescent moon.  Up in the sky there was an orange glowing dot that seemed to get bigger and bigger.   I asked my wife if it looked like an airplane and she said yes it then took her words back as we continued to drive.  The ball moved westbound and it looked like a faraway ball of fire.   As the light grew bigger we both realized it wasnt a recognizable aircraft.  I asked my wife to record as we attempted to make a U-turn on the boulevard to keep watching and hopefully record it.   As we stopped, the ball suddenly disappeared out of the sky.  We where both skeptical about what we saw as it was not common.",
      "link": "http://www.nuforc.org/webreports/142/S142718.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fe6",
      "summary": "Triangle yellow lights in the night sky.",
      "city": "charlotte",
      "shape": "triangle",
      "date": "2018-11-24T00:00:00",
      "story": "Triangle yellow lights in the night sky. I have a four-year degree and am working on my Masters degree.   I was traveling up I-85 in-between Charlotte and Salisbury, traveling north-east.  As I was driving, I was looking periodically into the sky at the numerous airplanes with their flashing lights.  Almost 6-8 airplanes were flying and moving in all directions across the sky in different directions.   Then as I look up again, I see 2 lights beside each other straight ahead in the sky and at first, I thought they were just stars because they were not moving or flashing, but I could notice they were brighter than any star in the night sky.  As I got closer it seemed to be getting bigger and was not really moving but seemed to be hovering, almost as if it was studying the nearby airport.  It looked to be roughly 5 miles in the sky right in front of the road.   As I moved closer to it in the car, I could see vividly the 2 lights were now 3 in a triangle. They were a yellowish orange light and still at this point, were not flashing like all the other airplanes in the night sky.  As I drove almost directly under it, I could tell it wasn’t moving or moving extremely slowly, as I saw the triangle of yellow-orange lights that looked to be about the size of two airplanes given the distance.   When we passed underneath it I looked back for a second it looked to be getting smaller and moving higher and away at about a 70 degree angle.  I’m not sure what I saw but it was not acting like, nor looked like any of the other half a dozen airplanes in the night sky.   The 3 bright yellowish orange lights seemed to take up more than half of the bottom of the craft.",
      "link": "http://www.nuforc.org/webreports/143/S143854.html",
      "state": "NC",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9047",
      "summary": "1st night saw rectangle rimmed with lights, gliding, then next night, along same path, saw 4 orbs, rotating, creating geometric shapes.",
      "city": "charlotte",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "1st night saw rectangle rimmed with lights, gliding, then next night, along same path, saw 4 orbs, rotating, creating geometric shapes. It was 3/96, during the time that Comet Hyakutake was visible, so I was looking up trying to see the comet, from the parking lot of my apt complex.  It was around the time of the new moon, so stars were prevalent.  What caught my eye was what looked like stars “moving”.  It was in fact, the outline of a large rectangle, moving across the sky. It had lights around the rim, so what I was seeing, was the moving lights against the stars, rimming what looked like a perfect rectangle.  I followed it gliding in a straight line, not sure what direction it was, until trees blocked it, maybe 30 seconds to a minute.  It was not very high, in the sky, maybe the height of a 20-story building (I grew up in NYC). The next night, feeling freaked out by what I had seen, I had my roommate come outside with me, to “see the comet”, but I needed to face my fear.  It was about 11pm, about an hour or so later than the sighting of the night before.  Along the same stretch of sky, almost the same “path” as the rectangle, we saw 4 orbs, perfectly round, bright lights, descending slowly from pretty high up, maybe 20 to 30 stories up, higher than the rectangle from previous night.  As they descended, they were forming geometric shapes & rotating.  They’d form a circle, square & an elliptical, all while rotating slowly.  Against logic, I moved under them, watching them form the shapes & rotate.  They descended very low, maybe 15 stories, give or take; I grew up in a 17-story building, it looked like they descended lower than the height of the top floor of that building, directly above my head & still rotating & forming shapes.  Directly beneath them, I could see the space between them, they did no! t look attached at all, but definitely more like 4 entirely separate orbs. After, what I’ve since described as their “showboating”, because that’s really what it felt like, making geometric shapes, slowly, in the sky over my head, about 3 or 4 minutes, they started to move, almost exactly along the same path as the rectangle the night before, still forming shapes (mostly squares & circles at this point) & still revolving around eachother, but each together gliding along that same path, until out of site, by the same trees, moving a little slower than the rectangle the night before.  They were definitely not as high up as the rectangular object.  But both nights, there was absolutely no sound from either one, complete silence.  They were both low enough, that had they been an aircraft of some kind, we should definitely have heard something. At first my roommate corroborated my sighting completely, there were no other witnesses the first night.  However, we were both quite spooked by what we saw & although she described the same thing I saw, for several months, she eventually started to say it “never happened” or that it was “explainable”.  She never did give another explanation though, she just didn’t want to talk about it. We haven’t spoken in many years, I don’t know if she’d be willing to talk about it now.",
      "link": "http://www.nuforc.org/webreports/150/S150893.html",
      "state": "NC",
      "duration": "1 min, first, then 5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3c9224",
      "summary": "Me and my friends were kickin back one night. we had been up for awhile so the sleep deprivation started getting to us. We decided to g",
      "city": "charlotte",
      "shape": "cigar",
      "date": "2019-12-01T00:00:00",
      "story": "Me and my friends were kickin back one night. we had been up for awhile so the sleep deprivation started getting to us. We decided to go outside on the front porch of our apartment and have a cig when we saw it. It came out of nowhere, kind of like a light turning on. It was just there, nothing to build it up or anything. It just appeared. I never actually saw a physical alien, the craft just sorta hovered there. I think they might have just been observing or scanning or some other weird alien thing, studying us. It was only there for a few minutes but when i saw it it startled me and my friend greatly. As soon as i saw it the air grew still. There was a great eerie vibe in the air that ran chills down our spines, sorta hard to explain but not a good feeling. The craft looked like it had a metallic aluminum like appearance. It didn't make any noise but there were blinking lights near the bottom. It was only half a football field long and one story tall. Nobo! dy believes my story but i hope that you guys will and that someone else has a similar experience.",
      "link": "http://www.nuforc.org/webreports/149/S149939.html",
      "state": "NC",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9805",
      "summary": "Large white circular object flying across sky",
      "city": "charlotte",
      "shape": "circle",
      "date": "2019-12-19T00:00:00",
      "story": "Large white circular object flying across sky My sister and I were out tonight going on a walk together. The sky was clear and we could see all the stars, and there was a full moon. It was around 10:10 p.m. on December 14th 2019. We saw, at the same time, a large circular bright white light. It looked like a star, but a lot larger and closer by. We saw it moving diagonally very fast, for about 3 seconds, and then it vanished completely. It left no trail behind. It made no noise.",
      "link": "http://www.nuforc.org/webreports/151/S151638.html",
      "state": "NC",
      "duration": "3 seconds"
    }
  ]
}