{
  "city": "chattanooga",
  "fetch_timestamp": "2025-07-12T14:36:51.890190",
  "record_count": 45,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b45fc",
      "summary": "A bright orange fireball rose up slowly  from behind the tree line and then swiftly moved to the right and vanished.",
      "city": "chattanooga",
      "shape": "fireball",
      "date": "2019-08-23T00:00:00",
      "story": "A bright orange fireball rose up slowly  from behind the tree line and then swiftly moved to the right and vanished. While driving down the highway last night,  a single bright orange fireball arose vertically over the tree line in the horizon.  It glowed brighter and  brighter and seemed to increase in size. Once it reached the middle of the sky it began swiftly moving to the right and vanished. It was me, my brother, and my sister.  We could not believe our eyes. We could not figure out what it was. As soon as it appeared, it vanished.  It left an eerie silence in its wake. Later that night, after I went to bed, I vaguely recall waking up and seeing  crazy lights flashing in my window and a hearing a strange rumbling noise.  I tried to fully wake up but I couldn’t, it was like I was stuck in a haze.  I finally snapped out of the “haze”  when my dog jumped on my bed and started wining.  I assumed there was a thunderstorm (I thought what I had experienced was lightening and thunder and my dog only whines during storms) but when I checked  the weather it was crystal clear.",
      "link": "http://www.nuforc.org/webreports/147/S147979.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b57ca",
      "summary": "U.F.O.s over Tennessee",
      "city": "chattanooga",
      "shape": "other",
      "date": "2008-06-12T00:00:00",
      "story": "U.F.O.s over Tennessee On Fri. the 18th at Midnight 6 witnesses and I witnessed a U.F.O. over Tennessee. My mother (who does not believe in U.F.O.s) said she saw a light in the sky. I went out to investigate and up in the sky was a light, which at first I dismissed as a star. I was about to walk back inside when I saw this craft move at incredible speed closer to us. It was then that I noticed that what I was looking at was NO STAR! It was cigar shaped with a long triangular strut coming off the top and two smaller ones coming out the bottom, kind of like landing gear. I noticed yellow and green lights rotating around the craft with a large yellow light on top of the large triangular strut. It hovered COMPLETELY noiseless for about 10 minutes, then me and my family witnessed 3 or 4 smaller crafts come out of the bottom and fly away. The speeds of these crafts were humanly impossible! The smaller crafts were pulsating green lights. After about another 8 minutes we all witnessed the smaller crafts re-enter the large one. It continued to hover for a couple of minutes then it just disappeared right before our eyes! I just want to let everyone know that this is NO HOAX! I am very good at debunking things but I can never debunk what my family and I saw that night. I have also heard numerous reports on the internet about a lot of other people seeing these objects not only in Tennessee but in other states as well. I hope more people come forward about these sightings.",
      "link": "http://www.nuforc.org/webreports/062/S62662.html",
      "state": "TN",
      "duration": "20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b58bd",
      "summary": "My daughter was in the backseat of our vechicle recording on her cell phone, when her and my son said they saw a shooting star.  When w",
      "city": "chattanooga",
      "shape": "diamond",
      "date": "2008-06-12T00:00:00",
      "story": "My daughter was in the backseat of our vechicle recording on her cell phone, when her and my son said they saw a shooting star.  When we viewed the recording it was a single diamond shaped light moving at a high speed and shortly after four more diamond shaped lights followed at the same speed.",
      "link": "http://www.nuforc.org/webreports/062/S62632.html",
      "state": "TN",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6205",
      "summary": "6 Diamond shaped objects over Chattanooga, TN",
      "city": "chattanooga",
      "shape": "diamond",
      "date": "2008-03-04T00:00:00",
      "story": "6 Diamond shaped objects over Chattanooga, TN There were 6 objects in a pattern hovering in the air. They were each diamond shaped with lights on them. They would be in the air and then I could see them come down one by one and as they came down, the light would go off then come back on. There was a helicopter circling the object but it would not get very close. I stood and observed them for what felt like 10 minutes.",
      "link": "http://www.nuforc.org/webreports/060/S60373.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ed6",
      "summary": "object appears to be flying slightly above and almost parallel to jet",
      "city": "chattanooga",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "object appears to be flying slightly above and almost parallel to jet Observed a jet flying east at approximately 2:00 pm...out of nowhere another object appears to be flying slightly above and a little behind..if I held up 2 fingers and measured the distance..less than 1/4 inch apart...quickly caught up with first jet and seemed to speed up and slightly passed it and then just disappeared...sky had patchy clouds and this was seen in a clear, blue area. The first jet appeared silverish and the questionable object was considerably darker in color and larger.",
      "link": "http://www.nuforc.org/webreports/054/S54537.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b76f4",
      "summary": "a or multiple flashing lights perfictally syncronized",
      "city": "chattanooga",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "a or multiple flashing lights perfictally syncronized I was in the car going home and looked out the window twords the moon.  in a couple of seconds I saw 5 sequenced strobe lights flash as if an object with one light on it was moving fast starting from a stand still.  The object was moving at such a speed that it almost looked like a blur but still distenct, like it was rapidly stopping and then moving again.it made a low pitched sound that made only my ears ring. Than after a minute it was GONE.",
      "link": "http://www.nuforc.org/webreports/053/S53479.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c4e",
      "summary": "bright green light, silent, moving slowly, turned, shot forward and was gone",
      "city": "chattanooga",
      "shape": "changing",
      "date": "2006-12-07T00:00:00",
      "story": "bright green light, silent, moving slowly, turned, shot forward and was gone I was driving down a busy road during late rush hour. Out of mt peripheral vision to the left, at about 100 feet above the ground, I saw a huge round intense green light. It was silent. It turned upward and looked like it had 2 parts to it, shot forward and was gone. A policeman was in front of me and many people were behind me. the policeman actually pulled over and got out of his car and looked towards where the object had been.",
      "link": "http://www.nuforc.org/webreports/053/S53666.html",
      "state": "TN",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7cbd",
      "summary": "Several flashes of light from a stationary point very high in the night sky, followed by a moving fuzzy red light",
      "city": "chattanooga",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Several flashes of light from a stationary point very high in the night sky, followed by a moving fuzzy red light 10/24/06, 20:50 Sky conditions clear, Milky Way plainly visible.  Approximately 8:50 pm as I stepped out onto our second floor deck a bright white star like flash of light high in the night sky caught my eye, it originated from a point about 80 degrees up and directly in the SSW.  I continued to watch the area thinking it was just a plane or possibly the final glint from an Iridium flare, after four or five seconds another flash occurred in exactly the same spot. No other lights were visible near that point of light. After another four to five seconds another flash appeared in exactly the same place, it was clear now that this was coming from a stationary source. I observed three more flashes approximately the same time apart as the previous ones; the last two however were about half the intensity as the first four. After several minutes and no activity I decided that it was over and I went inside to get the phone. I went back out with the phone and called my father to tell him about what I had just seen all the while keeping my eye on that area of the sky. Five minutes into the conversation I observed a commercial jet heading from South to North, nothing unusual. At about the same time as I noticed the jet coming from the South a fuzzy, red pulsating light appeared in the SSW slightly lower in the sky than the first event I described above. After a few seconds it was apparent that this red light was moving in my general direction and that it would pass directly overhead and that it would also intersect the path of the northbound jet, although at a much higher altitude. Careful scrutiny of the silent, rapidly approaching red light revealed absolutely no other lights on this craft. The light itself appeared somewhat fuzzy, with the apparent size of a pea held at arms length, it had a central hotspot that seemed very slightly less red than the overall area of red light. It appeared to pulsate between bright and dim about once a second, never actually going black between pulses. The night was practically silent, no traffic no, ambient noise. The only sounds were the barely discernable engine noise from the faraway jet and the occasional rustling of leaves. As I said the red light was headed in my general direction, moving from the SSW to the NNE and from my perspective it appeared that it was going to pass through the very same spot in the sky as the light flashes noted above. At the point when it did reach that spot, and coincidently high above the northbound jet this red light suddenly changed direction. It’s hard to describe, but essentially, one second it’s on a path that will bring it directly overhead and the next it’s moving parallel to the northbound jet, although higher and to the right of the plane. I was able to observe the jet and this object for the next 10 or 15 seconds as they headed North and eventually out of my view.",
      "link": "http://www.nuforc.org/webreports/053/S53098.html",
      "state": "TN",
      "duration": "2 events, 90 seconds tota"
    },
    {
      "_id": "64d005f478aba2ec5a3b85f8",
      "summary": "Silent blue light and motionless white light seen in sky over Chattanooga",
      "city": "chattanooga",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Silent blue light and motionless white light seen in sky over Chattanooga Two neighbors and I were sitting on the porch enjoying the cool night breeze. We were all talking when I noticed a bright white light in the sky straight ahead of my line of sight (in the direction of the Tennessee River). At first I dismissed it as a helicopter. In that general direction is Erlanger Medical and the Life Force helicopter is not an unusual occurrence. I watched this for a few minutes without comment. Then a second, much brighter round blue light approached slowly from further away to come close to the stationary white light. I said “what is that?” My neighbors stopped talking and turned around to look up at the two lights. We were all on our feet at this point, talking about how strange the blue light was. It moved like a slow helicopter with an atypical light, yet it was totally silent. The helicopters that fly around this area are never silent. Also, there wasn’t any traffic that night. It was quiet out and we couldn’t hear engine sounds. The white light winked out after six or seven minutes and the blue light flew away in the direction of North Chattanooga until it was gone. Roughly a minute later it flew back in our direction, performing a few maneuvers. I made an offhand comment that if anything ‘came out’ of the light we should all hightail it indoors and lay low. The blue light headed off again across the river until it was out of sight. I’m not sure what to make of this sighting. We have helicopters, a major airport in Brainerd, and the Riverbend Festival was still going on at Ross’s Landing. Nothing matches what we saw. The light was too back and forth to be a plane and too quiet to be a helicopter. And nothing at Riverbend is an airborne attraction. What is most profound to me, and my neighbors as well, was the eerie quality of that blue light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70537.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b875f",
      "summary": "Directly overhead we saw 4 different objects appearing to be faint stars moving in different directions. ?UFOS?",
      "city": "chattanooga",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Directly overhead we saw 4 different objects appearing to be faint stars moving in different directions. ?UFOS? We were camping, looking at the stars and noticed what appeared to be faint stars (bluish white) moving in different directions.  As soon as we saw one, we noticed other moving lights.  The lights did not blink and I kept my eye on one until it vanished as if it got to far out of site and i am talking directly over head!   It was a clear night, not a cloud in site.  The distance to these objects is unknown but there is no way a normal jetliner could fly so high as to appear to be a faint star. the speed of the objects appeared to move at the rate of speed as a jet, but the distance to it was twice as far if not outside our atmosphere. I dont know what they were but i know what they were not.",
      "link": "http://www.nuforc.org/webreports/066/S66667.html",
      "state": "TN",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b91ce",
      "summary": "Green light with sparks as it entered the atmosphere.  ((NUFORC Note:  Possible meteor??  PD))",
      "city": "chattanooga",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Similar to a shooting star. Green light with sparks as it entered the atmosphere.  unusual color with with sparks. ((NUFORC Note:  Possible meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68452.html",
      "state": "TN",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b91f6",
      "summary": "Oval-shaped, lighted craft seen in southern Tennessee",
      "city": "chattanooga",
      "shape": "oval",
      "date": "2010-05-12T00:00:00",
      "story": "Oval-shaped, lighted craft seen in southern Tennessee A friend and I had gone out to dinner in Chattanooga with her parents. Her older brother was to be meeting us at Outback with his girlfriend to celebrate my friend having been released for one of what we though to be her final two week breaks before she was to be cleared for being in remission for the cancer she had been suffering with for the last year. We all gathered and had a wonderful time at dinner, and when we decided to leave we had to sit much longer than expected because the battery in my friends parents’ van had died. Her brother helped jump start the battery and her dad was to take the brother and his girlfriend home for some reason I can’t remember. Well, this left myself, my friend, and her deaf mother to go together back to our home in a different city (about thirty minutes away), since my friend was to be spending the night with me that night. Finally we got on the road and about ten to twelve minutes after we got on the freeway Amy and I saw an odd light out of the corner of our eyes and both looked up to see what it was. We both saw what looked to be an oval-shaped ring of various colors (pink, green, blue, orange, yellow, purple, and white) that was titled at an angle and seemed to be spinning counter-clockwise. It was dormant in the sky, staying in one place and not moving. Suddenly it began, very slowly, to move in a ‘cross’ pattern (up, down, up, left, right, down). We weren’t the only one who noticed because we saw people sticking pointed fingers from their cars and honking their horns. Finally, it seemed to just lower behind the mountains we were headed towards and disappeared. ((NUFORC Note:  We have assigned an arbitrary date above, to reflect a date in \"Fall 2006.\"  PD)) ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75248.html",
      "state": "TN",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b992c",
      "summary": "A silver orb seemed to hover and move in and out of the upper level of a large cumulus cloud.",
      "city": "chattanooga",
      "shape": "sphere",
      "date": "2009-04-14T00:00:00",
      "story": "A silver orb seemed to hover and move in and out of the upper level of a large cumulus cloud. When I was 7 or 8, I was very much into distance running.  There was a 1.1 mile loop that I ran several times a week.   On a cool day sometime in the spring I was running up a large hill near a local middle school.  I looked up at a large cumulus type cloud and noticed what looked like a tiny silver sphere hovering next to the upper right part of the cloud.  It was very shiny, reflecting the sun like a car would on a sunny day.   I immediately stopped running and stared at this object trying to figure out what I was looking at.  I could tell the cloud was moving slowly towards me, but the object seemed to remain stationary.   After a few moments the object moved to the left, appearing to go inside of the cloud.  It stayed hidden for a few seconds, then moved right and again hovered in the same spot.   I watched it for a few moments, and it seemed to begin to move vertically very slowly.  Then it again moved left into the cloud and didn't emerge for what felt like several minutes.   As I began to run again I looked up one last time and saw a brief glimpse of the object as it moved in and out out of the cloud on final time. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69335.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b62",
      "summary": "Triangular UFO witnessed at Army Ammunition Plant",
      "city": "chattanooga",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Triangular UFO witnessed at Army Ammunition Plant I was driving through the access road that cuts across the old \"abandoned\" army ammunition plant.  I witnessed a triangular craft hovering just above the treeline ahead of me.   I slowed down and was only able to see the underside of the craft.  It had a light in each corner.  I drove past in awe and turned around to get a second look but it was gone.   I don't know if this has any relation but I have also seen people in radioactive suits in the area.  I have read that there is some correlation with nuclear areas and UFO activity. ((NUFORC Note:  Witness describes self as a university student, studying in a professional field.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68797.html",
      "state": "TN",
      "duration": "2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c8f",
      "summary": "Close bright light travelled across a south to north-northeast flight path",
      "city": "chattanooga",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Close bright light travelled across a south to north-northeast flight path On my back porch on a humid night. Notice a bright light moving too fast for civilian aircraft, and much too close and bright on the horizon to be a satellite. Object was traveled almost SW-N - NE  in a straight path. No sound or typical blinking lights associated with aircraft were observed. This was a very hazy night out. Could hardly see constellations other than ursa major. This light looked much too close to be a satellite.",
      "link": "http://www.nuforc.org/webreports/064/S64657.html",
      "state": "TN",
      "duration": "~ 1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fd8",
      "summary": "Real life Star Wars",
      "city": "chattanooga",
      "shape": "sphere",
      "date": "2009-04-14T00:00:00",
      "story": "Real life Star Wars Early one morning I went out to smoke and star gaze as I usually do. I noticed a couple of bright, yet discernible,lights moving from a NW to SE direction.  Often times I have seen Jetliners moving at a recognizable pattern involving a straight line flight or satellite movement which are very high above normal commercial aircraft flight patterns.  This was during spring break so my two children were at home and outside with me at the time,in fact, my oldest was the first to spot the bright approaching lights and coined the term \"Space wars\" after the event. The leading craft was moving much faster than a normal high flying jetliner and was moving in a 30 degree zig-zag as if it was \"swimming\" (best way I can describe it) and it suddenly passed another very bright and stationary object.  Then, For the lack of a better description, it \"dematerialized\" and faded away after it passed the stationary object.  Once passed and it was no longer visible,immediately in a split second, it seemed as if another craft equally as bright with a streak trailing, shot/zipped past where first craft had been headed ,  As if it was attempting to intercept the first crafts position in one of it's zig-zag motions. It honestly looked like something was attempting to shoot it down and was making a \"leading shot\" just as if you would if you were shooting a fast moving object.However,instead of hitting the first object by anticipating it's location,  The first object had disappeared leaving whatever it was that was attempting to intercept it shooting off into the distance with a big bright streak behind it. Then the stationary craft illuminated very,very brightly and shot off into the distance. I have never seen anything like it in all my life. My daughter kept saying, \"They are shooting at each other\" over and over again until it woke my wife who was sleeping upstairs on the other side of the house she was so loud. My son, Who is 6 was there to he ran inside to grab is toy gun and a set of cheap tasco binoculars. 20 minutes later there were several fast moving aircraft all over the place at about half the altitude of these objects. They did a number of grid like patterns then they were gone. As for me,I have been a police officer and I have been in the military as an imagery analyst and held a DoD TS/SSBI (Security Clearance) and my integrity has never been challenged or questioned when dealing with some of the highest military intel on the planet.. I can tell you without a doubt this was combat between two or three craft of extraterrestrial origin, without question!",
      "link": "http://www.nuforc.org/webreports/069/S69612.html",
      "state": "TN",
      "duration": "20-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6f5",
      "summary": "A real bright flash of light.",
      "city": "chattanooga",
      "shape": "flash",
      "date": "2008-07-05T00:00:00",
      "story": "A real bright flash of light. On July 22 or 23, 2008 somewhere between 10 and 11:30 AM.  My mother and I were in my living room I was on my computer and she was watching TV. We live very close to Chickamauga Dam.  Had the window open it was a nice day… sunny partly cloudy very hot…. when a flash of some sort filled the room.  It was like someone was outside taking a picture with a flash… except brighter and lasting only a second or two.  At first I thought there was something wrong with my eyes. There was no sound. When I realized it was not my eyes.  I asked my mother…what was that?   She said “I don’t know something just flashed”.   My electricity did not flicker or anything.  This only happened the one time.  I have not heard if anyone else saw it or not.  We were just curious if any one else saw it. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64177.html",
      "state": "TN",
      "duration": "second or two"
    },
    {
      "_id": "64d005f478aba2ec5a3bb7b7",
      "summary": "Five orange orbs ascend quickly into the sky over Chattanooga",
      "city": "chattanooga",
      "shape": "fireball",
      "date": "2010-08-30T00:00:00",
      "story": "Five orange orbs ascend quickly into the sky over Chattanooga While traveling South on I-75 South, I noticed five large orange orbs which appeared to shoot upward into the sky. I was sitting in the front passenger seat while watching the sky, we were traveling about 75 miles an hour when I noticed them.  They appeared to be just outside of Chattanooga to the South of the city.  Due to being on a road trip, the driver and I had no time to stop and watch them, longer than they were plainly visible from the vehicle.  We did see fireworks going off about ten minutes prior to the event, however, given our speed and ground covered, the orbs were not in the same vicinity as the fireworks. I called a friend to file this report.  (The report was dictated in real time via phone call)",
      "link": "http://www.nuforc.org/webreports/077/S77463.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdba0",
      "summary": "400 foot long craft with half circle lights.",
      "city": "chattanooga",
      "shape": "other",
      "date": "2012-11-19T00:00:00",
      "story": "400 foot long craft with half circle lights a long sequence of lights attached to a craft approximately 400 feet wide with half circle shaped lights on bottom followed by 6 other smaller crafts throughout the area. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94307.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be252",
      "summary": "Four family members witnessed some 14-18 bright yellow/orange lights move slowly over city",
      "city": "chattanooga",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Four family members witnessed some 14-18 bright yellow/orange lights move slowly over city We live on the brow of a mountain that looks out over the city of Chattanooga, TN.  At about 9:30 pm my daughter, who is only 8 yrs old, was looking out our bay window and asked me to come look at this yellow/orange light in the sky.  I said, oh it's probably just a helicopter but as I pulled back the drapes to reveal the enitre line of sight from the window, I was astonished to see that the sky was full of them. The lights were clearly moving and all of them seemed to be moving in the same direction, across the mountain from the SouthWest heading NorthEast.  The mountain we live on is some 2300 in elevation and the lights were not too far higher than that, but clearly above the mountain, as they passed over the mountain. My father and his wife live next door and we called them to come out on the porch and look. They both witnessed the event as well.  My father (68) and myself (40) have lived on the mountain for most of our entire lives, on the brow of the mountain since 1980 and neither of us have ever experienced anything like what we saw. I have looked every night since and have not seen anything at all in the night skies other than distant planes and helicopters that rarely, if ever, come across the mountain.  Most all commercial flights into the city approach from the South (atlanta) and are visible way off on the horizon flying direclty north into the airport. I would be very interested in recieveing some feedback about what we experienced.  I will go on and say that since this night, we have been watching a lot of internet and TV shows about UFO sightings and we found out experience very similar to the \"Lights Over Phoenix\" experience. Thanks.",
      "link": "http://www.nuforc.org/webreports/087/S87219.html",
      "state": "TN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be253",
      "summary": "Four glowing orange orbs float over the city",
      "city": "chattanooga",
      "shape": "fireball",
      "date": "2012-03-13T00:00:00",
      "story": "Four glowing orange orbs float over the city I had gone to bed early that night, 9:00 P.M.,  I was tired from work.  I had not yet fallen asleep when my two dogs started to growl and bark.  As I listened, one dog started to bark very loudly and was pacing rapidly all through the house.  My other dog, who NEVER barks or growls, began growling as if it were in extreme defesive mode.  I was still in bed and soon realized they were reacting to a dog outside and a few blocks away.  This other dog (outside) was freaking out so bad it sounded like it was being killed.  (This was included only because it got my attention. I am not saying the lights caused the dogs to bark, although it was very abnormal)  This got my attention and I turned over to look out my 4 ft. x 4 ft. window by my bed.  Up in the sky I saw an orange light. I was not wearing my glasses and the image was blurred, but I could immediatly see that it was unusual.  I stared, squintng, trying to adjust my focus thinking what the hell is it.  I ju! mped out of bed, grabbed my glasses, got back in bed, and watched. It hadn't moved.  I couldn't wrap my mind around it at first, I have been interested in UFOs my whole life, but to see one is mind bending!   First I deduced that it was not a reflection of light on my window as no lights were on in my house. Second, not a helicopter or plane or star or planet, this looked like it was a huge star that had come to Earth.  I was amazed, I leaned down to get a bigger view of the sky, as my roof eave was obstructing.  There was another!  I literally said \"Oh shit!\" I jumped up grabbed my phone and ran outside in my boxer shorts.  I live on a mountainside, three quarters of the way up to the top, with good views of thecity below.  Once outside I could see the huge clear open sky with FOUR round lights in a straight line! Just above the city to the left. I looked around and nobody was outside watching, I felt they should be so I let out a \"WHOOOO!!\" but no one heard.  The lights wer! e equally spaced, their height looked like they were level wit! h the to p of the mountain.  Which is not that high as the mountain is barely classified as a mountain.  The line of lights appeared as if it was around a mile long from the first light to the last but there really is no way to tell I guess. But they DID appear to be inside the semi-circular mountain range surrounding the city below. So to me they seemed close. I was unbelievably excited!  I stared at the lights trying to understand.  They were all the same.  I am assuming they were spheres,  because if they were discs or two dimensional circles they would have had to be facing me dead on because they appeared as a round circle of light.  The light did not glare as normal lights do. It seemed to be a ball of light that was contained within itself with a dull look almost like it was pulling in light instead of giving it off. there was no sound. There was movent within the orbs, I could not tell whether there were rotating lights inside or if there was a swirling effect and  changing co! lor from red to orange rapidly.  Basically it looked like four giant fireballs floating still in an evenly spaced long line.  I pointed my camera phone at one of the lights, all four would not fit in the frame, and took a picture. The result looked like a black sky.  I was frantic trying to fumble with my phone, I did not want to take my eyes off the lights.  I took another picture, my media storage had been reached and it did not let me save the second picture!! I couldn't believe it and did not want to waste time with deleting pictures.  By this time one of the lights, I do not remember which, started to  move slowly.  Maintaining the same distance, it moved into a triangular position with two other orbs forming an equal lateral triangle. T  he forth orb started to move slowly into position between two orbs and outside the triangle.  Seconds later all orbs moved simultaneously very slow from west to east right over the city. Anyone that looked up at that time would have seen them.  They passed over the city and &#8206;Saturday, &#8206;February &#8206;11, &#8206;2012phone. I realised I got a picture, it looks like a u-shaped light that is different colors. I put it on my computer and it's a little clearer, but my camera phone isn't great.  Although you can tell it is not a plane.  A few minutes later I actually called the police which I normally would not do.  I wanted to see if they had recieved any other calls about it.  He did not seem to care, although he did ask me a question or two.  I called my brother right after as the lights were headed towards his house, but he didn't see anything.  A couple of days later, I was on YOUTUBE and found a video: \"UFO OVER CHATTANOOGA 12/28/11\" the same date as my sighting.! The video shows exactly what I saw except ther are three lights.  This made me feel good to know that some one else saw them.  His location was the opposite of my view.  There is also a video of ufo over chattanooga that is a hoax, japanese candle balloons.  They don't even come close to what  I saw.  I have always read about UFO witnesses saying that it was liked nothing they had ever seen. Now I know what they mean. I am a capenter.",
      "link": "http://www.nuforc.org/webreports/087/S87137.html",
      "state": "TN",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be38b",
      "summary": "I saw a blue teardrop object fall from the sky.",
      "city": "chattanooga",
      "shape": "teardrop",
      "date": "2012-10-30T00:00:00",
      "story": "I saw a blue teardrop object fall from the sky. I was driving northbound on I-75 in Chattanooga, TN, when I saw a blue light in the shape of a tear drop fall out of the sky.  This light seemed darker on the outside and lighter on the inside.  I only saw the object for a few seconds and then the object disappeared.",
      "link": "http://www.nuforc.org/webreports/093/S93954.html",
      "state": "TN",
      "duration": "few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9d2",
      "summary": "Round fading orb",
      "city": "chattanooga",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "Round fading orb Bright round object moving at constant speed.  No sound associated with it.  No trail of light.  Over course of sky light faded from white to dim red then vanished.  I tracked this for 1 minute from apex of sky.  Again, no noise, no blinking lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97379.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfce0",
      "summary": "8-10 moving lighted objects traveling slowly without sound, northeast orangish in color,4-5 minutes then disappearing.",
      "city": "chattanooga",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "8-10 moving lighted objects traveling slowly without sound, northeast orangish in color,4-5 minutes then disappearing. The objects were triangular in shape which appeared to have 3 lights, white to orangish in color, traveling slowly, snychronized, going north east over Chattanooga, in a zig,zag formation like 2 lines staying equal distant apart, no noise (I thought maybe helicopters at first but there was no sound).  They were below the clouds, maybe 3-4000 feet above us. The sky was clearing from rain/clouds we had all day. No wind. First time I have witnessed lighted objects moving in the sky without sound.",
      "link": "http://www.nuforc.org/webreports/097/S97451.html",
      "state": "TN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c01af",
      "summary": "Triangle shaped object; pure white in color",
      "city": "chattanooga",
      "shape": "triangle",
      "date": "2013-07-03T00:00:00",
      "story": "triangle shaped object , pure white in color I was in my office closing out the end of the months books, and my boss was outside smoking a cigarette he came running inside and said come here quickly you got to see this.  I jumped up from my chair and followed him outside.  I looked into the sky and witnessed an odd object hovering in the sky we both stared at it and it rotated clockwise almost 360 degrees it was triangular in shape the pointy end was facing up and the flatter end facing the ground it was pure white in color and made no sound the sun was behind us and I could see lines on it but difficult also to make out.   We watched it for a little while and we both looked at each other and looked back up and it was gone this all happened at 6:50pm on 06/29/13 west of Hwy 153 near Shallowford Rd. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99049.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0845",
      "summary": "Bright orange light moving slowly across the sky.",
      "city": "chattanooga",
      "shape": "oval",
      "date": "2014-03-18T00:00:00",
      "story": "Bright orange light moving slowly across the sky. We seen an orange light moving slow across the sky from left to right.  At first I thought it was still and was on top of a tower.  We were driving on Highway 153 and pulled off on the Amnicola Hwy exit.  We got out of the car and watched it move across the highway.  It started coming down slowly like a balloon that had old helium in it.  The object while moving across the sky looked bigger than a star.   When it started coming down the light went out came back on and went right out again.  It was night so at best it looked dark grayish and like a 50 gallon yard clipping bag, but only bigger than that.   It appeared to be making its way back toward us while coming down.  Then It disappeared behind tall trees.   We got back in the car and drove into the neighborhood where the trees were. Unfortunately we couldn't find it.",
      "link": "http://www.nuforc.org/webreports/107/S107574.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c238f",
      "summary": "Bright light in my window.",
      "city": "chattanooga",
      "shape": "light",
      "date": "2014-04-04T00:00:00",
      "story": "Bright light in my window. I was laying in bed when I saw a light being shined in my window lighting the opposite walls of my room.  I look out my window to see a bright light in the sky, probably a few hundred feet in the air, flying over my house.  It was completely silent and sort of indescribable.  It flew directly over my house.   I ran to the front of the house to continue watching it.  I watched it for about 15 minutes or so float to the SE.   Now I do live by an airport and I see airplanes all the time at night.  This was coming from a direction that I don't see planes coming from, it was completely silent, and I could see it much longer in the air than I normally see a plane.   I plane flying in that direction would have been out of sight within minutes.   This was still visible for at least 15 minutes.",
      "link": "http://www.nuforc.org/webreports/108/S108206.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24af",
      "summary": "Black triangle traveling at low altitude and hovering.",
      "city": "chattanooga",
      "shape": "triangle",
      "date": "2014-11-06T00:00:00",
      "story": "Black triangle traveling at low altitude and hovering. My wife and I were traveling down highway 58 after dinner.  All of a sudden, a craft appeared in sight from the right side of the road.  It was in slow descent.  It did not appear to be a conventional aircraft in terms of it flight characteristics.   As we approached closer it wad noted to triangular in shape.  There were three lights on each point of the triangle that were white in color.  The center of the craft had a red light that flashed occasionally but without purpose.  I could see the surface of the craft as well and it appeared dark and possibly reflective.  The craft as it descended crossed the road and I made a uturn in my car to try to get a picture.  It was then noted to be hovering at treetop level (for about 10 seconds ) and was silent.  I estimate the craft to be around the size of 3 sedan sized cars.   After I had made my uturn and parked, the craft then started moving again and crossed the highway once more and all of a sudden disappeared.  It did not descend or ascend, it just went out of sight completely.   When I first saw the craft I thought it was plane due to a blinking light in the center, then noted it could be a helicopter as the light pattern didn't look typical.  Then noted it couldn't be a helicopter due to the fact it was traveling so smoothly.",
      "link": "http://www.nuforc.org/webreports/114/S114514.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2683",
      "summary": "Driving S on Browns Ferry Rd., before Browns Ferry Landing, I noticed to my right a plane flying about 2000ft over Raccon Mountain.",
      "city": "chattanooga",
      "shape": "unknown",
      "date": "2014-12-05T00:00:00",
      "story": "Driving south on Browns Ferry Rd before Brownsferry Landing, I noticed to my right a plane flying about 2000ft over Raccoon Mountian heading northeast towards Chattanooga.  The plane had a blue light at the end of one wing and red light at the end of the other wing.  In the middle were two large white lights.   The plane flew directly over my car as I stopped on Browns Ferry RD.  As it flew past my position, I rolled down the window to hear it.  No sound.   It banked slightly right, then back left and continued over Tennessee River north side of Treatment Plant, then out of sight.  I have never seen a plane like that and thought it may have been a drone or something unusual.   Look like large car lights on the front of the plane or object. ((NUFORC Note:  Time, date, and duration of the sighting appear to us to be flawed.  Source of report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115677.html",
      "state": "TN",
      "duration": "3"
    },
    {
      "_id": "64d005f478aba2ec5a3c29ce",
      "summary": "Unusual bright flying object.",
      "city": "chattanooga",
      "shape": "triangle",
      "date": "2014-11-21T00:00:00",
      "story": "Unusual bright flying object. On 11/17/14, around 6:10 ((p.m.)), an usual bright flying object in the sky grabbed my attention while I was driving.  Can't tell the exact shape of the object, since it was extremely dark, but the arrangements of the lights seemed that it was triangle.  Few bright lights on top and as it got wider at the bottom there were several lights.  It can be described as a short and wide cone shape.   It looked like it was flying below the clouds, moving very slow and there wasn't any sound.  The visibility was for only 15-20 sec and than disappeared in a blink of an eye.   I thereafter, searched for all the possible planes, jets, helicopters and drones but nothing matched with description of what I saw.",
      "link": "http://www.nuforc.org/webreports/115/S115448.html",
      "state": "TN",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d65",
      "summary": "White/blue sphere with an orange glow and a jet steam of smoke and blue flame.",
      "city": "chattanooga",
      "shape": "oval",
      "date": "2014-08-29T00:00:00",
      "story": "White/blue sphere with an orange glow and a jet steam of smoke and blue flame I saw a low flying oval shape with a strong tail containing smoke and a light blue fire with an orange hue around it.   It appeared to slow down over the downtown buildings and then completely disappeared.   I was at an outside restaurant and several witnesses can attest.",
      "link": "http://www.nuforc.org/webreports/112/S112833.html",
      "state": "TN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c346b",
      "summary": "Triangular white/clear light grouping",
      "city": "chattanooga",
      "shape": "triangle",
      "date": "2015-03-20T00:00:00",
      "story": "triangular white/clear light grouping On this evening my wife, son, and I were traveling SW on Mnt. Creek Rd., just past the BP and Four Squares, when I noticed on my left a few ridges over towards the river and Amnicola Hgwy a triangular configuration of lights low over the ridges.  Not sure of the crafts distance due to light pollution along my route.  After losing sight of the lights below the closest of the ridges, we were able to pull over in a church parking lot and catch a glimpse of what we believed was the same object just in a much dimmer capacity.  Never able to properly identify this object or objects.  Other than appearing dimmer the object never seemed to move.  The lights appeared white or clear.",
      "link": "http://www.nuforc.org/webreports/117/S117853.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3bcb",
      "summary": "Three bright stationary lights above Chattanooga, TN.",
      "city": "chattanooga",
      "shape": "formation",
      "date": "2015-07-31T00:00:00",
      "story": "Three bright stationary lights above Chattanooga, TN I got out of the car with my 17 year old son.  We both saw what we thought was aircraft at first over the ridge near our house.  They were bright as street lights, three lights in a triangular form.   They were stationary until the bottom corner just vanished, I thought maybe it was moving behind the clouds that were thin and sparse.  Then the next lights just poof!  It was gone, then the third.  We watched these lights for 5-8 minutes.   The sky behind was clear, the only clouds were way in front and extremely thin.  The moon is bright and these lights were vivid.   I stayed out until I was sure they were gone, I didn't want to miss anything.   I tried to video what we were seeing, but for some reason the camera didn't pick up the lights.",
      "link": "http://www.nuforc.org/webreports/120/S120696.html",
      "state": "TN",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ac4",
      "summary": "((HOAX??))  We were sitting in a car talking about Alien Activities with a friend of my Daughters.",
      "city": "chattanooga",
      "shape": "flash",
      "date": "2015-09-11T00:00:00",
      "story": "We were sitting in a car talking about Alien Activities with a friend of my Daughters ...  He just had sited a big Ship recently that was transparent  hovering over LA.  He later sent me a photo of it ...  Clearly a round disc shaped ship with a bean coming down.   As soon as he walked away from the car and I pulled out of the parking lot ,a low flying blue flash streaked  across the back of the building and came out the other side so fast it was gone in seconds.  Very bright blue and white… ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121695.html",
      "state": "TN",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ac3",
      "summary": "We were sitting in a car talking about Alien Activities with a friend of my Daughters ... He just had sited a big Ship recently that wa",
      "city": "chattanooga",
      "shape": "flash",
      "date": "2015-09-11T00:00:00",
      "story": "We were sitting in a car talking about Alien Activities with a friend of my Daughters ... He just had sited a big Ship recently that was transparent  hovering over LA.  He later sent me a photo of it ...  Clearly a round disc shaped ship with a bean coming down.   As soon as he walked away from the car and I pulled out of the parking lot, a low flying blue flash streaked  across the back of the building and came out the other side so fast it was gone in seconds.  Very bright blue and white… ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121660.html",
      "state": "TN",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b42",
      "summary": "Black out power outage occurred then a bright green light lit up the hillside as we drove on the I-24",
      "city": "chattanooga",
      "shape": "unknown",
      "date": "2015-08-27T00:00:00",
      "story": "Black out power outage occured then a bright green light lit up the hillside, as we drove on the I-24 Immense green light appeared a few seconds after a power outage that covered the entire hillside.",
      "link": "http://www.nuforc.org/webreports/121/S121201.html",
      "state": "TN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e72",
      "summary": "Bright blue-green light that lit the entire sky over downtown Chattanooga.",
      "city": "chattanooga",
      "shape": "unknown",
      "date": "2015-08-13T00:00:00",
      "story": "Bright blue-green light that lit the entire sky over downtown Chattanooga. Bright blue green light that lit up the entire sky lasted about 3 seconds happened three consecutive times. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121040.html",
      "state": "TN",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6776",
      "summary": "A light in the sky looked like a star but than start moving slowly to side to side.",
      "city": "chattanooga",
      "shape": "light",
      "date": "2017-04-07T00:00:00",
      "story": "A light in the sky looked like a star, but than start moving slowly to side to side",
      "link": "http://www.nuforc.org/webreports/133/S133355.html",
      "state": "TN",
      "duration": "2 days"
    },
    {
      "_id": "64d005f478aba2ec5a3c67bf",
      "summary": "Extremely rotating Bright light and then was gone",
      "city": "chattanooga",
      "shape": "sphere",
      "date": "2017-03-10T00:00:00",
      "story": "Extremely rotating Bright light and then was gone Extremely bright rotating sphere of light with a haze, looked way too close to be a planet or star but too small to be the moon.  Video doesn't really do it justice on how bright it was, but you can here my friend and I talking about how abnormally bright it seemed: https://www.youtube.com/watch?v=2Aex3KD_Jeo",
      "link": "http://www.nuforc.org/webreports/132/S132901.html",
      "state": "TN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7097",
      "summary": "2 oval craft with white, green blinking lights.",
      "city": "chattanooga",
      "shape": "oval",
      "date": "2017-08-04T00:00:00",
      "story": "2 oval craft with white, green blinking lights. Saw an oval craft sitting in sky with lights blinking white, green and red.  Came out again 15 min later, saw 2 craft, same type craft and lights.  No noise, no moving, just sat and spinner in place.",
      "link": "http://www.nuforc.org/webreports/135/S135444.html",
      "state": "TN",
      "duration": "1 hour+"
    },
    {
      "_id": "64d005f478aba2ec5a3c7904",
      "summary": "Afternoon sighting.",
      "city": "chattanooga",
      "shape": "unknown",
      "date": "2017-12-04T00:00:00",
      "story": "Afternoon sighting. While doing errands on a sunny afternoon, I took note of the faintly lit moon in the sky at 3:45 p.m..   I then noticed a metallic cigar or rectangular shaped object to the west of the moon, traveling northwest at a slow speed, and low enough to see it was not an airplane.  It was hard to distinguish its shape.   I pulled the car over for a focused view, but still could not determine its exact shape.   Then I saw a second object traveling close to it, in the same direction.  The objects moved closer together and seemed to merge.   I turned my car around to follow them and by the time I got turned they were gone. My family is generational Air Force.  I am a former flight attendant, and I have been an observant sky watcher for many years.   This is my second daytime sighting; the other was in central California.  I have also observed 2 orange-colored orbs moving southwest from my area of the city’s ridge.",
      "link": "http://www.nuforc.org/webreports/137/S137455.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c2b",
      "summary": "Two triangle objects, one hovering for long period with second coming back in and out, then traveling out together.",
      "city": "chattanooga",
      "shape": "triangle",
      "date": "2017-10-19T00:00:00",
      "story": "Two triangle objects, one hovering for long period with second coming back in and out, then traveling out together. My home is on a ridge overlooking the river and entire city of Chattanooga.  From the second story, my children and I look at the city lights out the window as they are put to bed.   Today I saw a light I have never noticed before and it did not seem to move.  I watched from one room and never saw the object move.  I thought I was losing it, so I went to the opposite side of the house and looked and it was still there.  At this time I noticed a secondary object appear.  They were both white at that time.   I looked for my husband, couldn't find him, went downstairs and out the front door.  The two objects were still there, only this time moving slowly toward my house and higher as they went.  They moved in unison and the color started changing from one to many colors-- the entire outer rim of the objects were changing colors.  I kept rubbing my eyes thinking my contacts were drying out, but the lights were glowing and changing, and at this point I could see the lights were in triangle shapes around the object.  I couldn't make out the edges of the objects, only the lights.   Then, after they passed my house I lost sight of them because my house blocked my direct line of sight.  When I rediscovered them after running around the house they were much further to the left and had made a major change of direction.  Then there was only one; the second disappeared.   About 15 years ago, I saw a red orb in the middle of the day hovering in Athens, TN, over the interstate.",
      "link": "http://www.nuforc.org/webreports/136/S136809.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c858a",
      "summary": "I was attending an outdoor concert by the river in downtown Chattanooga. I sat down ,after dancing for a while, and was looking up enjo",
      "city": "chattanooga",
      "shape": "triangle",
      "date": "2018-08-10T00:00:00",
      "story": "I was attending an outdoor concert by the river in downtown Chattanooga.  I sat down, after dancing for a while, and was looking up enjoying the sky.  I noticed some blinking red and green lights on a black triangular shape moving slowly from east to west.  There was a big crowd and I looked around to see if anyone else was seeing this but couldn't tell, as most folks were watching the show and such.  It flew in a straight line, and I watched it until it was out of sight.",
      "link": "http://www.nuforc.org/webreports/142/S142435.html",
      "state": "TN",
      "duration": "Few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e14",
      "summary": "I was star gazing and saw a camouflage see through object, like looking at the stars through water, wth veiny blue lights like it veins",
      "city": "chattanooga",
      "shape": "other",
      "date": "2019-01-11T00:00:00",
      "story": "I was star gazing and saw a camouflage see through object, like looking at the stars through water, wth veiny blue lights like it veins Went out to take out the trash and I love stars and I’m looking up and my eyes adjusted to the darkness and i couldn’t see it well do to the chameleon camoflouge it had on but I saw the veiny blue lights in the ridges of the object.  I could see through it but the veiny blue lights I could see but faint and as I watched the object pick up speed and at that height it wasn’t a jet going that fast so unless it was the government in one of theirs it went Northeast from these coordinates. 35.0179, -85.1666 Around 10:30-10:45.",
      "link": "http://www.nuforc.org/webreports/144/S144332.html",
      "state": "TN",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c903a",
      "summary": "Rainbow Falls: middle creek.  Midnight Friend and I got abducted. First drawn to abduction spot by seeing glow worm and walking o to it",
      "city": "chattanooga",
      "shape": "other",
      "date": "2019-12-01T00:00:00",
      "story": "Rainbow Falls: middle creek.  Midnight Friend and I got abducted.  First drawn to abduction spot by seeing glow worm and walking o to it",
      "link": "http://www.nuforc.org/webreports/150/S150128.html",
      "state": "TN",
      "duration": "30 minutes"
    }
  ]
}