{
  "city": "chesapeake",
  "fetch_timestamp": "2025-07-12T14:36:04.563042",
  "record_count": 49,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4818",
      "summary": "I saw a bright-white orb appear (clear sky), travel 5 sec.parallel to the east coastline heading N, then disappear.",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2019-08-23T00:00:00",
      "story": "I saw a bright-white orb appear (clear sky), travel 5 sec.parallel to the east coastline heading N, then disappear. It was the early morning hours of September 13th, and the last day of a three day meteor shower.  I often enjoy these events and didn’t want to miss the last morning of the event.  I got up and went outside with a pillow to lie down on our bench to get a good general view of the sky before the sunrise.  My feet were facing south, my left shoulder to the east coast (the sun was beginning to rise a bit). I caught the first meteor in the upper right quadrant of view…. It was orange in color and zipped the usual speed (1/4-1/2 second in length).  A few minutes later I saw the second…in the bottom left quadrant….same seed.  It was bright white in color.  I then noticed an airplane…flashing lights in the right, middle area of my general sight.  It was going the usual speed….and quite a bit slower in speed as the meteors….I do not recall if I heard it. Then (at the same time as the plane was flying from right to left in the middle of my vision), all of a sudden a white orb appeared to the left of mid-field.... out of nowhere.  It was a circle/ball of light….opaque in substance as best as I could tell with my eyes.  There were no clouds in the sky (except a long thin one that was at the bottom of my field of sight).  The orb was quite a bit larger than the meteors…..about the size of a red light when you are stopped about 4 cars back.  Best I could tell it was way over the tree line but below the height of the airplane.  It traveled south to north for about 5 full seconds and then just disappeared.  It was traveling at least 4 times as fast as the airplane, but at least 4 times slower than the meteors.  It didn’t waver; there was no sound; no pulsing; it followed a straight line….and just…was gone.  I have never seen anything like it and I am an avid sky-watcher.  Whatever it was…it seemed to follow the coastline.",
      "link": "http://www.nuforc.org/webreports/148/S148350.html",
      "state": "VA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cab",
      "summary": "I seen a bright orange looking light, that look has if it was coming my way, but then went back and disappeared.  First I thought it wa",
      "city": "chesapeake",
      "shape": "unknown",
      "date": "2019-07-05T00:00:00",
      "story": "I seen a bright orange looking light, that look has if it was coming my way, but then went back and disappeared.   First I thought it was a meteor, my dog looked curious and stop in her tracks.   Kinda got scared. ((NUFORC Note:  The time, as originally indicated by the source of the report, may be flawed.  We have changed the time, in order to reflect a nighttime sighting, but we have no means of confirming whether our assumption is correct.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147315.html",
      "state": "VA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d1e",
      "summary": "I live in Chesapeake, VA, specifically in the area known as Deep Creek. At approximately 1:41 a.m, I was driving home after a lat",
      "city": "chesapeake",
      "shape": "light",
      "date": "2019-06-20T00:00:00",
      "story": "I live in Chesapeake, Virginia, specifically in the area known as Deep Creek.   At approximately 1:41 a.m, I was driving home after a late dinner/early breakfast and saw a good sized yellowish orb of light slowly moving across the sky at cloud level.  I pulled off the road to observe.  Initially, it was a solid orb of light.   I watched it for a minute or two, then called my 20 year old using my cell phone.  I wanted her to go outside (from home) so she could see what I was seeing.  About 15 seconds into our 1 minute and 29 second conversation, the orb starting \"blinking\" on and off at something close to half-second intervals.  As we were ending our conversation, it blinked one more time and then disappeared completely. About 15 to 20 seconds after the last blink, a second faster moving craft appeared lower in the sky.  I couldn't quite make out its shape, but it had rapidly blinking bright red and white lights (almost like an ambulance), with a solid blue light in the center.  At the risk of sounding stupid, it appeared to be chasing the first object.  It passed behind a tree and I wasn't able to find it again.  I don't know if it also disappeared, or if I simply couldn't see it at this point. All of this took place in a span of about 5 minutes. I should probably also add that all four of the car's windows were down and I heard no sound coming from either craft. While not relevant to this incident, approximately 3 months ago, I experienced a somewhat similar event. I observed a bright white orb of light moving slowly toward me beneath the clouds.  After a minute or so, a smaller orb seemed to separate itself from the larger and move off to its right side.  It was immediately followed by a third orb which moved off to its left side, forming a somewhat sloppy triangle.  All three remained for another 15 seconds and then simply disappeared.  There was nothing to interfere with my view.  They were there, and then they were gone. These were also soundless.",
      "link": "http://www.nuforc.org/webreports/146/S146875.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4dd6",
      "summary": "Was walking to the happy shopper down the street, heard a weird sound, happened to look up to see 2 unidentified flying objects flying",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2019-04-25T00:00:00",
      "story": "Was walking to the happy shopper down the street, heard a weird sound, happened to look up to see 2 unidentified flying objects flying fast in the sky, like super fast, they were circular shaped and the sun had a reflection of beams off of the surface, the sound was like a loud jet engine for 14 seconds.",
      "link": "http://www.nuforc.org/webreports/145/S145818.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b71d6",
      "summary": "Multiple objects visible at miles over Chesapeake VA Near Cornland park",
      "city": "chesapeake",
      "shape": "changing",
      "date": "2007-08-07T00:00:00",
      "story": "Multiple objects visible at miles over Chesapeake VA Near Cornland park I was dropping my girlfriend off at here house near the North Carolina boarder and saw a bright object in my peripheral vision. It was significant to me because of the magnitude of the object and its proximity to Jupiter, which was low to the horizon and getting ready to set for the night. This object was brighter than the star Vega, and varied in magnitude and color. I grabbed her attention when I noticed it was moving very fast and erratic. It appeared to have several multicolored lights and was flashing at an inconsistent pace. The object would do zig zag patterns and ascend and descend at a rapid pace. The most interesting thing is it almost never moved in a strait trajectory, and if its path seemed to be somewhat strait it would vary its speed, moving in a non fluid motion as if it was jerking. I know this was not the asteroid Vesta or comet C2006v13 due to the comet being near Draco and Vesta has not reached this kind of magnitude, and the motions that this object made do not follow modern conceptions of astrophysics. The most interesting thing is, as this object would decrease in magnitude to the point that It could not be seen there where 10 or more objects around and spread out across the horizon that would flash and get bright, these objects would then dimmer and the \"Main\" object would increase in magnitude. At times up to 4 different lights would be visible and would appear to triangle shaped and at times would appear to be cylindrical. This is hard to tell due to the fact that the object was at a great distance. At times you could see a flash of light that illuminate thin clouds near it and always seemed to be in the direction of other objects that you could see flash light at the main object.  Over the period of 45 minutes the object had moved from about 40 degrees altitude in the eastern south eastern horizon to about 15 degrees, back up to about 30 degrees. In our time of observation four lights were distinguishable, and multiple colours from white, blue, red, and green lights. The objects were still in the sky when I left to head home around 01:40. At that time I had a friend from California on the phone listening in on the event and trying to observer using the stars an Jupiter as a reference. He could not see anything telling me it was localized in nature and was within our atmosphere.  I am an amateur Astronomer and part of an Astronomy club that is a non profit educational group. This was unlike any event that I have ever seen. In astronomy we are very attentive to objects in the night sky and see some things that cannot be explained. Satellites and the ISS move fast and with a standard trajectory. This seemed to move with intelligence behind it, interact with other objects. This was the most significant thing I have ever seen in the night sky.  At its brightest point it would reach around A magnitude -1.0 and dim out to where it was not visible. Most of the time it would reach around a magnitude +1.0 . In some cases it would cover areas of around 30-40 arc minutes in a matter of seconds in a jerky motion, at times doing circles and ans S patterns in the sky. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57739.html",
      "state": "VA",
      "duration": "45 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b796d",
      "summary": "WE WERE WAS STOPPED AT THE RED LIGHT, AT THE INTERESECTION OF DOMINION BLVD. AND MOSES GRANDY TRAIL..(FACING WEST) AND WE SAW A FIREBAL",
      "city": "chesapeake",
      "shape": "fireball",
      "date": "2007-02-01T00:00:00",
      "story": "WE WERE WAS STOPPED AT THE RED LIGHT, AT THE INTERESECTION OF DOMINION BLVD. AND MOSES GRANDY TRAIL..(FACING WEST)  AND WE SAW A FIREBALL DESCENDING IN NORTH TO SOUTH DIRECTION IN A 45 DEGREE ANGLE....THE FIREBALL WAS HUGE ROUND AND BRIGHT WHITE WITH A TAIL TRAILING....",
      "link": "http://www.nuforc.org/webreports/054/S54921.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b820b",
      "summary": "Around 10:15 pm on September 14, 2009.  My fiance and I witnessed a light traveling at a fast speed.  At first glance we thought it was",
      "city": "chesapeake",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "Around 10:15 pm on September 14, 2009.   My fiance and I witnessed a light traveling at a fast speed.  At first glance we thought it was a plane, but then realized there was no blinking light.  We concluded it couldnt be a commercial flight plane moving that fast and if it was a jet plane we would have been able to hear it.  As we continued driving the UFO traveled at a 75 degree angel and then made a very sharp left, which is impossible for a plane,",
      "link": "http://www.nuforc.org/webreports/072/S72310.html",
      "state": "VA",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8607",
      "summary": "Triangle formation of lights, one green over Dismal Swamp areaChesapeake,  Va",
      "city": "chesapeake",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Triangle formation of lights, one green over Dismal Swamp area Chesapeake,  Va I was alone on my way home from Chesapeake to Portsmouth VA, Friday Oct 24, about 9:30 PM. I was driving my usual route on the edge of the Dismal Swamp. My favorite route, Old Mill Rd, is a lonely dark curvy road, with no traffic lights. The sky was a beautiful dark blue. I think the moon was full. The sky was patched with large fluffy white clouds. It's close to deer mating season, and deer run across the road, so my eyes were closely following on the road. Above a clump of Cyprus and Oak trees, I noticed what I thought was an oddly moving jet airliner. I say odd because it moved much slower than a helicopter and emitted no sound. It was also to low to be an airliner. It wasn't a blimp either. The aircraft displayed about 6 or 7 large lights on each side of the chevron or triangular shaped craft with a green light on my left as I looked up. As I stated before, the sky was bright, but it was night. The last time I saw something strange like this I was around 12, 1973.  My brother told me to wait while he went in the house to get Daddy. Heck, no!  I went with him, when Daddy came out it was gone. It was shaped like a shallow bowl on top of a saucer. The aircraft had many windows and lights all around and red lights on top. We saw this aircraft two more times the summer 1974 with my eldest brother and a neighborhood kid. I live 20 miles from Norfolk Naval, Oceana Air Naval and Langley Air Force Base. I have lived within the proximity of naval and air force bases all around me all my life. I have seen plenty of planes, jets, helicopters, Stealth Fighters and jets that take off straight up from a aircraft carrier, but I have never seen something like this and what we saw when I was 12. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66671.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b967b",
      "summary": "The bright fireball dimmeded in appearance, then changed its trajectory, before disapearing.",
      "city": "chesapeake",
      "shape": "fireball",
      "date": "2010-06-03T00:00:00",
      "story": "The bright fireball dimmeded in appearance, then changed its trajectory, before disapearing. During twilight at approx. 7:45 pm looking straight up (12:00 pos.) and bringing my eyes down to the 11:00 position due east, an extremely bright star-like object appeared, traveling southeast very slowly for 2-3 second (maybe due to a very steep trajectory): the distance with hand outstretched was the length of my thumb. Then the object faded to a small red dot and turned south, doubled its speed, and traveled another 4-5 seconds before completely disappearing without a trace.",
      "link": "http://www.nuforc.org/webreports/075/S75501.html",
      "state": "VA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baf1b",
      "summary": "Bright, strange light.",
      "city": "chesapeake",
      "shape": "unknown",
      "date": "2010-08-24T00:00:00",
      "story": "Bright, strange light. We were watching the planes and satellites one night and noticed an unusually bright light.  We quickly ruled out the possibility of it being any man made object as it stopped mid-flight for a few seconds and moved in a completely different direction.  The object moved for a few more seconds then stopped once more, but instead of moving it just sat there for quite some time.   We went inside before it ever moved again.",
      "link": "http://www.nuforc.org/webreports/077/S77366.html",
      "state": "VA",
      "duration": ">5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1ad",
      "summary": "4 lights in sky",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2011-04-03T00:00:00",
      "story": "4 lights in sky it was thursday or friday cloudy skies four lights where circling around then joining in the middle center then expanding outwards in a perfect square like four corners and then back to the middle.  it looked like the lights you see from and event in hollywood however the lights were coming down from above the clouds.  when the clouds got thicker the lights were harder to see this is how i could tell it was above the clouds",
      "link": "http://www.nuforc.org/webreports/080/S80725.html",
      "state": "VA",
      "duration": "several hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bc99a",
      "summary": "Bright light travelling across the night sky that dimmed, then became bright again several times as I watched.",
      "city": "chesapeake",
      "shape": "light",
      "date": "2011-10-19T00:00:00",
      "story": "Bright light travelling across the night sky that dimmed, then became bright again several times as I watched. I saw a strange sight in the early morning sky on 10/18/2011 at about 5:30 am, over Chesapeake, VA.  I've always been one to check out the night sky looking for meteors, satellites, planets, etc. But, I've never seen what I saw this morning in over 40 years of sky watching. I noticed a bright light moving from the NorthEast to the South, below the moon which was directly overhead. The path was not low, but not high in the night sky, about the level of Orion's belt to the right of the moon. I originally thought it was a satellite that had caught the morning sun not yet above the horizon. As I watched, the bright light became fainter, almost disappearing, but the object was still visible on it's path. Then, the object became really bright again, then fainter, then bright, then faint before disappearing totally.  The speed of the object as it moved across the sky was similar to a satellite - not fast, but steady. There was no jet noise, that I would have heard if this was an airplane of some kind.  Jets fly overhead all the time and usually there is some level of noise even at the highest altitudes, especially during the quiet morning. I'm not sure what I saw, but there was something unusual in the sky. BTW - there were no clouds - not even wispy ones - in the sky for the object to \"hide\" behind this morning.",
      "link": "http://www.nuforc.org/webreports/084/S84617.html",
      "state": "VA",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd8b",
      "summary": "Ufo orbs over skys in Chesapeake, VA",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2011-05-29T00:00:00",
      "story": "Ufo orbs over skys in Chesapeake, VA Last night my family (husband, 2 daughters) and I were in the pool late.  My daughter pointed to the sky and said what's that?  We are in the flight pattern for the airport where we are so I had thought it was just a plane but it had no flashing light on it at all.  It moved from left to right then to the left again.  Then it looked as it was coming back toward us and then looked as if there were 2 orbs of light in the air then that were very close together.  To me they looked very white in color.  My husband saw it a little different through his video camera on his phone. In his camera they looked as they were changing color from like a pink to blue to white but I could not see that with my bare eyes only on his phone in the video.  It was in the sky for about 10 mins then it just disapeared.",
      "link": "http://www.nuforc.org/webreports/081/S81546.html",
      "state": "VA",
      "duration": "10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bd430",
      "summary": "A silent,spinning daylight disc.",
      "city": "chesapeake",
      "shape": "disk",
      "date": "",
      "story": "A silent,spinning daylight disc. On a breezy summer morning in 1957 I was a nine year old boy looking for a lost wiffle ball in a large bush wich stood at then end of our driveway in those days. I saw a bright white object through the limbs of the plant; thinking it was the ball I stood back for a better look when I realized the object was in the sky and descending into the large, fast moving clouds above me. As the object passed through the clouds  it changed from a glowing object to a brass-colored shraply defined disc. It descended below the clouds and hung silently in the air spinning counter-clockwise. I could see five black ports on the object's bottom. After a short time the disc tipped onto its edge and I could see the top also had five black ports. After &quot;dipping&quot; one or twice the object flew away with a clearly heard &quot;woosh&quot;. At no time was there any engine sound or sonic boom. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89813.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd637",
      "summary": "Many red round spheres of light. All traveling together then ascended into the sky.",
      "city": "chesapeake",
      "shape": "sphere",
      "date": "2012-10-30T00:00:00",
      "story": "Many red round spheres of light.  All traveling together then ascended into the sky. At least twelve red round spheres of light were traveling in the night sky.  One by one they traveled from right to left. Originally, they looked to form a V shape, and then they appeared to straighten out.  They did not flash or flicker.  They were all a solid red color. There was no noise coming from them.   They just kept coming.  Then they slowing started ascending in the sky at about a 40 degree angle. As they ascended they disappeared.  About seven mintues later a military plane came to my area and hovered. I heard the plane coming and saw it hover with lights on as if checking out the area.",
      "link": "http://www.nuforc.org/webreports/093/S93394.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bde40",
      "summary": "A formation of several orange circular lights gliding through the sky.",
      "city": "chesapeake",
      "shape": "formation",
      "date": "2012-11-19T00:00:00",
      "story": "A formation of several orange circular lights gliding through the sky. There was a formation of about 6 orange circular lights gliding through the sky.  They were similar to that of a formation of geese, however it was not a perfect 'V' shape...it shaped like an arrow with only 1 arm.  The lights traveled silently together soaring through the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94465.html",
      "state": "VA",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bde82",
      "summary": "7 to 8  orange balls in a line, 4  additional balls  from top left coming down T an angle.no sound and I followed it across th sky as f",
      "city": "chesapeake",
      "shape": "formation",
      "date": "2012-11-19T00:00:00",
      "story": "7 to 8  orange balls in a line, 4  additional balls  from top left coming down T an angle.no sound and I followed it across th sky as far as I could see.",
      "link": "http://www.nuforc.org/webreports/094/S94445.html",
      "state": "VA",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be403",
      "summary": "orange flashing lights in sky",
      "city": "chesapeake",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "orange flashing lights in sky My grandmother and I walked outside and spotted two orange lights moving at a steady pace in the night sky, blinking from orange to white in a rhythmic pattern.   The lights moved independently from each other, and would constantly changed direction at random from one end of the sky to the other.   We started to head inside once a HUGE thunder/lightening storm began to form (still currently storming).   Before walking inside, I was able to make out more detail on one of them, and it seemed to be made of three lights, not one.  It may have resembled a triangular shape, but I didnt have enough time to be sure.   Eventually the clouds rolled in so thick, my view was completely obstructed.",
      "link": "http://www.nuforc.org/webreports/090/S90275.html",
      "state": "VA",
      "duration": "On Going"
    },
    {
      "_id": "64d005f478aba2ec5a3bea96",
      "summary": "Two intense, multi-colored, pulsating lights/objects aloft in vicinity of Chesapeake, VA",
      "city": "chesapeake",
      "shape": "unknown",
      "date": "2012-02-03T00:00:00",
      "story": "Two intense, multi-colored, pulsating lights/objects aloft in vicinity of Chesapeake, VA Chesapeake, VA, (approx 36-44N 76-13W) on 24 Jan 2012 from approx 1820-1830 EST while grilling on the BBQ, I noticed an intensely bright, pulsating, multi-color light (altenating red, blue, violet) in the air to the west of my location at about a 45 degree inclination above the horizon.   At first I thought it may be a helicopter, as it appeared to be “hovering”.  I then saw a second, similar light to the left (SW) of it at a lower altitude.  Having no point of reference, I could not estimate the distance, but guess at least several hundred yards up to a mile.  They each then began to display an “on-off” flashing yellow-white light in addition to the pulsating, changing color lights and they began very quick, erratic, “hummingbird-like”, “dancing” movements, up, down, left, right over great distance.  I was once a high speed  morse code operator and could not distinguish any intelligible “code” from the flashing lights, although they did appear to be in deliberate! pattern/sequence, not random. The flashing light of the second object appeared to respond to the first. A few minutes after first observing the lights/objects, a small, single engine propeller aircraft approached from west to east  (common route to/from Chesapeake Municipal & Norfolk International airports).  The plane was at about 1500 feet altitude. As the plane approached, the two lights/objects quickly dropped from view below the treeline several hundred yards to my west. After the plane had passed overhead and to the east, the two lights/objects quickly reappeared and continued their “dance” for a few more minutes before disappearing. It was a clear evening, shortly after sunset with only several high altitude jet aircraft vapor trails visible in the night sky. A partial moon was in view to the northwest. Other than the bright lights, where the yellow-white flashing lights were to the immediate left of the multi-colored, pulsating “halogen-like” ones, I could not discern any form or shape of the objects from which they emanated. There was absolutely no sound coming from them that I could hear. They were like nothing I’d ever seen.  Surely they were not from conventional aircraft, fixed wing or rotary, and they were definitely not weather balloons or “natural phenomena”.  I thought possibly kids with REALLY sophisticated radio-controlled devices? Maybe, but I really don’t think so. In any case, I’ve never reported anything like this before, and seeing them is what caused me to search the internet for similar sightings, which brought me to this web site.  I’m neither a “believer” nor “non-believer” in UFO’s.  My jury is still out.  But I did nearly burn my chicken.  A small price to pay for a really interesting light show. I am a 30 year military career retiree still serving as a civilian in security management.",
      "link": "http://www.nuforc.org/webreports/086/S86820.html",
      "state": "VA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bf146",
      "summary": "Red orange fireballs in a triangle shape hovering over 64.",
      "city": "chesapeake",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "red orange fireballs in a triangle shape hovering over 64 4 Reddish orange glowing lights in a triangle shape hovering over 64 between Greenbrier and Indian river, an ember seemed to fall off of one off the lights.",
      "link": "http://www.nuforc.org/webreports/096/S96826.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1ef",
      "summary": "A mid-level altitude, brilliant sphere flew over SW Chesapeake, VA on 06/05/13.",
      "city": "chesapeake",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "A mid-level altitude, brilliant sphere flew over SW Chesapeake, VA on 06/05/13. A bright light or brilliant white orb, came from the SW and glided to the east.  It was not flashing.  It was low, within the top cloud layer. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98460.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c020c",
      "summary": "Dark triangular craft with bright yellow light and smaller red and blue lights moved at pace of 25-30 mph.",
      "city": "chesapeake",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "Dark triangular craft with bright yellow light and smaller red and blue lights moved at pace of 25-30 mph While driving down Kempsville Road near Volvo Parkway in Chesapeake, Va, a triangular shaped craft was spotted in the air about 30-40 feet above the ground.  Initially it held its position for about two mins.  Then slowly, it began to rise up about another ten to 20 feet and traveled west toward the Chesapeake City Park and then northwest toward Battlefield Blvd and Interstate 64. No sound was heard from the craft when it PASSED OVER my vehicle or when it passed over the other witness's residence.  Though, I did notice that the radio in my vehicle was disabled while I was driving and only when I arrived home did the radio turn on without me touching the tuner or volume. The shape of the object was dark and triangular; it appeared at first glance to be a bright yellow light.  On closer review, it also had smaller red and blue lights.  None of the lights were blinking or changed within the first four mins, then the bright yellow light began to pulse slowly while the craft was moving throughout the remainder of the sighting.  The craft moved slowly at a 25-30 mph pace. In total the sighting lasted for about 15 mins.",
      "link": "http://www.nuforc.org/webreports/095/S95853.html",
      "state": "VA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c047a",
      "summary": "Formation of 6 amber colored lights in the sky.",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2013-04-12T00:00:00",
      "story": "Formation of 6 amber colored lights in the sky.  They sequentially distinguished one by one like flares.  Moved too fast to be helos, but too quiet to be jets.   Too red to be stars, and not fast enough to be meteors.",
      "link": "http://www.nuforc.org/webreports/096/S96825.html",
      "state": "VA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c063c",
      "summary": "Multi-color emitting light/star in the sky, extra brilliant, vanishes.",
      "city": "chesapeake",
      "shape": "light",
      "date": "2013-02-18T00:00:00",
      "story": "Multi-color emitting light/star in the sky, extra brilliant, vanishes. I walked out onto my back porch with a friend, and immediately noticed a very bright, energetic light in the western sky.  It appeared to be a star, but was much much brighter than any other star, and looking closer, I saw that the light source was 'twinkling' various many different colors other than white, mainly red, green, and blue. I cannot stress how much brighter this light was compared to the other stars in the sky, including the big dipper which appeared large in the sky and was directly overhead.  I also cannot stress how colorful the light was.  I was literally in awe trying to explain it to myself. It was not a radio tower, with a distinctive, predictable white or red blinking. It was not a helicopter or an airplane, as it was completely stationary in the sky and appeared to be very far away.  Only the brightness of the object could have made it appear to be within the atmosphere. In awe of and unable to explain what I was looking at, I went back inside to grab some other people, but when we went outside the light was gone. I'm not sure what it was.  One of my theories is that I witnessed the images of the death of a star, a supernova, however many light years away it was, that were just now reaching Earth. Has anybody heard of a supernova or other explainable cosmological event that would have been visible between 2-3 AM Saturday the 16th of February 2013, in the west/southwestern sky of Chesapeake, VA? ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96357.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d62",
      "summary": "A large white disk shaped object hovering or floating  in sky  on a clear morning and then it vanished.",
      "city": "chesapeake",
      "shape": "disk",
      "date": "2014-01-30T00:00:00",
      "story": "A large white disk shaped object hovering or floating  in sky  on a clear morning and then it vanished. On an early clear morning.  I was standing in my door way of my mobile home and looking up at the SE direction of the clear blue sky I noticed a large white disk shaped object hovering or floating in the sky at a close distance.  I kept my eyes focused on the craft to look for blinking lights to make sure it wasn't an airplane but I didn't see any lights at all, it was just solid white.  I thought it was very unusual and as I kept my eyes focused on the object it just suddenly disappeared. It didn't fly away like an airplane, the craft or object just vanished. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106695.html",
      "state": "VA",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e39",
      "summary": "Two flashing round orbs in the sky flashing red orange green blue N white.",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2014-02-07T00:00:00",
      "story": "two flashing round orbs in the sky flashing red orange green blue N white I was letting my dog out when I noticed a bright flashing object in the sky at first I thought it was a fading star or a helicopter but when I focused on it or could see green orange blue and white lights flashing in almost spinning rotation I then went and got my girlfriend and her brother when I got back to the porch I then noticed another light to the right of the first one they were both hovering in there spot the first light then started moving slowly behind a tree then disappeared the second ones lights got dimmer and dimmer then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106874.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f10",
      "summary": "Large bright blue light in the sky breaks into three lights and descends.",
      "city": "chesapeake",
      "shape": "light",
      "date": "2014-02-14T00:00:00",
      "story": "Large bright blue light in the sky breaks into three lights and descends I was on my way home between 6 pm and 6:15 and I saw a large bright blue light in the sky.  It looked like it was falling so my first thought is that it was a meteor.  Then it broke into 3 lights.  They all kept going in a downward direction but I lost sight of them due to the high tree line behind the houses on my street.  The sighting only lasted 4 or 5 seconds.  The lights  seemed close.  There were no tails on the lights as there often are with shooting stars.  I work for a defense contractor.",
      "link": "http://www.nuforc.org/webreports/107/S107015.html",
      "state": "VA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c54",
      "summary": "Just saw a fireball then it went out another fireball same spot and then a rounded umbrella of smoke in the trees near the high rise br",
      "city": "chesapeake",
      "shape": "fireball",
      "date": "2014-07-20T00:00:00",
      "story": "Just saw a fireball, then it went out another fireball same spot, and then a rounded umbrella of smoke in the trees near the high rise bridge going towards Suffolk, VA.",
      "link": "http://www.nuforc.org/webreports/111/S111660.html",
      "state": "VA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2269",
      "summary": "Slow moving object white in color moved away at a very high rate of speed,",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2014-04-11T00:00:00",
      "story": "slow moving object white in color moved away at a very high rate of speed, On April 5, 2014 between 2100 hrs. and 2200 hrs. I was in my front yard with my dogs. It was a clear cool night the moon was out and the stars were brilliant. As I turned I glanced in the Southern part of the sky and observed a very bright star.  Then it dawned on me I had not seen a bright star in that part of the sky.  It was approximately 60 degrees up.   After looking I thought it must be a plane.  The area I live in has many military bases were planes and land and take off through out the day and night. There is a Coast Guard Base about 50 miles away in North Carolina and helicopters fly to the Norfolk Naval Base.  We also have the Norfolk Internationl Air Port where commercial planes land and take off so I thought nothing of it. Later I looked at the object again and it was closer at about the same angle. I wondering why it was so bright then concluded it must have its landing lights on.  I could not see the red and green flashing lights on the wings and thought the landing lights were blocking them I turned and went back playing with my dogs.  There were other planes in the area I could see their flashing red and greenl lights on the wings.   Some were making their turn for Norfolk Airport and otheres heading towards other places. I looked again and the object made a slight course change rather quickly.  It was not a big move but was abrupt.  As I took my dogs back to the house I glanced again at the object and realized it was not a plane.  The total time I had been and outside playing with the dogs and watching this object was about 10 minutes. While in the house I grabbed my Nikon 10x50 binocluars went out side and observed the object through the binocluars.  At this time it was at about an 80 degree angle almost directly over me, I had to lean against a post on my porch to steady the binocluars. It was bright white with a haze around the edges and in the shape of a circle.  I called my wife and asked her what she thought that was pointing to the object she replied a plane.  I handed the glasses to her she looked and said on my God.  Then she said it was gone. I grabbed the binocluars found the object whchi had moved in a North East direction very fast it was no a pin point of light orange in color and about 20 to 30 degress.  It got smaller appeared to go in to a haze then it was gone.  From the time I took the glasses and the object disappeared was from 5 to 10 seconds. I have thought about this and believe the object was above the Earths' atmosphere. The bright white was a reflection off of the objects surface.  That would also explain why there was no sonic boom when the object sped away.  I now believe that the object did not change color to orange but as it sped away the atomsphere gave the impression the color change.  I have observed this when I look at a star in that direction that appears to be orange.  This object must have been massive.",
      "link": "http://www.nuforc.org/webreports/108/S108444.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2542",
      "summary": "At bus stop and looked up at plane.  To the left of it appeared to be an orb.  The orb was a lot faster and more agile than any plane t",
      "city": "chesapeake",
      "shape": "sphere",
      "date": "2014-11-06T00:00:00",
      "story": "At bus stop and looked up at plane.  To the left of it appeared to be an orb.  The orb was a lot faster and more agile than any plane that I have seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114616.html",
      "state": "VA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3671",
      "summary": "Moving triangular shape (lights) across the night sky",
      "city": "chesapeake",
      "shape": "triangle",
      "date": "2015-02-06T00:00:00",
      "story": "Moving triangular shape (lights) across the night sky I was driving down I-264 headed towards Battlefield Blvd south exit.  Many cars on the road (Saturday night) I noticed two lights in the sky which were moving slowly but quite discernibly in Unison thigh they seemed far apart from each other.  I watched this as much as I could as I drove.   When I took the exit I pulled over as quickly as possible but I could only stay there a few seconds because of the traffic.   I took a picture with my iPhone 6S through the front windshield of my car.  I really didn't think I'd capture anything, but I actually did I will send the pic",
      "link": "http://www.nuforc.org/webreports/117/S117114.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c39a1",
      "summary": "Odd blinking light in sky moving in odd ways.  ((NUFORC Note:  \"Twinkling\" star, possibly Sirius.  PD))",
      "city": "chesapeake",
      "shape": "light",
      "date": "2014-12-18T00:00:00",
      "story": "Odd blinking light in sky moving in odd ways. My family and I had just gotten back home from going out to eat and my son saw Orion’s belt in the sky.  He asked if he could break out his telescope and look at the stars since the moon’s not out.  We said sure and went into the back yard to do a little stargazing. We had been outside for about 20 minutes and had seen a few shooting stars and a few planes.  We all kind of fixated on this one light though that my wife thought was a plane because you could see it blinking, but I thought was something else (honestly, I thought it was a star) because I was able to lock in on it through the telescope.  I said that if it were a plane, then I wouldn’t be able to hold it in the telescope long enough that we could all take a look at it. We started watching it at about 2012 as it started to do some pretty weird things.  First it would blink like crazy (white, red, and blue), then it would just sort of twinkle a little.  Then it started swinging left and right, just sort of rocking back and forth.  It also started bouncing up and down in the sky and doing loops (moving in a circle) in front of us.  I saw three planes in the sky around this odd light that were able to move along like I had seen most planes do, but this thing was still in more or less the same place it had been at when we first saw it after almost half an hour. At 2040, we decided that we needed to go in since it was cold and the kids have school in the morning.  We ran into my neighbor, who we showed the light in the sky to, and he said, “That’s cool.” And then went to get his wife to show her too.  That’s when I came inside and started talking about maybe calling the local police or something.  My wife was outside still, but when she came in she asked if I was serious, told me that she had seen the light go out and come back on again, and then looked up a way to report a U.F.O. ((NUFORC Note:  \"Twinkling\" star, possibly Sirius.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115999.html",
      "state": "VA",
      "duration": "30+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3cf0",
      "summary": "Star like light over Chesapeake suddenly accelerates across the night sky",
      "city": "chesapeake",
      "shape": "light",
      "date": "2015-07-06T00:00:00",
      "story": "Star like light over Chesapeake suddenly accelerates across the night sky Strange lights.  I'm here in Virginia visiting close friends when I spotted something unusual in the night sky!  We'd spent the 4th enjoying the celebrations etc..  However, around 8.45 to 9 pm, I realised everyone sleeping, so I decided to go out into the back yard and watch a local fireworks display. I was sitting there enjoying the show when I spotted what I thought was an aircraft in the night sky. It was visible over the house in a north-westerly direction and I estimate at about 35 degrees from the horizon.  Again, still thinking it was an aircraft, I ignored it and continued watching the fireworks. A few minuets passed when I realised it was still there; at which point I assumed it was a very bright star which, I found unusual as the night sky was a cloudy.   Nevertheless, I continued to watch the firework. Suddenly, I'm estimating a little after 10pm I heard a firework land out front.  Now at this point, I knew everyone was sleeping and the garage door was open, so I figured I'd better go close it.  However, just at that moment, I glanced up at the star and watched in amazement as it just shot off across the sky and out of sight heading from it stationary  north west position in a west-south-west direction. Object:  Bright star like light object  Location:  Northwestern sky, approximately 35 degrees off the horizon.  Stationary. Duration (time first noted):  Approximately 70 minutes   Eventual direction of travel:  west-south-west  Weather:  A cloudy but dry. I'm not sure what I witnessed, but I'm sure it wasn't an aircraft or firework, or anything of that nature, because if I hadn't moved, I have went to bed thinking it was a bright star!",
      "link": "http://www.nuforc.org/webreports/120/S120081.html",
      "state": "VA",
      "duration": "~70 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c470e",
      "summary": "Hovering triangular craft that took off after being suspended in the air for minimum 5 minutes",
      "city": "chesapeake",
      "shape": "triangle",
      "date": "2015-11-26T00:00:00",
      "story": "Hovering triangular craft that took off after being suspended in the air for minimum 5 minutes We were driving home from the movies in Chesapeake va back to elizabeth city on 17south and to our left a few miles ahead of us, we saw high in the sky looked that looked like car lights facing the north.  Of course the craft of some sort was a lot bigger but left us thinking is there a giant flying car.  But it was dark and we figured it was lower flying plane.  Then in the background we actually seen a plane which looked like an ant compared to this thing.  As we got closer we were just like maybe it's a light tower of some sort for it hadn't moved since we first saw it.  When we got parallel to it we couldn't imagine a light tower being so high in the sky.  So we pulled over to try and get a better view and that's when it started to move north.  Didn't shoot thru the sky just casually went north towards Chesapeake.  Freaked out that it even started moving we jumped back in our car and took off watching it disappear into the dark night through the side view mirrors.  This wasn't a plane of any sort and I'm a huge skeptic.  Wasn't a chopper.  Something that stays suspended thru the air that long and then takes off it was really odd and got me looking on the Internet for anyone else whom may have seen it.  It also had blinking lights behind it that I saw as it started to take off",
      "link": "http://www.nuforc.org/webreports/124/S124326.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4aaf",
      "summary": "Started out as 1 object and then 2 with pulsating white/red lights",
      "city": "chesapeake",
      "shape": "unknown",
      "date": "2015-10-09T00:00:00",
      "story": "Started out as 1 object and then 2 with pulsating white/red lights I saw it as I was driving on I-664 and exiting towards I-64W.  It appeared to be one flying craft at first that was vertically aligned almost shaped like a Z with white and red lights.  The shape then changed and appeared horizontal and then half disappeared like it separated into 2 separate objects.  The one flying object had pulsating/flashing lights.  I could see the object was moving and appeared to be descending quickly-the lights flashed pulsating off & on and when it would come on it was several hundred miles lower in the sky until it just disappeared behind the tree line. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122616.html",
      "state": "VA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4bf3",
      "summary": "4 circular bright orange balls in sky over Centerville Turnpike in Chesapeake, racing with and around each other, then disappearing.",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2015-09-11T00:00:00",
      "story": "4 circular bright orange balls in sky over Centerville Turnpike in Chesapeake, racing with and around each other, then disappearing. Our family was driving home from a dinner date with friends in Kill Devil Hills.  We were on Centerville Turnpike and 4 bright orange glowing circular objects appeared out of nowhere in front of us high in the night sky.  They were appeared to be racing together and around each other.  Then, they immediately changed directions (took a hard right turn) and one flew faster and pasted the others.  Then they disappeared.",
      "link": "http://www.nuforc.org/webreports/121/S121730.html",
      "state": "VA",
      "duration": "several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b6a",
      "summary": "Really bright, almost like a star and stationary.  Then it turned silver, disappeared.  ((anonymous))",
      "city": "chesapeake",
      "shape": "light",
      "date": "2016-04-22T00:00:00",
      "story": "It was really bright almost like a star and stationary.  Then it turned silver.   After it went silver about a minute later it dissappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126933.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c66ce",
      "summary": "Daylight disc with flashing lights.",
      "city": "chesapeake",
      "shape": "disk",
      "date": "2017-04-20T00:00:00",
      "story": "Daylight disc with flashing lights. At about 530 PM (EDT), I was sitting in my backyard, watching the birds, when I saw something moving through the sky below cloud level and at a quick but not overly fast pace, at a steady South to North direction.  I first thought it was a bird, until it was nearly overhead, when I realized it was a disc shaped craft, spinning counter clockwise, and flashing lights in a red-green-white pattern.  The white light seemed especially bright considering it was still daylight. The object made no noise as it passed and continued South to North until it was lost from view.",
      "link": "http://www.nuforc.org/webreports/133/S133660.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c79d4",
      "summary": "Light was moving at a constant speed, vanished, then reappeared and raced across the sky at great speed. ((anonymous report))",
      "city": "chesapeake",
      "shape": "light",
      "date": "2017-12-04T00:00:00",
      "story": "Light was moving at a constant speed, vanished, then reappeared and raced across the sky at speeds we are DEFINITELY not capable of. I had seen a light moving in the sky and did not see any flashing lights which raised my interest.  As I continued to follow the light with my eyes for a couple minutes,  it slowly faded away.  About one minute after the disappearance, there was an extremely fast flash across the night sky in the same vicinity. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137516.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fec",
      "summary": "Cigar shaped object hovering in sky.",
      "city": "chesapeake",
      "shape": "cigar",
      "date": "2018-04-13T00:00:00",
      "story": "Cigar shaped object hovering in sky I was turning onto my street coming home from lunch, and noticed a white/silver, cigar shaped, object hovering in the sky.  There were many commercial aircraft in the air at the time, flying in all directions, leaving chem trails.   I proceeded to pull over so I could take a picture with my phone.  As I got out of the car, the object disappeared.   This was not a plane.  It hovered in the sky and almost appeared to \"wobble.\"",
      "link": "http://www.nuforc.org/webreports/139/S139378.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8056",
      "summary": "Saw a light in sky as bright as planet (thought it was a planet), then it moved north(ish) in straight line. ((anonymous report))",
      "city": "chesapeake",
      "shape": "light",
      "date": "2018-04-05T00:00:00",
      "story": "Saw a light in sky as bright as planet (thought it was a planet), then it moved north(ish) in straight line, figured it was a plane, then it dimmed, got a bit brighter, then dimmed completely.  It was almost directly over head.  Didn't see anything.  First saw the light NE of big dipper.  It wasn't large, seriously just looked like a planet.  Not blinking at all.  No sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides minimal contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139363.html",
      "state": "VA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c80dc",
      "summary": "Circles of light appearing and darting about the sky, some appearing before others.",
      "city": "chesapeake",
      "shape": "sphere",
      "date": "2018-03-08T00:00:00",
      "story": "Circles of light appearing and darting about the sky, some appearing before others. Flying orbs of light, darting about the sky.  They were flying together at times.  Some appeared before others.  The seemed to gather together and fly off and disappear.  Complete spheres of light.",
      "link": "http://www.nuforc.org/webreports/139/S139026.html",
      "state": "VA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c812b",
      "summary": "Two diamond shaped objects remained stationary above the highway.",
      "city": "chesapeake",
      "shape": "diamond",
      "date": "2018-03-02T00:00:00",
      "story": "Two diamond shaped objects remained stationary above the highway. While driving northbound on Ohio 7, my roommate and I spotted two diamond shaped craft stationary above the highway.  The two of us were returning to Ohio State University at Proctorville, when two amber colored diamond shaped objects caught our attention. After stopping on the highway shoulder, it appeared that both of the objects remained motionless in the vicinity of Ohio 7 and Irene Road, which was our exit.  The two objects appeared to be the same size, approximately 25 feet in height and equally as much in diameter.  Both of us counted three sides on top of the objects and three sides on the bottom of the objects.  The objects appeared to present the same face to us.  So, I’m assuming that there were the same number of sides on the reverse, or the backside of the objects. The objects could not have been more than 500 feet above the highway exit, and, considering that it was approximately a half hour after sunset, both objects illuminated the ground beneath them.  The color was amber to gold, and there were times when the intensity became momentarily brighter.  Both of the objects swayed slightly from side-to-side, accompanied by a slight increase in altitude, before they returned to their original position in the sky. As I later recalled, neither of the two objects had made any sound.  But, as we had made our way north toward the highway exit, the radio broadcast in the car had begun to crackle. In fact, the broadcast had momentarily quit before it came back to life. After twenty minutes, both of the diamond shaped objects became noticeably smaller.  Without taking my eyes from them, they became smaller again.  That’s when it became apparent to me that both of these objects were backing away from us—stepping back towards the horizon, where they disappeared from view. As the objects receded on the horizon, I remember being startled by the blast of a police car siren.  It appeared to be a state trooper, who accelerated at great speed over the hill, heading east in the direction of the funeral home and the university—and the two objects that had hung over the highway. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138911.html",
      "state": "OH",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c820c",
      "summary": "Just it was strange so early.  ((anonymous report))",
      "city": "chesapeake",
      "shape": "unknown",
      "date": "2018-01-18T00:00:00",
      "story": "Just it was strange so early Traveled very fast very high altitude with two lights (red/green flashing).  Sound of engines delayed 30 second after sight.  Clear skies tonight, bright stars and only one cloud wispy by at first glance before the aircraft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138364.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c83ac",
      "summary": "Quantum UFO",
      "city": "chesapeake",
      "shape": "circle",
      "date": "2018-09-27T00:00:00",
      "story": "Quantum UFO I was sitting out front smoking and whistling like what I believe UFO energy feels like.  I had my phone recording straight, left and right pointed at a tree.  Then, at 1 minute and 9 seconds, this white UFO of energy shoots up at the very top of the tree.  It looked like some kind of quantum energy.  This is very real.   The video is located here on my web server:   www.consciousmystery.net/ufo.mp4.   I bless all eyes so you can see what I see.",
      "link": "http://www.nuforc.org/webreports/143/S143154.html",
      "state": "VA",
      "duration": "1:15"
    },
    {
      "_id": "64d005f478aba2ec5a3c8513",
      "summary": "Purple beam of light.  ((anonymous report))",
      "city": "chesapeake",
      "shape": "",
      "date": "2018-09-27T00:00:00",
      "story": "Seen a solid bright purple beam of light across the sky and then it just disappeared.  It was so big that I could not see a start or end to the beam. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143272.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c90d7",
      "summary": "A green fireball moving across the sky at night.",
      "city": "chesapeake",
      "shape": "fireball",
      "date": "2019-12-01T00:00:00",
      "story": "A green fireball moving across the sky at night. My friend and I were driving down Greenbriar Parkway and she pointed out an odd shape in the sky. I looked up to see a large green fireball falling across the sky. It lasted for about 30 seconds before disappearing behind the trees",
      "link": "http://www.nuforc.org/webreports/150/S150243.html",
      "state": "VA",
      "duration": "30s"
    },
    {
      "_id": "64d005f478aba2ec5a3c9124",
      "summary": "Every Friday my husband & I get Chick-fil-A for dinner, but Friday October 4th at 8:12pm something out of the ordinary happened. We do",
      "city": "chesapeake",
      "shape": "egg",
      "date": "2019-12-01T00:00:00",
      "story": "Every Friday my husband & I get Chick-fil-A for dinner, but Friday October 4th at 8:12pm something out of the ordinary happened.  We do not have ac or heat in his car so we were cruising with all the windows down on Moses Grandy Trail.  As we passed the 50 speed limit sign and the road starts to curve the exact spot where we saw the UFO is: https://maps.app.goo.gl/TgZidfvRYAtaFKxs5  That's when we both saw a bright green light make a V shape and darted over and behind the trees next to the moon on the right.  The UFO was a very clear upside diamond or egg shape.. as it zipped down and the UFO made a loop and went round side up flying straight over and behind the trees.  There was a lot of traffic and it was right in the middle of the sky close to the roadway.  Overall the encounter lasted for a total of 30 seconds.  When it shot behind the trees next to the moon it just hovered and slowly became a tiny dot like it was flying out of the atmosphere.  I have included so! me drawn images of the UFO and the flight path it took.",
      "link": "http://www.nuforc.org/webreports/149/S149633.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9466",
      "summary": "Straight line of lights no flashing.  Moved together from west to east. ((NUFORC Note:  Cluster of \"Starlink\" satellites.  PD))",
      "city": "chesapeake",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "Straight line of lights no flashing.  Moved together from west to east. Seemed like they  were trailing.  No vehicle seen, no sound.",
      "link": "http://www.nuforc.org/webreports/150/S150571.html",
      "state": "VA",
      "duration": "5 minutes"
    }
  ]
}