{
  "city": "cincinnati",
  "fetch_timestamp": "2025-07-12T14:35:01.390720",
  "record_count": 118,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b415e",
      "summary": "5/16/1958/ 1500 hours/ just getting dark,mount arity forest",
      "city": "cincinnati",
      "shape": "diamond",
      "date": "",
      "story": "5/16/1958/ 1500 hours/ just getting dark,mount arity forest diamond shape,10 ft tall 6ft wide, you could see threw it,wooded area,when sun light hit it,it gave off different colors. camping in woods ((NUFORC Note:  Witness provides no other information.  Date of event may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49850.html",
      "state": "OH",
      "duration": "24 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b42e5",
      "summary": "large object  seen north of Cincinnati, 9 lights grouped in 3's, 1 group broke away  to follow us",
      "city": "cincinnati",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "large object  seen north of Cincinnati, 9 lights grouped in 3's, 1 group broke away  to follow us My husband and I were on our way back from a concert in Cincinnati (destination Circleville) to pick up our children from my inlaw's.   We were on a back road highway and I'm not sure of the name of it, but we realized we were going the wrong way.  I was driving and to our right, over a huge open field high up in the sky, were 9 lights (grouped in 3's) forming a huge triangle. They were slowly rotating as one large object. (The lights were at the corners of the object and were a bright glowing white.)   After one of the 3 groupings \"broke off\" from the formation and started following us.  They were not behind us, though.  They were beside us going at the same speed we were, but keeping a large distance between us.   We turned around in a driveway to head back in the right direction and all 3 disappeared.",
      "link": "http://www.nuforc.org/webreports/050/S50018.html",
      "state": "OH",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b46fa",
      "summary": "West side of Cincinnati-close to airport 10-11pm-Did anyone else see these?",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "West side of Cincinnati-close to airport 10-11pm-Did anyone else see these? I saw one or the same thing that moved on the west side of (downtown Cincy)town. Round with bright white light that would go \"around\" then I saw \"search light type\" light up into the sky in mulitiple directions. Had other colors in sporadic patterns light up.Stayed in place for about 1/2 hour then disappeared. I went to another vantage point and saw it again doing the same actions. Later it was to the north of Cincy.  Did anyone else see this? Would have been so close to the airport, but it didn't move in any pattern it just hovered very high up within plane paths I think. I have seen these before but I never wrote about them. Am I crazy?",
      "link": "http://www.nuforc.org/webreports/050/S50571.html",
      "state": "OH",
      "duration": "1/2 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b48ca",
      "summary": "Bright Orange Light from large Black Triangular Vehicle constant altitude, course and speed, no noise.",
      "city": "cincinnati",
      "shape": "triangle",
      "date": "2019-07-25T00:00:00",
      "story": "Bright Orange Light from large Black Triangular Vehicle constant altitude, course and speed, no noise. On the evening of July 14, 2019, approximately 9:25 PM EDT,  I was driving home from dinner along Cleves Warsaw Rd, travelling west, glancing out the window to observe the conjunction of the moon with the planet Jupiter occurring that evening in the southwest sky, when I noticed a bright orange light which appeared to be moving slowly from west to east.  What I immediately notices is that this object did not have conventional aircraft navigation lights, tail beacon, or belly strobe light as you would expect to see on a conventional aircraft.  Nor am I aware of any aircraft having an orange headlamp, and having been a student pilot earlier in life, this intrigued me.  I was really trying to see what this object was. \tI continued to drive, until I was able to reach a parking lot, where I pulled in facing south, and I watched the object, travelling at a constant speed, which was relatively slow, my guess would be 30-40 knots, on a steady course towards the east, in the direction of downtown Cincinnati, OH.  The object passed slightly south of where I was parked, about 80 degrees off of vertical at my position, at an approximate altitude, my guess, of 1500 feet Above Ground Level. \tAs the object flew past me, to the east, the orange light flickered out, it didn’t just shut off.  All through its flight, at every angle, the luminosity of the light had been constant.  Once the bright light was gone, I could clearly see a very large black triangular vehicle (perhaps the size equivalent of a Lear jet) continuing its flight to the east, and was able to watch it until it faded into the distance and into the darkening sky (the sun had just set, but there was still quite good light throughout this event). \tThis object made no sound at all.  Its course west to eastward took it perpendicularly through the final approach glideslopes of three major runways of the Greater Cincinnati/Northern Kentucky airport.  There was no encounter with an aircraft as it moved through perpendicular to all three runway 18 glideslopes which run north to south. \tI do not know what this was, but a few days later at dinner at a friend’s home, I was told that their son and his friend also saw the same object that same night about the same time from a place that was about a mile east of where I was parked that evening, and that he had called his parents for them to go out and look at it, and his parents missed it.  At dinner that evening on July 18, there was speculation about a drone, sunlight reflecting off an aircraft, and yet to me, that doesn’t explain the lack of engine noise.  I’m wondering if anyone else saw this, and they would know what it was.",
      "link": "http://www.nuforc.org/webreports/147/S147660.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b491f",
      "summary": "Bright flying object - moved so fast backwards out of sight - made no sound",
      "city": "cincinnati",
      "shape": "disk",
      "date": "2019-07-05T00:00:00",
      "story": "Bright flying object - moved so fast backwards out of sight - made no sound I was a student at the University of Cincinnati - studying late at night in the dorm towers - looking at the sky - saw a bright light in the sky - it grew brighter - and dimmed - there was no sound - I thought this is not a plane - no flashing lights or tail.  I starred thinking what is this.  I then saw it start to move slowly - one direction - stop and then fly directly back the other direction straight so fast it disappeared.",
      "link": "http://www.nuforc.org/webreports/147/S147207.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ebd",
      "summary": "Large V/triangle-shaped craft that moved silently. Disappeared at incredible rate of speed.",
      "city": "cincinnati",
      "shape": "triangle",
      "date": "2019-05-09T00:00:00",
      "story": "Large V/triangle shaped craft that moved silently. Disappeared at incredible rate of speed. I was driving home when something very large in the eye caught my eye. I was stopped at a light near my home and only got 15-20 secs of view. The craft was very large v/triangle shape. 9-10 lights lining the V pattern. I heard no sound from the craft. The craft was heading NE at an estimated 15-20k feet. Dark in color either black or dark gray. It made 2 movements. It seemed to descend rapidly and then abruptly shot out of sight along the same path it was traveling. I am not aware of any other witnesses to this phenomenon.  Life changing.",
      "link": "http://www.nuforc.org/webreports/146/S146041.html",
      "state": "OH",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b53cb",
      "summary": "low flying, slow moving retangular object making a low rumbling noise.",
      "city": "cincinnati",
      "shape": "rectangle",
      "date": "2008-06-12T00:00:00",
      "story": "low flying, slow moving retangular object making a low rumbling noise. Driving down Kemper Road (a small road running between two neighborhoods) at approximately 11:45 p.m., three friends and I heard a low rumbling noise. We looked up and saw a flying object. It was flying lower to the ground than an airplane or helicopter should. It was moving very slowly. It was rectangular in shape and had lights on all 4 corners. The lights were what looked like to be a mixture of orange and purple. The rectangle also had a funnel shaped object on top, sort of like a funnel to a tornado siren. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62660.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b544e",
      "summary": "Large saucer shaped craft hanging motionless and silently over Cincinnati.",
      "city": "cincinnati",
      "shape": "disk",
      "date": "",
      "story": "Large saucer shaped craft hanging motionless and silently over Cincinnati. I realize that this info is very old but wanted to report it as I never have.   I was 11 years old at the time of this sighting.  The weather was clear and sunny.  I was walking past a large part in an area refered to as \"Queen City\" when something caught my eye and I looked up and saw a very large saucer shaped craft approximately one hundred yards in diamater and about a mile from me and at about fifteen hundred feet altitude.  It appeared to be unpolished stainless steel in color and looked like two saucers turned on top of each other with a row of dark windows separating the two.  I saw no structures above or below it.  It was tilted at a 45% angle toward me and did not appear to be rotating or moving at the time and made no sound at any time.  After a few minutes I realized that it was moving very slowing, almost \"drifting\" southward and over the Ohio River into Northern Kentucky and the Greater Cincinnati Airport.  By the time it got to this point the object was now tilted at a nearly 80% angle.  By this time the light was starting to fade considerable, making contiued visual contact very difficult so I went back to my uncles home.  I did not mention this incident to anyone for many years for fear of ridicule.  During the time of the sighting,I looked around several times thinking that other people would be watching it as well.  I saw no one observing this very large saucer shaped object in broad day light over a large public park in a very large city.  I saw no-one!  I was amazed!!  I thought, \"I cann't believe that no one else is looking at this thing!\"  It was RIGHT THERE big as life and no one else was noticing it.  To this day I don't understand why it seemed that only I could see it. ((NUFORC Note:  Date of sighting may be approximate, although the witness does not indicate that fact.  One of two excellent reports from same source.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61668.html",
      "state": "OH",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5641",
      "summary": "Glowing orb floating at treetop level",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2007-08-07T00:00:00",
      "story": "Glowing orb floating at treetop level One evening, at about 7 o'clock PM, I was looking out my window over my kitchen sink as I rinsed some dishes.  A glowing, reddish orange orb was floating through the trees in my backyard.  It was about 30 feet from where I stood and just about at my eye level. The orb looked about the size of a giant beach ball. Our yard fell away steeply just feet from the foundation.  I watched this for several seconds as my brain tried to compute what I was seeing.  I watched as it maneuvered through the dense trees, yet never came into contact with one.  It then emerged from the other side of the woods and slowly climbed in altitude until it cleared the hill on the other side of the woods. It then disappeared in the distance.  I listened to the local news reports and scanned the paper for days to see if anyone else had seen it.  This happened in a heavily populated suburb.  One week later, about 10 o'clock PM, I was driving to Blockbuster with my husband and we spotted the same orb near the edge of town.  We followed it until it disappeared into the woods. This happened in the summer of 1992 in Cincinnati, Oh. It has haunted me ever since then. I was 45 at the time and a homemaker. We have witnessed several other strange anomalies in the years since this sighting took place. I know this sounds kooky, but as a child of 6, living in an orphanage in Iowa, I awoke one night to see 3 small alien figures standing next to my bed observing me. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57091.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5694",
      "summary": "On Christmas day we saw an orange ball of light with a ring surrounding it in the sky.",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "On Christmas day we saw an orange ball of light with a ring surrounding it in the sky. I don't exactly remember everything because I was only six years old.  I remember getting out of our car and standing in our apartment complex with my parents.  My dad just started screaming at my mom to get the camera and I didn't understand why.  Then he pointed in the sky.  There was an orange sphere of light with a ring around it.  It was relatively large compared to the small stars behind it.  At the southeastern side of the ball and ring there was a blur almost as if an engine was letting out intense heat.  We just stared at it for a while and then went back inside.  I don't remember if it was moving or not, I just remember being terrified and wanting to go in my home.",
      "link": "http://www.nuforc.org/webreports/057/S57050.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b57ad",
      "summary": "I saw an alian in it's space ship, in the car!",
      "city": "cincinnati",
      "shape": "disk",
      "date": "2008-03-04T00:00:00",
      "story": "I saw an alian in it's space ship, in the car! I was in my grandpas car, going home from boyscouts, and I saw something strange in the sky.  There were two saucers far in the sky moving back and forth. They would stay still for a few seconds, and then move really fast.  One of them shot into the sky, and disapeared. Then it came shooting back.  I tried to tell my grandpa, but by time he looked, they were gone.  When I got to my house, I found my spy binoculars and looked at the sky.  I waited and I finally saw them again. I looked closely through my binoculars, and saw a small body.  I got a better view of it, and to big, black eyes were starring at me.  It flew away, really fast with the other one.  It was a pretty scary thing for a 9 year old to see! ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61762.html",
      "state": "OH",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b59db",
      "summary": "saw a saucer(s) being transported southbound on I-75, heading towards Cincinnati",
      "city": "cincinnati",
      "shape": "disk",
      "date": "2007-08-07T00:00:00",
      "story": "saw a saucer(s) being transported southbound on I-75, heading towards Cincinnati While traveling northbound on I-75 on our way to church a Sunday morning this past Spring (2007), my husband and I saw what looked like 2 halves of a saucer being transported southbound.  If it wasn't 2 halves, then it was 2 saucers.  There were several vehicles surrounding to warn of a wide load.  We were between Cincinnati and I-275.",
      "link": "http://www.nuforc.org/webreports/057/S57147.html",
      "state": "OH",
      "duration": "less than a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6050",
      "summary": "UFO sighted on Oct 20, 2007 8:30 pm near downtown Cincinnati",
      "city": "cincinnati",
      "shape": "disk",
      "date": "2007-11-28T00:00:00",
      "story": "UFO sighted on Oct 20, 2007 8:30 pm near downtown Cincinnati One the evening of October 20, 2007, I was driving on Kyles Lane in Ft. Wright Kentucky.   My 15 year old daughter, a passenger in the car, started screaming hysterically that she saw a UFO. I laughed it off, thinking it was lights from a nearby ambulance reflecting off of something.  A quarter mile up the road she screamed again, telling me to look to my left, towards downtown Cincinnati.  This is when I caught my first glimpse of the object.  It was obvious that it was not something normal, but I was seeing it between trees.  As I drove a little bit further up the road it was clear as day to me. The object was lit up bright white with vertical tan marks on it that looked like shadows of some sort.  It was somewhat of a disk shape, with another bubble type disk at the top.  Its size was something I couldn't comprehend the possibility of it being able to hover in the air. It was easily the size of 3 city blocks squared.  I continued on Kyles Lane until I came to the bridge over Interstate 75, where I slowed to a near stop. Here we saw the object was within 2 miles of us, bright as could be, hovering just to the west of downtown Cincinnati.  We were both amazed that none of the other cars seemed to notice it.  At this point I was in total disbelief, on the phone with a friend who lived nearby, telling her to stand in her front yard facing Cincinnati and tell me if she saw it.  She saw nothing. Due to traffic I was forced to continue driving. I changed my course by heading south down Dixie Highway towards Covington and the Ohio River. At this point we saw it again, but this time it was much farther away, I'm guessing 30 to 40 miles north of the city. The shape and brightness of it was so distinct there was no confusion as to that being the same object. I sped down the hill on Dixie Highway towards Covington, trying to get near the river, and a better spot. I was hoping to find someplace to park with a clear view. I lost sight of it again while going down the hill, but once at the bottom, going east to! wards Fi fth Street we saw it for the final time. I was now near the river again, only this time it was east of Cincinnati, about 20 miles from the first sighting. Being a non-believer, I have gone over every possible scenario in my head, trying to convince myself I didn't see what I saw. There is also the fact that my daughter saw it, first I might add, and was completely shaken up to the point of hysterical crying and shaking that I could not console her in the least. I considered taking her to the hospital to be sedated, she was that upset. I also realized that I was shaking while trying to tell the story to a friend where my daughter was spending the night. I spent the rest of the night and the next morning trying to decide whether I was going to tell anyone. I consider anonymously calling the police station and saying \"Look, I don't think I'm crazy, but have you had any reports of a strange bright object seen around the city in the sky?\" I watched every news report for several days and scoured the newspapers, but I have seen no mention of anything that could even remotely be what we saw. There was a blimp in town the next day for a football game, but it was nowhere near the right shape and at least 10 times too small. So help me here, please. Are both my daughter and I certifiable insane or did someone else see this also?",
      "link": "http://www.nuforc.org/webreports/059/S59392.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b608c",
      "summary": "odd shaped diamond saucer,light could pass threw it,about thirty feet long,15 feet high,three feet from touching the ground,glass looki",
      "city": "cincinnati",
      "shape": "diamond",
      "date": "",
      "story": "odd shaped diamond saucer,light could pass threw it,about thirty feet long,15 feet high,three feet from touching the ground,glass looking ramp streched out touching the grass,grass seemed to be pressed down. trees all around it seemed too be pushed away from it. sighting took place in a large forest. female was about 6ft 4inches,very long white hair,she had a body you would die for.she spoke german,told her i did not speak it.she began too speak all types of langage,stopped her when she spoke english. she placed band around my head and i could hear her speak too me but in my mind.she did not speak english too well and this band would help us talk.let me see inside her star ship but would not let me go in.got very bad head ach from band had too take it off. i was 14 at time,62 now still see and talk too her ((NUFORC Note:  Date is approximate, although the witness would have been 14 in 1958.  We have amended the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50583.html",
      "state": "OH",
      "duration": "24 hours lost"
    },
    {
      "_id": "64d005f478aba2ec5a3b60be",
      "summary": "My friend and i were on the trampoline and it was sort of dark but light so we could see planes but out of nowhere behind a tree(not we",
      "city": "cincinnati",
      "shape": "cylinder",
      "date": "2008-03-04T00:00:00",
      "story": "My friend and i were on the trampoline and it was sort of dark but light so we could see planes but out of nowhere behind a tree(not we very bright and had tubes in the bake with large blue lights with three spining things on the bottom but not like a jet. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61442.html",
      "state": "OH",
      "duration": "i dont know"
    },
    {
      "_id": "64d005f478aba2ec5a3b6275",
      "summary": "Bright, blinking star -like objects moving from the western horizon toward the east were observed.",
      "city": "cincinnati",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "Bright, blinking star -like objects moving from the western horizon toward the east were observed. I would like to report an unusual sighting witnessed by 8 adults on Sunday night September 2, 2007 in Delhi (a western township of Cincinnati, Ohio). It was 9 p.m. and we were sitting on our deck. I noticed 2 blinking, bright star-light objects moving from the western horizon in a straight line toward the east. They were followed by 4 to 6 more similar objects. Then numerous blinking lights appeared traveling or following the lead lights. At one point they appeared to be zigzagging still traveling west to east. The blinking was at about two blinks per second. After they passed 45 degrees overhead they grouped together. Then another group appeared in the western horizon traveling west to east. Meanwhile the first group paused till the second group approached and then they continued on to the west and out of our sight. We estimate from 80 to 100 of the blinking white lights. The event lasted 2 to 4 minutes. We are professional, respected adults who live and work in our community. I am a grade school teacher. I have taught 5th grade astronomy. I am familiar with the night sky. This was very unusual. I would appreciate some information or feedback concerning the event. Thank you.",
      "link": "http://www.nuforc.org/webreports/058/S58545.html",
      "state": "OH",
      "duration": "2 to 4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b62a8",
      "summary": "Light traveled from the southwest to the northeast",
      "city": "cincinnati",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Light traveled from the southwest to the northeast,moving at a high rate of speed about 3 times the speed of an airplane.",
      "link": "http://www.nuforc.org/webreports/054/S54077.html",
      "state": "OH",
      "duration": "10sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b7041",
      "summary": "cigar shaped UFO",
      "city": "cincinnati",
      "shape": "cigar",
      "date": "2008-06-12T00:00:00",
      "story": "cigar shaped UFO Saw a cigar  light metal shiney in color craft about 2000 - 3000 ft up  thought it was a plane at first  because we have a airport somewhat close.   After a minute or 2 I noticed that it wasn't moving.  The craft was just hovering.   As I was watching it it just shot away at a high rate of speed.  It was so fast I almost couldn't react to it.",
      "link": "http://www.nuforc.org/webreports/063/S63842.html",
      "state": "OH",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b72f7",
      "summary": "Dark object falling rapidly downward from the sky with bright orange flames emanating from it",
      "city": "cincinnati",
      "shape": "oval",
      "date": "2008-02-14T00:00:00",
      "story": "Dark object falling rapidly downward from the sky with bright orange flames emanating from it On Monday, February 11, 2008, I was driving home. I was going down Interstate 71 south, and then turned on to Ronald Regan Highway, traveling Westbound. Less than one minute later, at almost exactly 2:01 a.m. I saw an object falling from the sky. It was nearly straight ahead of me and a little to the left, so I would estimate it was in the West-Southwest direction of the sky from where I was located. The object was falling very rapidly so I only saw it for about 3 or 4 seconds. It was falling at an angle from right to left, at about 7 to 8 o’clock (as if looking at a clock handle). There were bright orange flames coming off the object. The object itself was really just a dark spot, but it looked like a dark oval (judging from the flames coming off of the sides essentially); I could only see the flames coming off of it. What really surprised me is how bight and orange the flames were. I have seen meteor showers before, and this looked nothing like a meteorite that I had seen before. The size was very large, and it looked like something was on fire and just falling out of the sky. I did not see if it made it to the horizon, as there were trees to the side of the highway. I sped up in my car trying to make it past the trees on the left to the next clear spot where I could see closer to the horizon, but that took about ten seconds and by that time the object had disappeared.",
      "link": "http://www.nuforc.org/webreports/061/S61541.html",
      "state": "OH",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b58",
      "summary": "In the night sky, a second formation of the big dippper was moving at an exceptional speed south west.",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2007-03-08T00:00:00",
      "story": "In the night sky, a second formation of the big dippper was moving at an exceptional speed south west. On the night of March 3, 2007, my father went outside and started looking up at the night sky.  Around 11:00 P.M., he noticed the big dipper.  But something was wrong becasue there were two (kind of overlapping each other), but one of the sets were moving at a exceptional speed.  The set of the seven stars in the form of the big dipper were going south by south west.   Later the rest of my family came out and witnessed it to.   As we looked closer I also noticed that a few of them had little red light probes going around it (though very hard to see).   Some may say that stars don't move becasue of clouds or something, but we measured the distance with our roofline and other stars.  Other starts weren't moving, just that \"big dipper.\"  Eventually after 30-60 min it disappeard.  It appears that the object was mimicking stars to get around \"undetected.\"",
      "link": "http://www.nuforc.org/webreports/055/S55566.html",
      "state": "KY",
      "duration": "30-60 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b82d6",
      "summary": ".I was lying down for the night and looked up to see a very large orange orbe in the window that would minamize then expand to become l",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": ".I was lying down for the night and looked up to see a very large orange orbe in the window that would minamize then expand to become larger it freaked me out! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72358.html",
      "state": "OH",
      "duration": "15nin"
    },
    {
      "_id": "64d005f478aba2ec5a3b8344",
      "summary": "Black Flat Object with a Luminous Light hovering in the sky...",
      "city": "cincinnati",
      "shape": "rectangle",
      "date": "2008-10-31T00:00:00",
      "story": "Black Flat Object with a Luminous Light hovering in the sky... We were exiting a resturant in a plaza. We saw this retangular flat object that was levitating in the sky. It was not that high up. At first we thought it was a balloon or a bird. As we looked closer we all saw that the object was in deed a flat retangular shape with a luminous circle around it.  It kept swaying back and forth in an upward motion.  At first it was hovering over the same spot but then it continued to get higher. This went on for about two to three minutes and it disappeared. We actually could not believe what we were seeing. I typically do not believe in this type of stuff but there is NO other explanantion for this object. The fact that it was dark outside and we could see this black object floating in the air, leeds me to believe that this was something of a different nature. I do not know if this was indeed a UFO, but it was not normal whatever it was.  Please, I am not crazy. There were 3 of us, completely sober, who all witness the same exact object and motions. I did try to take a picture of the object. Only if you hold the carmera a certain way can you see the \"glow\" of the object.  It was a white circle around it. My flash on the camera would not work so I guess the black object did not come through. I just really want some type of explaination as to what this was? Have others reported this type of object before? I am freaked out right now.",
      "link": "http://www.nuforc.org/webreports/065/S65349.html",
      "state": "OH",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b88fd",
      "summary": "Radiating, pulsating, fiery object observed in the cincinati night sky!  ((NUFORC Note:  Probable sighting of Venus.  PD))",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Radiating, pulsating, fiery object observed in the cincinati night sky! at approximately 6:30 pm on friday november 7 i witnessed as what can only described as an unidentified flyng object. It appeared to be a a huge radiant object in the distant that remained stationary for at least 20-25 minutes, my wife witnessed the object as well and the object was subsequently recorded on video. i could not positively discern the exact shape of this object but if i were to make a reference point, it resembled the vehicular object depicted in the 1st superman movie that brought superman from krypton to earth, i say that not to sound hoaxy but merely as a description. i reside  southern ohio (cincinnati) and the object appeared in the southwestern portion of the horizon. it was a pretty clear nite and this object was clearly no celestial body based on the way it behaved. at times it appeared as giant pulsating ball of light. i noticed a lot of manmade aviation activity in the proximity of this object. this is clearly visible on the tape i made. i called a friend over the phone who resides not too far and he along with other witnesses observed similar activity. after about 25 minutes the object simply diminished in the distance to where it was no longer visible.  ((NUFORC Note:  Probable sighting of Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66796.html",
      "state": "OH",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8948",
      "summary": "glass like,you could see threw,craft was 20 feet in front of me,as i stepped closer, a ramp out of the side of the craft opened up and",
      "city": "cincinnati",
      "shape": "disk",
      "date": "",
      "story": "glass like,you could see threw,craft was 20 feet in front of me,as i stepped closer, a ramp out of the side of the craft opened up and i jumped back. as the ramp stopped coming out a femal voice spoke to me in my mind,go on in and i will be right there. I said no way and began to turn around,I felt something touch the back of my neck it felt hot and cold at the same time,I woke up about 500 feet from where i saw craft.   I got my things together and got on my mopet and rode home.  no one was home so i set down to watch tv. as certain programs came on i had to check the day and time. i had lost at least 24 hours.  it was friday when i left,it was now saturday   ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74812.html",
      "state": "OH",
      "duration": "six hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d32",
      "summary": "Grey Disk accelerates at incredible speed",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Grey Disk accelerates at incredible speed UFO SIGHTING  Date: 10/20/2009  Time: 05:30 am  I got up to watch the Orion Meteor Shower. I was inside my home looking out the windows of a french door that is in the rear of my home. The view is looking directly south. The meteor shower was being observed from west to east across my back yard. The night sky was crystal clear with no clouds being visable. I had been watching the shower approximately 15 minutes when I noticed a gun metal grey object stationary in the sky. It was just below a bright star. It stood out in the clear sky.I would say it looked more like a plate. As soon as I noticed the object, it accelerated in a straight line due south at an incredible speed and was out of site in a second. I did not hear any sound as I was indoors. There were no lights on the object. I was stunned by the speed of this object. All I can say is that I saw what I saw.",
      "link": "http://www.nuforc.org/webreports/072/S72970.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d38",
      "summary": "One star-shaped object. I thought it was Venus, being the brightest of the night stars. ((NUFORC Note:  ISS??  PD))",
      "city": "cincinnati",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "One star-shaped object. I thought it was Venus, being the brightest of the night stars.  But then it glowed bright, and moved upward, relative to planes and \"debris/falling stars\" I've seen before in my life.  It moved higher, slowly (one mississippi....), directly upward, and by the slow count of three it faded, as a light, into dissapearance. I'm a sinic so I called my mom, who is not.  As I was leaving a message to tell her I saw this I saw what looked like a shooting star. I saw the news about the potential meteor shower in the AM, but this was different, to say the least. Thanks. SG",
      "link": "http://www.nuforc.org/webreports/072/S72945.html",
      "state": "OH",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b925a",
      "summary": "4 lights shot across the sky - low - then hovered just above treeline - yellow/orange and one by one they dimmed &got bright &floated",
      "city": "cincinnati",
      "shape": "diamond",
      "date": "2009-12-12T00:00:00",
      "story": "4 lights shot across the sky - low - then hovered just above treeline - yellow/orange and one by one they dimmed & got bright & floated my son saw 4 lights zip across the sky - low then suddenly stopped and hovered near the horizon - they looked yellow to me but my 2 sons thought more orangish - then they slkowly floated towards the horizon and intermittently came on and off - individually - not all together - then one broke off and floated toward the ground - ( fell behind the treeline ) then one 'arced ' off and you could see a slight trail as it kind of half circled then went down also - then the others went sideways - then down - then they were gone . My son was so grateful we all ran out or we never would have seen them - there were 5 of us and it was bizarre!!",
      "link": "http://www.nuforc.org/webreports/073/S73184.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b944d",
      "summary": "Four low flying fireballs over Cincinnati.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "Four low flying fireballs over Cincinnati. I was driving home from work on Friday the 13th of November 2009. At around 7:40 pm near my home in the Cincinnati neighborhood of Westwood I viewed from the road while driving my car what looked like 3 flaming objects descending to Earth. As CKY is just across the Ohio River and a major flight path goes over my neighborhood I assumed it was a mid air explosion of a commercial aircraft. As I drove towards where the objects seemed to be descending I saw there were actually four burning fire balls moving in formation. These were not burners, they were visibly flaming and left 'tails' as they moved. It was an irregular motion and I watched them until they moved out of view. There was a lot of other aircraft activity in the sky as well, including a low flying(and fast) military aircraft that was discernably terrestrial and several civilian aircraft mentioned above that flew much higher and served as a point of reference for both fireballs and military plan. I ca! n still hear aircraft flying overhead in my apartment as a write. Amazing. I also got a poor picture on my camera phone though it does reveal the 4 orbs.",
      "link": "http://www.nuforc.org/webreports/073/S73287.html",
      "state": "OH",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b94b0",
      "summary": "Grey with slight sheen, right-circular cylinder with flat ends, aspect ratio 43, seen only in two photos.",
      "city": "cincinnati",
      "shape": "cylinder",
      "date": "2009-03-19T00:00:00",
      "story": "Grey with slight sheen, right-circular cylinder with flat ends, aspect ratio 43, seen only in two photos. On 2/11/09, there were storms with high straight line winds, up to 65 mph in some places, in the Cincinnati area.  As the storms were moving out of my local area, I noticed some mammatous clouds, and went out to the entrance to our garage at about 5:45 pm,  to take some photos of them.  The garage faces a little south of due west.  I was using a Nikon D80 with a zoom lens, Nikon model DX AFS Nikkor 18-135 mm 1:3.5-5.6G ED, with no filters.  The clouds were coming straight towards the open garage, and there was a very light rain falling, so I was standing slightly inside the garage to minimize water drops on my lens.  After taking some photos to the west, I stepped out of the garage and looked back to the east, where there was a faint rainbow, which I also photographed, along with some tall clouds to the south. I noticed nothing unusual during the photo shoot, but when I went inside, downloaded the pictures to my computer and looked at them full-screen, the cylindrical object was evident in a picture taken facing due west.  At first, I thought the object had been blown into the air by the strong winds, and only made jokes about its possibly being a UFO.  I didn't remember ever having seen images of cylindrical UFOs.  But after about a week, I got curious, and found numerous web sites with images of cylindrical UFOs, which is what I now believe the object in the photos was. There was a second photo that showed probably the same object, less clearly.  It was taken from the same position as the first, but facing southwest.  The second photo was taken less than 2 minutes, but longer than 5 seconds after the first.  The first photo was taken at 1/180 of a second, the second at 1/100 of a second.  In the second image, the object appeared to be somewhat larger, but the lens was zoomed in slightly compared to the first. I am not aware of any other potential observers of this object.  I saw no objects first hand, only after displaying the photos on my computer. I am a 65 year old, retired PhD physicist, having worked as a research physicist for the National Institute for Occupational Safety and Health from 1975 to 2003, and then as a US government contractor until 2006.  I am active in community instrumental music groups and in amateur photography.  I have never before seen a UFO, to my knowledge, certainly not an unlighted cylindrical one.",
      "link": "http://www.nuforc.org/webreports/068/S68826.html",
      "state": "OH",
      "duration": "<2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b964a",
      "summary": "spherical object with changing light pattern viewed and recorded from colerain township",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2010-04-13T00:00:00",
      "story": "spherical object with changing light pattern viewed and recorded from colerain township colored light sequences with primarily white. What looks like moving texture - used binoculars for close up view. Object moves in different directions every so often. Images and video available upon request",
      "link": "http://www.nuforc.org/webreports/074/S74708.html",
      "state": "OH",
      "duration": "present"
    },
    {
      "_id": "64d005f478aba2ec5a3b96b6",
      "summary": "cinti,ohio      23:00   light in back yard",
      "city": "cincinnati",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "cinti,ohio      23:00   light in back yard my son and I live on two too three acres.we have lived here for all most two years.this sighting began the second week of july 2008. the first time we saw the light was around 23:00 hours. our back yard is nothing but trees, if you walk south about 6 hundred feet you will come to a drop off that is about 4 hundred feet at a 15 dregee.  the light came from there. my son was the first to see it what is that he said. I look in the direction where he pointed just then a second later it was gone.  i have seen lights in the sky and one night i had my lazer pointer an sent a messeage in morse code,this light answer back,then it was gone. the messeage said come on down,their answer was not now,maybe later. since then we have been seeing these light in the sky. on 01/9/2010 at 21:hours we pulled into our drive way I had my high beams on thats when I saw foot prints  going from the garage doors that face the woods all the way back to the end of the woof and just stopped at the window. now I have a garage that will hold six large cars. This garage is at least 60 feet wide and as long. things have been coming to the back porch knocking on the back door,we also have come home and found things moved around in the house. my dog goes crazy barking at something in the backs woods. I have went out in the back yard to get him to stop barking and myself heard something moving around. one night I came home around 2am,parked the car,locked the door and began to walk up the long driveway when I hear something say hi to me. being very dark I walked faster up the driveway and into my house. It was at least 80 degrfees out side ,but i sat there shaking.  this is a non stop going thing,maybe I should not have told then to come",
      "link": "http://www.nuforc.org/webreports/074/S74040.html",
      "state": "OH",
      "duration": "not sure"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d60",
      "summary": "Two bright round crafts darting around in the clear night sky.",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2010-06-23T00:00:00",
      "story": "Two bright round crafts darting around in the clear night sky. My girlfriend and I had just entered the highway to head home when we both looked up in the sky.  The sky was cloudless and a perfect night to see all the stars and the moon.  We both immediately saw two round bright lights heading towards each other and just when we thought the two would hit each other, they seemed to ping pong away from each other in different directions.  One aircraft went to the right of us and eventually we couldn't see it anymore.  The other one headed in another direction and then it seemed to levitate in one spot, completely stopped in the sky and that's where we saw it for another 5 minutes before we turned off the highway and couldn't see it any more.  We didn't see any blinking lights on the craft that would indicate it was a plane.  They also seemed to be playing with each other--nearly coming together and just when they seemed to want to hit each other, they deflected away from each other. We are both 50 years old professionals(! sales manager and para-legal). My girlfriend is very religious and also believes in the existence of other life forms and UFOs.  She was completely convinced of what she saw that night.",
      "link": "http://www.nuforc.org/webreports/075/S75840.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9eff",
      "summary": "12 ovel objects flying east to west orange and red at a slow speed then vanished",
      "city": "cincinnati",
      "shape": "oval",
      "date": "2008-10-31T00:00:00",
      "story": "12 ovel objects flying east to west orange and red at a slow speed then vanished UFO sighting in Cincinnati Ohio  On Friday night October 10th my girlfriend and I were coming home after seeing a movie near Hyde Park.  I was driving on Hershel Avenue in Hyde Park when I looked up and saw three orange and red objects that were round in the sky.  I said to my female friend “what is that.”   A few seconds later another one went by and another one followed closely behind.  My female friend said “stop the car I want to get out.”  With that I looked to see if there was a car behind us but nobody was on the road.  She got out and I also got out looking in the general direction of the objects.  There was no sound as they flew by.   They appeared to be 50 or 80 thousand feet in the sky and flying a low speed.  The sky  was clear and there was a moon with no wind.   The objects were moving from the east to the west.  We got back in the car and drove west.  In the distance we could still see the objects forming a circle and following each other in sequence.  They continue to glow a orange/red color and were spinning yet not moving very fast.  As we headed down Erie Avenue towards Hyde Park Square we could still see the objects then they vanished. When I got back to my female friend apartment we got out of the car and went down to the street level.  I looked to the east and saw one more object coming our way.  The object was smaller than the rest but had a red and orange glow.  There was no sound as it flew overhead at a slow speed.  Then a second later after it passed it vanished. We went into her apartment and called Lunken Airport but they didn’t see anything or heard of any reports.  Then we called local news stations, District Two Police and the Cincinnati Enquirer.  All the news agencies said they never heard of anyone else seeing anything. I called the UFO Center to report my sighting and Mr. Peter Davenport answered the phone.  He told me to write down what we saw and we both needed to file a separate report to this agency.  Then Mr. Davenport said see if there is anything on the news about your sighting or if anyone else saw it.  The next day I looked in the papers, and looked at all the local news and there were no reports. In Hyde Park there is an observatory not far from where we first spotted the objects.  I fired an email to the head person there and they respond saying they had guests in the observatory that night but were looking in the direction of the moon.   The gentleman said that there may have been a meteor shower going on at the time or what we saw may have been space junk.  I have seen a meteor shower before, but the meteor past very fast overhead.   I never seen anything that was red and orange that looked like a ball of light flying a low speed.   It was very weird. So far nobody has seen anything to my knowledge or nobody is saying anything.  We live about 60 miles south of Wright Patterson Air Force Base,  10 miles from Greater Cincinnati Airport and 5 miles from Lunken Airport.  We could not hear any sound from these objects so therefore they were not aircraft related.    We both saw them and I must say it was very interesting.",
      "link": "http://www.nuforc.org/webreports/066/S66228.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba017",
      "summary": "triangle shaped 3 orange globes",
      "city": "cincinnati",
      "shape": "triangle",
      "date": "2009-06-09T00:00:00",
      "story": "triangle shaped 3 orange globes   i was on the way home from anderson mercy hospital by the time i got toward withamsville right above buffalo rings resturant i saw 3 orange globes very bright in a triangle shape.they hoovered there forever they barely moved every once in awhile they'd seem to move just a little bit.other people was parked at the shell gas station pointing and watching it.for the last part of our way home i lost memory of the whole trip the rest of the way home,and think me and the driver might have been abducted. i got this huge bump on my neck and back the same night and dont know how.i also got a huge bump on my testicles and im still soar from that.i had it checked out it isnt a seis,or boil,or anything,i seriously think i was abducted but dont wanna tell people cause im embarassed and they might think im crazy.anyways that's it.",
      "link": "http://www.nuforc.org/webreports/070/S70213.html",
      "state": "OH",
      "duration": "over a hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba454",
      "summary": "Fireball moves slow, then fast and change directions",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2009-08-27T00:00:00",
      "story": "Fireball moves slow, then fast and change directions We witnessed through the trees a big red/orange fireball in the souther sky move from left to right and up and down, and also glowing bright and then dim. Then, we ran into the street for a clear view and the UFO sped up to the right towards the west, slow down and shrink and then turned white and shoot straight up and dissapeared.",
      "link": "http://www.nuforc.org/webreports/071/S71831.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba511",
      "summary": "My wife and I pulled onto shoulder of highway to observing a hovering sphere of light for 2 minutes!  See long description.",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2009-06-09T00:00:00",
      "story": "My wife and I pulled onto shoulder of highway to observing a hovering sphere of light for 2 minutes!  See long description. My wife and I (son was sleeping in car seat) were driving on I-275 South(east) towards Milford, Ohio, a suburb of Cincinnati. As I was driving south I looked up in the sky and a couple of miles ahead of me I saw a glowing orange sphere. I knew it was not a meteorite because I was driving for a good minute before I drove underneath it (and it was still hovering). I kept yelling to my wife in the back with the baby to look up and see it. She could not see it from her angle. I did not want to be the only person who saw this because the veracity of a sole witness is always a challenge. As we drove underneath the object I made the decision to turn on my hazards and hop on the shoulder. I have never pulled over for something like this before, as I have always been able to identify an object, until now. As I was slowing down I kept trying to look up and I almost hit the guardrail as I was pulling over. My wife yelled me to watch out. This did not make her happy since it was her car. As I stopped the car I opened the sunroof and said look! There it was just hovering above us. An orange glowing sphere. The time was 9:39pmEST. It was difficult to determine its altitude and relative size. She thinks it was “too high for a helicopter”, but I think it was only about 5000'-10,000’. It was the size of a (small) dime. Of course you need to know the altitude to determine its actual size. It did not have any other colored lights on it. Just an orange glowing \"sphere\". I should caution in calling it a sphere as we were unable to determine if it was disc/egg shaped due to the glowing light. Sphere matches the best visual description. The light did change in intensity but it was a very small fluctuation and could have been our eyes playing tricks on us. My wife and I were going through a detailed Q&A trying to discern what it was. It was not moving, on any plane (X,Y, or Z). There were no conventional Nav lights or beacons, there was no noise except for the highway, and my wife complaining to get us out of t! here bec ause I woke my son up and they did not share the same enthusiasm and excitement. I did not want to leave because I wanted to wait and see it move. I wanted to see its propulsion. Was it conventional or something unexplainable by our current understanding of technology? This would have filled in a great piece of the puzzle and possibly answered the question. Very frustrated, I decided to heed the wife’s advice and get off the shoulder because we were not in a safe place on the road with traffic whizzing by us.  After safely merging back on I-275, I immediately called my mother's house to tell them to run out front and look to the north a few miles and up (they are on the highest development around and would have a perfect view). My stepfather answered my call and ran to the front to take a look. He saw nothing. We reached exit 59 within a minute (Milford Parkway) and looked to our right (north). You could see a great amount of the horizon and we saw nothing. We arrived home about 5 minutes later, then I made calls to friends and family and now I’m typing this report.  The credibility of the witnesses (my wife and I) are impeccable, as well as the intelligence and scientific backgrounds to make an unbiased observation. We are also well known and respected in the community. In addition I am an amateur astronomer and private pilot (not current) with exceptional knowledge of ALL active military aircraft in service (except of course current black projects). If it warrants an investigation, you have all of my contact information and can Google and contact me. Thank you.",
      "link": "http://www.nuforc.org/webreports/070/S70299.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba56a",
      "summary": "Red lighted object moving over Cincinnati",
      "city": "cincinnati",
      "shape": "unknown",
      "date": "2009-01-10T00:00:00",
      "story": "Red lighted object moving over Cincinnati While outside on my front porch I saw a bright red object at about 2 am this morning.  I watched it for about 1min before calling my wife , son and daughter to come and take a look.  There was no sound at all and the red light was not flashing nor was there a white or green light like there is on an airplane.  As it moved from north west to south east the bright red light did not change in brightness.  Then it appeared to have stopped, then the bright red light faded out and vanished. It looked like it changed directions and went straight away from us.  From the time that it looked like it had stoped and changed directions was about 1 to 2 seconds then it was gone. If i were to have blinked my eyes i would not have notice it stopping and changing directions. I have read some other reports of people in cincinnati ohio seeing the same thing back in october of this year and we just saw the same thing.  Just wanted to let you know.  We are located on the east side of cincinnati in Anderson township. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67788.html",
      "state": "OH",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba662",
      "summary": "3 orange lights of fire in a straight line moving slow.",
      "city": "cincinnati",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "3 orange lights of fire in a straight line moving slow. the objects were not very big they looked like 3 balls of fire not very high but were very slow and made no noise at all they went in a line about maybe half mile apart the and they started to raise in the air and eventually disappered this was also reported yesterday about an hour after the time we saw them. In a different city.",
      "link": "http://www.nuforc.org/webreports/069/S69533.html",
      "state": "OH",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3baa66",
      "summary": "During the WEBN 2010 Fireworks show a bright white light flys directly thourgh the show and was recorded on my dvr.",
      "city": "cincinnati",
      "shape": "egg",
      "date": "2010-11-21T00:00:00",
      "story": "During the WEBN 2010 Fireworks show a bright white light flys directly thourgh the show and was recorded on my dvr. It was during the WEBN Cincinatti Firework show of 2010 over the OHIO river between Cincinatti and Covington, Ky.  It was acutally during the grand finally 15 seconds before the end of the show before they say \"OPEN FIRE\". At that point the fireworks look like a battlefield of muskets going off nothing but grey clouds of smoke. I recorded the show on my dvr.   At about 9:21-25p.m. easter time a bright white light shows up on the right side of the screen and moves all the way to the left side while these fireworks are going on.  When we put it in slow motion it looked like we could make out the shape of the object which looked like more of an egg shape on the left side compared to the saucer looking shape when it first came into view.  It moved too fast to be an airplane and I can say that with confidence because Airplanes are not supposed to fly that close to the bridge and also as soon as the show is over you can see an airplane fly through the back with a c! onstant flashing light compared to the constant brightness of the ufo. I would say if we had a 1080 p tv we could get a better view due to the larger pixels of our tv",
      "link": "http://www.nuforc.org/webreports/077/S77666.html",
      "state": "OH",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bac54",
      "summary": "On 10/13/10, while driving, I saw an unusual nonblinking, stationary light over Cincinnati.",
      "city": "cincinnati",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "On 10/13/10, while driving, I saw an unusual nonblinking, stationary light over Cincinnati. On Wednesday, October 13, 2010, after 8p.m. in the sky over Cincinnati, Ohio, there was a single white steady light.  It did not seem to move, but I was driving at the time and could not keep my eyes on the object.  It was quite bigger than any visible stars or planets, but a very small fraction of the size of the moon.",
      "link": "http://www.nuforc.org/webreports/078/S78354.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baed1",
      "summary": "Massive triangle hoovering over city block.",
      "city": "cincinnati",
      "shape": "triangle",
      "date": "2011-03-10T00:00:00",
      "story": "Massive triangle hoovering over city block My mother and I returned home one evening to find a huge triangle hoovering over our block.  The triangle had lights all around the edges, not just the three corners.  The lights were of red, green, and blue. After only a few minutes of looking at the object my mom was afraid and took me inside.  There were many witnesses because people were stainding outside of their houses and cars were even stopped in the street. I am a little stunned that there is nothing at all documented about this case due to the number of witnesses and the huge size of the craft.  It was so massive I'm sure it could have been seen for miles. I have never seen anything writting about it.  I've search for years to find something but have been coming up with nothing. An interesting note is that there was an army storage base not even five minutes away.  I wish I was older so I could have stayed out and looked at the thing instead of my mom forcing me inside.",
      "link": "http://www.nuforc.org/webreports/080/S80250.html",
      "state": "OH",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bafc5",
      "summary": "Four reddish-orange lights traveling slowly across the sky in Cincinnati, OH",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "Four reddish-orange lights traveling slowly across the sky in Cincinnati, OH On Halloween evening, my daughter, my neighbor and I were standing at the end of my driveway handing out candy to trick-or-treater’s. As we were facing north, all three of us observed a line of 4 reddish-orange circular lights emerging slowly from behind the trees to the north. I saw what appeared to be a 5th reddish-orange light trailing the other four at a somewhat greater distance, but when the group of 4 emerged into our line of sight I no longer saw the 5th light. The 4 lights traveled as if they were attached by a string, that is, the distance between them did not vary at all as they moved. Perhaps this indicates that they were attached to a craft of some sort, but none was visible from where we stood.. The lights traveled very slowly, from right to left, across our line of sight in a westward direction. As they moved far to the left they dimmed and flickered out, one by one, until they all disappeared. I tried to take note of whether they passed behind a cloud; I don’t think that was the case. Relative to the diameter of a full moon, the length of the formation appeared to be about 6 times that diameter. The angle above the horizon was approximately 55-60 degrees as best I can determine. Each of these “orbs” was about 4 times larger than the brightest star I’ve ever seen. None of us heard any sound from this craft, if that’s what it was, but given the distance from us, one wouldn’t likely hear any sound. My neighbor dismissed this whole thing, saying they were “balloons”, but that doesn’t make sense. I’ve been thinking about this and decided it’s definitely out of the ordinary, so decided to report it. My daughter agrees.",
      "link": "http://www.nuforc.org/webreports/078/S78762.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3ab",
      "summary": "On Wednesday, Aug 4 at approximately 10:30 pm my wife and I were sitting on our patio when we noticed 2 bright objects approaching from",
      "city": "cincinnati",
      "shape": "",
      "date": "2010-08-24T00:00:00",
      "story": "On Wednesday, Aug 4 at approximately 10:30 pm my wife and I were sitting on our patio when we noticed 2 bright objects approaching from the southwest. Since we are in the flight path of the Greater Cincinnati – Northern Kentucky Airport we thought these were smaller aircraft or helicopters judging from their speed which was slower than jets. These two objects were amber to almost orange in color and very easy to see. The size I would say was 3 – 4 times bigger than the planet Venus which is now prominent in the night skies. These 2 objects appeared to be at the same altitude but we could tell there were two separate objects. As they got closer to us, they appeared to slow down. There was no sound coming from these objects which really got us wondering what these were. The objects stopped moving completely for about 5 to 10 seconds then they both started moving slowly upward and we watched them disappear into the clouds. The weather conditions were windy because thunderstorms were in the area. Some low clouds were passing by but visibility was good. We are located about 15 miles west of Cincinnati near the Indiana border.",
      "link": "http://www.nuforc.org/webreports/076/S76998.html",
      "state": "OH",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb456",
      "summary": "Shooting star like thing came down UFO appeard with a gold glow",
      "city": "cincinnati",
      "shape": "cone",
      "date": "2011-01-31T00:00:00",
      "story": "Shooting star like thing came down UFO appeard with a gold glow I was driving down the road,something caught my eye then i look up and see a shooting star like thing come shooting down from the left then as i watched it go across the sky it all of the sudden was gone and i look and see this black object glowing gold and it just took off an vanished,its like it wasnt a shooting star it was the craft going at a fast speed and just all of the sudden stopped and my eyes werent quick enough to catch it stop so quick then its like it took off not left not right but straight ahead of me it was gone in the snap of my fingers, Always wanted to see a ufo,but im actually pretty shocked and find it hard to believe seeing something like that and how quick it was.",
      "link": "http://www.nuforc.org/webreports/079/S79725.html",
      "state": "OH",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5fc",
      "summary": "ufo over walnut hills in cincinnati",
      "city": "cincinnati",
      "shape": "other",
      "date": "2010-08-24T00:00:00",
      "story": "ufo over walnut hills in cincinnati I was outside having a cigarette when I saw this bright ball of light start to move in the distance at first I thought it was moving slowly and my eyes were playing tricks on me, however as it got closer I started to notice the lights on it an it made no noise at all I live near a hospital that uses care flight so I am accustomed to seeing helicopters and airplanes and this was definitely neither the lights went out only once and they came back the craft was closer and seemed to appear brighter than before.  The ball had unpredictable movements it moved up and I saw a series of lights pretty much covering the bottom of the craft all the while is was still moving across the sky as it got closer I noticed it changed from a cigar type shape to a shape similar to a boat.  I watched it fly over my apartment building until I could not see it anymore and then I ran into the house.",
      "link": "http://www.nuforc.org/webreports/077/S77137.html",
      "state": "OH",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb751",
      "summary": "8-10 orange oval-like silent low flying objects fly over Eastern Greene Co., IN on July 3, 2010 11:50pm - East to West",
      "city": "cincinnati",
      "shape": "oval",
      "date": "2010-07-19T00:00:00",
      "story": "8-10 orange oval-like silent low flying objects fly over Eastern Greene Co., IN, on July 3, 2010, 11:50pm - East to West TIME/DATE:  approx 11:50pm on July 3, 2010. LOCATION: Outside in back yard DIRECTION LOOKING: North ELEVATION: approx. 400-600 feet  HOW MANY:  8-10 Objects were in motion moving slowly from East to West and appeared to follow the same line with equal spacing between them (approx 200 yards) except 2 in the last 1/2 of the group were side by side (approx 100 yards apart from each other) both still 400-600 feet high.   One of the 2 then began to move toward the other at a slightly faster pace and flew next to it for a few seconds then at a different angle flew somewhat lower and away from the other and disappeared before the horizon to the North - at this point there was just a contiuous line flying to the West each one disappearing way before the horizon of trees.  They made no sound which made them more suspicious. SIZE: approx the size of a helicopters blades when in motion at 400-600 ft  WITNESSES: 2 others were present",
      "link": "http://www.nuforc.org/webreports/076/S76552.html",
      "state": "IN",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb92d",
      "summary": "Saw unknown persistent light in the sky and then a gray object that arced away when the light stopped.",
      "city": "cincinnati",
      "shape": "light",
      "date": "2010-07-10T00:00:00",
      "story": "Saw unknown persistent light in the sky and then a gray object that arced away when the light stopped. I was out birding Saturday evening at Valley View Preserve.  It was about 935pm.  There were scattered fireworks going off to the south and the northeast but I think it was still a little too light out for people to start setting things off in earnest.  The sky was clear or had a few clouds.  I was looking at and scanning the tree line with binoculars for perched owls when I saw this persistent orange-yellow light in the sky south or southwest hovering in the same spot at maybe 45-50 degrees above the horizon and not flickering.  The light was maybe 2 or 3 times larger than Venus in the sky and certainly way smaller than the moon.  I had no idea what it was but eventually figured it was either a) some kind of firework b) the back of a distant plane/jet or maybe c)the launch of some kind of rocket or something since the last weird thing I saw in the sky, that was kind of similar to this event, was part of an NSA Atlas rocket launch. After a few minutes of shining in exactly the same spot in the sky, the light stopped and I saw this gray, blurry object slowly arc a very short distance east from where the light had been until it faded away or I just lost track of it in the increasing darkness.  The gray object, which I figured was the emitter of the light, was roughly the same size as the light or maybe slightly smaller and possibly top-like in shape.  I watched the whole sequence with and without binoculars but don't recall the binoculars giving me a much better view of the event except that they more clearly revealed a non-flickering light.  The light was shining for a few minutes and I saw the gray object for probably less than 30 seconds. I don't know what it actually was but still think it could have been one of the things I thought it might be.  If it was a firework, I've never seen anything exactly like it before.  The light looked sort of like a Roman candle if there was just one flare, no smoke trail and the flare stayed in one spot in the sky instead of moving in an arc.  If it was a plane, there should have been blinking lights on the object after the light, it should have moved in a more direct way and I should have heard some sort of sound.  I don't recall hearing any sounds that I could attribute to the light/object.  And if it was some sort of rocket, it didn't seem to leave Earth's atmosphere and was a little different than what I saw before. I had actually completely forgotten about this until Peter Davenport appeared on Coast to Coast AM and am submitting this report per his request.  And I'm not looking at any of the other reports until I submit mine.",
      "link": "http://www.nuforc.org/webreports/076/S76221.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbf5",
      "summary": "Triangular UFO seen in daylight, with U.S. jet chasing",
      "city": "cincinnati",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Triangular UFO seen in daylight, with U.S. jet chasing My husband and I were traveling to my parents' house one afternoon when I saw this very large, triangular shaped aircraft traveling above us. It wasn't going very fast, and it was close enough to the earth to see detail. It reminded me of an arrowhead in shape; it had three points, a light orange light on each point, and the back end of the craft bowed inward between the two end points.  I rolled down my window but could not detect a noise.  The craft had no noticeable markings and seemed to be made of metal, which was a medium gray. It was not shiny; the outside of the craft had a dull finish to it. Both my husband and I watched it as it continued straight, then made a ninety-degree sudden turn to the left. It suddenly started flying off toward the distance at a much faster pace than it had been going, and it was soon out of sight. My husband and I were talking about what we'd seen when a U.S. Plane that looked like a jet came from the direction that the other aircraft had come from. This plane was loud, fast, and a dark gray to black in color. Where the UFO had made a ninety-degree turn, the new plane turned as well, although it didn't turn as sharply or as quickly as the other craft had. It followed the trail that the other aircraft had made, zooming out of sight in the same direction. I wouldn't be surprised if someone else saw this craft in action that day. It was about two in the afternoon in the middle of summer, and the route the air crafts took was along the same route of a popular road in our hometown. This craft was very large and like nothing I had ever seen before, so it was bound to gather attention. I did not hear anything about this craft from anyone else whether through word-of-mouth or media afterwards, although I did look out for more information. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83979.html",
      "state": "OH",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0ee",
      "summary": "I saw green circle thing in the sky than it dissapeared right after",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "i saw green circle thing in the sky than it dissapeared right after I was walking back through a community college in cincinnati and my friend jared and I saw a greenish circle thing in the sky for a 4 seconds than it dissapeared and we didn't know what it was except there was something flashing in the sky behind us and they we called you people.",
      "link": "http://www.nuforc.org/webreports/085/S85263.html",
      "state": "OH",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc4cc",
      "summary": "2 Glowing spheres over Cincinnati",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2011-10-10T00:00:00",
      "story": "2 Glowing spheres over Cincinnati Two glowing spheres in the Southeastern sky.  Spheres were chasing one an other.  The pursuer slowly disappeared and then the other was gone in an instant.   I'd guess they were over CVG airport.",
      "link": "http://www.nuforc.org/webreports/084/S84266.html",
      "state": "OH",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc622",
      "summary": "I was outside smoking a cigarette when I looked down to the end of my street and saw a pulsing light. I wasn't sure if I should walk do",
      "city": "cincinnati",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "I was outside smoking a cigarette when I looked down to the end of my street and saw a pulsing light.  I wasn't sure if I should walk down to get a further look because it seemed so far away.  Basically I watched it pulsate and gleam while it moved back and fourth from behind a tree at the end of the street. The light also would glow very brightly, go back into itself, then glow brightly again. Not to positive on what it could have been, or even how far away it was.  It disappeared after about two minutes, so I disregarded it as a possible helicopter or airplane. The light suddenly came back slightly to the right of where it was moving before.  It then became very bright and simply vanished no more than a second later.  Not in a shooting off type of vanishing, just simply went away. Nothing to my knowledge could make that light, and move in the way that it did. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84356.html",
      "state": "OH",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc784",
      "summary": "9 red fireball-like objects hovering in line formation up and down and at angles accelerating quickly and descending slowly.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2012-01-24T00:00:00",
      "story": "9 red fireball-like objects hovering in line formation up and down and at angles accelerating quickly and descending slowly. I was lying in bed next to my girlfriend and next to an east facing window at roughly 11:10pm EST 01/22/12, Downtown Cincinnati when I saw a flash of light from the left corner of my eyes.  I turned my head, looking southeast out the window and noticed a round orange/red globe/orb-like object floating along without sound traveling northwest toward my condo.  My girlfriend and I were astonished by its ability to drift, sometimes moving up or down unlike that of a helicopter or private jet! The object was coasting at a pretty good clip.  At this point I climbed higher into the window to get a better less inhibited view through the glass as opposed to through glass and outer screen. At that moment we noticed another object just like the first following a short distance behind approx ½ mi. Then came another and another.  Those that followed totaling 5 or 6 more were performing maneuvers unlike the first three and more peculiar.  My girlfriend again pointed out two more circling each other to our southeast while those behind them were hovering very close to the tops of the city skyscrapers around the corner of Seventh and Vine and then finally nearing the ground hovering straight down at roughly Race and 9th St. Downtown Cincinnati.  The one that initially appeared to land on a building top came slowly down at that junction and out of sight once again. I proceeded to film those closest to the downtown buildings rather than following those who were in a straight path out of sight north and west of my home.  The angle from my vantage point to the objects’ was somewhere between 20 and 45 degrees from the ground.  They were straight up halfway across the 8 or 9 Cincinnati City Blocks from east to west on a map. The remaining 2 objects exploring the downtown building tops eventually in just under a minute began to make their way due north up the I71 corridor and out of site.  The objects’ diameter appeared to be a car’s length maybe slightly longer.  I estimated by the size of the object that appeared to land on the building in relation to the size of the rooftop.  We were not sure what to do exactly however with a little research we found the NUFORC.  We have 2:44secs of footage taken from my Droid Camcorder to accompany this report.",
      "link": "http://www.nuforc.org/webreports/086/S86790.html",
      "state": "OH",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9ad",
      "summary": "One reddish orange  aircraft.",
      "city": "cincinnati",
      "shape": "rectangle",
      "date": "2011-07-17T00:00:00",
      "story": "one reddish orange  aircraft It was about 12:50 AM.  Me and three of my cousins went outside to talk on my cell phone.  We were playing around for about five minutes when one of my cousins told me to look at the red star.  (I told her that the red ones were planets.)   We looked at it and it was standing still, which made it seem like a star. All of the sudden she screamed and told us all to look at it.  The object was moving very slowly to the south.  (The right of us.)   First, it was just one reddish orange dot moving.  All of the sudden we saw four dots.  Arranged like they were at the corners of a square.   Then we saw four lights in a row blinking. We watched it until we couldn't see it anymore.",
      "link": "http://www.nuforc.org/webreports/082/S82427.html",
      "state": "IN",
      "duration": "2-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcaa6",
      "summary": "Small diamond craft with two white lights on the sides and a red light on the front in the shape of a triangle",
      "city": "cincinnati",
      "shape": "diamond",
      "date": "2011-07-17T00:00:00",
      "story": "Small diamond craft with two white lights on the sides and a red light on the front in the shape of a triangle I took my dog outside before bed and we were both startled by a loud deep droning sound that lasted a second.   I looked up and saw a circular diamond shaped craft but could not make out the type.   The craft was moving at a much lower altitude and speed than the usual jet that flies above my house.  It was flying west at a consistent speed and had a feint jet like noise.   The craft was slightly larger than a helicopter but did not have the distinct noise of a helicopter.   The craft had two white lights on the sides and a red light on the front in the direction it was moving. The lights were in the shape of a triangle and very visible.  All three lights were pulsing on and off every several seconds consistently.   The craft also had orange dim cones of light on the body facing the front and the rear.  These cones shimmered like it was heated exhaust from a jet engine.   It was too dark to get a more detailed view and the craft was lost in the tree line after a few seconds. ((NUFORC Note:  Witness elects to remain totally anonymous.  We spoke with him via telephone, in order to confirm the time and date of the sighting, and he sounded sober-minded to us.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82304.html",
      "state": "OH",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbdc",
      "summary": "Pitch black UFOs with red-pink light that faded",
      "city": "cincinnati",
      "shape": "teardrop",
      "date": "2011-07-06T00:00:00",
      "story": "Pitch black UFOs with red-pink light that faded This report summarizes the sighting of at least 3 unidentified flying objects on the east side of Cincinnati in Anderson Township.  This happened on the evening of July 4, 2011, around 10 pm (time is approximate.  I did not check the exact time when the sightings occurred).  All three sightings occurred when there were fireworks going off in the sky, and later when the fireworks ceased, we had no more sightings. The first sighting happened at approximately 10 pm (plus or minus 15 minutes).  My son and his friends noticed a red/pinkish light in the distance to the southwest.  It grew larger as it got closer and then they said the light just went out.  That’s when I looked over to see what they were talking about.   At that time, I could see the object, but it was pitch black.  There were no lights on it at all, which ruled out commercial aircraft immediately.  Also, the shape of it was irregular.   From my angle, it looked to be somewhat triangle shaped, with the nose slightly rounded, but the “tail” was not straight as a triangle would be.  The tail was rounded, or bulged out.  It was almost heart-shaped, with the point being the nose.  If flew due north at this point and my wife then saw it as well.   After the red/pink light(s) when out, there were no more lights that appeared on it.  It flew into the distance and we lost sight of it.   The entire sighting lasted maybe a minute. The second sighting happened about 5 minutes later, around 10:05 pm.  This time I saw the red/pinkish light in the southwest.  It immediately got my attention since it was not blinking at all.  We watched as it came closer (heading approximately northwest) and before it got over our location, it turned east.   At that point the light began to diminish/fade out.  I watched it as the light faded out and at that point it was behind a tree in the neighbor’s yard so I could not get a good view of it.   I went to the other side of the tree to watch it as it headed east (I assumed it would be the black mass like I saw before) and I did not see it emerge from behind the tree.  I searched the sky but could not find it.  Again, the entire sighting lasted maybe a minute or more. The third sighting happened about 10 minutes later and this time it was again the red/pink light in the southwest.  I wanted to get a good look at this one and take a video with my phone.  I turned to tell me son that another one was heading our way, and as I turned back to look at it, it was gone. Being the 4th of July, it’s very easy for people to dismiss this as fireworks, but I can assure you that this was definitely NOT fireworks.  The black mass that flew north (the first sighting) moved about the same speed as the commercial jets that cross the sky in my area (there is an airport near, and we did see other aircraft that night).  But I have never seen an aircraft that just had one red/pink light (instead of the red/green that is required), that did NOT blink at all (commercial craft lights blink).   Also, the light faded out; it didn’t turn off as in a switch.  It was gradual.  Plus the shape of the craft was NOT anything that I’ve ever seen.  Even if some would say that it was a commercial craft that had it’s lights off for some reason, the shape of the craft was not like any aircraft I have ever seen. There may have been one or two more sightings by my son and his friends before the initial sighting in this report, but it wasn’t until I saw the craft as described above that turned completely black that I started documenting the sightings.",
      "link": "http://www.nuforc.org/webreports/082/S82198.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd6e",
      "summary": "Spectrum colored lights move across the sky and from them emerges a white light.",
      "city": "cincinnati",
      "shape": "light",
      "date": "2011-05-29T00:00:00",
      "story": "Spectrum colored lights move across the sky and from them emerges a white light. In October of 1993 I was walking from the Library Building towards Rhine Hall on the campus of Cincinnati Bible College and as I looked up and towards my left (which meant I was looking towards the Ohio River and the Northern KY area)  I saw a UFO.   I saw what appeared to be the seven colors of the spectrum emerge from nowhere and briefly move across the sky southwestward in a pattern that I can only liken to a chalkboard line maker moving across a chalkboard.  If you were in grade school in the 1970’s and 1980’s as I was you may remember your teacher placing chalk in several wire holders attached to a piece of wood she would use to make lines on a chalkboard.  Imagine the colors of the spectrum being drawn on a chalkboard and that is basically what I saw. The colored lines emerged from nowhere and briefly moved across the sky and then abruptly stopped.   From them shot a bright white light that moved across the sky in a southwestwardly direction.  The whole sighting took a couple of seconds at the most. ((NUFORC Note:  Date in October 1992 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81529.html",
      "state": "OH",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bceb8",
      "summary": "Red sphere over Cincinnati, OH",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2011-05-29T00:00:00",
      "story": "Red sphere over Cincinnati, OH I had just taken our dog out for a potty break when I noticed a very unusual object come into view straight up in the southern sky.  The object was reddish orange in color, twice the size of Venus, but about the same brightness as Venus. I instantly called the wife and two kids out to see the object.  It did shimmer a bit, so my wife instantly said it looked similar to a Chinese lantern.  I disagreed; the object moved too fast and steady for it to be in any wind pattern.  It took the object approximately 10-12 seconds to move from horizon to horizon, traveling silently from south to north in a straight line. I’ve observed the ISS in the past, and this object was much bigger and seemed a lot lower in the atmosphere.  I’ve also considered that it may have been a meteorite; it certainly moved like one, but the red color seemed all wrong.  We did have some severe weather move through the area a couple of hours later, so maybe the atmospheric conditions gave it the red color. I can say that its brightness stayed consistent, so I don’t think it was reflecting sunlight; tt appeared to be self luminous.  While I’m sure it was natural in origin, there was just something very odd about its appearance. I just thought I would make the report with the hope that you might be able to tell me what the heck it was. Thanks.",
      "link": "http://www.nuforc.org/webreports/081/S81531.html",
      "state": "OH",
      "duration": "10-12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcea5",
      "summary": "Slow, low-flying lights making vast circles in the night sky (probably an odd airplane)  ((NUFORC Note:  Advertising lights??  PD))",
      "city": "cincinnati",
      "shape": "light",
      "date": "2011-05-29T00:00:00",
      "story": "Slow, low-flying lights making vast circles in the night sky (probably an odd airplane) Very likely just an airplane, but certainly an odd one if it was.  I just thought I would report it in case any other reports came in from the area.   I was driving home and noticed what appeared to be an airplane; two lights apparently on the ends of the wings, but they were not blinking like an airplane.  In addition, it was traveling both very low and very slowly.  It was making vast, sweeping circles of the night sky, the two white lights visible from all angles as it did.   This continued the entire time I was driving home and long enough for me to find my camera and take several pictures.   It was still circling when I came inside (more than 30 minutes later).  Like I said, this is very unlikely to be anything more than an odd plane (there is a small airport - Lunken - just a few miles away) but it was unlike anything I've seen before, mostly because it was traveling so slowly and in circles (did not appear to be centered near the airport).",
      "link": "http://www.nuforc.org/webreports/081/S81501.html",
      "state": "OH",
      "duration": "30 minutes (and counting)"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfac",
      "summary": "Watched diamond shaped object  which was motionless except for earths rotation for about one hour.",
      "city": "cincinnati",
      "shape": "diamond",
      "date": "2012-08-05T00:00:00",
      "story": "Watched diamond shaped object  which was motionless except for earths rotation for about one hour. It was a warm clear day with a haze on the horizon.  The kids were playing in the front yard and I had sat down on the front porch step to watch them.  It was 16:00 hours and clear.  I noticed a bright diamond shaped object at about 2:00 oclock angle in the western sky.  I was facing west. I got out my Mimia 35 MM camera and tripod.  I put on a doubler and my 200 MM telephoto lens.  I took 7 photos of the object which had no movement other than the rotation of the earth taking it downward out of the cameras field of view. It finally dissappeared in the haze near the horizon.  My house was in a deep valley, so the sun was below the top of the  hill and the object,to the West.  I still had the 35MM slides. I made an elargement of one of the slides by projecting it about 40 feet onto a ground glass plate and photographing it from the back.  The original images are so small it is hard to see any detail.  This thing was out in space, beyond the atmosphere, I think. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90557.html",
      "state": "OH",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0f2",
      "summary": "I, and a friend, and her date were outside and noticed a strange orange light in the sky. At first glance we thought it was a star. But",
      "city": "cincinnati",
      "shape": "disk",
      "date": "2012-08-05T00:00:00",
      "story": "I, and a friend, and her date were outside and noticed a strange orange light in the sky. At first glance we thought it was a star. But the color was not the same and it looked to be in line next to Venus.  Then it seamed to be moving closer to us. From southwest direction to North East direction downward towards us. As it came closer to us one orange light, became 2 lights, and it made no sound.  We could see it was just above the tree line and it stopped and hovered for about 5 minutes and again made no sound. Then the lights went out.  And when it did we saw a greenish sort of glow and it then simply moved very slowly drifted East, above my home. We all knew this was a ufo and was seriously in a state of shock for all of us... Then it moved back into a South East direction.  As it moved, it was as if it had a device that made it just disappear from the outside inward.  Like an invisible what some call a cloaking device.  this whole event took about 15 to 20 minutes as far as I know. The object pattern seamed move in a square pattern.  Nothing like what at least we know of, that could move like this.  The image is so imprinted in my mind where I had to draw it as to not to forget what I saw. I just keep thinking that I cannot believe I would of ever seen anything like this in my entire life. I,  my friend , and her date are still in shock, and it was so close to us. I felt as tho we were being observed. At that point I went straight into the house.  I am now petrified to even look up at the stars and feel the same. My friend feels the same.",
      "link": "http://www.nuforc.org/webreports/090/S90859.html",
      "state": "OH",
      "duration": "15 to 20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd2e0",
      "summary": "Silent Orb with rotaing ligths seen over strip mall in Finneytown Ohio",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2012-10-30T00:00:00",
      "story": "Silent Orb with rotaing ligths seen over strip mall in Finneytown Ohio The sighting looked to be a round shape object with 3-4 rotating light around the body with the axis at about 30 degree angle of rotation.the lights would go out view as it rotated behind the body of the orb. All of the workers at the BK came out and were taking photos and video.  Some people in cars at the strip mall parking lot could see the UFO until it went out of sight.  It hovered for about 5 minutes before moving on slowly.",
      "link": "http://www.nuforc.org/webreports/093/S93139.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd309",
      "summary": "Looking from the west to the south east in cincinnati three lights that seemed to have a tail behind them were moving  in a line. A lig",
      "city": "cincinnati",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Looking from the west to the south east in cincinnati three lights that seemed to have a tail behind them were moving  in a line.  A light would disappear then re appear.  They went from bold lights to blinking lights.  I have never in my life seen anything like it before.  I took a video of my encounter",
      "link": "http://www.nuforc.org/webreports/093/S93142.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd654",
      "summary": "Wish I had written down the exact day and time but i didn't want to report it.",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2012-07-04T00:00:00",
      "story": "Wish i had written down the exact day and time but i didn't want to report it. I worked at an office complex in cincinnati ohio as a security guard. It was after midnight is all i can remember and i had just stepped outside the front door of the office building when i saw this circular craft almost about tree top leve fly almost over my head in front of me.   It had a big circular white light under the craft which glowed very slowly blinking on and off sort of like a christmas light would.  The UFO was crusing along very slowly and as it got over me i could hear a like a whisper of a humming noise.   Then as it went by i stepped out further to take a look at it as it went by and the thing looked like it saw me and went behind some trees to fly off in a direction it didn't want me to see. I  felt like the craft was trying to avoid me seeing which direction it was heading because i already had seen it.  Anyhow i never reported it because i didn't think i would have my job very long if the company thougt i was a kook.   So years later i wished i had always written downt the time and day but i tried to just forget what i saw. I heard you comment on 55 wkrc radio a few weeks ago and you said if people saw something they should report it because you said you wondered how many people never reported seeing a UFO.  This is all i wanted to say. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90365.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bddbc",
      "summary": "Two amber / orange orbs flying in night sky near Cincinnati on 6-23-12.",
      "city": "cincinnati",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "Two amber / orange orbs flying in night sky near Cincinnati on 6-23-12. I was unloading things from my car and bringing them into my house when I saw two amber/orange lights moving slowly in the sky at the exact same speed. I heard no noise and noticed that the two orbs were keeping the same distance apart from each other and moving in the same south eastern direction across the sky.  I managed to get my phone out in time to capture the tail end of the two objects and showed my wife.  The quality of the video doesn't do it justice, but it serves to prove what I saw.  I have found several other videos on YouTube of the same thing!  What are they?  I know they weren't airplanes.  I am familiar with what an airplane looks like at night (blinking lights, often white with smaller blue or red lights on the wings).  These were not planes.",
      "link": "http://www.nuforc.org/webreports/089/S89956.html",
      "state": "OH",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdec6",
      "summary": "Large colorful rapidly flashing ball of light in eastern Cincinnati, OH.",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Large colorful rapidly flashing ball of light in eastern Cincinnati, OH. I was outside with my dog, and as i was going back inside i noticed a very large circular ball of light in the sky of to my south east.  It was coming out of the south west moving north east very slowly, at a very low altitude.  The object was flashing bright colors very fast, about as fast a a strobe light,  I called to my father but he only saw it for a brief moment before it pasted behind the tree line, where we could still see it through the trees right before we sight of the object.",
      "link": "http://www.nuforc.org/webreports/093/S93770.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf2a",
      "summary": "I do not know what it was.it was bright green rather large with the stuff around it when something is moving at a high rate of speed an",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2012-11-19T00:00:00",
      "story": "I do not know what it was.it was bright green rather large with the stuff around it when something is moving at a high rate of speed and it was coming at a angle and when it got ready to hit the ground there was no explosion or anything just gone and this would have been over the hamilton/fairfield area i was on 275 eastbound. i wish i knew what it was",
      "link": "http://www.nuforc.org/webreports/094/S94468.html",
      "state": "OH",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be9d0",
      "summary": "Object in sky round in shape hovering over Cincinnati Ohio for two days and nights.  ((NUFORC Note:  Jupiter and Venus.  PD))",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2012-03-13T00:00:00",
      "story": "Object in sky round in shape hovering over Cincinnati Ohio for two days and nights On March 7, 2012, I was coming in from a neighbors house when i noticed two objects in the sky.  One of the objects was very small the other object was larger and brighter and it was hovering in one place. I took a picture of it that's when i noticed that the second object was round i then downloaded the picture to my pc and cropped it to get a closer look. I was amazed at what it really was it had green lights coming from it and it's round in shape. That object was in the sky for at least 2days and last night when we looked up in the sky it was gone. ((NUFORC Note:  Jupiter and Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87561.html",
      "state": "OH",
      "duration": "several hours"
    },
    {
      "_id": "64d005f478aba2ec5a3becb7",
      "summary": "4 bright orange lights moving southwest slowly in a diamond formation.",
      "city": "cincinnati",
      "shape": "formation",
      "date": "2013-08-30T00:00:00",
      "story": "4 bright orange lights moving southwest slowly in a diamond formation. 4 bright orange lights silently moving slowly in a diamond formation.  Seemed to be in a low altitude moving in a southwest dierection.  The lights were initially moving toward our location, but disappeared after passingby. Observers are healthcare professionals. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100923.html",
      "state": "OH",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9bf",
      "summary": "6 orange-red lights over the night sky",
      "city": "cincinnati",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "6 orange-red lights over the night sky Driving down route 50, my father and I notice 5 orange-red lights hovering and slowing moving in a star formation, then a 6th appears closer to the tree line moments later.  The lights slowly change positions until I could only notice 3 slowly moving about.  As we continue driving I continue watching one above the tree line, until it vanishes.",
      "link": "http://www.nuforc.org/webreports/098/S98767.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa95",
      "summary": "Seen two orange fire balls rotating around each other with no sound and lasted for a few min Them the bright light vanished and the fle",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2013-09-30T00:00:00",
      "story": "Seen two orange fire balls rotating around each other with no sound and lasted for a few min Them the bright light vanished and the flee away. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102653.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc75",
      "summary": "3 fireball type objects close to downtown Cincinnati.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2013-10-14T00:00:00",
      "story": "3 fireball type objects close to downtown Cincinnati. Saw 3 fiery objects falling out of the sky in the direction of downtown Cincinnati.  The objects appeared to burn out and the suddenly lit up again and rose and started to spread out before going back towards the ground.  Lost sight of them when they went below the treeline. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103153.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc71",
      "summary": "Cincinnati fire ball in the sky?",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2013-10-14T00:00:00",
      "story": "Cincinnati fire ball in the sky? Have a video of it here: https://docs.google.com/file/d/0B4ouLci9bNN_dzJIY2NPQnlSLVE/edit?usp=drive_web ((NUFORC Note:  We suspect a date in 2013, and have amended the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103142.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd1e",
      "summary": "A bright orange light split into four, did a strange but precise set of movements, then joined back together and faded.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2013-10-14T00:00:00",
      "story": "A bright orange light split into four, did a strange but precise set of movements, then joined back together and faded. I was at a farm festival event standing on a small hill for children to climb.  I looked over to the south i think and I saw a bright orange light in the sky.  I thought it was just a firework so i watched it.  It soon broke into 4 individual hovering lights. They were lined up in a vertical position and they did not move for a second.   Then, one by one, they started to move horizontally back and fourth, fading in and out.   They seemed to stay at the same altitude through this phenomenon.   I kept watching and they soon stopped moving back and fourth and they rejoined the vertical line.  They then went back into one and the bright orange light dimmed until I couldn't see it anymore.   I wasn't the only one that saw it and since the lights stayed at the same altitude for almost the entire duration of this event, I don't believe it could be a hoax of any kind.",
      "link": "http://www.nuforc.org/webreports/103/S103188.html",
      "state": "OH",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfeac",
      "summary": "6 orange fireball craft from south , then went east.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "6 orange fireball craft from south , then went east",
      "link": "http://www.nuforc.org/webreports/098/S98957.html",
      "state": "OH",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0364",
      "summary": "Small, yellow star with red beams in W and bright, white light in SW - both disappeared soon after sighting.",
      "city": "cincinnati",
      "shape": "light",
      "date": "2013-04-12T00:00:00",
      "story": "Small, yellow star with red beams in W and bright, white light in SW - both disappeared soon after sighting. I walked out onto my front porch to smoke and saw a small, bright, yellow light in the West sky above my neighbor's house.  It appeared to have two small red beams of light coming out of the top.  I thought it was star at first, but then as many times as I've stood there and looked up at the sky in the past, I'd never seen it before. Also, very close to it but in the SW direction, there was a very bright white, blinking light high in the sky.   I'd never seen this before either. The sky was very clear and many 'normal' stars were visible.   An hour later, I went back outside to leave for the store, and both lights were gone.   Very strange. ((NUFORC Note:  We have amended the date above, in order to reflect a March 03rd, 2013, sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96509.html",
      "state": "OH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c06aa",
      "summary": "Bright orb \"free falling.\"",
      "city": "cincinnati",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "Bright orb &quot;free falling&quot; A bright circular orb that appeared to fall from the sky behind a large pine tree in my neighbors backyard.  It just fell straight down as if in free fall motion.   The tree is about 30-40 ft away from my position and it was tough to tell how close the object was since it was behind the tree.",
      "link": "http://www.nuforc.org/webreports/095/S95340.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b0a",
      "summary": "Glowing Orange Fireball/Lights Seen at Turpin HS Football Game.",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2014-02-21T00:00:00",
      "story": "Glowing Orange Fireball / Lights Seen at Turpin HS Football Game. This sighting occurred while at the Turpin High School vs Anderson High School football game at Turpin, Anderson Township / Cincinnati, Ohio.  I was happy to discover that another group of eyewitnesses from the Cincinnati area submitted a video account of this occurrence on the NUFORC site. At some time around 8PM, sitting in the stands at Turpin's football field, facing west, I noticed what appeared as one bright single orange light/ball of fire, that seemed to hang in the sky for a few minutes before breaking into two, then three glowing orange balls of light.  People around me were witnessing it as well.  A few kids were pointing and laughing say, \"Ohhh, look at the UFOs.\"  I was amazed as these balls of light would slowly drop downward, and at first I wondered if they were some kind of night time military exercise, or maybe skydivers, or luminary sky lanterns. The lights appeared to me to be nearby Lunken Airport (which is due west from Turpin, about 4 miles away), which led me to believe it was possibly a night time parachute jump with the parachutists wearing flares.  But I ruled that out as these glowing balls of fire seemed to hang in the sky far too long to be parachutes.  So I wondered if maybe they were hot air balloons, as they would float downward, but them rise back up in the sky.  But I counted that out as the glowing lights would fade in and out of view--and this was on a perfectly clear night.  They appeared to be maybe 2-3 miles in distance from us. As I was about to conclude they were parachutists on a night jump, suddenly they moved upward at least a thousand feet and orbited around each other a bit, then appeared to be floating in a triangle shape, then appeared to go back into one ball of fire.  Very strange.  At one point when they first broke off from one ball of light to two, it appeared that two of them were linked by a long shaft of light...honestly it appeared to me by the color of it that they were connected by a rope of fire. If you watch the video:    [https://docs.google.com/file/d/0B4ouLci9bNN_dzJIY2NPQnlSLVE/edit?usp=drive_web]  just after the two minute mark, a streak of light appearing much like a shooting star, shoots off to the right from these balls of light (watch from the lower part of your screen.  I witnessed this as well. I was pretty freaked out, and had pointed it out to a few of my family members after watching it for a good 3-5 minutes, saying, \"Please tell me what we are looking at?\"  Finally they faded into darkness--just totally disappeared.  Naturally, I would glance around the sky from time to time the rest of the night, wondering what we had just witnessed. After they faded out of view, one lady nearby was quite unnerved and started exclaiming, \"Did anyone just see that??\"  A lot of people did, but I thought it was odd that most everyone just glanced at it, then shrugged it off and kept watching the game, which by the way was boring and untypically quiet for a Friday night football game.  The reason I bring this up, I was listening for aircraft engines, but it was very quiet. This is where it gets weirder.  By this time, it was half time, and naturally, I was glancing around in the night sky to see if there was going to be any more of this phenomena.  I turned around and behind me, facing an easterly direction, appears a ball of light, in what I estimate to be 1,500 - 2,000 feet in the air.  It's bright, moving slowly toward me, and so I'm wondering if my mind is playing tricks on me and if I'm just being paranoid.  So I rationalized, surely it's a plane in a landing pattern heading towards CVG airport.  However, it looked like an orange ball of light, not a landing light.  Also, I was looking for the flashing wing tip lights as it appeared to be getting closer.  Never saw them. A man I had never seen before was standing directly behind me.  I asked him, \"Do you see what I'm seeing?  Is that an aircraft, or what the heck is that light behind us?\"   This guy NEVER looked back behind us to see what I was pointing at but instead looked me dead in the eye and said, \"You're not supposed to see that.\"  WHAT THE FREAK!!  I said to him, \"Do you even know what I'm talking about?\"  So he casually glanced back and said something like, \"Yeah, have you ever heard of Area 51?  You're not supposed to see this.  Just pretend it never happened.\"  Now, THAT was weird.  VERY. WEIRD. I grabbed my wife, who was busy chatting away with someone, wanting someone to tell me I wasn't crazy and said, \"LOOK!  Tell me what you see.  Is that an airplane?\"   Suddenly the orange ball of light which was slowly moving toward us seemed to break off into TWO BALLS of glowing orange light.  It was as if the second ball of orange light came out from behind the first ball.  But they were heading right towards us, at this point it seemed less than 1/2 mile away.  I wondered if they were going to pass right over us hoping I could get a good look at what they were, but suddenly they faded out.  It was as if a passing cloud blocked them out, but then they were gone. Were they planes in a landing pattern line up, or was this the same lights we saw some 30 minutes before?  The mystery guy?  I never had seen him before, and I never saw him after I pointed it out to my wife.  He may have simply been a dad of one of the students attending the game but his response was very strange. And where did he go?  I think it was interesting to observe how most everyone just chose to ignore these strange lights as something they just didn't recognize and went about business as usual, watching the game.  Only the two kids initially pointing, laughing and acting silly and scared about seeing UFOs, and then the one lady who was vocal about what she had witnessed, besides myself asking her what she thought they were.  Everyone else just shrugged, and I think were afraid to admit they had just seen something they couldn't explain. This morning while surfing the web, I came upon this site and looked up the date of the game, wondering if anyone had reported the sighting.  I was glad to find a confirming video of it.",
      "link": "http://www.nuforc.org/webreports/107/S107224.html",
      "state": "OH",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b74",
      "summary": "2 Strange lights that disappeared.",
      "city": "cincinnati",
      "shape": "other",
      "date": "2014-01-10T00:00:00",
      "story": "2 Strange lights that dissappeared Looking from just north of the downtown area to the south east, I witnessed 2 lights that seemed initialy like airplanes flying in some kind of formation and had to be miles away.    Moving to the north, it was one behind the other at the same speed and never moved further or closer apart and therefore seemed liked the same craft.  But from the distance which they appeared to be, this would have been a HUGE aircraft.   As i watched through the trees they suddenly disappeared.   I watched for minutes and looked from all different angles and never saw them again.",
      "link": "http://www.nuforc.org/webreports/105/S105799.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0be6",
      "summary": "Bright light, ship cloaked out on me right in front of my eyes.",
      "city": "cincinnati",
      "shape": "teardrop",
      "date": "2013-11-11T00:00:00",
      "story": "Bright light, ship cloaked out on me right in front of my eyes. As always I was out on my deck checking out the clear dark sky's.  I do this several times during the evening every night weather it's clear out or not.  I have these Binoculars that can see star's that the naked eye can't see with out them. I had just got done scanning the Western sky's when an airliner coming out of the South heading East caught my eye.  I followed the plane for a few seconds (now I'm facing east) and I bent my head back while turning to the West and this huge bright light caught me, really by surprise.  It just wasn't there a few seconds ago. I live next to an airport and have flown myself a few times, so when I say that it was about 15,000 ft. that's a pretty good guess.  So any way I latch on to this light with these binoculars and I'm watching it fly over my head for about a minute and all of a sudden the light goes out but I can still see the damn thing.  I'm watching this for a good 30 seconds when it just cloaked out on me.  That's right, it just disappeared on me.  I saw what looked like heat waves first and it slowly just disappeared.  And it didn't make a sound. I got a really good look at this ship, it was teardrop shape with2 the small end going forward. It looked to be black and gray in color with oval shape windows on the sides.  It looked like a large light with some sort of markings the on the bottom.  I am in the process of making a mechanical drawing of the ship.  I feel like Richard Dreyfus in Close Encounters of the Third Kind with all the sketches and drawings I have hanging around in my office. This is by far the coolest thing that I have ever seen.",
      "link": "http://www.nuforc.org/webreports/104/S104274.html",
      "state": "OH",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d61",
      "summary": "Westside of Cincinnati, bright red and blue lights making abrupt U turns and then dropping straight down from the sky, quick as light",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2014-01-30T00:00:00",
      "story": "Westside of Cincinnati, bright red and blue lights making abrupt U turns and then dropping straight down from the sky, quick as light On the eve of the first new moon (January 1st, 2014), around 10:15p.m., I was out walking my dog in Western Hills, Cincinnati, Ohio.  I had walked up to the top of my street (which is approximately a 32° angle uphill), and turned the corner walking to the right and past the first house on the right.  My dog then stopped to use the bathroom in the grass, while I stood there looking north, staring off into the dark between the large clearing of two houses.  (This would be looking in the direction as if I were at the top of my street looking down).  I saw what looked at first to be just airplane lights, red and blue, out of the corner of my eye.  Didn't think much, until I realized these lights were moving usually fast.  So I turned my attention directly on them, and within a few seconds, saw the lights stop and hover, and then all of a sudden they made a complete \"sideways U-turn\" and started headed east.  I literally said out loud, \"What ((deleted)) is that??!!\" (talking to my dog).  Just as quickly, the lights swerved back to the left (west), and flew for just a second until it stopped and hovered again! I proceeded to get my phone camera out to videotape, and as soon as I pulled the video application up, the red light in the sky went out, leaving just this fluorescent blue light, which suddenly dropped straight down, quick as lightning! Like it just fell from the sky.  I focused my camera on where I thought the light had dropped, and caught it on camera shooting straight back up..  it then dropped down once more, which I saw with my eyes, but did NOT catch on camera (even though my camera was focused right on it) and between messing with my phone, I did not see the light come back up.  About a minute later I saw both red and blue lights in the sky again, seeming to fly north until they just disappeared suddenly.  It was the strangest, scariest, yet most exciting experience I've ever seen…  I didn't even think it was real.  I asked my dog, \"Did that really just happen!?\"  It happened so quick, I literally almost doubted myself.  But there is no doubt about what I saw.  There was definitely SOMETHING there, and it was NOT NORMAL, and NOT an optical illusion...  I cannot explain it to be anything other than a UFO.",
      "link": "http://www.nuforc.org/webreports/106/S106690.html",
      "state": "OH",
      "duration": "2:30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1009",
      "summary": "Probably not a UFO.  ((NUFORC Note:  Reported to be a team of 3 sky divers.  PD))",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2013-11-11T00:00:00",
      "story": "Probably not a UFO Came out of Western Hills Best Buy and noticed 3 burning orbs in the northern sky. I captured them on video as they slowly decended towards the horizon.   They started out in a straight line then formed a triangle as they decended.  They disappeared one by one below the horizon.   I asked my father about if he knew anything about it and he said it was skydivers with yellowish white flares on their feet as they decended in the friday night football game at LaSalle High School.",
      "link": "http://www.nuforc.org/webreports/103/S103822.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1066",
      "summary": "3 fireballs in sky.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2013-11-11T00:00:00",
      "story": "3 fireballs in sky saw 3 red and yellow fireballs rotating around each other then moving across the sky with one moving away from the other two until disappearing behind the clouds",
      "link": "http://www.nuforc.org/webreports/103/S103793.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1063",
      "summary": "3 large orange fiery balls,comet like tails,flying under the cloud coverage in a smooth methodical manner, disappeared, and reappeared",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2013-11-11T00:00:00",
      "story": "3 large orange fiery balls,comet like tails,flying under the cloud coverage in a smooth methodical manner, disappeared, and reappeared. My 7-year old son and I were leaving a friends house, when he asked me what was in the sky.  I look up to see 3, what seemed to be, fiery orange balls with \"comet like\" tails.   They were moving methodically in a figure eight pattern.  They were moving at a steady (not slow) pace. 2 of the 3 \"crafts\" disappeared and the 3rd dimmed almost as if to disappear then the other 2 fully reappeared for a brief second then they just vanished!   My son was, and still is afraid of what he saw.  My mind is blown but I'm pretty sure this was something unearthly.   It was a cloudy night and these were under the cloud cover, low flying.",
      "link": "http://www.nuforc.org/webreports/103/S103796.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1061",
      "summary": "Driving down Bridgetown Rd. I spotted something strange. Three lights in a triangular formation. Lights slowly spread apart and moved o",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2013-11-11T00:00:00",
      "story": "Driving down Bridgetown Rd. I spotted something strange.  Three lights in a triangular formation.  Lights slowly spread apart and moved oddly around.",
      "link": "http://www.nuforc.org/webreports/103/S103798.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c14e0",
      "summary": "star-like light moving left and right, wiggley",
      "city": "cincinnati",
      "shape": "light",
      "date": "2013-12-05T00:00:00",
      "story": "star-like light moving left and right, wiggley very bright light, star-like. Seen near the top of Orion.  Thought it was a star until it moved to the left and right.   Stayed nearly in the same place (so not a satellite).  Wiggled around a bit.  No beams of light coming from it or going to it.  Occasionally a short streak of light came from it as it appeared to go higher?   Got dimmer and eventually our view was obstructed by cloud cover. Three witnesses, never before reported a UFO sighting... never witnessed one before.   All 3 witnesses were free of any drugs/alcohol.  I have taken astronomy courses before.",
      "link": "http://www.nuforc.org/webreports/105/S105028.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1677",
      "summary": "the object was a orange firey ball , no sounds",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2013-10-23T00:00:00",
      "story": "the object was a orange firey ball, no sounds Orange fireball slowly flying north.",
      "link": "http://www.nuforc.org/webreports/103/S103350.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c182b",
      "summary": "Silent orange disk.",
      "city": "cincinnati",
      "shape": "disk",
      "date": "2014-07-11T00:00:00",
      "story": "Silent orange disk. Me and my girlfriend saw an orange disk silently flying across the sky heading south.   The next day I saw on Facebook a friend who lives about 20 miles north posted that her and her husband saw a similar object about 10-15 minutes prior to us.",
      "link": "http://www.nuforc.org/webreports/111/S111140.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c188f",
      "summary": "8 orange lights hovering, then taking off straight up one at a time.",
      "city": "cincinnati",
      "shape": "light",
      "date": "2014-07-20T00:00:00",
      "story": "8 orange lights hovering, then taking off straight up one at a time. 3 orange lights were seen in a wide triangular position, then one headed east, then took off straight up and disappeared, then the next, then the next.   Soon, we saw another coming and it did the same thing... then another.  There were 8 in all.  It lasted about 20 minutes.   It was directly above the golf course on Muddy Creek Road in Bridgetown, which is a suburb of Cincinnati, Ohio.   There were teens playing at the adjoining tennis court that were talking about it too but we did not get their names.",
      "link": "http://www.nuforc.org/webreports/111/S111441.html",
      "state": "OH",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1946",
      "summary": "Cincinnati.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2014-07-26T00:00:00",
      "story": "I went outside apx. 10;20 pm, my second sighting in the same area of my backyard in two first time a major close one big green disk that hovered over my house green craft in July 2012.   Any way i was looking up in the same area as the last time and noticed a orange ball just bouncing up and down then vanished.  Since the 7/1/12 whenever i go outside i pay attention snd yet a feeling that i get nervouse over what i will see.   Then a third sighting apx. 6/30 i was outside but sitting on my front rs porch and i saw two orange glowing lights again.  They seemed to be headed in the direction of my house side by side moving in a straight direction.  Then changed direction moving south instead of west towards me.  They stayed side by side then just vanished.  I called mufon and made a report here two years ago.  A person from my area was supposed to come over to my hom because of the major sighting and  investigate it due to 3 of us had such a bazzar encounter two years ago and it was hovering over my house for several minutes actually 15 to 20 minutes but he never bothered to come and interview me.  So this time i am not bothering with mufon and reporting it here instead. That upset me. Especially since the home base for mufon is here in the Cincinnati area.  I just know now when i go outside i always look up and yet get afraid of what i will see due to such a close encounter i had two years ago on the same date.  That ufo was about 150 to 200 ft over my house and i think or feel like it knew we were paying attention to it. That was a green round disk plus orbs. Moved very slow and hovered right over us.",
      "link": "http://www.nuforc.org/webreports/111/S111770.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c207e",
      "summary": "Series of 14 Orange/Red lights moving across the sky and blinking out.  Video recorded.",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2014-05-02T00:00:00",
      "story": "Series of 14 Orange/Red lights moving across the sky and blinking out.  Video recorded. Last evening, April 26th, from 21:30-21:55 a group of 20 gathered at a home in Greenhills, Ohio, witnessed 14 orange/red lights move one after another across the sky each to eventually blink out.  It was very unusual making no sound. All of them came from the northeast and moved to the south/southwest (the opposite direction of our current weather pattern.  Additionally, they would have been moving too fast to be floating.  They were more the speed of a fast aircraft on a calm evening. We had plenty of time due to the number that kept coming to record videos and take a few photos.  Additionally, we were able to observe through binoculars.  I’ve spent considerable time through my life star gazing and have never seen anything like this. I did call 911 to report. ((ADDENDUM FROM WITNESS)) Peter, Below is an updated version of my submission including the weather report verifying the direction of wind I reported.  I've also uploaded two videos to Youtube with the following links.  Let me know if I can enhance the report.  I will try to get two other witnesses to report as well.  Do you want them included in this or filed separately? https://www.youtube.com/watch?v=TsYN9vdb0Gw&feature=youtube_gdata_player https://www.youtube.com/watch?v=66j4DPRYjCU&feature=youtube_gdata_player Here are two videos I took of the lights we observed over Greenhills Saturday night.",
      "link": "http://www.nuforc.org/webreports/108/S108952.html",
      "state": "OH",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c207c",
      "summary": "14 Red/White Spheres Flying Silently over Cincinnati, OH, with video recording.",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2014-05-02T00:00:00",
      "story": "14 Red/White Spheres Flying Silently over Cincinnati, OH, with video recording. On the evening of April 26th, 2014 three families were gathered socializing with our kids.  A friend of my 12 year old came to the door and asked that we go outside so she would know she was not crazy.  We then observed what she had been witnessing for the previous 10 minutes or so.  From the horizon north of us heading south/southwest a bright light red/orange/white (changing) would move silently across the sky directly above us and then somewhere between 90-120 degrees across would blink out and disappear.  As one was overhead, the next would come from the horizon.  The 13 year old girl did say that she witnessed two come at once with one blinking out before the other.  The rest of us saw one at a time.  There were 20 of us in the yard the witnessed the last 4.  I was able to video record with my Droid Razor Maxx three of them.  Links to the YouTube posting are provided.  Keep in mind that in the recordings I opted to stay zoomed in at all times other than! the beginning of one that shows one initially coming over the horizon starting spot over our house before I zoomed. Because I was zoomed in you it shakes (remember the flight path was direct and smooth) and you cannot see how quickly they came one at a time across the sky. I hoped by staying zoomed in there might be a moment something of importance might be caught.  My phone was zoomed in at 4x. Just as the last one was gone, I called 911 to report.  They had no knowledge of the event and did not call me back.  I called Wright Patterson Airforce Base, roughly 60 miles north, and they said they had no activity or drills going on that night.  Below is a weather report confirming what I perceived.  We had gentle winds from the west, not the northeast, and clear skys.  I am a professional in the finance industry.  The other adults that observed, along with the children ranging in ages, is a high school teacher and a sales vp for a manufacturing firm.  https://www.youtube.com/watch?v=TsYN9vdb0Gw&feature=youtube_gdata_player  https://www.youtube.com/watch?v=66j4DPRYjCU&feature=youtube_gdata_player  https://www.youtube.com/watch?v=e7s_tEJU0-c&feature=youtube_gdata_player  CLIMATE REPORT NATIONAL WEATHER SERVICE WILMINGTON OH 533 AM EDT SUN APR 27 2014   .................................  .THE CINCINNATI OH CLIMATE SUMMARY FOR APRIL 26 2014...  CLIMATE NORMAL PERIOD 1981 TO 2010 CLIMATE RECORD PERIOD 1869 TO 2014   WEATHER ITEM   OBSERVED TIME   RECORD YEAR NORMAL DEPARTURE LAST VALUE   (LST)  VALUE       VALUE  FROM      YEAR NORMAL .................................................................. TEMPERATURE (F) YESTERDAY MAXIMUM         80    410 PM  89    1915  68     12       62 MINIMUM         48    508 AM  29    1919  47      1       35 AVERAGE         64                        58      6       49  PRECIPITATION (IN) YESTERDAY        0.00          1.58 1912   0.14  -0.14     0.00 MONTH TO DATE    5.04                      3.34   1.70     3.03 SINCE MAR 1      7.45                      7.30   0.15     6.94 SINCE JAN 1     12.99                     13.11  -0.12    12.54  SNOWFALL (IN) YESTERDAY        0.0                0.0    0.0      0.0 MONTH TO DATE    0.6                       0.5    0.1       T SINCE MAR 1      3.9                       3.5    0.4      8.8 SINCE JUL 1     47.5                      22.1   25.4     25.2 SNOW DEPTH       0  DEGREE DAYS HEATING YESTERDAY        1                         8     -7       16 MONTH TO DATE  262                       311    -49      301 SINCE MAR 1   1044                       977     67     1156 SINCE JUL 1   5288                      4804    484     4866  COOLING YESTERDAY        0                         1     -1        0 MONTH TO DATE    7                        14     -7       23 SINCE MAR 1      7                        14     -7       23 SINCE JAN 1      7                        14     -7       23 ................................................................   WIND (MPH) RESULTANT WIND SPEED   7   RESULTANT WIND DIRECTION   W (250) HIGHEST WIND SPEED    24   HIGHEST WIND DIRECTION    NW (300) HIGHEST GUST SPEED    31   HIGHEST GUST DIRECTION    NW (300) AVERAGE WIND SPEED    10.0   SKY COVER POSSIBLE SUNSHINE  MM AVERAGE SKY COVER 0.4   WEATHER CONDITIONS THE FOLLOWING WEATHER WAS RECORDED YESTERDAY. NO SIGNIFICANT WEATHER WAS OBSERVED.   RELATIVE HUMIDITY (PERCENT) HIGHEST    71           500 AM LOWEST     25           400 PM AVERAGE    48  ........................................................   THE CINCINNATI OH CLIMATE NORMALS FOR TODAY NORMAL    RECORD    YEAR MAXIMUM TEMPERATURE (F)   69        86      1990 1986 1914 MINIMUM TEMPERATURE (F)   48        30      1996   SUNRISE AND SUNSET APRIL 27 2014.........SUNRISE   646 AM EDT   SUNSET   828 PM EDT APRIL 28 2014.........SUNRISE   644 AM EDT   SUNSET   829 PM EDT   -  INDICATES NEGATIVE NUMBERS. R  INDICATES RECORD WAS SET OR TIED. MM INDICATES DATA IS MISSING. T  INDICATES TRACE AMOUNT.     --------------------------------------------------------------------------------      The U.S. Naval Observatory (USNO) computes astronomical data. Therefore, the NWS does not record, certify, or authenticate astronomical data. Computed times of sunrise, sunset, moonrise, moonset; and twilight, moon phases and other astronomical data are available from USNO's Astronomical Applications Department (http://www.usno.navy.mil). See http://www.usno.navy.mil/USNO/astronomical-applications/astronomical-information-center/litigation for information on using these data for legal purposes. ---------------------------------------------------------------------------",
      "link": "http://www.nuforc.org/webreports/109/S109054.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c258a",
      "summary": "Reddish orange fireball, low altitude, flying constant speed across night sky.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "Reddish orange fireball, low altitude, flying constant speed across night sky. Around 10:15pm October 19th I saw a orangish red bright light that I thought might be a chinese lantern because it seemed to be at a low altitude, I asked my dad to come watch and we realised it was traveling at a constant speed across the night sky. To me, it appeared to be a ball of fire.  My dad said he has never seen anything like it.",
      "link": "http://www.nuforc.org/webreports/114/S114968.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3609",
      "summary": "Five dancing fireballs in the sky over Cincinnati on Christmas night.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "Five dancing fireballs in the sky over Cincinnati on Christmas night. Was sitting in my car warming it up before leaving for work.  I reached over into the passenger side for my purse when I noticed through the tree five Orange lights.  One was alone and the others were in sets of two next to each other.   My first thought was plane headlights but they were orange/red and traveling to close to each other.   I got out of the car when I noticed them begin to move around each other almost dancing.  One slowly went upwards and faded.   I ran to the house to get my brother.  He came outside in time to see the last two move upwards and fade away.   I don't know how long they were tthere before I noticed them but the whole incident was less than five minutes.",
      "link": "http://www.nuforc.org/webreports/116/S116307.html",
      "state": "OH",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3df8",
      "summary": "Lights in sky. There were 2 that appeared to be next to each other. Not stars.  ((NUFORC Note:  Venus and Jupiter.  PD))",
      "city": "cincinnati",
      "shape": "egg",
      "date": "2015-07-03T00:00:00",
      "story": "Lights in sky.  There were two that appeared to be next to each other.  Not to be mistaken as stars. Saw in night sky.  Did not appear to be moving.  Definitely not a star because at the time it was a bit to light for stars.  Seemed to get further after while.  Do not know end time to to night time. ((NUFORC Note:  Venus and Jupiter.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119917.html",
      "state": "OH",
      "duration": "3 hours?"
    },
    {
      "_id": "64d005f478aba2ec5a3c4044",
      "summary": "White cigar shaped object.",
      "city": "cincinnati",
      "shape": "cigar",
      "date": "2015-05-29T00:00:00",
      "story": "white cigar shaped object A coworker and I went outside around 11 to take a smoke break.  I looked up to see a long white/ silver tube flying north.  I asked my coworker \"do you see that?\"  He said \"dude, that doesn't have a tail.\"  He was referring to the absence of a tail wing which would obviously make it an airplane.   We watched it for about 30 seconds before it was out of view.  Though it was flying, it wasn't really \"flying.\"  The way it moved was effortless.  I know that sounds weird but it moved like nothing I had ever seen.   The object looked longer than any passenger jet.  Both ends of the object were circular or if you could imagine the ends of it were \"capped\" with half spheres.  It made no noise.",
      "link": "http://www.nuforc.org/webreports/119/S119167.html",
      "state": "OH",
      "duration": "30-40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c40be",
      "summary": "Blinking lights over Cincinnati, Ohio.",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2015-05-22T00:00:00",
      "story": "Blinking lights over Cincinnati, Ohio Walking home from work, I looked up to see 4 blinking sphere crafts moving across the sky.  They made no sound, and were in a formation somewhat similar to an 'S'.  Following behind them was another blinking sphere with 2 other red blinking spheres very very close to it. Following that was a red blinking sphere.  The blinking was all consistent, it didn't appear to be synchronized between them though.  A plane flew nearby at first but I could  hear the sound from behind the plane but definently not from the other things I saw.  I'm a male I work at a Jet's Pizza and live in Cincinnati, Ohio.  I have seen UFOS in Cincinnati before on multiple occasions (fireballs).",
      "link": "http://www.nuforc.org/webreports/119/S119025.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c44e8",
      "summary": "Round bright light over Cincinnati.",
      "city": "cincinnati",
      "shape": "unknown",
      "date": "2015-11-06T00:00:00",
      "story": "Round bright light over Cincinnati My friend and I were passengers in the back seat of a car driving down I-71 south near the Edwards Rd exit.  While talking a clearly round, bright white light like a star or planet appeared in the east sky.  I pointed and said what was that?  We assumed it was the aforementioned but it began to move upward in the sky like a rocket and then disappeared.  Then there was a cloud trail across the sky like a jet had flown by.  There was no noise like a jet had flown overhead.   Also this was a matter of seconds if this was a jet it had to be new technology we were witnessing.",
      "link": "http://www.nuforc.org/webreports/123/S123302.html",
      "state": "OH",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c466f",
      "summary": "Traveling on 275/E in Anderson and seen two orange flickering lights hovering, then disappeared!",
      "city": "cincinnati",
      "shape": "",
      "date": "2015-10-29T00:00:00",
      "story": "Traveling on 275E in Anderson and seen two orange flickering lights hovering, then disappeared! Traveling east on 275 getting on the 52 exit, right before dark.  When I seen two orange-ish white flickering lights, while hovering approximately 3 to 4 secs, then disappeared.   There had to be a bunch of people who seen this!  I'm not the type who would make this up, I've never seen anything like this!   I'm pretty sure this wasn't any kind of fireworks nor any kind of man made aircraft! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123031.html",
      "state": "OH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c4a54",
      "summary": "We saw six red lights flying in a single formation from NE to SW in a particular manner.  Goes up.",
      "city": "cincinnati",
      "shape": "circle",
      "date": "2015-08-27T00:00:00",
      "story": "We saw six red lite lights flying in a single formation from NE to SW in a particular manner. From the first to the last, one goes up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121150.html",
      "state": "OH",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c71",
      "summary": "Triangular craft with 2 big bright red lights.",
      "city": "cincinnati",
      "shape": "triangle",
      "date": "2015-08-27T00:00:00",
      "story": "Triangular craft with 2 big bright red lights. My cousins and I were on our way home from vacation. at first I thought I was just hallucinating because I saw a red like hovering about 100 feet above the cars.   When it was doing that we only saw 1 red light but then it swept down literally only 1 foot above the cars about 100 feet from my car and tilted that's when I noted 2 red lights about the size of stop lights but I couldn't imagine the size because the lights were distant.   It swept over the cars tilted to dodge trees and when we passed there was nothing there. If something flew into those trees they would crash and there was nothing there it was gone.   Then our radio that was turned off turned up loud as we passed and was static, then turned off. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121231.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c50b3",
      "summary": "Bright light moving south to north very high rate of speed was not a plane brightness of a star",
      "city": "cincinnati",
      "shape": "light",
      "date": "2016-02-26T00:00:00",
      "story": "Bright light moving south to north very high rate of speed was not a plane brightness of a star. A bright light traveling north to south I thought it was a star or a plane moving to fast for a plane brightness stayed the same from the time i spotted until horizon.",
      "link": "http://www.nuforc.org/webreports/125/S125988.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c7e",
      "summary": "On Sunday, March 20th 2016 at approximately 11:20 am, I was leaving my house to take my usual exercise walk around the neighborhood. As",
      "city": "cincinnati",
      "shape": "light",
      "date": "2016-03-24T00:00:00",
      "story": "On Sunday, March 20th, 2016, at approximately 11:20 am, I was leaving my house to take my usual exercise walk around the neighborhood.  As I hit the sidewalk and began walking West, I looked up at the sky and saw several distinct points of light - which looked much like stars against the clear blue sky background.  These points of light formed a large square.  I viewed this with both the naked eye, and with my polarized sunglasses.   I quickly ran into the house to retrieve my binoculars, but by the time I returned - a minute or so later - nothing was there to be seen.  I put away the binoculars and began my walk.  A short distance down the street, I saw a single, bright point of light in the same area of the sky.  This remained stationary until approximately 11:30 am, and I have not seen anything else as of the time of this report.  I am mainly reporting this because I really hope to hear that someone else around the Cincinnati Tri-State witnessed the event.  It is a s! unny day here, clear blue sky and I have never seen what appeared as a small constellation-like group of stars showing up in the daytime sky.  Just before 11:30 a large airliner flew on a N-NW to S-SE path and would have appeared to have been between myself and the object I was seeing.",
      "link": "http://www.nuforc.org/webreports/126/S126456.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fab",
      "summary": "((HOAX??)) Orange ball moving at high speed in different directions  ((anonymous report))",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2016-09-30T00:00:00",
      "story": "orange ball moving at high speed in different directions orange round flashing sphere.  moving east to west then up and down and then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130341.html",
      "state": "OH",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c612c",
      "summary": "I witnessed a small orange light coming towards my location at the UDF on River Road and Anderson Ferry. It was coming north from Kentu",
      "city": "cincinnati",
      "shape": "oval",
      "date": "2016-09-30T00:00:00",
      "story": "I witnessed a small orange light coming towards my location at the UDF on River Road and Anderson Ferry.  It was coming north from Kentucky near the CVG airport.  It was bright orange and circular in shape.  It came to a stop and appeared to get larger before it slowly closed down and disappeared.  It did not fly away just just got dimmer until it was gone. Not a plane and not a helicopter.  First UFO I have ever seen in person.",
      "link": "http://www.nuforc.org/webreports/130/S130178.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6183",
      "summary": "Big bright light in low in the western sky at twilight.  ((NUFORC Note:  Possible sighting of Arcturus of Jupiter in W sky?  PD))",
      "city": "cincinnati",
      "shape": "light",
      "date": "2016-10-11T00:00:00",
      "story": "Big bright light in low in the western sky at twilight. I was driving in Anderson Township at twilight to pick up Chinese food on Ohio Pike.  I was alone in the car when I noticed a very bright, low hovering light in the western sky toward the downtown Cincinnati direction.  It was way too low on the horizon to be a star or planet.   I pulled over in the car and parked where I could have nearby points of reference to see if this object was moving at all. It was not.  There were no flashing lights, just a brilliantly bright slightly flickering light.   When viewed through a very low power set of bird watching binocs it took on a 3 pointed shine shape.   I drove to another location a few miles away and over the course of this time it never moved or changed. ((NUFORC Note:  Possible sighting of Arcturus of Jupiter in W sky?  PD)) ((NUFORC Note:  For some reason, witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130534.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c62f3",
      "summary": "Large round light falls from sky then is later seen standing still.",
      "city": "cincinnati",
      "shape": "fireball",
      "date": "2016-09-22T00:00:00",
      "story": "Large round light falls from sky then is later seen standing still. I was laying down in bed when I looked out the window and saw a round ball of light quickly fall in the sky.  I believe the cities light pollution would conceal any meteors so I am unsure of what this was.  It was also a lot larger than any meteor I have ever seen!   After the initial streak of light, about a minute later I could see a still light behind the trees in the distance, it only lasted a couple of seconds before it disappeared.",
      "link": "http://www.nuforc.org/webreports/130/S130118.html",
      "state": "OH",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ec0",
      "summary": "I KNOW METEORS. This was an intermittent light. Brighter than a star. NOT A METEOR. Changed velocity & direction.  ((anonymous report))",
      "city": "cincinnati",
      "shape": "",
      "date": "2017-08-17T00:00:00",
      "story": "Watching the sky for perseids shower.  I KNOW METEORS.  This was an intermittent light. Brighter than a star.  NOT A METEOR.  This changed speed and direction. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135661.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f3d",
      "summary": "Red,orange sphere of light travelling North to South.  NO SOUND.  About 800 feet up.  Moving slowly.",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2017-08-17T00:00:00",
      "story": "Red, orange sphere of light travelling North to South.  NO SOUND.  About 800 feet up.  Moving slowly. Witnessed a bright reddish orange sphere of light travelling from North to South.  NO SOUND.  About 800 feet up.  Moving slowly. I checked the \"Missing time experienced\" box below because on the morning of Aug. 9th I lost 3 and half hours that I just can't account for.  I am unaware of a connection but mention it in case.",
      "link": "http://www.nuforc.org/webreports/135/S135733.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f36",
      "summary": "Several bright flashes in Cincinnati.",
      "city": "cincinnati",
      "shape": "flash",
      "date": "2017-08-17T00:00:00",
      "story": "several bright flashes in Cincinnati On Saturday night, 08/12/17, my wife and I were standing outside of our home watching for the meteor shower.  We sadly did not see any meteors, but witnessed something else.   I caught a really bright white flash out of the corner of my eye first and directed my attention towards it.  It more or less blinked in and out of view several times. I  pointed it out to my wife whom was standing right next to me.  She didn't see it at first but finally saw it.  That was the first UFO that really had me scratching my head.  Mind you it was a beautiful night out very little cloud cover and stars all over.  After that initial sighting we observed probably 3 or 4 more in a span of about 5-10 minutes.  I initially thought it possibly have been a satellite or something.  They all just kinda flashed and disappeared and flashed again.  I was astounded as was my wife.   I really was hoping to find more reports of this because it was such a nice night and figured there would have been more people outside that night that may have seen them.  I thought they possibly could have been meteors, but, I have never seen a meteor act that way, usually they are more like a shooting star to the best of my knowledge. All in all it was very bizarre.  I just couldn't wrap my head around it and neither could she.   Thanks for having this site.  I just had to toss this out there and see if anything similar had been seen.",
      "link": "http://www.nuforc.org/webreports/135/S135738.html",
      "state": "OH",
      "duration": "5-10 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c76d2",
      "summary": "Silent Transparent Triangular craft with bright white orb in the center!",
      "city": "cincinnati",
      "shape": "triangle",
      "date": "2017-12-21T00:00:00",
      "story": "Silent Transparent Triangular craft with bright white orb in the center! I know it seems difficult to believe, but I know what I saw and I have 20/15 vision perfectly health adult male, no substance use not even alcohol. What I saw was a completely silent translucent triangular craft with bright white orb of light in center, flying from north to south. It was broad daylight and it was flying quite low, i'd estimate about only several thousands feet above ground. It was truly amazing, I wish i knew what this was and what civilization this originates from or what type of military experimental craft this is! ((NUFORC Note:  Date was flawed.  We do not know the year of the alleged event.  Witness elects to remain anonmyous; provides no contact information.",
      "link": "http://www.nuforc.org/webreports/137/S137877.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b00",
      "summary": "Large sphere sighted by two people over Ohio River at Columbia Tusculum with sustained light that disappeared into pinhole.",
      "city": "cincinnati",
      "shape": "sphere",
      "date": "2017-11-09T00:00:00",
      "story": "Large sphere sighted by two people over Ohio River at Columbia Tusculum, with sustained light that disappeared into pinhole. A very bright and large yellow-orange sphere appeared suddenly along the south side of a strong storm system around early sunset on the first day of daylight savings time. ,The sighting occurred over the Ohio River, near Columbia-Tusculum.  It moved from the Southwest to the northeast at a very quick speed, and after sustaining light for about 10 seconds, its light output dropped to nearly a pinhole for 3 seconds, before disappearing completely. One observer is a retail associate and jewelry designer, age 20, and the other is a classical musician and hospitality professional with two degrees, age 30.",
      "link": "http://www.nuforc.org/webreports/137/S137130.html",
      "state": "OH",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7be7",
      "summary": "Two lights moving slow, then faster and changing directions without a sound.  ((anonymous report))",
      "city": "cincinnati",
      "shape": "unknown",
      "date": "2017-10-19T00:00:00",
      "story": "Two lights moving slow, then faster and changing directions without a sound. Two lights (orange above and red below) moved faster than a satellite perpendicular to me and my daughter relatively high in the sky, then moved towards us more quickly, then turned and went away from us diagonally relatively slowly before disappearing.  No sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136777.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f53",
      "summary": "Pill-shaped object observed by motorist.  ((NUFORC Note:  MUFON CMS report.  PD))",
      "city": "cincinnati",
      "shape": "other",
      "date": "2018-04-26T00:00:00",
      "story": "Pill-shaped object observed by motorist. March 19, 2018; Norwood, Ohio. 10:20 AM.  The man was on his way to work, and was stopped at a traffic light, noticed the object moving.  At first he thought it was a plane, but it had no wings. then maybe a blimp, but it was too small.  It was pill shaped, white with a dark band from top to bottom.  It seemed to be coming in for a decent and was moving at a good rate of speed.  He thought this was odd because there were no landing fields in the area. It was not very high up and he lost view of it behind the nearby building.  He estimate the size as 30 foot long by 10 feet high.  He was very interested in the object and it seemed to move slow and silently but his next turn was away from its path. (MUFON CMS)",
      "link": "http://www.nuforc.org/webreports/139/S139519.html",
      "state": "OH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c81cb",
      "summary": "2 white lights, 1 possibly exploded?",
      "city": "cincinnati",
      "shape": "unknown",
      "date": "2018-02-22T00:00:00",
      "story": "2 white lights, 1 possibly exploded? I believe it was between 20:00 and 21:00 on Tuesday, 2-19-18.  I was taking the trash out.  We are in a densely populated area, so lots of lights.  It was a clear night but generally not a lot of stars visible where we are.  I was staring up in a southern direction, around the area of Orion’s Belt. I noticed a star to the immediate right of Orion's Belt that was twinkling more than the others.  It was white, same as any other star or light you would normally see at night.  As I watched, it started to actually flicker like a dying light bulb.  Very rapidly and erratically on and off.  There didn’t seem to be any sort of pattern to the flickering.  This went on for maybe 15 to 20 seconds. There was then a quick brighter burst of white light, then it flickered out completely.  Didn’t see it again.  About 1 to 2 seconds later, looking to the right of the first light, I saw another small white light flicker on out of nowhere.  Wasn’t as bright as the first light and that was followed almost instantly by an orange burst of smaller lights.   Very faint but I would say it looked like an explosion.  There were multiple, smaller orange lights emanating from the second light.  Like something hit it and orange pieces flew off of it.  They moved out very quickly in a seashell shape, with the small side coming from the second white light – the orange pieces were moving back towards the spot of the first light.  The second flash that was followed by the orange burst was visible for maybe a total of 3-4 seconds? I was looking up in the sky for a few minutes but once I notice the first light flickering, the entire event took 20-30 seconds? I couldn’t tell any shapes other than they looked like any other star in the sky.  The first white light was same size, color, shape.  The second white light was smaller and fainter as were the orange pieces. Totally guessing on distance here.  I’m 6’2”.  If I were to hold a ruler up, I’d guess the first light was 5 inches to the right from the Orion’s Belt.  The second light was another 4 to 5 inches from the first light.",
      "link": "http://www.nuforc.org/webreports/138/S138883.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c864b",
      "summary": "Travel time was way shorter than it should have been (missing time?)",
      "city": "cincinnati",
      "shape": "unknown",
      "date": "2018-08-17T00:00:00",
      "story": "Travel time was way shorter than it should have been (missing time?) I keep recollecting this incident so decided to submit a report.  This happened sometime in the summer/very early fall between 1993 and 1995, in the days before GPS and automated navigation, and before we had kids.  My wife and I decided to drive from North Alabama to Western New York State to visit her parents.  Since our route was taking us nearby Ft. Thomas, KY, where her aunt lived at the time, we agreed we would stop there for the night and take her aunt with us to New York State. In those days, I prided myself on my map-based navigational skills and ability to predict our arrival time to within 15 minutes, even driving hundreds of miles.  I was never off by more than a couple minutes, ever.  The first part of the trip to Ft. Thomas was uneventful, and we arrived within my predicted timeframe.  The second part of the trip from Ft. Thomas to our destination in western NYS, I predicted to be around 530 miles with a travel time of 7hrs 45 min to 8 hrs in duration (which gives an average interstate speed of about 66 mph, including stops).  All went well and we had a great trip.  I seem to recall that the last leg of the journey (maybe 50-100 miles) seemed a bit off from where I expected to be, like I took the wrong exit, but we easily knew where we were, and we made it to the in-laws as expected. When we arrived, the in-laws seemed surprised.  They were not expecting us so soon, even though I had given them the expected arrival time the day before, and we had spoken to them when we left, so they would know when we started.  The problem was, we arrived over 2 hours earlier than predicted, based on mileage and travel time from KY to western NYS. My wife, her aunt, and I were totally confused about how we got there so fast.  We checked the distances, and reran the calculations several times, each time showing the original, predicted 8 hour travel time and predicted arrival time (taking time zones into account).  I don’t remember if we ever checked the odometer (it seems that we would have), nor what the mileage was.  Getting there in 6 hours would have had us averaging over 88 mph.  I never drive that fast, and couldn’t through the city areas, and would have surely remembered doing so.   After a very short while we shrugged it off and went about our business.  However, in the weeks and years after, we talked about it off and on, and agree we all felt very weirded out.  It was a memorable experience. Other than driving through Cincinnati near the start and feeling like we took the wrong exit and road at the end, I don’t have any particular memories of the trip, of how we actually got from Ft. Thomas to our destination, where/when we got gas or made stops, or if we ate along the way.  Everything is a blur to each of us.  However, I do feel like at some point, I asked my passengers \"do you believe in them now.”  But it is a fuzzy memory, and I don’t know if I asked it, or if I somehow inserted that into my memory of that day.  What I do know is that we made impossible time on that trip, corroborated by outside witnesses, and we three travelers have no idea how we did it.  And I have seen plenty of strange things and had a number of odd experiences in my life, a number of which I have reported to this site. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142748.html",
      "state": "OH",
      "duration": "6 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c8dfb",
      "summary": "Triangular craft, dim lights, traveling in straight line, low altitude, high velocity, silent - Cincinnati OH",
      "city": "cincinnati",
      "shape": "triangle",
      "date": "2019-01-11T00:00:00",
      "story": "Triangular craft, dim lights, traveling in straight line, low altitude, high velocity, silent - Cincinnati OH -Background: I have no pertinent professional background, but have an interest in astronomy and bird watching, so I spend a lot of time on my back deck observing the cosmos with a telescope and watching birds with a spotting scope.  I live a few miles north of CVG intl. airport with my deck facing west, so I also use my spotting scope to track the occasional plane as they approach along a southern trajectory.  -Moment of sighting + description of craft: I was in my back yard (no scope) staring roughly WSW trying to get a good view of the Aquarius constellation for several minutes when I noticed the object moving at what appeared to be a fairly low altitude, though I could not discern with certainty, along a NNW to SSE trajectory at an extremely high velocity.  The object virtually flew right over my head (seemed to be less than 1/4 mile to the west), yet it was 100% silent.  It is difficult to estimate its size, as I could only make out the lights and not the body of the craft itself.  The lights numbered between 6 and 10 and were arranged in a triangle.  They were very dim, such that if I hadn't already been looking in that direction with my pupils adjusted to view the dim starlight I certainly wouldn't have seen it.  The lights didn't blink or change at all, and also lacked any discernable hues, appearing to be a dim grey shade.  It traveled in a straight line and was out of sight in a matter of 10 seconds or less, seemingly covering several miles in that brief window of time.",
      "link": "http://www.nuforc.org/webreports/144/S144309.html",
      "state": "OH",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c928e",
      "summary": "Silver cigar shaped craft that vanished near Cincinnati",
      "city": "cincinnati",
      "shape": "cigar",
      "date": "2019-12-01T00:00:00",
      "story": "Silver cigar shaped craft that vanished near Cincinnati Driving East on route 50 I seen what first appears as a reflection of sunlight off a passenger airplane but as it tilted it looked like a giant silver cigar with nothing on its sides, no windows, wings or markings. After a few moments the object just vanished. It didn’t not appear to be traveling, it only tilted. The sky was fully visible with no clouds or obstructions close to the craft. I’m only documenting this in case anyone else in the area seen it. I have never seen something just disappear which has troubled me.",
      "link": "http://www.nuforc.org/webreports/150/S150061.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9531",
      "summary": "Driving on I-75 Southbound saw a white Tic-Tac shaped object hovering in Western sky with no sound.",
      "city": "cincinnati",
      "shape": "cylinder",
      "date": "2019-12-19T00:00:00",
      "story": "Driving on I-75 Southbound saw a white Tic-Tac shaped object hovering in Western sky with no sound.",
      "link": "http://www.nuforc.org/webreports/151/S151366.html",
      "state": "OH",
      "duration": "3 minutes"
    }
  ]
}