{
  "city": "cleveland",
  "fetch_timestamp": "2025-07-12T14:32:54.716099",
  "record_count": 93,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b42a3",
      "summary": "Color-Changing Light Appears in Sky",
      "city": "cleveland",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Color-Changing Light Appears in Sky During the afternoon in Summer 2004, I looked into the sky and noticed a small white light hovering above me.  There was a clear cloudless sky that day and it couldn't have been a cloud.  It was very distant, but it didn't seem to be moving.  I continued looking at the object when it changed colors: first to green, then to orange, then blue.   It began to float eastward, still changing colors, and then almost immeadiately turned south, an immeadiate 90 degree turn that no craft I can think of could handle. It floated away, southward, and eventually reached the horizon where it was out of view. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49839.html",
      "state": "OH",
      "duration": "Two minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b435b",
      "summary": "Saw a cloud-like object making swift, wide, regular circles over and over.",
      "city": "cleveland",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "Saw a cloud-like object making swift, wide, regular circles over and over. While taking our dog out, I saw one round \"cloud\" that was lit up brighter than the rest of the sky. This \"cloud\" was moving very quickly in an \"orbiting fashion\" against a slow moving sky.  While there were other clouds, this one was different and wasn't behaving as the rest were. I've never seen anything like it. I can only compare its movement to the movement shown on radar screens seen in movies. I stopped watching as I was the only one home and a little nervous! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49615.html",
      "state": "OH",
      "duration": "5min+"
    },
    {
      "_id": "64d005f478aba2ec5a3b4bbd",
      "summary": "Spinning Sphere.  Lights glowing inside.  Other flashes of light around it.  Stat. or moving slowly.  ((NUFORC Note:  Balloon?  PD))",
      "city": "cleveland",
      "shape": "sphere",
      "date": "2019-06-27T00:00:00",
      "story": "Spinning Sphere.  Lights glowing inside.  Other flashes of light around it.  Stationary or moving slowly. ((NUFORC Note:  Possible high-altitude, helium-filled balloon??  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146965.html",
      "state": "TN",
      "duration": "1-2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ea3",
      "summary": "A large bright silver color and shiny fireball moving through the sky from east to west was seen in Cleveland, TN",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2019-04-08T00:00:00",
      "story": "A large bright silver color and shiny fireball moving through the sky from east to west was seen in Cleveland, TN. Early morning 4/29 while waiting at a traffic light in north Cleveland, Tennessee, I saw a long, bright and silvery object, maybe a fireball in the sky moving from east to west.  I heard no sound so I didn't believe it to be a jet.  It was very large and moving fast.  The entire event lasted only seconds, maybe 10.   When I exited my car, I heard nothing and saw nothing else.  A co-worker of mine also saw the same thing in Hixson, Tennessee, at about the same time.",
      "link": "http://www.nuforc.org/webreports/145/S145470.html",
      "state": "TN",
      "duration": "~10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f9f",
      "summary": "Obj. moving SE, watched it until it disappeared.  Remained a white color even against the evening sun. ((anonymous report))",
      "city": "cleveland",
      "shape": "circle",
      "date": "2019-04-12T00:00:00",
      "story": "Object moving southeast, watched it until it disappeared.  Object remained a white color even against the evening sun. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145610.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6006",
      "summary": "RUF442 reported  a UFO above him, 45NM SSW of DRYER VOR, [DJB] (aircraft at 13.000 feet) which is a bright white light that is not movi",
      "city": "cleveland",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "RUF442 reported  a UFO above him, 45NM SSW of DRYER VOR, [DJB] (aircraft at 13.000 feet) which is a bright white light that is not movi RUF442 reported  a UFO above him, 45NM SSW of DRYER VOR, [DJB] (aircraft at 13.000 feet) which is described as a bright white light that is not moving but is following his flight.  This report qas submitted by the pilot of RUF442, MU2, to the Cleveland, Ohio Federal Aviation Administration (FAA) Air Route Traffic Control Center (ARTCC).",
      "link": "http://www.nuforc.org/webreports/058/S58481.html",
      "state": "OH",
      "duration": "unk"
    },
    {
      "_id": "64d005f478aba2ec5a3b650e",
      "summary": "At approximately 22:00 hours was passing by living room window facing due west. I noticed an intensely bright object about 45 degrees h",
      "city": "cleveland",
      "shape": "sphere",
      "date": "2007-04-27T00:00:00",
      "story": "At approximately 22:00 hours was passing by living room window facing due west. I noticed an intensely bright object about 45 degrees high that was so luminous it actually threw six light spikes from it. Their was a plane moving underneath opposite direction. Navigation lights noted. I watched this incredibly bright object for about 5 minutes and it was absolutely still. I finally blew it off as Venus or some star. But when I went to look again ten minutes later it was gone, poof. Not sure of what I saw but it was incredibly bright. From visual comparison to plane I would estimate object was nearly orbital and about the size of a pea at arms length. Just a sidenote. That afternoon the skies were absolutely covered in jet trails and military aircraft were seen in area. The trails were even on local tv news.",
      "link": "http://www.nuforc.org/webreports/055/S55605.html",
      "state": "OH",
      "duration": "Two minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6876",
      "summary": "Black rectangular shaped craft observed with night-vision equipment. No sound or lights!",
      "city": "cleveland",
      "shape": "cross",
      "date": "2006-07-16T00:00:00",
      "story": "Black rectangular shaped craft observed with night-vision equipment. No sound or lights! I was assigned to the local high school, as a Deputy Sheriff, to provide security for the school against student vandalism. While sitting in my patrol car I was using our night-vision monocular, which was issued to me for this assignment, to observe the sky as it was a clear morning. A few minutes later something dark in the sky caught my attention through the lens. This object was not visible to the naked eye, however, the night-vison unit accentuates any available light and this in-turn illuminated the stars brightly. The object was visible to me only because it blocked out the stars in the sky's background thus it was clearly and sharply defined although black in color.  The object was moving from West to East with absolutely no sound. My environment at the school parking lot was totally quiet with only an occasional passing car on Highway 129N which is located approximately 1,000 ft. from my location. The object had no lights and did not illuminate whatsoever.  The object's shape was something akin to a cross with two differences: 1. Picture a cross with the horizontal portion moved forward near the top but not quite. 2. There was another horizontal portion visible towards the rear. That portion was not as wide as the forward horizontal postion. Also, all portions, especially the horizontals, were about 25% broader than what you would expect on a standard (?) cross.  Obviously the size/altitude could not be determined, nor the speed. However, the night-vison I was using does not magnify and I would estimate that the apparent size from my view, if you took a coin in an outstretched hand, appeared about the size of a quarter-dollar.  My viewing time was around a couple of minutes. I lost sight of the object due to the awkward angle of trying to crane my neck from right to left as it moved across the sky. I exited my vehicle to further look for it, however I could not.  As a retired professional pilot of 20 years . . .I have seen many things I could not immediately explain, however, none of them remained a mystery for more than a few minutes.  This object is absolutely un-explainable to me and I have had two years to ponder it. I DO NOT believe in extraterrestrial craft at this point and I am certainly a dyed-in-the-wool skeptic on such matters. I cannot conceive of a rational explanation. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50764.html",
      "state": "GA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d06",
      "summary": "Private Pilot/Amateur Astronomer Witnesses Satellite-like Object Make 2 Course Corrections",
      "city": "cleveland",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "Private Pilot/Amateur Astronomer Witnesses Satellite-like Object Make 2 Course Corrections Not too long after sunset, with a very few broken clouds illuminated by street lights, a bright white light was noticed overhead while stargazing. It was similar to a typical satellite in its appearance and speed and it tracked rapidly on a heading of about 100 degrees; just a little to the right of due east.  The brightness was steady and there were no rotating beacons, sound, nor change of colors noticed. The object tracked at about 100 degrees for approximately one minute, then angled to a new heading of approximately 120 degrees.  It remained on this heading for only about 30 seconds when it made another angular change to a heading of about 140 degrees, where it was at an elevation of about 45 degrees or thereabout. The object dimmed after about 15 seconds and was no longer visible.  It did not go behind a cloud.  From this, I gathered that it was a reflected light and the object dimmed as it moved into the earth's shadow.  This meant that the object was at considerable altitude and, by the short duration, was traveling rapidly. Being a private pilot, an amateur astronomer and general skeptic, I chose to report this sighting as something truly beyond anything I have ever witnessed in the sky at night. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59770.html",
      "state": "OH",
      "duration": "5 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7009",
      "summary": "Red and Blue lights hovering over Cleveland's West side.  We saw it from the E side in Garfield.  ((NUFORC Note:  Star??  PD))",
      "city": "cleveland",
      "shape": "changing",
      "date": "2007-10-08T00:00:00",
      "story": "Red and Blue lights hovering over Cleveland's West side.  We saw it from the East side in Garfield. Om September 22nd, 2007, at approximately 9:30 pm we spotted what first looked like an airplane in the northwestern sky over Cleveland, Ohio.  We were in Garfield Hts., Ohio at the time sitting on the back porch. \tWe got a pair of binoculars to take a closer look.  It was not an airplane.  It was an unidentifiable object, actually hovering very slowly moving from the western sky towards the northwest. \tIt first seemed to hover for at least an hour and finally started moving.  Through the binoculars, it first looked to me like an arrow or V shape with red, blue and white lights.  Then it changed to a circular shape with red lights on the left and blue lights on the right and white lights in the middle.  It was constantly blinking and twinkling.  My friend saw pretty much the same thing, but what she called concentrated energy force streaming from the blue and red lights.  She said it looked like a see-through bubble with white veins going around it.  She had contacts in, and I didn’t.   After watching it for an hour and a half, it went further off into the horizon behind a tree.  It did not disappear suddenly, it just hovered away into the distance. ((NUFORC Note:  Star??  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58876.html",
      "state": "OH",
      "duration": "2 HOURS"
    },
    {
      "_id": "64d005f478aba2ec5a3b708b",
      "summary": "Several changing shapes and colored objects traveling at fast speeds or just sitting there until they disapeared in the blink of an eye",
      "city": "cleveland",
      "shape": "changing",
      "date": "2007-08-07T00:00:00",
      "story": "Several changing shapes and colored objects traveling at fast speeds or just sitting there until they disapeared in the blink of an eye My friend and i were outside at night when we saw them. at the top of the tree horizon several objects started to appear and disapear. It looked like they had lights the shape of a triangle on the, then it would switch to circles, they were strobbing lights almost vilontly.  The objects were either sitting in place or jumping around in an almost zig zag.  Note: there were many airplanes in the sky at this time, it seemed almost as if they were supposed to be a distraction.  Two seperate times i saw a very fast blinking light, both times they disapeared after three blinks, the second time i saw one it didnt travel as far across the sky as the first one, but on the 3rd blink it was fading, then gone.  I have never seen a ufo in my life until last night, and i was almost scared because i saw so many of them on different areas of the sky but they were mainly near jupitor as it glows brightly.",
      "link": "http://www.nuforc.org/webreports/057/S57686.html",
      "state": "OH",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b70a6",
      "summary": "A UFO With Red, Blue & Green lights alternating between the colors and gliding and Hovering",
      "city": "cleveland",
      "shape": "other",
      "date": "2006-07-16T00:00:00",
      "story": "A UFO With Red, Blue & Green lights alternating between the colors and gliding and Hovering I was driving home and I looked up and saw green lights all in a row like a bar across, then the lights went out then in the same place I saw all blue lights across in a row, then the lights went out then in the same place I saw all red lights across in a row, then I saw the outline of the craft which was dark in color. It glided left then right, then left then right, then hovered, then glided a few houses down, then glided left , then right, then hovered, then glided a few more houses down and kept doing that till I lost sight of it behind some trees, then I didn't see it again.  All the while, the lights kept going from all red, to all blue to all green over and over and the light would stay the one color for like 5 seconds then turn all blue then all green over and over as it glided and hovered.",
      "link": "http://www.nuforc.org/webreports/050/S50625.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7211",
      "summary": "Strange lights over Cleveland",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "Strange lights over Cleveland I looked up into the sky at about 12:00 am and I saw these lights, there were a total of I would say five. They were different colors, yellow and orange.  The lights would stay still for a few moments and then they would take off very fast.  They hovered around for at least two hours, then they just disappeared.",
      "link": "http://www.nuforc.org/webreports/054/S54557.html",
      "state": "OH",
      "duration": "2 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b7337",
      "summary": "Bright white sphere",
      "city": "cleveland",
      "shape": "sphere",
      "date": "2006-07-16T00:00:00",
      "story": "Bright white sphere While letting dogs out before bed saw an extremely bright white 'star' like object. It was moving slowly in the west about 8000ft. It was in the flight path of two very high flying jets. Watched it moving WNW for about six seconds and it just flickered off like a light switch. Could not have been meteor, too slow. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50704.html",
      "state": "OH",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b74db",
      "summary": "I awoke and notice six round white circles revolving around each other",
      "city": "cleveland",
      "shape": "circle",
      "date": "2007-08-14T00:00:00",
      "story": "I awoke and notice six round white circles revolving around each other   Their was six round objects revolving around each other they were white like light bulbs.I'm on house arrest at this time,I got a call from my probation officer the next day stateing that I was out for 18minutes (out of bounds),me and my wife was asleep at the time,I just so happen to wake up and look at my security camera and see white round bright lights",
      "link": "http://www.nuforc.org/webreports/058/S58056.html",
      "state": "OH",
      "duration": "porch"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bc3",
      "summary": "Triangular craft over Burke Lakefront Airport Cleveland. White lights on the sides, red light shimmering in the middle-bottom.",
      "city": "cleveland",
      "shape": "triangle",
      "date": "2007-02-24T00:00:00",
      "story": "Triangular craft over Burke Lakefront Airport Cleveland. White lights on the sides, red light shimmering in the middle-bottom. while driving down I-90 west around dead man's curve, i noticed something different out of the corner of my eye, something bright.  i looked towards the airport and thought i saw extra lights from a plane.  i realized there was a new control tower, triangular, with different lights in the corners.  the lights on the edges were enormous in proportion to all the other lights nearby.  it was hovering DEAD STILL approximately 50-150ft above the runway.  when i realized it was not a tower, that it was suspended, i craned my head outside my window and almost crashed my car while looking. something told me to park the car and watch, but i didnt want to have the police pull me over.  i was not scared at all; i watched it hover for about 3 minutes. as a test, i memorized the image in my head.  i took my eyes off of it for 45 seconds, in order to turn around on E55th street. i ran the light, flew around, and had full view of the entire runway within 10 seconds of entering the freeway (now I-90 east). there was NOTHING IN SIGHT.  in fact, the entire airport was now dark, whereas before it had been almost totally illuminated by searchlights.  i parked on the side of the road near the dolphins and got out of my car and searched tghe skies for a good 2 min in all direction. there was no sight of ANY lights in the sky. after i am finished with all the math calculations, i have figured out the object had to have traveled faster than 7,000- 14,000MPH in order for the object to be completely out of range.",
      "link": "http://www.nuforc.org/webreports/055/S55358.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f18",
      "summary": "the sphere that was chased by a fighter jet  in the morning sky",
      "city": "cleveland",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "the sphere that was chased by a fighter jet  in the morning sky Early in the morning I was walking out to my shop at about 5 am I looked up in the eastern sky and seen a sphere shaped object hovering in the sky that didn't appear to be as high up as most commercial aircraft that fly in my area. I decided at that time to go get my camcorder and record what I was seeing to be able to show my friends. I shot footage off and on for about 2 hours until it was light outside witch made it hard to see, then all the sudden I heard a roar in the sky to the south, as I looked That direction I seen what apeared to be a fighter jet with the afterburners on heading straight At it. It looked like the sphere started moveing north away from it as the fighter got close to it It went straight up over the top of the fighter jet and then apeared to back the other direction,  The fighter tryed to turn at that moment but couldn't turn that sharp and over shot the ufo so far  Because of the speed by the time it came back around the ufo was gone it just shot straght up in Sky until it was out of sight.  I did my best to zoom in and out on the ufo to get objects in the Footage to give some way to judge distance like trees and telephone poles I would like to show this Video along with a few others I have showed to friends that are very amazed at shots I have. I would just like someone that has the ability to examine the footage I have and tell me if its A ufo or if there is a normal explanation for what I seen. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73079.html",
      "state": "OK",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b8726",
      "summary": "Red oval object appeared in the sky on 3 occasions for about five seconds apiece, disappearing each time.",
      "city": "cleveland",
      "shape": "oval",
      "date": "2009-01-10T00:00:00",
      "story": "Red oval object appeared in the sky on 3 occasions for about five seconds apiece, disappearing each time. A friend and I were sitting on the roof of a building star gazing, looking for shooting stars.  At twelve thirty, around half an hour later, an oval object with a red tint passed directly over us heading east, and disappeared after about five seconds, when nearing the horizon.   Near five minutes later, it came again, this time moving in a straight line to the west, from the direction it disappeared in previously, and went out of sight behind a tree.  Fifteen minutes later, it appeared again, heading south in a straight line.  After we had seen it for about three seconds, it began to zig-zag up and down, and as soon as it headed straight, it completely disappeared.   Before the first occurrence with the object, we had seen about three shooting stars, the last being two minutes before the object appeared.  There were also planes in the sky a few minutes before, but it seemed to be at a much higher altitude than them, possibly in or near the atmosphere.",
      "link": "http://www.nuforc.org/webreports/066/S66612.html",
      "state": "TN",
      "duration": "12 seconds total"
    },
    {
      "_id": "64d005f478aba2ec5a3b8825",
      "summary": "The object came from the north from Canada meteor shaped fire ball with crackling sounds and a little tail and sparks glowing red and o",
      "city": "cleveland",
      "shape": "fireball",
      "date": "",
      "story": "The object came from the north from Canada meteor shaped fire ball with crackling sounds and a little tail and sparks glowing red and orange I could feel the heat from it it was so cose it was the size of a house it looked like it was being contolled because it went flew horizontal then went up a hill about 50ft. off the ground and circled around the Eveready factory then came down and passed again in front of us and headed back towards Canada. ((NUFORC Note:  Witness indicates that date is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73859.html",
      "state": "OH",
      "duration": "35sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8966",
      "summary": "U.F.O. flying currently in the sky above Cleveland at about a 30,000ft ceiling.  22:30 EST USA on 20090622",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "U.F.O. flying currently in the sky above Cleveland at about a 30,000ft ceiling.  22:30 EST USA on 20090622 While sitting on my porch, enjoying the night, i witnessed to the east, well above the horizon, almost 80 degree up from my position, a \"plane\" or so i thought, it began making eratice Z pattern movements, unlike anything i have ever witnessed in the past.  I have served on a U.S. Aircraft carrier and i have seen many planes.  The movements were slow then fast, sharp direction changes in Z, S and O patterns.  I would say that it had a 20,000 to 40,000 ceiling, but various and unknown with the naked eye.  No telescope or binoculars available.  My friend arrived at 22:30 EST USA and witnessed this as well and she hates to agree with me, but is 100% in agreement with me.  No sound was heard, a green hue was seen but it was very high up. Very Respectfully",
      "link": "http://www.nuforc.org/webreports/070/S70652.html",
      "state": "OH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8d82",
      "summary": "my daughter went with her mother to look for a job, at hickery springs mfco.she toke a picture of her self seting in the drivers set. a",
      "city": "cleveland",
      "shape": "other",
      "date": "2010-04-13T00:00:00",
      "story": "my daughter went with her mother to look for a job, at hickery springs mfco.she toke a picture of her self seting in the drivers set. and when she got home that evening she put them on her lap top compiture. sunday march 14th she was looking at them, and in back ground you can see a strange object in the sky.we made the picture larger , but dont no what it is , it got a x shaped like thing on the end of it.it has a long thing that allmost goes strate up. i took a picture of it with my cell phone from her lap top. a lot of peeple whants to no what it is.",
      "link": "http://www.nuforc.org/webreports/074/S74673.html",
      "state": "TN",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f5d",
      "summary": "green fireball over cleveland,ohio",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2010-04-13T00:00:00",
      "story": "green fireball over cleveland,ohio I was driving on 271N passing the Chagrin Rd exit and saw a green fireball falling from the sky. ((NUFORC Note:  If the duration of the sighting was, in fact, 3-5 minutes, the object, almost certainly, was not a typical meteor.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74921.html",
      "state": "OH",
      "duration": "3-5min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8f9",
      "summary": "Oval aircraft with red and yellow lights",
      "city": "cleveland",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "Oval aircraft with red and yellow lights My sister called me and my mother into the front yard to view a craft in the sky. It was oval shaped and white. It had yellow and red flashing lights around the outer edge. It hovered silently across the street from the house. Low in the sky and very visible. There were no windows or anything like an undercarriage. Absolutely no noise and for awhile no movement. Incidentally, across the street from the house was the TRW Valve Division. I usually suspect that often these crafts are not so much otherworldly as they are from a foreign country. Quite possibly this was a spycraft taking pictures of TRW as they manufactured defense components etc. Just my suspicion in this instance, as the craft was hovering above a factory right next to TRW. After approx. 4 minutes, it silently left at great speed in a southwest direction. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77962.html",
      "state": "OH",
      "duration": "4.00 min."
    },
    {
      "_id": "64d005f478aba2ec5a3ba927",
      "summary": "The Bus Stop",
      "city": "cleveland",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "As I walked to the bus stop at the bottom of the hill, I saw several lights, blinking in a sequence just over the trees.  The lights were different colors: red, green, yellow and blue.  The lights were arranged in a line diagonally.  The object was very close, but because of it still being dark out it was hard to make out the exact shape of the aircraft. I didn't tell a soul for several months afterwards. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78718.html",
      "state": "GA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad32",
      "summary": "is it a ufo",
      "city": "cleveland",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "is it a ufo hi my name is ((name deleted))  i live in cleveland oh i work downtown at 55 public square 3rd shift and i walked outside to do my rounds and i looked up to check the building and i seen lights above my building.so i took pic of what i seen and i called the news to see if there where lights in the sky tonight they said no so i sent them a pic of what i seen and the put it on there web site.so then i called housekeeping down from the building and they seen it to.it keep going away and coming back.tell me what u thank. ((NUFORC Note:  Photo shows cluster of lights in a foggy sky.  They could be from an airliner, but we have no way of knowing what they were.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79526.html",
      "state": "OH",
      "duration": "downtown"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3bc",
      "summary": "Beam of light over Cleveland Clinic Main Campus in Cleveland, Ohio That cause power loss.",
      "city": "cleveland",
      "shape": "flash",
      "date": "2011-01-31T00:00:00",
      "story": "Beam of light over Cleveland Clinic Main Campus in Cleveland, Ohio That cause power loss. At 9:10 PM in Cleveland, OH 41.30.24.28 N 87.37.21.13 W.   There was a bright flash that came from the sky, over the Cleveland Clinic Campus.  Cleveland Clinic Police was contact for any knowledge of the flash, they reported that there was a power surge, but unaware of the bright flash in the sky until i told them.  This flash cause all light to flicker in my apartment, and all street lights to turn off. The weather condition was snowing, and no sound of thunder from the lighting. This make this very strange, i will consider these events as possible UFO siting over Cleveland Clinic campus in Cleveland, Ohio.",
      "link": "http://www.nuforc.org/webreports/079/S79657.html",
      "state": "OH",
      "duration": "5 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4e3",
      "summary": "Cleveland, OH lights coming from lake erie.",
      "city": "cleveland",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "Cleveland, OH, lights coming from lake erie. Driving on the shoreway Rt 90 last night around 6PM I seen lights above cleveland.  There were many of them.  They were not planes.  I think I seen one closer up coming from by the water and it looked clear and had a round light in the center!   I am not sure what it was but all the cars around me was looking up also!",
      "link": "http://www.nuforc.org/webreports/078/S78873.html",
      "state": "OH",
      "duration": "drove past"
    },
    {
      "_id": "64d005f478aba2ec5a3bb71a",
      "summary": "A picture of aliens painted in  parking lot at an apartment complex!",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2010-08-24T00:00:00",
      "story": "A picture of aliens painted in  parking lot at an apartment complex! After watching a show about alien sightings on tv for about two days on tv and the next couple of days there are there bodies painted on the driveway.  It seems to be three painted shapes of the aliens, according to the television show, and they have three heads seems like they are walking all together and the heads are all in a line in straight row and the bodies seem like they are floating on a cloud or showing something that floating, and the three bodies are directly above the scratching of(alot of paint) showing of something floating. The bodies are thin and and seem like they are all walking. There are no arms just a dot and straight long line the part attached to the head is one straight line and the last two lines are the legs spread apart as if they are walking.   I just thought it seems funny and this picture is painted on the parking lot of all silver paint (alien paint maybe or of some chemical.  It's not real messy, but it is big enough that peo! ple were scare to park their cars there.   The the direction of the picture had to come from directly above my apartment.  The three aliens had to have landed on the roof top and make this picture.  The picture is pointed directly towards my window.  The silver paint is nothing like I've seen it.   I don't think it can be removed.  I think it has to be completely painted over or dug up to remove the object shape on the ground.  The whole complex has to of seen this object or painting in the driveway.  The channel that I seen this television show is the history channel about the aliens. I believe this is an contact from the other side. When I took the pictures, I feel really funny after I took the picture.  Thanks for letting me report this.",
      "link": "http://www.nuforc.org/webreports/077/S77377.html",
      "state": "OH",
      "duration": "after watching show on tv"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb20",
      "summary": "red lites above western sky of cleveland ohio",
      "city": "cleveland",
      "shape": "oval",
      "date": "2010-07-06T00:00:00",
      "story": "red lites above western sky of cleveland ohio saw 6 oval shaped red in color beacon looking lite traveling from southwest. move toward city of cleveland ohio.",
      "link": "http://www.nuforc.org/webreports/076/S76162.html",
      "state": "OH",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbf4",
      "summary": "You can see the engines or where you would think engines would be clearly lite up on the underside.",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2011-10-10T00:00:00",
      "story": "You can see the engines or where you would think engines would be clearly lite up on the underside. I have a video of an object in the night sky that I took on 06-14-10. You can see the stars and the underside of this object in the night sky around 3 to 4 miles away from Cleveland Utah, hovering over the desert between Cleveland and Huntington Utah, 2 to 3 miles off the ground.In the video you can see the under side of this object but not the shape or dimensions of the objects.  You can make out the underside and can see bolts of electric power that make an even pattern on both the right and left sides which created the light.In the middle, the bolt of electricity sages down but connects the right to the left side of the object.  Very clear and I was zoomed in with my VHS camera.  A little shaky but the images are clear and you can see details of the electric current and possibly a little more with a little video knowledge.",
      "link": "http://www.nuforc.org/webreports/083/S83933.html",
      "state": "UT",
      "duration": "28 secs."
    },
    {
      "_id": "64d005f478aba2ec5a3bc20b",
      "summary": "I was driving down a Cleveland street approaching a red light when I heard what sounded like an ambulance siren.  When checking my surr",
      "city": "cleveland",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "I was driving down a Cleveland street approaching a red light when I heard what sounded like an ambulance siren.   When checking my surroundings for the ambulance to yield to it I saw a very large object (much, much larger than any airplane) with an upside down triangle light pattern fly from northeast to southwest in the general vicinity of Cleveland Hopkins International Airport and the NASA Glenn Research Center.  The object was only a few hundred feet from the ground and was out of my sight after roughly five seconds.",
      "link": "http://www.nuforc.org/webreports/084/S84027.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc70d",
      "summary": "Glowing fireball object traveling in Cleveland sky NW towards the Lake?",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2011-10-19T00:00:00",
      "story": "Glowing fireball object traveling in Cleveland sky NW towards the Lake? My husband and I were leaving a party and walking to our car.  As we walked down the sidewalk, I looked up and saw an orange orb/fireball thing heading across the sky.  I kept saying to my husband, \"What is that?   What is that?\"   But he (who is usually my debunker) had no response.  He kept saying it had no propulsion.  (I had to ask him what that meant.)I slowly took out my iPhone and just snapped.  The fireball object traveled slowly and steady NW, (maybe towards Lake Erie?).  We watched it until it was out of sight.   I will email two photos.  One is the fireball object, and the second is what it looked like after it traveled further away and was almost out of sight.  I’m not sure how high up it was, but it was low enough to catch our eye.  We were near the airport, but in this area, we are used to the landing patterns of the airplanes and this was definitely not an airplane.  Also, the airplanes that evening were landing to the SW. I would love it if someone looked at this and could explain what we saw.  So, if it’s not a UFO, oh well, but we are still scratching our heads!",
      "link": "http://www.nuforc.org/webreports/084/S84496.html",
      "state": "OH",
      "duration": "5 minutes?"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb7e",
      "summary": "Fireball like object flying east to west along shoreline near downtown Cleveland",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2011-07-06T00:00:00",
      "story": "Fireball like object flying east to west along shoreline near downtown Cleveland I am an EMS helicopter pilot in the Cleveland Ohio area with a two nurse crew this morning.  We had just dropped off a patient on the rooftop helipad of a hospital three miles east of downtown Cleveland and were preparing to depart for base when all three of us witnessed a \"fireball like\" object. At approximately 1:50 AM, July 4th, 201, I was preparing for engine start when I observed this fireball like circular object flying from east to west just north of our position.  It appeared closest when I first saw it.  This is an area of intense air traffic so it took a second look to determine it did not look like an airplane.  At this particular time of morning there were no other aircraft seen. I immediately jumped out of the cockpit and went back to the crew loading our equipment and told them check this out.  All three of us watched the object fly over the shoreline at approximately 3000 to 4000 ft.  Maybe a speed of 150kts at least.  We tried to determine if it was an airliner as this is the same area they fly on their approach to Cleveland Hopkins airport.  However there were no position lights and no strobes.   We could not see any structure except for the roundness and color.  It was a yellow golden sphere with red on the sides (See drawing).  The bright red seemed to have the characteristic of fire or vertical flames but was not flames.  It was not underneath only on the sides with a little on the top.  It was like red electrical fire.  It did not look like jet propulsion. I am not an artist but I did attempt to draw what I saw and that is included here.  I would estimate a fairly good sized object, at least 10-20 feet across.  It flew east to west over the shoreline.  As it approached downtown proper it turned northwest and departed out over the lake at a constant altitude and airspeed. ((NUFORC Note:  One of two excellent reports from this source.  To read the other, go to the reports for the morning of March 09, 2010, and read the report from Middlefield, OH.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82138.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbb3",
      "summary": "Orange-red flickering ball floating over lake Erie west of the cuyahoga river. Floated then took of upward and west until disappeared.",
      "city": "cleveland",
      "shape": "circle",
      "date": "2011-07-17T00:00:00",
      "story": "Orange-red flickering ball floating over lake Erie west of the Cuyahoga river.  Floated then took of upward and west until disappeared. Flickering orange-red ball over lake Erie just west of the Cuyahoga rRver.  The object was just kind of floating and almost did a slow figure eight pattern.   Then it took off directly up and west until it disappeared.   I got a really crappy picture that basically just shows an orange-red ball.   I saw a similar object floating over my apartment building about a year ago.  The apartment sits in downtown Cleveland on lake Erie.   There was one other witness to that sighting and we both went outside to get a better look and it was gone.",
      "link": "http://www.nuforc.org/webreports/082/S82476.html",
      "state": "OH",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd015",
      "summary": "Ufos seen in cleveland ohio, changed color and disapeared then reappeared.",
      "city": "cleveland",
      "shape": "oval",
      "date": "2012-08-05T00:00:00",
      "story": "ufos seen in cleveland ohio, changed color and disapeared then reappeared. hi, i saw about 5 crafts that were saucer/oval shaped flying over my house in cleveland ohio on march 13, 2010.   I found out at a later date that there were ufos spotted over cleveland ohio for about 8 nights in a row.  they changed color and would disappear then reappear.  i was cooking on the grill in my backyard when i saw this along with my girlfriend at the time and a good friend. we are all about 27 years old now.  i have never seen anything like it before.  it was not an airplane and it was not a helicopter.  i have always been a believer of aliens and ufo's but i had never actually seen anything before.",
      "link": "http://www.nuforc.org/webreports/090/S90776.html",
      "state": "OH",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd05c",
      "summary": "Round White Star Sized Light Slowly Moving After Being a Fixed Object.  Slowly Vanished.",
      "city": "cleveland",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Round White Star Sized Light Slowly Moving After Being a Fixed Object.  Slowly Vanished. 35Yr. Old Male, Father, Husband.  Outside smoking a cig on my front porch.  Just started doing this 2 months ago when we got news were pregnant again (our 2nd).  I've been using this time to stare at the stars and honestly bask in what I see as God's beautiful creation.  I'm a life long Christian that doesn't rule out UFO's/Aliens b/c I find comfort in knowing mankind truly doesn't have all the knowledge of our Lords magnitude.  No drugs, No boose, just cigs.  I noticed multiple (3) airplanes flying overhead that night as per the norm during the first cig, and saying thank you Jesus as I looked from star to star giving Him the glory.  Sets my soul at ease anywho.....  While doing this for one set of stars (3*) above my neighbors house (NE) for a couple of minutes or 1/2 cigarette. Spending about 1 minute thank the Lord for each one. When I got to the 3rd star and did the same.  Just a few seconds later I then noticed it, the &quot;star&quot; (round) start to slowly move north.  Separating itself from the other 2 apparently out of nowhere, meaning it was fixed in the sky while looking at the other two.  It was equal to size, color, and intensity as the other two stars that stayed put.  After about 2 minutes of it slowly moving I noticed it began to become darker, as if the power was cut in half to the light (absolutely no flashing, no color other than white, no flickering).  Then the last minute it maintained the same speed and simply disappeared.  No clouds in the sky.  No ridge line to block view.  The thought to be star for 3 minutes before movement simply disappeared 3 total minutes later. It wasn't a shooting star.  I have seen plenty of those in my lifetime, nor a airplane.  They are starkly different of course to my description.  This makes just the second time in my life I've ever had such an experience.  I was 7 years old when something similar to this happened to me before but it was during the day.  Although I did see the &quot;cigar shaped&quot; slow flying object reported here locally about 2 weeks ago as well I was told it was a chinese satellite re-entering the orbit by a classmate and wrote it off.  I'm not a conspiracy theorist that's scared of stuff I don't understand.  Just wanted to share this with someone other than my wife.  Take care guys-gals and God Bless.",
      "link": "http://www.nuforc.org/webreports/092/S92061.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0df",
      "summary": "Black diamond with red light on bottom tip flying over little league feild just after dark.",
      "city": "cleveland",
      "shape": "diamond",
      "date": "2012-10-30T00:00:00",
      "story": "Black diamond with red light on bottom tip flying over little league feild just after dark. My husband and his co umpire were there but were'nt watchng.  I happened to look up and saw an unlit/black diamond (from my angle) with a red blinking light on the bottom point.  Not sure if there was one on the top.  It flew or glided about 30 feet above the empty little feild where just the dim lights were on after the game.  It seemed to come from the trees and slightly decend but it kept going until it crossed the field and disapeared over the buidlings.  It was probably about as big a large door way in a school building or a possibly a very large trash can.  I would say it was going at about twenty mph if not slower.  It made no noise, i would have never known it was there if i hadn't turned my head to look.  The game had ended maybe 45 minutes before and in the summer months since it was dark outside, it had to be around 9 to 10 pm. 9:45 maybe. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93301.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd139",
      "summary": "Orbs/Teardrops Dropping Out of A Cloud Over Lake Erie",
      "city": "cleveland",
      "shape": "teardrop",
      "date": "2012-08-05T00:00:00",
      "story": "Orbs/Teardrops Dropping Out of A Cloud Over Lake Erie On July 4th I witnessed 4 (white) falling objects in the bright of day falling to the earth from a large overhead cloud. I was driving East on the Route 2 Shore-way, coming from Cleveland, OH going towards my home in Madison OH.  It was about 2:30 in the afternoon. (Route 2 runs along Lake Erie.) I noticed a huge oval cloud (kind of shaped like a mushroom without the stem) over the lake as if a storm were brewing.  It caught my eye because I noticed a small white orb/teardrop shape with a white trail dropping down out of the cloud, straight down into the lake, or what looked like the lake because it was so far away.  At first I thought I was seeing things and then another one dropped out of the cloud, straight down as the previous one had done, dropping into the lake.   Two more of these white orbs/teardrops followed one after the other.  I didn’t notice a splash because #1 I was driving on a crowded highway and #2 the cloud was far off, probably closer to Canada.!  The weather was hot and humid, but there were some storm clouds way out over Lake Erie.  The size of the orb/teardrop was (to me) about the size of a pencil tip, maybe a little bigger.  I had my windows up with the a/c set to 2 and therefore I have no idea if there was an accompanying noise.   I am a 55-year old woman who doesn’t see things like this but I thought that it was odd enough that I should report it to someone just in case others saw the same thing I did.",
      "link": "http://www.nuforc.org/webreports/090/S90619.html",
      "state": "OH",
      "duration": "2 minutes?"
    },
    {
      "_id": "64d005f478aba2ec5a3bd92d",
      "summary": "Triangular object with white cloudy fixed line triangular formation and bright shining prism light.",
      "city": "cleveland",
      "shape": "triangle",
      "date": "2012-07-04T00:00:00",
      "story": "Triangular object with white cloudy fixed line triangular formation and bright shining prism light. Sighted a stationary object well above lower puffy cloud line almost directly over head in the east. Clear blue sky back round.Distance was great very high in the sky, actually made it look small. Description of craft: Shape: Triangle. Composition: all 3 sides of the triangle looked like white cloudy field that held its straight line shape to form the triangle.  But the white cloudy field did have fluctuation and movement within itself like a shifting and re-arranging constant.  At the top where the two longest sides of the triangle met was a very bright round shinning prism of beaming light.  Craft stayed stationary but made movement in its one spot.  Oddly enough it was as if it was putting on a show.  The craft looked as though it was flipping (turning) slowly in a timed sequence over and over again.  Each time it would flip backwards away from me the prism light went out of sight then return once it was flipped toward me and back at the top of the triangle.   Also the white cloudy fields that made the triangle line configuration would slightly dissolve themselves but immediately return their shape and consistency while craft was in motion turning over a flipping over.  It seemed it was getting smaller  and farther away as the minutes passed.  It then slowly seemed to go to a range distance I could no longer view. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90254.html",
      "state": "OH",
      "duration": "6-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bda0a",
      "summary": "V-shaped multicolored lights on some Craft.",
      "city": "cleveland",
      "shape": "triangle",
      "date": "2012-05-13T00:00:00",
      "story": "V-shaped multicolored lights on some Craft. No one will believe me but I saw something very interesting tonight, on my way home from Dayton TX USA, going to Cleveland TX USA   I saw what at first looked like an airplane but as I got closer it seemed to be hoovering just about a 1/4 of a mile.  When I got where it felt like I was right under it I confirmed it was definitely not moving forward or any other direction.  The craft looked like a v shape and had different colored lights that looked like they were chasing each other.   When I got home I was a little shaken but also excited what if you know",
      "link": "http://www.nuforc.org/webreports/087/S87996.html",
      "state": "TX",
      "duration": "about 10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bdec3",
      "summary": "As I was driving my friend home we both saw what appeared to be an airplane on I-90 East towards Cleveland.",
      "city": "cleveland",
      "shape": "disk",
      "date": "2012-10-30T00:00:00",
      "story": "As I was driving my friend home we both saw what appeared to be an airplane on I-90 East towards Cleveland.  We saw this craft fly towards us, and then it flew off to the side, and it was just hovering there.  It then came back over the street, and then it went back.  Then it started flying really low. After a while it took off. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93768.html",
      "state": "OH",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be0f2",
      "summary": "I was returning home with my mother and sister one night in April. It was about 8:00 or 9:00 because I remember it being about 30 minut",
      "city": "cleveland",
      "shape": "sphere",
      "date": "2012-05-29T00:00:00",
      "story": "I was returning home with my mother and sister one night in April. It was about 8:00 or 9:00 because I remember it being about 30 minutes after the sun had set. I was walking to the porch when I happened to look up at the sky.  Normally we get a lot of airplane traffic above our house as the airport is about 15 miles away at most so I always look in the sky to see if there is anything out of the ordinary. I was looking up at the sky and walking onto the porch when I noticed an orange star. I went over the the north side of the porch which faces toward downtown and went to go look at the star again. I suddenly noticed this orange/red orange star was moving. It was very high in the sky, and very very light. It was moving straight and made no sound. All of a sudden it ballooned into three orange objects like when a firework explodes and rains down. The objects then made a 360 and at that point I thought they would hit each other and that they could be military aircraft. But they didn't and they seemed to be racing. But the further away they moved the harder it was to see them. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89143.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be32e",
      "summary": "I was outside on my backyard porch looking up into the sky: I then saw a circular shaped object, with bright lights, moving at speeds g",
      "city": "cleveland",
      "shape": "circle",
      "date": "2012-11-19T00:00:00",
      "story": "I was outside on my backyard porch looking up into the sky: I then saw a circular shaped object, with bright lights, moving at speeds greater than any known military aircraft.  The UFO was seen for about 3 seconds with the bright lights visible and after that about 3 seconds it turned off the lights and while proceeding to travel in the same direction at the same speed. I could then still see a slight visual of the aircraft for about 2 more seconds.  Then that's when i no longer saw the aircraft.",
      "link": "http://www.nuforc.org/webreports/094/S94620.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be737",
      "summary": "Rhythmically moving point of light slowly crossing the northern sky near Chattanooga",
      "city": "cleveland",
      "shape": "light",
      "date": "2012-06-08T00:00:00",
      "story": "Rhythmically moving point of light slowly crossing the northern sky near Chattanooga At around 11:40 I wandered outside to smoke a cigarette with my father and happened to notice what appeared to be an out of place star in the northern sky.  We've been doing quite a bit of telescope skywatching lately and generally know the night sky quite well so we were intrigued. We continued to observe it and noticed that it was moving west to east in a strangely rhythmic manner.  It slowed down and sped up, repeating this every 2-3 seconds until it was finally out of sight around 5 minutes later.",
      "link": "http://www.nuforc.org/webreports/089/S89385.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be8b3",
      "summary": "At about 8:35 this evening i was standin outside and was lookin at the sky watching the jets fly by. there were 3 at the time. i notice",
      "city": "cleveland",
      "shape": "oval",
      "date": "2012-05-13T00:00:00",
      "story": "at about 8:35 this evening i was standin outside and was lookin at the sky watching the jets fly by. there were 3 at the time. i noticed there was a star visible durin daytime hours with the sun shining and though it was kinda weird. as i moved my eyes back to look at the jets i noticed a light movin slowly in the sky. almost slow enough to take for a star. i kept my eyes on it and called some kids playin ball to ask them did they see what i was seeing. they saw 2 jets till i told them to look in between them. when i looked to see the reaction on their faces they yelled that it was movin in a squiggly line and disappeared. i looked back and saw that the object was gone. clear skies and all. the object was not a perfect circle but had no wings and a single light beamed straight down as if to deter complete sight. but i t was an obvious metalic object. also there was no red flashing light. the more it flew overhead the easier it was to see. after the object wa! s no longer visible one more jet flew past the same flight path as the first 3.",
      "link": "http://www.nuforc.org/webreports/088/S88905.html",
      "state": "OH",
      "duration": "2 1/2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be8e4",
      "summary": "I was outside with my stepson around a firepit and we were about ready to call it a night and I saw a craft in the air which I thought",
      "city": "cleveland",
      "shape": "oval",
      "date": "2012-05-13T00:00:00",
      "story": "I was outside with my stepson around a fire pit and we were about ready to call it a night and I saw a craft in the air which I thought was a star but then it moved at an incredible rate.  It moved in a zig-zag pattern and just disappeared and honestly I never believed in this however my husband has seen 2 UFO sightings in this area and I honestly thought he was nuts until tonight. I saw something that was way too fast to be human in any form. It really scared me.",
      "link": "http://www.nuforc.org/webreports/088/S88907.html",
      "state": "OH",
      "duration": ":05"
    },
    {
      "_id": "64d005f478aba2ec5a3bf114",
      "summary": "My boyfriend and I saw a red cylinder object in the sky up close above a house and it was big.",
      "city": "cleveland",
      "shape": "cylinder",
      "date": "2013-07-03T00:00:00",
      "story": "My boyfriend and I were sitting on the porch and saw a red cylinder object in the sky up close above a house and it was bigger than the size of a full moon.   We were looking north and the object began flying west at a really fast speed until we saw it disappear through the clouds.   As it began flying away it looked as though it was getting smaller and by the time we took the pictures it was almost gone and the object was quiet we didn't hear anything.",
      "link": "http://www.nuforc.org/webreports/098/S98349.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2b9",
      "summary": "I saw a bright light that looked like a star that began to circle the sky with two white lights and one red light flashing.",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2013-09-30T00:00:00",
      "story": "I saw a bright light that looked like a star that began to circle the sky with two white lights and one red light flashing. Saturday September 16, 2013  It was about 11:30-12:00 when I saw what at first appeared to be a beautiful bright star, that bright star is what got my attention.  I gazed out of the window to get a better view of that big bright beautiful star that was sitting in the northeast sky it began to move more toward the east then it circled back toward the west and as it headed more toward the west I could see two white lights flashing in a sequence of three and one red light. It headed back to that same point of the northeast sky that bright light would “enhance” for lack of a better word then fade then begin the same circling routine all over again this went on about fifteen times and as I watched it, at one point I thought I could see a massive ship through the clouds but I can’t make that my claim as of today but that made me “think” that those lights where coming from the front of the ship. After about the fifteenth circle the ship flew away so fast heading east leaving a line of smoke in the sky.  I’ve seen a different kind of ship flying around in that same exact area a few years ago this ship was not circling as far out as the ship that I saw last night, it had sort of a search light on it, as if it was a car in the sky with its high beams on circling and circling.   It was moving much faster and then it just faded away into the clouds it was in plain sight anyone could have just looked up and saw it me and my daughter watched it until it faded away. I could see a Clear, Straight, Path into the sky no trees or anything preventing my View",
      "link": "http://www.nuforc.org/webreports/102/S102134.html",
      "state": "OH",
      "duration": "30-40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf565",
      "summary": "Orange w/ white center.",
      "city": "cleveland",
      "shape": "oval",
      "date": "2013-07-14T00:00:00",
      "story": "orange w/ white center flew from south east toward north west then north then vanished orange glow w/white light into center.",
      "link": "http://www.nuforc.org/webreports/099/S99941.html",
      "state": "OH",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf587",
      "summary": "3 white orbs over Lake Erie.",
      "city": "cleveland",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "3 white orbs over Lake Erie. 3 white, strobing orbs seen flying over Lake Erie from Cleveland Browns Stadium.  The orbs did not appear to be very large, but were a fair distance from the stadium, several miles. The first orb was flying solo, from NE to SW below cloud level , followed by two identical orbs about one minute later.    They were flying faster and lower than the incoming jet.  Flying in a straight trajectory but slightly rising and falling.   As they approached the shoreline, they took a direct path west and moved exceptionally fast out of sight; gone in the blink of an eye.  Too fast to be a known man made craft.  They were close enough to see they were not a helicopter, plane or familiar shape.",
      "link": "http://www.nuforc.org/webreports/101/S101613.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb42",
      "summary": "Fast bright object very high up in the sky.",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "Fast bright object very high up in the sky Very high in the sky, spotted an extremely bright object like a welders torch.  Object appeared directly up in the horizon traveling south to north in a short straight line as I was star gazing while walking my dog.  It appeared as a bright object for a couple of seconds and disappeared just as bright spanning 3-6 degrees in the horizon.  No trail noticed.  Nothing like a shooting star or meteor shower and many times faster and brighter a plane.  Too fast to be noticed unless looking up in that direction by chance...",
      "link": "http://www.nuforc.org/webreports/094/S94757.html",
      "state": "OH",
      "duration": "2-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c02f6",
      "summary": "Silver object above Cleveland.",
      "city": "cleveland",
      "shape": "oval",
      "date": "2013-06-02T00:00:00",
      "story": "Silver object above Cleveland I was driving east and looked out over the city (Cleveland). One silver, shiny object seemed to appear.  There were no clouds but it was slightly overcast or hazy.  The object did not seem to be moving much, maybe slowly toward the north.  There appeared to be a very bright spot on the object, maybe the sun’s reflection.  I looked at it for a few seconds and then looked back to the road (traffic was heavy).  I looked back up within 1 or two seconds and the object was gone.  No smoke or trail, just gone.  I continued to look for it but did not see it again.",
      "link": "http://www.nuforc.org/webreports/098/S98262.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c09a5",
      "summary": "At 7:00pm we saw five reddish orange spheres moving slowly across the sky.  When we first saw them they were in a straight line.",
      "city": "cleveland",
      "shape": "sphere",
      "date": "2014-01-10T00:00:00",
      "story": "At 7:00 pm we saw five reddish orange spheres moving slowly across the sky.  When we first saw them they were in a straight line.   As they moved, they scattered apart and one was left pretty far away from the others.  They were pretty low, but made no noise at all.  They never stopped moving and they soon were to far away to see anymore.   Later that day, at about 10:00pm, we counted 9 airplanes in the area.",
      "link": "http://www.nuforc.org/webreports/105/S105740.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c45",
      "summary": "It looks like a static electric engine very quite and I believe it is large and had to be flown by someone.",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2014-01-30T00:00:00",
      "story": "It looks like a static electric engine very quite and I believe it is large and had to be flown by someone. Its dark out and the visible view looks like a static engine with bright white light, bolts of electricity of the white light surrounding the oval shaped center that is also bright white.  Like a basketball surrounded by electric bolts of electricity.  Soundless and hovering 500 ft. above the ground and you can see lights where alledged windows might be away from the engine or bright white lights.  There is contour around where the alledged window light is or a bend in the outside of the object and can see reflection from the bright white light on the contour around the alledged window.  I just got off work and had picked up my two small kids I'm raising on my own from day care and had put them to bed, went outside to have a smoke before going to bed myself.  It looked like a star but something was odd about the light, so I grabbed my vhs recorder and zoomed in while filming.  It's pretty clear but I believe if someone who new about video tape and could clear the picture up a little such as the lighting we might all be surprised.  Not sure what to do with the video, its amazing!",
      "link": "http://www.nuforc.org/webreports/106/S106752.html",
      "state": "UT",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fda",
      "summary": "It was late at night and I was over my grandmother's house awaiting my mother to pick me up. We both looked up into the dark night sky",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2013-11-20T00:00:00",
      "story": "It was late at night and I was over my grandmother's house awaiting my mother to pick me up.  We both looked up into the dark night sky and saw several lights close together as if attached red, blue, green and so on giving the appearance of a large craft looking from the bottom similar to one of a star wars movie.  My mother soon arrived and as we drove home three spherical lights seemed to follow and hovered over my house as I exited the car from the short drive two more lights emerged and hovered over as well.  Going inside I looked out my window and within the few seconds it took for my going inside they disappeared.  I later heard of similar events on the news over tower city. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104447.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1216",
      "summary": "15 balls of light moving quite fast in a line towards Lake Erie.",
      "city": "cleveland",
      "shape": "light",
      "date": "2014-01-16T00:00:00",
      "story": "15 balls of light moving quite fast in a line towards Lake Erie. I was looking out my 6th floor apartment window towards the west (towards Lakewood, Rocky River, and points west along the Lake Erie shoreline).  Several (15) balls of light came up from the horizon, made an arc movement into the sky, and proceeded to quickly move towards Lake Erie.  Within about 30 seconds, each light would be over the lake and they disappeared as they moved towards Canada.  They were crossing paths of planes on approach to Cleveland Hopkins that were also out over Lake Erie. They were moving much faster than the planes, seemed to be above the planes that were coming in to land, and they had no flashing lights like the planes (just a red ball of light).  Weirdest thing I've ever seen, no explanation other than they were definitely not satellites, meteors, planes, or lanterns (I've seen all of these before).",
      "link": "http://www.nuforc.org/webreports/106/S106240.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c156e",
      "summary": "Red and green orb.  ((NUFORC Note:  We suspect a sighting of Arcturus.  PD))",
      "city": "cleveland",
      "shape": "circle",
      "date": "2013-10-23T00:00:00",
      "story": "red and green orb My wife and I was coming home from the store when we noticed a light in the western sky that looked like a star but we could see it flickering, so when we got home I looked at it with my telescope and I could see that it was round like a orb.  it had green and red rotating inside of it, and while I was looking at it I could see a dark spot starting to form on the top of it.  then the dark spot started moving slowly downwards like it had a ring around it.  when the dark ring reached the bottom,the orb started moving slowly downwards and stopped.a couple hours later I went back outside to see if it was still there and I noticed it was in the northeast sky.I've been watching this orb for over two weeks and it's been there every day.   I have know idea what this thing is or it's purpose but it's been in the sky everyday. ((NUFORC Note:  We suspect a sighting of Arcturus.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103299.html",
      "state": "OH",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c15df",
      "summary": "butterfly shaped flying ufo low flying  Cleveland, Ohio.",
      "city": "cleveland",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "butterfly shaped flying ufo low flying  Cleveland,Ohio Saw a low flying craft-looked like a butterfly.  Two wings were green, two wings were red-the wings were the lights. -was by W.98th St. -I was on 90West freeway-near Lakewood, Ohio.   Even though I saw one craft, it could have been 4 crafts coming together-shocked at how low they were flying. ((ADDENDUM FROM WITNESS))   It was yesterday-November 9, 2013. Here is some additional information:  70-80 ft above the ground.  100ft horizontally.  I was going 60 miles an hour.  The craft was going east-towards the airport. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/104/S104294.html",
      "state": "OH",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c16bc",
      "summary": "Bright lights hovering in the sky low to the ground disappeared out of sight within a few minutes.",
      "city": "cleveland",
      "shape": "teardrop",
      "date": "2013-10-23T00:00:00",
      "story": "Bright lights hovering in the sky low to the ground disappeared out of sight within a few minutes. First spotted a light as I was traveling west on HWY 412 near Cleveland, OK.  As I was driving, I noticed a very bright light that looked to be possibly falling and on fire.   I continued to drive west until I was even with it from the highway.  I pulled over and rolled down the window to get a better look.   By this time, the bright light had dimmed.  The object was alone and hovering.  Sitting completely still and showing some red, green, and white lights.  The lights moved in a pattern across the back side of the object.   Less than a minute went by and the object started moving away from me.  I turned around and started driving east after the object before I had traveled 5 miles, the object was out of sight.  Teardrop in shape.  Very bright lights at a distant.",
      "link": "http://www.nuforc.org/webreports/103/S103459.html",
      "state": "OK",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17c4",
      "summary": "Fireball across the sky.",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2014-07-20T00:00:00",
      "story": "Fireball across the sky. Fireball breaking into two pieces moving from SE to NW from horizon to horizon",
      "link": "http://www.nuforc.org/webreports/111/S111463.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c18a8",
      "summary": "Large fiery orange ball/cylinder of light hovering for 4-5 minutes near Lake Erie on the west side of Cleveland Ohio",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2014-07-20T00:00:00",
      "story": "Large fiery orange ball/cylinder of light hovering for 4-5 minutes near Lake Erie on the west side of Cleveland Ohio I was out looking at the moon because I had heard tomorrow was supposed to be a super moon.   Out of nowhere, the bright orange light appeared.  Small at first, but I thought maybe it was a planet (saturn, venus)and that the clouds moved away.  But the orange light grew bigger, then hung in the sky right in front of my house, above some pine trees.  If I had to estimate the distance, it was probably about where a helicopter would fly.   The orange light was like a fireball so I thought maybe it was a meteor but it didn't move.   It also looked like it had an orange light beam coming from it.  Its shape was almost like that of a flood light, like square cylinder shape but fiery orange.  I ran to get my camera, and of course, just like on tv shows, my camera froze.  It gave me a creepy feeling, like it was observing me.   I then noticed it started to shrink, but then realized it wasn't shrinking, it was heading west. It had to have been moving quickly to shrink out of site! that fast.   I am about 4 blocks from Lake Erie and it was heading west.  I just didn't feel right, didn't seem like a natural phenomenon.  Very strange and uneasy feeling..",
      "link": "http://www.nuforc.org/webreports/111/S111427.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1916",
      "summary": "Cigar-shaped craft in front of moon.",
      "city": "cleveland",
      "shape": "cigar",
      "date": "2014-07-26T00:00:00",
      "story": "Cigar-shaped craft in front of moon. I initially spotted the craft when walking outside my apartment.  There were several people gathered and looking at it.  It was a bright light situated in front of the dark part of a crescent moon.   It seemed to be getting closer, so I decided to run to the store and purchase binoculars.   Viewing it through binoculars clearly showed two white lights and a dim cigar-shaped outline, which was corroborated by several bystanders both at the apartment and the parking lot of the store.  After about 35-40 minutes, the object moved quickly out of the shadowed part of the moon and vanished.",
      "link": "http://www.nuforc.org/webreports/111/S111826.html",
      "state": "TN",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1aa0",
      "summary": "Filmed this black dot appear while filming over Lake Erie where i live..and this black thing pops in the video...have video if you like",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2014-06-20T00:00:00",
      "story": "Filmed this black dot appear while filming over Lake Erie, where i live..  And this black thing pops in the video…  Have video if you like to see it.. here is link.. http://youtu.be/HsvDbZRnySM ((NUFORC Note:  Link appears to be either flawed, or non-functional.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110207.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2778",
      "summary": "I saw 4 red lights lined up in the sky and they just vanished instantly within seconds",
      "city": "cleveland",
      "shape": "light",
      "date": "2014-11-14T00:00:00",
      "story": "I saw 4 red lights lined up in the sky and they just vanished instantly within seconds We were driving home when we saw 4 red glowing lights lined up in the sky....we are right by the airport so I said it was the planes lining up to land but then I realized they were just a solid red color and there were no aviation lights blinking of any kind. I went to turn into a parking lot so I can stop to look and as I looked over I watched the first one just disappear into thin air and then they were all gone.....my bf saw the other three literally just vanish after sitting there for about a minute. I can't tell if they were moving at all if any but they seemed pretty stationary and then vanished instantly.",
      "link": "http://www.nuforc.org/webreports/115/S115187.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bae",
      "summary": "We were waiting to see the ISS pass over. Thinking we had possibly missed it; but, still sat on the back deck a few more minutes.",
      "city": "cleveland",
      "shape": "circle",
      "date": "2014-09-05T00:00:00",
      "story": "We were waiting to see the ISS pass over.  Thinking we had possibly missed it; but, still sat on the back deck a few more minutes.   Then we saw something pass over that was flying lower and faster than the ISS and was much brighter, faster & looked to be much lower.  There were no blinking lights or other colors.  I know what the differences are between difference (looking) meteors.  I've seen many; however, nothing that looked like this or as bright.   I waited to post this, to see the \"real\" ISS pass over (which states that it will pass over and be seen within a 2 minute time span.   About a week later, our notifications of times/dates for the next fly over.  We definitely saw it (the ISS) & what we saw less than a week earlier was definitely not the ISS!   This object was flying S/SW to N/NE and no sound.",
      "link": "http://www.nuforc.org/webreports/113/S113235.html",
      "state": "TN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d6d",
      "summary": "Saw the same orangish light I've seen two other times.  In the northern sky.  Was clearly Visible for two minutes then faded away.",
      "city": "cleveland",
      "shape": "circle",
      "date": "2014-09-18T00:00:00",
      "story": "Saw the same orangish light I've seen two other times.  In the northern sky.  Was clearly visible for two minutes then faded away. Saw something strange afterwards: a whitish orb falling softly and silently to earth.  It appeared to land only a couple of blocks away.",
      "link": "http://www.nuforc.org/webreports/113/S113586.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f92",
      "summary": "UFO.",
      "city": "cleveland",
      "shape": "circle",
      "date": "2014-08-22T00:00:00",
      "story": "UFO My friends and I were outside when we noticed what looked like a star heading north at a stationary speed.  It wasn't blinking, it just looked like a star.   Then it turned right and sped up a ways, and right from it another circular dot flew from it in the opposite direction.  Then right after it occurred and they disappeared I saw another small dot that grew brighter, than faded until it couldn't be seen.   Right after all the occurrences I noticed a few helicopters heading towards the general area in the sky...  Anyone know what this was?? ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112648.html",
      "state": "OK",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3062",
      "summary": "UFO Sighting in Cleveland August 20th, 2014, 10:00pm EST.",
      "city": "cleveland",
      "shape": "light",
      "date": "2014-08-22T00:00:00",
      "story": "UFO Sighting in Cleveland August 20th, 2014, 10:00pm EST. Roughly 10:00 pm EST, on August 20, 2014, my boyfriend and I saw what appeared to be a bright star/sphere like light object, traveling from the west heading east across the sky.  The visibility of the sky was completely clear of any clouds, making all the stars and airplanes visible to the naked eye.   The appearance of the object my boyfriend and I saw was much brighter, and larger than any star.  The object was traveling at the rate of which seemed to be a fast airplane, but had no blinking lights, as all of the airplanes seen in the sky flying at the same time had.   The object headed to what seemed to be directly across the sky right over us, bearing no sound, and suddenly appeared to change direction heading  south in the sky; away from us, toward a star in the sky.  We continued to watch it closely, almost in dismay; captivated, as the object still had no sign of any blinking lights and had no change in its form; staying a consistent bright sphere of light.   The object appeared to then not just be flying south, but straight up toward the star just south of us.  As we watched my my boyfriend stated “look it’s starting to fade”, and then right before our eyes  the object just disappeared; which happened in seconds. I was absolutely dumbfounded, the object appeared to be there in the sky one moment and then what I would describe as it telescoping, farther straight up in the sky, and as it did so, it seemed to have a reddish color as it vanished into the sky.  Something like out of a movie, as a star ship might go into hyper drive, and all you see is the afterburners of its jets. The whole occurrence lasted about 60 seconds, to a minute and a half long.  Regretfully, I have no footage as my boyfriend and I describe  to one another as being memorized, trying to figure out what exactly it was we were looking at, which when the object eerily disappeared in seconds from the sky, we had both agreed that what we had just seen was a UFO.",
      "link": "http://www.nuforc.org/webreports/112/S112715.html",
      "state": "OH",
      "duration": "60-90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3bf2",
      "summary": "Sonic boom like sounds, followed by possible fireworks or munitions?",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2015-07-17T00:00:00",
      "story": "Sonic boom like sounds, followed by possible fireworks or munitions? Very LOUD, sonic boom type sounds at 10 o'clock sharp, repeated.  First was loudest by far.   Never recall hearing such a sound...  My first thought was that is was like the \"Blue Angels\" from the air show only WAAAY bigger..   My boyfriend and I felt a major panic, I must admit...   Now it sounds like fireworks in the distance...  Something is not right..",
      "link": "http://www.nuforc.org/webreports/120/S120327.html",
      "state": "OH",
      "duration": "10 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ec5",
      "summary": "Three lights spinning.",
      "city": "cleveland",
      "shape": "light",
      "date": "2015-06-19T00:00:00",
      "story": "This event was what made me and my brother know for sure there is life other than us in the galaxy. We were walking to the store and looked north, and what had to be 45° up, we saw three lights spinning slowly and it looked like one object but after about five or so minutes the lights moved away from each other and continued to spin that's when it changed from white light to soft orange.  If I had to guess I would say it was over the lake or the city and they never changed distance but I am confident we seen something being controlled by an intelligent race or it was human but I doubt it.   I don't care what people think I know what I saw I have never told anyone but me and my brother talk about it sometimes and it scares us both. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119586.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c428f",
      "summary": "Rectangular object with four white lights, and one red pulsing light.",
      "city": "cleveland",
      "shape": "rectangle",
      "date": "2015-04-23T00:00:00",
      "story": "Rectangular object with four white lights, and one red pulsing light. My wife shouted at me to come outside and look up at the sky,when I did I was in amazement at what I was seeing there was two white lights in the front and two in the back with a red pulsing light between the lights in the rear.   The craft had to be larger than a football field, due to the fact that it blocked out so many stars as it passed over.  It seemed to be flying around cloud height much lower than commercial airplane and did not make any noise what so ever, it just seemed to glide across the sky",
      "link": "http://www.nuforc.org/webreports/118/S118553.html",
      "state": "OK",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c44b4",
      "summary": "I was sitting in a stationary position a few buildings down from the Rite Aid for two hours without movin",
      "city": "cleveland",
      "shape": "triangle",
      "date": "2015-11-26T00:00:00",
      "story": "I am a 36 year old female, and I was sitting in a stationary position a few buildings down from the Rite Aid, for two hours without moving.    I gauged the movement from between two power lines.  It only moved slightly over but did change positions for me to see a triangle shape to a line of changing color lights, which included white, green/blue, orange/red.   As I saw the triangle shape, I could only see white lights at each tip.  However, when it turned sideways, I could see a variety of colors but they did not have a certain changing pattern.   I took pictures from my iPhone, in which you can see the change in positions but the phone couldn't pick up the change in color due to the distance. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124230.html",
      "state": "GA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4556",
      "summary": "White flashing lights pulsing around the sky and Red flashing crafts also SE Tennessee",
      "city": "cleveland",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "White flashing lights pulsing around the sky and Red flashing crafts also SE Tennessee. Flashing white strobe lights and red flashing strobes moving all over the Southeast sky, I live near the Georgia line in Cleveland, TN.  This was last night 11-12-2015, and tonight they are flying 4 in a straight line all at steady speed, so much air traffic also.  I always have a eye to this sky and i have never saw so many planes and I have never saw these white strobe lights flashing like lighting bugs.  And the red ones are moving the same speed as the white ones, one white strobe moved right over this cattle field and another was more south flying low but others are farther out in the sky.  I'm just curious as to what they are.  If you look southeast for a few minutes you will see them flashing.",
      "link": "http://www.nuforc.org/webreports/124/S124041.html",
      "state": "TN",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c46cc",
      "summary": "Bright green light descending toward earth at 45 degree angle.",
      "city": "cleveland",
      "shape": "light",
      "date": "2015-11-26T00:00:00",
      "story": "Bright green light descending toward earth at 45 degree angle. Driving south along I-43, saw bright green light descending toward earth.  Appeared to be a firework at first, but it traveled pretty quick downwards at a 45 degree angle, light vanished, but appeared to be something in the sky after the light was gone.  Was no more than couple hundred feet in the air.  Was not a firework because fireworks blow up, create multiple lights, and do not travel at a 45 degree angle.  They travel in an arc and eventually die out.  This had the same brightness throughout till the light vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124329.html",
      "state": "WI",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5673",
      "summary": "A bright red light appeared very quickly, stopped abruptly and then sped away upward into the sky.",
      "city": "cleveland",
      "shape": "light",
      "date": "2016-07-08T00:00:00",
      "story": "A bright red light appeared very quickly, stopped abruptly and then sped away upward into the sky. We were watching the fireworks in North Olmstead, OH.  A bright light was going across the sky and we assumed it was a helicopter or an airplane.  All of a sudden it stopped, and began hovering. The light was very bright and red.  For about a minute it hovered, then it quickly exited and disappeared out of sight immediately.  It almost looked as if it were going upward very quickly.  Initially, it appeared to be at least 30,000 feet.  One of us saw a flash of light off to the side in the top of the sky.",
      "link": "http://www.nuforc.org/webreports/128/S128224.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b06",
      "summary": "I saw lights at first believed to be a plane, but did not move in the sky at all, just flickered.  ((NUFORC Note:  Star?  PD))",
      "city": "cleveland",
      "shape": "light",
      "date": "2016-04-22T00:00:00",
      "story": "I saw lights at first believed to be a plane, but did not move in the sky at all, just flickered. We saw what I thought were the lights of a plane at first, but they didn't move from the sky.  Could see it from several places in town.  Flickering lights in sequence like it was a plane, but did not move. ((NUFORC Note:  We suspect that the witness may have been looking at a celestial body, either a star, or a planet?  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126861.html",
      "state": "TN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b60",
      "summary": "There was a white ball flying around my car.",
      "city": "cleveland",
      "shape": "circle",
      "date": "2016-04-15T00:00:00",
      "story": "there was a white ball flying around my car. I was at work looking at camera because I'm a security guard I noticed a white ball flying backwards and all kinds ways..there nothing to explain it..",
      "link": "http://www.nuforc.org/webreports/126/S126715.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c60b0",
      "summary": "Orange flying ball with shapes of light spinning around it.",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2016-09-30T00:00:00",
      "story": "Orange flying ball with shapes of light spinning around it. As we were standing out side of our office building (The city club building), a round orange object came down from the sky, almost like a comet, then it just stopped directly over our building and we could see small shapes on it spinning.  We video recorded it as it moved behind another building then hovered beside the PC bank building across from us for couple mins then it shot away towards the lake",
      "link": "http://www.nuforc.org/webreports/130/S130237.html",
      "state": "OH",
      "duration": "9 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61a0",
      "summary": "Partial CLOSE-UP picture of UFO over Oneida Lake, NY. 8/24/16 @ 6:31am",
      "city": "cleveland",
      "shape": "other",
      "date": "2016-09-09T00:00:00",
      "story": "Partial CLOSE-UP picture of UFO over Oneida Lake, NY. 8/24/16 @ 6:31am The morning of the 24th we left dockside @ apx 6:10am in a rented 10 person pontoon boat (with the top folded down completely). After clearing the warning buoys in the bay we proceeded out and head due west at full speed. We were heading for the 2 large islands on the west end of the lake. The trip would take apx 35-40 minutes. The sun had not come up yet but as it did begin to rise we took a few pics (Iphone 5S) (while moving). I was driving the boat, but at a slow speed. I turned around to snap a few pics of the sun which was in full beautiful view, and ended up with an excellent picture of the sunrise. at this point we were well out on the lake with only the water around us and the sky above. A week later as I was reviewing my pictures and posting them to facebook, I noticed that I had captured something in the picture that we were not aware of during the fishing trip. The object is on the far left middle of the pic, and appears higher than us and above the water. The picture does not show the entire craft, only a portion of it...but you can see structure to it, and It has  definite angles to the design, and you can see the rising sun shining on it / illuminating it. We heard nothing that morning except the wind, waves and the roar of the boats motor. We saw nothing other than the sunrise... I have zoomed in on the object and it is not a \"normal\" saucer shaped UFO, but it does have well defined surfaces that reflect light. The ufo appears to be following or passing us on the starboard side of the boat and behind us apx 100 yards?. There were 3 others in the boat with me, and subsequently i requested copies of their pics. In 1 of those other pictures taken apx 3 mins prior to my photo i found a picture of the sunrise that also includes the skies and the clouds behind us. Upon zooming in there appears to be an octagon shaped object in the clouds. I \"theorize\" it traveled from the clouds to a position behind us in a matter of 3 minutes. None of us recall experiencing missing time, marks on our bodies ect... It was quite a surprise to me, to see this thing.  Also the pictures are high resolution images....and we caught no fish!   If anyone @ NUFORC has questions, feel free to call.",
      "link": "http://www.nuforc.org/webreports/129/S129801.html",
      "state": "NY",
      "duration": "snap of camera"
    },
    {
      "_id": "64d005f478aba2ec5a3c68e0",
      "summary": "Looked like a brighter star almost blueish, was zig zagging and then would dance around.",
      "city": "cleveland",
      "shape": "light",
      "date": "2017-03-23T00:00:00",
      "story": "Looked like a brighter star almost blueish, was zig zagging and then would dance around then another light darts and up and joined bouncing around.",
      "link": "http://www.nuforc.org/webreports/133/S133187.html",
      "state": "TN",
      "duration": "49 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c695a",
      "summary": "White cylindrical shaped craft hovering motionless above downtown Cleveland.  Have video and pics.",
      "city": "cleveland",
      "shape": "cylinder",
      "date": "2017-03-10T00:00:00",
      "story": "White cylindrical shaped craft hovering motionless above downtown Cleveland.  Have video and pics.",
      "link": "http://www.nuforc.org/webreports/132/S132973.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ebd",
      "summary": "Looked like fireflies in the sky moving East over 50.",
      "city": "cleveland",
      "shape": "fireball",
      "date": "2017-08-17T00:00:00",
      "story": "Looked like fireflies in the sky moving East over 50. Sitting on the porch and an enormous amount of reddish, but twinkling, flying crafts where heading east, first moving as if in formation together like a group, but close, then the other crafts came lingering behind heading the in the same direction flashing and a few hovering.",
      "link": "http://www.nuforc.org/webreports/135/S135663.html",
      "state": "OH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6f48",
      "summary": "What caught my attention first was it looked like a twinkling star but colorful.",
      "city": "cleveland",
      "shape": "flash",
      "date": "2017-08-24T00:00:00",
      "story": "What caught my attention first was it looked like a twinkling star but colorful. It had mostly a red light and sometimes a green light going around in a almost elliptical pattern.  When growing through a pair of binoculars the lights were much like the brightness of led lights.  To the bottom left to right were flashing white lights brighter than an aircraft and would disappear, shortly after appearing",
      "link": "http://www.nuforc.org/webreports/135/S135828.html",
      "state": "TN",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7772",
      "summary": "Two fighter jets flying at very high speed from Lake Erie south over a neighborhood just west of downtown Cleveland. They disappeared t",
      "city": "cleveland",
      "shape": "unknown",
      "date": "2017-12-04T00:00:00",
      "story": "Two fighter jets flying at very high speed from Lake Erie south over a neighborhood just west of downtown Cleveland.  They disappeared to the southeast.  I, and some other ground observers, wondered what they were chasing, or where they were going.  Weird.  This is not a typical aircraft exercise area.  No.  No UFOs seen.  Just in case someone else saw something at that time in the Cleveland area.",
      "link": "http://www.nuforc.org/webreports/137/S137396.html",
      "state": "OH",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a8e",
      "summary": "They were moving so fast, I couldn't catch all of them on camera, I tried to pull the video up on My phone and it was gone.",
      "city": "cleveland",
      "shape": "circle",
      "date": "2017-11-09T00:00:00",
      "story": "They were moving so fast, I couldn't catch all of them on camera, I tried to pull the video up on My phone and it was gone. The UFOs came from east to west of downtown Cleveland, the height was about 6,000ft, the speed was about a helicopters speed.   Here's what happened:  I looked up at the sky and the UFOs almost 20 of them visible to me, were behind each other in a very organized way.  As the group of UFOs were moving, they had a blue looking light next to them.  While the rest of the aircrafts/UFOs were leaving I tried to take pictures of them, but I only caught two on my camera; they headed north above Lake Erie, my estimation is that they went up to 10,000 ft and higher where it isn't visible to a human eye.  I tried to record all this and when I went back on my gallery the video was gone, I was pretty sure I took.  My friend sent me the pictures she took, instead. ((NUFORC Note:  We spoke via telephone with the witness, and he seemed to us to be quite serious-minded.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137152.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7bf4",
      "summary": "I was walking out to car for my break seen a white ball streak down from the sky real quick in the south next to Cleveland Airport i al",
      "city": "cleveland",
      "shape": "circle",
      "date": "2017-10-05T00:00:00",
      "story": "I was walking out to car for my break seen a white ball streak down from the sky real quick in the south next to Cleveland Airport.   I also have a video i took a couple weeks ago have time and date there was like a tunnel in the sky cut right through the clouds across hole horizon in the video you can see what looks like I jet going thru the tunnel and looks like it disappears but tunnel stay across the sky if you'd like to see it let me know I've showed people know one could explain or ever seen anything like it.",
      "link": "http://www.nuforc.org/webreports/136/S136437.html",
      "state": "OH",
      "duration": "~2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c6f",
      "summary": "Caught two bright UFOs.  Strange smaller objects seemed to appear out of nowhere nearby, ONLY in the pictures!",
      "city": "cleveland",
      "shape": "other",
      "date": "2017-09-28T00:00:00",
      "story": "Caught two bright UFOs. Strange smaller objects seemed to appear out of nowhere nearby, ONLY in the pictures! I looked out my window at 2:00am witnessing a bright light in the sky between an opening through the leaves of a large tree in my backyard.  The light was larger than any star in the sky.  It was larger than any visible planet.  As I watched it, I noticed it was moving.  With the help of the leaves, I could tell the pace of the movement more easily, because it disappeared behind the leaves.  It moved faster than stars in the sky, but much slower than airplanes, satellites, etc. So, I grabbed my good camera and tripod and ran to my back porch.  I found openings between leaves and branches by standing, kneeling and in between then adjusted my tripod, zoomed in 30x, and began snapping pictures.  It seemed to first be moving upwards in the sky. So I would have to adjust my tripod higher up.  Then it started on a slow path downward on what I believe was about a 150-160 degree angle.  Eventually it seemed to stop and go straight downward, at a 90 degree angle, for the remainder of the sighting.  I ended up having my tripod go from all the way down, to all the way up, then all the way down again. I almost felt like the object wanted to observe something on the ground, maybe the nearby airport, or maybe the NASA Glenn Research Center, within 5-7 miles south of the objects.  It moved slowly enough for most to not think twice when seeing it, maybe thinking it is just a large bright star.  Although it was definitely larger and closer than even the largest star that can ever be observed in the sky, from the ground that is.  I have been studying UFOs and E.T.s  for a year now, since my first sighting.  So I definitely noticed that I was seeing something different here.  I see things all of the time but this is by far one of the coolest sightings I have had. I focused on this object that usually remained red and blue in the pictures pulsating fast in a pattern of red, white, blue.  What I found very strange, were these smaller copper/silver colored objects that appeared only in the photos near the main object. I did not see these objects myself at all, but they were obviously there.  Then I noticed another object very similar to the main one I was already snapping photos of.  This one however, seemed to be blinking fast between the main colors of orange/red, white and yellow rather than red, white and blue.  The last photo attached is of the orange object. I observed these objects between 2-3am. I do not know of a man made or known space object that moves the speed and direction that it did and looks like the pictures I have attached.  The whole time I felt that I was witnessing something really special.",
      "link": "http://www.nuforc.org/webreports/136/S136359.html",
      "state": "OH",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ee5",
      "summary": "Truck driver reported a flying black square but saw no aircraft pulling it.  ((MUFON report))",
      "city": "cleveland",
      "shape": "other",
      "date": "2018-05-04T00:00:00",
      "story": "Truck driver reported a flying black square but saw no aircraft pulling it. The man was driving his work truck north on Route 77 towards downtown Cleveland when he saw what he first thought was a banner advertizement.  However he couldn't see an airplane and the shape was a very large black square.  The picture he took was from his cell phone while driving.  The object appeared to be over Lake Erie.  The object is a little hard to see, but is to the right of the telephone pole.  According to the witness the object was probably about 2-3 miles away at least. and was descending.  (MUFON)",
      "link": "http://www.nuforc.org/webreports/139/S139695.html",
      "state": "OH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c89d1",
      "summary": "3 red light triangle which broke into single lights then more red lights and a possible bigger craft.",
      "city": "cleveland",
      "shape": "triangle",
      "date": "2019-09-06T00:00:00",
      "story": "3 red light triangle which broke into single lights then more red lights and a possible bigger craft. Saturday, 8/24/19, 9:40pm EDT over the West Side of Cleveland.  I was sitting outside doing a fire pit in my back yard with one of my neighbors.  I'm in the West Park area of Cleveland, but almost in Brook Park, not far from Hopkins Airport.  My neighbor was sitting facing the right direction, ENE, to see it first. I was facing N.  She said, \"Hey, look at THAT, behind the trees!\"  There was a triangular formation of 3 steady solid red lights.  I'd guess ENE at about 55 degrees on the compass, and maybe 25-30 degrees above the ground.  I think the triangle was pointing down, with the 2 lights on top, and 1 below.  Was so excited, I don't remember for sure, but definitely was a triangle.  She can't recall either. The formation finally came over the trees, but was much higher up, going WSW about 250 degrees and seemed high in the sky.  They were completely silent.  Took maybe a minute or less to transverse the sky, I don't know how high up they were. I would say the triangle was the width of 2 full moons.  The formation broke up into the lights being side by side  after being just overhead, but a little to the north, and got dimmer and somewhat translucent as it went toward the WSW.  2 more red lights came from the ENE, side by side, and went the same way, then 2 more dimmer ones the same way.  Then my neighbor then said, \"Look\", pointing slightly in the WSW direction, I couldn't see it. maybe my eyes couldn't adjust looking over the bright fire pit, but she said a round red light maybe 20X as big, she called it \"the mother ship\" but she said it was very dim and could hardly see it herself, with the other red lights surrounding it, all moving WSW and just faded as to the WSW she said.  I thought all the lights were faded and gone by the tine she seen the big dim one.  Looked to me on the ones I could see, they were going just maybe slightly north of Hopkins Airport and still high in the sky. The West Side and maybe downtown had to see it.  I tried video recording it on my phone, but my screen was pitch black, phone not good in the dark.  Later on I seen at one point I got 2 faint dots, what I assume were the top 2 lights, the bottom light must have been hidden by the trees.  That's all I got as nothing showing in my viewing screen to aim at as it was moving.",
      "link": "http://www.nuforc.org/webreports/148/S148501.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b1c",
      "summary": "UFO and the blimp",
      "city": "cleveland",
      "shape": "disk",
      "date": "2019-03-14T00:00:00",
      "story": "UFO and the blimp Reviewed a picture I took of the blimp, it’s a “live” picture from an iPhone 6Splus.  Clearly shows the UFO enter from the bottom of the screen quickly up and slightly to the left,  in the still shot the nose of the blimp points directly at thevUFO.  I’ve had multiple sightings of UFO’s in Cleveland and over Lake Erie.",
      "link": "http://www.nuforc.org/webreports/145/S145151.html",
      "state": "OH",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8c01",
      "summary": "Drone with green lights.",
      "city": "cleveland",
      "shape": "other",
      "date": "2019-02-14T00:00:00",
      "story": "Drone with green lights On this evening I was outside on my phone, when I heard what I thought was a military cargo plane flying over.  It wasn't.  It was a giant drone.  It was black and had green lights on all four arms.  It was very loud.  I could see it was a drone.  It flew over my house and over the mountain it moved very fast.  About 5 minutes later a small private plane flew by in the same direction of the drone.  It scared me.   A few nights later I could hear the noise of the cargo plane coming.  I ran outside to see and it was the cargo plane but it now has green lights on it.  Very strange.  Cargo planes have red lights.   Some friends of mine came by last night to visit and they mentioned to me that they were out the other evening and seen a huge drone the size of a full size pickup flying from the high country over to the feilds where I live. It was quiet according to my friends.  It then flew back over the mountain.  The drone I seen was big.  Maybe the size of two full size pickups.",
      "link": "http://www.nuforc.org/webreports/144/S144857.html",
      "state": "NM",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c9355",
      "summary": "lIGHT AT SOME SPEED, two similar lights shot out like dolphins jumping parallel to esch other. 12 min obsersance.",
      "city": "cleveland",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "lIGHT AT SOME SPEED, two similar lights shot out like dolphins jumping parallel to esch other. 12 min obsersance. Oct 28 2019 cleveland/lakewood ohio i saw a sky distant looking North towards lake Erie , white not of a glowing light (no actual shape),observed in perfect blue non cloud sky, no emission,sky sunny day not gloomy. 12 pm noon just happened to look into sky, saw something white, perhaps glowing, it at first was stationary in sky, distance unknown stationary began to move N.E. direction in sky at somewhat fast speed then lost altitude, It at first appeared to my  left then this movement brought it before me but at a distance.  i watched aprox 12 minutes, it moved to place it dropped/settled among tree branches of the distant tree , sort of like hiding from view it bobbed up/down among a branch  exposing itself then hiding from my view a couple of times, THEN as a very fast observance perhaps that of a a full second two similar light of same intensity and similar sized objects moved quickly away from the main object as if two parallel dolphin in a  arcing diving paths and disappeared from sight into the far from view tree branches then the object moved to the very end of the branch, being slightly observable and stayed for minutes where  stationary by staring i could discern it  a bit among the branch there was a plane moving through sky during the viewing ( the lake Erie being about a mile away) ,as it came harder to see i just gave up viewing it moved on eastward through the parking lot. i was in a grocery store parking lot end with virtually no traffic just parked cars of the viewing, i moved about 60 yard moving to the stores entrance door i looked up and saw it again stationary lurking at another tree at the very edge of the distant branch, then gazing a while i could not discern it by sight any more. That was the observance ( i made a report to mufon today) This is my lifetime 4th sky sighting 1 70's, 1 80's 1 90's",
      "link": "http://www.nuforc.org/webreports/150/S150019.html",
      "state": "OH",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9524",
      "summary": "Huge oval craft over urban area",
      "city": "cleveland",
      "shape": "oval",
      "date": "2019-12-19T00:00:00",
      "story": "Huge oval craft over urban area I was on my way to work around ^:10 am via bicycle in the morning of December 1st on Lakeview Road near Superior.  I stopped at a market to buy cigarettes.  I had to be at work by 7 am. WHen I came out of the store something caught my eye right above me.  I got on my bike heading north when I saw an oval craft that was bright orange and then turned white.  It was hovering about 200-300 feet above me.  It was bigger than airplane. Bigger than the Goodyear blimp. It didn’t make any noise. I didn’t feel any heat from it.  It “followed” me to work.  I even called my wife while it was happening.  I was scared.  It didn’t throw a light on me.  It was moving back and forth, right to left, swiftly and back again.  It would brighten and then darken.  I saw it do this about four times.  When I arrived near where I work it moved off heading north but the lights kept coming on and off.  I think it then headed east then toward Wickliffe.",
      "link": "http://www.nuforc.org/webreports/151/S151449.html",
      "state": "OH",
      "duration": "5-6 minutes"
    }
  ]
}