{
  "city": "coloradosprings",
  "fetch_timestamp": "2025-07-12T14:32:32.167811",
  "record_count": 181,
  "pages_fetched": 9,
  "api_calls": 10,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b42c6",
      "summary": "colorado springs, colorado saw  a object at night 3 multi-colored lights",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "colorado springs, colorado saw  a object at night 3 multi-colored lights at the time of this i was 15 years old(i am 16 now) and i was on vacation in colorado sping, colorado. i was staying in a hotel in..manituo?(that is spelled wrong) manituo springs. my mom said i HAD to go to this place called \"flying w ranch\" or something like that. and really i didn;t care to be there. there was this thing that some people sang unill maby 11:00 pm.. pretty late. and i was pretty bored so i looked at the sky at about about after the first hour it starts wich was 7 or 6. since it was the mountains and i live in kansas it was beautifull to me. so basicly i ignored the music and look at the sky and the sunset. at about 9 i started try to spot out differant conssilations. i looked at oryans bet and i saw something wrong. there was an extra star. so i thought maby a sattilight off track or something because it looked like it was moving like a weather sattlight. but then it shot a littil ways to the north. i thought wow...that is a weird air plane. and didn;t think anything of it. but i kept looking at it because then i noticed the star was more than one. it had three lights and they were differnt colors. one was blue i am shure of it. one was redish orange something of the mix. and other was greenish yellish coler. at that time i thought it was simply a very advanced jet the air force  had built. for as i had been told that area had a air force base near the area. then i was the craft shoot south. in a small triangluler shape.( if u conected the places it stoped) (the whole time i was wathcing it it seemed to be shaking or vibrated very fastly but not enuff to distort was i was seeing. (the whole time the craft was in the northern sky) every time it changed postions i looked farther than it went because it moved so fast i thought there was no way it could move that fast and stop so fast. (it moved so fast my eyes barly registerd that it moved) but anyways at it had moved in the northern part of the triangle it slowly seemed to be moving up maby farther from the atmospere. it;s very hard to explain. but the lights begain fading but not because of distance more of the width of the circles of light. the width begain getting slimmer and slimmer. and the lights begain changed shades to darker. and the craft all of a sudden shut of the lights. but i could still see it was there.( like black on black) the only way to describe it was that some people have good enuff eye sight to see the part of the moon that isn;t being shone with light from the sun. baslicly like that. as i stated into the darkness of the craft in a split second it seemed to dissapere and i saw a few stars the apperd (normal stars) kinda like something was blocking it. aka the craft. when my mind finnaly register that i had seen somewthing i coudn't explain i kept thinking of aircrafts that might be simmiler to what i have seen. the only thing i could think of was the airplanes developed by canada that looked simmiler to a sauser. but this WASN;T round at all. defanlty a triange the lights that i saw iluminated parts of the ship. it was gray. i didn;t hear any sound cuz them dumb hillbillys were too loud. haha oh also i am sending a crrapy drawn picture that might help explain it if possable please call me or get back to me i would like to talk and further explain. ASK FOR ((name deleted)) OR U WILL NOT GET TO TALK TO ME thank you and i hope u consider me not crazy hahah.",
      "link": "http://www.nuforc.org/webreports/050/S50131.html",
      "state": "CO",
      "duration": "1-3 minets"
    },
    {
      "_id": "64d005f478aba2ec5a3b4366",
      "summary": "Camera like flash of light that lit up the sky followed by a second flash",
      "city": "coloradosprings",
      "shape": "flash",
      "date": "2006-05-15T00:00:00",
      "story": "Camera like flash of light that lit up the sky followed by a second flash ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50120.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4441",
      "summary": "Circular Bright White Flying Saucer",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "Circular Bright White Flying Saucer I saw a circular flying saucer just last week. I didn't find this site until now to report it. The saucer was bright white and it impossibly flew really fast in circles, which aircrafts couldn't normally do. It was too far away to notice the details on the saucer, but I can tell it wasn't an airplane. It flew over the airport in Colorado Springs. Couldn't the people at the airport have detected the saucer? ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50020.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b45a6",
      "summary": "This one is no obect- it moves about and doesn't seem to ever need any sleep though.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2006-05-15T00:00:00",
      "story": "This one is no obect- it moves about and doesn't seem to ever need any sleep though. This one Extra-terrestrial has been an annoyance now for over a week.  I'm sure it's a male though.  It's not very friendly but at least it's better than the other one.  It seems to need to try and make that it's a human being!  He doesn't have me convinced.  That room is supposed to be vacant and he's making noises and was it seems constanly dropping those.  A few weeks ago I heard some craft fly over making that old harmonica melody I used to play when on board.  They must have left it off to annoy me when in here is where I stay.  Is there any number to UFO police in this website?  I checked the 2nd box from the botton in the list of characteristics because it's closest but should be : there was an aircraft in the vicinity that seemed extraterrestrial but left and that is why I am reasonably sure that they left him someplace above.",
      "link": "http://www.nuforc.org/webreports/050/S50275.html",
      "state": "CO",
      "duration": "while I am in here"
    },
    {
      "_id": "64d005f478aba2ec5a3b484f",
      "summary": "Multiple Orbs dancing over Garden of the Gods Colorado Springs CO",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2019-06-07T00:00:00",
      "story": "Multiple Orbs dancing over Garden of the Gods Colorado Springs CO We decided to hike Siamese twin trail in Garden of the Gods.  When we got to the formations we looked down into the valey out at the mountains.  I noticed a white light in the distance that looked like a star begin to blink.  Then I seen 2 lights begin to blink about a mile or so high maybe higher.  And then 4. And then it began multiplying even more looked to be 10 or 15 maybe 20.  Many white lights dancing around each other very fast in formation together at very high altitude.   I pointed this out to my mom and girlfriend.  My girlfriend said she thought they might be birds and I said that wasn’t birds.  It was too high and they were shining like metallic moving very fast. I reached in my pack for my binoculars and like that they disappeared.   My girlfriend took two photos after that where you can notice 2 blue orbs moving with trails behind.  We are sure now it wasn’t birds!",
      "link": "http://www.nuforc.org/webreports/146/S146160.html",
      "state": "",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a10",
      "summary": "I saw a light in the sky that I assumed was a satellite or aircraft. After observing the light more closely, I noticed it was flying in",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2019-07-25T00:00:00",
      "story": "I saw a light in the sky that I assumed was a satellite or aircraft.  After observing the light more closely, I noticed it was flying in a strange zigzag pattern.  It looked like a light far into the distance.  I only saw one and tried to capture it on video but the video quality was terrible.  I ran outside as quickly as I could but it disappeared.",
      "link": "http://www.nuforc.org/webreports/147/S147707.html",
      "state": "CO",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b1d",
      "summary": "3 black circles fell out of the sky. Hovered then spiraled down with a smoke trail.",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2019-07-05T00:00:00",
      "story": "3 black circles fell out of the sky.  Hovered then spiraled down with a smoke trail.",
      "link": "http://www.nuforc.org/webreports/147/S147148.html",
      "state": "CO",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b8c",
      "summary": "Soap bubble looking objects flying high in the sky.",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2019-07-12T00:00:00",
      "story": "Soap bubble looking objects flying high in the sky. While taking our dogs for a walk, we saw what we first thought were white bubbles or birds really high in the sky.  They were way too high to be birds.  They started circling and moving in different patterns.  They looked like soap bubbles.  They moved across the sky and disappeared.",
      "link": "http://www.nuforc.org/webreports/147/S147482.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cc5",
      "summary": "One White Object Omitting Zero Noise Flying West To East Over Colorado Springs.",
      "city": "coloradosprings",
      "shape": "changing",
      "date": "2019-06-07T00:00:00",
      "story": "One White Object Omitting Zero Noise Flying West To East Over Colorado Springs. I was in my backyard around 9:45 a.m. on May 29, 2019, when I noticed something odd flying in the sky.  It appeared very white against the bright blue morning sky.  The object was flying from West to East.  Just to my west is the Front Range Rocky Mountains and Mt. Cheyenne. It did not emit noise that I could hear.  It flew in a very straight line. The object had zero lights.  No wings or tail. It did not waiver up or down.  It did not tilt side to side.  Just flew in what appeared to be a straight line. Wanting to catch it on film, I ran inside my home and grabbed my iPhone.  I was able to record the object on video.  The video is terrible (of course ) as I couldn’t see it (the object) in the sky through my screen so I moved the camera around a lot but the camera was able to record it. When it flew behind (in?)(through?) a white cloud it was still visible although the top of the object appeared to become more white and domed-shaped with the bottom becoming rounder in appearance and darker. On video, when it comes out of the cloud it then looks to be 3 spheres in a close triangle formation. The video when slowed down and zoomed or viewed frame by frame is the best way to see it, but after a hundred times once you know what you’re looking it’s clear as day.",
      "link": "http://www.nuforc.org/webreports/146/S146496.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fe8",
      "summary": "Noticed an object hovering silently high above just northeast of Peterson AFB.  Too far to identify shape.  ((anonymous report))",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2019-03-29T00:00:00",
      "story": "Noticed an object hovering silently high above just northeast of Peterson AFB.  Too far to identify shape or details.   At first I thought perhaps it was a white plastic bag that may have been swept up high or a balloon.  Then it occurred to me that if it were, at that height, it wouldn’t be visible.   After about a minute or two of hovering it started to move southwest towards Cheyenne mountain.  It was below the high clouds and the sky way mostly clear and sunny.  The white object then appeared black as it continued its trek SW.  There was no sound, no contrails, and no other aircraft. I filmed a few seconds of it with my iPhone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145319.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b500e",
      "summary": "Strange moving stars or satalites.  ((Starlink satellites?))",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "",
      "story": "Strange moving stars or satalites I noticed a line of stars in the sky .... Then noticed that they was moving east from the West the first one disappearing as another appeared behind the last. That happened 5-10 times before I had to start driving",
      "link": "http://www.nuforc.org/webreports/151/S151812.html",
      "state": "CO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b56c6",
      "summary": "Triangular black craft in broad daylight hovering high and then speeding off.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "Triangular black craft in broad daylight hovering high and then speeding off. This sighting has stuck clearly in my memory for 20+ years although I only occasionally thought about it over the years as you hear about UFOs.  It was a sight where you instantly know this is something extraordinary and not what our brains are used to processing and seeing.  I never really investigated anything more about it over the years because the craft I saw was triangular and I never heard of anyone seeing such a thing.  Until yesterday.  I watched a cable special about the UFO incident in 2000 near St. Louis with the various officer sightings of a black triangular object.  I then checked the internet to see about sightings in Colorado at roughly the same time of mine.  I have goose bumps again to see so many similar sightings from seemingly credible accounts.  My story is brief but it left a permanent record on my mind.  I can't remember the exact date but it was in the early 1980s and I was a passenger in a car with my brother driving.  We were on a small street road near our house and it was daylight and very clear.  As we were driving, I casually glanced at Pikes Peak which occupies a large part of the mountainous view in Colorado Springs.  Near the top (above treeline) and slightly to the right of Pikes Peak was a triangular black object that appeared to be rotating.  It was close to Pikes Peak and probably 5 miles from me - line of sight.  I could tell it was very large given its relative dimension to Pikes Peak just behind it.  Had this been at night I could have dismissed it as any possible craft but being a clear day I was instantly startled as to what this was.  I had a good familiarity with military aircraft with my father in the Air Force and growing up in Colorado Springs near the Air Force Academy.  As I stated, the fact that it was triangular and didn't seem to have any other discernable shape or markings, I was amazed at what this might be.  I immediately told my brother to look and even told him \"stop the car\" and look.  By the time he finished asking \"what is it\" and stopped the car, I watched it disappear at an incredible speed over and behind Pikes Peak.  I never saw it or anything like it again but after reading these accounts I felt I had to add my story to the many accounts listed.  I am shocked to see many accounts even older than mine of similar sightings which indicates it could not have been any kind of experimental military craft.  I hope one day I can find out what it was and solve the mystery. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54859.html",
      "state": "CO",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a57",
      "summary": "A invisible craft with a blue flame[s] behind it.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "A invisible craft with a blue flame[s] behind it. I didn't exactly see a craft, it was, invisible. All I saw was a blue flame[s] behind, nothing. I could tell by the flame[s] that it was more than close enough to see the craft, but I just couldn't see it! It was moving fairly fast, but I couldn't even hear it. It was near Cheyenne Mountain, NORAD. Over a school called Pikes Peak Elementary.  As you know from the form, I've been waiting a year to tell someone.    If you find anything, it probably won't be much.  I was the only on the playground when this happened, so if you don't believe me because I'm the only one that saw it, then I'll understand. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61301.html",
      "state": "CO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5ac1",
      "summary": "V shaped  object  spotted in night sky",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "V shaped  object  spotted in night sky At about 10:00 or 10:05 pm on Nov 5th I was outside waiting for my dogs to finish their business. I always gaze up at the night sky. I observed in the north sky a boomerang or triangle shape with many lights.. As the object came closer above my house the lights began to breakup out of formation, kinda of dancing.  It then formed back into the V shape.  I watched it disappear into the south sky.  I thought I must be crazy!  I just stood there... about 2-5 mins lapsed, and I turned around to the east sky and looked up and it had circled around again.  Same thing was happening...  The lights broke out of formation then back into the shape of a boomerang or triangle. This time it disappeared into the west sky.  I watched for many more minutes thinking I might see it again.  Nothing, I know what I saw was really there. I wonder if anyone else saw it in Colorado Springs?",
      "link": "http://www.nuforc.org/webreports/061/S61523.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e03",
      "summary": "2 bright white lights seeming connected flying faster than any plane or military craft;.then disappeared.  ((NUFORC Note:  ISS??  PD))",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Two bright white lights seeming connected flying faster than any plane or military craft...then disappeared. We were sitting out in front of our house for our evening chat when my husband noticed two extremely bright white lights traveling in the same path from the NW to the SE. The lights were the same distance apart and never got closer nor further apart. There were no flashing lights to indicate a commercial aircraft and were moving faster than any plane or satellite we have ever seen in every evening chat we enjoy. The objects flew behind translucent cloud cover and remained bright then suddenly dimmed out and disappeared. ((NUFORC Note:  Space Shuttle w/ ISS??  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57172.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5eba",
      "summary": "an ambiant spotlight type object that flew very fast for 5 seconds heading from North to South then vanished.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "an ambiant spotlight type object that flew very fast for 5 seconds heading from North to South then vanished. I saw what looked to be an spotlight type of light that moved extremely fast moving from north to south. I would say it looked like a spotlight except there wasn't any clouds where I saw it moving and it dissappeared quickly. seem to be flying low. Had the shape of a circle but was not connected, looked as if the circle of light was cut in half. There was a left side and a right side not connected together if that makes sense. I have seen this before 8 months ago and seem to have the same elements as before.",
      "link": "http://www.nuforc.org/webreports/063/S63004.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b668a",
      "summary": "UFO in Colorado Springs/Manitou Springs area",
      "city": "coloradosprings",
      "shape": "oval",
      "date": "2006-10-30T00:00:00",
      "story": "UFO in Colorado Springs/Manitou Springs area I was pulling into the HP parking lot and was blinded by what appeared to be an airplane at first.  I thought to myself \"man this plane is flying awfully low to make a turn into the airport.  This thing was in the proximity of Manitou Springs area and litterally blinded me.  I slowed to a halt and could see it was very clean silver in color with lights around the base.  IT NEVER MOVED from hoover position.  I turned to gain a better vantage position but lost site of it as I moved down into a troft like position in the parking lot.",
      "link": "http://www.nuforc.org/webreports/052/S52228.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b678d",
      "summary": "A saucer, flying only about 50 feet in the air, right above the middle of Colorado Springs.  ((NUFORC Note:  Student report.  PD))",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2007-11-28T00:00:00",
      "story": "A saucer, flying only about 50 feet in the air, right above the middle of Colorado Springs. I've never believed in the existence of UFOs until now.  Yesterday, at about 8:50 PM, I was driving eastbound on Academy Boulevard (this is a major road of Colorado Springs, and goes right through the middle of the city), when I saw a few lights floating above a shopping center right next to the road. I was traveling about 35-40 mph at this time and got closer to it quickly.  Within a few seconds, I realized that the lights all belonged to the same object, and were then slowly moving above Academy, only about 50 feet in the air. It came at an angle towards me (or perhaps I was just moving towards it faster than I thought), and for about five seconds, it was close enough for me to see the details of it. It was the classic saucer shape, with maybe 6-8 white lights around the circular base of it, and one white light at the top. The top, however, was pointed as if a large cone were placed on the top of the main saucer part. It was dark, but I'm fairly certain that the UFO was black or dark grey, and probably the equivalent of 2 or 3 cars in total mass. After about five seconds of it floating only about 50 feet away from me, it banked and did a u-turn, flying away at a much higher speed than it had been before (although it was impossible to estimate the speed at night in those conditions, its accelaration was definately much more than a helicopter could have managed). I saw the lights of it for a few seconds more, then lost it within the glow of the city. I would guess that there were many more witnesses (it was a busy city street, after all) and there should be more reports on the same saucer. Yes, this did happen on halloween night, and I wouldn't have believed it if I hadn't seen it so clearly (it may as well have landed and let me walk up and touch it), but it was very frightening because of what I might have just witnessed. Technology like that that we don't know about scares me and makes me wonder what else the government has in terms of power. I still don't believe it was extraterrestrial, because the statistical chances of that are improbable almost to the point of impossibility, but the fact that it exists at all is fairly horrifying. ((NUFORC Note:  Student report.  We would welcome reports from any other witness.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59555.html",
      "state": "CO",
      "duration": "2 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6bb5",
      "summary": "Air Force fired projectiles of some sort at alien craft and hit them directly, causing all of the craft fired upon to hit the ground.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "Air Force fired projectiles of some sort at alien craft and hit them directly, causing all of the craft fired upon to hit the ground. I witnessed for the first time the most unbelievable thing that proves something I didn't believe in before I witnessed it occur. The United States Government scrambled jets to intercept groups of alien craft all day long as I sat and watched it from my living room window. I am in such disbelief, because like I said I was not a firm believer in life outside of our own planetary system. It is the truth, the craft I saw moved so quick, made no noise, but our craft being F-15 fighters I believe or something similar in nature, we able to use their weapons systems, perhaps modified systems, and shot them down...catching flame and landing in the mountain range of the Rocky Mountains. The craft, all 9 of them, fell from the sky when our weapons hit them, which indicated to me that in fact they were destroyed. Right now I am certain that because it did not make the news, that there is a top secret cover up, naturally the government wanting to keep this under wraps and I can understand the reasoning. The craft kept appearing, making me believe that we were not being successful in hitting them with our weapons systems. I saw trails, indicating something was fired from our craft towards theirs. Then I saw two craft together, indicating to me that in fact we were destroying their craft afterall, since they struck both craft together and they fell to the ground at a fast pace. The total number of planes of our aircraft varied throughout the day as they scrambled to attack them, but they arrived quickly and to my surprise given that our craft appear to be such lower in technology than theirs...but to my surprise again, simple systems of weaponry brought down what must have been intruders in our airspace and caught or detected by Space Command or Norad, or some other top secret detection facility...I'm convinced that we must have such things now that I am convinced that we've had bad visitors from outerspace. Their craft were triangular in shape, could move in any direction in an instant, but for some ! reason t hey weren't able to duck and weave whatever weapon it was that the United States Air Force was firing upon them, which was something unconventional you could tell by their streams that they left in the air...very different looking, almost as if to trace the location of the missiles from start to finish. I believe, knowing weapons systems very well from the Reagan era that are in use today, despite treaties, that satellites lit up the craft from the sky up high, and the missiles were guided directly to their targets without fail. I did see one alien craft seem to disappear in an instant, or it traveled from its location in an instant. All 9 craft that I saw were hit and fell to the ground behind some mountains. All scrambling jets ceased to fly once they were shot down, but it's not reported in the media and I haven't heard of anyone else seeing what I saw. So I do know it's being covered up in large scale. This is not the first sighting I've had with triangular craft. A group of about 7 or so flew directly over my condo one night, had zero noise in propulsion, flew very slow, and were lit up from beneath for all to witness, didn't seem to be afraid of showing themselves off. This event was in Lakewood, CO at the time probably 2 years ago.",
      "link": "http://www.nuforc.org/webreports/055/S55818.html",
      "state": "CO",
      "duration": "1 day"
    },
    {
      "_id": "64d005f478aba2ec5a3b7105",
      "summary": "Witnessed multiple low flying triangular crafts with bright lights outlining its shape. Seen near military base.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2008-02-14T00:00:00",
      "story": "Witnessed multiple low flying triangular crafts with bright lights outlining its shape. Seen near military base. When traveling home on Highway 85/87, I witnessed a large, low flying, black triangular craft traveling sideways. The craft had multiple lights on its underside, placed in a triangular pattern, as well as outlining the craft. I turned onto another road, and followed the craft east. I saw nothing for about 4 or 5 minutes, then out of nowhere the craft floated above my vehicle. I pulled my car over, and watched as the craft slightly descended and glided over me. At this moment I determined that this could not be an airplane, as I could clearly see the entire outline of the craft. Upon reaching south Powers Boulevard, a second craft appeared, identical to the one previous. This craft again descended and glided over me. I became panicked as the craft continued to move in my direction. I turned my car around and began to travel west, towards my home. Eventually the craft ascended away from me, traveling north east. The third craft, identical to the previous two, was barely visible. However it was traveling in the same direction, at a higher altitude.",
      "link": "http://www.nuforc.org/webreports/061/S61435.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b757a",
      "summary": "the second object appreared suddenly, then flickered out as the first object returned the way it had come.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "the second object appreared suddenly, then flickered out as the first object returned the way it had come. I live in Colorado Springs, Colorado. On Oct. 2, 2007 around 11:00 PM I was outside saying goodbye to a few friends.  As they drove away I looked up at the night stars and noticed something strange.  There was what appeared at first to be an airplane flying east to west toward an area between Pikes Peak and Cheyenne Mountain. The object was flashing red and white lights and was flying in and unusual jerking manner.  It may have been the irregually flashing lights that made it appear to be not flying straight.  A couple neighbors where out walking.  I mentioned what I was watching and they stopped for about 5 mins. and also saw the object.  After watching for about 10 mins. the object moved more south toward Cheyenne Mt. It was over the mountains now.  Then it disappeard for a quick second or two. When it reappeard there were two objects now flashing. They stayed together for only a couple mins.  The first (I think it was the first object) began heading back toward the east the same way it had come.  The other object remained stationary above the mountain.  The object above the mountain slowly \"flickered out\" over several minutes.  The other object continued headed east. As it passed overhead I could make out the shape of the craft by the configuration of the lights. I could make out four distinct lights.  It was triangular. After a few more minutes the object was no longer in my view.  It seemed like the second object became visible when the first object reached it's destination. I have seen similar objects with these kind of flickering lights over Colorado Springs previously.  However, I have never seen one appear out of no where.  They usually just fly a straight path until they're out of sight.  This one had a purpose to it's flight.",
      "link": "http://www.nuforc.org/webreports/059/S59081.html",
      "state": "CO",
      "duration": "20 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b75ed",
      "summary": "Craft near AFB followed aircraft then proceeded south at a constant rate through changes in direction and elevation",
      "city": "coloradosprings",
      "shape": "teardrop",
      "date": "2006-07-16T00:00:00",
      "story": "Craft near AFB followed aircraft then proceeded south at a constant rate through changes in direction and elevation he shape was not clear since the color of the craft matched the sky haze.  The only reason the craft was so visible was the reflection it gave off but the reflection did not show the exact outline.  However the reflection(s) allowed use to visually follow the craft while my friend and I kept asking each other, \"Have you ever seen an aircraft do that?\", over and over.  Al was over Saturday evening and I saw my first UFO.  Craziest thing I've ever seen.  I still don't believe it was an Alien thing but it wasn't any typical aircraft.  The speed and its maneuvering looked impossible.  It chased two planes over the airport going two different directions, dodged another and then dove close to the ground and proceeded south all in 10-12 seconds.  It was at dusk so the sun was going down but shinning on the vehicle.  It was white and no lights of any kind.  It had to be a pearl white or like that reflective 3M white tape or sign material.  It was not shiny metallic but definitely white but a halogen white.  It did not have a vertical stab, rudder and it was a little hazy so there was no way to make out any detail.  There has been a lot of activity at the Ft. Carson and Peterson since this weekend.  My guess is that it is some sort of new flight vehicle and they were testing it.  It was likely also very stealthy so I assume it was likely not picked up on radar, especially considering what it did and the speed involved.  It was directly east when I saw it and farther out than an approach for the airport.  It came around and come up behind the first plane and veered off coming around to approaching the second plane coming in at a right angle to the first plane.  That was an 'S' shape that covered more than 12 miles.  Then it went south and dodged a plane on approach while in a steep dive.  After it came close to the ground it leveled off and proceeded south.  It did this all within 8 seconds, no longer.  It did not seem to lean into turns as an aircraft would and looked like it stayed level.  Neither Al or I could make out its shape except it did not have a rudder.  The only plane that I know that could do this would be an F-22 but there was no sound.  Something maneuvering that fast should have made some pretty noticeable throttling jet engine sounds.  If the F-22 has noise suppression maybe, flying an experimental pattern and painted pearl or reflective white.  My guess and feel after just watching the Thunderbirds at graduation is it was traveling just under mach one.  Also it did not change speed either in the hard maneuvers or when it dove.  It just looked really odd.  Neither Al or I took our eyes off of it until we could not see it any longer and just started laughing.  He's retired Army advanced radar and communications technician.  The F-22 has vector thrust but it makes a lot of noise and it still looses speed in hard maneuvers.  One thing this was not was winged aircraft, even an F-22 with vectored thrust.  It made maneuvers that only a helicopter could make but at a speed that had to be just below mach one at 7000 to 10000 ft. elevations.  The two sincere giveaways that this was a special craft was first it flew over an municipal airport and Air Force Base with no lights and in two flight paths of other aircraft and came very close to the rear of those two plane with no clearance lights or landing lights… all very illegal for either military or civilian aircraft.  The second giveaway was either drastic changes in direction or elevation did not change the velocity of the craft in the slightest.  I am not a believer in extraterrestrials, an engineer and would have to see either an extraterrestrial or their craft closely before I could possibly believe.  Someone owns and operates on incredible aircraft for sure.",
      "link": "http://www.nuforc.org/webreports/050/S50980.html",
      "state": "CO",
      "duration": "10-12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7621",
      "summary": "Fast moving green dot proceeding from west to east and disappearing into black sky.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "Fast moving green dot proceeding from west to east and disappearing into black sky. At 6:40 pm Mountain standard time, I was driving east on Lake Avenue I saw a fast moving green dot enter the sky.  It came in at my mid horizon and then disappeared into a black sky, well before the natural horizon on the flat plain.   The object was small and unidentifiable as to its shape.  It was moving as a fast rate of speed. It had no streak like a shooting star.  The object was directly in front of me moving from west to east.",
      "link": "http://www.nuforc.org/webreports/060/S60064.html",
      "state": "CO",
      "duration": "2 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b767c",
      "summary": "Triangular light configuration indicated low flying hover-craft in fog and snow above Powers Blvd.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "Triangular light configuration indicated low flying hover-craft in fog and snow above Powers Blvd. I was driving south on Powers Blvd in Colorado Springs, headed to the current/new airport to pick up friends who were flying in that evening.  The weather was foggy with a fair amount of snow beginning to fall, accompanied by a moderate breeze.  I'd stopped at a stoplight, located near the old Colorado Springs airport.  To my left (east), about 50 or 60 feet above the ground, I saw 3 identical, white colored, down shining lights (appearing similar to those housed in recessed \"can\" lighting fixtures); they were very, VERY slowly, smoothly hover-gliding forward, together.  Two slender blue-colored bars of light were positioned behind, and perpendicular to the \"nose\" light, but within the boundaries of the triangular configuration formed by the larger 3 white lights.  There may have been a small red light located between and/or just behind the blue bar shaped lights.  Due to the time of night and poor weather conditions, I could not see the body of the craft... just the lights on its under belly.  At first, I thought the lights were reflections on my windshield, but I couldn't determine their source.  I looked at other drivers around me to see if they had noticed the lights but they appeared to be oblivious as the weather/visability was poor and the drivers were concentrating on the stoplight, waiting for it to change from red to green.  The thick fog and snowfall reflected the street and city lights to provide a sort of overall orange glow.  Thinking that the lights were reflections, I remained still, using the frame of my windshield to verfiy that the lights were indeed moving, and that they weren't reflections.  The lights continued to glide, VERY slowly, foward.  The 3 lights formed an elongated, triangle configuration; one round light in front (\"leading\" the direction of movement), with 2 identical round lights behind.  The overall size was approximately the size of an USAF F4 or F15. Since all the lights moved with identical speed and direction at the same time, it seemed probable that they were attached to one body.  There was no noise and the craft's movement left the fog and snowflakes undisturbed.  After moving forward, the hovering craft paused, then VERY slowly, smoothly made a slight banking action to it's right, then slowly and smoothly, (without rotating)it drifted in an easterly direction, to disappear, uncerimoniously into the fog and snowfall.  The craft's hovering was steady and constant, without bounce, shake, waver, list, or yaw; it moved much smoother than a helicopter, seemingly unaffected by the poor weather conditions. It reminded me of a British Harrier, but, again, its movement was much, much slower, unwavering and smoother than that type of craft. The only movement that I can equate this craft's with are those displayed by some 3D computer generated and animated \"futuristic\" design aircraft... only this one was real.",
      "link": "http://www.nuforc.org/webreports/056/S56232.html",
      "state": "CO",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b764a",
      "summary": "while laying in bed a little before midnight a bright red light caught my eye. it was was quite a distance from the window and was  gli",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "while laying in bed a little before midnight a bright red light caught my eye. it was was quite a distance from the window and was  gliding from left to right then centered behind a tree and a very bright white light shined. i woke my fiance and he witnessed the object as well. this repeated for about 10-15 min before vanishing. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57855.html",
      "state": "CO",
      "duration": "10-15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b776b",
      "summary": "A calculated experience with another dimension.",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2006-12-07T00:00:00",
      "story": "A calculated experience with another dimension. I was at a branch of the local public library on 8th St. when I noticed a small \"study room.\"  Because it was just the type of room I was looking for I noted the room's furnishings using the window next to the door.  Because there were three similar doors along the same wall I decided to see how many were study rooms.   The next door also led to a study room, which was furnished using furniture that seemed identical to the first room; a beautiful new large table and chairs.  Taking a few steps backwards, I looked in the window to the first study room again to see if the furnishings in both rooms were identical.   I also noticed the sign above each of the rooms, \"STUDY ROOM.\"  The first room was a little smaller though.  I was just about to look in the window to the second study room again, when two people walked into it and at the same time a woman came out of the third door.  I then asked her how many study rooms that branch of the library has and, nodding towards the first study room, she answered, \"only that one.\"  I  had looked up at the sign above the second door and the areas above both of the doors each had an identical notice posted, \"Study Room.\"   The wall in the second room was bare and that room was larger.  I use the past tense because when the library employee looked at the wall where both doors had been, the door only to the second study room vanished.  No spaceship seemed present and there was no unusual noise.    But, from previous my experience,  the second study room at my local library branch has not entirely disappeared, its access is strictly controlled.",
      "link": "http://www.nuforc.org/webreports/053/S53421.html",
      "state": "CO",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7aef",
      "summary": "Metallic, triangular object spotted hovering in broad daylight near NORAD.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "Metallic, triangular object spotted hovering in broad daylight near NORAD. On June 18th my girlfriend & I were driving South on highway 115 very close to the Fort Carson Base in Colorado Springs. We both independently spotted a metallic, triangular object which appeared to be \"hovering\" (no discernible movement or jet plumes visible)about about a 15-degree angle in the vicinity of Cheyenne Mountain, home of NORAD.  We both thought it might have been a large advertising balloon/blimp, but the object appeared to be much too high in altitude (maybe 1/4 mile high) and we could see no trace of attaching ropes or attached cables. We had a very clear view of the object as the skies were very clear that afternoon. We did not see any obvious lights and did not hear any noise. There was no obvious interference on the truck radio and cell phones were not in use.  We viewed the object for about 30 seconds and then lost sight of it when we passed some trees on the side of the road. When our view of the sky was restored (3 seconds time), the object had completely vanished.",
      "link": "http://www.nuforc.org/webreports/051/S51123.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8007",
      "summary": "Brilliant bright light moves across the sky in Colorado Springs, CO September 7, 2009.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Brilliant bright light moves across the sky in Colorado Springs, CO September 7, 2009. We were standing in our driveway saying goodbye to our dinner guests when I noticed a brilliant light moving across the sky in the way you would see a satellite move but it was much lower and much larger and brighter than a satellite. The light was longer than it was tall, had no tail and seemed to have a triangle shape or box shape with a point to the bottom. I pointed it out to my husband and our guests.  No one could say what it was exactly.  It was not flashing or twinkling.  I only saw the white light, my husband saw a small red light on the top, I did not see a red light but the object seemed to have a glow about it almost as if it had a spotlight that it was using.  If it had a spotlight it was not a tight focused beam it was more of a broad subtle beam. It moved across the sky from west to east.  There was no sound to it.  An airplane caught our attention from the north flying in a southwestern direction.  It had a flashing red light and a whitish, yellowish light and I can’t remember if it flashed.  It was obviously an airplane, you could hear the engine and see the typical flashing red light. At the same time you could see this other object, it was very different from the airplane, it was lower in the sky and we couldn’t hear it.  Any explanations?",
      "link": "http://www.nuforc.org/webreports/072/S72144.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8229",
      "summary": "Triangular light formation in Colorado.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Triangular light formation in Colorado. I recently watched a documentary (UFOs Seeing is Believing) hosted by Peter Jennings on the National Geographic Channel, which prompted me to report after all this time, something I saw when living in Colorado Springs over 10 years ago. The particular discussion on the type of objects seen in and around Phoenix, AZ at roughly the same time made me think there was something more to what I saw. After returning home from a friend’s house on the evening of the 13th or 14th of March, 1997 at approximately 10:30pm (I remember it was around this time as I had returned from a vacation shortly before, but can’t remember if it was a Thursday or Friday), I went out on my back deck to look at the Hale-Bopp comet which was clearly visible with my small binoculars in the North-Western sky.  At that time I was and still am a Financial Analyst, but have always loved backyard astronomy since I was in Jr. High School and had an issue of Sky & Telescope which told me where to see it. While looking at the comet for several minutes with the binoculars, I saw a distinct flash of light, which caused me to lower them and look to see what had cause it.  For about 10 seconds or so, I saw 5 lights in what seemed to be a triangular formation move quickly from South to North from my perspective.  It moved very fast to the North until it was out of sight, but it was visible long enough to see that the triangular \"V\" formation was kept throughout.  There was no noise or contrail(s) visible (I expected to hear jet noises thinking it was a formation of fighter planes, but there was none). Unfortunately, it moved too fast for me to determine if it was a solid object. This obviously was quite exciting and unusual.  After spending a few more minutes trying in vain to see the object(s) again, I thought this was peculiar enough to report to someone. I looked in the phonebook for someone to call and eventually spoke briefly to a person (whose name I cannot remember) at the local MUFON contact number and gave him the description of what I had seen.  As it was quite late, I agreed to call back the next day to go over the sighting in more detail, but I did not call again.  After thinking it over and keeping in mind that the simplest explanation is most often the right one, I determined that it had to be a formation of fighter planes or maybe a stealth fighter which sort of has that shape. After seeing this documentary and subsequently researching the so-called Phoenix Lights on-line, what I saw and especially the time I saw it is a little too coincidental. I have never seen anything like that before or since, but due to the similarities with what was seen in Arizona, I thought it was time to report what I saw. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68961.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b888c",
      "summary": "Two white lights floating in the sky near the moutains of Colorado Springs, Colorado.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Two white lights floating in the sky near the moutains of Colorado Springs, Colorado. Well I was riding in a car south on Interstate 25 near the downtown of Colorado Springs, Colorado enroute to a Cross Country Meet. (Which I won) and while looking at the mountains to the west, I saw two white lights. They were lower than the mountains and did not move. They did not flash, and they looked like the classic DC lights or something. They appeared to be very close together because I knew they were below the mountains. I only got a very short look at them because we were just driving by and I did not want to look stupid by telling everyone this. I know that in the area, the Air Force Academy does glider flights for pilot training. However, the lights were not flashing in any way and did not appear to move. However I still believe that these lights could not be explained with a normal explanation.",
      "link": "http://www.nuforc.org/webreports/072/S72712.html",
      "state": "CO",
      "duration": "Less than a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b88ba",
      "summary": "I was driving to work on November 06 2008. I stopped for Sonic to eat before work. I live very close to the back side of the locale air",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "I was driving to work on November 06 2008. I stopped for Sonic to eat before work. I live very close to the back side of the locale air port and 4 surrounding Military bases. I say this because I see lots of aircraft in the air at all times. I was in the drive up and I saw a strange pattern of lights on a plane or what looked to be a plane banking to the left to turn, but the object never turned and the light pattern never changed. I then saw a state police helicopter go in the same direction. I thought nothing of it at the time. I paid for my meal at the window and started driving to the base I currently work at as a Computer Systems administrator. I'm maybe a mile up the road still in town and I see the same object, flying very close to a residential area well under 300 feet in the air. I thought for a plane that’s close I sure don’t here any noise coming from it, so I rolled down my window and sure thing it did not make one sound. It soon dropped off of my vision and I keep driving. The road I’m on comes to a 4 way stop and is just off the back side of a locale air port and I see the same object coming from the direction of the air port and thought for sure this pilot must be trying to land or is having problems. I make my left hand turn at the 4 way stop and then a right on to the highway. The object at that time has stop in mid air just of the right of the highway I'm driving on. I'm coming up to the object and I see a row of well yellow lit windows so bright you can’t make out the inside compartment. But not a blinding eliminating light just well lit and yellow in color. I’m driving at about 30mph now and the object is to my right and I can see the underbelly it had green strips of lights all over the undercarriage of the craft and the body of the craft was black and blended in with the night sky so well I really could not make out the shape or even the hole size of the craft. It was very well triangle shape from the way the green lights were lade out on the bottom of the craft and! I rolle d down my window again and heard not one sound. At this time a second car had pulled over to the side of the road and started flashing its light and the object with out banking in any direction to the left or right to turn seemed to go back in the direction it came from towards the airport. I speed to the nearest cross section to make a u-turn and race to the airport with the object still in sight. I have to stop at a stop light and lose the object behind a set of buildings that a recently gone up in the last two or so years. Its very bright over buy the buildings as if the craft was hiding but the buildings are on a gated road I don’t have access to and I can' see the craft anymore. I'm leaving back towards work and I'm looking at the new buildings that I have never seen before and it seems there is a private run way and some indicator lights lighting up a run way path I've never seen before. And there seem to be an airplane hanger right behind this new building that’s just off the main run way to the locale airport, where I think this object my have landed and possibly if it was not a true UFO may have been stored away. Any way I tried to Google maps the location of the building and it seems they are brushed out of the picture or were not built when the photo was taken. I saw this craft up-close and for a very long time, I'm more then sure I'm not the only one in the area as it was flying very close to the ground and very slowly no aircraft other then a helicopter could have pulled off the speeds but not the maneuvers. I wish I would have had my camera to take photos. It was not any aircraft I have ever seen nor was it your typical UFO sighting as the object did not glow did not have over powering bright lights or laser beams. On the ride out to the baseI work at I saw what seemed to be more aircraft all NONUFO and very identifiable in the sky then I've seen in a long time it was as if they were looking for some thing. I will be keeping an eye out and would like to know where I could better report my f! indings or receive any information or any other repotted similar sights for that night in my area.",
      "link": "http://www.nuforc.org/webreports/066/S66769.html",
      "state": "CO",
      "duration": "20 - 30 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bfa",
      "summary": "speeding stars over colorado springs",
      "city": "coloradosprings",
      "shape": "changing",
      "date": "2010-02-14T00:00:00",
      "story": "speeding stars over colorado springs I was out with my dogs. When i was looking at the stars (as I normally do) When I saw a moving not blinking star. I stood staring at it. When I saw two more. When they all met in the sky they changed shape turn blue then green and left so fastly they looked as if they had just disappeared.",
      "link": "http://www.nuforc.org/webreports/073/S73741.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8dbd",
      "summary": "What apeared to be a white dot in a clear blue sky, was acually a sagnificant size unknown aircraft reflecting the sun",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2009-01-10T00:00:00",
      "story": "What apeared to be a white dot in a clear blue sky, was acually a sagnificant size unknown aircraft reflecting the sun I happened to be looking west over the mountains and noticed there was an aircraft traveling south with the normal exhaust trail coming from behind the plane.  Then what looked like a white dot:  appeared about 100 meters from behind the plane moving west.  This unknown aircraft was moving at a pretty good rate of speed and had no exhaust trail of any kind.  Watching this unknown aircraft as it moved I realized that what appeared to be a white object, was the reflection from the sun, and had to be a significant size to give off that amount of glare.  This unknown aircraft continued to travel west as it disappeared for few seconds a couple of times.    Than returned in the same flight path heading west.  There were no clouds in the sky or area that would obscure my sight.  I watched this unknown aircraft for a good ten to fifteen seconds before it completely disappeared 50 meters or more before the ridge line.  Four or five seconds after the unknown aircraft disappeared. There was a small exhaust trail 50 meters to the south of where the unknown aircraft was last seen coming over the ridge line traveling east.  The unknown aircraft did not appear again. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67008.html",
      "state": "CO",
      "duration": "10-15seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8eb1",
      "summary": "Triangular shaped object with 6 to 8 orange colored lights, 3 on each side.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2010-02-14T00:00:00",
      "story": "Triangular shaped object with 6 to 8 orange colored lights, 3 on each side. Triangular shaped object with 6 to 8 orange colored lights. There were 3 lights on each side and I believe 2 on the backside. The ‘front’ end was open, as the side lights did not meet at a point. At approximately 21:00 hours I stepped outside on my front porch to smoke a cigarette.  I live close to an Air Force Base and the City Airport, less than 5 miles.  I have seen many military aircraft fly over my house, including the Stealth Bomber.  I have also worked at the airport for about 3 years. As I looked up at the stars I saw orange lights moving from North to South at a height of the same as a landing aircraft.  I did a double take when I realized it was not an airplane, or one that I would have recognized as there were no standard aircraft lights visible.  I tried to knock on the front window to get my wife’s attention, but to no avail.  I went to the street to follow the lights as they went south over my house and disappeared.  The event lasted about 5-15 seconds. I do not know if the lights vanished or disappeared in the distant haze. I did not see any type of body and the lights appeared they would be on the bottom of a craft.  I am uncertain if this was one craft or several in formations.  There was no sound at all.",
      "link": "http://www.nuforc.org/webreports/073/S73723.html",
      "state": "CO",
      "duration": "5-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b943d",
      "summary": "Sun bright object seen high in the sky near Air force Academy disappears in seconds!",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "Sun bright object seen high in the sky near Air force Academy disappears in seconds! While driving South on Interstate 25 and passing by the Air Force Academy, I noticed something very bright out of the corner of my eye.  Looking out my car window there was this ball of extremely bright white, (like looking at the sun), light.  It was very high, I would say at a hieght of around 35 to 40 thousand feet.  It was off to the east at about 10 miles and disappeared over the horizon to the South in about 4 to 5 seconds.  I heard no sound nor was there a contrail.  I told my wife we have just seen a UFO.  Being a private pilot and former USAAf/USAF aircraft mechanic, I know what conventional and military aircraft look like because as such we pilots can't help looking up when we hear an aircraft.  I would just like to add that this was not the first nor the last time I have seen strange objects in the sky. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70038.html",
      "state": "CO",
      "duration": "4 to 5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b96fc",
      "summary": "bluish white colored disc flys silently across sky and vanishes",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2009-06-09T00:00:00",
      "story": "bluish white colored disc flys silently across sky and vanishes It's difficult to be exact about the time I saw my UFO. I guess about 2 months ago is reasonably close. I've talked to several people about what I saw and was litterly laughed at each time. And reasonably so, I've stopped discussing it with anyone at all. That is until finding this section on your website. So here goes. \t My wife and I were late getting home one nite so I suggested we put a couple of steaks on the grill and have a quick and simple dinner and hop into bed, readying for another days ordeal. I had just fired up the grill and was still holding and folding the grill cover in my hands. I was staring out into the night sky looking at the star formations as I usually do when out at night. I suddenly noticed a rather strange light going across the sky in a West to East direction rather high in the sky. At first I thought it was merely a commercial plane at that altitude but soon realized I saw no usual vapor trail nor jet exhaust sound. But the thing that caught my attention foremost was the fact that I saw no flashing navigational lights. I thought that was especially odd. I knew it was proceeding across the sky because I could see the stationary night stars behind it. I continued to gaze at the moving light as it maintained what appeared to be a constant speed when suddenly it starting becoming brighter in appearance. As I continued looking at it, it actually took on a more distinguishing look about itself. The light started turning a brilliant beautiful color of blue, a shade of blue I'd never seen before. Almost like an electric arc from a plug wire. Ok, here's the crazy part, as I watched it, it developed a wide looking ring around the outside diameter of itself. This ring was a much brighter shade of blue than the inner section appeared to be. It litterly gave the appearance of what Saturn with it's rings looked like, except it was oval shaped in it's center. The two individual and separate colors illuminated its shape completely. \t I know what I saw, and this is what I saw. I continued to stare at it, half thinking that if I dropped my gaze it would disappear from me or I'd loose a visual on it. I decided to call my wife to come and take a look, not taking my gaze off it, so I called her several times but she didn't hear me in time. \tThen I did the most stupid thing of all, I decided to lay the grill cover down and walk out in the yard to get a better viewing of this object. Laying down that cover took no more than 1 second for me at the most but when I gazed back up in the sky where it last was, there was nothing to see. I mean nothing at all. Not a trace of it could be seen! From initial first sighting until it vanished was perhaps 8 seconds. But I know what I saw. My lasting regret  even till now was taking my eyes off it and missing how it managed to disappear from my line of sight. It's completely impossible for me to have misplaced it in the night sky when there were no other aircraft in the sky at that time. And how did NORAD not pick it up either, as I can see the military installation from my front yard! So call me crazy if you will but what I've written here is the absolute and complete truth as I would derive no personal satisfaction in fabricating such a wild story just to make myself look crazy in the end. I believe with all my heart what I saw that stary night was actually a craft not from our planet but rather from some place outside our Solar System and will continue to believe so until the day I die. I thank you for reading my story and hope that you will believe me. Again, Thank you. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70388.html",
      "state": "CO",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9cd3",
      "summary": "Multicolored arrowhead shaped object east over Colorado Springs viewed from the Ute Pass to the west.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2009-12-12T00:00:00",
      "story": "Multicolored arrowhead shaped object east over Colorado Springs viewed from the Ute Pass to the west. I and my daughters observed an arrowhead shaped object over Colorado Springs, Co. Thanksgiving night. We were located 20 miles west in Woodland Park, Co. and observed the object to the east over Colorado Springs. The object had dozens of blue-green lights that would flash red, pink, magenta, and orange colors. Another fainter smaller but similar object was observed through the binoculars. After an hour it moved to the east.",
      "link": "http://www.nuforc.org/webreports/073/S73489.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b9df2",
      "summary": "Flashing rotating lights",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "Flashing rotating lights At around 23:45 pm MST myself and another person witnessed three flashing red lights moving south to north on the west side of Colorado Springs.  It appeared they were in front of the mountain range near Pikes Peak, just north of NORAD.  Shortly after the lights moved past we witnessed multiple helicopters in the area.  These lights appeared to be moving rapidly and in a rotating manner.  Due to our distance from them we couldn't see the object itself, based on the size and distance between the light it was clearly not an airplane or helicopter.",
      "link": "http://www.nuforc.org/webreports/074/S74871.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba029",
      "summary": "Triangle craft with dim lights traveling low at a high rate of speed with no sound over the Colorado Springs airport.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2009-05-12T00:00:00",
      "story": "Triangle craft with dim lights traveling low at a high rate of speed with no sound over the Colorado Springs airport. I was in my back yard sitting down smoking a cigarette.  I live on Peterson AFB.  I saw triangle shaped craft flying almost overhead.  I saw a total of five really dim steady lights. Two where in the rear..two more in the middle..and one at the point of the craft.  For a few seconds it was reflecting the lights from the city.  It would have flown directly over the AFB/Airport for Colorado Springs.  It was traveling on a south to north path.  It was traveling at a high rate of speed and I heard no sound from it at all.  I didn't really see a color to this craft.  There is no moon and a I saw it reflecting the lights from town and the small emitting lights from it has well.",
      "link": "http://www.nuforc.org/webreports/069/S69740.html",
      "state": "CO",
      "duration": "a few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba21f",
      "summary": "Mysterious series of lights and disk shape across southern Colorado Springs sky",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "Mysterious series of lights and disk shape across southern Colorado Springs sky I have lived in Colorado Springs my whole life and heard stories from my parents about mutilations of buffalo near the Broadmoor Hotel, and sightings they have seen.  I’ve been skeptical  in existence of another life form but now that I have witnessed first hand something out of the ordinary I believe that they may be things out there that we still don’t know very much about.  I was driving home from work and in front of me I noticed a series of 3 evenly spaced orange glowing lights, and one single glowing light that wasn't as closely spaced. I drive that street everyday and know it couldn’t have been just stars, street lights, or airplanes, then the lights went away one at a time, starting from the right then going left, last light to go out was single light farthest away from the others(it was on the left of all of them).  It happened about 1 second in between each other. They were all in a straight horizontal line. I kept driving and stopped at a light and t! here it was in front of me this time, just 3 lights this time, but I could see the out line of a disk shape on the bottom of the lights and once again the lights disappeared again going right to left one at a time.",
      "link": "http://www.nuforc.org/webreports/073/S73649.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba27b",
      "summary": "UFO hovers off of mile marker 129 (Interstate 25) in Colorado Springs??",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "UFO hovers off of mile marker 129 (Interstate 25) in Colorado Springs?? We were headed south on I-25 towards Pueblo, CO when at approximately 9:30 PM I saw a bright light ahead of our vehicle in the distance.  Assuming it was a low flying airplane or a helicopter with the bright search light on, I watched without much thought or concern.  After about 5 minutes passed I realized that the object had not moved and we were getting closer to it.  As we got near, the one light from the distance became two distinct lights with a couple red lights in between.  Again reminding me of a plane, however, this object was still stationary.  We actually passed the object at around mile marker 129 (it was to the east of the interstate) and at this point we could make out the three bright white lights in a triangle shape.  The object NEVER moved.  I also noticed some blinking coming from on top of the craft, I could make out two brighter white lights that would blink up high and one of the red lights blink below.  The craft made no sound and continued to hover as it got smaller in the distance of us driving away.  In total, I watched the object for about 15 to 20 minutes.  This length of time rules out the possibility of it being a low flying airplane because that would have come and gone in minutes.  The helicopter is the only logical explanation, but that doesn’t explain the silence nor the triangle shape of the lights (and I could be wrong, but I thought they could not hover in one spot for too long of a time).   Furthermore, I have seen many helicopters growing up in Colorado next to all the airports and air force base and I’ve never seen one stay perfectly still for as long as this did.",
      "link": "http://www.nuforc.org/webreports/069/S69022.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba9bc",
      "summary": "Bright round flash flies over Colorado Springs for 3 seconds.",
      "city": "coloradosprings",
      "shape": "flash",
      "date": "2010-11-21T00:00:00",
      "story": "Bright round flash flies over Colorado Springs for 3 seconds. As i was standing on my back pourch around 1:00 am looking up at the stars i saw a bright flash.  This flash appeared out of no where,also it was going way to fast for it to be a plane. The color of the bright light was white,and the shape was round.  The flash though only lasted for about 3 seconds and vanished.After that i was still surveying the sky hopeing it would appaered again,and that's when i saw these planes following in the same flight direction.  These planes were coming by about every 7 minutes.",
      "link": "http://www.nuforc.org/webreports/078/S78496.html",
      "state": "CO",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bafd2",
      "summary": "A Brightly Multi-Colored Object appeared in front of Pike Peak, north/west of NORAD in Colorado Springs.",
      "city": "coloradosprings",
      "shape": "oval",
      "date": "2010-08-24T00:00:00",
      "story": "A Brightly Multi-Colored Object appeared in front of Pike Peak, north/west of NORAD in Colorado Springs. A Brightly Colored Object appeared in front of Pike Peak, north/west of NORAD in Colorado Springs.  The light flashed a blue, purple, and green.  The object was by far the brightest object in the sky.  The UFO hovered and at about 30 degree angle in the western sky and made erratic turns and achieved incredibly fast speeds.  This anomaly lasted for approximately three minutes and was witnessed by six other people.   I have never witnessed anything like this before.  I was quite surprised and excited by the sighting.  It was impossible for me to tell the distance or size of the object, but if I were to hold my arm extended out in front of me it was the size of my thumb nail.  I witnessed this from the east and the object was directly west from me.   According to the other witness this is the third sighting in three weeks.  I will be out with a Camcorder from now on. ((NUFORC Note:  Date above may be inaccurate.  We assume a date of July 7, 2010.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77039.html",
      "state": "CO",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb20b",
      "summary": "A bright blue object crossing to the northwest.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2011-05-02T00:00:00",
      "story": "A bright blue object crossing to the northwest. The mountains are directly to my west,  I was looking straight up and saw an air plane flying southwest very high in the sky, then noticed a bright blue light cross it going northwest at an altitude far exceding that of the air plane.  I lost sight of the bright blue object when cloud cover rolled in.",
      "link": "http://www.nuforc.org/webreports/081/S81029.html",
      "state": "CO",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb588",
      "summary": "Yellow light in Colorado Springs",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2011-01-31T00:00:00",
      "story": "Yellow light in Colorado Springs I was driving south on powers heading to work when I saw a yellow light in the distance.  At first I thought it was an aircraft but I work at the airport and know where the runway is and it was way off  from the runway and it did not have any red or blue flashing strobes.  But then I thought it could have been a helicopter because I see them coming from that way all the time but still no flashing strobes, it was moving to slow, and I have seen no aircraft all yellow either.  I was still driving trying to get a good look at it when I made a left turn into work and still looking at it when it moved to the east and then it just disappeared.  I stopped my truck then and stepped outside trying to see where it went or what happened to it but like I said it disappeared.  If it was an aircraft of some sort it must of crashed but there were no reports of any aircraft crashing the next day.",
      "link": "http://www.nuforc.org/webreports/079/S79847.html",
      "state": "CO",
      "duration": "30-45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbfb",
      "summary": "A DISK SHAPPED UFO SIGHTED OUTSIDE COLORADO SPRINGS CHRISTMAS EVE 1972",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2011-12-12T00:00:00",
      "story": "A DISK SHAPPED UFO SIGHTED OUTSIDE COLORADO SPRINGS CHRISTMAS EVE 1972 CHRISTMAS EVE 1972 DRIVING FROM DENVER TO COLORADO SPRINGS BEFORE COMING INTO COLORADO SPRINGS IN A RURAL AREA.  I SAW A STAR FALLING AND SAID MONEY, MONEY, MONEY AND THEN SUDDENLY WHAT I WAS WATCHING WAS ABOUT 1000 FEET AWAY,  A DISK SHAPED SHIP HOVERED OVER SOME LIGHTS IN THE DISTANCE.   THEN THE TOP HALF BECAME TRANSPARENT AND I COULD SEE PEOPLE WALKING AROUND AND LOOKING OUT THE WINDOWS.  THIS ONLY WAS A FEW MINUTES SINCE MY HUSBAND AND I WERE DRIVING DOWN THE ROAD AND DID NOT STOP.  THE ROADS WERE VERY ICY AND THERE HAD BEEN A 13 INCH SNOW STORM.  THAT IS ALL I REMEMBER.",
      "link": "http://www.nuforc.org/webreports/084/S84820.html",
      "state": "CO",
      "duration": "2 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf03",
      "summary": "Firework type of formation hovering south of Pike's Peak",
      "city": "coloradosprings",
      "shape": "formation",
      "date": "2011-12-12T00:00:00",
      "story": "Firework type of formation hovering south of Pike's Peak I noticed the formation when I was driving home, South on Nevada. It caught my eye because I thought it was a firework, but then it never went away.  I was astonished, you could say, maybe confused, so I kept driving straight for about another 15 minutes to see if I could get closer to what I was seeing.  Trees eventually got in the way of my view, but as I was heading back, North on Nevada, I could see the formation in my side view mirror the entire way home. I live on a bit of a hill, so I have a view of it from my window. My window view is facing the Mountain Range.  I am seeing the formation South of Pikes Peak. It looks like a firework, a bunch of shimmering lights in a circle, but none in the middle.  The lights are pulsing, it seems like there is a rhythm.  They are colored red and white.  It seems too low for any government aircraft to be hovering.  I could email a few-second video I took.",
      "link": "http://www.nuforc.org/webreports/085/S85053.html",
      "state": "CO",
      "duration": "it has been about an hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3e3",
      "summary": "Observed a solid white light moving at great speed in a south east direction.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "observed a solid white light moving at great speed in a south east direction. on 01/02/2012 at 1750 HRS my self and a friend observed a white light that was extremley bright moving at a high rate of speed in a south east direction of travle. tonight is clear over colorado springs other aircraft were visible this light was solid white and did not have any other flashing lights to indicate that it was an air craft. other aircraft in the area had visible contrales.  this did not. it appeared to be at a mid to high level of altitude. the white light had an aurora around it.  as the light headed to the south east the bright white lite dimmed to a dull amber light and appeared to move faster as it faded. the amber light continued to fade until it was no longer visible. we were in a city park when we observed the light it also made no sound as it moved.",
      "link": "http://www.nuforc.org/webreports/086/S86290.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7a6",
      "summary": "It was in a T formation.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "It was in a T formation. I was looking out my window at a blinking star, and i live around a lot of trees, next thing i know i see a aircraft really close to my house and the trees around. It was in a T formation,  On the horizontal line were 3 lights, on the vertical line there were two.  I dont know if it was the S-R Blackbird or not. i did not have enough time to take out my camera to take a picture.  I dont know if it left a trail it was too dark to tell. Very little to no sound heard.",
      "link": "http://www.nuforc.org/webreports/085/S85796.html",
      "state": "CO",
      "duration": "30 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8e4",
      "summary": "Triangle with Orange Lights Swooped Down Quickly then Disappeared.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2011-10-25T00:00:00",
      "story": "Triangle with Orange Lights Swooped Down Quickly then Disappeared. At 19:40 on 10/23/11, I looked out of my window.  I saw a Triangle Craft Swoop Down Quickly in a downward curve.  Then it Completely Disappeared Fluidly.  I've got no Idea what it was I haven't seen anything since. I was weird",
      "link": "http://www.nuforc.org/webreports/084/S84753.html",
      "state": "CO",
      "duration": "5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bca28",
      "summary": "The flying objects seem to appear and dissapear without leaving a trail in the long exposure photos.",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2011-07-17T00:00:00",
      "story": "The flying objects seem to appear and dissapear without leaving a trail in the long exposure photos. I took these photos on July 4th around 9:30 pm MDT from my home balcony.  I used a Canon T2i digital camera (18 Meg) set at ISO 800 and for 10 second exposures.  Each picture was taken 30 seconds apart.   With those settings, any objects like airplanes, fireworks, an even helicopters would show a trail.  Even the stars, if you zoom in, would show a small trail due to the earth rotation during 10 seconds of exposure. The flying objects in the photos were pretty steady in their positions, except that they seem to appear and dissapear without leaving a trail.  Notice the change from photos number 5 and 6, where quite a few objects appeared from the twighlight zone. These objects were not visible with the naked eye.  They showed up in my pictures due to the high sensitivity of the camera and the long exposure.  The last three photos are just enlargerments of the first 3 (the originals).  I promise there is no photoshop involved in this. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82295.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcaa3",
      "summary": "UFO over Powers and Omaha",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2011-07-17T00:00:00",
      "story": "Ufo over Powers and Omaha The craft was black with rounded edges.  It was silent. as it flew it would tilt as if it were looking down.",
      "link": "http://www.nuforc.org/webreports/082/S82319.html",
      "state": "CO",
      "duration": "6 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bced5",
      "summary": "bullet shaped craft over the skies of colorado",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2011-05-12T00:00:00",
      "story": "bullet shaped craft over the skies of colorado Ok so mountains are to my west, I was faced south and watched a craft that was bullet shaped heading north, lasted only 20 seconds but at the end it accelerated fast enough to cause a streak behind it in a bright blue color then it was gone just plum vanished.looked like a bright blue bullet. this happend at 1:33 am",
      "link": "http://www.nuforc.org/webreports/081/S81108.html",
      "state": "CO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcf85",
      "summary": "Fireball appearing and disappearing in daylight sky over Colorado Springs",
      "city": "coloradosprings",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Fireball appearing and disappearing in daylight sky over Colorado Springs This report is from my sighting of two years back (sometime in 2009-10), however, given the increase of the appearances of this type of UFO stated by Peter Davenport on Coast to Coast am, I feel I should contribute my sighting. This sighting took place over my neighborhood in Colorado Springs.  I was parked near my home to finish listening to the last part of a Coast to Coast show.  This show had nothing to do with UFOs by the way, so UFOs were not on my mind.  I reclined my driver's seat to gaze up at the sky while listening.   Suddenly a red/orange translucent sphere appeared in the sky.  It moved slowly for maybe 1 quarter mile (in my estimation) in a north-easterly direction before slowly disappearing back into the blue.  It was day light outside with no stars showing, nor were there any clouds near this object. However, there was a nearby plane (civilian Leer jet type of plane).  I have no idea if the pilot noticed the orange sphere.  This plane was useful only in that it gave me an indication of the altitude, whatever that typically is for Leer Jets. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92330.html",
      "state": "CO",
      "duration": "Approx. 1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1b6",
      "summary": "Large disk shaped object above Mtn Shadow..Glowing red-blue-green-white.&is stationery..",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "Large disk shaped object above Mtn Shadow..Glowing red-blue-green-white.&is stationery.. My boyfriend and I noticed an odd large very bright light north of Pikes Peak mountain..At that time, there was a tradgic fire in the NorthWest area of Colorado Springs..  We thought maybe it was a air craft aiding the burn area..However, the fire was almost 99% contained..  As well as, this large light appeared to be changing colors..in a pattern..It went from red to blue to green to white..It continued turning these colors..  We got out some binoculars, to check it out.. We were on the Northeast side of Colorado Springs(bout 10-15miles away)  Once we got it into a more clearer focus, we could see that it seemed to have a disk- like shape..  Two of my boyfriends neighbors approached us with the same curiosity of this glowing object..  They too, had been watching this odd light..which was stationary the whole time we were watching it!! After bout 15mins or so of observing it, we started to walk back to my boyfriends house.  Then, my boyfriend&I saw this red star-like! light in front of us, a few hundred feet in the air , appear out of nowhere!!  It traveled (quickly)up at a 90 degree angle, then moved erractically.and then disappeared!! 20 mins later we were leaving his house..and saw the strange light above the mountain range was gone!! Needless to say, in the passed 3months or so, I've encountered about 8 or more different bizarre&unexplainable sightings in the night sky!!! In a sense,all this slightly worries me because several of my friends have also had encounters frequently as well..!! In this case, the &quot;unknown,&quot; makes me a lil vexed!!! :) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93799.html",
      "state": "CO",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd41f",
      "summary": "Falling bright light",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Falling bright light I saw a white ball of bright light out of the corner of my eye, upon looking i saw it fall behind some trees a ways away from my house.  Right before it fell behind the trees where I could no longer see it, it gave of a flash.  Thinking that it was a falling star of some sort i watched and then there was a very bright flash that went in both directions of where the light fell. Not sure what this is.",
      "link": "http://www.nuforc.org/webreports/093/S93214.html",
      "state": "CO",
      "duration": "9 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7fb",
      "summary": "Bright zig zagging light in the sky above norad.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Bright zig zagging light in the sky above norad. It zig zag around in the sky was bright and was over norad complex.  Then it shot straight up into the sky and disappeared.",
      "link": "http://www.nuforc.org/webreports/093/S93464.html",
      "state": "CO",
      "duration": "15 to 20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd937",
      "summary": "Two orange lights that didnt move at all then disappeared.",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "Two orange lights that didnt move at all then disappeared. There were two orange circular lights I've never seen before.  They were there 2-4 mins and I took three pictures.  Then they were gone.  They didn't fly away or move they just dissappered.  I was looking south towards Pueblo.",
      "link": "http://www.nuforc.org/webreports/087/S87931.html",
      "state": "CO",
      "duration": "2-4 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc88",
      "summary": "Bright orange balloon shaped object  by cs airport",
      "city": "coloradosprings",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Bright orange balloon shaped object  by cs airport Went outside and saw a bright orange moving object that looked almost likea small hot air balloon.  Watchedit move northforabout 25 seconds then lost sight in the trees and houses.   Called my husband outbut he was too late  to see it.  I came back inside and he called me out agAin and i saw the same thing again but it started back at the original point i had seen earlier.   Moved north again and was able to see it for about 40 seconds before it was out of sight.   Was not very high.",
      "link": "http://www.nuforc.org/webreports/091/S91065.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd20",
      "summary": "Red and white Lights UFO over Colorado Springs CO",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Red and white Lights UFO over Colorado Springs CO I was camping by myself on top of Mt. Almagre/Mt Baldy near Rosemont Reservoir in 8 miles west of Colorado Springs.  At 5:30am I woke up out of a dead sleep and opened up my tent flap to see a bright bright star.  I knew it couldnt be a star when it started getting closer and closer. Thought it might be a comet or asteroid but then it stopped.  The single bright light turned into three round lights and hovered close to an hour in one spot.  Then lights shone from both ends of the object and red fireballs or plumes were ejected on either side of the object.  The object then disappeared with the rising of the sun.  There was no sound to the object just red and white lights.",
      "link": "http://www.nuforc.org/webreports/092/S92833.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3be0da",
      "summary": "Bright blinking Light, and a strange jet. also, a helicopter following another intense light.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "Bright blinking Light, and a strange jet. also, a helicopter following another intense light. I noticed a bright light directly above the Cheyenne canyon area just north of NORAD.  This light was moving up and down left and right, and every five minutes or so it would dim out almost completely before starting to shine vibrantly again. after watching it for about an hour just south of NORAD another one flew across the sky, it flew smoothly but was very large and a helicopter was following behind it about four hundred yards.  It flew directly over my house, coming from fort Carson and heading north.  Twenty minutes later an aircraft which looked like a very very large jet (at least the size of five F-16's) flew over my house from the south west area, it was nearly silent until it was directly over my head and it sounded like a jet but very muffled, the aircraft was very low, I could see its wings and it had two blue non-flashing lights on its wingtips and an orange glow near the fuselage section.  The bright white light that was hovering stayed lit for! about another half an hour then slowly dimmed away. now there are three helicopters circling the area and a friend of mine nearly ten miles away was seeing the same thing.  I saw the same light last night and it was moving but not flashing its lights and going dim.   I worked on f-16's in the Air Force, whatever jet flew over my house was like the holy grail, nearly silent and large.",
      "link": "http://www.nuforc.org/webreports/088/S88575.html",
      "state": "CO",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3be267",
      "summary": "UFO streaks past helicopter during Colorado wildfires",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "UFO streaks past helicopter during Colorado wildfires This was news footage from the last 2 minutes of MSNBC's Ed Show from Friday June 29th.  The segment was on the wildfires in Colorado during the last 2 minutes of the show.  The footage shows a helicopter pouring chemicals onto a fire on a hillside in dense smoke, and suddenly from the lower left of the screen, a white light streaks by from the lower left of the screen diagonally to the upper right of the screen, past the helicopter, and out of the lens view.  Initially, it appears to be a single light, but later appears as 2 lights, but it's hard to tell if this is a second object, or just part of the original object. The film appears to be shot from another helicopter from a considerable distance, and the object appears to be moving too fast to be a bird, and since it is partially obscured by smoke as it emerges, it seems too far away to be a bug or dust. I do not have access to the footage, but maybe the producers at the Ed Show can steer you in the right direction.  This footage appeared on the last 2 minutes of the June 29th edition of MSNBC's 'Ed Show'. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90250.html",
      "state": "CO",
      "duration": "0-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be2a4",
      "summary": "Have on video.....VERY CLEAR Have original video if you want....contact through Utube http://www.youtube.com/watch?v=yXQnuCrJnXc",
      "city": "coloradosprings",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Have on video.....VERY CLEAR Have original video if you want....contact through Utube  http://www.youtube.com/watch?v=yXQnuCrJnXc",
      "link": "http://www.nuforc.org/webreports/091/S91380.html",
      "state": "CO",
      "duration": "Long...20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be304",
      "summary": "Interesting lights and movement near the US Air Force Academy",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2012-06-20T00:00:00",
      "story": "Interesting lights and movement near the US Air Force Academy My roommate and I were outside smoking a cigarette when we noticed two redish orange objects hovering over what looked to be near the US Air Force Academy.  Thinking they were just stars, we somewhat ignored them.  Looking back a moment later, we noticed they had moved.  We called my boyfriend out to watch with us.  At this time, we all discussed what we thought they might be. (Both my roommate and boyfriend are or have been in the military recently).  We ruled out the possibility of helicopters due to how perfectly still they sat, and for how long.  The colors of them should not have been visible at night from the distance we were at as well.  Watching for a few more minutes, we noticed a third object of the same size and color moving down to the other two.  They appeared to be flashing different colors at the same time, but were mainly the redish orange.  One object appeared to have been spraying a liquid (looked like water, but sparkled.  Roommate describes it as \"plasma\").  Then, the objects came to form a perfect triangle.  We unfortunately went inside for a brief few minutes. Upon returning outside, the objects were gone and have not returned since. ((NUFORC Note:  Source of report indicates that the date shown is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89729.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be38e",
      "summary": "A reddish/Orange object traveling silently at a very high rate of speed at relatively low altitude.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "A reddish/Orange object traveling silently at a very high rate of speed at relatively low altitude. On 23 September at 0322 hours, I had stepped out of my Office at the Fort Carson 911 Dispatch Center (Lat: 38 degrees, 44’, 55.54” Long:  -104 degrees, 47’, 52.1912”) for a break. The sky was clear with 10 miles visibility, no wind relative humidity 72%, Temp: 43 F.   I was standing looking to the East/Northeast.  An object that was reddish in color came from the South/Southwest and continued on a North/Northeasterly path at a very high rate of speed.   The object did not appear to be very large and appeared to be relatively low, maybe 2000-3000 feet and made no noise at all.  If I had to put a shape to the object I would tend to say it was triangular.   My first impression was that it was an airplane until I registered its speed and the fact that there was no sound. The object covered a distance of 10-20 miles in approximately 3 seconds and continued out of sight.  It did not burn out but traveled at a constant speed and asthmas until out of sight. ((NUFORC Note:  We spoke via telephone with this witness, and he seemed to us to be quite eloquent and sober-minded.  He is a highly qualified witness.  The witness indicated to us that the object covered and arc of 160-180 degrees in the 2-4 seconds he observed it.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93008.html",
      "state": "CO",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be725",
      "summary": "Box like saucer hovers and flies silently over Colorado Springs only a couple thousand feet above my head.",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2012-05-13T00:00:00",
      "story": "Box like saucer hovers and flies silently over Colorado Springs only a couple thousand feet above my head. I was at the Cotton Wood disc golf course playing by myself when I saw the strange object fly directly over my head. This object from underneath had a square shape with a sauce shape above the bottom portion. It was completely silent and flying very low.  I saw the object when it was dusk and it only had a very small blueish light illuminating from underneath of it.  I ran to see if anyone else was on the course playing and found four guys on hole eighteen.  They too witnessed the events, and classified it as a UFO. It was completely silent, floating above us very low, and had no lights other than a small blue light in the center bottom of the object.  It was floating very slow, and I even yelled at the object and waved to attract it's attention.  I got a very good look at this object and it was not a plane, or a weather balloon, or anything I have ever seen before.  Very scary, and very surreal!",
      "link": "http://www.nuforc.org/webreports/088/S88808.html",
      "state": "CO",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be906",
      "summary": "Five bright lights hover over Colorado Springs in perfect formation blinking off and on again.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Five bright lights hover over Colorado Springs in perfect formation blinking off and on again. On February 29, 2012 at approx. 8:30 pm, I went outside and saw five large lights in a perfect row and slanted to the right in perfect formation.  The lights were yellowish-amber in color and were very bright and strong.  I observed some of the lights turning off so to speak or disappearing only to reappear in the same spot.  As one would disappear, another one would appear on the other side.  So at times, there would be only four lights showing, then three, then five again, etc. It seemed like there was an intelligent pattern to the lights turning off and on.  I watched this for several minutes until one by one they disappeared.   I also noticed the dogs whimpering as well. These lights were so bright that it seemed almost like large car headlights in the sky and approx. a quarter the way up from the horizon.  The following morning I saw on the local news that several others saw these lights and called to report them.  The newscaster said that the Army was claiming that they were flares.  I am a former police officer and have worked with flares many times in the past.  These were definitely not flares due to the fact they could turn off and on at will.  They also stayed in a perfect diagonal line while hovering in the same spot.  There was also no sign of smoke.",
      "link": "http://www.nuforc.org/webreports/087/S87443.html",
      "state": "CO",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be903",
      "summary": "Orange balls in a line.",
      "city": "coloradosprings",
      "shape": "oval",
      "date": "2012-03-13T00:00:00",
      "story": "Orange balls in a line. Four Orange balls of light in a line moving slowly.  One would fade from sight at one end and a new one would fade in at the other end of the line.  This happened several times then they individually faded away.",
      "link": "http://www.nuforc.org/webreports/087/S87433.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be9fd",
      "summary": "Extremely bright light moves slowly above mountain range near Cheyenne Mountain, CO",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2012-04-18T00:00:00",
      "story": "Extremely bright light moves slowly above mountain range near Cheyenne Mountain, CO My house faces Cheyenne Mountain and a couple of other mountains in the central Colorado Rockies. An extremely bright light moved northwest from the sky directly above Cheyenne Mountain to about 25 miles up the range near where Manitou Springs would be from my vantage over the period of about a half an hour.  The light itself was extremely bright, brighter than anything else in the sky. Aircraft were present in the sky to compare against, and they too were much dimmer. No blinking transponder lights present. The nature of the light seemed closer to starlight, with green rays present.  I stared at the light for a while and it seemed to have three points in the center. The craft moved extremely slowly, the movement almost undetectable. I went to get recording equipment and watched it fade away before my eyes. I'm not sure if it went behind a mountain or if it simply faded.",
      "link": "http://www.nuforc.org/webreports/088/S88477.html",
      "state": "CO",
      "duration": "30 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beabf",
      "summary": "Four blue lights seen blinking in what seems like morse code by two kids.",
      "city": "coloradosprings",
      "shape": "cigar",
      "date": "2012-02-03T00:00:00",
      "story": "four blue lights seen blinking in what seems like morse code by two kids. On 1/25/12 ,at about 6:22 PM, me and my younger brother saw some light blue flashing lights towards the northeast. I was the first one to see them, and showed them to my brother.  We noticed how they looked somewhat like Morse code.  We started to walk home, and I continued to watch them. We walked past some houses, and then they disappeared.  We went home, described what we saw, and he told us that we saw a cigar shaped UFO.   At about 6:50, we contacted the UFO center.",
      "link": "http://www.nuforc.org/webreports/086/S86836.html",
      "state": "CO",
      "duration": "3 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bec33",
      "summary": "Colorado Springs sighting of multiple UFO's.",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Colorado Springs sighting of multiple UFO's I was sitting on my porch in Fountain looking east towards Peterson AFB area.  As I'm staring at the clouds, I make out several white, circle-shaped UFO's flying among the clouds.  They didn't appear to be in a formation.  Some were in groups and some were flying solo.  They flew from the direction of the base and proceeded to fly southeast.  I sat there for about 30 minutes, all the while, staring at the clouds.   I then noticed that they came back from the southeast and back towards the base.  I didn't see them land.   They disappeared into the clouds. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101210.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed16",
      "summary": "Saw a UFO and spoke to a possible alien.",
      "city": "coloradosprings",
      "shape": "cigar",
      "date": "2013-05-15T00:00:00",
      "story": "Saw a UFO and spoke to a possible alien. In the fall of 1993 I was working two jobs in order to support my son and myself. My main job was with the Colorado State Police as an officer.  I worked a second job at night. This fall evening I was on my way to work from my home which was in Colorado Springs, Colorado and across the street from the Patty Jewett Golf Course. Backing out of my driveway (my house was second from the corner of a tee intersection) and then moving forward the short distance to the stop sign at the tee intersection, I glanced across the 8th fairway to make sure there weren’t any wild golfers playing at the time.  As I came to a stop and while looking across to the other side of the fairway, I saw a group of oaks that had been there for years.  They stood about 40 feet high or so.  Just above the group of trees I also saw what I thought were white landing lights such as on every FAA regulated plane that I know of.  These lights were very low to the ground about 60-80 feet high.  I realized that this plane was going to crash and probably into me or at least my block.  I just sat there like a fool and watched the lights approach. I also noticed that this plane was moving extremely slow and thought sure it would hit the group of trees on the far side of the 8th fairway. Then it stopped.  It just stopped in mid-air and stayed there for a couple of minutes.  I then knew that this was not a regular plane.  I backed up a few feet and parked my car to the curb and stepped out.  I continued to look at the object as I walked across the street to the chain link fence that ran parallel with the 8th fairway.   I leaned against the fence and continued to watch the object. It suddenly dawned on me that there was no visible object, just the lights.  I strained my eyes to make out some sort of shape to it but failed to make out the outline. I looked around to see if anyone else was watching this thing but couldn’t see anyone.  Nobody on the streets, no one on the course, just absolutely no one anywhere around.    I also noticed that there was no breeze, no sound from any direction, no barking dogs,  just absolute silence. I looked back at the object as it began to move toward me again.  It was only 40 or so feet off the ground and about 100 yards in front of me.  Suddenly it rose above the group of oaks along the edge of the fairway and continued toward me.  Once it cleared the trees it dropped back down close to the ground and just stopped.  That’s when I saw the red and blue lights on the outside of the two white landing lights.  I tried so hard to see some kind of shape but none prevailed.  I could actually see the background and sky right through this, whatever it was. It sat there for about 2 or 3 minutes and began to move sideways.  The  lights were still facing toward me but moving sideways.  That’s when I saw the outline of the vehicle.  It was cigar shaped with a red light at one end and a blue light at the other.  The white landing lights were in the middle. The only reason I could see the outline is because when it moved sideways I could see the jagged edges of the craft.  (if you have ever seen the movie “Predator”  with Arnold Schwarzenegger the only way they could see the alien was when he moved and they could see the jagged edges of his body)  This is the way it was with this craft. Being raised an Air Force brat and having lived on more air bases than I want to remember I can tell you now this was no ordinary air craft.  It made no sound what so ever. The craft moved sideways down the length of the fairway (south) until it reached another section of houses where it stopped, rose above the houses and vanished.  I followed in my car until it was gone and then proceeded on to work. That’s the first half of the story. My night job was manager of an up-scale nightclub and restaurant. I arrived at the club and entered through the front door.  As you come into the club you find a very large raised horseshoe bar to your left and a raised dining area to the right.  A 3 ft. wall separated the entry way from the dining area and the bar on either side. As I came in one of my girls (cocktail waitress) approached to inform me of some issues I needed to attend to ASAP.  As she spoke I looked toward the bar to find 3 or 4 customers sitting and having cocktails. One man was sitting on a bar stool but was leaning back against the bar and staring at me. As I continued to speak to my girl, this man continued to stare at me.  At first I thought he was going to cause some sort of trouble so I kept a close eye on him as well. After my girl left the man at the bar rose and came up to me.  He asked if we could speak outside for a few minutes.  I agreed and followed him outside half expecting to be in a fist fight or something.  We stood in the middle of the sidewalk in front of the club and he asked me if I saw something funny on my way to work tonight.  I asked him how he would know about anything funny I may or may not have seen. This guy told me that they were checking up on me because I was one of the “special ones”.  To this day I don’t know what he meant by that. For twenty minutes he stood there and told me of my entire life from the time I was born to the present moment, reminding me of things I had long forgotten about or just kept secret from anyone else. Then he asked me if I remembered the night (when I was a young boy playing on the floor of my parents’ house) that a red light beam came through the window of the living room, across the wall and floor and then disappear. I told him I had no recollection of anything such event.  He then pulled out a business card and handed it to me.  As he did, I looked down at it as he placed it in my hand.  I scanned it quickly and looked up to ask him something and he was gone.  He was gone. For years I kept this information from anyone in fear of being labeled some sort of crackpot and I didn’t want to lose my police position with the State. In time I moved from Colorado to California.  In June of 2002 my father died unexpectedly. I returned to Colorado for his funeral and came back to California to my home.  In November of 2002 I went back to my parents’ home in Colorado Springs to have Thanksgiving with my mother and other family members. After dinner, we all sat around the table telling stories and jokes when I spoke up and said that I had a story to tell.  There were about 20 family members there and they were all chuckling as I told the story of my strange event.  When I got to the part about the red light coming through the window and across the wall and floor, my mother dropped her fork on the plate.  Everyone stopped talking.  It was absolute silent when she said that she remembered that like it was yesterday.  She said that this red beam came through the picture window of the living room, ran across the wall down to the floor and across the floor to the opposite wall.  She also said that dad got up out of his chair and went out on the front porch to see where the light was coming from but there wasn’t anything out front. When mom got done telling her tale of the red light the laughter was gone.  It continued to be silence for several minutes. I don’t know whatever happened to that business card that guy gave me but I must have lost it during my move to California.",
      "link": "http://www.nuforc.org/webreports/097/S97075.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3befbf",
      "summary": "Two lights going straight up",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Two lights going straight up Was outside smoking.  My apartment looks to the north.  I noticed two lights to my North-northwest in tandem appear to be going straight up.  It seemed like the faster it was going the brighter the lights were getting.  It did stop briefly for about 5 seconds before continuting up.  I really hope someone else saw this.",
      "link": "http://www.nuforc.org/webreports/096/S96646.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3ea",
      "summary": "Colorado Springs UFO Sighting",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "Colorado Springs UFO Sighting My friend and I were sitting out on my porch when I happened to look up and see 12 distinct lights, yellowish in color come out of nowhere directly above my house. There was no noise.  I jumped up and yelled &quot;Do you see that!!??&quot; She looked up and we both watched as it moved very fast in front of us and then disappeared within about ten or twenty seconds. The lights were organized in rows of three forming a W shape.  I live right next to the air force base and see and hear planes and military planes flying over my house all the time! This made no noise and was close enough to my house that if it had been a plane it would have shook it.  This was undoubtedly the most eye opening experience I have EVER experienced and I am so glad that I wasn't alone when this happened. There is no doubt that this was a UFO and it almost seemed as if it just slipped into our reality and then went back to somewhere else.",
      "link": "http://www.nuforc.org/webreports/097/S97169.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf4e2",
      "summary": "UFO Lands in Colorado Spings! People were out and about! Nobody noticed!",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2013-05-15T00:00:00",
      "story": "UFO Lands in Colorado Spings!  People were out and about!  Nobody noticed! I was walking south on 19th street from Uintah, I got less than a block from Boulder Ave, looked up and to the right and saw it.  At vaguely 60-65 degrees, I saw a strange craft of only a vaguely discernable shape. It was either an egg shape, or a fat disk, the size of an F-150 truck.   The rectangular shaped light panels were so bright and tonights overcast haze conspired to obscure it.  The objects &quot;from west- to south&quot; trajectory put  its position from my point of view to be roughly a mile and a half from 19th and Boulder Ave. I would suppose that it was hovering over the areas between 21st and 18th from west to east, and pikes peak avenue and the Highway 24 corridor from north to south.  I would guess that it was about 100- 150 ft. In altitude, slower than a plane, but faster than a chopper.  The object did not continue its west to east flight, it came down!  It was no helicopter!  It did not have the characteristic waver of a pitch change from forwa! rd to down, as it did this very quickly.  Thats it.",
      "link": "http://www.nuforc.org/webreports/097/S97180.html",
      "state": "CO",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf4cf",
      "summary": "Fast moving ufo with orange and white circles.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2013-07-03T00:00:00",
      "story": "fast moving ufo with orange and while circles while taking sky photos I took many 3second 3 photo shots looking just south of the big dipper.  While reviewing the shots I noticed a long object with 3 white circles and 3 orange circle along the length of the object.  The relationship between the white and orange circles is different in each photo.  It traveled in a straight line and move through the entire frame fro upper right to lower left within the 3 second time period of the three photos. f3.5 iso800 Nikon d5100 was used in low resolution.",
      "link": "http://www.nuforc.org/webreports/098/S98592.html",
      "state": "CO",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf543",
      "summary": "Bright orange objects floating near NORAD.",
      "city": "coloradosprings",
      "shape": "formation",
      "date": "2013-08-30T00:00:00",
      "story": "bright orange objects floating near NORAD At around 0:50, traveling South bound Powers Blvd, my roommate and I noticed at least eight; very bright, orange-warm-colored and much bigger than any other lights or planes in the sky.  The objects were further south, between NORAD (Cheyenne Mountain) and Fort Carson.  They seemed to be stationary, one would fade out, then another would fade out and another would re-appear; in particular pattern.  They were in small lines together, kind of lined up parallel of each other; again in no particular pattern- just random clusters of lines.  We tried to continue South on Powers to see them, and eventually they all began fading out of vision.",
      "link": "http://www.nuforc.org/webreports/101/S101196.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf874",
      "summary": "Seen blue lights in clouds.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2013-10-14T00:00:00",
      "story": "seen blue lights in clouds. It was me and my wife driving back from a store when we seen a blue light i tried to get it on my phone but couldn't for some reason it was like a spot light for plane's but blue and the light was not pointed up from the ground it was in the sky and when we got home we could see it before we were traveling west we had to go west to get home could not see anything but the light coming out of the clouds it lasted about a hour and a half but thats what i seen last night",
      "link": "http://www.nuforc.org/webreports/102/S102956.html",
      "state": "CO",
      "duration": "sky"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9a8",
      "summary": "orb/fireball ufo seen white/yellow sparkling light silent",
      "city": "coloradosprings",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "orb/fireball ufo seen white/yellow sparkling light silent The ufo was an orb shaped craft in the sky a few thousand feet off the ground and had a whitish/yellow type pulsating/sparkling light that i saw for about 20 seconds then rapidly disappeared.   it was also silent and there were airplanes in the sky as well.",
      "link": "http://www.nuforc.org/webreports/097/S97858.html",
      "state": "CO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe44",
      "summary": "Slowly and evenly pulsing light that alternated between invisible and extremely bright as it travelled North.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Slowly and evenly pulsing light that alternated between invisible and extremely bright as it travelled North. I was sitting on my deck at about 2255 using my iPad when, out of my peripheral vision, I noticed what looked like an extremely bright meteor, gradually increasing in brightness to the Southwest of my location (about 260-270 degrees azimuth).  It was about 45 degrees elevation, fairly close to Saturn. As I watched the object, it slowly decreased in brightness until it was invisible.  I thought, that's cool, I just saw a meteor that must have been headed straight towards me because it left no trail at all.  Then less than a minute later, it showed up again a little farther North.  But this time I watched as it gradually and evenly increased from invisible to a tiny pinprick of light, then to it's full brightness and back again to invisible. At this point, I ran inside to get my fiancee to come outside to witness it.  I told her to look up to where I guessed it would show up again, and sure enough, after about 10 seconds, it appeared again - exactly like the previous two times.  I had her run inside to get my binoculars, and while she was gone, it appeared one last time before it disappeared from view. At its maximum brightness, the object was much brighter than any object in the sky - brighter even than Jupiter at its maximum brightest.  The object appeared to be travelling  North from around Saturn towards Ursa Major and was completely silent.  Also, it seemed to be travelling significantly higher and/or slower than commercial airplanes normally fly.  The color of the light was always brilliant white when visible.  Finally, the object spent more time invisible than visible as it was travelling.    I've seen countless planes and helicopters around here (a couple miles Southeast of the US Air Force Academy) and have never seen one that had lights like this object.  I've seen satellites as well and this object appeared much, much brighter than any satellite I've ever observed.  The entire sighting lasted for about 3 minutes.",
      "link": "http://www.nuforc.org/webreports/098/S98878.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bff7e",
      "summary": "Red, blue, white and green high in sky; didn't move.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2013-10-03T00:00:00",
      "story": "red, blue ,white and green high in sky , didn't move. Complete darkness, heard static sound with radio.  I looked outside  huge, flashing red, blue green and white lights.  It didnt move at all.  For hour and half then another one really bright sitting horizontal looked like moving closer to it.  I had to go to bed no set time it left it was still their at 4:40 am",
      "link": "http://www.nuforc.org/webreports/102/S102868.html",
      "state": "CO",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0220",
      "summary": "When my sister and I were little kids, we saw a disk-shaped ufo hovering over our apartment building.",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2013-04-12T00:00:00",
      "story": "When my sister and I were little kids, we saw a disk-shaped ufo hovering over our apartment building. My sister was five years old and I was seven.  We lived in an apartment complex with my mom, two other sisters and step-dad.  My sister and I were outside jumping rope.  We heard a loud noise as if an airplane was landing near-by.  It got really windy.   We saw a circular, disk-shaped aircraft hovering just over our apartment building.  It was grey in color and it had lights around the side of it, circulating around it.  It was very loud, and it wasn't very big because it wasn't any bigger than the building.   We stood looking at it for a bit, arguing about what we should do.  We both wound up running inside to tell our mom, who didn't believe us and wasn't willing to come outside.  However, she did say that she heard a loud sound like an airplane, but she believes that is all it was.   When we ran back outside, the flying object was gone.  We never saw anything/anyone come outside of it.  Both my sister and I remember the event so vividly and in the exact same detail, although it happened when we were little.  I don't know who to talk about it because nobody believes us but our grandpa, who told me he saw a ufo once. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96929.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04fb",
      "summary": "Fast moving yellow/green glowing fire ball with comet trail in Colorado Springs, \"lands\" at Air Force Academy.",
      "city": "coloradosprings",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "&gt;* Fast moving yellow/green glowing fire ball with comet trail in Colorado Springs, &quot;lands&quot; at Air Force Academy Approx 12:45am Friday, December 07, 2012 My daughter and I were driving northbound on the 1-25 Freeway last night at about 12:45am.  Right as we reached the Woodmen exit I saw something out of the corner of my eye that attracted my attention.  My daughter was driving so i was able to stare at this until it disappeared.  Up and to the left of our car I saw a very fast moving bright green/yellow ball of light that had a green trail like a commit.  I’ve seen \"falling stars\" before and it looked a lot like that in that it got bigger and brighter until it \"disappeared\" only it was bright green and it wasn’t way up in the sky. It was very low.  I know this wasn’t an optical illusion because I could see the outline of the mountain and it was definitely below the mountain line, in front of the mountain, and was parallel to the freeway at that point. I immediately stared at it as it passed our car like we were standing still.  (we were traveling at about 75mph at the time).  It came down at about a 30° angle then it disappe! ared out of my view.  It looked to me like it would have been pretty much right above Falcon Stadium at the Air Force Academy when it \"disappeared.\"  At that point I can’t tell if it landed or it actually disappeared... it was low enough at that point that it was behind trees & buildings and I just couldn’t see it anymore.  This thing was completely silent.   I’ll tell ya what, it freaked me out.  I’ve never seen anything like that before. I tried my best to recreate what I saw with a paintshop program.  Keep in mind this is a daytime google image I’m trying to make look like midnight, but the overall effect is very close to what I saw.  See image here:  http://postimage.org/image/bzl411yil/full/ ((NUFORC Note:  Witness submitted a nice illustration, which we have posted to the NUFORC homepage.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95071.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c083e",
      "summary": "I saw 3 red or orange sphere shaped lights aligned in a triangle like shape there were very low so I knew it wasn't a airplane and it w",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2014-01-10T00:00:00",
      "story": "I saw 3 red or orange sphere shaped lights aligned in a triangle like shape there were very low so I knew it wasn't a airplane and it was very quiet and it was there for about a minute and then one by one faded out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105739.html",
      "state": "CO",
      "duration": "2:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c096e",
      "summary": "Big Brown Bird in night sky like a huge V no wing movement.",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "Big Brown Bird in night sky like a huge V no wing movement. So i step outside for a cigarette and start watching the sky facing east.  Suddenly something blurry drifts past my vision.  I turn my head to watch where its going.  It looked almost brown compared to the sky.  It was in the shape of a V.   It flew really low compared to an airplane.  It wasnt as big as a 747 it think theyre called.  But way bigger than a bird. I ran to the other side of the building to confirm but it faded form my sight.  Like it got to far away to see.  It was flying south. It had no lights, and no sound.  It seemed to just glide.  It seemed to slow to stay in the air.  For a moment I thought it was my eyes playing a trick on me but it blocked star light as it passed. Im certain I saw something but I still wanna know if anyone else saw it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103548.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0bc7",
      "summary": "Clear spheres (50+) with something silver inside moving quickly in a group.",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2014-02-21T00:00:00",
      "story": "Clear spheres (50+) with something silver inside moving quickly in a group. Sitting mid-day in the backyard we noticed these clear spheres with something silver inside. Some 50+ of them moved in a group and had some stragglers taking up the rear.  We sat and just watched them.  Unbelievable – these were something we had never seen before nor could compare them to anything we know of.  They moved quickly and in a group. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107183.html",
      "state": "CO",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c5b",
      "summary": "The stars were alive.",
      "city": "coloradosprings",
      "shape": "",
      "date": "2014-01-10T00:00:00",
      "story": "the stars were alive January 1, 2014 At midnight I was looking out the second floor window to the west with my binoculars at the fire works on Pikes Peak. The fire works on Pike ended. A few blocks away someone had shot a few fireworks.  I noticed a clusters of about 25 stars lower than the other stars in the sky, above me.  I thought it was beautiful remnants of the fire works because I could see they were moving slightly.  These stars or lights weren't falling out of the sky like fire works would, but moving around, sort of in formation. Looking at these lights threw my binoculars they looked exactly like the stars in the sky only moving.   I watched them move and dance around in the sky about twelve minutes until they all flew over the house and away, traveling south east.  They didn't look like UFO's. It looked like the stars in the sky were alive :)   My husband tried desperately to get his camera/video to work. Ha!  It was like the stars didn't want that to happen and it didn't.",
      "link": "http://www.nuforc.org/webreports/105/S105834.html",
      "state": "CO",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d13",
      "summary": "Cluster of \"stars\" move after being at a stand still.",
      "city": "coloradosprings",
      "shape": "formation",
      "date": "2014-01-10T00:00:00",
      "story": "Cluster of \"stars\" move after being at a stand still. My friend and I saw a clustered line of white stars to the north.  There were about 25-30 \"stars\" and they made a top-to-bottom style formation.  It was at a complete stand still when first observed.   Moments later, they all broke formation and went east across the sky at a slower than normal pace.  I tried to record it on my cell phone, but the camera couldn't capture the light in the night sky.",
      "link": "http://www.nuforc.org/webreports/105/S105820.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17f4",
      "summary": "Large gray object and 20 little ones floating in the sky.  ((NUFORC Note:  Photos shows gray, blurry, indistinct object.  PD))",
      "city": "coloradosprings",
      "shape": "egg",
      "date": "2014-07-20T00:00:00",
      "story": "Large gray object and 20 little ones floating in the sky Woodman and Academy 9:45 am.  Saw what looked like about 20 skydivers, only they weren't coming down.   One large gray object with no lights floating slowly under the cloud and about 20 smaller black things floating around it.   Stayed for about 15 minutes then the little things went above the clouds and the large object following shortly after.   I have a photograph and video of the large object. ((ADDENDUM FROM WITNESS)) The date was June 16th 2014. I noticed it at 9:45 am and ended at 10:00 ((END ADDENDUM)) ((NUFORC Note:  Photo shows blurry, indistinct, gray object, below solid overcast.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111584.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c19cf",
      "summary": "Four white spheres cruising through the sky over Colorado Springs, Co. on 20July 2013.",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2014-07-04T00:00:00",
      "story": "Four white spheres cruising through the sky over Colorado Springs, Co. on 20July 2013. Working in back yard.  Sat down and put my head back and noticed a white sphere, then three more moving from east to west towards Pikes Peak in a two by two formation.  Watched them for about 20 seconds before they were blocked by clouds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110863.html",
      "state": "CO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c79",
      "summary": "flashing light (s) high up between NORAD and Pike's Peak",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2014-07-04T00:00:00",
      "story": "flashing light (s) high up between NORAD and Pike's Peak Bright flashing light between NORAD and pikes peak.  It was flashing green, red, purple, orange and a bluish color.  It was doing a small figure eight pattern up and down for five or so minutes then every 30 to 45 seconds what looked like a second craft melted away from the original craft each became half the size when it was one piece.   Both craft were maintaining the up and down figure eight pattern.  The flashing of the light increased in speed till it just flashed out gone but with as far as I was from this event,  This thing or things was HUGE.  I really hope I wasn't the only one who saw this insanity.",
      "link": "http://www.nuforc.org/webreports/110/S110789.html",
      "state": "CO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ce4",
      "summary": "I took a picture of a storm, I zoomed in and saw a double fireball shaped object, I wanted to report this because I don't know what it",
      "city": "coloradosprings",
      "shape": "fireball",
      "date": "2014-06-13T00:00:00",
      "story": "I took a picture of a storm, I zoomed in and saw a double fireball shaped object, I wanted to report this because I don't know what it is.",
      "link": "http://www.nuforc.org/webreports/110/S110175.html",
      "state": "CO",
      "duration": "picture taken"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d95",
      "summary": "One large object  followed by several silver lights in no particular order. The lights were following the larger object",
      "city": "coloradosprings",
      "shape": "formation",
      "date": "2014-06-20T00:00:00",
      "story": "One large object  followed by several silver lights in no particular order. The lights were following the larger object I was parking my car on North Academy outside of the Dollar Tree when I saw a large object moving directly north towards me.  I could tell it was going way too slowly for a plane or a helicopter, and it took about 10 minutes to reach right above where I was standing and then veered off north west.   I grabbed the binoculars out of my car and I could barely make out a huge bunch of what looked like balloons (hundreds of them), BUT what was really weird is it had been followed the entire way by an escort of 8 or so silver colored lights.   They were up way higher than the large object and seemed to be following it.  I pointed them out to another lady who got out of her car and she said she could see them too.   When I first saw them I honestly thought it was a squadron of jet fighters, tailing a plane of some sort but they were not jet fighters and they all disappeared into the clouds when I lost sight of them all. ((NUFORC Note:  We spoke via telephone with this witness, and she sounded to us to be quite eloquent, and serious-minded.  We suspect the the report is quite accurate.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110279.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1fdb",
      "summary": "((NUFORC Note:  No information provided by witness.  PD))",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2014-05-08T00:00:00",
      "story": "((NUFORC Note:  No information provided by witness.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109197.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c21e1",
      "summary": "Very bright round  light moving low in the sky",
      "city": "coloradosprings",
      "shape": "oval",
      "date": "2014-04-11T00:00:00",
      "story": "Very bright round  light moving low in the sky I was sitting outside smoking and i looked up and there was a bright light above the house across the street and it was moving side to side and up and down i got my video camera and recorded it but forgot to zoom in i was so freaked out ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108463.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c21e2",
      "summary": "Bright light above my house.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2014-04-11T00:00:00",
      "story": "Bright light above my house. i looked out side and i saw 3 orange lights under a blue light and grabbed my video camera.",
      "link": "http://www.nuforc.org/webreports/108/S108465.html",
      "state": "CO",
      "duration": "1:30"
    },
    {
      "_id": "64d005f478aba2ec5a3c230e",
      "summary": "Silent Green Explosion Lights Up Colorado Springs",
      "city": "coloradosprings",
      "shape": "oval",
      "date": "2014-04-11T00:00:00",
      "story": "Silent Green Explosion Lights Up Colorado Springs. We were sriveing to drop off a friend at the bus stop when all of a sudden we all seen this greeen light flash ansd light up the whole sky litterally. We were shocked it was like an silent explosion that fell on earth.   I dont kniw what this is but it was shocking.  I never seen anything like it in my life. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108483.html",
      "state": "CO",
      "duration": "Green Light"
    },
    {
      "_id": "64d005f478aba2ec5a3c2549",
      "summary": "Saw 7 big bright lights not moving and the were low to the ground. We were speechless. As we were getting our phones out the disappeare",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "Saw 7 big bright lights not moving and the were low to the ground.  We were speechless.  As we were getting our phones out the disappeared one by one.  It looked scary!  My husband is a non believer, but he was speechless too.",
      "link": "http://www.nuforc.org/webreports/114/S114623.html",
      "state": "CO",
      "duration": "East"
    },
    {
      "_id": "64d005f478aba2ec5a3c2538",
      "summary": "3 lights blinking erratically then synchronized.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "3 lights blinking erratically then synchronized. 3rd sighting this month. This time it was three lights.  Middle light was brighter than the other two.  Other two were exact same dull brightness.  All lights were stationary. Middle light was blinking erratically from white to red to blue to green.  Then it would stop blinking and return to a dull white and the other two lights would flash at the exact same time.  This went on for a few minutes until they all lit up erratically and slowly disappeared.  They looked to be well above cruising altitude for airliners.",
      "link": "http://www.nuforc.org/webreports/114/S114592.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c25a9",
      "summary": "In the southeast part of the sky there is a round object. Its blinking red, Blue and,Green. Just north of that there is another just li",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "In the southeast part of the sky there is a round object. Its blinking red, Blue and, Green.  Just north of that there is another just like it",
      "link": "http://www.nuforc.org/webreports/114/S114931.html",
      "state": "CO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c2665",
      "summary": "White light in the sky, rising, getting brighter, then white orbs, then red light rising from cloud.",
      "city": "coloradosprings",
      "shape": "changing",
      "date": "2014-12-05T00:00:00",
      "story": "White light in the sky, rising, getting brighter, then white orbs, then red light rising from cloud. I was standing on my porch, in Colorado Springs, CO, around 6:24 p.m. on Oct. 11, 2014, when I noticed an unusual light in the sky.  I am on the west side of town, and I was looking south, between Pikes Peak, and NORAD.  As I watched, the white light started going up, and getting brighter.  At this time, I asked to my wife to get my camera.  When I looked back, I now saw two white orbs, with one of them looking to be a lot higher in the sky than the other one. My wife came outside with the camera within a minute or two, and I started filming.  I lost track of one of the objects, and for some reason, I was having trouble keeping track of the other object.  After about one minute, I lost the object, and turned off the camera. At 6:30 p.m., I saw a red light rising slowly from a cloud, in the same area that I saw the white light, and white orbs, earlier.  I called my wife outside, and I lost sight of the object, while I was trying to show her where it was.  I turned off the camera, quickly spotted the object, and started filming again.  As we watched, it seemed to change color.  I got less than 30 seconds of video, that time, before I lost sight of the object again, and could not find it again.",
      "link": "http://www.nuforc.org/webreports/115/S115817.html",
      "state": "CO",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2721",
      "summary": "It was red and didn't move.  After 10 min., it disappeared. First sighting it looked silver",
      "city": "coloradosprings",
      "shape": "egg",
      "date": "2014-10-03T00:00:00",
      "story": "It was red and didn't move after 10 min it disappeared.   First sighting it looked silver",
      "link": "http://www.nuforc.org/webreports/113/S113887.html",
      "state": "CO",
      "duration": "south"
    },
    {
      "_id": "64d005f478aba2ec5a3c26eb",
      "summary": "I was sitting in my car with my little brother looking into the sky. There were two specks of a yellowish light one flying N, one S.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2014-12-05T00:00:00",
      "story": "I was sitting in my car with my little brother looking into the sky.  There were two specks of a yellowish light, one flying north, and one flying south, very awkwardly close to each other.   They looked like really small circles of light, like a star size speck you would see in space as you look up at night, but it was flying as high as a small plane would.  They were flying too close to each other for what, I think, air traffic control would allow.   These floating lights were not flashing or have any other red, green, or otherwise strobe lights. I have been going through the process of ascension, so maybe I am beginning to see 5th dimensional energies.",
      "link": "http://www.nuforc.org/webreports/115/S115648.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c27ea",
      "summary": "Fiery bird like, flapping reddish yellow and white light.",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2014-10-10T00:00:00",
      "story": "Fiery bird like- flapping reddish yellow and white light. Red, yellow, and white light. Looked like it was flapping almost like a bird..  Massive size with no noise.  2nd sighting in a week.  Had to be 10,000 feet in the air and moving twice as fast as a plane.  Lights were not bright but more dulled.",
      "link": "http://www.nuforc.org/webreports/114/S114221.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c284b",
      "summary": "Red and green lights over Olympic Training Center.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2014-12-05T00:00:00",
      "story": "Red and Green lights over Olympic Training Center. Leaving from work early Saturday morning around 3:30 A.M. I noticed red and green lights off in the distance over the Olympic Training Center.  It stood out to me because I had never noticed the lights before.  As I continued driving I saw it was hovering over the OTC.   When I stopped driving it quickly shot out to the North.  It had no sound and I could not see any shape to it.  I watched it move off into the distance as far as I could see, it until it disappeared.",
      "link": "http://www.nuforc.org/webreports/115/S115782.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c282c",
      "summary": "tight v with dull white lights.",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2014-10-10T00:00:00",
      "story": "tight v with dull white lights. After sighting fifteen minutes ago another one.  5 dull white lights in a tight v formation. Moving very quickly with no noise. Moved in the same line as last object.",
      "link": "http://www.nuforc.org/webreports/114/S114217.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2998",
      "summary": "2 dull lit glowing orange objects.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "2 dull lit glowing orange objects. My wife and I saw two dull lit orange lights flying through the sky.  They were about half a mile away from each other, completely silent, and moving slow.  They both disappeared at the same time.  I tried to record video of the objects but its hard to see them.  Although they were high in the sky my dog starting freaking out for no apparent reason.",
      "link": "http://www.nuforc.org/webreports/115/S115040.html",
      "state": "CO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2aee",
      "summary": "Object stopped then flashed a bright blue light and went north at a very high speed.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2014-08-29T00:00:00",
      "story": "object stopped then flashed a bright blue light and went north at a very high speed. On. August 29 2014 I spotted a very bright light in the sky.  It was just above some thin low clouds to the south west of Colorado springs by NORAD.   The bright object stopped behind in some low clouds  heading east, to start between I/25 and hwy 85/87.  After about 15 seconds behind the cloud then went east just enough that I could see it. An airplane coming the same path confirmed that it was intact a UFO.  The star like object then flashed an extremely bright light before shooting to the north at an astounding speed.  This is not the first one I have screen in this area and I wonder when some truth will come.  I see it.  Don't u? ((NUFORC Note:  Both time and date in the original report were flawed.  We have amended both above.  Possible hoaxed report??  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112784.html",
      "state": "CO",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e0a",
      "summary": "Low flying, bright lights that changed from white, red, blue and green.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2014-09-18T00:00:00",
      "story": "Low flying, bright lights that changed from white, red, blue and green. I noticed an object floating with a bright white light in the rear and a bright red light in front.   At first I assumed it was a commercial plane, but then the light turned to a bright blue, then green then back to white and red.  This pattern continued to change. In it's flight pattern, it maneuvered in small tight spirals like a emote controlled plane would move.  But being it was pitch black out, and there was no sound plus the brightness of the lights, it could not have been a model aircraft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113661.html",
      "state": "CO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3142",
      "summary": "Looked like a star, but wasn't.",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2014-08-08T00:00:00",
      "story": "Looked like a star, but wasn't. Saw a light and thought it was a star only it was this side of the cloud.   It was at tree line (11,500 ft altitude) to the north of Pikes Peak.   Very still and then it climbed rapidly to a height of about 15,000 feet and then returned to the original spot.   Changed colors from white to red and then went down very slowly and disappeared into the trees.",
      "link": "http://www.nuforc.org/webreports/112/S112268.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c329e",
      "summary": "Unknown lights chased by 2 helicopters disappear in the night sky on April 1st.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2015-04-08T00:00:00",
      "story": "Unknown lights chased by 2 helicopters disappear in the night sky on April 1st. I was standing outside in my back yard listening to loud music in my headphones when I heard a vibration.  I removed my headphones to get a better grasp on the location and looked and saw 2 helicopters of unknown color flying super low with only marker lights on. In front of the helicopters were 2 detached glowing lights of no particular origin.  The lights were being followed at a fast past by the choppers, and when my vision became obstructed, I lost one of the lights.  By this time, because of the low altitude, I could feel the vibrations from the choppers propellers and hear the loud engines of the choppers but could not hear any noise from the lights. As I watched the other light, unblinking by this time because of my suspicions, the light vanished into thin air, leaving the choppers to chase a wild goose.   The other witness is someone I met in the direction the lights were going. I walked up the street and saw police on the block, so I asked if they saw th! e choppers.  They said yes. I asked if they had seen what the choppers were following, and they said no, so I told them my story, which they proceeded to laugh at because of the date and the insaneness of the story.  A little further up the road, I saw a group of people standing so I asked them the same questions. Immediately after the second question, one man said, \"Yes, the light!  It just vanished!\"  He hadn't wanted to say anything about it to the others because he feared he would sound crazy.  Apparently, he caught it after the first had already disappeared because he told me he had only seen one light.   Other people acknowledge only the low flying helicopters like the police did because they only heard the noises and felt vibrations from the choppers. I'm reporting this here because I know I'm not crazy.   I love space, I follow NASA, and I know the difference between a satellite and an airplane. The lights I saw were not attached to the choppers, and if they were so! meone would have heard a bang when they fell off, being a resi! dential neighborhood near a busy street.  It is because of this fact that I thought more people would see it, but it was only myself and the other gent.",
      "link": "http://www.nuforc.org/webreports/118/S118217.html",
      "state": "CO",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36e8",
      "summary": "Bright orange object moving across sky",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2015-01-07T00:00:00",
      "story": "Bright orange object moving across sky I went outside with my dog around 7 pm.  I was facing west. I saw a bright orange light moving across the sky.  It looked like it had spikes of light coming out at the top, bottom and both sides.   I called for my son and asked him, \"What is that?\" He replied, \"I don't know, but it's below the clouds.\"  My vision is a little fuzzy at night, so I asked him to get my glasses.  He grabbed them and ran back out with them.  The spikes coming off it weren't as pronounced when I saw it more clearly, but they were still there.  My son thought it looked like it was on fire.   It proceeded to the north and after a couple minutes just faded and disappeared.  There was no sound, and it wasn't moving very fast.   I googled \"bright orange ufo over Colorado Springs\", and there were several images that came up.  Several of them looked exactly like what my son and I saw.",
      "link": "http://www.nuforc.org/webreports/116/S116260.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3934",
      "summary": "Semicircle of lights hovered about 100 feet above me.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2014-12-22T00:00:00",
      "story": "Semicircle of lights hovered about 100 feet above me I was on a run at night by myself near where I lived at the base of the Rocky Mountains in Colorado springs.  While I was stopped for a moment some kind of aircraft flew over to me.  I watched it approach and it came and hovered about 100 feet above me for maybe 5 or 10 seconds.  All I could see of it was a perfect semi circle made of separate lights.  I believe it made an odd sound like a quiet helicopter but I don't specifically remember the sound.  It seemed about the size of a helicopter.   At this point I was very scared and ran back to my house as fast as possible but I believe I saw it flying off to the south after this.  It flew at a very normal speed. I don't remember all the details because afterwards I assumed it was some kind of helicopter and only recently started looking into it and found that there don't seem to be any kind of aircraft with a semicircle of lights around the front, but there are many suppsed UFO sightings described as a semicircle of lights. I do not believe that God created life outside of this planet but I believe that demons are real and deceptive and we must be wary and equipped with sealed protection in a relationship with Jesus Christ.  With Him we have nothing to fear because Jesus is already victorious over satan.",
      "link": "http://www.nuforc.org/webreports/116/S116110.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3931",
      "summary": "I once studied architecture and instead became a gent.  In the east-northeast of Colorado Springs in the Garden of the Gods area an eve",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2014-12-18T00:00:00",
      "story": "I once studied architecture and instead became a gent.  In the east-northeast of Colorado Springs in the Garden of the Gods area an event occurred in the sky.   A silver pill shaped light appeared into the sky and then moved at a super rate of speed.  I will add more math details to attempt to calculate speed and size of this object according to the first memory of it.   It appeared with alacrity.   I was not looking directly at the spot where it appeared but because it just appeared so fast that my eyes registered the bright silver light in the east  that I witnessed it move so quickly.  It did not slide into view.   It “turned on” as one would a switch.   I surmise that either I seen it enter into view and zoom off into the mountain range.  Or that it entered into visible sight and kept its momentum.   The actual sighting lasted one second or less and the time from the moment I registered a event happening by sight to when I recognized this elliptical silver bight light move very quickly.  Aren’t comets always like yellowish because when they are burning in the entry of the atmosphere they get superhot and burn?  This one was like a low power purple florescent light.  Had I been able to see it wink out in the sky like normal I wouldn’t be writing this but it was far enough that a building across the street hid the rest of its final moments in the visible sky.",
      "link": "http://www.nuforc.org/webreports/115/S115965.html",
      "state": "CO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3dc2",
      "summary": "Gold metallic object hovering in the blue sky.  ((NUFORC Note:  Photo provided of very small, blurry object.  PD))",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2015-07-23T00:00:00",
      "story": "Gold metallic object hovering in the blue sky. Gold metallic light hovering in the same place for 30 minutes.  All co-workers saw the same object.  Commercial air traffic changed course and flew around the object.  Object was at cruising altitude.   No clouds are in the sky.   Gradually faded out of sight. ((NUFORC Note:  Photo provided of very small, blurry object.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120582.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f65",
      "summary": "Two spherical lights, one disappearing and reappearing in a different area. Plus an exceptionally bright star that seemed to grow longe",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2015-06-15T00:00:00",
      "story": "Two spherical lights, one disappearing and reappearing in a different area.  Plus an exceptionally bright star that seemed to grow longe While driving home I witnessed two very big lights...they were like stars but bigger, and you could see their roundness.  I saw one of them fade away and then reappear in a different area.   Also, there was this peculiar star that was very bright tonight that I don't recall ever noticing (this is actually what had me staring at the sky) and it appeared to get longer with time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119524.html",
      "state": "CO",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c4021",
      "summary": "Three flashing objects in night sky over Colorado Springs.",
      "city": "coloradosprings",
      "shape": "flash",
      "date": "2015-05-22T00:00:00",
      "story": "Three flashing objects in night sky over Colorado Springs. Caught two flashes and one very slow trailing object in the night sky.  Flashes were bright and dimmed slowly.  Two front objects were moving at about twice the speed of an aircraft.  Most likely two front objects were around cruising altitude for airliners and trailing object appeared much higher.",
      "link": "http://www.nuforc.org/webreports/119/S119077.html",
      "state": "CO",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4243",
      "summary": "Documented unexplained light.  ((NUFORC Note:  Sighting of Venus??  PD))",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2015-04-30T00:00:00",
      "story": "Documented unexplained light Last night, I looked out my wife and I's bedroom and saw a bright pulsating light over Pikes Peak area.  It appeared to change shape and had variations in the pulsing. ((NUFORC Note:  Sighting of Venus??  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118693.html",
      "state": "CO",
      "duration": ">1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c440f",
      "summary": "Two UFOs and one floating military plane in New Mexico.",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2015-10-29T00:00:00",
      "story": "Two UFOs and one floating military plane in New Mexico. March 1980, my husband and I were on the way to the Rocky Mountain Siberian Husky Club specialty in Denver, when we stopped for gas in Colorado Springs.  It was dark, early evening when we stopped, and I was on the right side (passenger) of the car pumping gas. My husband went in to use the restroom and pay for the gas. I saw a silver, round, disk craft come into view.  The only lights it had were the row of windows that went around the middle of the craft.  It sort of floated into view as I stood there staring at it, and I remember that I was surprised that no one else seemed to see it.  It made no noise and came from the north.  It was traveling so slowly that I got a good long look at it. As it got closer to being directly in front of me, I saw a “being” standing in one of the windows. It was almost as tall as the window and seemed to be looking right at me.  I looked around again to see if anyone else was looking and they were not.  When it got directly in front of me, it gently turned and floated off to the east and disappeared off into the distance. End of story. Winter 1986, my husband was running our sled dogs up on U S Hill, southeast of Rancho de Taos.  It had been a mild winter and we had to go high to find enough snow to run on.  We were on our way back in, I was on, “Gus the Beast,” snowmobile, and I was stopped on the north side of the mountain, just down from about 10,000 ft.  I was in the shade, sitting on the snowmobile, enjoying the peace and quiet, waiting for the team to catch up to me (I would go out in front to pack trail and be there just in case of an emergency of some kind.)  I was looking out towards Wheeler Peak when I felt a shadow go over me.  I looked up, thinking that I would see a raven – they would follow the team and often came in ahead of them – but instead, I saw a military aircraft, painted in camouflage, drifting down the valley towards Wheeler Peak.  There was NO NOISE!  It, just like the UFO in Colorado Springs, just floated away until it was out of sight. Looking at photos of aircraft, I think I must have seen the Rapture. That is as close as I can come to naming it. End of story  May 1968 I was going to The University of Albuquerque and my boy friend and I were going back to campus from a ball game near the Rio Grande Zoo.  We were on Central Avenue when I looked over towards the Country Club area, and saw a silver cigar shaped something in the sky.  I looked away and when I turned back, the trees blocked the sky.  It was a ways away, and not very big.  I doubted if I had really seen something. End of Story ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122967.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c468d",
      "summary": "Multiple UFO craft, abnormal turns and accelerations and appearing from nothing and then vanishing",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2015-11-26T00:00:00",
      "story": "Multiple UFO craft, abnormal turns and accelerations and appearing from nothing and then vanishing 10-23-2015 Colorado Springs, Colorado, (Security area) UFO sighting.   Just after 4:00pm Just saw a UFO from my front yard in Colorado Springs, Colorado, as I was facing towards the South/South-East.  The flying objects were located almost straight up, thousands of feet up. (25? More?  By the time the encounter was over I had observed 4 different flying objects with the 1st morphing through three very different shapes during the encounter.  (Cigar, circle, then bell- Final shape when it disappeared between flickers)   When I noticed the first object, it caught my eye by being so white and shiny there amongst the blue backdrop of the sky with a only few high altitude clouds not far off from the fast steady moving cigar shaped craft.  It was the shape of a plane fuselage without wings and moving at high speeds across the sky with no vapor trail.  I could discern no details at this moment save the shape (cigar) and a flickering color. I watched if for a minute, it was way up there past the highest clouds, small to the naked eye. A single whitish craft with slight silvery sheen around an object that’s mostly white looking although there is setting sun colored (pinky orange) flashes towards the bottom side facing the sun. (The setting sun I believe is what gave it the appearance of flickering or flashing on that side no matter what direction the craft was traveling.  It may be reflection of the setting sun upon areas of the craft as the craft spins)  (It could almost be mistaken for a plane if it were holding a steady altitude and going a normal aircraft speed which at first it was, as if mimicking a normal aircraft in speed and altitude)  So in all the cigar shaped object seemed to be flickering a weird metallic white hue about most of the craft with pink/orange flashes radiating from the bottom-front sun facing side as it moved or darted about what seems like a long ways away almost straight above my house. This thing started moving like no aircraft known to civilian science as the motions defied my minds visual knowledge of physics in action.  Everything in me screamed this motion was unnatural for machines of man.  Every cell in the core of my being knew that what I saw was not possible within my now shattered understanding of the laws of motion. This movement and motion has only been hinted at in sci-fi movies and I must say that the movements of these objects were very different than even ‘that’.  How could something survive the forces, I could only guess, were in playing upon those craft and what about the effects upon any posible biological entity. This motion from the flickering shimmering glittery pink-tinted spheres were doing some short-range fast acceleration/deceleration maneuvers, zipping and pausing and darting around almost like the motion was governed by something my mind has no concept for comparison.  Their motion was different than anything I even seen in the movies, which is what gave me such a sick odd feeling in the pit of my soul.  (I have never experienced a sensation like that, which I felt while watching these objects. Knowing I was not alone in what I saw made me feel more ‘real’ than I ever have.)  The UFO started out as one cigar shaped object flying in a straight line at very high velocity before coming to a fast stop and changing directions.  For a couple minutes it darted about instead of staying upon the course I saw it upon originally. The object moved fluidly with fast stops and starts almost like a darting hummingbird with very little curving to its flight path as you would expect from any plane or aircraft known to the US and any other nations of the world. Human craft would need to bank and arc around in a circle to change directions. This was ‘No’ plane. I have worked on many aircraft and ‘nothing’ that is not mentioned in science fiction comes close to this behavior.  These craft moved about like predatory birds dogfighting at speeds and direction changes that defy imagination. Just think of the unbelievable g-force conditions exerted. I went to the front door to call for others to come see the UFO’s. When the two other witnesses showed up I pointed up to it and noticed that it was now circular shaped and fading in and out of view while hovering and appearing to dart around in a tight area. I realized the craft I relocated, ‘This craft’ was no longer cigar shaped, but circular in appearance all darting and flickering about close to the same area I last saw the original cigar shaped craft.( Did it change or was it a different craft. When I opened the house door to get someone else to see the weird objects, I lost site of the original object). It seemed to be winking in and out and hoping from being in one place to being in another close by. My mind had a hard time believing that metal could be made to move like that. These were no known manmade objects and these flying objects were real and right there in front of us all. Then, as I am pointing at it and the others are saying how weird it was moving and with everyone looking after having located the UFO, within moments, 3 more small whitish flickering UFO objects also circular and the same size as the first, appeared out of nowhere almost on top of the first. To me, at first, the first craft I saw seemed to be winking in and out, but then I started seeing two and three winking at the same time until ‘4’ circular/sphere shaped flying objects seemed to appear into existence. (Listen to what I am SAYING. ‘They’, three new UFO’s, just appeared, right in front of our eyes. When I say appeared, I mean that the one object was there alone. ((At least there was nothing else of interest within my visual spectrum although the jet had taken off climbing in a lazy mechanical manner flying a southerly direction with these UFO craft almost directly overhead)) It was just there alone one second and then the next second, three others start showing up, flickering in and out of visual sight.    There was no interception from the ground. I absolutely can tell you there was no craft on approach from earth. (One plane did take off from the base heading southeasterly direction with nothing in common as to shape or mannerisms. When I would glance at the plane I couldn’t help but keep thinking that, ‘THAT’ was how I was taught metal was supposed to act while in flight) Now there are 4 moving around the first with 2 hovering a lot within the first ones flight path while the 3rd seemed to be chasing the first. The original would zip one direction and the 2 would move as if to block and the first one would get close and stop very abruptly, a few times they got so close they were hard to make out as 2 separate objects. The 3 new arrivals appeared to be the same size as the first. The only explanation I can think of is that they came from out of the atmosphere at unbelievable speeds from way higher up than the original UFO. This seems a lame view of what happened, as we were watching the first one, the others just showed up blinking in and out of existence before solidifying for the rest of the encounter until they vanished for good. CLOAKING? When I say they just appeared I mean they (the 3 new comers) weren’t smaller looking than the 1st craft and on an intercept course until they got close enough to see them as being the same shape and size. ‘No’, these things just appeared from out of ‘nothing’. There was one, and then there were 4 with 3 flickering in and out of existence for a few seconds longer than the first before they stabilized and remained in sight. These newest three craft just showed up like they were winking in and out existence or our visual spectrum for a few seconds (like flickering fast) and then they were all within our full view. Then the block and chase maneuver started from the three newcomers. I look at the plane that took off and marveled at how the motions of the plane and the motions of the UFO’s were so very in contrast with each other. Then I realized how unique my sighting was. I actually have a visual reference of one of humanity’s flying machines in flight in the same area as four unknown flying objects that defy conventional motion and shattered what I took to be reality of the limits of motion and metal. I saw these objects. I saw how they were moving and seeing ‘is’ believing. ‘I now know, ‘that’ kind of motion is possible, for I saw it and believe it to be as true as the flight of the contrasting plane. They were both there and they were both real and vastly different. I know now first hand of the limitations to our own reality and the hardwired from birth ‘limits’ set in place within our own minds. Limits upon our beliefs and what we KNOW (were taught) to be true, on what we think is the entire scope of reality, machinery, physics and motion. Wake up ‘Please’. These limits themselves have limits and are not permanent. We can wake up our misguided views of the world. I have been shown a true taste of what’s possible. I know it’s possible because I saw it with my own eyes. In full focused contrast against an American aircraft in flight. I liken the feeling to showing a cell phone to an old west cowboy in the early 1800’s and showing that it works and that its real and there in front of him and that this tech is possible. I feel like that cowboy. Here are my comments on the aircraft: An aircraft took off around 4:15 give or take. When sight was lost on the original and only remaining UFO I went inside to check the time and it was 4:25GMT. The UFO on last location was almost straight over the house behind me now as I am facing between Cheyanne Mt. and Pikes Peak Mt. in Colorado Springs Colorado. The US Aircraft was heading south easterly where the flight paths would cross the original encounter location albeit at a far lower altitude. The plane was in no danger of collision as the UFO’s altitude was far greater and they(the UFO’s) were in and out of the clouds during their chase. Not in and out really just behind and peeking out from around as the cloud passed by. Visibility was excellent with very light cloud groups, very small very high up. As the Plane got further and further away the UFO objects still looked far away and above the plane’s flight path. The UFO objects appeared to be staying the same size as the aircraft receded from sight and it gave me a weird kind of dual reference point from my perspective of looking at both types of craft within the same field of vision, almost straight up from my front steps facing a southeasterly direction. Then I went to get the binoculars out of the van and it was really hard to find the targets. As I was looking for them in the binoculars, the three pursuit craft just winked out first one then the other two at about the same time. The original UFO that used to be a cigar shape, when I looked at it through the binoculars, I could see a definite bell shape, that for a few seconds I thought it had flickering on and off lights. It wasn’t really flickering lights on and off, It appeared to be rotating/spinning very fast with these quick flashes of pinky white glinting at the bottom corner of the craft that was facing the setting sun. The rotation was defined by a massive black form that interrupted the whiteness as it rotated. I just saw black splotch interrupting the whiteness with a much faster sunset color flickering or maybe flashing as if the sunlight was reflecting off of several objects upon the crafts side. It was a little hard to comprehend, but there were three flashes of sunset color in the bottom side that was facing the sun, per one black flash that never blacked out the overall whiteness of the object. This gave the definite appearance or rotational motion. Then with the craft in view through my binoculars, it vanished. Now try to comprehend what I am saying here. I mean, it disappeared between flickers. From one flicker to the next it just wasn’t there anymore. This was the last I saw of the UFO’s.",
      "link": "http://www.nuforc.org/webreports/124/S124333.html",
      "state": "CO",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4763",
      "summary": "Craft over Colorado Springs, CO.",
      "city": "coloradosprings",
      "shape": "cylinder",
      "date": "2015-10-16T00:00:00",
      "story": "Craft over Colorado springs A cylinder shaped craft with lights flashing from one end to the other end in a sequencer style pattern.  This was seen from Monument, Colorado, looking south.   It was circling the Air Force Academy.  There was no sound and it was making its laps around the base slowly.   The pattern of the lights changed from flashing from one end to the other, to flashing from the middle to either end.  The color of the lights where white, green, and red. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122716.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4731",
      "summary": "Saw a white orb fly past the house, silently disappearing.",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2015-11-06T00:00:00",
      "story": "Saw a white orb fly past the house, silently disappearing. My dad and I were looking at a tree with bees all over it, then saw a white orb like craft fly very quickly overhead and past the house.   We quickly ran around the house to try and follow it but it very quickly disappeared toward the north towards Denver.",
      "link": "http://www.nuforc.org/webreports/123/S123308.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b1d",
      "summary": "Bright white light witnessed during blood moon event.",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2015-09-29T00:00:00",
      "story": "Bright white light witnessed during blood moon event. Event occurred while outside to view the supermoon/lunar eclipse.  Large stationary orb spotted and began to move slightly.  Orb then shot up quickly, disappearing into the clear sky. The light was very bright and spherical with no apparent features to discern from. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122336.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f75",
      "summary": "Read full report.",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2016-03-04T00:00:00",
      "story": "Read full report Four orbs, close enough to see in fairly good detail.  Kind of jerky movement up and down almost like they were attached to fishing line getting bites.  Were moving north before they went super sonic without any sound.  Were all same color, pale cream with a greenish yellow hue. Was dark out and craft were illuminated almost like a dim glow stick.  Seen above platte/boulder rd area.  Just moved down from denver, previously thought you all were nutjobs.  My bad",
      "link": "http://www.nuforc.org/webreports/126/S126174.html",
      "state": "CO",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5049",
      "summary": "Red fog in room, blueish chrome disk outside of front door, buzzing and pop noise, weird behavior from wife and dog.",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2016-02-11T00:00:00",
      "story": "Red fog in room, blueish chrome disk outside of front door, buzzing and pop noise, weird behavior from wife and dog.    I was awoken from sleep by a presence in the room last night.  When I opened my eyes there was a red fog engulfing the entire room.  I tried to wake my wife up but she wouldn't budge.  Not even my dog who was sleeping on the bed would wake up.  Just like a vacuum, I watched the fog get sucked out of my bedroom door (which was open).  I was extremely scared but chose to run to my front door.   There was a slight buzzing noise coming from outside (sorry I'm getting goosebumps real bad just thinking about this).  I opened the door and looked up.  Not 50 feet above the ground was a blueish chrome disk sitting almost motionless in the air.  This was at night and it's weird how I was able to see the distinct blueish chrome color of the disk.  There was a slight wobble to it also.  I felt like something was staring at me.  The disk was about 30 feet around and had a small \"base\" on top of it.  There were no lights or markings on it.  It sat there for about! a minute or two (I think but it's almost like I had been staring at it for 15 minutes) and the buzzing noise stopped.   There was a pop that came from it (there go the goosebumps again) like a balloon popping and it slowly lifted straight into the air.  When it got about I'd say 100 or so feet up it faded out of sight into nothingness.   I ran back into my house to check on my 2 year old son and he was fine.   I was able to wake my wife up and asked if she had seen anything.  She got teary eyed and without saying anything went immediately back to sleep.  My dog almost looked sad and went back to sleep as well.   This by far is the weirdest and unnerving thing I have ever witnessed in my life.  I'm am scared s**tless since last night.  While I have seen \"UFO's\" in the sky before and reported them on this site, this again by far has confirmed my belief that something else is out there.  I know I wasn't dreaming, I don't do drugs, I wasn't on any medication, nothing.  What the hell happened last night? ((NUFORC Note:  We spoke via telephone with the source of the report, and he sounded to us to be sincere, and sober-minded.  We suspect that he is an excellent, and reliable, source of information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125641.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5086",
      "summary": "Football-shaped saucer, red and gold over Colo Springs Feb 5 2016 8:35 pm mst.",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2016-02-11T00:00:00",
      "story": "Football shaped saucer, red and gold over Colo Springs Feb 5 2016 8:35 pm mst On Feb %th at 8:35 pm mst, I was on Colo ave and Limit ave at Dunkin Donuts, I stepped out to have a smoke and was looking Northwest when a football shaped saucer approch the downtown area, he saucer was red on top gold/orange on the bottom 2/3 totally silent and getting brighter as it approched, then slowed, nearly still and began to turn east (over downtown Colo Spgs )   I was able to summon a employee and friend Aaron, and he was able to witness its eastward fade and slow departure...thats about it no pulsing, no sound width approx 100yds and we estimate we were 1-2 miles from its turn over downtown. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125670.html",
      "state": "CO",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5282",
      "summary": "Dark, elongated horizontal streak, which changed shape, seen by airline passengers over southern Colorado on January 12, 2016.",
      "city": "coloradosprings",
      "shape": "changing",
      "date": "2016-01-20T00:00:00",
      "story": "Dark, elongated horizontal streak, which changed shape, seen by airline passengers over southern Colorado on January 12, 2016. We were passengers on an American Airlines flight from Seattle to Dallas (DFW) on the mid-afternoon of January 12, 2016, when we noticed a strange dark brown or black-ish \"streak\" or elongated \"smear\" to the north  high-lighted against the clouds.   As we watched this unusual sight, it suddenly had a roll upward so that the shape was more like an object with a long tail or smoke exhaust, but then it resumed the horizontal \"streak\" shape and very very quickly receded sideways to the north, in just a few seconds it disappeared.   Very strange!  We've been flying for over 50 years and have never seen anything like this.",
      "link": "http://www.nuforc.org/webreports/125/S125280.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5469",
      "summary": "((HOAX??))  Several diamond shapes with multiple lights moving in a coordinated fashion slowly and high in the sky.",
      "city": "coloradosprings",
      "shape": "diamond",
      "date": "2015-12-21T00:00:00",
      "story": "Several diamond shapes with multiple lights moving in a coordinated fashion slowly and high in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124753.html",
      "state": "CO",
      "duration": "on going"
    },
    {
      "_id": "64d005f478aba2ec5a3c5496",
      "summary": "White spherical illumination that brightened, then disappeared.  ((NUFORC Note:  Iridium satellite flare??  PD))",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2015-12-17T00:00:00",
      "story": "Wwhite sperical illumination that brightened then disappeared. I was traveling in my car going home from work when I saw a sphere shaped object drop down from the sky.  It slowed as it lowered from above..  It was quite large in size.  About 500 feet across or larger.  It was just a shimmer to begin with then saw the outline.  Then it just disappeared.   Like it was cloaked.. ((NUFORC Note:  Possible flare from an \"Iridium\" satellite??  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124669.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5547",
      "summary": "White orb to the north west above pikes peak has not moved still visable.",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2016-07-08T00:00:00",
      "story": "White orb to the north west above pikes peak has not moved still visable White orb to the north west above pikes peak has not moved.  Been told it is a weather balloon but it has not moved in 1 hour.  I have many witnesses.   I made report to police and nothing happen.  It is still visible now and has not moved.  Cannot be captured on cam. ((NUFORC Note:  Our Center has received a number of similar reports, both from Colorado, and from surrounding states.  We suspect that the object may have been a helium-filled balloon, carrying a scientific package, but we have not been able to confirm that possibility.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128090.html",
      "state": "CO",
      "duration": "Still happening"
    },
    {
      "_id": "64d005f478aba2ec5a3c56fe",
      "summary": "Green flashes seen above Colorado Springs.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2016-07-08T00:00:00",
      "story": "Green flashes seen above Colorado Springs. Starting at roughly 21:12, July 4, 2016, I (and others near me, as we were gathered watching a fireworks show) witnessed what seemed to be an oblong craft silently drifting through the clouds above the park that the public and I were in.  It appeared fairly large and at high elevation, as it could be seen fairly well from within the clouds.  For minutes at a time, the craft emitted repetitive green flashes from its underbelly.  On rare occasion, it emitted much more rapid white flashes for significantly shorter periods.  The craft seemed to have a stainless steel-like metallic sheen.  It darted across the sky rapidly and silently.  The maneuvers the craft performed were erratic and unpredictable, yet it hovered primarily above the aforementioned park and almost seemed to watch the fireworks (or the people’s reaction to which).  It then disappeared and did not show up again.",
      "link": "http://www.nuforc.org/webreports/128/S128277.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c56f5",
      "summary": "It was a horseshoe shape and brown flyinging above the mountains disappearing and then coming back",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2016-07-15T00:00:00",
      "story": "it was a horseshoe shape and brown flyinging above the mountains disappearing and then coming back I was driving and I looked up at the mountains and I saw a figure that looked like a giant horse shoe in the sky it was brown and my sister saw it too but not my parents.  it flew across the mountains disappeared and popped back up later when we got to woodland park it was like it was following us.   At first I thought it was an airplane but it made no sound and what type of airplane is horseshoe shaped.",
      "link": "http://www.nuforc.org/webreports/128/S128428.html",
      "state": "CO",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5914",
      "summary": "The object looked to me like a soccer ball, it was round, silver colored and motionless while I watched it.",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2016-05-26T00:00:00",
      "story": "The object looked to me like a soccer ball, it was round, silver colored and motionless while I watched it. My UFO Experience  This is what I saw in September of 1999.  (Exact date unknown)  I was working at the MCI building at Garden of the Gods Road and 30st Street in Colorado Springs.  It was about 8:45 to 9:00 am and I was driving my Datsun to work.  The sky was clear and blue, with no clouds to West and no noticeable wind.  I was driving West on Vindicator when I stopped in the left hand turn lane for the traffic light at Centennial Blvd.  The light had just turned red in front of me.  The red light for traffic coming from Vindicator lasts 40 seconds.  There were only a few cars on the road at that time.   As I sat there, I happened to look up toward the West.  I saw a round, soccer ball shaped object in the sky over the Mountain Shadows neighborhood.  I just stared at it for several seconds not believing what I was seeing.  I rubbed my eyes and blinked several times to make sure I was really seeing something in the sky.  The object was a light silvery color and was to the West-Southwest of where I was stopped.  The object sat there motionless for the entire time the traffic light was red and while I was watching it.  I did not see any windows or markings of any kind on this object.  My first thought was that it was a hot air balloon as the Labor Day Balloon Classic in Colorado Springs had just occurred.  But there was NO basket or harnesses hanging from or attached to this object. I tried to judge the height and distance while looking at it.  I was thinking that it was to the East of the ridge which runs on the West side of Mt. Shadows.  It looked like it was above the Western most point of the Flying W Ranch Road (which is what Vindicator turns into on the other side of Centennial).  This would be about one mile from where I was.  The height of this object seemed to be a little above the high points of the rock ridge in back of the Mt. Shadows area.  The high points in this area are a little over 7000 feet.  The intersection where I was at is a little over 6600 feet. While I was stopped at the red light watching this object, I noticed people going into and out of the Walgreen's store across the street.  Other cars were traveling on Centennial Blvd. in a normal manner.  I did not see anyone else (walking or in cars) viewing or appearing to view this object. When the light turned green for me I made my left hand turn and proceeded South down Centennial.  I don’t believe that there were any cars behind me at the traffic light.  I tried to keep the object in sight, but the object was to my right and there were houses and trees along the road I was traveling.  It took about 4 minutes before I arrived in the MCI parking lot.  (I later timed this trip at 4 minutes, 15 seconds and the distance was 2.3 miles)  When I got to the MCI parking lot, I looked back toward where I had seen the object, but the sky was empty.  I looked in all directions and there was nothing.  If this had been a hot air balloon it would have still been visible to me somewhere in the sky. I don’t know exactly what I saw that day, but it Was there and it was Real…. At the time of the sighting I was working as a software quality assurance tester at MCI.  My occupation for the previous 40 years was as a software developer and software tester for several large aerospace companies.  My positions at these companies required me to obtain security clearances.   I was 60 years old at the time of the sighting.  I remember the object I saw as being very vivid in detail. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127518.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a58",
      "summary": "Multiple Color UFO craft Happening Now.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2016-05-06T00:00:00",
      "story": "Multiple Color UFO craft Happening Now. Hovering over fort carson Now. look. Multicolered lights blinking fast. green, red, blue, yellow pink, orange. looks like a flashing sphere of multi colored light.  Helicopters flying around now.  Go look.  towards Cheyanne Mt.",
      "link": "http://www.nuforc.org/webreports/127/S127146.html",
      "state": "CO",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bf3",
      "summary": "Thin light accompanied with 2 orange orbs,Colorado Springs, CO.",
      "city": "coloradosprings",
      "shape": "changing",
      "date": "2016-04-01T00:00:00",
      "story": "Thin light accompanied with 2 orange orbs,Colorado Springs, CO.   Saturday, March 19th, 2016, and a pre-dawn sky.                                                                   \t After backing up my van, facing east, I sat back awaiting the sunrise.  The time is 0630am.\t\tIn front of me, the skies were alight with hues of orange, pink, and purple colors.  A white color was also present, which I thought to be a cloud that had not colored yet.\t\t\t\t\t  My glance continued northward, to see the glorious display of the morning colors manifesting themselves.\t\t\t\t\t\t\t\t\t\t\t\t\t  Again my eyes returned to the sky in front of me and the “white” light had not moved or changed color.  It resembled the top half of a hamburger bun.   I said to myself “I’m going to watch you to see what happens”, when no sooner said, the” white” light started to COMPRESS itself, to flatten out to look like a thin, straight “light-line”. I couldn’t believe my eyes as I was engrossed and marveled at this happening!!!!!!!  \t\t\t\t\t\t\t\t\t\t\t\tNow it started to move northward very slowly and from underneath, simultaneously appeared two(2) orbs, from white to glowing orange (2 mini suns came to mind), back to white and faded again simultaneously, all the while the “light-line” object travelled northward.\t\t\t\t\t\t  It stopped and hovered for about a minute before starting to move back across the same flight path, southerly, passing it’s original point of sight, then stopping and hovering once again.\t\t\t  The sun had just broken the day, when I averted my eyes to see momentarily, and when I looked back, it was gone.\t\t\t\t\t\t\t\t\t\t\t\t  The location: Bear Creek Park, Co. Spgs., CO. 80905  \t\t\t\t\t\t\tTotal time of sighting was 32 minutes.\t\t\t\t\t\t\t\t\t  Guess estimate of distance to be 25-30 miles.\t\t\t\t\t\t\t\t  Using my left index finger, a foot away from my face, the “light-line” measured a” knuckle” inch.\t\t   The location is also home to Peterson AFB, Schriever AFB  and Co. Springs airport",
      "link": "http://www.nuforc.org/webreports/126/S126617.html",
      "state": "CO",
      "duration": "32 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5dc2",
      "summary": "S sky, my wife and I were on the porch and we saw one bright star, that was moving.   It was twinkling.  ((NUFORC Note:  Sirius.  PD))",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "In the southern sky, my wife and I were on the porch and we saw one bright star..., that was moving.  It was twinkling as if it were outside of the atmosphere.  But it seemed to be maneuvering around as if it were observing something or evading being hit by meteors or similar.   Using static points in eyesight to determine whether or not my eyes were playing tricks on me, we did see this \"star\" zipping both left and right by a margin of at least 3 inches as we were looking at it.  It zipped around in seemingly random patterns, from small movements to larger distances of travel.   We have never seen anything like this in real life, only in videos on the Internet and in documentaries.",
      "link": "http://www.nuforc.org/webreports/131/S131439.html",
      "state": "CO",
      "duration": ">1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e41",
      "summary": "((HOAX?)) I saw a big triangle with 3 lights on each side, no light in the middle; similar to TR-3B, but w/o lights.((anonyous report))",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2016-12-05T00:00:00",
      "story": "I saw a big triangle with 3 lights on each side, no light in the middle, I did some research and it looked similar to the TR-3B, but with no light in the middle, no sound at all and it was slow moving. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131550.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ea8",
      "summary": "My son and I saw a large yellowish triangle object passing through the night sky at an incredible speed toward Pikes Peak Mountain. It",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2016-11-11T00:00:00",
      "story": "My son and I saw a large yellowish triangle object passing through the night sky at an incredible speed toward Pikes Peak Mountain.  It passed Pikes Peak, then simply disappeared.",
      "link": "http://www.nuforc.org/webreports/131/S131073.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f46",
      "summary": "Four HUGE Lights Hovering Over Colorado Springs, CO Caught on Video",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2016-10-27T00:00:00",
      "story": "Four HUGE Lights Hovering Over Colorado Springs, CO Caught on Video At approximately 8:30 pm (20:30) on October 20th, 2016, my girlfriend and I were heading North on a back road we commonly go down when I noticed a bright light in the center of my rear view mirror.  I commented on it and my girlfriend said that it was probably just a plane as we live near an air force academy.  I agreed but kept watching as a second bright light appeared next to it, then a third and the final fourth light.  I immediately did a U-turn so we can get a better look and watched for about five minutes while driving towards it. It should be noted at this point that the lights were off in the distance directly over the city lights.  My girlfriend started recording the lights with her phone and one by one the lights started disappearing as if they were never there until the last one faded out. I uploaded the video of the lights to YouTube where I explain in text everything I have outlined here and explain that we know a plane or aircraft when we see one and this is definitely not just a plane.  I should also add that each light went out about twenty seconds after the previous one.  I don't know if this is frowned upon but the link to the video is provided below.  Thanks.  https://www.youtube.com/watch?v=ASaCVyhrSSc",
      "link": "http://www.nuforc.org/webreports/130/S130760.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fcb",
      "summary": "Fast-moving light being chased by a helicopter.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "Fast-moving light being chased by a helicopter My son and I were outside approx 15 minutes ago, and saw a helicopter chasing a light in the sky. The light was moving so fast that it was difficult to discern a shape and therefore unidentifiable as anything other than a fast-moving light. The helicopter climbed and sped up to match altitude and speed of the light.  The light disappeared from our view.  It seemed that the helicopter lost sight of it as well because it seemed to slow down and fly in what I can only call a \"searching manner\".  Then it too left our view, but we could still hear the helicopter for a few minutes. We scanned the sky visually for a few more minutes and then came back inside...a bit shocked, I might add.",
      "link": "http://www.nuforc.org/webreports/131/S131146.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6023",
      "summary": "Bright white light triangular shape as if falling from sky",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2016-10-21T00:00:00",
      "story": "Bright white light triangular shape as if falling from sky For the short duration of maybe 15 seconds:  A Bright white light holding an irregular but triangular shape with its broader base on its tail end; it shot downward at a diagonal from east to west. (point of observation  was limited by the window frame it was witnessed from) It traveled at a fast speed on a steady declining diagonal path as if toward the base of pikes peak from anywhere east of the mountain.",
      "link": "http://www.nuforc.org/webreports/130/S130658.html",
      "state": "CO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c60b6",
      "summary": "My two brothers and I observed a white orb hovering over (which seemed about 100's of feet above) Pikes Peak.  It was stationary.",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2016-10-21T00:00:00",
      "story": "My two brothers and I observed a white orb hovering over (which seemed about 100's of feet above) Pikes Peak.  It was stationary in the sky for a aproxamitly 30 minutes, where it slowly desended and then it quickly disappeared behind the mountain.",
      "link": "http://www.nuforc.org/webreports/130/S130682.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c62c7",
      "summary": "I saw a triangle shape object with lights on the points and 1 light in the middle hovered in sky for 15-20 mins. ((anonymous report))",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2016-09-15T00:00:00",
      "story": "I saw a triangle shape object with lights on the points and 1 light in the middle hovered in the sky for 15 to 20 mins. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129871.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6677",
      "summary": "5 colored lights moving in sky east to west.",
      "city": "coloradosprings",
      "shape": "formation",
      "date": "2016-08-02T00:00:00",
      "story": "5 colored lights moving in sky east to west. I was taking the trash out and looked to the east and saw 5 lights, 2 green, 2 red and 1 white.  They moved over the sky heading west at a somewhat fast pace, as they passed behind a cloud they went into a 5 point pentagon shape and then faded out.   I'm not sure what it could of been.",
      "link": "http://www.nuforc.org/webreports/128/S128972.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6779",
      "summary": "2-6 floating, with upword movement, yellow-orange lights outside the USAFA in Colorado Springs",
      "city": "coloradosprings",
      "shape": "fireball",
      "date": "2017-04-07T00:00:00",
      "story": "2-6 floating, with upword movement, yellow-orange lights outside the USAFA in Colorado Springs The light objects varied from 2-6 (i.e. some would disappear/reappear, maybe like a flare).  The color was orange/yellow.  There was movement, which included upward movement.  The location was East of I25 possibly between North Gate Rd & Interquest (re: just outside the USAFA).   I reported to the USAFA. and stated I would guess it was amateur drones and told them I have video footage.  However, they have not requested the video footage from me.  It appeared there was a triangular pattern, but the lights disappearing/reappearing could be movement on an axis.",
      "link": "http://www.nuforc.org/webreports/133/S133363.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c695c",
      "summary": "1-6 extremely bright yellow lights  mid sky facing south. 2 horizontal rows maybe 3 on each side flashing e-regularly somethimes making",
      "city": "coloradosprings",
      "shape": "fireball",
      "date": "2017-03-23T00:00:00",
      "story": "1-6 extremely bright yellow lights, mid sky, facing south.  2 horizontal rows, maybe 3 on each side, flashing e-regularly sometimes making a triangle or square or just a line.  Went on for about 5 minutes.  Untill it was just 1 bright yellow fire ball turned into none.  The appearance of the flying objects was like a sun with rays coming off it.  Was unusually bright and vivid. ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133229.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a26",
      "summary": "Taking out the trash I saw an odd shaped object flying in a circular as well as zigzag pattern with no visible lights. I wouldn’t have",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2017-02-22T00:00:00",
      "story": "Taking out the trash I saw an odd shaped object flying in a circular as well as zigzag pattern with no visible lights.  I wouldn’t have been able to see it except that light from the moon and presumably town was reflecting off of it.  At first glance I thought geese, but it moved extremely fast, made no noise, and was erratic in movement before making a half circle and disappearing.  I wasn’t able to get a handle on the exact shape, but it had what looked like scoop or spoon-ish protrusions (thick antenna?  Not wings) that made it look somewhat triangular.",
      "link": "http://www.nuforc.org/webreports/132/S132690.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c94",
      "summary": "White Sphere seen over mountains Colorado Springs",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2017-01-06T00:00:00",
      "story": "White Sphere seen over mountains Colorado Springs As I came to a red light waiting to turn left I was looking West out to the Pikes Peak mountain range.  The clouds were hanging over the mountains, and I noticed one little white dot in a small space of blue sky between the clouds.  It looked as white as the clouds, but it caught my attention as it was a perfect sphere and it was motionless.  On a whim I went to grab my phone to try and video it, but before I could even grab my phone the object move directly down in a steady pace and was gone behind clouds and the mountain range.  I knew it wasn’t a helicopter, and the way it moved was similar to what I have seen in some supposed UFO videos.  I was so moved by the experience I pulled right over and posted to Facebook what happened.  It was exciting to say the least, and quite an interesting start to the New Year.",
      "link": "http://www.nuforc.org/webreports/132/S132019.html",
      "state": "CO",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f45",
      "summary": "Bright white, (to light blue hue) pulsating circular light that would appear, then disappear, then reappear.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2017-08-04T00:00:00",
      "story": "Bright white, (to light blue hue) pulsating circular light that would appear, then disappear, then reappear. Colorado Springs, Colorado, Sunday, July 23rd, 2017 at 3:10 a.m.. I took my dog out for an early-morning potty. While standing there, I looked up in the area of the star Vega.  I must have been staring only a minute when a whitish-blue pulsating light appeared. This UFO light continued to do this pulsating scenario about eight times before completely vanishing. This light was absolutely silent and went from North to South, then North again; then completing a half circle.  My dog seemed to look up in the direction a few seconds before I visually could see the lights. About a minute into watching this UFO's lights, I could see an airplane's silhouette (which was flying from West to North East). Judging distance and size  comparison, the lights of the UFOs at their brightest were approximately the same diameter as the airplane. The total duration in which I can see the strange lights what is approximately 5 minutes. I ran inside so I could write down everything I could remember seeing, then text my husband at work  telling him that I saw something strange. I downloaded multiple sky apps on my phone and the next day tried to go out at the exact same time, 3:10am in the morning to see if I saw anything similar happening again, which I didn't. However, what was interesting is on this particular app you could rewind the time to see if there were any flares, overhead  satellites, radio satellites or the ISS passing overhead during the specific time I recalled watching the unidentified lights. As far as I could research, nothing showed up as far as anything that would be linked to man-made light anomalies.  Our family has had several sightings over many lifetimes, and being that I grew up over 43 years in this city, I can say I've never witnessed lights in the sky such as this.   There did seem to be an intelligence behind the lights, however nothing that made me feel alarmed.  Nonetheless, my heart rate spiked and I was a bit creeped out.",
      "link": "http://www.nuforc.org/webreports/135/S135401.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6fbb",
      "summary": "Sighting.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2017-07-07T00:00:00",
      "story": "Sighting I was driving and I caught a glimpse of light out of the corner of my eye and I pulled my car over to the side of the road and it all happened so quickly and only in a matter of seconds but there was a bright green light in the sky I can't describe the shape the lights were in but it was just high up on the sky and in the middle of the sky and when I blinked the lights were completely gone.",
      "link": "http://www.nuforc.org/webreports/134/S134802.html",
      "state": "CO",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f78",
      "summary": "Dark anomalous object appears in a photo taken during the maximum of the partial solar eclipse",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "2017-08-24T00:00:00",
      "story": "Dark anomalous object appears in a photo taken during the maximum of the partial solar eclipse During the onset of the partial solar eclipse in Colorado Springs, my partner and I took photographs of what appeared to be small stratus clouds forming over the mountains -- as outdoor air temperatures dropped with the temporary reduction in solar heating.  We took 9 photos over a 5 minutes period, between 11:46 am and 11:51 am Mountain Time.  Our home has an excellent view of Pikes Peak, the mountain range west of the city and we frequently take weather photos. We reviewed the photos a few hours later and first noticed the anomalous dark image in the second picture taken at 11:47 am.  It was taken with a Motorola Droid Turbo 2 smartphone.  What’s ironic is that, when taking the photo, we saw a long cloud formation over the southern flank of mountains and I said aloud in jest “that looks like a mother ship”.   The anomalous dark object is above and to the left of the long cloud formation in the photo.  The dark object is a bit blurry but obvious to the eye.  No other photos taken have shown anything unusual, apart from the small cloud formations which quickly formed in an otherwise clear sky and then dissipated after the solar eclipse. We’re used to seeing large birds, planes, helicopters, even drones, fly the skies in our area.  But the dark object in the photo doesn’t resemble any of these, which I believe we would have readily noticed at the time.",
      "link": "http://www.nuforc.org/webreports/135/S135836.html",
      "state": "CO",
      "duration": "1 minute or less"
    },
    {
      "_id": "64d005f478aba2ec5a3c7077",
      "summary": "Big eyes.",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2017-07-14T00:00:00",
      "story": "Big eyes Me and my brother where watching power rangers, when both of us see a bright light outside the window and as we turn around we see these big verticals oval eyes the best way I can describe them is as if they where big anime cartoon eyes just staring at us we both got really frightened and called our mother when we went back in the room the eyes disappeared.   That same night there was a mysterious fire in a bush curbside along the street.  Both me and my brother saw this, so it was not a dream or our minds playing tricks on us.   Me and my brother both researched eyes of animals and there is nothing close to what we saw that night. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135017.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c73ce",
      "summary": "Flashing light, zig-zag pattern, quickly across the sky and back!  ((anonymous report))",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2017-06-15T00:00:00",
      "story": "Flashing light, zig-zag pattern, quickly across the sky and back! Flashing red, white and yellow lights in the SW sky, moved erratically.   Quickly zig-zagged, climbed and then flew in a relatively straight path across the sky, but then stopped.  Hovered for maybe 10 seconds and flew back across the sky toward where it just came from.   Very weird. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134572.html",
      "state": "CO",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7422",
      "summary": "2 UFO crafts circling above me then suddenly disappeared.  ((anonymous report))",
      "city": "coloradosprings",
      "shape": "cigar",
      "date": "2017-06-02T00:00:00",
      "story": "2 UFO crafts circling above me then suddenly disappeared. Looked up into sky on the way into my apartment, when I saw 2 circles flying in a cigar like formation.  They made no sound, and appeared to be spinning.  They were both black and had no lights visible. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134336.html",
      "state": "CO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7472",
      "summary": "Mid-Aug 1956--One very large & close saucer/disc and 3 smaller discs off in the distance sighted by many people in Colorado Springs.",
      "city": "coloradosprings",
      "shape": "disk",
      "date": "",
      "story": "Mid Aug 1956 - One very large & close saucer/disc and 3 smaller discs off in the distance sighted by many people in Colorado Springs Mid August 1956, I was living in Colorado Springs. I noticed my neighbors gathering together watching something in the sky, around 9:30 pm. I went outside and looked up to see a very large circular “spaceship” hovering in one place.  Someone had a car radio on listening to a station reporting the strange sight we were looking at. As I watched in awe, I noticed there were red, white & either blue or green lights blinking and rotating all around this craft (I can’t be certain on the blue or green colors after all these years).  It seemed as if “they” were trying to communicate with us.  Then I noticed three other circular objects off in the distance, they were “darting” back & forth at a high rate of speed, as in the blink of an eye.  Everyone around me remarked about what we were watching, no one had seen anything like this before. This show went on for almost an hour before the three smaller spacecraft disappeared. The larger spacecraft left shortly after that. All of them left at a high rate of speed, much faster than anything we had ever seen. Since there were about a dozen or more people watching this show, and many more listening to the radio, seeing the same thing we did, it had to be newsworthy!  I have never seen a report on this UFO sighting.  Hopefully someone else will admit to seeing this awesome sight. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134047.html",
      "state": "CO",
      "duration": "~1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c743b",
      "summary": "Moving halo connected by 2 white dots in morning sky at top of Pikes Peak from stationary camera.",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2017-06-02T00:00:00",
      "story": "Moving halo connected by 2 white dots in morning sky at top of Pikes Peak from stationary Camera that provides 60 sec online photos Seen in the morning sky above Pikes Peak, from the stationary Camera that provides an online picture every 60 seconds.  A halo connected by two white dots.  Minutes later it had moved upward, then sideways, then downward. ((NUFORC Note:  Photos indicate a curved, multi-colored object, which could be a kite, we believe.  An alternative explanation might be a droplet of water on the lens of the camera, giving rise to a refracted image of a parked railroad car.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134354.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c75a1",
      "summary": "Solid black circular object making no noise.  Only 1 light not flashing.  Very fast object.",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2017-04-28T00:00:00",
      "story": "Solid black circular object making no noise.  Only 1 light not flashing. Very fast object. I was standing outside on my last break at work staring at the stars.  There were about 15 satellites that I saw flying overhead before the signing.  This object seemed to appear out of nowhere as an incredibly fast moving light in the cloud, making very sporadic movements and making no sound.   It flew directly overhead and underneath a cloud that was reflecting the city lights.  That is when I could see the round nature of this object.  It slowed down when it was directly above, and then it continued on its way before completely disappearing.   This was absolutely insane.",
      "link": "http://www.nuforc.org/webreports/133/S133864.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7691",
      "summary": "Unusual object that seemed to change color Andrew sose",
      "city": "coloradosprings",
      "shape": "changing",
      "date": "2018-01-12T00:00:00",
      "story": "Unusual object that seemed to change color Andrew sose Object that hovered over mountains and appeared to alter direction several times and vary in size/ shape.  Seemed much too large for a drone, and don’t think drone would be visible given the distance.",
      "link": "http://www.nuforc.org/webreports/138/S138042.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7715",
      "summary": "Bright white orb like light moving at high speeds over Colorado Springs",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2017-12-21T00:00:00",
      "story": "Bright white orb like light moving at high speeds over Colorado Springs As I was sitting on the floor looking towards the window I witnessed a bright white orb like light moving at high speeds.  It is unknown if it was a flashlight shining through my window, but the movement was far too smooth and linear.  My window faces north and the light was moving from the south up north east.  There were no sounds and no trails.",
      "link": "http://www.nuforc.org/webreports/137/S137771.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c77ca",
      "summary": "We were viewing my videos because I couldnt understand what kind of motion was making all 4 cameras record and turn on minutes apart. S",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2017-11-03T00:00:00",
      "story": "We were viewing my videos because I couldnt understand what kind of motion was making all 4 cameras record and turn on minutes apart.  So we replayed stopped & screen shot as video continued to play when we viewed the video screen shots we were blown away at that time  We didnt see anything as we were looking over the balcony. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136957.html",
      "state": "CO",
      "duration": "2:38"
    },
    {
      "_id": "64d005f478aba2ec5a3c7952",
      "summary": "Strong of flashing red lights across the sky",
      "city": "coloradosprings",
      "shape": "other",
      "date": "2017-12-10T00:00:00",
      "story": "Strong of flashing red lights across the sky There was three of us walking in a field.  We saw a thing fall from the sky and flash up around 8:45 as if a firework but the die was no bang.  Moments later at 9 we notices a long string of red lights in the horizon.  It looked like a chain of helicopters but later appeared to be of one large ship.   It lasted about 15 minutes then continued out of the horizon.",
      "link": "http://www.nuforc.org/webreports/137/S137650.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ebc",
      "summary": "My boyfriend and I have seen these several times. We just now found this site and we are amazed. We were driving between fort Carson an",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2018-05-15T00:00:00",
      "story": "My boyfriend and I have seen these several times.  We just now found this site and we are amazed.  We were driving between Fort Carson and NORAD and saw 3 bright orange yellow lights in the sky that slowly faded then quickly came back.",
      "link": "http://www.nuforc.org/webreports/141/S141497.html",
      "state": "CO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8048",
      "summary": "w/ a 15 mm lens.  I saw a thing orbit the moon and emit something at the moon. It hit the moon. ((anonymous report))",
      "city": "coloradosprings",
      "shape": "unknown",
      "date": "2018-03-23T00:00:00",
      "story": "I was looking at the moon with a 15 millimeter lens.  I saw a thing orbit the moon and emit something at the moon.  It hit the moon. There was this thing that flew around the moon a few times very fast, and then shoot something at the moon.  It left a small crater.   I zoomed in on it with a 9 millimeter lens.  The impact had some debris fly away when it hit.  The debris had a pattern on it.  The crater glowed for about 5 seconds.  That was the last of it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139223.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c80e8",
      "summary": "Sequence of lights.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2018-03-08T00:00:00",
      "story": "Sequence of lights At sunset at my house, I was heading inside from playing catch with my son and happened to look up at the sky in the west to southwest direction from Colorado Springs and saw what looked light a slightly brighter than normal star.  I could tell that this was pretty far away and too large to be a drone at this distance.  At first glance I did not think anything of what I thought was a bright star appearing at sunset, after maybe only 2 or 3 seconds of first glance while the original \"light\" (what I though was a star) was stationary in the sky another light appeared directly to the left of the original light.  This second light then stopped at a some distance to the left of the original light.  The second light first appeared at the halfway point between where the original light was and where the second light stopped and remained stationary.  I could not tell if the second light originated from the first light because it was first seen at the midway point.   The second light did however travel from the midway point to the left of the original light.  When the second light stopped, there was a third light that then did the same thing, starting some distance to the left of the second light, travel a distance to the left and then stopped.  As soon as the third light appeared, the first light then disappeared.  However, the first and the third light did co-exist for roughly 1 second.  Process then repeated around 8 or 9 times in a perfect horizontal direction over roughly 10 to 15 seconds.  I could not see the lights past that point because of trees and buildings.   The lights appeared around twice the size and brightness of a normal star and moved in a perfect sequence of disappearing and reappearing lights with a \"middle light\" always present during the sequence.  This also happened over a great distance and eventually left my visibility.",
      "link": "http://www.nuforc.org/webreports/139/S139032.html",
      "state": "CO",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c80ea",
      "summary": "Orange lights appear/disappear.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2018-03-08T00:00:00",
      "story": "Orange lights appear/disappear. About 6 orange lights appear one by one in a line or a triangle, then disappear.  Event lasted for about an hour we also observed what appeared to be military helicopters trying to get closer to the lights.",
      "link": "http://www.nuforc.org/webreports/139/S139033.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c8110",
      "summary": "In passenger seat when to my right side over looking near the world arena by Ft.Carson a bright light none blinking moved in our direct",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2018-03-08T00:00:00",
      "story": "In passenger seat, when to my right side, overlooking near the world arena by Ft. Carson, a bright light none blinking moved in our direction and just stopped.  Stayed in position while we were stopped at a stop light.  Rolled down my window so make sure I wasn't seeing just a helicopter from the base but no other lights were around to give any hint of a apache.  It disappeared right where it was hovering.  Seen it the following day at around the same time and same spot too.",
      "link": "http://www.nuforc.org/webreports/139/S139101.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c818c",
      "summary": "Red lights forming circle not moving, then blinked white orb, then moved very fast east to west behind the mountain range.",
      "city": "coloradosprings",
      "shape": "circle",
      "date": "2018-02-22T00:00:00",
      "story": "Red lights forming circle not moving, then blinked white orb, then moved very fast east to west behind the mountain range. Over the city, red lights in a round formation, stayed in one place.  I thought it was fireworks, at first, but to high, lights blinked several times, turned into white orb then back to red separate lights round again.   Went to get husband and then it turned into blinking object red, white lights (not round anymore sort of lights side by side) going very fast from east to west over the mountain range.  It looked like individual lights that made a perfect circle not moving at first - wow!",
      "link": "http://www.nuforc.org/webreports/138/S138843.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8634",
      "summary": "Multiple different red, blue, and white lights in different areas in the sky; saw a white light pass sky downward. ((anonymous report))",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2018-08-22T00:00:00",
      "story": "Multiple different red, blue, and white lights in different areas in the sky also saw a white light pass sky downward and disappeared i Multiple different red, blue, and white lights in different areas in the sky.   Also saw a white light pass sky downward and disappeared into thin air with no sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142770.html",
      "state": "CO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8726",
      "summary": "I went down to Colo Sprgs for a work conference on Sun, 6/24/18. I was staying at a hotel near I-25 and Circle Dr. This hotel had patio",
      "city": "coloradosprings",
      "shape": "chevron",
      "date": "2018-07-19T00:00:00",
      "story": "I went down to Colo Sprgs for a work conference on Sun, 6/24/18.  I was staying at a hotel near I-25 and Circle Dr.  This hotel had patios and balconies for smokers or people who just wanted to sit outside.  The room I stayed in was on the first floor, near the tennis/basketball courts.   Anyway, I had just gotten back from having dinner with a friend of mine and I was starting to wind down for the night.  The drive down there from Denver was horrible because we encountered major storms earlier in the day.  Lots of heavy rains and hail from Denver to the Sprgs.  So I decided to go out on the patio and have a smoke or two before I went to bed. I was out there for about 5 or 10 mins, when I suddenly saw a white translucent chevron aircraft flying silently to the South/Southwest.  I couldn't believe my eyes!  I have never seen one of these objects before.  It was flying around 2000-3000 ft. up in the air and it was moving very fast.  Unfortunately, there was a large tree close to where I was standing and the object flew behind the tree and I didn't see it again. As soon as I noticed it was gone for good, I noticed several perfect circles (a bit larger than basketballs) that were also white and translucent that were much lower in the sky, and they were much closer to me and my position!  At first, I thought my eyes were playing tricks on me, so I started to rub them.  But as soon as I stopped rubbing them, I saw more of the white circles just hovering in the air. There were people playing tennis that night and there were other people on one of the other courts because I could hear them being really loud and laughing about something, but I didn't know what.  I didn't get the impression that any of them saw what I just saw, but I don't know for sure.  I did not sleep well that night at all and I kept getting the impression that something was watching me.  It was so creepy!  I have had numerous UFO sightings over the past 21 years, but I've never seen anything like these objects.",
      "link": "http://www.nuforc.org/webreports/142/S142299.html",
      "state": "CO",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8840",
      "summary": "Bright orange glow moving from southeast to north west.  No sound.  Not very high.  ((anonymous report))",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2018-07-05T00:00:00",
      "story": "Bright orange glow moving from southeast to north west.  No sound.  Not very high. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142026.html",
      "state": "CO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c883f",
      "summary": "Bright lights dancing and erratic in night sky, moving quickly, and in a group.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2018-07-05T00:00:00",
      "story": "Bright lights dancing and erratic in night sky, moving quickly, and in a group. Okay.  Seriously just saw a group of seven bright lights off in the distance in the sky, and then they came more overhead.  Then a couple more followed the group as the group began to move from the east, to the northern part of the sky (my hubby says he thinks the direction they moved was more westward).  They were moving erratic and in a group almost as though they were dancing.  They hung around above us (all we could see was lights... almost as though they were stars moving around fairly quickly) for a couple minutes as they were moving across the sky from east to north.   Is there a place to go to find what military operations are going on tonight in the sky?  Did we see drones?  What was that?  It was around 9:30-9:35pm Mountain Standard Time.  There was no sound that we could hear coming from these moving objects in the sky.",
      "link": "http://www.nuforc.org/webreports/142/S142034.html",
      "state": "CO",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a12",
      "summary": "Light descends from the sky and disappears",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2019-09-06T00:00:00",
      "story": "Light descends from the sky and disappears While taking our friend home with my girlfriend, we drove down a sloped hill.   Spotted by our friend first, we all saw a fireball about 8,000 feet high, it stayed there for ten seconds, before I started recording as it descended down to 2,000 feet and began to fade and disappear.  The light was orange in colour and glowed brightly, it was around the size of 4 stars in the night sky.",
      "link": "http://www.nuforc.org/webreports/148/S148508.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b64",
      "summary": "Headed south on I-25 before Nevada/Corporate Ave, seen about 10 lights orangish in color show up suddenly then seen the back of the lig",
      "city": "coloradosprings",
      "shape": "flash",
      "date": "2019-03-14T00:00:00",
      "story": "Headed south on I-25 before Nevada/Corporate Ave, seen about 10 lights orangish in color show up suddenly then seen the back of the lights had more so 20 in total,  round in shape.. the lights sat there for it felt a min.  And then they individually disappeared as it took off.",
      "link": "http://www.nuforc.org/webreports/145/S145082.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d72",
      "summary": "It was fully dark and as I was sitting in my car in my work parking lot, I saw two lights high in the sky hovering above Colorado Sprin",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2019-01-17T00:00:00",
      "story": "It was fully dark, and as I was sitting in my car in my work parking lot, I saw two lights high in the sky, hovering above Colorado Springs.  I couldn't make out any shape of a craft, I just saw the lights, which were an amber color. The lights did not stay on; they would fade on and off.  Sometimes one would appear and disappear a few times before the other would appear again, other times they would alternate, and other times they would both stay on for a couple seconds simultaneously. The lights never moved and would reappear exactly where they had disappeared.  This is what I found most unusual; a normal aircraft wouldn't stay in the exact same spot without falling out of the sky. I watched for about 8 minutes, but then left, although the event was still ongoing.",
      "link": "http://www.nuforc.org/webreports/144/S144437.html",
      "state": "CO",
      "duration": "Unknown, but witnessed fo"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d96",
      "summary": "I was taking a walk near Colorado Springs and took photos as it was a beautiful day. In one photo I saw a blue orb. I thought the sun m",
      "city": "coloradosprings",
      "shape": "sphere",
      "date": "2019-01-11T00:00:00",
      "story": "I was taking a walk near Colorado Springs and took photos as it was a beautiful day.  In one photo I saw a blue orb.  I thought the sun may have caused a strange reflection on lense of I phone.  I did not see it with naked eye.   6 months ago, I saw a different kind of UFO in same location.",
      "link": "http://www.nuforc.org/webreports/144/S144413.html",
      "state": "CO",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f07",
      "summary": "Reddish orange flashing lights in a pattern. Rimmed the triangular, boomerang shape. Would hover in one spot. ((anonymous report))",
      "city": "coloradosprings",
      "shape": "triangle",
      "date": "2018-12-14T00:00:00",
      "story": "Reddish orange flashing lights in a pattern.  Rimmed the triangular, boomerang shape. Would hover in one spot,  as soon as I thought it had disappeared it would reappear moving/ hovering south west.  Finally vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144028.html",
      "state": "CO",
      "duration": "~30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9086",
      "summary": "Date of Incident: 02/13/2018 Summary of Incident: At approximately 20:05 hours, as I was entering the parking lot to the rear of my pla",
      "city": "coloradosprings",
      "shape": "flash",
      "date": "2019-12-01T00:00:00",
      "story": "Date of Incident: 02/13/2018 Summary of Incident: At approximately 20:05 hours, as I was entering the parking lot to the rear of my place of employment located in the Interquest Parkway and I25 area in Northern Colorado Springs, I was performing my normal visual security sweep to ensure it was safe to approach my parked vehicle.  This is a normal procedure I find myself doing on my late shift nights, especially when it is dark. Having used my small flashlight and having identified no immediate danger I cautiously started walking towards my car when, out the corner of my eye and to the right, I picked up something that looked like bright lights or a fire towards the southwest area of town near Fort Carson and/or Cheyenne Mountain AFB.  Turning my head to get a better look I saw what appeared to be a bright string of amber colored flare like lights that at times appeared connected and at times with gaps between them.  At first I thought they may have been aerial flares or illumination rounds fired from the artillery ranges at Fort Carson.   However, I quickly determined that they were not acting like flares and too high to be ‘Illum’ rounds.  In fact, they appeared to flicker in and out by disappearing and reappearing for lack of a better explanation. As I looked harder, it appeared that these lights were above the flashing antenna lights on the very top of Cheyenne Mountain.  I could not quite put together in my head what I was actually seeing and could not fully determine if the object was actually one or many items and if it was moving or spinning (from possibly right to left) or if there was an illusion of movement due to its flickering nature. Suddenly after about a minute or less of this, the object or objects suddenly disappeared and did not come back.  I saw one of my coworkers getting into her car nearby and I yelled out if she just saw that to which she replied she did and made some half joking comment about a flying saucer.  My whole drive home, which was 12 miles in a southerly direction down Powers Blvd, I made sure to keepe an eye out on the sky, however, I never saw them again. At around 20:55 hours, from home, I called a local new station’s news desk, KKTV I believe, and spoke with someone named  Tony and asked him if anyone had called in reporting a string of amber colored lights in the sky. He immediately became excited at stated I was the first report from Colorado Springs and that he has been getting reports of such a thing for the past hour from Pueblo which is just south of Colorado Springs.  He even volunteered that he was going to call NORAD and ask them if anything was going on and that someone had even sent video which he intended to put on the station’s Facebook page. As of the following morning, there were no news reports or video.  I talked to my coworker and she stated that she saw the same thing I did and added that the incident seemed to cause the antenna lights on top of Cheyenne Mountain to flicker on and off, something I did not, myself, seem to pick up on. I am a veteran of the US Army and former law enforcement.  I have seen numerous aircraft and aerial flares over the years and can positively state I have never seen anything quite like this.  However, I am open to the possibility that this sighting could be due to military aircraft and/or flares. The lights were bright and amber colored, much larger than stars but smaller, although brighter, than the moon.   There was a slight wind where I was at but I do not know what the weather was like in the area where the lights were. Postscript: I have waited over a year to post this and was on the fence, so to speak, about doing it at all for reasons personal to me.  However, 3 recent Joe Rogan podcasts have changed my mind.",
      "link": "http://www.nuforc.org/webreports/149/S149587.html",
      "state": "CO",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c90c0",
      "summary": "Cigar shaped UFO captured flying above Garden of the Gods with an aircraft to the east, possibly investigating",
      "city": "coloradosprings",
      "shape": "cigar",
      "date": "2019-12-01T00:00:00",
      "story": "Cigar shaped UFO captured flying above Garden of the Gods with an aircraft to the east ,possibly investigating I was going through some pictures that I took from a summer vacation trip through the Garden of the Gods in Colorado Springs, CO, in late July, 2019 and I noticed a cigar shaped figure in the photo and another aircraft.  One aircraft looks like a fighter jet (Air force Academy in Colorado Springs).",
      "link": "http://www.nuforc.org/webreports/149/S149573.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c911c",
      "summary": "Early in the morning of October 4th 2019 around 4am I was letting my dogs out in the backyard. Per usual I was looking up at the sky wh",
      "city": "coloradosprings",
      "shape": "diamond",
      "date": "2019-12-01T00:00:00",
      "story": "Early in the morning of October 4th 2019 around 4am I was letting my dogs out in the backyard.  Per usual I was looking up at the sky when I saw a large object seemingly hovering around in the same spot.  There was a weird light zipping around the object that I was able to get on video. When looking up at the sky there was an object that seemed quite large hovering in a small area. There were several lights around the bottom of the object which is how I was able to see it slightly moving in sort of a circle.  I assumed, at first, that it was a plane, but as I stood there it didn't seem to be really going anywhere.  It seemed to be very high up above the clouds, though it still seemed quite large. I decided to try to film what was going on with my phone. It couldn't quite pick up the large object even zoomed in as far as it would go.  It did, though, pick up a strange white light that seemed to just be zipping around the sky around the larger object.  This object moved very quickly in a random pattern back and forth around the larger object.  It seemed to almost disappear for a super brief period and then it would reappear on the other side of the larger object in the blink of an eye. As I said, I did get it on video and have watched it several times and even had my husband and sister watch it and we cannot figure out what could be moving around in such a way.  I don't want to just jump to UFO, but I cannot come up with any other explanation. If there was something that was going on at this time of morning in the sky I haven't been able to find it when googling for possible answers.",
      "link": "http://www.nuforc.org/webreports/149/S149489.html",
      "state": "CO",
      "duration": ">15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c926c",
      "summary": "Multiple Lights moving outside our Colorado house for the 2nd night in a row.",
      "city": "coloradosprings",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Multiple Lights moving outside our Colorado house for the 2nd night in a row. This was the second night in a row we witnessed these lights. My fiance filed one on the 15th. We only noticed the one ufo then, but had speculated there may have been more than one. Last night we witnessed at least 3. The light was once again very subtly moving and changing colors (I saw purple/green/red at various times). There was an instance where a plane or jet flew over the object and it then began to rapidly change colors. I also noticed the light rotate to a point where I was able to make out a bit of a shape. I saw a triangle, though my perception honestly could have been off. I took some video with my phone. This was a particularly starry night. I didn't think I'd be able to catch anything since normally my iPhone can't pick-up the stars at night as the camera is only so good. It did catch this light though and the movements I was catching was truly extraordinary. It was blinking/flashing and moving at speeds/in directions I've never seen any norma! l aircraft moved. It almost looked like something you would see in a video game/computer. Almost like a mouse cursor moving. The main light we saw was to the southwest. At some point while I was recording this light, my fiance alerted me to another UFO just to the Southeast at a bit of a higher elevation. This light was a bit more stationary, but had many similarities to the light I was recording. After we had gone back inside, about an hour later at 2:30 AM, my fiance called me into the kitchen to show me another light to the northeast of our house. I took some more video from my office window at the back of the house and once again I captured it doing some more movements. Unsure what these are but at least one of them gave us the distinct impression that it was investigating or searching for something.",
      "link": "http://www.nuforc.org/webreports/149/S149905.html",
      "state": "CO",
      "duration": "3 Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c926d",
      "summary": "Changes shape, rotates, changes colors, does not move the way any airplane moves.",
      "city": "coloradosprings",
      "shape": "changing",
      "date": "2019-12-01T00:00:00",
      "story": "Changes shape, rotates, changes colors, does not move the way any airplane moves. This is the 2nd time I saw something similar to what I saw in the summer of 2008 in Indiana. My fiance went outside to put trash to the curb, came back inside to tell me to check this blue light out in the northwest sky. He knew it wasn't a planet, wasn't a bright star, and didn't look like any sort of plane. A plane actually went by it, I'm sure miles apart in the sky, but from our perspective it was a couple feet. It doesn't seem like something the military would make because of the way it moved. It was a bright star similar to how bright Venus and Mars is, but it changed to red and blue, which at first we thought was an airplane, but it kept spinning in circles as if it was searching for something, when it was moving to the right it would become elliptical- like it was stretching, moved really slow, hovered and spun around and around. It would slowly move back and forth, up and down. It even made a zig-zag pattern in the shape of an S, my mom and daughter came out, while it was harder for our daughter to detect the movement, my mother saw it. And was shock no F-16 were up there investigating it. It even got dimmer at one point. And my fiance just checked it again now (01:17) and its further to the right of where it was when we first saw it. We were going to use our daughter's telescope- but couldn't find all the pieces we needed to get a closer look.",
      "link": "http://www.nuforc.org/webreports/149/S149881.html",
      "state": "CO",
      "duration": "0:45"
    }
  ]
}