{
  "city": "dallas",
  "fetch_timestamp": "2025-07-12T14:18:25.731851",
  "record_count": 148,
  "pages_fetched": 7,
  "api_calls": 8,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b413e",
      "summary": "Ufos report in Irving Texas at 2200 hrs. On or about July 1973 or 1974.",
      "city": "dallas",
      "shape": "oval",
      "date": "2019-04-25T00:00:00",
      "story": "Ufos report in Irving Texas at 2200 hrs.  On or about July 1973 or 1974. Myself and my mother her sister and daughter was watching tv waiting for the news to come on, at 2200 hrs watching wffa channel 8 news the reporter said, \"Folks, if you want to see something amazing go out side and look over the Dallas skyline\" which we did as well as most of the block. What we all saw was three objects looked like the size of a golf balls from about 9 miles from Dallas texas looking east.  At about a 1000 to 1500 feet above Dallas.  These objects was stationery each emitting different colors like blue gold red green silver.  It was rather superb looking.  After just standing there for about a minute each one started to do bizzar monuvers like one was zigzaging the other one was going up then down zipping from on side of the sky back and forth with the other two, at on point they formed a close circle and went spinning around at very fast speed. This lasted for about 3 min.  When the US Navy put a halt to the airshow as they scrambled two F-8 crusaders which at that time was hot alert aircraft, which ment they was armed with the sidewinder missile, along with the 50.cal guns.  They flew from NAS Hensley field out side of Dallas on the southwest just about 6 miles away, it only took about 20 seconds from the time they took off to get  over Dallas.  (I seen them as they left the air station only 3 miles away) never will forget how loud they was in full afterburner,  Just before they got on station, the three objects shot straight up in the night sky in a split second.  The F-8s made a few passes over Dallas before returning to there base. This left me with a impression that the ufos wanted to show the people what they could do, I know aircraft and it was nothing  that any aircraft or helicopter could do. Not only did my family see this but was reported by was channel 8 news along with hundreds of people I will say on thing this report is not a hoax I seen other sightings as well but none as this one.",
      "link": "http://www.nuforc.org/webreports/145/S145751.html",
      "state": "TX",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b418a",
      "summary": "Somethings out there",
      "city": "dallas",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "The hi-pitches noise is what first alerted me to the disk. My family was watching t.v when the t.v started static and picture problems. The lights started blinking from dim to bright.My dogs were whining and scratching the back door wildly.Keep in mind my German sheperd had been qaurentine twice for biting people riding or walking ddown the alley.As well as a mean standard poodle. I went to let them in the house and when I opened the door they ran me over peeing and pooping as they crossed over me.The noise was very hi-pitched.I was 13 yrs old.My first reaction was to run where they did under my bed. I went as far as the bed room and ran back to lookfor my mom and brother. The front door was opened and I went to the porch and our neighbors and my mom and brother were all looking in the sky. I looked up and saw a huge disk shape houvering above the neighbor hood. It was so huge it could have destroyed at least two blocks if it landed. Now it gets even stranger.It is dark outside the sky is just a shade of dk blue but not quite black. The ship is almost the same color or a shade just lighter from the color of the sky. I'm histerical and run in the room where my dogs are. I grab the phone to call police,my dad anyone because I'm scared but remember I have to go getmy mom and little brother. The sound of the ship is head jolting. I ran to get my mom and brother in the house but they just stair in the sky. I grab my neighbor hand and tell her to run. But could'nt budge her. I ran back to the porch behind the bushes surrounding the porch and look up in ahh. I notice that it is round in shape like a washer that goes on a screw then criss-crossing are bars that connect to the center of the disk which is like a black smoke-glass sphere. It didn't have windows and I would have to guess maybe that the center was like a smoke glass marble and they were watching us. Anyway, the outer part begin to have lights red,green,yellow,blue four in a row from my angle i could see blinking at the front side and back of the ship. They blinked in a harmony like way. Then as it went higher u in the sky it's shape seemed to change and the criss-cross bars went in and the disk was smaaler in size and it went up and shot ahead in the sky so fast it was gone. I ran out into the yard where everyone seem to be calm and alert. I was screaming did you see it lets call someone. And mom said calm down it's time for bed. Pat the neighbor was telling every one good night. I was alarmed that everyone was so calm and non-shalaunt about the situation.The next day my mom the neighbors all of them said they didn't remember seeing anything last night. But they couldn't explain why my legs were all scratched up from the dogs running me over in the kitchen and the back door being almost scratched in too from the dogs. I've told this story to every one I know and they just look at me like I crazy. And as god is my witness, I've been when three of them and together they witnessed again another ufo sighting. Do they keep an eye on you once you spot one of them. I've never seen a allien, but I  have seen at least three other ships since I have seen that one at 13. One had three lights and was triangle shape, one just a blue sphere never loosing altitude and traveled in a perfectly straight direction. and yet another like jacks shaped. You know the jacks and ball little girls played as a child. With light on all five ends. They were at close distances and was also a bit over whelming even as I am now a adult. I had the same fear rush threw me as I did as the 13 year old girl who seen the mother of all ships. Nothing has ever come close to the sighting I seen at the house in Dallas,Tx. Whats even stranger is..... Since 1998 I have had a series of dreams.That seem to be messages from alliens. They were very clear and in color that was so bright. Over a two year period I had five that were so real. I have to question if they are related. One thing I am clear on is this. Somethings out there.",
      "link": "http://www.nuforc.org/webreports/049/S49693.html",
      "state": "TX",
      "duration": "16:40"
    },
    {
      "_id": "64d005f478aba2ec5a3b42d0",
      "summary": "Saw spaceships scanning the land.",
      "city": "dallas",
      "shape": "formation",
      "date": "2006-05-15T00:00:00",
      "story": "Saw spaceships scanning the land. Well I was sitting on my balcony reading a book and than i heard a strange sound. It was a sort of buzzing sound so i looked up from my book and saw these spaceships. They were flying like they were scanning the land and in a flash they were gone.",
      "link": "http://www.nuforc.org/webreports/049/S49772.html",
      "state": "TX",
      "duration": "13 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ebf",
      "summary": "Flying object with large bright whirling, twirling lights with at least 4 different colors.  ((anonymous report))",
      "city": "dallas",
      "shape": "oval",
      "date": "2019-04-08T00:00:00",
      "story": "Flying object with large bright whirling, twirling lights with at least 4 different colors.  The object was moving quickly. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145415.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5170",
      "summary": "My family and I was woken by a bright florecent blue like light that lit up the entire neighborhood an my sister was quite scared so at",
      "city": "dallas",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "My family and I was woken by a bright florecent blue like light that lit up the entire neighborhood an my sister was quite scared so at that time we both ran towards our parents room to see if the light had woken them up.  My father and I was quite curious so we went on the porch to see what was going on and my mom begged us not to go outside but of course we went anyway.  And what we saw appeared to be a UFO and I said.....What in the world it covered the whole Oak Cliff area it was a big and round shape object and the lights were outlined the object and they was constantly blinking and as the light blinked it was make a noise at the same time that I really can't describe in writing. It was down very low (Just a few ft. above the street light poles)it stayed about 5-7 minutes and then just disappeared heading west. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52355.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5316",
      "summary": "My UFO sighting over the Immigration Rally in Dallas, Tx.",
      "city": "dallas",
      "shape": "changing",
      "date": "2006-10-30T00:00:00",
      "story": "My UFO sighting over the Immigration Rally in Dallas, Tx. It was all in the Immigration Rally in Dallas Texas on April 9th 2006 at around 13:30. Me and one of the people i was marching with saw this strange object changing shapes in the sky. We didnt know what the object was. We just saw it as a ballon or something. I jokingly said, \"look, bro , a ufo!\" we had a little laugh, not thinking anything of it. But the reason I am bringing it up now is because i was just curiusly looking at ufo pictures on the net (10/06/2006), and it was a ufo that looked exactly like what we saw on that day. I was overwhelmed when I saw the picture, and I immediately thought that some research area might want to know. It was a white cigarrette-like shape, except it moved around, and it seemed to make movements as if it was weightless (thats why we thought it was a balloon at first). It seemed to move like if it had no weight, like if the air was making it move. It was pretty high in the air, probably the elevation that a airplane would fly. The object didnt really seem to move location, it was just like standing still, like if it was just observing how the 300 thousand+ people were marching. At times the object would look like a horizontal cigarrette, and at times it looked like a bomerang like shape. It didnt seem like if it was changing elevation, just the movement of the object. Like I said before, I've held this in for about 6 months because i just thought of it as a balloon. The pictures I'm going to send are not from the Immigration Rally, but they're from some couple in Los Angeles. But the pictures are not of something that somewhat looks like what I saw, but they ARE OF WHAT I SAW, the SAME EXACT THING. In the pictures you can clearly see what im talking about when I said that the object changed shapes. Again these pictures are not mine, they were taken by a couple in Los Angeles. If ya'll have any question to ask me, please feel free to contact me by e-mail only at a_zenon08@yahoo.com . thanks for taking time to read my report. I hope it is to some help to! you guy s.  p.s.- has anyone else from Dallas reported you about this similar object?",
      "link": "http://www.nuforc.org/webreports/052/S52820.html",
      "state": "TX",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5382",
      "summary": "Yellow/orange light moving around slowly, appeared to be around 1,500' altitude",
      "city": "dallas",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "Yellow/orange light moving around slowly, appeared to be around 1,500' altitude About mid-afternoon I saw what I initially thought was a plane with the sun reflecting off, but after several seconds figured out that there was no plane there and the object in fact was self illuminated. Then for a minute or so I watched it move in a manner that a plane would not. It gradually moved away and/or became dimmer, finally disappearing completely. I live off of I-75 and Royal, object appeared to the Northwest at about 45 degrees.",
      "link": "http://www.nuforc.org/webreports/063/S63361.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5813",
      "summary": "Round object with 5 lights",
      "city": "dallas",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "Round object with 5 lights Around 9 PM, my boyfriend called me to our balcony to witness an unidentified object flying overhead. I got there just in time to see it vanish, heading roughly East to Southwest. The object was a round/disc shape, with 5 dim whitish lights on its outer edge. It seemed to either be a translucent dark color, or to reflect the surrounding clouds, which led to it looking 'ghostly'. It seemed pretty large. I'm bad at estimating altitudes, but we're on the direct flight path to the Dallas/Love Field airport which is only about 4 miles away so airplanes fly pretty low overhead (maybe 300ft). This object appeared to only be 2 or 3 times as high; it was roughly the size of a quarter held at arm's length when it disappeared (possibly into the clouds). It was also traveling pretty fast. We heard no sound.",
      "link": "http://www.nuforc.org/webreports/062/S62637.html",
      "state": "TX",
      "duration": "10-15sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b589b",
      "summary": "Its bottom appeared as three dimly illuminated elongated octagons, one in front of two in tandem.",
      "city": "dallas",
      "shape": "unknown",
      "date": "2007-10-08T00:00:00",
      "story": "Its bottom appeared as three dimly illuminated elongated octagons, one in front of two in tandem. 8/13/07 UFO Sighting, Dallas, Texas  On Monday morning, August thirteenth of 2007, I was lying on my back on a lawn lounger cushion up on top of my carport about midnight, prepared to spend the next five hours watching the second night of the meteorite shower.  I had a cut-out cardboard box around my head to block out the street & residential security lights in the neighborhood, making my view of the clear but hazey sky quite clear.  I had laid there admiring shooting stars when at about 12:25 AM a small airplane flew North over me in Oak Cliff, a suburb of Dallas, Texas.  Its North-South trajectory was about a few blocks to the West of my position.  I imagine it to have been following the path of Westmoreland Boulevard.  Before I could see it, I remembered the noisey little airplane by its distinctive sound, since it flies North and/or South over our house frequently at night, always disturbing my sleep.  It triggered the usual question: why aren't such airplanes required to muffle their noise, especially at night?  As it passed over my line of sight, I noticed something following it.  I first thought the plane was towing something behind it, because the object behind the airplane was traveling the same speed and at approximately the same altitude.  It was so dimly illuminated it was hard to see.  It's image area was about six to eight times larger than the small airplane's image area.  All I could see of it was three elongated octagons (rectangles with the corners cut off).  Their lengths ran the direction the craft traveled.  The octagons were in a common plane, two in the back and one in center front, evenly spaced apart in a triangular formation.  It was about one to two hundred yards behind the small airplane and slightly to the West of the airplane's trajectory.  It flew in a straight, level line without deviations.  Either the small airplane was making so much noise that I couldn't discerne the object's sound.  Or, the object was making no noise at all.  The object's three elongated octagonal panels were either very dimly: but evenly illuminated, or they were finished with a non-reflective or ultra-flat coating that evenly diffused their reflection of the city's ground lights over their surfaces.  No sharp ground lights were reflected off of them as it passed over.  And, I don't know if it was a single craft or three individual aircrafts flying in continuous and perfect formation.  I stood and turned around to continue watching it and the airplane as they flew away from me, to the North toward Love Field.  As they dissappeared in the misty distance I couldn't descerne anything about the object's shape.  As the three panels became flat in the distance, the whole thing seemed to dissappear.  But, I could still see the airplane's blinking lights and barely still hear the airplane's noisey exhaust.  I immediately went downstairs to write down and sketch what I'd seen.  Just after one o'clock I called Love Field Tower.  A recording gave me a night phone number.  I called that number at 1:10 AM.  Someone named Gary answered the phone.  I briefly described what I'd seen.  He said he was on the field and to call him back in twenty minutes when he'd be back in his office.  I called him again at 1:30 AM and again told him what I'd seen.  He said he'd talked to the tower and they'd heard nothing from anyone else about it.  I reminded him that the tower's nightn phone number isn't even listed, so the public couldn't have called the tower unless it was a relative or other airport official who already knew the tower's night number, deducing that HE would be the only one to have recieved any calls about it.  He completely ignored that.  It seemed as though he was partonizing or attempting to placate me.  He didn't seem genuinely interested, failing to ask for my name, phone number or any information about the sighting that I hadn't volunteered.  I asked him if there is an official phone number where such sightings are supposed to be reported.  He said, \"No,\" that I'd \"called the right number.\"  So, I appologized for bothering him with such ridiculous nonsense and hung up.  I was left feeling disgruntled, unsatisfied and embarrassed.  Now, that I know the National UFO Reporting Center is listed in the FAA Manual as the correct place to report unusual sky sightings, I'll call ole \"doubting Gary\" back tonight to provide him with the NUFOREC's phone number, remind him to read his manual and give him a free piece of my mind.  I saw a similarly unusual flying object many years ago (I'm bad with past chronology) several miles East of Tyler, Texas.  It was deep in the dark piney East Texas forrest.  The night was clear and the stars were amazingly bright.  The thing appeared to be a sharp triangle, only distinguished by it's blocking out the star's light behind it as it passed over me heading East.  It was moving too slowly, in my opinion, to be an airplane.  It didn't exhibit the three elongated octagonal shapes on the bottom.  If it was the same type craft, I suppose this was because there was no ground light to illuminate them.  It was exactly the same color and intensity of the background night sky.  It, too, made absolutely no sound.  And, I was alone then, too.   I seriously doubt these craft were man-made.  And, I no longer have any doubts that we are NOT alone on our God-forsaken, bloodthursty, demockery-cursed, predatory little planet.  So, perhaps there is hope for Us good Earthlings, afterall!",
      "link": "http://www.nuforc.org/webreports/058/S58194.html",
      "state": "TX",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5939",
      "summary": "Flash of light and streak of light in the southern downtown Dallas skyline.",
      "city": "dallas",
      "shape": "fireball",
      "date": "2006-10-30T00:00:00",
      "story": "Flash of light and streak of light in the southern downtown Dallas skyline. Sitting in my condo I was facing the south southwest sky when I saw briefly a flash and a streak moving very quickly from above downward in a downward west angle/direction.  The streak seemed to stretch across the sky like a white line with a green light mixed in.  It's direction made it appear to be going somewhere southwest of downtown just past the trinity river.  The streak moved fast and only last a few seconds.  I initially I thought it was a plane, or something mechanical going down, but nothing was reported tonight.",
      "link": "http://www.nuforc.org/webreports/051/S51846.html",
      "state": "TX",
      "duration": "A few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c49",
      "summary": "Large cigar shaped metalic flying object",
      "city": "dallas",
      "shape": "cigar",
      "date": "2007-04-27T00:00:00",
      "story": "Large cigar shaped metalic flying object I'm a retired xxx Airlines 777 Captain and former USAF Search & Rescue Pilot.  I thought you might be interested sightings I've had during my carrier?   In the early 1980's, I was flying as Captain on an MD80 from DFW to DEN.  Our departure time was approximately 8:00 pm, hazy, but with partial light still in the sky.  Climbing out of DFW on an initial 185 degree heading, and just passing through approximately 1,000' AGL (above the ground), I spotted a very large object out of the copilots window.  I immediately made the statement to my copilot, \"What the @#*! is that?\"  It appeared to be elongated and \"cigar\" shaped, a grey metallic looking object, moving very slowing from right to left (west to east), and it appeared to have many small, dark, and slightly fuzzy looking, rectangular \"windows\" running longitudinally along the length of the object; a line or band of windows?  I immediately called departure control on the radio and asked, \"Departure, do you show anything ahead of us on radar\".  He replied, \"No, why do you ask?\"  I told him I wasn't sure but that we thought that there was an object out ahead of us.  At first seeing the object, which was initially located in the right third of my copilots window from my viewpoint, I thought that it might be the undercarriage of a 747.  The object appeared to be moving very slowly.  However, as we accelerated on climb out, the object did not appear to be changing in size indicating that we were not going to have an immediate collision.  I had seen mirages many times before in the past, and so I initially thought that this might be a mirage.  Because of the hazy sky conditions, moisture in the air, and dusk, it didn’t appear to be a mirage, but still a possibility.  As we climbed out of 4500’, the object was now leaving us toward the east but still visible in the left third of my windscreen when departure had us turn to the northwest on our way toward Denver.  I didn’t think much of the incident until years later when I happened to turn the television on during one of my layovers.  The program, \"In Search Of\" was on and this particular segment was about a sighting over Montreal (Torronto?), Canada.  In that program, several hundred witnesses described exactly what my copilot and I had seen on our departure out of DFW during the same time period.  The announcer stated that through triangulation, the objects length was determined to be 6,000’ long.  That’s a mile long and would explain why it appeared that we were not closing on the object we saw!  I thought my sighting above might have some interest for your research?  Other pilot friends have had different encounters.  Back in 1979, I was flying with one 707 pilot and he told me that during a nighttime letdown approach into LAX, when still east of Palm Springs, California, he and his Captain had to take evasive action in order to avoid hitting another flying object.  As they pulled back on the stick to avoid colliding with their “UFO”, they could clearly see inside the “cockpit” of this craft and clearly saw the “pilots”.  Both of the American pilots were former USAF pilots and they both knew what oxygen masks looked like, the type worn by military pilots.  What they saw on the “UFO pilots” face(s), helmet or oxygen masks, they said was nothing they had ever seen before.  In their estimate, it was not of this planet. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  We have encouraged the source to try to determine the exact date, using his flight logs.  Also, we have requested that he have the other pilots submit reports, as well.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56376.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d89",
      "summary": "vee shaped lights 7 to 11 over dallas texas in 1957  with no sound.",
      "city": "dallas",
      "shape": "other",
      "date": "",
      "story": "vee shaped lights 7 to 11 over dallas texas in 1957  with no sound. 7 or 11 lights moving from the west to east stoped above us for a fue seconds. we were around 11 years old.my father worked at bell hellacopter at the time.i had told my friend thats what they were .they were not making a sound ,i had told my friend they were too high to hear    i know better now.they were in a v shape ,they moved back the way they were comming from with the one going first then the others at the same space.they could have been oin a craft or lights,i dont remmber what color they were.i just want to know what they were ..iam a male 62 in denton tx. thank you// ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61291.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e29",
      "summary": "Two converging, then disappearing moving lights.",
      "city": "dallas",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Two converging, then disappearing moving lights. Two lights in the sky moving very fast. they eventually converged and suddenly disappeared. I thought they may have been fast moving aircraft, but they were moving much faster than normal aircraft, and had a single light, and when they converged, they disappeared, rather than exploding (as one would expect if they were aircraft).",
      "link": "http://www.nuforc.org/webreports/060/S60402.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e3e",
      "summary": "I walked out on my porch to look through my new telescope. As I was putting it together I looked up to see where the moon was so I coul",
      "city": "dallas",
      "shape": "diamond",
      "date": "2008-06-12T00:00:00",
      "story": "I walked out on my porch to look through my new telescope. As I was putting it together I looked up to see where the moon was so I could adjust my telescope accordingly. As I stared in the sky I witnessed a solid moving object that made no sound. I move from West to East at what appeared to be 5-10 mph. It had no visible lights which threw me because I always invisioned an UFO having quiet a few lights. I watched as it slowly went overhead for about a minute. It never changed speed or made a sound. Because it was dark, I could only make out that it was what appeared to be a diamond shape.",
      "link": "http://www.nuforc.org/webreports/062/S62996.html",
      "state": "TX",
      "duration": "15-30 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b63b9",
      "summary": "UFO spotted in air past DFW airport---not a plane or hot air balloon",
      "city": "dallas",
      "shape": "disk",
      "date": "2008-01-21T00:00:00",
      "story": "UFO spotted in air past DFW airport---not a plane or hot air balloon My daughter and i were traveling east on Illinois Ave across spur 408--when she spotted a very large round-oval shaped craft hovering over the skyline right below some clouds to the north. It was too large to be an airplane, and it didnt move for about 5 minutes---it just hung in the air and when we stopped to continue to look at it---it just took off straight into the sky-not like an airplane or a hot air balloon. It seemed to be in the Plano area or past DFW airport. It didnt have any lights flashing--it was just a very massive object hovering in the air.",
      "link": "http://www.nuforc.org/webreports/060/S60842.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b652f",
      "summary": "Flashing disc followed us, blinked back at our flashlights, lights died, and fiance was zapped to the ground.",
      "city": "dallas",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Flashing disc followed us, blinked back at our flashlights, lights died, and fiance was zapped to the ground. Toward the end of October my fiance & I had been seeing odd things in the sky a lot. we tend to be night owls and we would go walking between midnight and 4am regularly.  She lived with her sister at that point & a new subdivision was being built about 500 yards down from their house.  Over this new sub we regularly saw lights and strange shapes darting about. As we were walking down the street (Benson rd) we saw a disc shaped object approximately a quarter mile ahead of us and probably around 10,000 feet up  It seemed to spin, and white lights shining from it began to blur as it spun around.  We kept walking and it appeared to follow us as we walked.  This all tripped me out due to the fact i was a new believer in UFOs, but she wasn't intimidated by the craft. she decided to blink her flashlight at it to see what would happen. after flashing the light at it, the craft fired off blue, green, and red flares in the same pattern as the light blinked.  We continued our walk, occasionally shining the light skyward with the same results as before.  The craft would also follow the light if we moved the light around. As we headed back to the house, we shone the lights skyward again, illuminating the craft once more.  Suddenly the lights died, and it was not batteries dying.  Both light had freshly charged batteries before we left the house.  As we walked back, we kept looking  back to see the craft following us.  I cannot remember what the neighbors dogs were doing, but it was likely not their typical come out and challenge us behavior.  The craft had followed us all the way back and as it was over the neighbors house, my fiance  felt as if she was shaking or having a seizure.  As we got into the front yard, she suddenly collapsed to the ground.  I helped her to her feet and we went inside.  A final look out the front door showed the craft hovering above the front porch. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56679.html",
      "state": "GA",
      "duration": "about 1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b66b6",
      "summary": "Triangular craft slow and low over Dallas.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "Triangular craft slow and low over Dallas. I swear this to be fact. The hair on the back of my neck stands as a preminition washed over me. I stand from this computer and desk, then walk to my home office door. I open the door, step out into the cold night.  I look up, and oh my God... maybe 300 ft DIRECTLY above my head is a triangular craft. I have such anxiety as I write this. The craft was maybe 150' wide along edge. It clearly traveled forward along one point of the triangle.  All edges were rounded and smooth. NO SOUND.  The bottom of the craft was clearly visable to me.  It had 3 large domes at the corners of the triangle that were glowing a steady amber light.  In the center of the craft was a larger dome that had antenas and other fixtures, that extended down from it.  The longest, and most centered of the extentions had a smooth pulsing red strobe.  The craft had no distinct color other than a metalic dark grey. It moved at about 15 to 20 mph, slow and steady in a SouthWest direction.  The craft seemed to be surveling and mapping, this is just a hunch.  I live in flight paths of two major airports, DFW and Dallas Love Field.  I could not help but notice that there were NO airplanes in the air. The nite was clear and crisp with N/W wind gusts.  I had an unobstructed view of the whole event for approximatly one minute and a half.  For the first 15 to 20 seconds, I was struck dumb with awe not even blinking.  Take a picture I quickly thought.  As I rushed in my office, completely confused as to the logical whereabouts of my family camera, I rumaged through my shelves and grabbed a pair of binoculars.  I stood on my diving board, and at 17x mag. I watched it float off over distant house and treetops toward downtown Dallas. For the record, I am not crazy, although this event has tested every limit of my logical capacity.  I sat in true shock, shivering on my couch wearing my bathrobe trying to calm down for the first 15 minutes after.  I dont understand why I was allowed to witness it or them.  I did not roboticaly move on command or anything like that, however I was asked or encouraged to see.  I just dont know how else to explain that part of the experience.",
      "link": "http://www.nuforc.org/webreports/062/S62248.html",
      "state": "TX",
      "duration": "1 1/2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b68a0",
      "summary": "cigar shape wingless aircraft seen over midday.",
      "city": "dallas",
      "shape": "cigar",
      "date": "2008-03-04T00:00:00",
      "story": "cigar shape wingless aircraft seen over midday. It was a bright sunny afternoon with clear blue sky.  I saw a low angle large reflected metallic glint in the sky and looked at the glint.  Turned out to be a wingless cigar shaped aluminum colored craft moving northerly at about 5000 feet or less in altitude.  The sight is very close to a landing path to a local airport and this craft is too high for aircraft in this particular area.  As I started to focus on the glint, I realized the craft just went up in the air about 5000 more feet and then third second, it was gone.  The craft when it went up in altitude did not move forward to go up, it just went \"backward\" from me, meaning it just went up in the sky in unbelievable speed with no sound and within 2 seconds, it was gone.  It never moved forward another foot from where it was when it was when I first saw it.    there was no wings or tail or any marking except it was grey metallic color in a cigar long shape. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61993.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b68b0",
      "summary": "Disk or Saucer moving south to north in Dallas, Texas.",
      "city": "dallas",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "Disk or Saucer moving south to north in Dallas, Texas. I noticed some very interesting clouds, partially hiding the sun and thought the picture would look nice on my screen saver.  I grabbed my 11 mega pixel digital camera and took three pictures.  The time between the first and second pictures was about 1 minute, and the time between picture 2 and picture 3 was about 30 seconds.  The next day I downloaded the pictures to my computer and noticed something I had not seen when I took the pictures.  You will see some kind of object on the far left side of the frame in the first picture.  It appears the same object moved toward the center of the frame in the next two pictures.  I was shooting due West and there are flight paths for both Dallas Love Field and DFW airport in that direction, but this does not look like an airplane to me. ((NUFORC Note:  Objects are the result of the witness pointing a digital camera directly into the sun.  Not UFO's.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63641.html",
      "state": "TX",
      "duration": "2 - 3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6975",
      "summary": "it appears as a red/orange dot,  it was about 12:00p.m. big as the independence day movie ship.",
      "city": "dallas",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "it appears as a red/orange dot,  it was about 12:00p.m. big as the independence day movie ship. the time was about midnight, and my sister and i were outside when we saw a red dot it appears at first,as it got closer and closer to the point where it went right over our heads. it was the biggest object i had ever seen in my life.it was very dark that night, heading north of texas and was moving horizontal. i tried to to tell my mom at the time but she did not beleive me, a friend of ours heard the noise it made but was inside the house at the time.the ship looked as thought the one big ship in ''independence day'' when the ship first appeared. it had a big red/orange light,the shape of it was a very big circle.it moved very slow but at the time very fast for it size. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53833.html",
      "state": "TX",
      "duration": "30sec-1min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b65",
      "summary": "We saw a white triangle shaped craft and it flew very quick.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "We saw a white triangle shaped craft and it flew very quick. We were bird watching near a forest when we saw a bright flash in the sky, we looked again and we saw a triangle shaped craft, we watched until it went out of sight to the north. I phoned my wife and told her to look for the same flash. She went out and saw it and reported it to the police who said to contact you and they gave me this website address. There are no airports or military bases nearby.",
      "link": "http://www.nuforc.org/webreports/051/S51134.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e17",
      "summary": "Bright white cigar shaped object hovering in Western sky for 35 minutes",
      "city": "dallas",
      "shape": "cigar",
      "date": "2008-03-31T00:00:00",
      "story": "Bright white cigar shaped object hovering in Western sky for 35 minutes At approximately 4:10 this afternoon, 3-20-08, as I was going to my car, I looked up and saw a bright, white cigar shaped object in the sky to the west. It appeared to be hovering but was moving slightly vertically, and horizontally. I watched it for 5 minutes, and then called my neighbor to witness what I saw.  She saw it as well, and said I should report it. I called 911 and they connected me to the UFO Center.  I reported the incident to Mr Peter Davenport, who asked that I write this narrative. I also reported it to WFAA TV...the ABC Affiliate in Dallas.  They said no other sightings had been reported to them.  While still viewing the object after 10 minutes, other American aircraft were flying around, over, and beneath the object. The American aircraft appeared to be military jets because there were smoke trails coming from the back of the crafts.  There were also domestic aircraft flying which looked MUCH smaller than the UFO, and I assume they were flying their regular routes.  I went inside to get my binoculars...and through them I could see the object much better. There appeared to be an orange color on the bottom of the craft. I called my mother, who lives 6 miles away from me, and she saw the disc as well.  I have enclosed pictures of the craft.  I cropped 1 of the pictures...and I left the other 2 photos untouched, so the tree line would be visible.  The object had been visible for 35 minutes when I got into my car and left.   I came back home around 7:00 PM, but the object was no longer visible.",
      "link": "http://www.nuforc.org/webreports/062/S62265.html",
      "state": "TX",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b77ba",
      "summary": "A triangular craft with three bright white lights on the front and two red bright lights on the back in  the night sky.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "A triangular craft with three bright white lights on the front and two red bright lights on the back in  the night sky. I saw it in the dark 9 o'clock sky, but since I'm in the city, the sky was illuminated just a bit so I could see it's outline.  Well, I was looking out the window while driving back from a store when I saw what I first took to be a search helicopter. Upon closer examination, I saw that it had not just one light, but three large lights, arranged in a triangular pattern.  It was large, about one and a half inches in the sky, but it moved slowly, about the same speed as a plane at full altitude.  I stared at it and realized that it was triangular, and it flew, point-forward, across the sky.  It had about 5 lights on it.  Three whites ones situated in a triangular pattern near the front point, and two bright, red lights on each of the other points of the triangle, in this case, which was the back of the craft.  The object flew over the bonnet of my car, so I couldn't see it, and there are quite a few trees so it went out of view, but I got one last look of it flying into the horizon.  And then it was gone.",
      "link": "http://www.nuforc.org/webreports/054/S54833.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8287",
      "summary": "SIGHTING AT CLOSE RANGE",
      "city": "dallas",
      "shape": "oval",
      "date": "2009-08-05T00:00:00",
      "story": "SIGHTING AT CLOSE RANGE A ROUND FLYING OBJECT WENT ABOVE OUR HEADS WE ROAD OUR BIKES UNDER IT FOR TWENTY SECONDS AND OBSERVED THE CRAFT MOVING SLOWLY WEST AND MAKING A LOOP TO THE SOUTHEAST BEFORE DISAPERING.IT MADE NO SOUND AND HAD RECTANGULAR LIGHTS OSILATING IN A CLOCKWISE DIRECTION.I AM A PILOT AND HAVE SEVERAL HOURS FLYING EXPERIANCE BUT NONE ON THE COMPUTORE.I HAVE NOT SAID ANYTHING BEFORE BECAUSE OF FEAR OF COMPLICATION FROM US GOVERNMENT,I WOULD LIKE TO SPEAK TO SOMEONE THAT WOULD WILLING TO LISTIN TO MY STOREY. I AM STILL IN CONTACT WITH THE OTHER TWO PEOPLE WHO SAW THIS.OUR CONTACT WITH THE UFO WAS NO LESS THAN TWENTY FEET ABOVE OUR HEADS BUT I FEEL THAT IT HAD NO EFFECT ON ME.IS THAT CLOSE OR IS THAT NORMAL FOR A SIGHTING OF THIS KIND.",
      "link": "http://www.nuforc.org/webreports/071/S71144.html",
      "state": "TX",
      "duration": ".30"
    },
    {
      "_id": "64d005f478aba2ec5a3b8778",
      "summary": "Found on Google Maps Street View",
      "city": "dallas",
      "shape": "",
      "date": "2008-10-31T00:00:00",
      "story": "Found on Google Maps Street View Found this on Google Maps while looking up an address I noticed the smokey looking tube going into a tree then panned to look up at it and noticed the other object ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65348.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8858",
      "summary": "It's back!  Second time watching a disk in the West sky with flashing red, white, green lights. Dallas, Texas",
      "city": "dallas",
      "shape": "disk",
      "date": "2009-08-05T00:00:00",
      "story": "It's back!  Second time watching a disk in the West sky with flashing red, white, green lights. Dallas, Texas This is the second time I have seen this disk with flashing red, white, green lights. First time was June 9th, 2009. Last night while sitting on my patio looking West, I saw it again.  Same color formations coming from underneath that rotated right to left which is what caught my eye.  No planes fly that late at night.   It sat in the West sky and moved slowly.   Eventually, it grew harder and harder to see as if traveling away.  Then it was gone.  This lasted for 20-30 minutes.   The first time I saw this craft was June 9th, 2009.  It was in the West sky but in a different area and not the same place as last night.",
      "link": "http://www.nuforc.org/webreports/071/S71193.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a78",
      "summary": "looking  on google map looking for ufos in the sea",
      "city": "dallas",
      "shape": "",
      "date": "2010-02-14T00:00:00",
      "story": "looking  on google map looking for ufos in the sea look from delaware up to rhode island on  google map  look off the cliff to the cracks in the wall zoom in on the sea wall  at 10mi  20km  u will  see makeings  on the  floor    and  on the cliff",
      "link": "http://www.nuforc.org/webreports/074/S74002.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8b9d",
      "summary": "looked like a big bright orange light over ft worth me being in dallas being 6:15 pm very bright.",
      "city": "dallas",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "looked like a big bright orange light over ft worth me being in dallas being 6:15 pm very bright. it was exactly 6:15 pm when i seen this object in the sky as i was coming home on bruton rd towards masters i happen to look op as i was driving west coming to a light to turn left. i see a bright light being nice and sunny it seemed odd for it to be a plane so i look at this object for about ten maybe fifteen seconds and it starts to dim as the object was a very bright orange and just started to get smaller it quickly disapeared in those few seconds. the oject i say was at least maybe a good 50 miles so it must of maybe been the size or maybe bigger than a plane.",
      "link": "http://www.nuforc.org/webreports/070/S70749.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8b9f",
      "summary": "round bright light with wedge of red light on it. Stationary in sky. Larger than full moon. Not a plane. Not a star. Not the moon.",
      "city": "dallas",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "round bright light with wedge of red light on it. Stationary in sky. Larger than full moon. Not a plane. Not a star. Not the moon. Today is June 28, 2009 at 10:20 pm. I live in Dallas, TX, near the Turtle Creek area, just north of downtown. I was driving home from a friend’s house about 10 - 15 minutes ago, going southwest on Turtle Creek Blvd. when I rounded a curve and up in the sky directly ahead was a huge lighted object, round, with colored lights. It had a large wedge of red and a large wedge of white light. It was bigger than the full moon, and stationary. The sky is dark. The moon is a bright crescent tonight -- it’s off to the north east, as I can see it clearly in the sky. I saw the object only a matter of seconds, as when I went under the trees and around another bend, it was gone when I came around again. This is the second time I’ve seen such an object in this area. The other time was several months ago, when I saw the same thing -- round object, large, with red and white lights. It was hovering over the boulevard and lasted for 45 minutes or so. I saw it as I was driving, and then parked and went up into my apartment on 12th floor. I watched it from my balcony. I am convinced what I saw was not a plane, nor was it the moon or a star. These sightings are upsetting.",
      "link": "http://www.nuforc.org/webreports/070/S70748.html",
      "state": "TX",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bb6",
      "summary": "Bright light came out from behind nothing, stopped on a dime and then proceeded to fly back behind nothing... cloudless sky.",
      "city": "dallas",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Bright light came out from behind nothing, stopped on a dime and then proceeded to fly back behind nothing... cloudless sky. While on a Boy Scouts camping trip, myself and my friend were laying awake late at night on our chairs, which were laid out to the flattened position, so we were looking up at the stars and just talking about something. Suddenly, something that looked like a bright star came out from behind nowhere – (or more specifically, it looked like it came out from behind something like a cloud, but there were no clouds in the sky at all, it was perfectly clear) – and flew at a fast pace to a certain point, where it then stopped on a dime…. It sat still for a couple of seconds and then was suddenly moving again, headed in the same direction it was heading before it stopped, without any acceleration, it was just moving that fast again.  It then seemed to disappear behind something again, though there were no clouds in the sky. In short, it came out from behind nothing, stopped on a dime, and then proceeded on it’s path and went back to behind nothing again…  My friend and I both saw it, looked at each other, jumped up and ran to our tent.  That’s the only thing like that that I’ve ever seen and I’m glad my friend saw it too or I would have thought I imagined it. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64710.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c7d",
      "summary": "Wingless faceless brown bodied being lands on underhang of apt days appears in apt.",
      "city": "dallas",
      "shape": "other",
      "date": "2010-04-13T00:00:00",
      "story": "Wingless faceless brown bodied being lands on underhang of apt days appears in apt. On 8-23-2009 at 14:53 I was sitting on my apt living room couch when I saw a malelike figure not a pigeon link like flying to the underhang of the roof. Then crawl on top. He had no wings. Then 3 days later I got a better view of him when he all brown head to toe faceless appeared in my white living room chair at the window where I had seen him days before. He appeared there only 3 to 5 secounds then vanished. He both times seemed to be noiseless. His appearance was as if he were wearing brown pantyhose body suit, but I had the impression that it was his flesh all the way through. It was a nice bright day both times. I said there were 2 only because they were seen on different days. I am a high school graduate with some art background. ((NUFORC Note:  Witness indicates that date is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74805.html",
      "state": "TX",
      "duration": "4 Days"
    },
    {
      "_id": "64d005f478aba2ec5a3b8cac",
      "summary": "Orange and pink glowing object following a South West Airlines jet in Dallas, Tx.",
      "city": "dallas",
      "shape": "teardrop",
      "date": "2008-08-12T00:00:00",
      "story": "Orange and pink glowing object following a South West Airlines jet in Dallas, Tx. On August 01st, 2008, at approximately 8:45 P.M. I saw a Southwest Jet passing over the area where I work. I could read the name on the tail and I recognized the Southwest colors and Logo.  I was outside, I do security at night outdoors.  I looked up and heading from where I was standing, North-East toward Love Field Airport I saw a Southwest Airlines jet passing over head. It was about to land I think at Love field as far as I could tell according to the direction it was traveling.  I noticed a light pink and orange object with no sound other than the noise made by the jet and I noticed this slightly glowing craft teardrop in shape or acorn and about the size of a small bus or van  off the jet's right wing about two hundred yards over and about one and hundred fifty yards to the right moving slightly behind  traveling at the same speed the jet was traveling as though it was pacing the jet. I would guess they were about 7 to 8 Hundred feet up and both very visible from where I was standing. It was just starting to get dark.  I watched until both craft went out of my view. This lasted about 45 seconds.",
      "link": "http://www.nuforc.org/webreports/064/S64934.html",
      "state": "TX",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e6d",
      "summary": "((HOAX??))  was going in car and in the air saw a object going faster then a plane and had no lights on it/",
      "city": "dallas",
      "shape": "oval",
      "date": "2009-01-10T00:00:00",
      "story": "wass going in car and in the air saw a object going faster then a plane and had no lights on it have seen others in same area hovering (NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67035.html",
      "state": "TX",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b9090",
      "summary": "Two large Lights over Dallas",
      "city": "dallas",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Two large Lights over Dallas Driving south on 75 toward downtown Dallas. Observed two bright lights in the south sky.  The lights were angled if on a clock one light at 11, the other at 5.  They didn't move.  There is a lot of airplane traffic around Dallas and the planes flying in and out of DFW and Love field were very different in appearance and motion.  These were not airplanes. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67120.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b90f0",
      "summary": "Dropping object in middle of busy air traffic.",
      "city": "dallas",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Dropping object in middle of busy air traffic. Driving North on Nole Ave. North of I-635. I saw a very bright yellow light that dropped straight down very fast (covered approximately 8-10 degrees of arc of the sky in less than one second)faded like a dying spark.  I could see local air traffic moving across the sky from West to East behind the track of the object.  Object's line of flight was very straight.",
      "link": "http://www.nuforc.org/webreports/067/S67144.html",
      "state": "TX",
      "duration": "1 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9321",
      "summary": "Brightly illuminated orb near I35 and 635 in Dallas at 3 am 11/29/08  500 Lights On Object0: Yes",
      "city": "dallas",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "Brightly illuminated orb near I-35 and 635 in Dallas at 3 am 11/29/08   Brightly illuminated orb appeared near eastbound Highway 635 between I35 and Dallas  North Tollway just after 3am.  Because it was very dark and rainy, I was travelling around 45 mph.  I noticed an extremely bright light that appeared to be emitting from a glass office building on the south side of the highway.  It was so bright that I had to squint, and I assumed it to be some sort of spotlight affixed to one of the lower floors of the building.  The light began to flash arhythmically then stayed illuminated and moved rapidly and diagnonally from the lower left side of the building to the upper right side of the building, then it flew toward the west (the opposite direction I was travelling), zooming very quickly directly over my vehicle, perhaps 8-10 stories above the ground.  Entire sighting lasted only a few seconds.   My radio was turned off because my daughter was asleep in the car, and I heard no sounds coming from the object and saw no propellers or wings.  It was not a large object, perhaps the size of a basketball. Immediately after, a street lamp in front of the building extinguished.",
      "link": "http://www.nuforc.org/webreports/067/S67210.html",
      "state": "TX",
      "duration": "<15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b962b",
      "summary": "20:05 hrs., Dallas, TX , wedge shaped object passing approximately 150 feet above house, moving NW to SE at approx 15 mph.",
      "city": "dallas",
      "shape": "chevron",
      "date": "2009-01-10T00:00:00",
      "story": "20:05 hrs., Dallas, TX, wedge shaped object passing approximately 150 feet above house, moving NW to SE at approx 15 mph. At exactly 20:05 hours on the evening of December 5th, 2008, I was in my back yard walking my dogs along with family cats.  Only lights on was backdoor light.  Dogs were running around yard as usual.  What drew my attention to object I witnessed, was one of my cats, who would normally stay distance from me, ran towards me and stopped right by my right leg.  She sat down and was looking up over the roof of house.  I looked at the cat, thinking she was probably just looking at plane lights or maybe a bird so something.  She kept looking, so then I looked up to see what she was seeing. What I believed I saw at first, was a mass of bird flying over, and more than likely geese, since the formation was sort of looked liked a shape of geese migrating.  But then reality hit me.  It was moving at approximately 10 to 20 mph, almost parallel to my street, but when I focused on it, I then could see, that it had mass, and structure of a wedge shape.  It was close enough that I could get a base size from comparing it to the roof of my home.  The overall length was approximately 100 to 150 feet long, and height was approximately 7 to 10 feet, and it was only 100 to 200 feet from the ground.  I was looking at the right lower quarter, from bow to stern.  There weren’t any lights or any sound what-so-ever emitting from the craft. The right side was visible because of the lights of homes and a few street lights carried to that height.  I also had a small private aircraft flying at one to two thousand feet at about 2 miles southwest of our location, so I could get some variable and we have high pecan trees which also gave me some comparison to height from the ground. What was apparent, the side wasn’t a smooth surface.  I say this because you could see dark and then somewhat lighter shades.  This to me could have been either two assumptions:  1.  The surface was painted, as we do some of our military aircraft, so it will blend in with the sky (clouds lighter and darker) or 2.  the surface had angles on it which would show lighter for the parts protruding out and dark for the area that was indented. This is similar to our stealth aircraft for displacing radar.  The light of homes and street lights were barely hitting the surface of the object but it was enough to make out the details. I yelled at my wife, who was inside.  When she came out, the object had only moved ¼ of our block down the street.  I tried to have her follow my arm movement to look down the length of it to be able to see it.  By the time she was in sync with my movement the craft had gained some altitude and was moving away.  The rear of the craft seemed sort of blunt, not the shape appendage you would expect from a tails of an airplane.  It then moved away out of sight, not at an accelerated rate but at a constant speed. My background is journalism.  I’ve spent over 6 years on U.S. Navy aircraft carriers and 6 years on Navy Air Stations, documenting Navy fighters and bombers in flight.  I also was piloting Cessna 150 and 172 aircraft years ago when I started pilot training, so I’m used to aircraft design, determining what you visually see before me in order to navigate and anything associated with flight.  And being a photo journalist I’m very good when it comes to attention to detail.  I wasn’t mentally rattled and didn’t lose my composure but the event left me with allot of questions.   A male friend of my wife at her work, who lives in north Dallas County saw something similar, same design, but with more than one object just a few months ago.",
      "link": "http://www.nuforc.org/webreports/067/S67338.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b96cd",
      "summary": "Green light",
      "city": "dallas",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "I saw this green light fly into visibility in the sky and hover in a position for a couple of seconds.  At first I thought it may have been some sort of firework that was being shot off, but rather than explode or do something of that sort, the object then seemed to quickly fly away and disappear.  I do not seem to recall the actual shape of the object, but it appeared to be round from what I remember.  I also believe that there were a couple of other aircrafts in the area as well. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67347.html",
      "state": "TX",
      "duration": "About 8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9731",
      "summary": "UFO I THINK",
      "city": "dallas",
      "shape": "oval",
      "date": "2008-10-31T00:00:00",
      "story": "UFO I THINK Last  night  me and my boyfriend were driving home with the windows down , we stopped at a red light and I over heard a lady at the bus stop saying  look it’s a UFO, so I just looked up and seen this big oval  circle looking thing “I was like what is that. It  was right in front of us I told my boyfriend to look at it and he said it was a balloon but then it tilted some and you could see red and white lights and metal then we were like that is a ufo. It stayed there for about three mins then as soon as it tilted it took off I keep looking at it and it just got smaller &smaller as it went.",
      "link": "http://www.nuforc.org/webreports/066/S66024.html",
      "state": "TX",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c3a",
      "summary": "Large green self emitting ball of light with a cool silver center over a cemetery in dallas",
      "city": "dallas",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Large green self emitting ball of light with a cool silver center over a cemetery in dallas We were traveling southbound in my buds car, we saw at about 3 o'clock, degrees, in the sky a green light illuminate, travel downward, and disappear. it didn't appear to be a flare or firework of any kind, and it had a cool silver center. It seemed to be controlled by some form of intelligence, when it moved to disappear, it seemed to have moved in a downward parabolic motion as if to begin moving southbound.  The light we saw was conceived over a near by cemetery, i just thought that that was kinda weird. I have no idea weather or not it has a practical explanation, but this was definitely something i haven't seen before and didn't appear to be of this world. I, and my two comrades saw this.",
      "link": "http://www.nuforc.org/webreports/073/S73487.html",
      "state": "TX",
      "duration": "a few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c43",
      "summary": "UFO",
      "city": "dallas",
      "shape": "disk",
      "date": "2010-06-03T00:00:00",
      "story": "Ok, first of all I want to say that I DO NOT wish to gain popularity, money, fame, etc. from this, all I want is to let everyone know that there are very mysterious things going on and I wish I could know exactly what.  I just feel like I need to tell somebody now because what I saw was incredible.  I have told a few friends but I am most definitely sure that they think I saw something(I don’t care if nobody believes me, I know what I saw).   I love to watch the UFO television shows but I am the type that has to see something in order for me to believe so if my friends came up to me saying they saw something I would also may tell them I believe them but in the back of my mind I would probably think they saw something.  Well let me get started.  It was my friends’ birthday and we decided to go to the club 2009 in Dallas, Texas.  We planned on getting wasted and have a good time like we always do.  Well we got to the club and it was a normal night until I deci! ded to go out to the car and smoke a cig with my girl.  We got to the car around 1:45AM.  We were in the car facing north in the parking lot, I was in the passenger seat and she was in the driver seat.  We were having a conversation over something very old as we watched people walk by.  I remember looking at the security guard on top of the building patrolling, looking down, I guess to make sure nothing crazy happened,  it was around 2:15AM when out of the corner of my eye I saw  UFO floating from east to west as if to be a balloon.  As soon as I saw IT, I said “Look” to my girl and we both rushed out the car to look at the thing, we both are sure it wasn’t a plane or a balloon especially because of its lights.  When we stepped out it seemed to have stopped and it just started getting smaller as it went up and before I could process what the hell was going on, it was gone!  The overall time it was there was around 10 seconds.  Well I must say I was a little drunk but it was! n’t my first time drinking and in all my life of getting drunk! I have never seen things that weren’t there especially disk like flying objects.  I also want to say that WE only saw if for a small amount of time so I don’t want to give a description of it since it may be inaccurate but I do remember that it was circular and it had circular blue lights under it!  I also remember that it was kind of fat in the middle so it wasn’t a perfect circle or sphere, maybe egg shaped but like I said I don’t want to go into too much detail since I may be inaccurate.  All I know is that I saw something that I had never seen before and I really didn’t believe in that stuff but I now know that there is “something” out there.  The object made no noise and when it started to elevate did not leave a trail/aurora, nothing, it didn't shoot off into space either like on television, it simply elevated very fast.  I am also almost certain that the guy patrolling on the roof saw it but I’m not sure.  I also know it was around 2:15AM because my cousin called at 2:22AM a! nd by then I just kept talking about it and it had just happened. I also want to add that about 2 minutes after we saw the UFO we were standing outside(because I made my girlfriend stand by me just in case we saw something else) I was looking East of in the distance when I saw 2 star like lights moving up and down as if to be playing but when I told her to \"look\" they were gone!  That only lasted for about 3 seconds. If anybody has seen something similar I would love to hear about it and compare, I am really interested and excited because I now know we are not alone.  If you think I was too drunk or I am mistaken, NO! I know what I saw.  I wish I could have captured it on camera but I don't know why I didn't even think about it.  I will go there again and try to capture some proof.",
      "link": "http://www.nuforc.org/webreports/075/S75540.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9cd4",
      "summary": "Bright, neon-green fireball (or flare) falling towards ground slowly",
      "city": "dallas",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "Bright, neon-green fireball (or flare) falling towards ground slowly Roughly Midnight, I was at a aircraft gate and saw what appeared to be a bright neon green flare appear out of nowhere and float slowly towards the ground (as if it was simply dropped out of a plane). This occurred roughly southwest of the airport, but still close enough to be on the airport property. The intensity is what I'd expect from a anti-missile flare from military aircraft. The flare had a smoky white trail approx. ten times its own length (illuminated by the flare) as it fell. Lost sight behind a building, appeared to have hit ground. Unable to investigate further. I work daily at the airport and have not seen anything like this before. Upon reviewing the reports here, this appears to be happening regularly. I will ask ATC @ the airport tomorrow about this",
      "link": "http://www.nuforc.org/webreports/073/S73483.html",
      "state": "TX",
      "duration": "several seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9de8",
      "summary": "Large Bright Green and Purple OBJECT or LIGHT  falling in  DALLAS sky.",
      "city": "dallas",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Large Bright Green and Purple OBJECT or LIGHT  falling in  DALLAS sky. STRANGE Green and purple OBJECT or light falling from sky  It was 11:30 P.M. I am in Dallas, Texas I live near 75 and Walnut Hill I was facing Northeast and I was outside with my dogs. It light seemed fairly close, but it happened so fast, my best guess was that it was in a 10-15 mile radius from me  Clear conditions  I just saw something very interesting and strange. I know I have heard about the satellite collision and debree, but I'm not sure if that is what I saw. I was standing outside with my dogs and looked Northeast...  I saw a fairly large flash of green and purple light. The light was changing shape from a ball shape to comet shaped. The light was bright green. The bright green was framed by purple light and it seemed to get brighter then darker, then brighter again. The light began to fall.  It was falling toward Earth and I don't know if it was light or an object falling to Earth...  It fell for about 10-15 seconds. And then dissappeared. I also lost sight of it behind the tress that line my street.  After that another light (similiar but smaller) also followed.  It was NOT a firework nor a shooting star ( too large and wrong color) and was BRILLIANT and solid light...  I live near a fairly busy street, so noise is everywhere..so I cant say that there was any sound accompanying it  It was just like 5 seconds and then as it fell. it dissappeared...  I am a 35 year old Paralegal in Dallas.",
      "link": "http://www.nuforc.org/webreports/068/S68835.html",
      "state": "TX",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba005",
      "summary": "To whom it may concern; I want to report a UFO sighting I witnessed on Jan.24th 2009 at 9:30 EST.",
      "city": "dallas",
      "shape": "cigar",
      "date": "2009-03-19T00:00:00",
      "story": "To whom it may concern; I want to report a UFO sighting I witnessed on Jan.24th 2009 at 9:30 EST. I live in Gaston County, N.C. out in the northern end, which is very rural. As I went out to feed my animals I looked up to the skies, and noticed that the planes were spraying chemtrails AGAIN, so as I watched on plane headed northwest I looked up and saw what appeared to be an object flying in the opposite direction.  This object was cylinder in shape and moving quickly across the shy, right over my house.  I didn’t see any lights, nor did I see any wings on this aircraft.  The color seemed to be metallic grey, without windows.  I tried to capture it with my cell phone cam, but the object was moving so fast, that it was gone, before I could even open the camera feature to capture the object. This is my first UFO sighting, so you can imagine the shock and awe of this experience. I know for a FACT, that this was not a blimp, I know full well the difference, as I live around many small airports, where Blimps are stored. I can only compare this object to a giant flying cigar. Peace and Blessings,  ((identifier deleted)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68943.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba3c9",
      "summary": "A series of light about 13-15, they all were the size of a star...... flying over Dallas on 5.28.2009 at 11.50 pm",
      "city": "dallas",
      "shape": "unknown",
      "date": "2009-06-09T00:00:00",
      "story": "A series of light about 13-15, they all were the size of a star...... flying over Dallas on 5.28.2009 at 11.50 pm At 11:50 P.M. on May 28, 2009 in Dallas, Tx I stood outside my apartment star gazing.  As I look at the dipper, not sure which one but it was a dipper.. a series of lights appeared.    As I watched these lights flying in a V-Formation I couldn’t believe my eyes.so I ran inside grabbed my wife.   And showed her the lights.  We both looked in awe.. as the objects was flying.. it then broke into a straight line   > ..   < indicated by the arrows.   This is the formation that the objects flew in, then the middle object took the lead and it then became a V again.  As I looked closer and watched and watched this wasn’t a huge massive object.  It was at least 15 small specs.. moving in a synchronized pattern..  It was so far away that the dots looked exactly like stars.   It took about 1 minute for these objects to fly completely across the distance of the sky and out of the horizon at exactly at 11.50 or 11.53 close to those times. These objects appear.. clear as day  if anyone was looking in the sky over Dallas around this time it was almost impossible to miss.. as it flew across the sky in blended in with the stars.  Then re-appeared again same formation same speed a constant movement I don’t know what we saw but we most definitely seen something flying into the bowl of the dipper and proceed to fly across the sky..... the color was specs.... the same color u see when u look at a star...... the objects were flying in a SE direction directly over the Northern part of Dallas....close to the highway of 635 right before the city of Garland",
      "link": "http://www.nuforc.org/webreports/070/S70256.html",
      "state": "TX",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba3e4",
      "summary": "Orange Lights in Dallas",
      "city": "dallas",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Orange Lights in Dallas. Just wondered if any one else saw three orange lights that moved to the west in a pattern then went into a circle as they moved.  I just happen to be walking outside to the garden and looked up and saw three light, smaller than the moon and bigger than stars or planets.  Bigger than lights from a plane.  It was such a quick sighting due to the tree getting in the way.  I live near an airport and if it was a plane or some other aircraft i think i would have heard it easily. They had no sound.  If it were the way the moved  the speed and the formation they could not have been balloons with flairs. It was such a quick sighting on my part, I just wondered if anyone else got more than I got from my sighting.  I thought it so strange that i was hoping someone else saw it. Thanks for posting.",
      "link": "http://www.nuforc.org/webreports/066/S66307.html",
      "state": "TX",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba75b",
      "summary": "Midnight 10/27/08 Dallas,TX. Two formations - semicircular & v-shaped. 1st moved from north to south. 2nd moved from east to west.",
      "city": "dallas",
      "shape": "formation",
      "date": "2008-10-31T00:00:00",
      "story": "Midnight 10/27/08 Dallas,TX. Two formations - semicircular & v-shaped. 1st moved from north to south. 2nd moved from east to west. Starting at 11:53 as I lay on the porch of my four-story townhouse in downtown Dallas. I was looking up at the night sky and I saw a semicircular object moving from north to south. The shape looked like an incomplete circle of lights that was missing about 1 or 2 lights that would have completed the circle. The single lights that made up the incomplete circle were blue-white and circular, and there were probably about 7 of them. It was moving across the sky at about the same speed that a plane would but it was moving in very sudden, subtle movements and it wasn't exactly moving in a straight line. It also seemed like it would stop on a dime and then continue as it was. Also, when I looked at the formation it looked as if I were squinting my eyes and looking at a streetlight (it was blurry), but as I looked at the stars near the formation, I could see them clearly. They continued on their path for about 2-3 minutes until they disappeared on the other side of my roof. After that I saw another formation moving from west to east. This was probably at 12:30-12:45. It was in a V-shape and it wasn't as blurry as the first one. Again it was moving at about the same speed as an airplane. These could have been jets in a very precise formation heading somewhere but it was completely inaudible. This formation seemed to move in more of a straight line but again they had some sudden, subtle movements that lead me to believe that they were not airplanes. There were probably 7 circular white-orange lights with one in the front and even amount of lights on either side of the \"V\". I am the only observer that I know of. I am 14 years old and I go to a private school in Dallas that requires greater than average intelligence. I wasn't fatigued at all as I saw these formations and I've never had any mental hallucinations or anything before. I have experienced floaters (in eye doctor jargon) but I'm sure that the objects I saw were not them. The wind was going from north to south, so they weren't flares if the! y went f rom east to west. To conclude, I have never really strongly believed in aliens or UFO's or anything of the sort, but this seems very extra terrestrial to me.",
      "link": "http://www.nuforc.org/webreports/066/S66465.html",
      "state": "TX",
      "duration": "6 min total"
    },
    {
      "_id": "64d005f478aba2ec5a3ba810",
      "summary": "3 square orange lights in a large triangle formation moving silently SSE over downtown Dallas.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "3 square orange lights in a large triangle formation moving silently SSE over downtown Dallas. I was walking my dog after getting home from a late class. It was after 11 pm CST but not yet 11:30. My dog was lingering in a parking lot so I looked up as I often do to observe the stars. I saw what I thought was a plane taking off from Love field, north of Dallas, without its bright landing lights on. I thought that was strange because I expected the dimmer lights to be red and green for port and starboard. The lights were square, orange and made a perfect triangle. The craft never made any noise at all! It moved in a straight line over downtown Dallas at an almost due south direction; slightly east. I watched for 20 minutes for other crafts or for it to return and saw nothing. It was relatively larger than the little dipper which was also visible.",
      "link": "http://www.nuforc.org/webreports/066/S66529.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba87d",
      "summary": "Object was a fast moving fireball, that moved towards the ground, disappeared and scared my dogs(and me).",
      "city": "dallas",
      "shape": "fireball",
      "date": "2008-07-05T00:00:00",
      "story": "Object was a fast moving fireball, that moved towards the ground, disappeared and scared my dogs(and me). fireball, moved fast, white then turned blue, moving towards ground, flashed, disappeared, my dog actually barked at it, did make a noise, looked like it was far away, then both my dogs started barking and ran towards the back fence, I then heard a noise, like a whistling, my dogs ran to the back door, as if scared, I thought I had seen a light around the time, same fireball like object, in the last week, I thought I was just being silly and it was a shooting star, this time it seems to be real and not my imagination, if dogs could talk, I would have witnesses, very odd experience, I have never believed in this sort of thing",
      "link": "http://www.nuforc.org/webreports/064/S64247.html",
      "state": "TX",
      "duration": "2-3 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba9dd",
      "summary": "APPROXIMATE 5 SECOND GREENISH FLAME LIKE BURST SEEN DESCENDING @ A DOWNWARD ANGLE TO THE SOUTHWEST OF DALLAS",
      "city": "dallas",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "APPROXIMATE 5 SECOND GREENISH FLAME LIKE BURST SEEN DESCENDING @ A DOWNWARD ANGLE TO THE SOUTHWEST OF DALLAS SOMEWHERE BETWEEN 10PM AND 12AM ON AUGUST 21ST 2010 A FRIEND AND I WERE DRIVING WEST ON HIGHWAY 30 TOWARD DOWNTOWN DALLAS, TEXAS A FRIEND AND I BOTH SAW @ THE SAME TIME A GREENISH FLAME BURST THAT APPEARED TO BE FALLING AT A SLIGHT ANGLE IN THE UPPER LEFT SIDE OF MY DRIVER WINDSHIELD SO IT WAS APPARENTLY VERY HIGH IN THE AIR. THE FLAME BURST LASTED FOR APPROXIMATELY 5 SECONDS AND APPEARED SOUTH WEST OF WHERE WE WERE DRIVING POSSIBLY NEAR ARLINGTON FROM THE POINT THAT WE WERE TRAVELING.. THE BURST LOOKED TO BE TO THE WEST OF DALLAS BUT TOWARD THE SOUTH AS WELL BUT WE OBVIOUSLY COULD NOT TELL WHERE IS WAS EXACTLY, IT COULD HAVE EVEN BEEN AS FAR AS OVER ANOTHER STATE TO THE WEST OF US IN DALLAS TEXAS.. COINCIDENTALLY THE SAME FRIEND AND HAVE SEEN MORE THAN ONE \"SHOOTING STAR\" BEFORE SO WE BOTH KNOW VERY WELL THAT THIS TIME WE HAD WITNESSED SOMETHING VERY DIFFERENT THAN ANYTHING SEEN BEFORE.. I HONESTLY WROTE IT OFF AS A METEORITE OR SOMETHING ENTERING OUR ATMOS! PHERE A LOT CLOSER THAN I HAD EVER SEEN BEFORE, UNTIL I WAS WATCHING UFO VIDEOS ON YOUTUBE THIS MORNING. I DECIDED TO GOOGLE SEARCH (SIGHTING 8/21/10) AND THE 1ST THING THAT POPPED UP WAS A VIDEO A MAN HAS FROM A SIGHTING THE SAME EXACT NIGHT OVER ARLINGTON TEXAS WHICH JUST HAPPENS TO BE JUST WEST OF DALLAS, THIS IS WHAT PROMPTED THIS MY REPORT OF SIGHTING. THE DAY AFTER I SAW THE BURST I SEARCHED ONLINE TO SEE IF ANYONE ELSE REPORTED ANYTHING, I WAS SHOCKED TO SEE THAT THERE WAS NOTHING REPORTED BECAUSE I THOUGHT FOR SURE IT WAS SOMETHING NATURAL THAT EVERYONE ELSE HAD SEEN.",
      "link": "http://www.nuforc.org/webreports/078/S78671.html",
      "state": "TX",
      "duration": "5seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baad4",
      "summary": "Object over D.F.W. Metroplex",
      "city": "dallas",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Object over D.F.W. Metroplex South of D.F.W. Airport. I glanced out of the window of my vehicle and saw a very dim light which appeared to be a faint star.  The object started to move northbound in the direction of D.F.W. airport.  I noticed a triangle shape surrounded the single beacon under the craft which i could barely make out because it appeared to match the sky \"the craft that is\".  The movement appeared very fast and erratic in motion. I would guess 100' - 200' in size.  Object made no noticeable sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77811.html",
      "state": "TX",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3baba7",
      "summary": "Soundless hovering airplane",
      "city": "dallas",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Soundless hovering airplane I work close to the north Dallas tollway and LBJ Freeway.  Last Friday, I had exited the parking garage and turned onto Harvest Hill Road when I looked up.  I saw an airplane which was very low; I thought it was about to land.  Then I realized it was not moving nor was it making any sound.  It was not hovering the way a Harrier jet does - it was as if it were frozen in place.  I was even more astonished to realize no one else seemed to be paying attention.  Let me repeat: it was the afternoon rush hour on a Friday.",
      "link": "http://www.nuforc.org/webreports/078/S78150.html",
      "state": "TX",
      "duration": "Brief"
    },
    {
      "_id": "64d005f478aba2ec5a3babd1",
      "summary": "Squid shape UFO in Dallas.",
      "city": "dallas",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Squid shape UFO in Dallas. The object had a dark green glow, it was cigar shaped on the top with 3 protrusions. It almost looked like the body of a squid with 3 legs instead of tentacles under it. When it faded I don't believe it went behind a cloud, as it faded from back to front. This was seen in the distance South of Flagpole Hill Park in Dallas, Texas. I do have a photo but it only shows up as a very faint shadow in the background.",
      "link": "http://www.nuforc.org/webreports/078/S78153.html",
      "state": "TX",
      "duration": "35 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bac44",
      "summary": "Bright white light cigar shaped object seen flying slowly to the north in slight decent.",
      "city": "dallas",
      "shape": "cigar",
      "date": "2010-11-21T00:00:00",
      "story": "Bright white light cigar shaped object seen flying slowly to the north in slight decent. POSSIBLE UFO SIGHTING On October 12, 2010 about 7:10 PM I was walking to my car when I looked up at the sky and saw a slender, elongated white light object traveling slowly in the sky toward the north.  It did not change course or make any other movement other than traveling forward at a slight decent.   There is no airport nearby in that direction.  I watched it for about five minutes until it passed out of my sight range.  The object had no structure, only bright white light.  Therefore, it was definitely not a plane.  Nothing was emitted from it, and I could hear no sound.   The object was high in the sky, so did not get an up-close view of it. The weather was clear, about 75 degrees, and no moisture.",
      "link": "http://www.nuforc.org/webreports/078/S78338.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb639",
      "summary": "My wife and I witnesses an UFO like figure in the Dallas South-East sky on January 24, 2011 at approximayely 5:00am",
      "city": "dallas",
      "shape": "teardrop",
      "date": "2011-01-31T00:00:00",
      "story": "My wife and I witnesses an UFO like figure in the Dallas South-East sky on January 24, 2011 at approximayely 5:00am and last at least an hour as I post the report. Really Bright looks to close to be a star and too big to be a Star. Just hanging in the sky and seems to be rising slowly.",
      "link": "http://www.nuforc.org/webreports/079/S79815.html",
      "state": "TX",
      "duration": "3"
    },
    {
      "_id": "64d005f478aba2ec5a3bb63e",
      "summary": "Yellowish Orb appears and vanishes within seconds at high speed",
      "city": "dallas",
      "shape": "flash",
      "date": "2011-01-31T00:00:00",
      "story": "Yellowish Orb appears and vanishes within seconds at high speed I was looking at the Orion constellation in the SE sky when out of the corner of my left eye, I saw a bright yellowish flash in the NE sky, turned out to be a orb at approximately 1000 feet in the air, streaking from the NW part of sky towards the SE.  It moved at a very fast speed I would considering the distance it covered in the short time it was illuminated, it covered at least 60-90 degrees of the sky in a matter of 5s and like going behind an invisible wall it vanished. Now I will consider that its relative traveling direction was E-SEish from my apartment complex where in relation to an airport just south of me does have heavy air traffic, however having seen hundreds of planes in the night sky travel over my head this was not the normal.  On the contrary no plane at night turns their lights off especially on approach to land.  Besides every plane makes a noise and this was silent making no noise. Having witnessed multiple \"shooting stars\" I can also say that this was definitely not that either.  It was simply too bright, in my example its as if the lights just went out, like turning a light bulb off w/o the afterglow effect, or nothing like the dwindling light of a \"shooting star\". ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79838.html",
      "state": "TX",
      "duration": "5s"
    },
    {
      "_id": "64d005f478aba2ec5a3bb90c",
      "summary": "UFO over I75 and I635 in Dallas TX 07-12 2010 at 8pm",
      "city": "dallas",
      "shape": "other",
      "date": "2010-07-19T00:00:00",
      "story": "UFO over I75 and I635 in Dallas TX 07-12 2010 at 8pm My son and I were driving north on I75 in Dallas, Texas, just before I635 at forest Lane on 07-12-10.  We were going to get some dinner.   It was 8pm and we saw a grey-black ob-long object streak out of the north sky over I635, make an impossible J curve to the left and disappear behind the Forest Tower Building.  It was larger then a Jumbo Jet and performed the whole manuever in less then a second.  I've been to many air shows and can assure not even a fighter jet could move that fast and would never come that close to the ground or public buildings.   We went home and both drew seperate pictures of what we saw.  The drawings were almost identical.",
      "link": "http://www.nuforc.org/webreports/076/S76501.html",
      "state": "TX",
      "duration": "Less then a second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb9c5",
      "summary": "Bright flashing lights that changed from red to blue to white. The UFO went from left to right and back and forth until disappearing th",
      "city": "dallas",
      "shape": "flash",
      "date": "2010-07-19T00:00:00",
      "story": "Bright flashing lights that changed from red to blue to white.  The UFO went from left to right and back and forth until disappearing three minutes later.",
      "link": "http://www.nuforc.org/webreports/076/S76570.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bba8f",
      "summary": "3 crafts with amber lights suddenly appear , then disappear",
      "city": "dallas",
      "shape": "formation",
      "date": "2010-07-10T00:00:00",
      "story": "3 crafts with amber lights suddenly appear , then disappear Time: between 8 and 9 PM, near dusk, partly cloudy with haze. While working at my computer in a bedroom with its window facing south (also faces the front yard of my house), I heard some strange noises outside the window.  The strange noises sounded as if there were hard droplets, hail, or a large amount of pecans falling onto my roof and sidewalk from trees outside.  Being concerned that a thunderstorm was blowing in, I stood up from the computer and went to the window to look through the blinds to see outside. When I peeked through the blinds, the strange sounds immediately stopped.  I looked into the yard and into the street across the way to see if rain drops or hail were falling.  Not seeing any drops of rain or hail, I then looked out onto the horizon to see if there were any thunderstorm clouds, and immediately saw a series of strange lights directly south approximately 15 degrees on the horizon. At first, the lights appeared to be three landing lights on the front of a large airplane heading north. What was strange about this apparent airplane was that it was banked downward as if it were about to turn to the west, but it did not move from this position.  The lights were all of the same amber color, with the two outermost lights the brightest, the center light more dim.  The craft stayed stationary as if it were parked in the sky at an angle.  The other odd thing about this craft was that it seemed to be extremely large, and located approximately 5 or 6 miles southward near the junction of the Dallas North Tollway and I-35.  An estimate of the size was approximately 300 or 400 feet across (huge). Then, incredibly, another craft of similar proportions (but further in the distance), suddenly appeared to the left of the first craft, and it was banked at a different angle compared to the first craft.  The sudden appearance of the second craft was immediate, as if a light switch or strobe had been turned on.  My immediate thought was that there was some sort of fireworks or laser light show being given near the American Airlines Center near downtown.  Then, incredibly, a third craft, immediately appeared to the right, with the same proportions, but at a different distance than the other two craft.  The third craft was also banked at a different angle compared to the others.  It was difficult to discern whether the crafts were actually moving very slowly, or if they were completely stationary. Then, each craft blinked its lights off and on (the three lights of a craft in unison) as if the crafts were communicating with each other.  The blinking seemed to be in a sequence, as if each craft was a separate ornament on a Christmas tree.  The sequential blinking lasted less than 1 or 2 seconds.  All of the lights disappeared as suddenly as they had appeared, but not at the same time (each craft \"turned-off\" at different times). All of the above took place on the order of about 10 seconds.  I have never seen anything like it before. I have been searching the news sites to see if anyone else saw the same lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76307.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb34",
      "summary": "While driving home from work on I-635 heading W at about 10:05 PM I noticed a bright light in the sky.  ((NUFORC Note:  Venus?  PD))",
      "city": "dallas",
      "shape": "light",
      "date": "2010-07-06T00:00:00",
      "story": "While driving home from work on I-635 heading West at about 10:05 PM, I noticed a bright light in the sky.  It looked like an extremely bright star or possibly an airplane except that it wasn’t moving.   I kept my eye on it as I was driving and noticed that it still wasn’t moving and there were no flashing lights like you would normally see on an airplane or helicopter. It piqued my curiosity so I exited the highway and pulled into the parking lot of the Sports Authority store at Midway and I-635.  I parked my car behind the building and watched the light for 15-20 minutes.  There was a very light thin cloud cover this evening so most stars weren’t very visible and this light appeared to be below the cloud cover. At approximately 10:32 PM the light suddenly dimmed to a dark blue color and became difficult to see.  It stayed this color for 10-15 seconds and then faded out completely to black.   I could no longer see the object and I wasn’t able to make out any shape in place of the light.  It was the most bazaar thing I’ve ever witnessed in the sky.",
      "link": "http://www.nuforc.org/webreports/076/S76133.html",
      "state": "TX",
      "duration": "30 minutes (approx.)"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf49",
      "summary": "Bright, white, continuously burning light ball speeding over downtown Dallas.",
      "city": "dallas",
      "shape": "fireball",
      "date": "2011-10-10T00:00:00",
      "story": "Bright, white, continuously burning light ball speeding over downtown Dallas. September 4th, 2011 -  Somewhere around 4/4:30 am, as I turned the corner onto a local street near my home,  a “light ball” sped overhead across the sky from behind my vehicle toward downtown Dallas (Texas).  The basic direction was from WSW to ENE - horizontally, and fairly low. This object consisted of a single, bright, white, continuously burning light. Size was indeterminate but it was rather large, much like a small meteor.  The speed would suggest a falling star or meteor and was out of sight as quickly as either, however, neither travel horizontally or as low as this object did.  It was far too fast to be a helicopter or airplane.  I had the windows rolled up and the radio on, preventing me from hearing any sound associated with this object. I considered the possibility that it may have been a street light reflection off the windshield. However, I turn this corner every single morning at approximately the same time and, not only have I never seen something like this before, there is no street light nearby. In my 55 years I’ve never seen anything like this and the hour may be prohibitive for many others to have witnessed this object.  I would really like to know what it was that I saw and if anyone else had witnessed it.  If this object was one of our own aircraft then it is something that hasn’t been made public and very advanced.",
      "link": "http://www.nuforc.org/webreports/083/S83777.html",
      "state": "TX",
      "duration": "instantaneously"
    },
    {
      "_id": "64d005f478aba2ec5a3bc205",
      "summary": "Bright large hoving  light that dissappear  and reappered within a 10minutes  time frame...",
      "city": "dallas",
      "shape": "fireball",
      "date": "2011-12-12T00:00:00",
      "story": "Bright large hoving  light that dissappear  and reappered within a 10minutes  time frame... It was shape bigger than star, very bright and lights that dissappear  and reappered  hoving in one spot for at least 10minutes.  Quickly dissapates and return hoving in sky.  This does not look  like  a plane, also red spickle can also be seen.",
      "link": "http://www.nuforc.org/webreports/085/S85378.html",
      "state": "TX",
      "duration": "10-5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc288",
      "summary": "Three Circles of lights moved across the night sky.",
      "city": "dallas",
      "shape": "circle",
      "date": "2012-01-12T00:00:00",
      "story": "Three Circles of lights moved across the night sky. Around 8:30 pm on Jan 31, 2011, my mother called my attention to strange moving lights in the night sky which she saw through the front window of our home.  We went outside into the back yard and watched a circle of orange lights moving in a straight line from southwest to northeast about 45 degrees above the horizon for about seven to 10 seconds until they disappeared.  The lights appeared go out rather than fade with distance.  The size of the circle of lights was smaller than the moon and I believe that I could have covered the lights with my forefinger had I held out my arm.    We immediately noticed another set of circular red lights moving across the sky above us from south to north almost directly above us at the same rate of speed as the first, and then another.  We went through the house to the front lawn and there appeared to be 15 to 20 sets of circular lights high in the sky, much closer than stars but not moving - they are still there at 10:52 P! M.",
      "link": "http://www.nuforc.org/webreports/086/S86189.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bc475",
      "summary": "11 orange lights.  Moving S to N slowly.  Covered a good portion of the horizon east of Dallas.  I got two videos on my smartphone.",
      "city": "dallas",
      "shape": "light",
      "date": "2012-01-24T00:00:00",
      "story": "11 orange lights.  Moving S to N slowly.  Covered a good portion of the horizon east of Dallas.  I got two videos on my smartphone.",
      "link": "http://www.nuforc.org/webreports/086/S86583.html",
      "state": "TX",
      "duration": "4 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7d1",
      "summary": "Orange Fireball in the sky",
      "city": "dallas",
      "shape": "fireball",
      "date": "2012-01-24T00:00:00",
      "story": "Orange Fireball in the sky At approximately 19:30 hrs I was taking out the trash when I looked up into the night sky.  I noticed an orange colored fireball shape making its way across the sky.  Because DFW airport is near, I initially figured it was a landing plane; however, there is no glowing orange landing lights of that I am aware.  I was unable to make out any directional lighting i.e. green and red wing tip lights.  It seemed to be moving faster than that of a plane.   So I watched it for several seconds, it made no change in direction.  The object from my perspective and location moved from a South Eastern direction to a North Westerly direction.   When a commercial plane on approach to DFW came into my view with its landing lights on, I was able to compare the two objects.  I was able to compare the light temperatures which were clearly different.   The size of the orange glow was much larger than that of the planes landing light. Although the orange object appeared closer to my location ! than that of the plane.  I was able to make out the directional green and red lights, in addition, the flashing strobe on top of the commercial plane in the distance.  The orange object did not have any additional lighting.  I also noticed that the orange fireball shape was moving away from my direction and away from the direction of DFW.  In addition, the orange fireball object appeared to be at a higher altitude than the plane. Once it was in the NW quadrant from my location the orange glow went out.   I was waiting to hear the whine of engines or growl of a rocket thrust and heard neither.  My only regret is that I stood watching in awe instead of running for a video camera.",
      "link": "http://www.nuforc.org/webreports/086/S86804.html",
      "state": "TX",
      "duration": "45-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7ae",
      "summary": "Smallish triangular \"floating?\" northwest direction, red, blue, yellow lights on corners, low flying.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2011-08-21T00:00:00",
      "story": "smallish triangular \"floating?\" northwest direction, red, blue, yellow lights on corners, low flying. I was standing on the porch facing east smoking a cigarette when I noticed this flat triangular object weightlessly floating in a north west direction, maybe wider than the length of someones arms spread out.  It was just high enough to pass a good 25 feet above the third story.  It had three colored lights on each corner of the triangle; whitish yellow, blue, and red and the center was really dark.   I called for the boyfriend to run out and look at it and he caught it just as it passed over the apt.",
      "link": "http://www.nuforc.org/webreports/083/S83023.html",
      "state": "TX",
      "duration": "30-45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bcac9",
      "summary": "Bright yellow lights, most of the craft was hidden by the clouds.",
      "city": "dallas",
      "shape": "disk",
      "date": "2011-07-17T00:00:00",
      "story": "Bright yellow lights, most of the craft was hidden by the clouds. The craft was covered by clouds.  Had bright yellow lights which flickered off and on for about ten minutes before finally disappearing into the night sky.",
      "link": "http://www.nuforc.org/webreports/082/S82424.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bce9b",
      "summary": "An event I thought was awesome!",
      "city": "dallas",
      "shape": "triangle",
      "date": "2011-05-12T00:00:00",
      "story": "An event I thought was awesome! Me and my stepfather were out in our back yard just talking and enjoying the weather.  We have alot of planes that fly around our house (DFW airport aint far so its common).I was looking up & I did see a plane but I also saw other lights.  So i tell my stepdad and we're both observing it.  It was moving slowly approximately 20-30 feet back from the plane but then it moved up fast, then went slow again, moved up fast again, then slow again, next thing we know it just vanished.",
      "link": "http://www.nuforc.org/webreports/081/S81134.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1ac",
      "summary": "Glowing red-orange balls in the sky Dallas July 4th 2012.",
      "city": "dallas",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Glowing red-orange balls in the sky Dallas July 4th 2012. On July 4th, 2012 my cousin and I and her son went to a parking lot near Fair Park to watch the fireworks.  Shortly before the fireworks began, I noticed to red-orange glowing lights in the distance.  I was about to brush them off as someone in the nearby neighborhood shooting off fireworks, until they continued to move closer to where we were standing.   Mesmerized by them, I continued to stare, but managed to get a couple of quick photos with my cell phone.  They appeared further away than they actually were in the photo.  It would have been easy to dismiss these as Chinese paper lanterns, had they not been SO bright and moving sideways and not at an upward incline at all and it was not windy.  I turned for two seconds to say something to my cousin, and when I looked back to where they were, they were completely gone. The two of us had both completely forgot about this within minutes, until the next day when her brother in-law came to pick up his children and mentioned he saw the same thing, too.  Only he was at least thirty minutes away in Garland. The objects we saw are what I am thoroughly convinced to be UFO's, especially after seeing DOZENS of descriptions from all over the country describing red-orange bright glowing balls moving across the sky the evening of the fourth.",
      "link": "http://www.nuforc.org/webreports/090/S90589.html",
      "state": "TX",
      "duration": "aprox 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1ab",
      "summary": "Red/orange glowing, hovering orbs on 4th of July pre-fireworks",
      "city": "dallas",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Red/orange glowing, hovering orbs on 4th of July pre-fireworks On the 4th of July, I went to see fireworks with my 19 yr old cousin and my 9 yr old son at Fair Park in Dallas. We parked in a church parking lot at the corner of Gurley Ave and Carroll. Many other people were parked here as well.  As we were waiting for the firework show to start, I noticed two glowing, red/orange, slow-moving orbs, or what I first thought were fireworks.  They resembled Chinese lanterns floating in the sky, IF they had been on fire.  I was thinking, \"Why aren't they racing upward to explode like they usually do?   Why are they so slow?\"  I asked my cousin, \"What ARE those!?\"  Then we noticed they weren't going up, they were moving sideways, and I thought it was weird that they seemed to be \"caught in the wind\" and moving away from where the fireworks would be.  They were moving slowly to the Northwest, at approximately 20-30 mph.  Everyone around us was staring at them, trying to figure out what they were.  They were reminiscent of ta! il lights on a car, but far apart from each other.  Also, they were hovering rather low, which is the other reason I discerned they weren't fireworks.  Low, slow moving, and non-exploding. We watched them for no more than 5 minutes altogether.  I got impatient waiting for the fireworks to start and forgot all about them.  That is, until the next day.  My brother in law arrived at my house to pick up his kids and he sat down and said, \"I SAW something last night.\"  The kids were around so he was hesitant to go into detail at first but I instantly knew what he was talking about.  I told him to tell me what he saw, and he described EXACTLY what my cousin, my son, and I saw, and he lives at LEAST 30 minutes away from where we saw them.  And it was about the exact same time.",
      "link": "http://www.nuforc.org/webreports/090/S90590.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd38b",
      "summary": "Two greenish-yellow lights connected by an undulating fog at a high speed and no sound.",
      "city": "dallas",
      "shape": "other",
      "date": "2012-09-24T00:00:00",
      "story": "Two greenish-yellow lights connected by an undulating fog at a high speed and no sound. I am prior service Military with an extensive back ground in all things related to fixed wing,rotary wing,rockets and balloons ( foreign and domestic). At 20:56 on 08/28/12 I witnessed an unusual craft traveling at a high rate of speed (compared to he local aircraft to and from DFW Airport) and at a higher altitude. The object was traveling in North to South direction with out any changes in flight path as I observed the object from horizon to horizon. Weather at the time was clear with a light breeze and an almost full Moon that did not effect the observation of the craft. As for the description of the craft the best I can say is a greenish-yellow light at the leading edge of the craft and same light at the tail connected by a luminescent fog that appeared to be undulating.",
      "link": "http://www.nuforc.org/webreports/092/S92272.html",
      "state": "TX",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd560",
      "summary": "Orangish-Red lights over Dallas, PA",
      "city": "dallas",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "Orangish-Red lights over Dallas, PA This is the second appearance of this object in the last few weeks. Appeared to be triangular with orangish-red lights. Two looked to be in line with one another, a third farther off to the right making an obtuse triangle. Was moving in a western direction with no sound. The third light to the right disappeared first, while the other two lights continued westward. Both of them then disappeared. Sky was very overcast with low cloud cover; only a handful of stars were visible directly above, no stars could be seen in the direction of the lights.",
      "link": "http://www.nuforc.org/webreports/092/S92376.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd8a4",
      "summary": "Ball of light seen above full moon while moon was blacked out and then appeared again.",
      "city": "dallas",
      "shape": "oval",
      "date": "2012-07-04T00:00:00",
      "story": "Ball of light seen above full moon while moon was blacked out and then appeared again. Looking toward the South from my balcony, the moon was in &quot;full&quot; phase.  It was a cloudy night and there were white clouds.  I observed something dark quickly passing from the top of the full moon to the bottom of the moon (like a curtain), completely blocking out the moon, then the darkening would go back up, and the moon would suddenly be visible again.  The full moon would be completely visible for only a few seconds, and the process of the darkening would repeat.  This happened several times for the 20 minutes I observed.  Also, there was a ball of white light (smaller than the moon, but larger than a star or planet) slightly above the moon.  Then all this stopped, the ball of light was gone, and the full moon was in full view.  I watched for another few minutes after that, and no more unusual events took place.",
      "link": "http://www.nuforc.org/webreports/089/S89888.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdce3",
      "summary": "3 BRIGHT VIBRANT ORANGE TRIANGULAR OR DIAMOND SHAPED CRAFT CAME IN LIKE JETS, BUT SILENTLY AND THEN HOVERED SLOWLY BEFORE DISSAPPEARING",
      "city": "dallas",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "3 BRIGHT VIBRANT ORANGE TRIANGULAR OR DIAMOND SHAPED CRAFT CAME IN LIKE JETS, BUT SILENTLY AND THEN HOVERED SLOWLY BEFORE DISSAPPEARING",
      "link": "http://www.nuforc.org/webreports/092/S92778.html",
      "state": "GA",
      "duration": "4 - 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd19",
      "summary": "The object was green and streaked across the night’s sky. I lost track of it when it went over and across The George Bush Turnpike.",
      "city": "dallas",
      "shape": "other",
      "date": "2012-10-30T00:00:00",
      "story": "The object was green and streaked across the night’s sky.  I lost track of it when it went over and across The George Bush Turnpike by my apartment complex.  The whole event for me took just like two seconds.  I have seen things enter our atmosphere before, but never green and as bright as this was. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93831.html",
      "state": "TX",
      "duration": "very brief"
    },
    {
      "_id": "64d005f478aba2ec5a3be376",
      "summary": "My father worked for NASA and he told me there are little people from outer space.  He said that we can communicate with them by focusi",
      "city": "dallas",
      "shape": "unknown",
      "date": "2012-04-18T00:00:00",
      "story": "My father worked for NASA and he told me there are little people from outer space.  He said that we can communicate with them by focusing on bright light with mist.  He said they are 3 1/2 feet tall.   All the new appliances will come from them.",
      "link": "http://www.nuforc.org/webreports/088/S88258.html",
      "state": "TX",
      "duration": "Not Long"
    },
    {
      "_id": "64d005f478aba2ec5a3be948",
      "summary": "5 red lights in the shape of a triangle",
      "city": "dallas",
      "shape": "triangle",
      "date": "2012-04-18T00:00:00",
      "story": "5 red lights in the shape of a triangle My girlfriend and I were driving down Abrams coming back from the grocery store when I noticed 3 crafts forming the shape of a triangle. I said to my girlfriend,  \"Those planes are flying in a weird formation\".   Upon closer inspection, each \"dot\" forming the shape shined red, as if they were rows of red lights next to each other.   At this time we realized it wasn't anything normal.  As the trees parted and the view cleared, a 4th and 5th \"dot was added to the triangle shapes in that leftmost and rightmost corners.  The the entire formation vanished completely.   The whole ordeal may have only been about 30 seconds long.  We don't know how long they had been there before we noticed them.   My girlfriend and I have always been interested in UFOs (me more than her, as she thinks it's cool, but pokes fun at me).  I have never seen UFO in the past, but have researched and seen \"live\" video accounts.   The shape reminded me of the lights that appeared over Arizona.  This was both! exciting and scary.  We haven't seen anything else in the sky.   I hope someone else can confirm seeing this as it was over a very populated area. (sorry, I sent on accident the 1st time, the actual date for this occurrence is 4/7/12)",
      "link": "http://www.nuforc.org/webreports/088/S88257.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be97b",
      "summary": "Red and white flashing lights with unusual movement",
      "city": "dallas",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Red and white flashing lights with unusual movement Red and white flashing lights with a trail heading NNE.  The lights appeared to be moving at a steady velocity for five seconds or so and then would dramatically slow down, seeming to reverse direction for a second. Then it would continue on the original course at the \"normal\" speed. This was seen to happen many times as it moved from the west of us to the distant NNE. It would have been easy to write this off as a high flying aircraft or possibly even a satellite if it weren't for the rapid changes in speed/direction.",
      "link": "http://www.nuforc.org/webreports/087/S87492.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bec06",
      "summary": "I found 2 small orange pods with alien like organisms , curdle up in the fetal position, growing inside then.",
      "city": "dallas",
      "shape": "egg",
      "date": "2013-08-30T00:00:00",
      "story": "I found 2 small orange pods with alien like organisms, curdle up in the fetal position, growing inside then My sons and I were looking around my fathers shed and came across a very interesting discovery up inside a one of the cyderblock.  It was indeed a crazy looking creature not from this world,  I did had never seen anything like it & I did take very many photo shoots of this thing and I still got then for you if you need them.   ((NUFORC Note:  We question whether this is a serious report, but we cannot be certain.  We have attempted to contact the source, to request copies of the photos, but have been unsuccessful in reaching the person.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100860.html",
      "state": "TX",
      "duration": "1 day"
    },
    {
      "_id": "64d005f478aba2ec5a3bef27",
      "summary": "White cigar shape with pointed ends",
      "city": "dallas",
      "shape": "oval",
      "date": "2013-05-15T00:00:00",
      "story": "White cigar shape with pointed ends Look up at police helicopter flyby and in back ground notice what I first thought was an airliner at high altitude heading SE.  Thought that was weird and then saw it had no wingspan or contrail.  Then it just faded away disappeared in a clear sky.   Seconds later it reappeared briefly for a few seconds and then disappeared again not to return. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96701.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2f4",
      "summary": "Bright round light in sky that moved left to right then up with colorful lights.  ((NUFORC Note:  Possile sighting of Sirius?  PD))",
      "city": "dallas",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "Bright round light in sky that moved left to right then up with colorful lights Dallas texas 12-22-2012 Marsalis ave & saner ave  saw bright round light in irving then on my way to dallas the light never moved but did get dimmer as I got closer to destination.  Object was seen by 2 other individuals including myself..  This would be the second time I have ever experienced this in my life.  I'm willing to take a lie detector test and drug test to prove this is not a hoax! ((NUFORC Note:  Possile sighting of Sirius?  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95412.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bf330",
      "summary": "Very large bright orange light that disapeared.",
      "city": "dallas",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Very large bright orange light that disapeared. While driving home from work my son and I were 1/2 mile from our home when we spotted a very bright orange light in the sky to the west of our location.   At first we thought the light was moving so we stopped in the road and watched for several min and determined it was stationary.   As we proceeded to our home we kept the light in our line of sight.  I could see the light as I was backing in my driveway.   In the very short period of time it took to exit the vehicle the light was no longer in our line of sight, my son and I ran to the clearing to the north of our home and the light was no where to be seen, we ran back to the house and returned in my vehicle to the location where we had first spotted the light and couldn't find any sign light.   We left this location and proceeded to another road which took us to the area where the light appeared to be when we first saw it and found nothing.  When we returned home we spent the next 30 min in the clearing looking for signs of the light.   With being in the country we have very clear views of sky which don't have city lights filtering into the sky.",
      "link": "http://www.nuforc.org/webreports/101/S101231.html",
      "state": "NC",
      "duration": "8-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf36d",
      "summary": "9-10 orange red orbs flying silently SW to NE around 8:30pm near downtown Dallas.",
      "city": "dallas",
      "shape": "",
      "date": "2013-09-30T00:00:00",
      "story": "9-10 orange red orbs flying silently SW to NE around 8:30pm near downtown Dallas. Wed Sept 18, 2013 8:30pm  9 or 10 orbs flew SW to NE just SE of downtown Dallas. There was a full moon.  They were orange at the bottom and red on top, silent and with no blinking lights.  They flew fast, one after the other, in some type of formation.  The time between them varied from 2 seci onds to 45 seconds.  Some were in pairs. I have lived in the flight path of an airport for 15 years so I know what a plane or helicopter looks like high or low and it wasn't that.  They appeared about 2000 ft high.  They had no tails so I knew they were not meteors though they had the look of fire.  The total duration of time was less than 10 minutes. I called 911 and a local news channel and no one else had made any report.",
      "link": "http://www.nuforc.org/webreports/102/S102419.html",
      "state": "TX",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf673",
      "summary": "DIAMOND SHAPED OBJECTS MANEUVERING IN DALLAS NIGHT SKIES.",
      "city": "dallas",
      "shape": "diamond",
      "date": "2013-10-14T00:00:00",
      "story": "DIAMOND SHAPED OBJECTS MANEUVERING IN DALLAS NIGHT SKIES. DALLAS, TX 10/4/13 @ 7:15PM..... I WAS OUTSIDE WITH THE NEIGHBORHOOD KIDS, SKY CONDITIONS WERE CLEAR BLUE SKIES WITH A VERY SMALL AMOUNT OF CLOUDS.  NOW WHAT I NOTICED IS A FEW CHEMTRAIL CLOUDS THEN WHAT CAUGHT MY EYES WAS A BRIGHT ORB LIKE MOVEMENT.  WHAT I THOUGHT TO BE A PLANE WITH A BRIGHT SUN REFLECTION TURNED OUT TO NOT BE.  AS I WATCHED IT DISPERSE A FEW TRAILS A SMALL BIT AT A TIME IN THE STRAIGHT DOWN DIRECTION.  THEN STARTED MOVING IN A STRAIGHT AWAY DIRECTION RIGHT BEFORE IT FADED AWAY FROM SIGHT.  RIGHT OUT OF THE FIRST BIT OF DISPERSMENT CAME OUT ANOTHER BRIGHTLY LIT ORB HEADED STRAIGHT DOWN.  THIS ONE DID NOT DISPERSE ANYTHING. THEN ONCE AGAIN RIGHT BEFORE I LOST VIEW OF IT BEHIND A TREE A THIRD STARTED MOVING UPWARD THEN CROSSING RIGHT OVER THE SKY.  AT THE SAME TIME AS THIS HAPPENING ...THE KIDS POINTED OUT AN ACTUAL PLANE LIKE OBJECT COMING SIDEWAYS CLEARLY DISPERSING CHEMS ALL THE WAY ACROSS.  NOW TO CLARIFY WHAT I WAS SEEING WASNT A EYE TRICK...O! THER ACTUAL AIRPLANES WERE STARTING TO CROSS THE AREAS. WHICH THE KIDS WERE ABLE TO CLEARLY SEE THE DIFFERENCE BETWEEN THE OBJECTS.  TO MAKE IT EVEN WEIRDER WE SAW ONE OBJECT THAT CLEARLY HAD NO WINGS BUT MANEUVERED JUST LIKE A PLANE COME ACROSS LAST.  NOW TO GET MORE EVIDENCE I TRIED RECORDING IT WITH MY CAMERA PHONE WHICH RECORDS IN HD 1080P BUT THE OBJECTS DID NOT APPEAR ON CAMERA BUT THE PLANES DID.  THIS ALL HAPPENED BETWEEN 7:15-7:21PM IN NORTH DALLAS.  I WOULD LOVE TO DISCUSS MORE IF U LIKE.",
      "link": "http://www.nuforc.org/webreports/102/S102999.html",
      "state": "TX",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9f7",
      "summary": "Observation point: eleventh flour of ND building UT Southwestern Medical Center. Distance less than one mile at the beginning of observ",
      "city": "dallas",
      "shape": "sphere",
      "date": "2013-06-02T00:00:00",
      "story": "Observation point: eleventh flour of ND building UT Southwestern Medical Center.  Distance less than one mile at the beginning of observation.  Altitude approximately 500 feet.   One object was observed.  Perfect sphere shape, size of average helicopter, still or silver shine.  No sound could be heard.   Moving between Dallas North Tollway and Inwood Road, slowly lowering altitude and making landing (disappearing) in tree covered area somewhere behind W Northwest Hwy.",
      "link": "http://www.nuforc.org/webreports/098/S98020.html",
      "state": "TX",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc99",
      "summary": "BOX SHAPED OR SQUARE SHAPE UFO OVER DOWNTOWN DALLAS",
      "city": "dallas",
      "shape": "other",
      "date": "2013-07-22T00:00:00",
      "story": "BOX SHAPED OR SQUARE SHAPE UFO OVER DOWNTOWN DALLAS 2 of us were sitting at dinner 24th floor overlooking Dallas, facing East toward DOWNTOWN and  saw a UFO fly overhead.  No sound, no wings shaped like a box. black color. travelling NW at about 100mph.  Anyone else see this???",
      "link": "http://www.nuforc.org/webreports/100/S100256.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bff6d",
      "summary": "Two Paulding County, GA, witnesses saw triangular craft hovering in the sky on 8/25/13.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2013-08-30T00:00:00",
      "story": "Two Paulding County, GA, witnesses saw triangular craft hovering in the sky on 8/25/13. While standing in driveway, husband and daughter saw large triangular craft with red lights at corners and white and green lights along all three edges.   Hovered, moving slowly.  Lower than an airplane or helicopter usually flies.   As it turned and veered out of view behind the trees, it became upright with all lights in view.   No noticeable sound coming from craft. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101662.html",
      "state": "GA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bffa8",
      "summary": "Single orange fireball.",
      "city": "dallas",
      "shape": "fireball",
      "date": "2013-07-14T00:00:00",
      "story": "single orange fireball 3 adults standing outside talking. Partially cloudy night.  Witness 1 saw orange Fireball moving toward NE sky in straight line and holding elevation of about 1,000 ft.   Pointed out to other two witnesses and both saw same object.  Object moving much too slow to be meteorite and too fast to be \"Chinese lantern.\"  Object disappeared in clouds.",
      "link": "http://www.nuforc.org/webreports/100/S100075.html",
      "state": "PA",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bffb1",
      "summary": "N Dallas Tollway NOON July 17, 2013.",
      "city": "dallas",
      "shape": "other",
      "date": "2013-07-22T00:00:00",
      "story": "N Dallas Tollway NOON July 17, 2013 Traveling North on the Dallas Tollway, at NOON on July 17th, I witnessed an object in the sky traveling SOUTH.  It wasn't moving real fast, in fact it appeared to be floating.  It was black in color and appeared like a BOX or suqare shape.  On the bottom of the vehicle, as it passed over, I noted multiple rings of color that were bright,   I did not get a picture but I noticed no one else seemed to be staring at it, although I was in moving traffic at about 70mph on the highway.",
      "link": "http://www.nuforc.org/webreports/100/S100257.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c025f",
      "summary": "It look triangle in shape off laprada and 635 in Dallas TX with puslating lights.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2013-07-14T00:00:00",
      "story": "It look triangle in shape off laprada and 635 in Dallas, TX, with puslating lights I was driving after dropping my child off in Dallas, TX, on laprada and 635 before getting to the 635 hwy something told me to look up and i seen the ship lights pulsating with different colors I seen red green then I turn my head down prayed that it would not get me looked back up it was still there moving slow no sound then I looked back up and it flew off in a instant or  disappeared  I will never tell any one  this again and hope they go away I am in the only reason I am reporting this because on coast to coast they said report it.",
      "link": "http://www.nuforc.org/webreports/100/S100154.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c03ba",
      "summary": "Fireball flying low and slow no sounds heard.",
      "city": "dallas",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "Fireball flying low and slow no sounds heard. Saw a fireball flying across the sky.   Lasted about 30 seconds before it went outta sight.  No sounds heard but was flying low and slow.",
      "link": "http://www.nuforc.org/webreports/098/S98313.html",
      "state": "GA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c066a",
      "summary": "Orange-Red Flying Object Vanishes In Mid-Air Over White Rock Lake Park, Dallas, Texas",
      "city": "dallas",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "Orange-Red Flying Object Vanishes In Mid-Air Over White Rock Lake Park, Dallas, Texas On February 2, 2012 at approximately 2030 hours over White Rock Lake Park, Dallas, Texas, there appeared in the dark, evening sky an unusual orange-red light, or composite light.  The temperature was 55 degrees.  There were no clouds over this area of Dallas, and the stars were clearly bright and visual in the background.  There was virtually no light pollution over White Rock Lake this evening and the lake was still and dark.  White Rock Lake Park was mostly deserted in this area, however there were several other people walking along edge of the lake.  Apparently they did not notice the object. I was driving with my wife and south on West Lawther Drive on the West side of White Rock Lake.  White Rock Lake is rimmed with large residential estates on the West side of the park, all facing East and overlooking the lake.  West Lawther Drive winds around the perimeter of White Rock Lake Park on the West side. The orange red light was moving from the East to the SouthEast across the 65 degree horizon and in the general flight path approach for Southwest Airlines into Love Field Airport to the West of White Rock Lake.  There were other airplanes in the approach for Love Field Airport in the general vicinity over White Rock Lake.  The orange-red moving light was noticeable and unusual because there were no strobe lights or white lights as are common with commercial or private aircraft.  The orange-red light appeared in the sky at a 65 degree angle from the road and the light source was the approximate size of the commercial aircraft in the area.  The orange-red light was not moving rapidly, or erratically, but rather deliberately on a particular path and at a speed in common with the other aircraft in the vicinity. The orange-red flying object was not a star, planet or meteor. After viewing this object move through the sky and over White Rock Lake for approximately twenty seconds, the object faded and vanished in mid-air over the lake.  Upon closer observation, the orange-red light appeared to have a composite light source of multiple lights. Given that this area of Dallas is restricted airspace and in the approach path for Love Field Airport, it was highly unusual for any flying craft to have no strobe, and to have turned off its lights and or disappeared. The disappearance of the orange-red flying craft was not immediate, and it appeared to have diminished in size before vanishing, leaving one with the impression that the source of the light gained altitude at an unusually rapid speed and not on a trajectory common with traditional airplanes.  This process took less than several seconds. The sky was scanned for several minutes in an effort to locate the object, however this was unsuccessful. I am a graduate of the University of Virginia and Southern Methodist University and have experience piloting private aircraft.  I am familiar with the appearance of aircraft making an approach to Love Field Airport in this vicinity, and of the identifying lights required of aircraft, and can attest that this object was not a commercial, private or conventional military aircraft.  Furthermore, I have observed meteors, comets and other natural celestial phenomena and this object was neither. ((ADDENDUM FROM WITNESS)) Thank you for the reply.  This was a very strange experience.  I intend to contact a few Southwest Airline pilots to ask around if any of their colleagues saw the same on their approach tonight. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/096/S96179.html",
      "state": "TX",
      "duration": "20-25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0726",
      "summary": "5 Reddish Amber Lights Moving Multiple Directions Then Disappear.",
      "city": "dallas",
      "shape": "sphere",
      "date": "2014-01-10T00:00:00",
      "story": "5 Reddish Amber Lights Moving Multiple Directions Then Disappear. We were all sitting in the back yard when there was a very bright reddish amber colored light that immediately drew our attention just over the tree line.  This even was at about 11:57pm and we watched it just until the ball dropped.  We all went inside to watch the ball drop and celebrate.   We then grabbed the small firecrackers we bought for the kids to see and went out front to the roadway to set them off.  At this point the light was gone.  We were all very confused as to what it was being that it moved in multiple directions then hovered just before we went inside.  After lighting the firecrackers and rounding up the kids to go back inside we saw the light appear much further off in the distance in the complete opposite direction.  Myself and one of the other adults stopped and watched it as it moved east, then north, then hover and disappear again.  About 20 seconds later it reappeared much further away, much too fast for any craft I as a civilian know of.  It then hovered once again for about 20 seconds, flew north west, hovered again for about 10 seconds, then continued northwest.  Slightly after it hovered the last time, another appeared and began to fly towards the original.  As the second sighting got closer to the first, the first completely vanished.  The second hovered and sure enough a third began its ascent towards the second.  The second flew to about where the first vanished and hovered as the third started to move closer.  At this time a fourth came into sight flying towards them both.  The second sighting vanished and a fifth and final appeared and performed a very similar routine until all 5 vanished at roughly the same location in the sky.  We watched for a good 20 minutes afterwards to see if perhaps they would return, they never did.  All 5 sightings were very bright, reddish amber colored, moved in random speeds and direction, made no sound whatsoever, and all vanished at about the same location in the sky. Does anyone else have a good explanation for this?  Why are there so many sightings of these red lights in the sky in the past year?  I have never ever heard about these lights or this site for that matter until tonight's experience.",
      "link": "http://www.nuforc.org/webreports/105/S105794.html",
      "state": "GA",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c09b0",
      "summary": "Shiny circular object in sky, no lights, Extremely shiny. Disappeared a few seconds after I saw it.",
      "city": "dallas",
      "shape": "circle",
      "date": "2013-11-11T00:00:00",
      "story": "Shiny circular object in sky, no lights, Extremely shiny. Disappeared a few seconds after I saw it. Was driving on the tollway heading south.  Clear blue skies. Looked up towards my left, saw a very shiny circular object in the sky.  Knew it was not a plane.  There were no lights on it or wings.  An extremely shiny silver color, almost reflective. I said out loud, \"what is that?\"  Within a few seconds it disappeared.",
      "link": "http://www.nuforc.org/webreports/103/S103526.html",
      "state": "TX",
      "duration": "A few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0aa7",
      "summary": "Star like object that emits light at different levels of brightness and duration.",
      "city": "dallas",
      "shape": "light",
      "date": "2013-12-02T00:00:00",
      "story": "Star like object that emits light at different levels of brightness and duration. Hello I stumbled across your website through google.  I wanted to report a strange “star” that for the past 2 months has been appearing in the night sky of Dallas. Its Coordinates is 215 DEGREES southwest of the southeast Dallas sky.  It is easily seen as it is commonly brighter than the North star. This strange light sometimes becomes dim like most stars, but for the most part it is unusually brighter than most of them. It just recently appeared as I said above about 2 months ago. It is sometimes seen higher in the sky or lower by a few degrees even after the upward or downward shift it sits stationary, and certain nights its always near the same area of coordinates given above.  It is currently 11/29/2013 19:52hrs and it disappeared but the times it does vanish varies, it normally appears everyday around 17:30-19:30hrs approximately. I don’t know what it could be, I assumed at first that it was one of our planets, as was reported that during this year we would see Venus, but later dismissed that assumption after finding out Venus would only be visible for a few nights. This “star” as I call it, it sometimes glows an orange tint kind of like Mars would when looking at it with the naked eye.  When looking at this “star” with the naked eye in its brightest stage it begins to look as if it glows a little. I'm sure this might just be due to the human eye and how it works, but I have a feeling it is something else.  I do believe it is a UFO as I cannot identify it, but I also do not have a telescope to see this marvelous site. This is all the info I can give if you have any further information on this incredible \"star\"  please contact me at ((e-address deleted)).com  Thank you, and have a good night! ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104929.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c0f12",
      "summary": "Triangle UFO in Dallas.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2014-02-21T00:00:00",
      "story": "Triangle UFO in Dallas I was sitting in my backyard when I noticed in the distance a bright yellowish light rising up. I watched it for a minute because I was trying to figure out what it was.  Then it started to come straight towards my house relatively fast.  I ran in my house to get my husband then we continued to run out the front door just in time to see this triangular aircraft moving over our house.  It had three yellow lights, one on each corner of the triangle, and one red one in the middle.   We watch it for another minute curve around towards downtown, which is north of us, before we lost sight of it.   To be honest I am not sure what we saw tonight, but it was like nothing I ever saw before.",
      "link": "http://www.nuforc.org/webreports/107/S107216.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c10bc",
      "summary": "Star like object that emmits light at different levels of brightness and duration. ((NUFORC Note:  Probably Venus.  PD))",
      "city": "dallas",
      "shape": "light",
      "date": "2013-12-12T00:00:00",
      "story": "Star like object that emits light at different levels of brightness and duration. Hello I stumbled across your website through google.  I wanted to report a strange “star” that for the past 2 months has been appearing in the night sky of Dallas. Its Coordinates is 215 DEGREES southwest of the southeast Dallas sky.  It is easily seen as it is commonly brighter than the North star. This strange light sometimes becomes dim like most stars, but for the most part it is unusually brighter than most of them.  It just recently appeared as I said above about 2 months ago. It is sometimes seen higher in the sky or lower by a few degrees even after the upward or downward shift it sits stationary, and certain nights its always near the same area of coordinates given above.  It is currently 11/29/2013 19:52 hrs and it disappeared but the times it does vanish varies, it normally appears everyday around 17:30-19:30hrs approximately. I don’t know what it could be, I assumed at first that it was one of our planets, as was reported that during this year we would see Venus, but later dismissed that assumption after finding out Venus would only be visible for a few nights. This “star” as I call it, sometimes glows an orange tint and when it does it is usually farther away, and every now and again can be spotted further to the southeastern part of the sky. It would look like Mars would when looking at it with the naked eye. When looking at this “star” with the naked eye in its brightest stage it begins to look as if it glows a little with a faint misty aura around it. I'm sure this might just be due to the human eye and how it works, but I have a feeling it is something else. I do believe it is a UFO as I cannot identify it, but I also do not have a telescope to see this marvelous site. This is all the info I can give if you have any further information on this incredible \"star\" please contact me at ((e-address deleted)) Thank you, and have a good night! ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104932.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c125a",
      "summary": "Beautiful lighted egg shape floated over my head!",
      "city": "dallas",
      "shape": "oval",
      "date": "2014-01-16T00:00:00",
      "story": "Beautiful lighted egg shape floated over my head! Went outside to feed dog leftovers, was walking back inside. Looked up and saw these beautifull lights.  First they were whiteish mav color that were going around,1 2 3 4, 1 2 3 4, then at the same time bulegreen lights were make the  same pattern.  1 2 3 4, 1 2 3 4.  There was a third color looked like it was in the center and it was solid.  Then they started a reverse pattern. It was headed from east to west. From atlanta to Alabama direction. It was or looked like it was around maybe 1000ft to 1500 ft high, and it was moving really slow. There was no sound it just kind of floated  right over my head, and it was, looked like it was spinning very slowly.  It was oval or like an elongated egg.  One end was fat the other was noticeably smaller.  I had a flashlight and flashed at it but it just keep move and went over the top of the trees.  I dont know what it was but it was very pretty.  It was very cool to see.",
      "link": "http://www.nuforc.org/webreports/106/S106248.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1670",
      "summary": "Orb of light in far North Dallas.  ((NUFORC Note:  2 hours.  We suspect an advertising light.  PD))",
      "city": "dallas",
      "shape": "circle",
      "date": "2013-10-23T00:00:00",
      "story": "Orb of light in far North Dallas My roommate and I observed this  thing while on our nightly walk.  In a park in far north Dallas, we saw it and noticed it was moving in a tight circle that got larger and smaller.  We compared it to a stationary object to confirm that it was moving.  It made no sound.   And we could tell out was behind the clouds because it moved behind them, ruling out a search light.   Also the movement seemed interrupted twice as it seemed to shoot out a thin line of light, and again it separated in two and went back together.  It circled for two hours.",
      "link": "http://www.nuforc.org/webreports/103/S103349.html",
      "state": "TX",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c177b",
      "summary": "Object was flying low over runway's at DFW Airport.",
      "city": "dallas",
      "shape": "other",
      "date": "2014-06-04T00:00:00",
      "story": "Object was flying low over runway's at DFW Airport. Object was silver and was about the size of a 727 jet.  Reminded me of the machines in the Transformer movie, looked like a man with a jet pack on with a light on top (only way I can describe it) the object seemed to change shape as it turned.   The object travelled from west to east over the runways at 300 ft then took a 75 degree angle and went into the clouds.   Air traffic was delayed until the object was out of site, so there should be some record.   Also looked on internet and found Shape Shifting UFO over Belgium video, this is what I saw, 500 ft from object when first observed.   Also object made no sound.  HVAC Tech and Electrician.",
      "link": "http://www.nuforc.org/webreports/109/S109338.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e31",
      "summary": "Stationary blue green light on the clouds above downtown Dallas.",
      "city": "dallas",
      "shape": "light",
      "date": "2014-06-24T00:00:00",
      "story": "Stationary blue green light on the clouds above downtown Dallas. Spherical bluish green light .Stationary position.  On the clouds but no observation of a spotlight or laser ray.  Seems to be coming from above.",
      "link": "http://www.nuforc.org/webreports/110/S110477.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c26ec",
      "summary": "Orange flickering light moving through sky, then the light went out; could see silver object moving away @ high speed.  No noise.",
      "city": "dallas",
      "shape": "fireball",
      "date": "2014-12-05T00:00:00",
      "story": "Orange flickering light moving through sky then the light went out, could see silver object moving away @ high speed.  No noise. My husband and I saw an orange light moving fast and in different directions.  The light was flickering.  There was no noise associated with this light, just complete silence.  It then came a little closer to us and the light started to flicker more and then it started to fade until you could only see a little silver thing moving away very quickly.  We see lots of planes outside at night and this was not a plane or a helicopter.",
      "link": "http://www.nuforc.org/webreports/115/S115654.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c27ff",
      "summary": "A single, rectangle shaped object with red lights and alternating blinking white lights, like hazard lights flew over Dallas, Texas.",
      "city": "dallas",
      "shape": "rectangle",
      "date": "2014-11-21T00:00:00",
      "story": "A single, rectangle shaped object with red lights and alternating blinking white lights, like hazard lights flew over Dallas, Texas. On this night of November 14th, facing a little southeast, at approx. 7:31 pm, while driving with a sibling, we saw an unidentified flying object.  It was rectangle in shape and was black.  It had 5 lights on the front resembling that of high beams, but were blinking like hazard lights but in an alternating fashion.  There were 2 red lights on the outside and 3 white lights in the middle.  The white lights were the main lights blinking, almost like search lights.   The object flew in an upright position so that when it flew over me I could see its underside which was rectangle shaped as well.   The more extraordinary part about this sighting is that I could also hear the object.  It made a light whooshing sound that was softer than that of a plane and kept the same tone.  It was a calming sound like that of ocean waves and I live nowhere near a large body of water capable of producing such a sound.   It also was lower than any plane I've ever seen before.  The object came rig! ht out of the clouds in front of me as I was driving on a residential road near my home.   Seeing the object prompted me to pull over and get out of my car to witness this immaculate event.   The object literally flew right over me allowing to give such specific details.   After this experience was over I got back in my car and pulled off.  As I got on a nearby highway I was able to see the object once again as it faded off into the clouds once more and was at a higher position in the sky than before when it was right over me.   This was one of the most shocking events I've seen.  To actually experience what I've only heard people speculate about and document encounters about is beyond any word I could use to describe.   Truly freaky and bewildering.  I hardly know what to think.",
      "link": "http://www.nuforc.org/webreports/115/S115359.html",
      "state": "TX",
      "duration": "45-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c299c",
      "summary": "((HOAX??)) Dallas UFO near airport.",
      "city": "dallas",
      "shape": "other",
      "date": "2014-09-25T00:00:00",
      "story": "Dallas UFO near airport. I was at work unloading a truck and heard a \"wooosh\" sound.  I looked up and saw a transparent unusual shaped craft about 400 feet above me moving north perpendicular across normal flying lanes for landing planes at the love field airport.  I hear planes all day long at work, but have never heard one that sounds like that.  It was all over in a few seconds and it was gone.  Leaving me speechless and wanting to see more.  I wonder if anyone else has seen what I have? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113710.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b0c",
      "summary": "Large glowing orb that looks like a star from a distance but hovers 300 feet or so above tree line.",
      "city": "dallas",
      "shape": "circle",
      "date": "2014-12-05T00:00:00",
      "story": "Large glowing orb that looks like a star from a distance but hovers 300 feet or so above tree line. On our way driving to Dallas on Kings Valley Highway before the S-curves a mile before entering town, my buddy and I noticed a glowing orb 300 ft or so above the tree line.   When I first glanced at it I thought it was a star until I realized it was too big and too low to be one.  My next thought was a radio tower but the light was glowing yellowish gold and not red and there is no radio tower on top of that hill.   As my friend and I drove closer, the light went from 300 feet to to 75 feet or so above the ground in less than a second.  That's when we realized this was no ordinary object.   The light then instantly went to the ground and stopped moving.  The light moved too fast to be a helicopter and was too big to be a firework or flare.  After 4 or five seconds, the light moved to the left of the hilltop then shut off.   My friend and I drove home later that night and the light was no where to be seen.   During daylight you can see everything on that hill top where we spotted the light, and there is no tower or object that emits that color of light or moves that fast.",
      "link": "http://www.nuforc.org/webreports/115/S115832.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c310f",
      "summary": "Husband an daughter saw and video taped triangular craft.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2014-08-08T00:00:00",
      "story": "2nd reporting from same residence within 1 yr. Husband an daughter saw and video taped triangular craft.  Had two white lights and a center redight that appeared to loop over the craft.   None or little sound until it began to disappear behind the trees.",
      "link": "http://www.nuforc.org/webreports/112/S112217.html",
      "state": "GA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3389",
      "summary": "1200-mph dart silhouette seen for 6-seconds.",
      "city": "dallas",
      "shape": "triangle",
      "date": "2015-01-07T00:00:00",
      "story": "1200-mph dart silhouette seen for 6-seconds. My first ever UFO sighting occurred from Sylvania Drive, near its intersection with Sinclair Avenue, at about 8:00 pm on December 11, 2013, during a walk.  The night was cold, the sky was clear and there was a day-past first quarter, or fat half-crescent moon.   I saw the object through an opening between some trees across Dixon Branch Greenbelt Park.  The sighting was a brief glimpse of a far-off, dark, silent, dart-shaped silhouette against the clear luminous night sky.  Because the object appeared to be so sharp, I assume that I was looking at an edge-on view of a triangle, but cannot prove this.   Initially, I thought that the shadow was a swept-wing fighter accelerating upward in my direction at a supersonic speed.  It was climbing toward me from the southwest – note that ALL of my view of this first UFO was along a straight line approaching from the southwest of me.  The craft apparently moved twice the speed of a commercial jet and traveled about two miles in six seconds, both estimates, when put together, gave its speed at about 1,200-mph.   There were commercial jetliners visible to the far north and south, providing a direct comparison.  The silhouette appeared to be generally airplane-sized at 2 to 4-miles distance, but was silent despite the velocity – a jet interceptor would have been on afterburner and audible at that speed and range. The UFO first caught my attention when it was about 35-degrees elevation and it disappeared at about 50-degrees elevation.  The first quarter or half-crescent moon was at about 60-degrees elevation, also to the southwest.  I roughly estimate that the silhouette first appeared to me about 4-miles away, possibly over the Deep Ellum area, and it disappeared when 2-miles closer, approaching White Rock Lake.  It climbed from 2-miles altitude at Deep Ellum to 3-miles altitude at White Rock Lake.  If the climb and direction were backtracked, its original ‘takeoff’ may have been the Cockrell Hill areas, which are 8-miles to the southwest.  Although it was getting closer to me, I lost it in the half moon’s glare and could not pick it up on the other side, which would have been almost directly overhead.   The thing seemed phantom-like and eerie, and I was surprised to see it.  The object appeared to be going on a straight course from a lower altitude to a higher destination and I recall chuckling to myself that, “It must be carrying some cargo.”   I did not think much about this first sighting because it was so distant, vague and impersonal, and did not make a report or discuss it with anyone.  However, I did begin accessing some websites and buying various books about UFOs, for the first time in my 73-years.  In addition, I began scanning the night sky, looking for a repeat performance. ((NUFORC Note:  One of two high-quality reports from the same witness, who also included graphics.  The other report is for a sighting near Dallas on June 13, 2014, at 11:00 p.m..  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116499.html",
      "state": "TX",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c338e",
      "summary": "Lighted craft hovered for 3-minutes, then dove 1-mile in 5-seconds",
      "city": "dallas",
      "shape": "triangle",
      "date": "2015-01-07T00:00:00",
      "story": "Lighted craft hovered for 3-minutes, then dove 1-mile in 5-seconds This is the second of two consecutive reports about my sightings of December 11, 2013 and June 13, 2014, at age 73 and 74, respectively.  I observed my first and only two UFOs ever.   Both of these sightings occurred within a 6-month period from the same general location.  Since these objects appeared to be about the same size and shape, I have the impression that both sightings might have been of the same craft; however, I have no other proof of this assumption.  These are given in chronological order, and the first sighting in 2013 was vague, distant and impersonal – I did not file a report on it then, nor even mention it to anyone, including my wife.  By contrast, the second encounter in 2014 was a life-changing event – it was shocking to be shown that we humans are not the only intelligent beings here. My second, very much unexpected and extremely more vivid sighting occurred six months later at 11:00 pm on Friday night, June 13, 2014, near Hexter Elementary School.  I had walked to Gold’s Gym at Northcliff & Buckner at 9:30 pm and had left at 10:50 pm.  It was a beautiful night, comfortably warm, the sky was clear with a full moon and no wind, and there was not the usual city noise.  Nobody else was seen outside and there was no automobile traffic in the neighborhood.  I was walking alone in the middle of the street in the full moonlight. As I was traveling roundabout back to my house, a lighted craft suddenly appeared high over me at Northlake near Peavy.  I was rounding a curve heading generally northward and the lights cleared above the 30-foot trees to my right, or east side.  This occurred within the usual flight path of airplanes originating from south Texas and landing at Love Field; however, at this time most scheduled Southwest Airline flights had finished for the night – which seemed to be a very important factor in the presence of this thing.   Before 10:00 pm, mostly 737s and some corporate jets fly over here at about 8,000-feet or 1.5-mile altitude, heading north to cross I-635 where they will make a left, west to south U-turn and land at Love Field.  Now, there were not any planes in the sky anywhere.  Subconsciously, I assumed the lights were an airplane, but the object actually stopped directly above me as I was walking alone in the middle of the street.   I instantly looked up and felt that it had be! en watching me on the roadway in the full moonlight – I was the only rabbit alone on the road.  The craft appeared to be positioned almost 1-mile straight up – maybe 1 or 2-degrees eastward – with the apparent size of a large corporate jet; it seemed to be slightly smaller than a 737.  Although it is difficult to estimate size and height at night, I am reasonably sure that it was not over 1-mile, nor under 1/2-mile. (I have since studied airplanes flying directly overhead to confirm this perceived altitude and size.) -See illustration of UFO provided - It had extremely bright lights of pure colors, the brightest I have ever seen and the most beautiful red and green. There was no softness to the lights, only a sharp piercing glare.   The object had a strange jerky aspect unlike any aircraft.  No Federal Aviation Administration navigation lights were apparent – specifically, green on the starboard, red on the port, flashing strobes on the wingtips, with fore and aft white lights as required below 10,000 feet altitude.  Its lights were arranged in a nonsensical pattern as in my diagram above, with the red lights blinking on and off every 2-seconds – this appeared to be the front, as the craft moved.  All of the red lights pulsed together; there was no 1-2-3 sequence.  The green lights shined steady, did not blink and appeared to be the sides.   Each red and green row was composed of about 10 individual pinpoint lights, all like bulbs with equal intensity. No other lights, colors or emanations could be seen.  My sketch diagrams the bel! ly of the craft as seen from below.  The body was not visible as a silhouette against the sky because of the bright lights; however, I am certain that there was a rigid structure because the lights maintained their relative position at all times.  If I were to guess, I would say the object was rather triangular because of the arrangement of the lights, but I cannot be sure of this.  It had a clear-cut, garish carnival midway appearance – there was no vagueness at all.  My initial and vivid impression was as if a Texas State Fairground contraption, such as a Ferris wheel, with its colorful, blinking lights, had been placed 1-mile overhead in the night sky to float around –  it was totally out of place and illogical.  I instantly realized that this was not an airplane, so I quickly stepped under a front yard tree to my right or east side on Northlake, to hide from its view.  My actions were largely reflexive and fear-responsive, so I probably was only visible to the craft for a few! seconds. Immediately after I hid, the object seemed to have lost me, because it began to go back and forth, do figure-8s, hover and rock as I watched from between the leaves. Imagine that you are standing on the bottom of a lake watching the bottom of a big motorboat circling above you on the surface; similarly, seen by me from below, the circling craft acted as though it was floating on a flat horizontal surface.  The effect was like looking up at the bottom of a large launch that was being driven around on a choppy lake surface; perhaps the medium or force upon which the craft rode – or it created – was wavy.  The craft stayed contained within an imaginary circle of about 1/4-mile diameter eastward of me as it apparently searched; it never strayed to the west side of me.  Of course, its actions were faster than a motorboat as it maneuvered around searching the bottom below.  When it stopped, it seemed to rock like a boat, as though floating on waves.  The craft appeared to be driven or controlled by a coxswain who was methodically searching the bottom below, making its movements selective, erratic and chaotic as it went back and forth, repeatedly, stopping and going. The object emitted a very faint but perceptible whirring sound from high up, similar to an electric motor brush.  This sound had that same distant overhead audio quality as some hot air balloons, ultra-lights and blimps that I have heard from the ground while they were high above me; I have heard voices, burners and motors from these.  With this UFO, I had both eyed and eared confirmation of an actual materially structured mechanical craft and of its apparent vertical distance above.  Furthermore, the tone or pitch of the electrical motor sound seemed to change throughout its movements overhead, as though accommodating various mechanical requirements. Throughout all of this, I was busily playing devil’s advocate – “Could this be an electrically powered human-fabricated aircraft?”  Suddenly, I realized that if whatever was controlling this thing had infrared vision that I had better get behind the wooden tree limbs, which I promptly did.  For whatever reason, the object appeared to be searching for ground-based subject matter, so I remained cowing against the tree trunk and became a certified tree-hugger.  To add to my problems, the front yard’s motion detector light turned on. This weirdness went on for the longest three minutes, my anxiety level was rising and I began to wonder how it would all play out.  Suddenly, without any warning, the object instantly streaked nose-first at a downward angle, around 45-degrees, east-northeast toward the Lochwood Park area. It went from hovering almost directly overhead, down to the horizon, traveling over a 1-mile distance, at one constant and terrific speed. There was no observable acceleration against inertia or deceleration against momentum. I have watched high-performance jets stall out several miles above and then rev up to flight speed – this takes several seconds. My UFO did this instantly! When its lights disappeared through the trees and just above the horizon, it was still travelling at the same speed without slowing down. Its observed lack of inertia and momentum implied that the object had no mass, as though it were only a mirage or light image, and it actually looked somewhat that way during the d! ive. Although I could only see the lights, the craft appeared to be intermittent between a real object such as a bus or airplane, and an artificial movie-projected image of such. That is, at times, it would have passed for a solid material night-flying helicopter; while at other times, the lights seemed transparent and unreal, like projections on a movie screen. The greatest division in this dichotomy appeared between the very separate hovering and diving phases. During the overhead circling, I felt as though I could rap my knuckles on the craft; conversely, during the dive, I felt as though my arm might go through it. This division was reinforced by the whirring mechanical sound of the craft as it hovered, contrasted by the total silence when it dived at supersonic speed. Lending to this impression, a solid form would have created friction, pushed the air aside and made a horrific noise; this thing made no sound whatsoever. There was no noise at all during the dive – any air-dis! placement whoosh, sonic boom, crash or explosion – anything! Artillery shells make a distinctive sound as they pass through the air, and this speeding UFO should have done likewise. Incredibly, there appeared to be no resistance from the air. I felt that if I had shot this thing with a rifle, the bullet would have gone through it. Because of the lack of both inertia and air resistance, I must assume that there was no solid object – AS WE KNOW IT – during the dive phase. This raises my question of whether the UFO was somehow outside of our physical reality, a consideration that might apply to the origin of these things. I assume that a craft from another solar planet or star system would obey the same Newtonian physical laws that we do – but this thing did not do this. - See diagram of flight path provided - Visualize a right triangle with me on the ground at the 90-degree angle, and the craft 1-mile above me, searching within a 1/4-mile diameter circle to the east.  The full Moon is southeast, at about 50-degrees elevation at 11:00-pm CDT, at its lowest zenith in June – exactly opposite the Sun. The UFO dove toward the east-northeast at about a 45-degree angle. I have fine-tuned the compass direction with several visits; however, because it dived away from me, the exact descent angle cannot be exact.  Therefore, I have bracketed or averaged it as 45-degrees, and the ‘landing point’ would be approximately 1-mile away horizontally at the other 45-degree angle.  On the map, that would be around the Lochwood Park area.  Draw a line from Northlake-Peavy east-northeast across Lochwood Park and somewhere along this track is where the UFO ‘landed.’  By geometry, the flight path or hypotenuse would be about 1 1/4-mile long – or a little over 1-mile when discounting the 10-degree roofline.  The object’s closest proximity to me would be about 7/10-mile as it slid down the hypotenuse.  I watched its lights through the trees until the craft was about to slam into the ground about 1/10-mile above the actual horizon.  Seeing the UFO dive to the horizon greatly helped me to scale and confirm my original vertical estimate as about 1-mile altitude, and no lower than 1/2-mile. I have used three methods to determine and confirm the exit speed as about Mach-1.  First, my daughter and I have attended the Fort Worth Alliance air show annually for over twenty years – a father-daughter thing.  There are always jet interceptor fly-bys, usually by an F-18 Super Hornet, at Mach-1, whereby the sound shock wave is visible forming off the fuselage.  The June 13 UFO simply appeared to be diving that fast and that is what I settled on. Second, it took no more than 5-seconds for the craft to go from 1-mile overhead, then 45-degrees downward to the horizon, a dive distance of over 1-mile.  Here, I estimated the dive time, based upon my gut feel of 5-seconds.  Third, at home I pointed my finger at an imaginary UFO and had my daughter time my downward sweep with a watch, always getting about 5-seconds.  In summary, 1-mile multiplied times 5-seconds works out to 720-mph, or about Mach-1. At the short end of the spectrum, time is easy to estimate. Two, five and ten-seconds can be accurately guessed.  As time gets longer, estimating becomes more inaccurate – one minute is more difficult and an hour is even more so.  Five-seconds were easy to guess and to confirm by dragging my hand downward and having someone else clocks me.  My object had lights that pulsed every two seconds and it dove within about five seconds – these times were simple to bracket and measure.  I estimated that the craft hovered above me for 3-minutes because it seemed like 3-minutes, even when considering the lengthened anxiety factor.  In addition, I bracketed the hovering phase – it was certainly longer than 1-minute and probably shorter than 5-minutes – thus, 3-minutes.  My calculations of distance, time and speed all conform to one another mathematically – its red lights blinked every two seconds, the object hovered about 1-mile above for 3-minutes and exited at a 45-degree downward angle, di! ving within about 5-seconds at a speed of around 720-mph. As the craft streaked downward toward the horizon, its lights were visible through the nearby trees, but of course, the lights were blocked when they went behind the roofline.  The angle of total disappearance was about 5 or 10-degrees above the actual horizon, which would have been about 1/10-mile above the ground at the ‘point of impact.’  Seeing the object go through the far tree line greatly reinforced my vertical estimate as 1-mile distance.  The UFO’s path of descent formed an imaginary ‘hypotenuse of a right triangle,’ which is depicted in the third diagram.  At the horizontal, its size and distance could be compared to foreground features – much as a rising full moon can be compared to nearby hills, trees, houses and so forth – this confirmed my estimation of the overall scale of the UFO flight path. The contrast between the 3-minute hovering and the 5-second dive was astounding, and suggested that there were two methods of control during these two phases – manual and autopilot.  This dichotomy erased all doubt as to whether or not this was a human construction.  The circling and wobbling object appeared to be silly, jerky, and almost Warner Brothers cartoonish with the super bright garish lights – the reds pulsing on and off, and the greens glowing steadily.  The searching was asymmetrical, irregular and chaotic – as though a coxswain was steering the boat randomly and impulsively as he searched the ground far below.  If I had witnessed only the hovering phase, I would not be convinced that it was not some type of human-made aircraft. By contrast, had I seen only the 5-second dive, I would not be convinced that it was not some reentering satellite debris.  This exit plunge was straight, steady, mechanical, meteor-like and almost blurred.  Unlike in its erratic circling phase, the fast diving craft did not appear to be arbitrarily piloted, but went down uniformly at a constant speed in a straight line from A to B as though programmed and automatic.  It appeared as if a switch was flipped, which said, “Take me from here to there.”  Certainly, no human pilot would have had nerve reflexes fast enough to control this suicide dash downward and I assume the same for any biological organism.  As it dove, the form or basic structure of the object was perfectly retained – the blinking red bar of lights in front and the two steady green rows of lights on the sides. However, more so than when it was circling, the craft looked strangely like an artificial light image as it dashed downward, with the pulsing red lights at th! e front. Possibly, the angle of the lights were turned away from me somewhat, making them appear dimmer, thus contributing to the dichotomy of appearance. The object went down angled into the dive and all of its light structure was retained intact, as though it being a rigid object. However, both of these phases, when put together said that this was not grandma’s biscuits. I looked straight at this thing for 3-minutes as it hovered, and for 5-seconds as it dove – it definitely was NOT a human-made aircraft! A saying goes that we should always look for ponies before we look for unicorns. In the best tradition of looking for ponies, immediately following the sighting I attempted to eliminate all plausible possibilities. I considered a DRONE as an explanation, and several other folks, including my wife, have since offered the drone scenario (which seems to be the contemporary Debunker explanation for all UFOs today). This would certainly fit the hovering and whirring electric motor sound, since several drone models are electric powered hovering devices. Immediately after this event, I asked myself, “Did someone launch and retrieve a drone from the Lochwood Mall parking lot?” However, I quickly dismissed my devil’s advocacy here because this explanation would have been more unrealistic than a ‘flying saucer.’ The large size, mile altitude, glaring lights and exit speed ruled against a drone. Hobbyist’s electric RC craft are small, weak and slow, and they fly at very low altitudes. ! Military drones are larger and more powerful, but still rather slow. These are secretive, conserve power to remain on patrol for long periods, and they do not waste batteries on bright lighting; the CIA is not going to advertise its presence with glaring, blinking lights. All of this goes against the large corporate jet-size of my UFO, which was hovering 1-mile up with lights blazing while milling back and forth. Consider the Mach-1 exit speed. No drone, civilian or military, is streamlined or powerful; indeed, such a design would be antithetical to the hovering purpose of a drone. All drones have propellers or rotors. No propeller driven airplane has ever achieved Mach speed and survived – ever!  This formidable velocity requires an aerodynamic, reinforced coke bottle-shaped fuselage, sweptback razor thin wings, and a turbojet engine with a powerful afterburner.  Even the fabled F-86 Saber Jet and MiG 15 of Korean War vintage could not reach the speed of sound.  Moreover, no human-constructed aircraft – prop or jet – would have pulled out of such a steep dive at that speed. Finally, yet importantly, all aircraft, civilian and military, CIA or FBI, drone or whatever, flying high in United States commercial airspace are required by law to conform to FAA lighting standards.  This is to prevent mid-air collisions with other planes.  As ruled by the National Transportation Safety Board, an ‘aircraft’ is any device used for flight in the air – there are no exceptions!  My observed object was violating a main landing flight path over northeast Dallas, which would have been filled with vulnerable commercial Love Field traffic an hour earlier.  It was shining and blinking bright garish lights that were arranged in the bizarre pattern illustrated above, that made no sense and which conformed to no codes or regulations.  If it were any human-made object, it would have been flying illegally and in violation of United States law. My UFO had a definite symmetrical structure, differential lighting, a variable mechanical sound, a 3-minute time of operation and a complex behavior, so it was not a natural phenomenon such as a mirage, ball lightning, plasma, Venus, meteor, swamp gas and so forth. It moved back and forth against the wind, so it was not a passive lighter-than-air object such as a balloon, kite or Chinese lantern. During its high-speed dive, the UFO exhibited no inertia or momentum, and it made no sound; therefore, it was not a human-made aircraft – no human construct can do this. All of this taken together leaves only a NOT human solution. Of interest, the June 13 object appeared to be predatory by its raptor-like tactics. First, there was the sneaking up and hovering above me. Second, after I hid under a tree whereby it lost me, the craft started to circle as though scanning the ground for a replacement. Third, it seemed to have spotted another ground-based subject, toward which it made a dive. (Of course, we want to believe this target was an abductee – whether true or not.) The entire affair was reminiscent of a hawk circling in the sky and stooping at a mouse in a field. I suspect, but will never know, that my quick reflexive hiding may have saved me from being confronted by whatever was operating this thing. It was never closer than 7/10-mile during the 5-second diving. Other than the expected natural anxiety and elevated adrenaline, I have never experienced any unusual symptoms then or afterwards. I actually arrived home earlier than planned because I did not proceed with my exercise walkabout, thus had ! no ‘missing time.’ Several months later, I have not experienced any side effects, so I guess that I am in the clear… The weirdly blinking red and the stationary green lights made no sense; were they designed for them or for us? I have reviewed many other UFO reports and have never seen any pattern described like mine; therefore, I assume it was either a custom job or the object could configure its own lighting scheme.  All that I can surmise is that the garish, colorful lights might have been an enticement or gimmick to instill interest and attract a sucker to stand still and gawk. I know that I certainly was enticed to observe this thing; only my fear of the unknown overrode my curiosity and kept me from standing in the open street and observing it.  This entire affair became a delicate balance between me hiding from the craft and me peeking at it. Of note, the UFO did not execute whatever action it desired, against whatever ground-based target it apparently had – from high up during its hovering position.  There were no visible projectiles, rays or whatever extending downward from the object toward any ground subject; conversely, there was nothing from the ground, which came upward to the craft.  Apparently, the object had to dive physically from its mile-high perch down to whatever it had targeted at ground level.  It appeared to have needed to get near whatever its interest was to accomplish whatever it wanted to do.  This would be like a hawk needing to get down grasping a mouse with its talons.  I estimate that the UFO ‘landed’ somewhere along a straight path, east-northeast from Northlake-Peavy, with Lochwood Park as the central impact.  It was traveling at a constant Mach-1 velocity as it approached about 1/10-mile above the ground.  I did not see it again as I walked home after that, so the object either stopped instantly or else it drilled into the ground.  Afterwards, there was no explosion, no news report and no evidence of damage. Two days after my June 13 observation, I wrote a short letter to the Dallas Morning News in hopes that other witnesses, perhaps near Lochwood Park, had seen where the object went and what it did after plunging below the tree line.  My letter was not published, which suggests that when these things are reported to the mainstream news media, they are laughed off.   Circuitously, since no one hears about them, there is nothing to them!  During my lifetime of 74-years, I have never seen anything that I could not explain; I can even explain my two Unidentified Flying Objects and thus make them Identified Flying Objects – they simply are highly advanced machines, designed, built and operated in our atmosphere by intelligent creatures that are NOT human.  What these beings are or where they are from, I can only speculate; however, their existence and activity in our environment is a 100-percent fact, from my direct observations.  This reality should help support those claims by other witnesses of fantastic and bizarre UFO occupant activity, as being a very real physical possibility. All of the testimony given here is the truth, the whole truth and nothing but the truth. ((NUFORC Note:  This is one of two high-quality reports which have been submitted by the same witness.  The other sighting occurred in Dallas on December 11, 2013, at 20:00 hrs..  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116501.html",
      "state": "TX",
      "duration": "3-minutes, 5-seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c33f8",
      "summary": "One picture that I took with my iPhone aimed towards the sun revealed 5 or 6 blue orbs.  ((NUFORC Note:  Lens flare?  PD))",
      "city": "dallas",
      "shape": "circle",
      "date": "2015-03-20T00:00:00",
      "story": "I was walking my dog and noticed heavy chem trail spraying overhead.  One picture that I took with my iPhone aimed towards the sun revealed 5 or 6 blue orbs in a curvature manner around the lower right side of the sun.   Approximately 45 minutes later, I took another picture of a chem trail crossing the sun and captured a single blue orb moving away from the left side of the sun. ((NUFORC Note:  We suspect that the blue objects are lens flares, but we are in communication with the witness regarding his photo that shows five such objects in one photo he sent.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117846.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d55",
      "summary": "I was in the car driving home when my friend asked me what some lights in the night sky are.  It was in the general area of Love field",
      "city": "dallas",
      "shape": "light",
      "date": "2015-07-03T00:00:00",
      "story": "I was in the car driving home when my friend asked me what some lights in the night sky are.  It was in the general area of Love Field, so I assumed the lights came from landing lights. There were two lights in the sky one was much brighter and lower than the other.  The lights were white like a star,  but much too close to be venus or any star..... to me they looked like meteors coming in.   they didn't move at all for over an hour and a half.  I checked later in the night to see if they were still there.  It had become cloudy,  high clouds and I could not see any stars anymore. Any one else see this?",
      "link": "http://www.nuforc.org/webreports/119/S119887.html",
      "state": "TX",
      "duration": "1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f39",
      "summary": "Red light mimicking star-like object.",
      "city": "dallas",
      "shape": "light",
      "date": "2015-06-05T00:00:00",
      "story": "Red Light Mimicking Star-Like Object I have seen this strange object now twice in 10 days.  It was in same location and around the same time of May 17 Sighting.  This time a red light followed; and another object was blinking above for a few seconds.  Lots of movement, and was hard to follow.  Once again, an unreal experience.",
      "link": "http://www.nuforc.org/webreports/119/S119217.html",
      "state": "TX",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3fa7",
      "summary": "Orange-red flash, lasting about 5 seconds.",
      "city": "dallas",
      "shape": "teardrop",
      "date": "2015-06-15T00:00:00",
      "story": "Orange-red flash, lasting about 5 seconds. I saw an orange red flash of light that looked teardrop in shape.  It only lasted 5 seconds.   It was just below the Big Dipper area and bigger than any of the stars in the sky.   Seemed like something that was just about where you would enter the Earth’s atmosphere. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119530.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c40bc",
      "summary": "Looked like a bright star at first... An unbelievable and unforgettable experience to witness.",
      "city": "dallas",
      "shape": "light",
      "date": "2015-05-22T00:00:00",
      "story": "Looked like a bright star at first... An unbelievable and unforgettable experience to witness. Long Description of Sighting Report: My dogs were going crazy barking at back door, so I went outside, and that's when I noticed what I thought a very bright star.  It started to move closer and then away and then turned red and then back to bright.  I was also hearing a very strange sound, between a hum and maybe wind.  (I have never heard this sound before)  I first grabbed my IPAD to start recording; it was not even close to what I was witnessing, so I ran inside and got my digital camera and started recording so I could the best view of this very odd object.  This object looked like a red disc spinning at times to a white dot.   After 2 min of recording; I stopped; to be honest because it scared me.  About 10 min Later it went slowly north from its location.   (As I look back on videos, a red light follows what ever direction it went).",
      "link": "http://www.nuforc.org/webreports/118/S118992.html",
      "state": "TX",
      "duration": "30-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4173",
      "summary": "Went to get trash can outside of home.  Saw pulsating lights w/ blue and red stop then move from north heading south. Assumed ghetto bi",
      "city": "dallas",
      "shape": "flash",
      "date": "2015-05-13T00:00:00",
      "story": "Went to get trash can outside of home.  Saw pulsating lights w/ blue and red stop, then move from north, heading south.  Assumed ghetto bird, but no sound.  Second object followed behind minutes later.  Felt like they could see me.  Weird.",
      "link": "http://www.nuforc.org/webreports/118/S118923.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4506",
      "summary": "Orange Light Pairs, 8 to 9-pm CDT, 10-28-2015.",
      "city": "dallas",
      "shape": "light",
      "date": "2015-11-06T00:00:00",
      "story": "Orange Light Pairs, 8 to 9-pm CDT, 10-28-2015. On October 28, 2015, between 8 and 9-pm CDT, it was dark and I was returning from a 45-minute walk. I went through the Lake Highlands Baptist Church parking lot, at the intersection of Northcliff Drive and Parkhurst Drive. This Church is about 1-mile northeast of White Rock Lake in northeast Dallas, Texas. Directly to my southwest, about 20-degrees above the horizon, were about twelve orange lights, forming about six distinct pairs. The lights were each uniformly as bright as a full Venus, but were pure orange in color. No FAA aircraft navigation colors were visible, specifically white, red and green. The lights appeared to be over the Fair Park area, at about 5,000-feet in altitude and 5-miles distance. The span inside each pair was comparable to a 737, from wingtip to wingtip. Each two lights appeared to be mated, but I could not see any solid object between the lights. None of the pairs seemed attached with a different pair, as they slowly moved around independently. Each pair was separate of the other pairs and they appeared to be at various staggered distances. I only saw a flat-on view of these things from their northeast side, and do not know the other side. Another witness 71975 saw the lights from another angle and could give triangulation. A jetliner was directly behind the lights to the southwest at about 10,000-feet altitude and 10-miles away. This aircraft apparently left D-FW Airport and was traveling in a southeast direction behind the lights. The night was clear and the lights were steady for 5-minutes, so they were not natural phenomena. They were much too large, bright, high and stable to be Chinese lanterns. These were illegally hovering near a Love Field flight path, five miles south of the runway, for five minutes without proper navigation colors; therefore, they were not man-made objects. These orange lights should have been easily seen by Love Field aircraft and traffic control and recorded. The pairs each slowly faded out one by one after about five minutes.",
      "link": "http://www.nuforc.org/webreports/123/S123303.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c464b",
      "summary": "Brilliant glowing orange large fireballs, appeared to be 7, hovering over Dallas in a V shape formation, gets brighter than descends.",
      "city": "dallas",
      "shape": "fireball",
      "date": "2015-11-19T00:00:00",
      "story": "Brilliant glowing orange large fireballs, appeared to be 7, hovering over Dallas in a V-shape formation, gets brighter than descends. I live in highrise building in downtown Dallas, TX.  At approximately 19:05PM I was looking outside my large ceiling to floor windows facing North towards Uptown/Arts District when I saw 7 large round orange bright glowing fireballs in the sky at a relatively low position in the sky. The 7 separate bright glowing fireballs appeared in a V shape where the first glowing orange fireball was the apex or point of the V shape. There were then 3 of the same objects on each side forming a V. They hovered in the sky, and one at a time the fireball would get larger and radiate more brightly like a orange diamond. I have never seen such a brilliant gleaming shining light in the skies as this. One by one, they took turns growing larger in size and brighter in appearance and then would slowly fade away as they seemed to get lower to the ground. I lost sight as they kept going lower because of a highrise building. This lasted about 20-30 minutes and they were stationed at ! the same position in the sky, a low hovering V shape position.",
      "link": "http://www.nuforc.org/webreports/124/S124081.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c49fd",
      "summary": "I was sitting outside on my back porch, and I saw a orange circular shaped object in the sky. For a second, I believed I was seeing a s",
      "city": "dallas",
      "shape": "changing",
      "date": "2015-09-17T00:00:00",
      "story": "I was sitting outside on my back porch, and I saw a orange circular shaped object in the sky.  For a second, I believed I was seeing a star, and then it started moving closer.  Then another reddish orange object came up to the side of it, and it was circular in the center, but it also had tendrils of orange around it and was moving forward also.   They both hovered for a minute and then disappeared in the same direction they came from.  I almost believed for a minute that they were bombs coming from the sky.   I don't know how else to explain them.  It definitely shook me up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121912.html",
      "state": "GA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4bdd",
      "summary": "Jetliner flies backwards",
      "city": "dallas",
      "shape": "other",
      "date": "2015-09-25T00:00:00",
      "story": "Jetliner flies backwards I work at a business right next to a major airport in Dallas the airplanes come in constantly right over where I work and land so I'm always watching them so while watching I noticed what appeared to be a jet aircraft except it was extremely fuzzy and without color it was flying over the airport where I thought would be a no fly zone it was traveling pretty fast but the thing that got my attention was it was flying backwards it made no sound it had no lights",
      "link": "http://www.nuforc.org/webreports/122/S122211.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d7d",
      "summary": "One bright light in slow downward trayectory, Dimmed away to orange ball; then, orange ring; then, off.",
      "city": "dallas",
      "shape": "light",
      "date": "2015-08-27T00:00:00",
      "story": "One bright light in slow downward trayectory, Dimmed away to orange ball; then, orange ring; then, off. I saw it from DFW airport, SSE.  21:10 hrs.  It was glowing like when you see Jupiter or Saturn, but bigger.  Steady, no flashing.  It started to descend slowly and vertically.  Then it moved diagonally downward and eastward until it stopped at some point.  Then, the bright light started to dim away until it became a dim orange ball.  Then it turned to an orange ring and then it stopped glowing.",
      "link": "http://www.nuforc.org/webreports/121/S121403.html",
      "state": "TX",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f61",
      "summary": "Red light flying over Dallas, Texas.",
      "city": "dallas",
      "shape": "light",
      "date": "2016-03-11T00:00:00",
      "story": "Red Light Flying Over Dallas Texas I live on Parkhurst Drive near its intersection with Northcliff Drive in northeast Dallas, Texas. I was outside in my back yard at 10:15 pm CST, on Saturday March 5, 2016.  To my southeast I saw a moving bright red light that was flying level at about 3,000-ft altitude and at about 1-mile horizontal distance from me.  It was flying northeast, from my right to my left, along a path roughly estimated to follow Garland Road from Casa Linda Plaza to Whiterock Marketplace Shopping Center, where it then turned northward toward Lochwood Park (Google Map). At first, I thought it was a small airplane in straight level flight without much variation. Its speed was about 200-mph, too fast to be a helicopter.  I looked for any other lights, specifically white strobes and green navigation lights, but it only had a steady intense red.  Since it is illegal to fly below 10,000-feet without white lights, I quickly inferred that it was not an airplane or other human construct.  No craft silhouette was visible because of the steady bright red light.  Then, I purposely listened intently for an airplane sound, but there was only dead silence.  The craft then swung around from my southeast to my northeast, apparently making a 45-degree left turn, and headed northwest, keeping 1-mile distance from me.  When it was to my northeast, I lost sight of it because of trees.  I watched it travel about 1.6-miles total distance and my sighting lasted about 30-seconds. I am 76-years of age, take walks every night, and have vast experience viewing aircraft in the night sky.  I have witnessed several other anomalous objects over Dallas within the past three years, but none before 2013.  My conclusion is that this particular craft was a machine that is NOT man-made, because – 1.  The lighting was illegal, 2.  There was no sound at all, 3.  The large scale ruled out an RC drone, 4.  The speed indicated a powerful craft, 5.  The time was late for small airplane operations, 6.  The flight path was illogical.",
      "link": "http://www.nuforc.org/webreports/126/S126264.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5785",
      "summary": "Single moving red light over northeast Dallas, March 8, 2016.",
      "city": "dallas",
      "shape": "light",
      "date": "2016-06-16T00:00:00",
      "story": "Single moving red light over northeast Dallas, March 8, 2016. My house is on Parkhurst Drive near its intersection with Northcliff Drive in northeast Dallas, Texas.  I was outside in my back yard at 10:15 pm CST, on Saturday March 5, 2016.  Most trees were still bare of leaves, affording a good view of the sky.  To my southeast from behind the neighborhood housing, a moving single bright red light suddenly appeared at about 30-degrees elevation.  It was flying level at about 3,000-ft altitude and at about 1-mile horizontal distance from me.  It was traveling northeast, from my right to my left, along a path roughly estimated to follow Garland Road from Casa Linda Plaza to Whiterock Marketplace Shopping Center (Home Depot), where it then turned northward toward Lochwood Park.   At first, I thought it was a small airplane in straight level flight without much variation. Its speed was about 200-mph, too fast to be a helicopter.  I looked for any other lights, specifically white strobes and green navigation lights, but it only had! a steady intense red, visible from its left or port side toward me, proper for navigation.  However, since it is illegal to fly below 10,000-feet without white lights, I quickly inferred that it was not an airplane or other human construct.  No craft silhouette was visible because of the steady bright red light.  I purposely listened intently for an airplane sound, but there was only dead silence.  The craft then swung around from my southeast to my northeast, apparently making a 45-degree left turn, and headed along my northwest, keeping about 1-mile distance from me.  When it was approaching my north, I lost sight of it because of trees.  I watched it travel about 1.6-miles total distance and my sighting lasted about 30-seconds.  It was somewhat low key. I have witnessed several anomalous objects over Dallas within the past three years, but had not paid attention to any before 2013.  The different mindset that was forced upon me by my extremely vivid 2014 sighting has made me recognize that it is equally as important to identify UFOs as to discount them, and to not take a perpetually skeptical position.  It is a much greater crime to see a flying saucer and dismiss it as “swamp gas” than to see swamp gas and label it as a “flying saucer.”  When you see a light in the sky that does not behave like any normal object, it probably is not a normal object.  Therefore, my conclusion is that this particular craft was a machine that is NOT man-made, because – 1.  The lighting was illegal by FAA standards, 2.  There was absolutely no sound at all, 3.  The speed indicated a powered craft, 4.  The large scale ruled out an RC toy, 5.  The clock was late for normal small private airplane operations, 6.  The flight path curved around my position and! was not straight, indicating some ulterior behavior, which made no sense for human piloting over northeast Dallas late at 10:15-pm.",
      "link": "http://www.nuforc.org/webreports/127/S127895.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c61d1",
      "summary": "Last night I saw some strange subjects in the sky. They look like fireballs, floating in the sky very smooth.I didn't count how many th",
      "city": "dallas",
      "shape": "fireball",
      "date": "2016-10-13T00:00:00",
      "story": "Last night I saw some strange subjects in the sky.  They look like fireballs, floating in the sky very smooth.  I didn't count how many the were but for sure was more than 25.  No sound at all.",
      "link": "http://www.nuforc.org/webreports/130/S130586.html",
      "state": "GA",
      "duration": ">5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61f6",
      "summary": "During the dallas cowboy football game on tv a camera pointed at the dallas skyline picked up an object of light moving from rt to left",
      "city": "dallas",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "During the dallas cowboy football game on tv a camera pointed at the dallas skyline picked up an object of light moving from rt to left.  At first I thought it was a small plane preparing to land.  Then abruptly the light hesitated then it rapidly sped away back to the rt but at a different angle and lower altitude. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130208.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c630f",
      "summary": "Observed an oval craft hovering in a fixed position in the sky. Thought initially it was a plane but was too low in elevation and not m",
      "city": "dallas",
      "shape": "oval",
      "date": "2016-09-02T00:00:00",
      "story": "Observed an oval craft hovering in a fixed position in the sky.  Thought initially it was a plane but was too low in elevation and not moving.  The craft was the size of a plane with 3 lights in a triangular arrangement.   Drove closer to its position and lowered my car window, the object was silent.  As I approached, I could see the oval shape from the light surrounding it.  The lights were red white and blue which made me think it might be a blimp for the 4th of July.   Then the craft ascended 15ft in one instant, stopped in mid air for a second completely still then lifted away vertically and disappeared.",
      "link": "http://www.nuforc.org/webreports/129/S129588.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c67c2",
      "summary": "Follow up to report submitted 02/24/2017",
      "city": "dallas",
      "shape": "light",
      "date": "2017-03-10T00:00:00",
      "story": "Follow up to report submitted 02/24/2017 This is a follow up to the report I submitted 02/24/2017.   02/25/2017, I was viewing this site and came across footage obtained from Stevens Pass ski area on 12/12/2016.  The occurrence appears to be what I witnessed on 02/24/2017 around 03:00.  The only difference being my occurrence lasted about 30 minutes.   Can someone please contact me by phone or e-mail and share with me relevant information discussed on 12/15/2016.                      Thank you.",
      "link": "http://www.nuforc.org/webreports/132/S132904.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c67c1",
      "summary": "Around 0300 an object resembling a star only brighter, appears in the southeastern sky.",
      "city": "dallas",
      "shape": "light",
      "date": "2017-03-10T00:00:00",
      "story": "Around 0300, an object resembling a star only brighter, appears in the southeastern sky. Around 3AM an object resembling a star, only brighter, appears in the southeastern sky. Object moves in all directions extremely fast.  Occurrence last about 30 minutes",
      "link": "http://www.nuforc.org/webreports/132/S132925.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c68b5",
      "summary": "Colorful sphere flying below clouds moving north west turning off its lights as it flew over my house.",
      "city": "dallas",
      "shape": "sphere",
      "date": "2017-03-23T00:00:00",
      "story": "Colorful sphere flying below clouds moving north west turning off its lights as it flew over my house. I had just put my toddler down for bed and stepped outside to sit by the pool and relax for a moment.  It was 8:30 pm..  That's when I saw what I thought was an airplane at first, but as it flew over, I realized it wasn't an airplane by the way the lights were changing.  There was also no sound.  It was cloudy and the object was flying low and under the clouds.   It was a sphere with red, blue and orange lights emitting from it.  It was flying too slow to be a meteor and low enough that I could see it was a sphere.   It was flying North West from the South East and as it passed over our house the lights turned off.  But with the clouds in the sky, I could still see a dark sphere against the white cloud backdrop.  And it kept moving until it disappeared.",
      "link": "http://www.nuforc.org/webreports/133/S133186.html",
      "state": "TX",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6928",
      "summary": "There was a big green flash of light.  ((anonymous report))",
      "city": "dallas",
      "shape": "oval",
      "date": "2017-03-23T00:00:00",
      "story": "There was a big green flash of light. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133221.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c69c9",
      "summary": "Approximately 630 am, very dark outside. Saw flash/ball of bright light. Bright enough to light the edge of the neighborhood to where i",
      "city": "dallas",
      "shape": "flash",
      "date": "2017-03-17T00:00:00",
      "story": "Approximately 630 am, very dark outside.  Saw flash/ball of bright light.  Bright enough to light the edge of the neighborhood to where it seemed to be 3:30 in the afternoon.   The flash seemed to be about 100 ft in the air and about 8 feet across- but the bright light it emitted exposed a good 50-100 yards in front of me in all directions, seemingly.   There was no sound prior to the event.   After the event, it sounded like power lines were being interfered with.   Weather was clear.",
      "link": "http://www.nuforc.org/webreports/133/S133143.html",
      "state": "TX",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7002",
      "summary": "Round erratic flying obj., bright orange, moving in flickering fashion.  Lg glowing ball object, moving E.  ((anonymous report))",
      "city": "dallas",
      "shape": "fireball",
      "date": "2017-08-17T00:00:00",
      "story": "round erratic flying object bright orange  in color, moving in flickering fashion.  Lg glowing ball object, moving East. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135728.html",
      "state": "OR",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7512",
      "summary": "Two white dots at high altitude traveling very close to each other.",
      "city": "dallas",
      "shape": "unknown",
      "date": "",
      "story": "Two white dots at high altitude traveling very close to each other. My son and I were outside walking our dog.  I happened to look up in the NE sky directly above us and saw 2 dots tracking in an easterly direction.  They appeared to be at an extremely high altitude and traveling faster than a normal aircraft at such a high altitude.  They continued to track together.   Neither my son nor I saw navigation lights flashing but only two solid white dots.   What was so unusual was that the dots were too close to be aircraft traveling that fast with no navigation lights.",
      "link": "http://www.nuforc.org/webreports/133/S133812.html",
      "state": "GA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c757d",
      "summary": "Me and my buddy are fishing and we saw a reflection on the water and looked up and I passed over  with out making a sound",
      "city": "dallas",
      "shape": "triangle",
      "date": "2017-04-28T00:00:00",
      "story": "me and my buddy are fishing and we saw a reflection on the water and looked up and I passed over  with out making a sound! The object was triangle shape with around 7 to 10 lights.",
      "link": "http://www.nuforc.org/webreports/133/S133804.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7711",
      "summary": "Yellowish/orange football shaped, color dimming object hovering over city skyline.",
      "city": "dallas",
      "shape": "sphere",
      "date": "2017-12-21T00:00:00",
      "story": "Yellowish/ orange football shaped, color dimming object hovering over city skyline. I recorded the bright Yellowish/orange sphere on my way driving into DFW Airport. It was hovering over the city skyline.  It dimmed colors and became bright.  It was to big to be a drone and flying way to low to be an airplane.  Description of background, city-skyline-dark skies.",
      "link": "http://www.nuforc.org/webreports/137/S137874.html",
      "state": "TX",
      "duration": "1:06"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a13",
      "summary": "Strobe white light flashing green and red.  ((anonymous report))((NUFORC Note:  Sighting of Sirius??  PD))",
      "city": "dallas",
      "shape": "sphere",
      "date": "2017-12-08T00:00:00",
      "story": "Strobe white light flashing green and red stayed stationary approximately 15 degrees above horizon east of Dallas, Oregon.   Moved south slowly over the course of 15 minutes. ((NUFORC Note:  Sighting of Sirius??  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137609.html",
      "state": "OR",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7bce",
      "summary": "Looking W in Dallas, GA, sky toward Rockmart repeatedly seeing flashes of bright lights in the sky.  ((anonymous report)).",
      "city": "dallas",
      "shape": "flash",
      "date": "2017-10-19T00:00:00",
      "story": "Tonight looking West in Dallas Georgia sky toward Rockmart repeatedly seeing flashes of bright lights in the sky that looks like lightning more than once moving East scene lights look like a ship moving silently. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136765.html",
      "state": "GA",
      "duration": "On going"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d76",
      "summary": "I was traveling down Ivy Gulledge Road on 9/5/17 at 16:00 hours when I looked up and about 25 feet above the road was a black ball abou",
      "city": "dallas",
      "shape": "sphere",
      "date": "2017-09-08T00:00:00",
      "story": "I was traveling down Ivy Gulledge Road on 9/5/17 at 16:00 hours, when I looked up and about 25 feet above the road was a black ball about the size of a softball just suspended in mid air.  It wasn't spinning or moving at all.",
      "link": "http://www.nuforc.org/webreports/136/S136071.html",
      "state": "GA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7de2",
      "summary": "It was almost sundown. I was doing yard work in the back yard when I looked up. Noticed an odd flame looking orb gliding through the sk",
      "city": "dallas",
      "shape": "other",
      "date": "2018-05-31T00:00:00",
      "story": "It was almost sundown.  I was doing yard work in the back yard when I looked up.  Noticed an odd flame looking orb gliding through the sky headed north.  I watched it & took a video of it for almost 2 minutes as it cruised through the sky @ an elevation higher than a drone would be but way less than an aircraft.  It was hard to distinguish the shape because it honestly looked like it was glowing bright orange & didn’t keep one specific shape.  Very odd. It stayed flying linear until I couldn’t see it anymore but it was definitely the strangest thing I’ve ever seen.  I know what I saw.  My 2 minute video deleted itself once I went back to look at what I had captured & all I was left with was this short clip of the object.  Note the trees to the left of the screen.  It will give you an idea of how fast it was moving. Pretty incredible.",
      "link": "http://www.nuforc.org/webreports/141/S141600.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fbd",
      "summary": "Large UFO with four red lights appears to do something inexplicable to the power grid in Dallas.",
      "city": "dallas",
      "shape": "chevron",
      "date": "2018-04-13T00:00:00",
      "story": "Large UFO with four red lights appears to do something inexplicable to the power grid in Dallas. I have wanted to report this sighting for a long time, but could not confirm the exact date until recently.  There were multiple witnesses (some very close) and physical effects (power grid disturbance). My girlfriend asked me to follow her to pick up the kids.  She didn't say why.  They were at a friend's 13th birthday party on New Year's Eve.  At a high point near White Rock Lake where the downtown skyline could be seen she pulled up beside my car, rolled down her window, pointed to downtown and asked, “WHAT IS THAT?”  Above the neon green-lit 72-story Bank of America Plaza building, a huge object, chevron or disk-shaped with four very large red lights visible around the base which were pulsating in a strangely synchronized but unpredictable way, appeared to be almost parked on the roof.  Maybe 100 feet above it.  It was larger than the top of that skyscraper.I said “I have no idea”. I wanted to stay and observe but she said, “Come on we've got to get the kids now!” and took off.  I followed, glancing at the object any chance I got visibility on the way. When we arrived the object was gone but the kids ran full speed to me saying“ (name deleted)  WE SAW A UFO!  WE SAW A UFO!”.  They were so excited that they were tugging on my clothes.  I asked, “Where was it?” They said, “RIGHT THERE!”, pointing above a large live oak in the front yard. I asked them how big it was and they said “BIG!”.  I asked what shape it was, but they couldn't say for sure because it was so close that it was partially obscured by the huge live oak tree.  They said it had red lights around the bottom. It turned out that the reason we were picking them up early was because they were terrified by this object.  When I went in to talk to the homeowner he said that he also saw it briefly.  He said “Follow me I want to show you something”.  He pointed in both directions up and down the street and said “Look at the lights.”  All the street lamps and porch lights were a very dim, faint yellow in both directions as far as I could see.  I had never before seen anything quite like this.  It looked like all the light bulbs had been replaced by tiny yellow candles inside.  It was as though 95% of all available power had been sucked out of the grid, leaving only a tiny trickle.  Clear cloud-free night.  I hadn't noticed this in all the excitement when we first pulled up. He said, “Let me show you something else”.  I followed him back inside and he tried to turn on his TV, but the power was so weak that it wouldn't come on.  Same thing with the stereo, although the inside lights and lamps were lit, seemingly by tiny candles. I asked “How long has it been like this?”  He said, “Ever since the kids ran in screaming about the UFO”. That's about it.  The next day (New Year's Day), my friend said that the power returned to normal perhaps an hour or two after we left. I found a match for this object when I ran across this video from Turkey:   https://www.youtube.com/watch?v=NSNViG1HoX8. At the very end you can see an object racing off over the water near dawn and it has the exact same four red lights! Same object with no doubt. Starting at 3:13 into the 3:58 video.",
      "link": "http://www.nuforc.org/webreports/139/S139434.html",
      "state": "TX",
      "duration": "5 min or 1 hr inc after-e"
    },
    {
      "_id": "64d005f478aba2ec5a3c8097",
      "summary": "Noticed a white boomerang shaped object very high in the sky traveling much faster than comparable planes in the busy sky. We saw it go",
      "city": "dallas",
      "shape": "formation",
      "date": "2018-03-29T00:00:00",
      "story": "Noticed a white boomerang shaped object very high in the sky traveling much faster than comparable planes in the busy sky.  We saw it go behind a cloud, and come back into view with an identical craft to the left of it traveling the same course and speed.  They both went behind a small cloud, and literally disappeared.",
      "link": "http://www.nuforc.org/webreports/139/S139272.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c827f",
      "summary": "I was lying on a lounge chair by the hotel pool looking up at the sky.  I saw something flying that looked similar to the stars but it",
      "city": "dallas",
      "shape": "circle",
      "date": "2018-09-27T00:00:00",
      "story": "I was lying on a lounge chair by the hotel pool looking up at the sky.  I saw something flying that looked similar to the stars but it was doing acrobatic maneuvers.  I filmed it with my iPhone.  When I watched it, I noticed a second object moving much faster - I did not see it with my naked eye.  I didn't notice the second one until I watched the footage.  I e-mailed the video to you.",
      "link": "http://www.nuforc.org/webreports/143/S143267.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c846b",
      "summary": "I was walking my dog facing east toward the Dallas/Fort Worth airport and saw four brighter than usual lights over the vicinity of the",
      "city": "dallas",
      "shape": "light",
      "date": "2018-10-12T00:00:00",
      "story": "I was walking my dog facing east toward the Dallas/Fort Worth airport and saw four brighter than usual lights over the vicinity of the airport.  There is usually a very busy sky show of planes incoming and outward bound from the airport at this time of night, but I witnessed zero activity of this during the even.   The ‘lights ‘ were much brighter than I normally see and were stationarily stacked one upon the other with estimated 100 feet apart.   After about ten minutes, the topmost one faded away, to be followed by each of the others, about one minute apart.   I’m not sure that what I witnessed were helicopters or not, although the behavior wasn’t like that of helicopters.   The regular airport traffic resumed shortly after the last bright light faded away .",
      "link": "http://www.nuforc.org/webreports/143/S143457.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8944",
      "summary": "Circle in shape.  1/4 mile wide.  Completely a white light, hovering about 100' from the ground. Made no sound.  ((anonymous report))",
      "city": "dallas",
      "shape": "circle",
      "date": "2019-09-06T00:00:00",
      "story": "Circle in shape.  1/4 mile wide.  Completely a white light.hovering about 100 feet from the ground.  Made no sound.  The light took me inside of it.  Inside the light.  I vanish.  I  couldn't see myself or my car.  All I saw was a purple white light and hear a humming sound.  Like a speaker getting a electric charger in it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148450.html",
      "state": "TX",
      "duration": "City vanishing"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b8a",
      "summary": "Extremely bright triangle aircraft that was low to the ground and way too quiet and turned too sharp. ((anonymous report))",
      "city": "dallas",
      "shape": "triangle",
      "date": "2019-03-14T00:00:00",
      "story": "Extremely bright triangle aircraft that was low to the ground and way too quiet and turned too sharp. Triangle shaped aircraft with a real bright light hoovering low to the ground and it had red and blue lights on the sides and it was extremely quiet as it went through the sky.  Seemed to be going at a slow pace but was moving and then it done a real sharp turn like a U-turn then was gone.",
      "link": "http://www.nuforc.org/webreports/145/S145175.html",
      "state": "GA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d5d",
      "summary": "The only reason i spotted is because i looked up and the light was so weird it caused my vision to go blurry and almost see it in doubl",
      "city": "dallas",
      "shape": "light",
      "date": "2019-01-11T00:00:00",
      "story": "The only reason i spotted is because I looked up and the light was so weird it caused my vision to go blurry and almost see it in double when looking direct at it.  It did movements that were not consistent with modern aircraft  Youtube video:  https://youtu.be/rbV34hCo3eo",
      "link": "http://www.nuforc.org/webreports/144/S144355.html",
      "state": "TX",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e6a",
      "summary": "Unexpected.  I just looked up and saw this thing.",
      "city": "dallas",
      "shape": "circle",
      "date": "2019-01-11T00:00:00",
      "story": "Unexpected.  I just looked up and saw this thing. Was at work outside, saw this thing that was flashing bright green lights then suddenly stopped then flashed bright red lights.   It stopped then moved left, stopped again then moved fast back the way it came.",
      "link": "http://www.nuforc.org/webreports/144/S144417.html",
      "state": "TX",
      "duration": "<4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c91f8",
      "summary": "2 flying diamonds; red and gold lights; creaking sounds.",
      "city": "dallas",
      "shape": "diamond",
      "date": "2019-12-01T00:00:00",
      "story": "2 flying diamonds; red and gold lights; creaking sounds. 2 Diamond shaped flying objects were flying back and forth shining red and gold lights making creaking sounds sometimes. There were LED lights on them.",
      "link": "http://www.nuforc.org/webreports/150/S150378.html",
      "state": "TX",
      "duration": "2 days"
    },
    {
      "_id": "64d005f478aba2ec5a3c9314",
      "summary": "Bright baby blue light then it changed to red and green then red and blue again and disappeared.",
      "city": "dallas",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Bright baby blue light then it changed to red and green then red and blue again and disappeared.",
      "link": "http://www.nuforc.org/webreports/150/S150095.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c9498",
      "summary": "long black pipe motionless over Dallas, texas",
      "city": "dallas",
      "shape": "other",
      "date": "2019-12-19T00:00:00",
      "story": "long black pipe motionless over Dallas, texas I was driving on the Dallas North Tollway just South of the 635  interchange. I could see out the front of my windshield in the air at about the 1:00oclock position this long black pipe. The object was motionless in the sky. I  am a private pilot and would estimate the altitude to be slightly  less than 1000 ft agl. I attempted to video record the object and caught the object just for a second on my cell phone while trying to drive.",
      "link": "http://www.nuforc.org/webreports/151/S151411.html",
      "state": "TX",
      "duration": "3min"
    }
  ]
}