{
  "city": "dayton",
  "fetch_timestamp": "2025-07-12T14:37:24.000414",
  "record_count": 85,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b426b",
      "summary": "Summer of '99 Nostrodamus prophecy sighting near WPAFB",
      "city": "dayton",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "Summer of '99 Nostrodamus prophecy sighting near WPAFB To all concerned citizens, if you could help me with this problem it would be greatly appreciated.  I had just came home from work, fixed a meal and ate, when I decided to sit outside and enjoy the night air in my backyard. I was out there for about 30-45 minutes after sunset when the clouds started coming in, the weather called for rain, so as I was watching some of the forcasted clouds come in, I peered up and to my amazement I caught what I beleived to be a ship hiding in concealment. So, I was transfixed on it as it passed slowly by there was no sound coming from this ship at all. Then it occured to me that Nostrodamuses claim was wrong it wasn't meteors he saw but alien spacecraft.To my greatest suprise I would get to see two of the worlds greatest theories come to pass. As I watched as it passed overhead, another came by then another, then another, as I was calculating where they were going. I figured it was WPAFB. Then they stopped. The ship overhead was a triangle in shape with three large viewing windows from my observation,ther was also two figures in the windows which seemed to be looking directly towards me, so I just politely waved greeting them to Dayton. Then all of a sudden out of the corner of my eye I saw a bluish type of light, like that on Star Trek's transporter system. Well to my suprise it seemed like there were little children running around my yard playing. I couldn't see them physically because they had on something that made them seem to be invisible. Like that suit the predator wore when he was fighting Arnold S. then as i am looking around I feel a little one lean on my leg and seem to be looking right into my face, and another start playing in my hair, like they have never seen a black guy before. It was just amazing that there kids was just as curious as mine are. So I peer back up and smile & laugh that the two are still there in the window are still looking down on us. It must have been at least 20 or more minutes they stayed in my yard playing. The ships started moving out, I would guess that WPAFB had difficulty greeting our new friends and unloading there belongings. I would guess this ship that stopped over my head was a passenger vehicle, because there was more vehicles to come. The next was box shaped,like a transporter. The one after that had my magneto pulse drive system underneath. I counted at least ten ships, but the last two gave me goose bumps you could tell these were not peace loving ships these were built for fighting. they were larger than the rest with deep grooves and edges, and just looked terrorfying. WPAFB was busy that night,lol. I thank the lord for letting me be a part of this. But I would like to see the proof that I am not Haluccinating. If you could get the weather pictures it might be able to prove it. Nostradamus, and I werent seeing things, please help us prove this. Sigthing July 27th,1999 time around 9:30pm-11:45 or so coming from the west, heading towards WPAFB. Let the truth be told. thank-you very much for listening to my sighting of some ufo's. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49700.html",
      "state": "OH",
      "duration": "2 hours +"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a93",
      "summary": "5 bright flashing lights in the clouds with no known origin and in the same spots. Lasted at least 2 hours",
      "city": "dayton",
      "shape": "light",
      "date": "2019-07-05T00:00:00",
      "story": "5 bright flashing lights in the clouds with no known origin and in the same spots. Lasted at least 2 hours Strange flashing lights in the clouds similar to lightning but there was no rain or thunder.  There were 5 flashes and they happened in the same spots, except they very slowly moved along. Like so slow it was hard to notice.  We could not see the source of the lights.  There were at least 6 planes observing the phenomenon flying around it.  We know it lasted for at least two hours, but it was getting late so we went to sleep. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)",
      "link": "http://www.nuforc.org/webreports/147/S147128.html",
      "state": "OH",
      "duration": ">2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4bcf",
      "summary": "Two points of light rotating around a center point then disappearing.",
      "city": "dayton",
      "shape": "circle",
      "date": "2019-07-12T00:00:00",
      "story": "Two points of light rotating around a center point then disappearing. My wife and I were in the backyard stargazing.  My wife pointed out what looked like two faint stars east of the moon that were not there a minute ago.  They were motionless for about a minute and were increasing in brightness.  At that point I thought they were two planes heading toward us.  Then they started to rotate around a center point, very slowly at first then increasing in speed but continued around a center point.  That didn't seem plane like, definitely not stars.  Then the lights disappeared suddenly.  We are in an area of military bases.",
      "link": "http://www.nuforc.org/webreports/147/S147515.html",
      "state": "NV",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d41",
      "summary": "We saw an oval shaped craft in the sky. Appeared to be white or clear, emitting light. Was bright outside and still could be seen clear",
      "city": "dayton",
      "shape": "oval",
      "date": "2019-06-20T00:00:00",
      "story": "We saw an oval shaped craft in the sky.  Appeared to be white or clear, emitting light.  Was bright outside and still could be seen clearly.",
      "link": "http://www.nuforc.org/webreports/146/S146906.html",
      "state": "OH",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b5056",
      "summary": "Green circular object no sounds no blinking lights",
      "city": "dayton",
      "shape": "circle",
      "date": "2019-12-22T00:00:00",
      "story": "Green circular object no sounds no blinking lights Single green circular shape faint color no blinking lights or sound.   Clear path North East headed south west.   Commercial air craft passed within about of minute with obvious green and red lights and sound.   Air craft pilot would of had visual on this.  Strange never seen anything like this.",
      "link": "http://www.nuforc.org/webreports/151/S151778.html",
      "state": "TX",
      "duration": "less than minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b557b",
      "summary": "Dayton, Ohio sighting",
      "city": "dayton",
      "shape": "oval",
      "date": "2007-02-01T00:00:00",
      "story": "Dayton, Ohio sighting The date of this sighting is approximate. It occurred late spring early summer when I was about 10 years old in Dayton, Ohio. We lived 2 houses West of Our Lady Of Mercy church. It was after dark and the family was watching TV in the dining room. I looked east out the side porch window and saw the craft. It was oval from what I could tell, with yellow light comming from what looked to be windows around the center of the craft. The craft was at 50'to 70' altitude judging from the tree height over which it was moving.The craft was at a distance of 150' to 200' from our house. I yelled for my family and they moved to the windows and saw the craft too. We then ran upstairs to get a better view of the craft. It moved slowly taking perhaps 20-30 seconds to move out of sight over the woods that bordered church property. While we were watching the craft a figure was seen inside who looked to be working controls of some sort. The figure was backlighted by the glow and I only was able to make out a dark human type shape. The following morning my brother and I went back in the woods where the craft had dissappered. About 200' inside the woods there was an area of crushed brush and even a couple broken saplings the largest being about 2&1/2 inches in diameter. This area was about 50' around, circular. And about 20'to 25' apart in the center there were 4 holes. These holes were about 3\" wide and 6\" to 8\" deep. For several years following this sighting very little grew in the crushed area, and what plants that did grow there were sickly as was a tree that was on the edge of the area. No sound was ever heard from the craft, and though the outline was rather vague due to the darkness, There was no sign or visible means of propultion, and a absence of any engine sound. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54093.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b563f",
      "summary": "Ufo seen near Wright Pat airforce base",
      "city": "dayton",
      "shape": "oval",
      "date": "2007-08-07T00:00:00",
      "story": "Ufo seen near Wright Pat airforce base I was about 10 years old when I seen this craft. I was woke up about 430 Am to come along with my mother so she could drop my father off at work. In the car was my sister my cousin whom was spending the night with us that night and I. We took I-75 back home as usual because my father worked 15 min away from where we lived. While on the highway after you pass I-70 But befor you get to benchwood rd exit (note Benchwood rd exit was not there 10 yrs ago)I notiched an circular oval shaped object hovering around the highway ligts. The ufo was very close to us and I could not beleive my eyes. It continued to circul the lights in rapid movements. The ufo flashed with lights that circled around the whole center of the craft. They were multi colored I remeber it was blue and red colored lights. As we passed the craft I looked back and continued to watch it untill I could no longer see it. I asked my cousin if we really just seen a ufo and she replied yes in a creeped out way. What i belive the ufo was doing was getting energy from the lights on the highway to help power its craft. That is what I beleive. I live 10 min from the wright pat airforce base and I came up with a theroy that maybe its a top secert craft they created that can spy. I have allways told everyone about this encounter but never thought about reporting it till watching shows on ufos. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57120.html",
      "state": "OH",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5781",
      "summary": "WPAFB Dayton OH, 3 cloud ufos, we were seen, followed by white vans who later  asked me about ufo's.",
      "city": "dayton",
      "shape": "other",
      "date": "2007-08-07T00:00:00",
      "story": "WPAFB Dayton OH, 3 cloud ufos, we were seen, followed by white vans who later  asked me about ufo's. We stood on an access road by a large grass field and treeline at Wright-Patterson AFB in Dayton,OH. About 5a.m., we observed three white vapor clouds rising from the earth, as if evaporating. From a distance; they would have been inconspicuous, but clouds do not take independent trajectories regardless of wind direction, not to mention the clearly visible rotating bands of white lights in each cloud. A very  low-flying plane passed directly overhead, with a very odd  paint scheme, and a very odd metal framework of objects affixed to the underneath, so much that there clearly was no way landing gear could function, had there been any. Directly afterwards, three vehicles drove by us, one a white van w/ two men that followed us to our job, came in one hour before we opened, then a man phoned to offer us a \"cab ride out of there\" We were followed everywhere by white vans for weeks, then two vans came to my house to \"work on\" the utility pole in my yard. No utility companies I called knew anything about it, and when I went out to speak to them, they asked me about ufo's.",
      "link": "http://www.nuforc.org/webreports/057/S57920.html",
      "state": "OH",
      "duration": "15-20 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b580c",
      "summary": "unexplained departure from atmosphere",
      "city": "dayton",
      "shape": "oval",
      "date": "2007-02-01T00:00:00",
      "story": "unexplained departure from atmosphere ((name and e-address deleted))  Im 37, never seen anything odd or could not explain in my life.  I have perfect vision, on no medication, etc..   It’s 1997 now, but in 1994, an incident occurred. This has been occurring to me lately, I saw a, lets say, UFO.  Im from Dayton, OH, but I was in Fairborn, OH, this particular day It was around 12:00 noon, full daylight, little clouds in the sky..  I walked out outside of a apartment complex, mind you id been up since about 9:00 am, as soon as I get outside, I noticed a round, rather large object sitting in the high air, hovering.  A friend was with me but I was so attached to the object in the sky, I wasn’t able to say anything to him till it was all over.  I continued walking and starring, after about 8-10 seconds the object ascended, or rather departed farther into the sky.  Estimating another 5-7 seconds to depart.  Now this is the reason why I believed what I saw.  Not only a full beautiful day of sunlight, hardly a cloud in the sky, but... As the object departed, whatever part of the sky this is actually visible, (I’m not sure if our own space shuttle does this, I could be wrong, but I don’t think so) I noticed I could see a distortion around the object.  Simply I could see black around the departing object, rather the distortion allowed me to see, without the blue sky, right into space, or rather the point of leaving the atmosphere allowed the, or didn’t allow light as normal.  I cant really explain, but my brain, or rather I would have never have thought of that occurring. The process that took place I’ve never considered.  I believe what I saw only because of the sunny day, perfect vision, not really, the distortion around the object as it departed, like I say, I could not have conceived the Idea of what I saw.  I, in general do not think of this memory, vary rarely, but an idea popped into my head to write and send to , somewhere.  I don’t expect belief, anyone can say anything, I would like an explanation of a similar distortion that occurs as an object departs, or it only happens under certain conditions, as I explained.  Its thursaday, Jan 25, If explanation, please reply.. ((name deleted)) ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54928.html",
      "state": "OH",
      "duration": "total =15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b6135",
      "summary": "We were heading west on I70 near exit 26 in Ohio, just west of Dayton. The lights appeared in the southwest and I thought it was the li",
      "city": "dayton",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "We were heading west on I70 near exit 26 in Ohio, just west of Dayton. The lights appeared in the southwest and I thought it was the lights on top of a tower. When we got closer we could see way more lights than there should be on a tower. It was up two or three hundred feet. By the time it was due south of the driver's window, I could see five stable, white, evenly spaced, very bright lights in the shape of a triangle with several orange and blue lights that flashed randomnly. No two colored lights flashed at the same time. It remained for 10 to 15 seconds directly next to the driver's window so it must have been moving very slowly. We watched it continue to the northeast until we could no longer see it. Because we were on the interstate we were not able to stop or listen for sounds.",
      "link": "http://www.nuforc.org/webreports/058/S58523.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b74f5",
      "summary": "UFO seen in Dayton, Ohio near Huber Heights",
      "city": "dayton",
      "shape": "oval",
      "date": "2007-10-08T00:00:00",
      "story": "UFO seen in Dayton, Ohio near Huber Heights While driving home from work on I-70 east bound just 2 miles before the Huber heights exit, I saw a greenish light shoot down from the sky.  At first I thought it was just a shooting star but then the light shot straight back up into the sky and disappeared.  I do believe it was a UFO. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59051.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7be8",
      "summary": "Objects appeared over Dayton, Ohio,",
      "city": "dayton",
      "shape": "egg",
      "date": "2006-07-16T00:00:00",
      "story": "Objects appeared over Dayton, Ohio, I am a 56 year-old business owner. I am well traveled and have seen lots of oddities in my lifetime. The event I witnessed last Saturday morning was disturbing. An employee and I were standing in the parking lot of my business chatting. It was a bright sunny day with spotty high clouds and a very light breeze. I noticed a large number of small clouds suddenly form in the sky to the north just below the upper cloud level.Curiously, these small clouds started traveling downward in an arc. Other small clouds appeared behind the first, and more behind those, forming a steady stream of clouds. Three larger clouds appeared. These cloud objects traveled across the sky in a straight line formation to a point overhead and remained stationary during the entire event. The steady stream of smaller cloud-like objects continued their downward arc at a slowing rate of speed. As they neared our position, the mist surrounding these objects began to disappear, revealing shimmering egg-shaped objects. The skin of these objects were a bit translucient. As the objects lowered in altitude further, this skin became completely transparent. The objects reached treetop level just over our heads, traveling at a quick rate of speed, approximately 50 mph. Hundreds of them passed overhead. The outer skin of these objects appeared to be a membrane of sorts. Inside this membrane, another object appeared. The inner object was a segmented globe, much like a soccer ball. The outer skin of this object seemed reflective--reflective not of the sunlight but of the sky around it. Struts or wires or something protruded from the bottom of the globe to a pointed horseshoe shaped thing with bright silver flashing lights on the underside. These lights flashed in series from the rear of the object to the front. After passing over our heads, these objects headed skyward. They disappeared at a point just below the cloud level.",
      "link": "http://www.nuforc.org/webreports/051/S51132.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b2e",
      "summary": "The Department of Positive Out of Body Possibilities",
      "city": "dayton",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "The Department of Positive Out of Body Possibilities This is not a normal sighting, as you are use to hearing about. It goes far deeper than that. It's more like a vision, from internal thought. My inner thoughts have figured out a way. How we can communication with afterlife people, in a way that can be measured for free!  I would like to be contacted by an investigator, and given the chance to explain my description better. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68192.html",
      "state": "OH",
      "duration": "Current"
    },
    {
      "_id": "64d005f478aba2ec5a3b8cd7",
      "summary": "A bright white light over Dayton that danced around the sky at incredible speeds",
      "city": "dayton",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "A bright white light over Dayton that danced around the sky at incredible speeds My fiance and I were sitting in our bed, when he looked out our window and spotted bright light in the distance that seemed to be moving strangely.  We stared trying to decide if maybe it was a star or satelite.  It started to move up very fast and side to side at fast speeds. At this point, we knew it was neither.  It was a bright white light with a faint blue light. We stared at it for 10 minutes in disbelief watching it move around irradically.  It eventually dropped down out of our sight.  We are not sleeping well tonight!",
      "link": "http://www.nuforc.org/webreports/072/S72909.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8fa6",
      "summary": "Driving down Highway 146 Friday night around 9:30PM my husband and I noticed a very bright object in the sky.  My husband asked if that",
      "city": "dayton",
      "shape": "triangle",
      "date": "2009-12-12T00:00:00",
      "story": "Driving down Highway 146 Friday night around 9:30PM my husband and I noticed a very bright object in the sky.  My husband asked if that was a star in the sky and I said no it is too bright to be a star.  The object wasn't moving so as we got closer to it, it started moving slightly toward our car. When it directly over our car we pulled over to get a better look.  The object just hovered mostly but as we looked at it longer it started to move away from under our car.  It was very quiet.  Never heard a noice from it.  We watched it fly away slowly and so we proceeded on our way.  As we were driving down FM1008 I noticed another one in the sky.  It could have possibly been the same one but I don't think so.  This is the second sighting I've had in this area in past 2 years.",
      "link": "http://www.nuforc.org/webreports/073/S73106.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0db",
      "summary": "Elongated triangular shaped craft seen over east Dayton, flying south before splitting into 2 seperate lights.",
      "city": "dayton",
      "shape": "triangle",
      "date": "2010-06-03T00:00:00",
      "story": "Elongated triangular shaped craft seen over east Dayton, flying south before splitting into 2 seperate lights. So right around 12:45 tonight I was driving south on I-75 in downtown Dayton, OH just north of the I-35 changeover when I saw something in the sky over Dayton.  I was looking out my driverside window towards the city, which would have been directly east of the city.  It was an elongated triangular shaped object, seemingly delta shaped, which was either glowing or reflecting a bright yellowish white light.  At first glance I thought I was seeing moonlight through a break in distant clouds but quickly realized that the body of light was moving. It was traveling southbound with me and without immediately considering the details I just assumed it was a particularly visible conventional aircraft, but it's odd shape kept my attention.  With only my own perspective to judge from I couldn't accurately determine the objects distance from me and therefore couldn't figure its speed or altitude but after watching it for a couple minutes I realized that it was either much too large and traveling much too fast to be anything conventional or it was flying much too low over the city.  Within a few minutes I was taking the 35 East exit and at this point the shape was south east of the city. Around this point it split into two lights, one was directly above the other.  The bottom of the two lights seemed to have a slight red hue and the top was a pale white.  About two miles onto I-35 the lights were directly south of me and as I drove east the two gradually disappeared into the south.  By the time I reached Keowee St. they were no longer visible.",
      "link": "http://www.nuforc.org/webreports/075/S75649.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb6d5",
      "summary": "Standing outside facing east, a light green circle passed across the sky from north to south.",
      "city": "dayton",
      "shape": "circle",
      "date": "2011-01-31T00:00:00",
      "story": "Standing outside facing east, a light green circle passed across the sky from north to south.   It made no sound.  Dogs were barking. Engineer ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79871.html",
      "state": "ME",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bba58",
      "summary": "At around 10 p.m. on July 17, 2010 in the area of Dayton, Ohio, my husband and I were traveling I-75 South and had just exited the Cent",
      "city": "dayton",
      "shape": "other",
      "date": "2010-07-19T00:00:00",
      "story": "At around 10 p.m. on July 17, 2010, in the area of Dayton, Ohio, my husband and I were traveling I-75 South and had just exited the Centerville-Miamisburg exit 44 and turned left.  I was in the passenger’s seat and my husband was driving.   I happened to look out my window to the right and in the distance, coming towards the earth diagonally; I saw what I thought to be a large, slow moving meteor coming towards the earth.  It was orange-yellowish in color and had a long tail.   As it was approaching, it split off into 3 different balls of light that seemed to be about the sizes of very large stars and they continued to have the same color.   They hovered in different parts of the sky and hovered up then down (not simultaneously) and then finally just down until we could no longer see them because of the obstruction of view and the fact that we were driving in the opposite direction. ((NUFORC Note:  We spoke via telephone with this witness, and she sounded to us to be a quite serious-minded individual.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76618.html",
      "state": "OH",
      "duration": "2:00"
    },
    {
      "_id": "64d005f478aba2ec5a3bbed8",
      "summary": "Spotted a large meteor heading west",
      "city": "dayton",
      "shape": "other",
      "date": "2012-01-12T00:00:00",
      "story": "spotted a large meteor heading west 6:43 Eastern Standard Time Location Dayton VA, 22821   Located an object which looked like a moving star heading west. The object could not have been a satellite because it was moving in a tangentially in respect to the earth. The path lasted about 15 seconds, then dissapeared approximately 20-25 degrees above the western horizon. (Probably due to lack of sun's light reflection",
      "link": "http://www.nuforc.org/webreports/086/S86380.html",
      "state": "VA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbed9",
      "summary": "Large meteor passes earth",
      "city": "dayton",
      "shape": "unknown",
      "date": "2012-01-12T00:00:00",
      "story": "Large meteor passes earth Time: anywhere between 6:42 - 6:44 PM Eastern Standard Time Location: Dayton VA, 22821  Did the world nearly end while I was enjoying a smoke?   At around 6:40PM Eastern Standard Time, I went outside to have a ciggarette.  A few minutes later I looked up about 15 degrees west of overhead to see what looked to me to be initially, a bright moving star. It was too far away to be an aircraft and was obviously both too high and moving too fast.  It was about as bright as Jupiter in the night sky its color was white with a very slightly yellow tint giving off a near constant light, but dimming as it approached the horizon.  I remember distinctly that the object was moving faster when it was over head, than when it was off closer to the horizon.  The object dimmed in a regular (almost linear) fashon. The path of the object started from about 15 degrees west from overhead, and continued to about 45 degrees over the southwestern horizon before fading away.  The whole occurance occured over about a 15 second long period. I thought to myself; \"what if that's an asteroid?\"   I thought this was potentially accurate because typically meteors move faster, and are only visible when they burn up in the night sky, and usually they leave a streak.  This was just a bright object like a star. Leading me to infer that what was producing the light was was reflection from the sun.  I wasn't sure exactly how big an object had to be to reflect an amount of light bright enough to be mistaken for a bright star but I assume it has to be at least 30 feet in diameter.  So I believe the object was rather large, perhaps as large as a plane or maybe much bigger. I supposed it might be the International Spacestation. But from what I know the spacestation moves in a roughly opposite direction from the object I saw. The object was heading almost exactly southwest. What I can also infer from my observations was that the object was moving tangentially with respect to the Earth. This would explain both the slowing of the object as it approached the Southwestern horizon, and it would explain the behavior of how it faded away (because it reached an angle with respect to me where the suns light no longer reflected off the object). The arc length was approximately 30 degrees, maybe more from when I first noticed it. And the whole event lasted about 15 seconds. Given my observations, I can conclude that in all likelyhood, the object was not an asteroid but it was probably (though not definately) a large meteor. This conclusion is based upon the theoretical limit for meteor speed, which is roughly 160,000 miles an hour plus or minus 3,000 depending upon its relation to the rotation of the earth at its surface. This theoretical limit itself is based upon escape velocity, or velocity at which objects would not be pulled back in from the sun's gravity. Not much more can be inferred from my observations without making assumptions because the exact trajectory (particularly along the y-axis {the axis perpindicular from the ground to space}) can not be known. If I assume delta Y is 0 (which it must approximate to by about plus or minus 30 degrees) then a rough approximation of its distance can be calculated. From my observations I know the arc length was approximately 30 degrees over a period of approximately 15 seconds. My initial reports were inaccurate both in its trajectory and in the angle to which it faded. After revisiting the scene I can say with some certainty that the object disappeared about 45 degrees above the horizon (not 20-25) and started about 15 degrees from directly overhead (or from when I first noticed it). Because the object did not appear to burn up or leave a streak, it is safe to infer that the object did not burn up in the atmosphere meaning it was at least 62 miles above me. *62 miles is the approximate distance from the surface of the earth to the outer edge of the atmosphere given the two constrants (maximum speed limit of a meteor and the minimum distance from the surface from the earth, I can make rough approximate limits of its size and speed. Assuming the smallest possible size of the object (in order to be able to produce that light) is a sphere 30 feet in diameter. Assuming delta Y of the meteors trajectory is 0. Assuming delta X is 30 degrees. Assuming maximum velocity is 160,000 miles an hour. *http://www.amsmeteors.org/fireballs/faqf/ Assuming minimum distance is 62 miles. *http://www.universetoday.com/25410/how-far-is-space/ Assuming delta T (or change in time) is 15 seconds. Assuming the meteor had to be at least 30 feet in diameter. (at a distance of 62 miles)  Calculations suggest the distance of the meteor could have been anywhere between 62 miles and 958.27 miles away.Based on assumptions the size of the meteor was 30 feet in diameter at a distance of 62 miles, the maximum potential size would be 463.68 feet in diameter, and it would be traveling at a speed of between 10,351.92 miles an hour to 160,000 miles an hour. If the absolute maximum assumptions are taken to be true, then it is possible that a small asteroid passed earth. But given how unlikely that is, it is probably more accurate to assume it was probably between 100-250 feet in diameter. It is also probably safe to assume that the object was larger than the minimum. Due to the unliklihood that a meteor was going slower than what is generally observed with meteors. The range of speed of meteors almost always ranges between 7 and 45 miles a second  *http://science.howstuffworks.com/question486.htm. if the minimum distance of 62 miles is taken to be true. the speed of the meteor would only be 2.87 miles a second. Judging from this, the distance was at least 151.22 miles away and was therefore it can be assumed that the object was at least 73.17 feet in diameter. So did the world nearly end? No in all likelyhood not.  Even if the meteor had hit earth, it wasn't nearly large enough to be able to cause serious damage.",
      "link": "http://www.nuforc.org/webreports/086/S86393.html",
      "state": "VA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2ee",
      "summary": "Red spherical light flew overhead in Dayton, Ohio.",
      "city": "dayton",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Red spherical light flew overhead in Dayton, Ohio. As if rising vertically from the ground behind a eastern facing building I observed 1 red spherical light.  It rose to what looked like very low aircraft altitude very slowly.  I ran inside to grab a camera while my husband waited outside.  When I came out it was obvious it had increased in speed and started moving towards us in a diagonal pattern.  I was able to snap one picture but soon my vision was obstructed by a tree.  Once it flew past the tree the light went off and it appeared clear.  It moved on west  into the distance. After reviewing the photo no object was seen.",
      "link": "http://www.nuforc.org/webreports/084/S84128.html",
      "state": "OH",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc57f",
      "summary": "Two pilots spot three UFOs south of downtown Dayton, Ohio.",
      "city": "dayton",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "Two pilots spot three UFOs south of downtown Dayton, Ohio. My friend and I decided to take a flight to Indiana for dinner, and were departing from Dayton Wright Brothers Airport around 1900 EST.  There were three people in the airplane. Two of us were pilots with around 100 hours, and one other person who was not a pilot.  As we took off and turned towards the proper heading we notice three bright lights off the left wing south of the airport.  At first glance we thought it was a large jet then we noticed there were not any position lights, beacon, etc., and the craft was entirely too low to be a craft of that size. As we paid more attention we noticed there appeared to be three different craft in a tight formation.   This gave us the last clue that these craft were probably not anything we’ve ever seen before.  Flying in a tight formation at night is dangerous, and keeping it that consistent would be nearly impossible. We were climbing out of three thousand feet and I would estimate the three UFOs were at one thousand feet above the ground.    As we looked down on the three craft they seemed to cycle positions in the formation, cut hard to the left, and took off over the city.  All the people in the plane lost sight of the craft at this point.",
      "link": "http://www.nuforc.org/webreports/085/S85659.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcba7",
      "summary": "Circular craft with lights around the entire parameter hung low and immobile in Dayton ohio",
      "city": "dayton",
      "shape": "circle",
      "date": "2011-07-04T00:00:00",
      "story": "Circular craft with lights around the entire parameter hung low and immobile in dayton ohio On Sunday June 26, 2011, at approximately 22:00, I encountered a circular craft on route 4 south driving towards downtown Dayton, Ohio.  The entire parameter ((sic. Perimeter)) of the craft was outlined in bright white lights.   It was hanging low in the sky and was immobile.  One flashing white light was pointed towards WPAFB and was blinking on and off.  I could not detect the color of the craft as it was dark outside.  It almost looked like it was black or invisible but could detect an outline; like black against a black sky.  The circular craft had a half circle bubble on top of the circular base and that also had lights around the parameter.   I pulled off on the Harshman road exit and pulled my car into the Riverside police station for a better look.  It was hovering right over the overpass very low to the road.  I rolled down my window and could not detect any noise.  I was surprised that no one else was pulling over to view this strange craft as it was so low to the road and very out of the ordinary.   It was about five minutes since I drove upon the craft and pulled over that the craft very slowly descended into the base area until I could not see it anymore.  I relayed these events to my friend and she posted this to her facebook page asking if anyone else saw this.  Two other people wrote back stating they saw the same thing around the same time.  Not sure if this was some prototype from the air force base or if this was something else. Did not see any other airplanes or other crafts around the craft. I will say that twenty years ago when I was ten years of age, I saw an identical looking craft above my old house that was located ten miles from the sighting previously stated.  It was around the same time at night.  It had the same blinking white light that flashed into my bedroom blinking on and off for ten or fifteen minutes.  The blinking light made rectangle shapes on my bedroom walls.  I brushed it off as car lights until I noticed the blinking lights weren't stopping.   I looked out the window and saw the same circular craft with lights around the parameter (sic.  Perimeter) hovering very low to the ground not making any noise.  It frightened me and I ran and told my parents.  Of course, it was gone by the time they came to investigate.   I wanted to mention this older past experience as the craft of Sunday's experience was identical in appearance and behavior.",
      "link": "http://www.nuforc.org/webreports/081/S81990.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfd0",
      "summary": "Texas, 1989, Orb in upper Earth atmosphere--ridiculous movements--impossible speeds",
      "city": "dayton",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Texas, 1989, Orb in upper Earth atmosphere--ridiculous movements--impossible speeds I’m way late on this one (1989), but just became a believer 2 nights ago when I happened across a documentary that covered “orbs.”   We had explained the sighting away and forgot about it. A buddy and I were 16 years old and camping about an hour east of Houston, Tx (5 miles north our tiny home town).  This is cow country, quite rural and remote, especially back then. There were four of us, but the other two were sleeping.  It was a cloudless August night.  We were enjoying some the stars (and his Dad’s beer we stole) before bed. We were facing south toward the Gulf which is an hour’s drive from there.  I noticed an airplane drifting from Houston (west) toward Beaumont (east). I remember saying something like “that must be a military jet; it’s way up there.”  It was perfectly silent, so that made initial sense.  This area is a flight path for the Houston airports; we grew up there.  We knew what commercial jets looked like at night—and you can definitely always hear them, especially in the still of the night. My buddy said something like “it can’t be an airplane, that thing might not even be in the atmosphere it’s so high.”  It’s moving way to fast to be a plane. I suggested it must be a satellite reflecting the sun to us, but I had never seen one before.  So we’re trading ideas of what we’re looking at.  It appeared to be no lower than our upper atmosphere, but probably under the satellites.  Remember, back then there weren’t many satellites. Maybe it was 45 to 60 seconds of watching.  Then it happened. This thing did something that was simply impossible.  It bounced up and down like a graph of a Cosmic Ray; high peak to trough in a relatively short space.  In about 1 to 1.5 seconds it must of oscillated 8 to 10 times.  Then it shot back in mostly the same direction it came from, maybe at a 30 degree angle over where it just came from (the west).  The problem is, it went from a nice slow visual pace to something near the speed of light. From the moment it quit proceeding to the East, it only took about 0.5 seconds for this thing to cover (I swear we’re not crazy) many thousands of miles.  It appeared to be many, a great many, diameters of the earth. We had what I’m sure is a normal reaction to this; we both shouted at the same time “Did you see that S---T?!?!?” That woke up the other two.  They were upset and accused us of being drunk.  We had each had maybe 6 beers.  We were weekend drinkers, so not really drunk yet. The other two stuck their heads out of the tent, but weren’t interested in “our prank” until morning.  They never believed us, and I don’t blame them.  We did get very drunk after that and stayed up almost till daylight trading ideas. Since what we saw was impossible, we settled on this explanation:  We were watching a satellite that just happened to quit reflecting sun light at the exact moment a meteor just happened to flam up and streak the other way.  A handy description I’ve used is that it moved like the Star Ship Enterprise gunning it for “warp 9.”  The bouncing around we dismissed as the initial explosion of the falling star. There was a very brief trail, but never since (I’m 40 now) have I seen a falling star like that.  He and I started hunting at about 10-12 years old.  We had spent many and hour watching stars and falling stars waiting for the sun to rise.  Plus we loved to go camping.  We each must of seen 100 falling stars by the age of 16. My subconscious new it wasn’t a falling star, but my conscious mind prevailed and I remained a non-believer for 24 more years. When I realized that someone video-taped something 98% similar (I never watch UFO stuff) I went into a light case of shock as my mind considered the ramifications. I’ve picked up quite a bit of physics and theoretical physics since 16.  My guess is this thing wasn’t from outer space, it came from hyperspace (5 or more dimensions). I went from making fun of guys like you to instant belief.  Sorry I’m a quarter of a century late with this one LOL.  I hope this helps someone. Dan  P.S. I’m holding off until my Christmas visit back home to show Don the video-got to see his reaction in person! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91157.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd331",
      "summary": "Round red object seen by two security officers then two fighter jets flew over area",
      "city": "dayton",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "round red object seen by two security officers then two fighter jets flew over area Two security officers patrolling parking lot and my partner told me to look and he pointed to the east in the sky and we saw a red object that was round like a baseball and very brite it was heading towards us and started going up on a angle then went straight up into the clouds moveing in a way I have never seen before. 10 minutes later two fighter planes flew in the same area and did a wide circle like they were searching for something.",
      "link": "http://www.nuforc.org/webreports/093/S93156.html",
      "state": "OH",
      "duration": "60 to 90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd524",
      "summary": "Multiple high speed, high altitude lights over Dayton, Ohio.",
      "city": "dayton",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Multiple high speed, high altitude lights over Dayton, Ohio. At about 20:30 EST, my sister called me to see if I had seen any lights outside.  She and my parents had been standing outside since 20:00 watching dozens of lights moving from south to north over Dayton, Ohio.  I went outside and immediately spotted on of the lights. I went inside and grabbed my wife, who also saw.  She proceeded to call her parents and brother, who also all saw the lights. The lights were extremely high in altitude, very fast, and ranged in colors of white, blue, and red. Several of them flickered.  I think the color difference could be explained by differences in altitude. After roughly 15 minutes of watching, I saw three all moving at the same speed in a staggered triangle formation.  Already in amazement by what I was seeing, a much larger, deep red light followed those three. At first, I was waiting to see if they would fade from view at about 30 degrees as most satellites I have seen do.  The only time the lights faded was when they were so distant I could no longer see them, but never did they flicker out like satellites.  Living near Wright-Patterson, I am not entirely surprised to see things like this, but they were definitely not aircraft that the public knows about.  None of the lights changed direction, seemingly all having a set destination or orbit. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93326.html",
      "state": "OH",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bd63d",
      "summary": "Yellowish/orange lights",
      "city": "dayton",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "\tYellowish/orange lights my wife was in the kitchen she just happen to open the back door and seen the first light and she called me and the kids in to look now to me it looked like it was a triangle shaped .but my son says it looked like a bright light to him the first light was not moving just getting bright and dim then from the south west came another light and as the first light faded out the secound one moved up and took its place and just hovered in the same place .  i started flashing my small led flashlight at it i would flash 3 times and it would flash back 3 times my son had his sony tabblet s and took pictures of them if you need them thank you",
      "link": "http://www.nuforc.org/webreports/092/S92434.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd94",
      "summary": "Watched hovering multicolored UFO for 2 hours.  ((NUFORC Note:  Probable sighting of Arcturus.  PD))",
      "city": "dayton",
      "shape": "other",
      "date": "2012-08-05T00:00:00",
      "story": "Watched hovering multicolored UFO for 2 hours On the night of 07-16-012 at ~ 11:05pm we watched a UFO hovering high in the western sky.  The same UFO reported on the morning of the 17th.  Same shape and same colors.  It did nothing else but hover while slowly descending toward the north and the top of the tree line to the west of us.  There is just hovered around the top of the tree line.  We quit watching it around 1:05 am.",
      "link": "http://www.nuforc.org/webreports/091/S91142.html",
      "state": "",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3be091",
      "summary": "Yellowish/orange spheres seen by 4 people in Dayton, Ohio.",
      "city": "dayton",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Yellowish/orange spheres seen by 4 people in Dayton, Ohio. On the evening of 28 July 2012 at approximately 2140 eastern time, observed 14 sphere/ball shaped UFO’s traveling west to east in the southern sky of Dayton/Kettering, Ohio.  They were traveling across the sky, one after the other.   They all seemed to travel the same flight path but were somewhat sporadic in timing and distance.  A couple of times two would be in real close proximity to each other, one a little bit higher than the other.  Each sphere looked like a combination of white, red and yellow, which in turn gave them an overall look of an orange glow as they moved across the sky.  A couple of them were a little more red in color.  Two of the spheres seemed to drop something that looked like a burning ember off the bottom of them which slowly disappeared as they were falling.  Eventually all the spheres would turn more to the south and disappear once they reached the western area of the sighting.",
      "link": "http://www.nuforc.org/webreports/091/S91262.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be9a6",
      "summary": "A bright white light disappearing  and reappearing in the sky which then descended straight down out of sight.",
      "city": "dayton",
      "shape": "circle",
      "date": "2012-04-18T00:00:00",
      "story": "A bright white light disappearing  and reappearing in the sky which then descended straight down out of sight I am a trained surgical technican however; I am working as the accountant for our privately owned business. Where I am located:  Northeastern corner of Armstrong Co., PA, U.S.A. / sun rises at 90 degrees East of North, from our rural home. Area of sky where light was seen:  40 to 45 degrees East of North / from where I stood the object was at an angle of 35 to 45 degrees upward. Description:  There was a very bright white light, roughly the size and brightness of the 'Arcturus' star (maybe a bit larger and brighter), to the naked eye, above the tree line.  My thought was, \"I do not remember seeing a star or planet in that part of the sky, that bright, this week.\"   Just as I had said that to myself, the light disappeared.  Seconds later, the light reappeared, seeing it through the leafless trees and again it disappeared.  A few seconds later, it reappeared a bit lower and more to the east.  At that point, I watched it slowly descend straight down until I could no longer see it, due to the hillside.  It was not as bright when it was in the tree line however, never changed size. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We spoke via telephone with this witness, and she sounded to us to be quite well-spoken and objective in her description of the lights.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88389.html",
      "state": "PA",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bec03",
      "summary": "Large peanut/dumbell shaped craft seen over Dayton OH.",
      "city": "dayton",
      "shape": "other",
      "date": "2013-08-30T00:00:00",
      "story": "large peanut/dumbell shaped craft seen over dayton OH. I had seen this craft  last a few times between last spring and early last summer large white dumbbell/peanut shaped craft appeared to be white in color.   Seen during the day each time I managed to capture a picture on my phone if you zoom in on the pic you can see the shape of craft ,  I had looked online for similar sighting but found no other sightings of a similar object in Ohio .",
      "link": "http://www.nuforc.org/webreports/100/S100697.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed90",
      "summary": "Orange orb of light making no sound observed by two individuals",
      "city": "dayton",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Orange orb of light making no sound observed by two individuals On the night of July 28th, 2013, my husband and I were sitting in the driveway on lawn chairs watching the Aquarid meteor shower.   There were a few clouds to the southeast, but it was relatively clear across the rest of the sky.  There was a light breeze and no moon, and it was quite cool for the time of year.  We hadn’t been out long when I asked my husband where the binoculars were, which he said he would get them.  I spent a few moments looking at Mars and Saturn and a few deep sky objects.  Shortly after 10 PM I decided to put the binoculars back in the garage, and just as I turned toward the door I noticed a bright orange ball of light coming up over the southern horizon traveling east.  I pointed it out to my husband and asked what it was.  At first my mind tried to make sense of the sight, thinking it was a helicopter or plane on fire, but it made no sound at all.  After a moment I realized the binoculars were still around my neck, and I looked at the! object, seeing only a perfectly round ball of deep orange light.  The color flickered like a flame into different shades of orange, but it remained constantly lit.  It never blinked or made any sort of pattern.  It was hard to judge how big or how far away it was, but it was slow-moving and appeared to be low in the sky, its path a relatively straight line.  I handed the binoculars over to my husband and ran into the house hoping to get my camera ready, but by the time I made it back it had disappeared.  It just “faded out” as my husband described it, and he wondered if maybe it just disappeared behind the clouds, so we went up into the yard hoping to see it again, but we never did. I have been stargazing since I was a child, and I know what jets, helicopters, satellites, and meteors look like in the night sky, and this was none of those things.",
      "link": "http://www.nuforc.org/webreports/100/S100613.html",
      "state": "PA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bee91",
      "summary": "Very large white saucer, chased by B-52 near Wright Patterson Air force base.",
      "city": "dayton",
      "shape": "disk",
      "date": "",
      "story": "Very large white saucer, chased by B-52 near Wright Patterson Air force base. UFO REPORTING DOCUMENT  First, I was informed of your website by an older broadcast of Coast to Coast. Now this event happens many years ago, but I believe it is still note worthy. Now this was my first encounter but not my last. I had two more sightings about 10 and then 12 years later. But that is another story. Now a brief background on location and time frame.  Now the sighting.  It took place in late January or early February of 1968-or 1969.  I had just received a telescope for my birthday (01/18).  I don’t remember if it was my 12th or 13th birthday.  But at that time I had know knowledge of UFOS, and this memory has been burned into my brain for over 45 years.  You already know that I live in Dayton, Ohio.  At that time my house was as the crow flies about 5 miles from Wright Patterson Air force base.  Now this was the time when Wright Pat was still a SAC base.  We had B-52s Fly over the house every day.  It was there approach pattern for landing.  Sometimes so close off the deck you could see the rivets on the plane. The sighting took place between 11 pm and 1:00 am.  My friend and I were out in the backyard with my new Telescope.   Directly due east there was a very large, almost pure white saucer-shape craft.  It was hovering on the horizon at just above tree top level. That would place just east south East of Wright Pat.  It was moving very slowly, heading South East.  Now it was big, hard to judge size, but at least as long as a football field maybe bigger. It was as bright as the brightest full moon you have every seen.  Except three very light gray porthole looking discoloration marks on the bottom.  These were evenly spaced.  Now here is the kicker. Just as we saw this object, a B-52 comes flying over the house with its landing gears down.  It is on final approach, most likely not more than 1000 feet or so off the deck.  It just clears the house, landing gears go up and it powers up.  Let me tell you know it when a B-52 starts to accelerate.  Now there approach pattern was at a North East heading.  This B-52 banked hard and tried to get up behind the craft.  I don’t know how close it got maybe a mile or two.  The B-52 is behind the craft just as it disappears behind some trees.  We run down to the corner of the block, it appears the B-52 is closing! than ZIP the craft went almost straight up and out of sight in about 2 seconds. B-52 fly’s around for 15-20 Minutes.  Then it is gone from sight.  The next day in the Journal Herald news paper there was a small paragraph saying about 200 people reported an unidentified object in the sky.  I have never been able to find this report going over micro film.  But it is hard if you can’t nail down at least a pacific week or so. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98374.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beec6",
      "summary": "Dozens of oranges fireball like objects flying silently, disappearing, then reappearing, they just kept coming over the horizon, flying",
      "city": "dayton",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Dozens of oranges fireball like objects flying silently, disappearing, then reappearing, they just kept coming over the horizon, flying slowly together.",
      "link": "http://www.nuforc.org/webreports/100/S100763.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beed9",
      "summary": "Shape changing fireball that hovered close to the ground an flew off with incredible speed",
      "city": "dayton",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Shape changing fireball that hovered close to the ground an flew off with incredible speed.",
      "link": "http://www.nuforc.org/webreports/100/S100759.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bef58",
      "summary": "I was driving to work for to differents days Monday 8/5/13 - 8/7/13  days when I see this sphere with orange color without any move I m",
      "city": "dayton",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "I was driving to work for two differents days Monday 8/5/13 - 8/7/13 days when I see this sphere with orange color without any move I mean total static and  really low from the sky I hope a lot more people should see this",
      "link": "http://www.nuforc.org/webreports/101/S101109.html",
      "state": "OH",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf05d",
      "summary": "Saw a shooting star but this object was bigger and brighter.",
      "city": "dayton",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "Saw a shooting star but this object was bigger and brighter. While traveling north bound on the New Jersey Turnpike saw what i thought was a shooting star but this object was bigger and brighter. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96744.html",
      "state": "NJ",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf11d",
      "summary": "There were aircraft in the vicinity, aircraft chasing the object ",
      "city": "dayton",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "There were aircraft in the vicinity, aircraft chasing the object  Dash of fire in sky.  Then what appeared to be a star that was moving. After words an airplane seemed to follow the same direction of the u.f.o.",
      "link": "http://www.nuforc.org/webreports/096/S96914.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf27c",
      "summary": "Two faint blue spheres flying opposite of each other in high altitude.",
      "city": "dayton",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "Two faint blue spheres flying opposite of each other in high altitude. There were 8 witnesses on our farm. Very high up in altitude there were 2 sphere like ufos slowly flying opposite of each other. Around 4 minute duration for both aircraft. The aircraft tend to mimick faint blue stars. And slowly as they appear, they fade into the darkness of space.",
      "link": "http://www.nuforc.org/webreports/101/S101010.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bffcc",
      "summary": "Sphere shaped object with colors moving at a abnormal rate of speed.",
      "city": "dayton",
      "shape": "sphere",
      "date": "2013-06-02T00:00:00",
      "story": "Sphere shaped object with colors moving at a abnormal rate of speed. My friend was driving, I was in the passenger seat driving on I-75 heading south from Dayton to Cincinnati.  It was dark outside and we had been driving on I-75 from Dayton for about 10-15 minutes when my friend driving looked up and said what the hell is that!   I immediately looked up and saw a sphere shaped object that seemed to be changing color or rotating with differently red and blue colors on the object right above us.  The object appeared small at first but then got slightly larger (seemingly lowering its altitude).   I followed the object as it moved past the freeway heading Northward off I-75.  I followed it off the freeway and the object appeared to have a faint white light behind it.  It was fairly close to us still as it moved away and then, within 20 seconds went very fast away going very high upward until it was no longer visible.   While it was over the freeway, it seemed to be hovering or staying in place for a second.  As it went away it moved at a very very high rate of speed and climbed vertically. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98199.html",
      "state": "OH",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bffe7",
      "summary": "Orange glowing orb",
      "city": "dayton",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "It was around 1AM the 26th of June.  I was out late doing laundry at the local laundromat.   While I was waiting I went outside to have a seat on a little bench in the front of the place facing a large grocery store parking lot.  I looked up and noticed a orange glowing orb in the sky.  I thought at first it may have been the moon but it was very bright orange and seemed to be giving off a haze like a fireball but it was behind a cloud.  I was really shocked so after staring at it for about a minute a looked away to get my boyfriend so he could confirm it but by the time I got him outside it was gone.   It should be noted this was in south Dayton near Miamisburg.",
      "link": "http://www.nuforc.org/webreports/098/S98980.html",
      "state": "OH",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0024",
      "summary": "Orange and white orb shaped object north of Dayton Washington.",
      "city": "dayton",
      "shape": "circle",
      "date": "2013-09-09T00:00:00",
      "story": "Orange and white orb shaped object north of Dayton Washington. Saturday, September 07, 2013   The object was seen to the north of Dayton Washington over some of the hills. It was an orange light with a white center.  It was a singular object to our knowledge. It moved in a loop de loop very quickly and went over the hill.  Over the period of a half hour beginning at 9:00pm it was seen several more times coming back over the hill, moving through trees, and then back to the north side of the hill. The people involved with the sighting are 30 and 31, the 30 year old is a female, and the 31 year old is male. We were simply talking in her living room while her front door was open when we saw the object. I the male responded first by telling her I just saw a UFO.  Then as before stated, we saw the object several times over the next half hour.",
      "link": "http://www.nuforc.org/webreports/102/S102027.html",
      "state": "WA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c00de",
      "summary": "I was on the phone with my aunt looking north over the top of tress and house tops going Wt toward the grad school was a saucer shape.",
      "city": "dayton",
      "shape": "disk",
      "date": "",
      "story": "I was on the phone with my aunt looking north over the top of tress and house tops going west toward the grad school was a saucer shape in the sky there were lights on red, blue and white they were plinking not rotating then slowly went behind the school,  I ran out the back door and jump two fence and ran up to the back of the school wall before going all the way around to see it something happen to me I was unable to goto the back of the school, it was like something was tell me just stop.   At the time I was 13 or 14 it was 1963 or 1964.  We live about 15-20 mil from Dayton, Ohio, the county is Montgomery, Wright Pat ((AFB)) is about 25 mils from that.the ship was about 3 house long.   Thanks ((name deleted)) ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96928.html",
      "state": "OH",
      "duration": "1-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c02b3",
      "summary": "Formation of at least 9 flying vessels flying a unique precise pattern and flight path. Circular/Crown Shaped.",
      "city": "dayton",
      "shape": "formation",
      "date": "2012-12-20T00:00:00",
      "story": "Formation of at least 9 flying vessels flying a unique precise pattern and flight path. Circular/Crown Shaped Last Saturday about 6:50pm (1 December 2012) I was leaving home heading to a local store to get in a few lottery tickets.  No sooner than I had came outside to get into my car.  I looked up into the sky as I noticed a light being emitted from some type of flying craft.  I was thinking that one seems a bit unusual as it turned and went out of view. I thought to myself, I wish I had my digital camcorder or something.  I felt as though I had missed a chance to obtain a nice shot of a UFO. Just as I got ready to get into my car, I noticed three more of these objects, first there was one, then two, then three.  I paused for a moment took out my cell phone and captured a still photo image of the vessels. I was able to capture all three in the frame of my cell phone.  As they went out of sight I got into my car backed out of the drive way made an almost immediate right turn and headed straight down the street. I noticed there appeared to be more objects approaching.  They also went as far as the others and turned into a right bank and out of view.  By this time I was wondering if more were coming as I had already see at least four. I slowed down my car reaching for my cell phone again and started taking photographic images.  I pulled over and stopped on the right hand side of the road. I managed to capture a couple more still images.  Then I slipped my phone (trail and error) into video mode and managed to capture even more evidence of this rare event. The first video displays an object approaching as if it is coming up out of a cloud and it makes me wonder if there was a mother ship over top of the cloud and obscured from sight.  In the first video it is so short that you can barely see the lead UFO moving.  However, I filmed a second video which was about 52 seconds long.  This video clearly shows at least three of the objects coming from the same direction and approaching my direction but off to the left (drivers side of the vehicle). I was able to capture some of the objects approaching and observed them flying the same pattern in the same formation as the rest. All of the objects that I could clearly see, looked the same. The bottom was a bright fiery color and was circular. Now that I think about it, it reminds me of a crown. The top portion of the vehicles was darkened into the night sky and they were all seemed to be hollow at the bottom and with an intense uniform fiery glow. These vessels seemed like their power source was centered at the bottom of the crafts and circular. In the first still image that I captured you can see a portion of what I described as crowned.  I did not note any navigation signaling lights and this is clearly displayed in the video I was able to capture. I did not bother to call the authorities or the local Air Base as I have already been there and done that years ago. I figure they are not going to tell me anything, at least not at this time. I would like to state that I would love to be working for the Government in this line of work. I do have experience as a Police Officer and was called to a UFO seen way back in 1983. This is the first time I have ever been able to capture UFO footage. I have lived around Military Installations my entire life and I have flown overseas three times. I see many aircraft around here and the all fly with navigation lights and these objects did not. I would estimate that there were about 9 - 12 uniform objects that were involved and in plain view. It is like they just rolled in and the airspace and sector was all theirs. I was so busy focusing on the UFOs and trying to obtain photographic evidence, that I didn't even pay much attention to the normal aircraft in the area.",
      "link": "http://www.nuforc.org/webreports/095/S95004.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c02b4",
      "summary": "9-12 objects in apparent  formation black and firey orange circular on bottom/photos and video captured",
      "city": "dayton",
      "shape": "formation",
      "date": "2012-12-20T00:00:00",
      "story": "9-12 objects in apparent  formation black and firey orange circular on bottom/photos and video captured Last Saturday night (1 December 2012) shortly before 7:00pm, I was leaving home to go to a local store on Valley Street to purchase some cigarettes and play a few lottery numbers.  This store is located in Dayton / Riverside Ohio, and very close to Wright Patterson Air Force Base.  Dad is currently buried at the local VAMC and is retired Air Force. When I stepped outside and was going to get into my car, I noticed a strange object flying overhead and breaking into a turning pattern to the right and upwards movement.  I thought to myself how odd and I wish I had my digital camera. I thought oh well, it is gone and I missed my chance to get it on tape.  No sooner than that happened and I was getting into my car, I noticed that there were three more of these flying vessels identical to the first. (All of these objects seem to have the same flight path / plan).  At this time I took out my cell phone to try and capture still images or video.  Oddly enough, I was able to capture a photo of three of the objects in one still frame photo. I thought to myself, oh well at least I got a still image photo and will look at it later.  I put down the phone and backed out of the drive-way, pulled forward and made an immediate right-turn and proceeded to travel down a street that I drive down everyday.  Oddly, enough I didn't get very far and I observed more of these strange looking vessels coming my way.  I slowed down to a stop on the right side of the roadway and started capturing what I could on my cell phone again.  This amounted to a few still images and a few short segments of video. Once the last one went by, I called my mother on my cell phone and told her to go outside and look up to see if she saw a UFO.  She did, but was unable to see anything.  She stated that it was cloudy outside.  From experience I know these objects do become obscure by clouds sometimes.  Even in the video footage that I was able to capture, clouds can be observed in the night sky.  Another strange thing is that there seems to be a moon like glow coming from over top of the clouds.  Therefore, it is possible that there could have been an obscure mother ship in the vicinity. I could tell these UFOs were not regular jets as the lighting was different looking.  There were no airplane lights mounted on them blinking at all.  There is always aircraft in this area and you will see their lights twinkle when flying over-head, or off in the distance. NOTE: The objects were dark on the top and firey orange and circular on the bottom.  The power source seemed to be coming from the bottom area and you could look up into it and observe a circular pattern.  The objects appeared to be some type of circular shape.  It is so astonishing to look at something for such a brief period of time and try to rationalize what you are looking at.  I am so use to the after-burn being on the back-end of a flying vessel that it was very puzzling. Strangely enough during this event I did note other regular jets flying at much higher altitudes but off to the far right and left sides of these vessels.  When I think about it all, it makes since that they would break off.  This is a populated area and I think it would be very bad to intercept or try to intercept these objects over our cities, unless we had no choice. This is just my opinion and is based on what I observed.  I can't say what the military or civil agencies had up and flying in the area during this time.  I did not contact anyone at Wright Patterson Air Force Base, been there done that.  I have been involved with UFO Research off and on since 1983.  This is the first time in all those years that I have been able to capture photographic images. I did some brief internet searches utilizing key words pertaining to what I witnessed and the first search turned up positive and interesting results.  I am submitting this report to various UFO Agencies within the USA as they are trained in working with the Public and private citizens in this field of research. I am a US Veteran and if called upon to work with the Government, I would gladly do so and assist in anyway I could.",
      "link": "http://www.nuforc.org/webreports/094/S94982.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a07",
      "summary": "Helicopters flying over dayton.  Started about 12:00am to 7:00 am.  Could not see the type but they were very loud like military.",
      "city": "dayton",
      "shape": "",
      "date": "2014-01-10T00:00:00",
      "story": "Helicopters flying over dayton.  Started about 12:00am to 7:00 am.  Could not see the type but they were very loud like military Trotwood ohio. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105769.html",
      "state": "OH",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0aff",
      "summary": "Formation of 12-15 orange-red lights moving silently over northeast Dayton, OH.  Appeared below a ragged cloud deck.",
      "city": "dayton",
      "shape": "formation",
      "date": "2014-01-10T00:00:00",
      "story": "Formation of 12-15 orange-red lights moving silently over northeast Dayton, OH.  Appeared below a ragged cloud deck. We live in the northeast portion of Dayton, OH and on the evening of 31 Dec 13, I went to take out the trash at 10:00PM and noticed a line of lights moving fairly low over our neighborhood and my property.  We had a broken cloud deck at between 1000-1500 feet and these lights were clearly visible so they were below the clouds.  There was a ragged string of lights, 12-15 in total, bright orange-red, in a ragged line moving from S-SW to N-NW, TOTALLY SILENT when they went over our house, so I know they weren't powered aircraft or helicopters.  Balloons?  Hardly - they moved too fast.   The group of lights at the head of the line seemed to stop and some of the followers caught up and then the line began to fade out.  The last lights in line were over our house and you could see that they were  climbing up in altitude into the cloud deck.  Total time was on the order of five minutes.  I called my wife to come out and take a look; she saw them and went back into t! he house to get her camera, but she couldn't get any shots of them - just points of light to the camera optics.  First time I've ever seen anything like this and I know what I didn't see - no airplane, no helicopter, no balloon.  I’ve got several degrees, my first is a degree in aerospace engineering and I’m also a retired Air Force pilot, so I think I should be a credible witness.",
      "link": "http://www.nuforc.org/webreports/105/S105822.html",
      "state": "OH",
      "duration": "6"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fde",
      "summary": "Saw two UFO's circle plane while watching northern lights.",
      "city": "dayton",
      "shape": "unknown",
      "date": "2013-11-20T00:00:00",
      "story": "Saw two UFO's circle plane while watching northern lights Was watching northern lights (very faint) and was saw what looked like a plane flying high, it had blinking lights so assuming it was a plane. Then saw two bright lights race toward the plane and circle it couple times then slowly go back to where they were.   Prior to them moving thought these two lights looked like bright stars, but now believe they were UFO. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104574.html",
      "state": "MT",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c166f",
      "summary": "White/blue sphere maneuvering around commerical aircraft.",
      "city": "dayton",
      "shape": "sphere",
      "date": "2013-10-23T00:00:00",
      "story": "White/ blue sphere maneuvering around commerical aircraft. Saw a large white/blue sphere the size of a star moving close to commercia l aircraft.   The pilot and its passengers had to have seen this giant sphere.   I could tell once the pilot spotted the ufo it tended to pick up speed.   Then after that it, the sphere disappeared completely. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103352.html",
      "state": "OH",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ab0",
      "summary": "Orange red disk that turned to a orb.",
      "city": "dayton",
      "shape": "disk",
      "date": "2014-07-26T00:00:00",
      "story": "Orange red disk that turned to a orb. I was outside smoking looked up and there was a orange disk floating there.  out the corner of my mine i could see a black aircraft flying in at a high rate of speed.  the orange disk orb out shot straight up and disappeared",
      "link": "http://www.nuforc.org/webreports/111/S111748.html",
      "state": "OH",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2095",
      "summary": "star shaped aircraft that decended across I-35 then vanished completely.",
      "city": "dayton",
      "shape": "light",
      "date": "2014-04-24T00:00:00",
      "story": "Star shaped aircraft that decended across I-35 then vanished completely. Had a fire going outside around 9:30 pm, happen to see a bright light near I-35 southwest of Dayton, OH. Lasted about 40 seconds then just vanished completely. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108740.html",
      "state": "OH",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2398",
      "summary": "UFO near Air Force Base.",
      "city": "dayton",
      "shape": "light",
      "date": "2014-04-04T00:00:00",
      "story": "UFO near Air Force Base. On Monday march 31, 2014 in Dayton, Ohio, my wife and I were cooking out in our back yard on a very clear night.  We were both sitting at our table in the back yard when all the sudden a very bright orange light moving very fast with what looked like bluish streaking light coming out of the back of it appeared in plain sight and stopped suddenly. The craft was very close to the ground, I'd say about 500 feet and maybe 5 miles from us.  At first I thought it was a meteor or large shooting star but when it hovered for about three to five minuets I knew I was looking at something out of the ordinary.  We live very close to Wright Patterson Air Force Base so I thought maybe they were doing something like they do, secret, ya know?  But as my wife and I watched it fly away rather slow, I noticed there was no Air traffic in the sky at all.  We took a video of this and watched it twice but, then the video just corrupted itself.   We then noticed Jets taking off from the Air Force Base (two that we seen) as the craft dissipated into the distance going from South West to North.  The Jets we witnessed turned their lights off at what seemed to me to be about 500-1000ft First Jet turned off its lights, then jet #2 did the same. I called 911 to make a report but they did not take me seriously.  I've never believed  in Flying Saucers of believed in UFO sightings but, what my wife and I seen on March 31, 2014, was real.  It was not a fleeting glimpse of something strange.   We seen something very much unexplainable and I think what ever it was, it spooked the Air Force Base by our house!",
      "link": "http://www.nuforc.org/webreports/108/S108286.html",
      "state": "OH",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b15",
      "summary": "Diamond shape with tail of lights and triangle ufo.",
      "city": "dayton",
      "shape": "triangle",
      "date": "2014-11-26T00:00:00",
      "story": "Diamond shape with tail of lights and triangle ufo. One was diamond shaped with a tail sort of changed colors and faded in and out.  There was also a triangle ufo pretty big could only see the lights on the outside of it.  There were about 6 lights on it.",
      "link": "http://www.nuforc.org/webreports/115/S115607.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d4d",
      "summary": "Strange object with bright lights flying and hovering over Harrison Twp in Dayton.",
      "city": "dayton",
      "shape": "sphere",
      "date": "2014-09-05T00:00:00",
      "story": "Strange object with bright lights flying and hovering over Harrison Twp in Dayton Saw an orbital sphere traveling at a fast rate of speed going northwest and slowed to a hover below the clouds.  It was illuminated with red, green and blue flashing lights.  It moved quickly and hovered, appeared to be lowering and then moved to the east and disappeared past our view in tree line.   The object didn't appear to make any sounds.   We did take a short video of part of the even, but the video only caught the last minutes of the event, as we didn't have a cell phone nearby and watched from backyard Jacuzzi before we got out and went inside to grab a phone and go out front to video.",
      "link": "http://www.nuforc.org/webreports/113/S113139.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d4e",
      "summary": "Bright fireball/ord seen over house.",
      "city": "dayton",
      "shape": "fireball",
      "date": "2014-09-05T00:00:00",
      "story": "Bright fireball/ord seen over house. I walked out on my front porch saw saw a bright light reflecting from my blk truck I looked up and saw a bright fireball in the sky really close yelled for my girlfriend we watched it fly north until out of sight.  Lasted about 5 min… ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113116.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e02",
      "summary": "Lights moving nfl in sky.",
      "city": "dayton",
      "shape": "unknown",
      "date": "2014-08-29T00:00:00",
      "story": "Lights moving nfl in sky. I was getting ready to leave for work and was getting something from my boat to take to work with me.   I caught a red/green/white strobing light moving into my view from the east it stopped at a point over my view in the horizon.  I tried to get a recording of it with my phone but that didn't work.   I did get my video camera from the house and was able to record a limited amount of time because the camera wasn't charged.  I woke up other family members to witness it but it never moved for them.  I continued to watch it for an hour an half",
      "link": "http://www.nuforc.org/webreports/112/S112855.html",
      "state": "MO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c3012",
      "summary": "Light formation in sky.",
      "city": "dayton",
      "shape": "formation",
      "date": "2014-08-31T00:00:00",
      "story": "Light formation in sky. \tCluster of five white lights, after a few seconds, two disappeared.  They reappeared a few seconds later.  All 5 were there briefly again, then they disappeared altogether.",
      "link": "http://www.nuforc.org/webreports/113/S113069.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3688",
      "summary": "Two red/orange spheres.",
      "city": "dayton",
      "shape": "sphere",
      "date": "2015-02-12T00:00:00",
      "story": "Two red/orange spheres. Witnessed two orange red spheres (solid emitting light) (both had no blinking lights) west on US-35.  Were gliding in the air, emitting no sound.   Both appeared out of the sky and traveled opposite of each other.  Lasted for about 5 minutes.   There was a commercial airplane coming from the Dayton International Airport that had to have witnessed one of the orange spheres.   Both spheres faded into the dark. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117244.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b65",
      "summary": "We saw six circular orange in color objects. The objects would go in different directions and then disappear.",
      "city": "dayton",
      "shape": "circle",
      "date": "2015-07-23T00:00:00",
      "story": "We saw six circular orange in color objects.  The objects would go in different directions and then disappear.",
      "link": "http://www.nuforc.org/webreports/120/S120562.html",
      "state": "OH",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4051",
      "summary": "I was at a traffic light, when we saw a triangle shaped craft fly across the sky above us, then it changed direction. There was no soun",
      "city": "dayton",
      "shape": "triangle",
      "date": "2015-05-22T00:00:00",
      "story": "I was at a traffic light, when we saw a triangle shaped craft fly across the sky above us, then it changed direction.  There was no sound coming from it.  The front of the craft had big bright white and red interchanging lights, and the bottom had three blue round blinking lights that were circular in shape (one on each corner of the triangle).  We tried to get photos, but the craft took off really fast.  We followed it until it disappeared.  About 40 minutes later, on the way home, we saw it again.  I stopped, and this time it hovered over us for about 30 seconds, and took off in the opposite direction.",
      "link": "http://www.nuforc.org/webreports/119/S119062.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4195",
      "summary": "Fireball/yellow/orange \"dancing figure\" hovering, ascending, descending, (slightly); NEAR WPAFB.",
      "city": "dayton",
      "shape": "fireball",
      "date": "2015-04-30T00:00:00",
      "story": "Fireball/yellow/orange \"dancing figure\" hovering, ascending, descending, (slightly); NEAR WPAFB. I have not posted this until 04/27/15.  The reason being, I like to investigate with nothing less than pure skepticism of my own eyes/thoughts, and try to as thorough as possible before I make a claim as something being unexplainable or being a \"UFO\". 2:30am, I see this yellow/orange, orb/ball of light floating fairly low on the night sky.  I was thinking Jupiter, which I know was visible this night (Venus as well).  I did all the research I could, pictures, astronomical star/planet arrangements for given time and date.  The research kept leading me to convince myself that it was indeed Jupiter.  My gut was saying otherwise.  This object was relatively large compared to any star or planet ive ever observed with the naked eye.  Within the first few moments of observation I had to keep refocusing on this object.  It appeared at times humanoid in figure (arms, torso, head), \"divine\" dancing light if you would.  Other times not so much, I rode it off as deceived perception.  Then I kept seeing a flash of light over the right shoulder of the object and this too, rode off as a plane heading to the airport.  Then I saw the flash again, and again, and again.  That's when it really didn't feel natural.  Even if the flash of light was a satellite in fixed position, why was it fixed, was it keeping an eye on this thing?  At the least it was only a satellite interested in this object as well, if not it was from the object itself, either way I don't know.   I know that it aroused me enough to call up a friend near by to check it out as well.  Unfortunately I don't have a camera phone/camera but I did sketch it on the computer with paint.",
      "link": "http://www.nuforc.org/webreports/118/S118662.html",
      "state": "OH",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c44c0",
      "summary": "Baseball size yellow ball of light right outside my window, dancing, then rapidly shot into night sky.",
      "city": "dayton",
      "shape": "circle",
      "date": "2015-11-06T00:00:00",
      "story": "Baseball size yellow ball of light right outside my window, dancing, then rapidly shot into night sky. I was approximately  7 years old at the time, but I remember as vividly as if it were today. I was  looking out my bedroom window, which had a large field across the road.  Directly outside of my window (within a foot of my eyesight), I saw a yellow round circle roughly the size of a baseball.  It was spinning/bouncing  around in circles, made no noise, and did not seem to be bothered by me watching it.  I had no fear, and remained calm.    After about 3 or 4 minutes of my watching/observing, it took off into the field across the street from my house (100 ft) and continued the erratic movement from left to right, up and down, and then it rapidly darted into the sky and disappeared within a split second!  And I did not see it anymore after that.  Craziest thing is ever experienced.",
      "link": "http://www.nuforc.org/webreports/123/S123401.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c45e2",
      "summary": "I was driving southbound on interstate 75 headed to work in Dayton, Ohio at 1805 hrs..",
      "city": "dayton",
      "shape": "circle",
      "date": "2015-11-26T00:00:00",
      "story": "I was driving southbound on interstate 75 headed to work in Dayton, Ohio, at 1805 hrs.. I was in the Troy, Ohio, area (mile marker 78) when I observed a greenish blue light crossing the sky from the north west falling downwards towards the south east horizon. From first sight until it disappeared was approximately 5-6 seconds. I have seen numerous shooting stars (enjoy watching meteor showers).  Those I have seen are visible for maybe a second, many with a tail behind them.  Although the light made a rapid descent into the horizon, it was not at a split second speed common to seeing a “shooting star” and its bright solid blue green, almost neon color was also not typical. I am not sure what this was but it was too slow for a meteor (at least I think so) but far too fast for conventional aircraft. This is the second time in my 60 years of life I have felt the need to report anything in the sky.  The last time was in the 80s when I, along with dozens of other individuals saw a ball of fire streak across the sky in Virginia.  Originally I thought it was a plane crashing on fire but it ended up being a meteor.",
      "link": "http://www.nuforc.org/webreports/124/S124275.html",
      "state": "OH",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c48a2",
      "summary": "Four large circular lights rotating at high speed above cloud cover for over 50 minutes.",
      "city": "dayton",
      "shape": "circle",
      "date": "2015-10-29T00:00:00",
      "story": "Four large circular lights rotating at high speed above cloud cover for over 50 minutes. At approximately 7:10, I noticed four hazy circular lights that appeared to be above the cloud cover.  They were directly over our property or slightly north.  They formed one light, and then it split into four lights diverging from the center light to form a large circular motion.  Each of the four lights rotated counter-clockwise about ¼ of the circular pattern at high speed.  Then the four lights merged into one light again.  They continued to follow this pattern. I immediately called my wife out to observe.  The pattern barely moved northeast in the ten minutes we were observing.  As of 7:45, the lights continue. Holding my thumb at arms length, they appeared to be about the size of a quarter.  There are no beams originating from the ground as you would expect from searchlights.  I tried to video, but nothing showed up.",
      "link": "http://www.nuforc.org/webreports/123/S123107.html",
      "state": "MD",
      "duration": "continuing at 19:45"
    },
    {
      "_id": "64d005f478aba2ec5a3c48a7",
      "summary": "6-8 glowing objects in the sky disappear after 5 minutes.",
      "city": "dayton",
      "shape": "light",
      "date": "2015-10-29T00:00:00",
      "story": "6-8 glowing objects in the sky disappear after 5 minutes. About 6-8 glowing reddish-orange lights floating in the sky looking East from Linden Ave and Woodman Dr.  They moved across the night sky and then fizzled out after about 5 minutes from first noticing them.",
      "link": "http://www.nuforc.org/webreports/123/S123157.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4bc5",
      "summary": "V-type boomerang-shaped ufo, with red lights.",
      "city": "dayton",
      "shape": "triangle",
      "date": "2015-10-02T00:00:00",
      "story": "V-type boomerang-shaped ufo, with red lights. Outside looking at moon then a triangle almost boomerang shaped object flew by with dim red lights across it.  Was almost invisible moved at a high rate of speed and turned sharply.  Rather low flying. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122471.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d75",
      "summary": "Constellation of moving bright lights high in the sky.",
      "city": "dayton",
      "shape": "light",
      "date": "2015-09-02T00:00:00",
      "story": "Constellation of moving bright lights high in the sky. ((NUFORC Note:  Witness elects to provide no contact information.  We do not know the duration of the sighting, and cannot contact the source, in order to confirm that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121560.html",
      "state": "OH",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3c520c",
      "summary": "Diamond shaped ufo.",
      "city": "dayton",
      "shape": "diamond",
      "date": "2016-01-05T00:00:00",
      "story": "diamond shaped ufo One black or dark grey diamond shaped craft hovering less then 500 feet over a house off the main road.  It had lights on all sides, red and white.   Craft was visible nearly a mile away because of lights on the craft.   It was night and dark, but clear no clouds, good visibility",
      "link": "http://www.nuforc.org/webreports/124/S124924.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c52c3",
      "summary": "I saw a bright green, cigar-shaped object streak across the sky and veer off course.",
      "city": "dayton",
      "shape": "cigar",
      "date": "2016-01-20T00:00:00",
      "story": "I saw a bright green, cigar shaped object streak across the sky and veer off course. Was traveling east on highway 60 right outside of town.  Something caught my eye to my left.  I, at first, thought it could be a shooting star, but it was bright green and cigar-shaped.   It was going straight the seemed to veer off course.  It was very unusual not shall of light like a star would be. ((ADDENDUM FROM WITNESS--TEXT OF ORIGINAL REPORT)) Saw a cigar shaped, bright green light streak across the sky and veer from a straight path. Was traveling east on highway 60 right outside the city limits. I caught a glance of something I thought could be a shooting star but as I looked closer, it was bright green and cigar shaped not shall of light.  It also seemed to veer off a straight course, not like a star.  It also had a strong tail of the same color. It was very unusual. ()(END ADDENDUM)) ((ADDENDUM #2)) It was close so it appeared bigger than a star or planet in the night sky but not as big as a  full moon, I would say the size of a crescent moon would be my guess ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/125/S125273.html",
      "state": "TN",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c54ce",
      "summary": "Disc like Flying Saucer.",
      "city": "dayton",
      "shape": "disk",
      "date": "2015-12-17T00:00:00",
      "story": "I witnessed early in the morning a Disc like Flying Saucer hovering over the City of Dayton for 1 minute.  It materialized while I was taking a picture of the City and then it dematerialized.  Amazing!   I have photographic evidence I'll be uploading with this report.",
      "link": "http://www.nuforc.org/webreports/124/S124727.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b6e",
      "summary": "Blue/green light 1:49AM Dayton, OH circular",
      "city": "dayton",
      "shape": "light",
      "date": "2016-04-15T00:00:00",
      "story": "blue/green light 1:49AM Dayton, OH circular I am driving home from Columbus on 70-E headed towards 75-N and over the tree line to my right see a light reflect off the clouds. At first it looks like heat lightning, but instead of seeing a stark white bolt of lightning what proceeds from the clouds in a sharp blue/green light. It is radial up towards the sky. It is so specifically green and blue it takes my breath away. This is towards Fairborn/Huber Heights possibly the Wright Patterson Airforce Base? I try to send a text message to my friend and she receives EVERY text including my call but does NOT receive the text that is explicit in detail of the time and description of the light. REPEAT:  I sent a descriptive text of the time/shape/color of the light and she did not receive it both times but received every other text! I have never even heard of this site. I just googled \"blue green light in Dayton\" to see if anyone had seen anything or reported on it in the news and this site came up. I am terrified to see a similar entry back in August of 2015 in the exact same area at the same time. Will I be visited tonight? Very scared. I'm even afraid to leave my contact info because i don't trust this site. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126735.html",
      "state": "OH",
      "duration": "0.5 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c614c",
      "summary": "((HOAX??))  Boomerang style craft.  ((anonymous report))",
      "city": "dayton",
      "shape": "triangle",
      "date": "2016-09-30T00:00:00",
      "story": "Was outside sitting in a beach chair star gazing and huge boomerang style craft flew over.   It was greyish and had a very smooth shape to it.  The wing span was huge and flying at under 500ft.  Had no lights on it.  I've seen this thing twice the last month.  Didn't make a sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130301.html",
      "state": "TX",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c631c",
      "summary": "A large orange glowing Fireball seem to proceed in an orderly fashion headed from west to east for about one and a half minutes.  It co",
      "city": "dayton",
      "shape": "other",
      "date": "2016-09-15T00:00:00",
      "story": "A large orange glowing Fireball seem to proceed in an orderly fashion headed from west to east for about one and a half minutes.  It continued East without losing intensity or speed.",
      "link": "http://www.nuforc.org/webreports/129/S129898.html",
      "state": "OH",
      "duration": "30-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c63a8",
      "summary": "Lights on some sort of craft seen in the western sky from behind Submarine House",
      "city": "dayton",
      "shape": "other",
      "date": "2016-09-09T00:00:00",
      "story": "Lights on some sort of craft seen in the western sky from behind Submarine House I was on a smoke break behind Submarine House on Brown St. when up over the western horizon at a pretty high altitude, I saw three lights, positioned right next to one another, I could easily see something connecting all three, and the largest light was positioned in the middle. They were moving in an eastward direction. I watched them for about 30 seconds, assumed it was a plane that was too far for me to see the blinking lights on the wings and/or tail, and looked down at my phone to respond to a text. When I looked back up, the lights were gone. It was a very clear evening so they could not have gone behind a cloud, and the speed at which these lights were moving would've made it impossible for the lights to pass over my head in the few seconds I was looking at my phone.",
      "link": "http://www.nuforc.org/webreports/129/S129805.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c645b",
      "summary": "This is the recollection of my father, who is 92 years old and lives in an assisted living facility outside Washington DC.",
      "city": "dayton",
      "shape": "unknown",
      "date": "",
      "story": "This is the recollection of my father, who is 92 years old and lives in an assisted living facility outside Washington DC. Dad is a WW2 and Korean War Veteran and served in the Army Air Corps and U.S. Air Force. Dad was assigned to Wright-Patterson AFB after WW2. He has stated to me on several occasions that the recovered material from at least one extraterrestrial craft that crashed near Roswell in July 1947 (there apparently were at least two) was \"primarily an iron-aluminum alloy\". Dad stated that \"quite a lot\" of the crash debris from Roswell was transported to Wright-Paterson. He was assigned to a technical laboratory where research was done on metals, and he was not know what occurred elsewhere at Wright Patterson. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128681.html",
      "state": "OH",
      "duration": "Days"
    },
    {
      "_id": "64d005f478aba2ec5a3c7afb",
      "summary": "Dayton UFO, 5 lights, 3 white, 2 orange, low flying aircraft going low speed.",
      "city": "dayton",
      "shape": "triangle",
      "date": "2017-11-17T00:00:00",
      "story": "Dayton UFO, 5 lights, 3 white, 2 orange, low flying aircraft going low speed. There was a very low flying aircraft, probably around 600-700ft above the ground.  It was shaped like a boomerang with hard edges.  It was painted pitch black and had five lights.  Three white that were mounted on the far side of each aircraft, and one in the center that was blinking rapidly.  There was another two large orange lights mounted in the center of each wing.  It was moving very slowly, maybe 10MPH.  It was about 20 feet long and had a wingspan of about 50-60ft.  The object didn’t make any noise.",
      "link": "http://www.nuforc.org/webreports/137/S137268.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c84",
      "summary": "Apparently two round objects conjoined or one object comprised of two parts.",
      "city": "dayton",
      "shape": "sphere",
      "date": "2017-09-28T00:00:00",
      "story": "Apparently two round objects conjoined or one object comprised of two parts. This is going to be one of the more unremarkable sighting reported to you, but I felt it worthy of sharing just the same. On Sunday evening, 24 September, at about 8:30 PM, my wife and I were returning home from a restaurant when we observed an object in the sky traveling from approximately west, 15 degrees south toward the east, approximately 15 degrees north. The object appeared to be comprised of two white lights connected to one another and moving at a speed of approximately 5 arc degrees per second.  I have no idea as to its actual speed since I was unable to determine its altitude. What I am reasonably certain of is the object was not an aircraft since there were no blinking lights, no red or green lights marking the wing tips, just a solid white light. There were high clouds present in the sky and our view of the object was blocked as it moved over the clouds.  I would estimate the altitude of the clouds to be approximately 15,000 feet. The object emitted no audible sound as it passed us overhead. We did observe an aircraft to our east, moving from the south, approximately 15 degrees west, toward the north, approximately 15 degrees north, which is the direction we would surmise as an aircraft going from Atlanta, to New York City.  Given the aircraft we observed at the same time was likely traveling at ~30,000’, the object we observed also appeared to be moving at the same rate—5 arc degrees per second. My first inclination is to surmise the object we saw was the international space station, but I hadn’t heard any announcements of its presence in our area, which is the usual case on our local TV stations, but if it were the space station there is one curious matter remaining unsolved:  When the object we observed reached a point where it was some 30 degrees above the horizon, it was no longer visible to us.  It seems to have disappeared at that point. While I will not discount the possibility that the object was blocked by some clouds we could not see, or that it might have been blocked by some other atmospheric phenomenon, the fact that it disappeared from our view is what has prompted this communication. If you do think we were looking at the international space station, I would appreciate your letting us know. Thank you!",
      "link": "http://www.nuforc.org/webreports/136/S136374.html",
      "state": "TN",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c814f",
      "summary": "Saw a large bright red light decend from the sky.  It must have been large because it was pretty far away.  ((anonymous report))",
      "city": "dayton",
      "shape": "light",
      "date": "2018-03-02T00:00:00",
      "story": "Saw a large bright red light descend from the sky to the earth.  It must have been large because it was pretty far away landing in a heavily wooded reserved area.  Very strange. Never seen anything like it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138965.html",
      "state": "OH",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8200",
      "summary": "Shooting light.",
      "city": "dayton",
      "shape": "light",
      "date": "2018-01-18T00:00:00",
      "story": "Shooting light I saw a large white light.  For a moment I thought, shooting star, but quickly realized that there was no way.  First it was too large.  The large light was appeared to be about the size of an airplane high up.  Second the light was brilliant white, almost blue.  It was rather diamond shaped, with the light fading behind the back corner.  This ‘corner’ didn’t actually touch, but seemed to trail behind.  Inside these two trails was a small second light.  Easily 1/16 the size of the large light, maybe smaller.   As I drove North on Highway 321 from Dayton, I noticed this light shooting through the sky.  I saw it from the top of my windshield to maybe halfway down the windshields which point it vanished. I thought it had maybe gone behind a tree I couldn’t see in the dark.  But after driving further, there was no tree in the area.  The light moved fast.  When it went it did not fade or slowly disappear, it was just gone as if someone had turned off the switch.  I do not know ! what I saw.  But I know that I have never seen anything like it before.",
      "link": "http://www.nuforc.org/webreports/138/S138361.html",
      "state": "TX",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8917",
      "summary": "Near Dayton, OH, red-orange object in night sky",
      "city": "dayton",
      "shape": "circle",
      "date": "2019-02-22T00:00:00",
      "story": "Near Dayton OH red-orange object in night sky I'm nearly 40, with a doctorate degree and a former university-level research assistant to a professor of astrophysics. On this night, ny father was sitting outside on our back patio in the dark, only a porch light illuminating the area.  My mother and I were indoors, talking, sitting at the kitchen table. That room has windows which face north, one of which overlooks the back patio.  That window was partially open, as was at least one other. At approx. 9:48 pm EDT, my father shouted something unintelligible (to me) through the open window nearest the table where I sat inside the house.  My mom understood what he'd said, telling me of my father, \"He's demanding I come outside!\"  After that, I heard him as he continued yelling to my mom to come outside \"right now\" to see something. I will outside, instead, anticipating an announcement to the effect of, \"There's a skunk in our yard! (There is long precedent for this sort of statement).  I walked to the door, and as I crossed the patio toward my father, he pointed toward the sky (it being nearly entirely dark, this was not terribly useful and I did not even know he'd done until I saw a photo taken that night).  I asked where to look, and then he explained to me where to look in the sky:  toward the far northwest to the west side of a large tree in our backyard. Once I turned  to look in that direction, it was easy to see the object to which what he'd been referring.  It appeared to be quite large, utilizing nearby homes and trees as a point of reference, and was a vibrant, brightly-colored object which appeared nearly round in shape.  It seemed to glow, and that glow was quite intense, the entire object a uniformly-brilliant red-orange and lacked any discrepancy in intensity over its entire visible surface. It appeared to be relatively large, greater than the size of any plane (civilian or military) I've yet to see under similar circumstances.  It appeared, initially, to be flying a bit lower than even the typical passenger planes which I see daily as they fly to and from a nearby airport.  The only crafts I've seen in such a low flight paths have been F-15s & F-16s flying during either the local, annual air show, or else flying in and out of nearby Wright-Patterson AFB. This red object moved quite rapidly, heading east with its initial path seemingly parallel to the earth.  After about 30 seconds, it disappeared from my view as our backyard tree obscured my line of sight entirely, then returned to view.  When it did, it appeared to remain moving forward from West to east, still traveling parallel to the ground for about ten seconds.  Then, it suddenly appeared smaller (from which change I'd generally infer either a change in size, luminosity, or distance from the point of observation, but whatever occurred did so seemingly instantaneously). Then, still appearing smaller, the object apparently gained altitude, rising from  a former point about 35 degrees above horizon to ~45 degrees above horizon, and then, at zenith, the object seemed to cease moving completely.  It did not move nor vary in size or light intensity for several seconds, then began moving in a manner completely different from how it had moved before stopping.  It repeatedly moved in what appeared to be a linear, upward direction perpendicular to the going (without any associated forward or backward motion), did the same moving downward, eastward, westward, or at varying angles; it seemed to move closer at times, farther away  at others, each of the perpendicular motions made occurred without the object also moving in any direction parallel to the ground, yet other  times it moved forward (west to east) or backward while apparently accelerating or decelerating.  It also would simply cease moving and remain static, as well as move in sharply curving and angled paths as it appeared to simultaneously move up or down. It remained the same shade of glowing, vivid reddish-orange throughout, its light initially seeming to vary in intensity relative to its distance from me, but after the first 60 seconds or so, these changes in light intensity seemed to lack any correlation with the way it appeared to move. It was during the sequence of rapid, varied movements that the object again appeared to completely cease moving, and, while remaining stationary, appeared to divide into two of itself, yet both objects appeared identical in shape, and color/luminosity.  There was no visible division of the first object; it simply appeared to change from one object into two, the second appearing (at first) as if conjoined with the first object, as initially, a small portion of the edge of its upper left (west) quadrant appearing to either overlap or be contained within the edge of the lower right (east) quadrant of the first/original object.  The only visible sign that accompanied the appearance of the second object was a quick, less-than-a-second, flare-like emission from the lower-right (east) quadrant of the first object; this quickly-appearing and quickly-fading flare was the same color as the object itself.  The second object appeared nearly identical to the first/original, except it appear! ed to be slightly smaller.  The second object remained visible for only a second or less; it then vanished entirely, without any apparent movement at all. The original object remained, now alone again.  It remained visible for ~90 seconds more after the second object disappeared, the original resuming its prior series of sharp, quick motions (without any apparent pattern or sequence) alternated with seconds of apparent non-movement. It had been visible for 3-4 minutes when it again appeared to stop in place, stationary, then its light intensified as it appeared to increase slightly in size (perhaps it was moving closer to me).  Immediately after that, at an incredible speed, the object moved silently to the east, then appeared to gain altitude at this same, ultra-rapid speed (closest to which I can compare its speed is to that of a meteor streaking across fhe night sky) as it moved east-to-west at quite a steep angle, although it did not move in a straight line as it did so.  It never ceased that motion, but once it reached its highest point, it moved with the same sort of extremely rapid speed toward the east/southeast before vanishing, seemingly among the clouds in that direction. Whether its motion was linear or otherwise, each motion of the object was quite fluid & it always appeared to move with a noticeably agile ease.  The object seemed entirely silent throughout.",
      "link": "http://www.nuforc.org/webreports/144/S144902.html",
      "state": "OH",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a31",
      "summary": "Saw 5 fire-orange balls of light flying through our neighborhood. ((anonymous report))",
      "city": "dayton",
      "shape": "fireball",
      "date": "2019-09-12T00:00:00",
      "story": "Saw 5 fire-orange balls of light flying through our neighborhood.",
      "link": "http://www.nuforc.org/webreports/148/S148715.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b76",
      "summary": "Dayton Ohio Area Pale Orange/White Circular Light in Night Sky.",
      "city": "dayton",
      "shape": "circle",
      "date": "2019-03-14T00:00:00",
      "story": "Dayton Ohio Area Pale Orange/White Circular Light in Night Sky. I was finishing a walk of the block with my dog and was thinking about walking her a bit farther down a street running to the south so turned to look down that street and noticed the light from what I assumed was a plane flying high above treetop level to the south. Living in one of the flight paths sometimes used by the Dayton International Airport, I didn't think much of it until I realized (as I waited for my dog to finish sniffing the ground) it didn't appear to be moving either horizontally or any closer or farther away.  I watched the light and there was only a solid, steady pale orange glow -- the blinking lights I anticipated would appear never did.  Maybe most noticeable was the total absence of sound that always accompanies the aircraft I see at this approximate distance.  I did see a flight cross in the distance from west to east, its lights appearing smaller indicating it was probably either smaller or farther away than whatever it was I had noticed! which remained stationary as the aircraft passed behind it to the south; the aircraft was easily identifiable by the blinking of its lights.  The brightness of this light varied just slightly in intensity, getting a bit brighter or growing more dim for a few seconds.  The color remained the same.  It never seemed to move, but I glanced down at my dog for a second, looked up, and it was gone.",
      "link": "http://www.nuforc.org/webreports/145/S145057.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8c1d",
      "summary": "Green object flies over Dayton, TN. in 1994",
      "city": "dayton",
      "shape": "egg",
      "date": "2019-02-01T00:00:00",
      "story": "Green object flies over Dayton, TN. in 1994 It was a clear crisp afternoon, low humidity and blue sky with high thin clouds.  Ceiling was visible to above 15000 feet.  The object appeared out of the sky from the West over the mountains at about 8000 feet, and was bright greenish in color - moving east and downward at a 35 degree angle, approximately at 500+ mph (as if it was slowing), lowering altitude to approximately 2000 feet, then it changed trajectory and angle and move upward, heading northeast, increasing speed to approximately 2000+ miles per hour.   The event was witnessed on HWY 27 northbound near the overpass at the park in Dayton, TN.  Several cars stopped and a few people - including myself and my girlfriend, and other unknown motorists exited their vehicles.  We all looked at each other afterwards in disbelief of what we had just observed.  The object never made a sound - which was weird considering the elevation and speed.  I was 19 at the time.   Since then, I went on to serve as an M1-A1 Main Battle Tank Armor Crewmember, Air & Missile Defense Officer, Military Intelligence Officer, and as a Counterintelligence (CI) Special Agent - retiring as a Captain, after serving the first part of my career as an enlisted Soldier.",
      "link": "http://www.nuforc.org/webreports/144/S144692.html",
      "state": "TN",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c90ad",
      "summary": "Object appeared in Draco constellation as bright as star Arcturus then disappeared.",
      "city": "dayton",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Object appeared in Draco constellation as bright as star Arcturus then disappeared. At Approximately 12:24 AM 4/27/2019 in Dayton, Texas, I witnessed something while star gazing.  It was in the Northeastern sky in the Draco constellation. In my area the light pollution is around a 6 or 7 on the light pollution scale.  I had just backed away from my Celestron 20x80 sky master pro binoculars, when I saw what appeared to be a star grow as bright as the star Arcturus (the fourth-brightest in the night sky, and the brightest in the northern celestial hemisphere.) then fade back out.  I quickly jumped back to my binoculars to locate the object, but had no luck.  The experience happened for approximately 2 seconds.  At the time, the weather was perfect with no clouds in sight. There were no planes in the sky either at the time.  I proceeded to checked Calsky.com for possible satellites in the area of sky or for possible flare ups and everything came back clear.",
      "link": "http://www.nuforc.org/webreports/150/S150306.html",
      "state": "TX",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c91dd",
      "summary": "Glittering cylindrical object over East Dayton.",
      "city": "dayton",
      "shape": "changing",
      "date": "2019-12-01T00:00:00",
      "story": "Glittering cylindrical object over East Dayton. I went out on our back patio at approx 10:00 pm on 10/9/19 to smoke.  As I was sitting there, I noticed a bright light in the NE sky.  I started watching it because of how bright it was and because the lights weren't horizontal in the sky but vertical. Over the course of the next 45 minutes, I watched this object which never deviated more than a couple of degrees from its position.  It seemed to be a cylindrical object with lights that made it look like it was glittering.  The lights would change from red to green to blue and, whenever I would see an obvious airplane in the sky near it, the lights would change to a bright white.  Once the aircraft was beyond a certain range, it would go back to the r/g/b rotation.  After approx 30 minutes, the shape of the craft changed to a tiny pinpoint of light which made me think that it had suddenly taken off but, to my surprise, after about 20 seconds it reappeared the same as it had been before.  This happened several times over the next 10 minutes.  I finally had to go inside so don't know how long this object was in the sky.  Did not take any photos as all I had was my cell phone and I knew with it being night and the distance to the object, it would pretty much be useless to try to capture what I was seeing.",
      "link": "http://www.nuforc.org/webreports/149/S149700.html",
      "state": "OH",
      "duration": "45 minutes"
    }
  ]
}