{
  "city": "denver",
  "fetch_timestamp": "2025-07-12T14:19:24.259151",
  "record_count": 214,
  "pages_fetched": 10,
  "api_calls": 11,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4270",
      "summary": "White object looked like upside down Y left strange trail no sound and seemed to come out of the mountains west of Denver",
      "city": "denver",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "White object looked like upside down Y left strange trail no sound and seemed to come out of the mountains west of Denver I was standing in my drive way and it flew over head about 1500 to 2000 ft over head came from the west headed directly to the east made no sound in broad daylight .It looked like a upside down   ;Y;pure white no lights that i could see no windows and the most noticable thing was it left a con trail but the trail didnt apear untill the craft was well ahead of the trail ..The contrail was strange shapes almost like they were being drawn in the sky by an unseen hand .No particular shapes each shape was diffrent from the previous one .Words could never describe good enough what I saw and how nobody else reported it is even more strange  , being that it was right over a major city.I would sure like to know if anyone else has ever seen anything like it .",
      "link": "http://www.nuforc.org/webreports/049/S49841.html",
      "state": "CO",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b42ec",
      "summary": "Cigar shaped object over the frontyard of my house flashed green and orange lights in my face.",
      "city": "denver",
      "shape": "cigar",
      "date": "2006-05-15T00:00:00",
      "story": "Cigar shaped object over the frontyard of my house flashed green and orange lights in my face. I was out in my frontyard. And I saw a cigar shaped like object that was orange with a green tail on it and it flashed in my face. I watched the object as it went over my house. And I lost it in the clouds. And then I saw the object again. My friend that was over at my house came out and looked at the object. The object was going to the west and we lost sight of the object and we didn't see it no more. This happened on November 19, 2005 on a Saturday night at 7:55 P.M. It was a cloudy night. We went back in the house and came back outside and the object was no where in sight.",
      "link": "http://www.nuforc.org/webreports/050/S50299.html",
      "state": "CO",
      "duration": "20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b44dd",
      "summary": "Speedy Craft captured in photos over Lake Marston, Denver.",
      "city": "denver",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "Speedy Craft captured in photos over Lake Marston, Denver. While photographing the beautiful full moon... We captured on our digital camera an object moving at a VERY high rate of speed.  We took 4 pictures in a matter of 10 seconds or so. First picture dictates the craft being Miles and Miles and Miles away Beyond the city lights across the lake. Second photograph dictates the object being within 1 mile of our residence and on an axis as if it were turning.  The Third photo dictates the object level again, headed south. Fourth photo shows no object in site. The object was shaped almost like an airplane however the speed it was moving was much too fast, so fast that we didnt notice that we actually had seen anything until we looked at the photos- and NO noise was heard. These photographs were captured over Lake Marston, in Denver. We did not hear or see this object. We only captured it in photos. Weird experience!",
      "link": "http://www.nuforc.org/webreports/050/S50144.html",
      "state": "CO",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b44f3",
      "summary": "GREEN BRIGHT LIGHT OVER DENVER",
      "city": "denver",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "GREEN BRIGHT LIGHT OVER DENVER IT WAS A GREENISH BLUE COLORED OVAL SHAPED CRAFT . IT MOVED FROM THE NORTH TO THE SOUTH AT HIGH RATE OF SPEED . IT ALSO DID A LITTLE QUICK MOVEMENT TO THE LEFT THEN RIGHT AND THEN IT VANISHED .",
      "link": "http://www.nuforc.org/webreports/050/S50292.html",
      "state": "CO",
      "duration": "3 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3b46b1",
      "summary": "I saw a bright white cigar shaped aircraft moving slow across the sky and suddenly disappear.",
      "city": "denver",
      "shape": "cigar",
      "date": "2006-05-15T00:00:00",
      "story": "I saw a bright white cigar shaped aircraft moving slow across the sky and suddenly disappear. I was driving down Alameda and I noticed a strange shaped aircraft travelling unusually slow.  It appeared bright white with a slight fin at the tail.  I pulled over to examine it.  I stepped out of the car and watched it move very slow above the neighborhood, it was fairly close then it suddenly disappeared, vanished!   There was a man standing by and I asked him, do you see a plane in the sky and he looked up and said no.   I said are you sure?   He said no plane in sight.   I was standing in the middle of the street with my mouth hanging open.",
      "link": "http://www.nuforc.org/webreports/050/S50504.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b481e",
      "summary": "Unnatural moving circular Craft with green and red lights",
      "city": "denver",
      "shape": "circle",
      "date": "2019-08-23T00:00:00",
      "story": "Unnatural moving circular Craft with green and red lights There is a lightening storm without thunder, unlike anything I’ve seen before (still happening at the time of this report) and I was lying in bed watching it.  I saw what I thought was a plane going by and was staring at it thinking how much it would suck to be stuck way up there while the lightening was this bad.  It had red and green lights with no particular flashing pattern then I realized it wasn’t moving and appeared circular.  it was just flying there and the second I thought this, the lights turned red and it moved to the right then the lights alternated and it moves down a bit.   I yelled for my husband because I’d never seen anything move like that- it’s way to too high in the sky and far away to be a helicopter.  Then, it moved down really quickly while blinking green lights only and very rapidly, faster than it had at all before.  It moved so fast down while blinking that it almost looked like it split into multiple vehicles for a second or left a trail of green lights really briefly.  Then, it looked as it if disappeared out of my sight like zoomed too far away to see while moving “down”.  It was really unnatural movement and in the middle of a lightening storm with no thunder.   Never thought I’d be writing a report about a UFO...",
      "link": "http://www.nuforc.org/webreports/148/S148256.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b490e",
      "summary": "Six objects changing formation for about 10 minutes above the Denver Metro Area, mid day.",
      "city": "denver",
      "shape": "other",
      "date": "2019-06-07T00:00:00",
      "story": "six objects changing formation for about 10 minutes above the Denver Metro Area, mid day. May 24, 2019, Appox. 12:30pm  1 Mile west of downtown Denver, Colorado, (32nd Ave & King Street)   \tToday, May 24, 2019, about a mile due west of Denver Colorado.  It is a day with almost no clouds and bright sunshine.  I was standing outside talking with my neighbors when I noticed 6 objects to the NNE.  The objects were at a 50-60 degree angle from my location.  These objects were simply just there.  From my location they had the appearance of an object between a baseball and a golf ball.  Planes were passing over headed to the local airport, Denver International Airport that fly at approx. 12,000’, less than a mile above the ground, as they have just passed over 12-14,000’ foot mountains and begin decent for landing.  A private plane passed over at no more than 2000’ feet above so my guess is they were 3-4000’ above the ground. \tMy first thought is that these were balloons that had been released, as today is the last day of school.  The objects would have been too large to be balloons and they stayed in the same relative altitude.  Next, I thought they might be birds as they were constantly changing formations.  The idea being they were trying to gain altitude.  They moved from V to diamond to non-formation and back in a constant shifting of their position relative to each other. \tThis was not birds or balloons.  First, their size would have been too big for a bird and while I thought I saw a wing, given the size of a bird and distance it was away a wing would not be possible to see.  Even White Trumpeter Swans would be smaller, they are exceedingly rare in this part of the US and don’t fly in the manner that I witnessed.  They also reflected light of a white translucent color with a hint of rainbow sheen leaning heavier towards the red spectrum.  Birds don’t reflect light, which is why my mind first turned to balloons, but again the size was too large.  They had to be rather large in size . They appeared to be flying in an erratic behavior at first glance, much like balloons, but it soon became apparent these were flying in a controlled manner and altering between multiple formations. I was with two neighbors who took no interest, and I’m not sure if they could see them.  I was wearing sunglasses and when I removed my glasses, I was unable to see the objects. They were not wearing any sunglasses (and chuckled at my reference to the objects being extraordinary).  My I-Phone was unable to pick up anything either.  The objects were clearly reflecting light which changed as they moved, giving the impression they were possibly spinning.  The reflecting was not bright enough to overcome the sun’s glare without sunglasses. This went on for about 10 minutes.  I turned my eyes away for a moment and when looked back they were simply gone.  I waited about 30-45 minutes to gather my thoughts and then began this reporting process.",
      "link": "http://www.nuforc.org/webreports/146/S146267.html",
      "state": "CO",
      "duration": "10-12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a7b",
      "summary": "Erratically moving light fading inconsistently in and out above Denver.",
      "city": "denver",
      "shape": "light",
      "date": "2019-06-07T00:00:00",
      "story": "Erratically moving light fading inconsistently in and out above Denver While in our backyard enjoying an evening fire, we noticed a bright light moving from the south, but the light was fading in and out at an inconsistent rate, sometimes fading, sometimes blinking in and out.  As we watched the light moving, it began to slow down, and began moving erratically.  After about 10 minutes, it seemed to turn east, and while its movement east was not consistent, it remained on that general course, the light fading in and out/blinking in and out the entire time.  It finally grew too distant to see.  This was definitely not an aircraft, since the fading/blinking was not consistent like an aircraft's warning lights, and was also only white, no green or red light detectable.  The intensity of the light when it was at its brightest reminded me of a satellite when the sun catches it just right, perhaps even brighter.  We did wonder if this was the reported asteroid that was supposed to be at its closest approach tonight, given the inconsistent brightness, but the fact that it fairly quickly changed course to the east, and did not travel in a straight line makes it difficult to pin down.   We do have about 3 minutes of cellphone video of the event, with another star visible for reference.",
      "link": "http://www.nuforc.org/webreports/146/S146284.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5026",
      "summary": "Dancing lights over Montbello (Denver).  ((NUFORC Note:  Starlink satellites?  PD))",
      "city": "denver",
      "shape": "light",
      "date": "2019-12-22T00:00:00",
      "story": "Dancing lights over Montbello (Denver) Driving home from Montbello (Denver) to Brighton- my husband and I see several lights, too many to count! It started as a circle and the lights multiplied and the circle shape became huge! Some lights appeared and others disappeared. It was like they were performing. At one point all the lights went all ways and one went right over us. We were so shocked my husband stopped right in the middle of the street. All the lights looked like they were coming from above and all the sudden they all became one light and then there was nothing. The lights all were white color.",
      "link": "http://www.nuforc.org/webreports/151/S151794.html",
      "state": "CO",
      "duration": ".30"
    },
    {
      "_id": "64d005f478aba2ec5a3b582d",
      "summary": "Independent confirmation of a previously reported sighting of a UFO of Denver, CO.",
      "city": "denver",
      "shape": "cylinder",
      "date": "2007-08-07T00:00:00",
      "story": "Independent confirmation of a previously reported sighting of a UFO of Denver, CO. I am confirming a previous report of an object seen over Denver, CO on 4/16/2004. I was working as an armed security guard at a Denver hospital clinic. I stepped outside for my normal check of the perimeter of the building, and I witnessed the same object as previously reported at that time and date. The sky was blue and clear, and I saw a bright silver object moving quickly at a very high altitude from East to West at about 80 degrees from the horizon.  At first I thought it might be a high altitude military craft, or daytime satellite, but it abruptly stopped, and stayed in a stationary position. I retrieved a pair of 10x50mm binoculars from my car, and I was barely able to identify the object as what appeared to be a silver spinning cylinder. It was spinning very fast vertically, end over end, and was completely stationary. I asked a patient outside the clinic if she would confirm what I was seeing, and her response was, quote: “What in the world is that???”. The object was stationary for approximately 20 minutes, and at one point, a high flying (40,000ft?) commercial jetliner flew underneath, yet the altitude of this strange object was still much higher than the jetliner. I would venture to guess its altitude was on the order of 65,000+ft. To be able to distinguish it as a spinning cylinder at that altitude, leads me to think that it must have been huge. After 20min the spinning cylinder gained altitude and sped away at extreme speed to the North, until it quickly disappeared. Being an experienced amateur astronomer, I have seen quite a variety of objects both day and night. I have previously always been able to eventually identify and classify the objects as either spy satellites, the space station, space shuttle, weather balloons, or other man made aircraft, etc. The sighting and behavior of this object has bothered and bewildered me for years, and I am glad I finally found an appropriate place to tell my story, and confirm that it was witnessed by several other people. My conclusion, after all of these years, is that this was a genuine UFO, and that even the most advanced secret! militar y craft in the world could not have flown or behaved the way this one did…",
      "link": "http://www.nuforc.org/webreports/057/S57881.html",
      "state": "CO",
      "duration": "20miin"
    },
    {
      "_id": "64d005f478aba2ec5a3b5bbb",
      "summary": "Shiny metallic cigar shape (probably saucer) object travelling above Denver metro area.",
      "city": "denver",
      "shape": "cigar",
      "date": "2007-10-08T00:00:00",
      "story": "Shiny metallic cigar shape (probably saucer) object travelling above Denver metro area. At about 3:40pm on 8-21-7, I saw a shiny metallic cigar shaped object flying above the Denver metro area. It might have been an airplane, but I could not discern any wings, as I was amazed at how it resembled a saucer as seen from it's side. It was about 2 oclock high from where I was, and was angling upwards and away from me at about a ten oclock trajectory, perhaps five miles away. I was driving Southbound on I-25 North of the I-70 intersection, and just north of the 58th avenue overpass. I had just gotten onto I-25 from I-76 when I saw it. It was traveling toward the East (perhaps directly in line with, and above I-70), but then started traveling South East, till it diminished out of my sight. I saw it for about a full minute, as it was in constant motion. I have been very skeptical of saucer sightings till now. That was a very eery sight. I just wonder if anyone else had seen it as well.",
      "link": "http://www.nuforc.org/webreports/058/S58318.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5bb8",
      "summary": "Large white rectangular UFO over Denver",
      "city": "denver",
      "shape": "rectangle",
      "date": "2007-10-08T00:00:00",
      "story": "Large white rectangular UFO over Denver I was driving north on Santa Fe Drive.  I noticed a large white rectangular object about 5 degrees higher than the highest buildings of downtown.  It looked like a large playing card.  At first I thought it might be a large banner being pulled behind a plane.  But the object was immense, at least 300 feet by 200 feet.  I looked for a tow plane but could see none.  Plus such a large object could not be towed behind a prop plane.  As I watched it slowly moved in an arc.  It seemed to be turning to the left from my perspective.  As it travelled in the arc, it seems to shrink in size, as if you were to take a playing card and slowly turn the flat edge perpendicular to youself.  As it reached the edge, it simply disappeared.  I kept watching for it to turn again but it never did.  It was simply gone.",
      "link": "http://www.nuforc.org/webreports/058/S58315.html",
      "state": "CO",
      "duration": "60 to 90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c53",
      "summary": "Huge lighted cluster in the eastern sky.  ((NUFORC Note:  Sighting of Venus.  PD))",
      "city": "denver",
      "shape": "changing",
      "date": "2007-11-28T00:00:00",
      "story": "Huge lighted cluster in the eastern sky Hello - about 4:15 am on 10/10/07, I noticed a relatively large and bright \"planet\" on the eastern horizon.  Because it seemed so unusually bright and huge to the naked eye, almost like a large cluster,  I got my binoculars and observed it from there for the next hour.  It appeared to change shape from that of a hexagon to a triangle to a longer sphere.  The outer edges were extremely bright with a huge cluster in the middle – almost like multiple points or dots of lights.  Sometimes, the shaped changed to a crescent form – like a ladies diamond necklace.  At all times, there appeared to be 8-10 larger lights with all of the remaining dot lights contained within the shape.  At times, the larger lights appeared to be connected with a chain of smaller lights.  It is now 5:15 am and with the naked eye, you can clearly see it is a huge cluster of something in the sky. ((NUFORC Note:  Sighting of Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59175.html",
      "state": "CO",
      "duration": "45 minutes+"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d2f",
      "summary": "Large triangle shape object witnessed at two locations in the same night.",
      "city": "denver",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "Large triangle shape object witnessed at two locations in the same night. I am a truck driver and as I was driving west toward Harrisburg i seen a bright glowing red object in the sky on the south side of the moon Opposite of the north star. The object appeared to be a star and was visible for over 30 minutes. As I watched the object as i traveled it began to get closer and closer and i realized it wasnt mars or a star or planet. It then began to change from red to white so I reached for my phone to call my girlfriend and as it started to ring the object sped up changed directions and dissapered. I kept traveling westbound and approxemently 15 minutes later i went to check my driver side mirror and in the clearing hovering low over the ground was a large triangle shaped object with 3 solid lights. I did not witness the object after that.",
      "link": "http://www.nuforc.org/webreports/057/S57149.html",
      "state": "PA",
      "duration": "35-40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f66",
      "summary": "Two UFO's seen above Denver sky.  ((NUFORC Note:  Space Shuttle w/ ISS??  PD))",
      "city": "denver",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "Two UFO's seen above Denver sky On June 20th I read a little blurb in the Denver Post stating that the shuttle Atlantis would be visible that evening at 10:25pm looking NNW 13 degrees above the mountains and it would travel SSW for a minute or two.  So at the appropriate time we went out side to view this spectacle and what we saw was a little different than anticipated.  We saw two bright lights much higher in the sky than anticipated, moving one behind the other at a fast pace.  We observed them for a minute or two before the first craft in line started to dim out then disappear, with the second following the exact same exapmle, dim out then disappear in the exact same place. We don't really have any idea what we saw so thats why  I decided to put this up. ((NUFORC Note:  Space Shuttle w/ ISS??  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57217.html",
      "state": "CO",
      "duration": "+/- 2min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6031",
      "summary": "Oval object travelling west over Denver skyline flanked by two jets",
      "city": "denver",
      "shape": "oval",
      "date": "2007-02-01T00:00:00",
      "story": "Oval object travelling west over Denver skyline flanked by two jets I was travelling north in front of the State capital building in downtown Denver.  When I stoppped at a red light I looked up in the sky and noticed what appeared to be an oval type object travelling from east to west.  The object was flanked on either side by a fighter jet as though it was being tracked or possibly escorted somewhere. What added to the strangeness of the situation was that unlike the two jets, the object did not appear to be emmitting any type of exhaust or chem trail. ((NUFORC Note:  Date of incident may be approximate, although the witness does not indicate that fact.  Witness indicates only that the event occurred, allegedly, during the month of December 2006.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54660.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b63fb",
      "summary": "Viewed a silent, grey, shape shifting ufo fly over the nearby Denver Pepsi Center at 9:36pm.",
      "city": "denver",
      "shape": "changing",
      "date": "2007-11-28T00:00:00",
      "story": "Viewed a silent, grey, shape shifting ufo fly over the nearby Denver Pepsi Center at 9:36pm. My room mate and I were walking from Capital Hill to the Starz Theatre, next to the Denver Pepsi Center to see an advance screening of \"Lions for Lambs\".  We are about 5 minutes from the theater when I first noticed  a strange looking object flying overhead.  It was around 9:36pm and the sky was getting dark enough to see the FAA lights on the aircraft, but still bright enough to make out the shape of nearby helicopters and airplanes coming from the nearby Denver International Airport. The object appeared gray in color, no lights, no visible vapor trails, and no sound emitting from the object. It caught my attention because after looking at the flying object for a few seconds, I realized I couldn't pinpoint what type of flying craft it was.  It seemed to look as if though it was flying in a straight motion, but had the appearance it was rotating and changing its position within the flight path. At one moment I thought I could see wings, but it would quickly change into an unrecognizable shape. I also thought that it could have been a bunch of balloons banded together, but i've seen those before. And helium balloons travel upward, this object was traveling in a \"straight\" pattern, never escalating its height. Another odd factor was that caught my attention was that it was not making any sound. I'd say it was maybe 700-750ft off of the ground, close enough to be able to hear an aircraft sound. I would know that, because other aircraft pass overhead at much higher alltitudes in Denver, and the sounds are easily distinguishable during the time the object was witnessed. And I say 700ft, because the largest building in Denver is the Republic Plaza, which is at 714\"ft. And this object was definitely within that range.. The Object traveled silently , and eventually just disappeared out of site. That too seemed also a little strange, because the visibility was still clear enough to see aircraft coming too and from the nearby Rocky Mountains. However this craft seem to loose visibility. As it would move farther, the shape would also still keep changing. This will have been my second time seeing UFO in two different States.",
      "link": "http://www.nuforc.org/webreports/059/S59455.html",
      "state": "CO",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b646b",
      "summary": "Circling White bursts of light traving northbound in Denver, CO December 16, 2006 (6:45 pm to 8:00 pm) ((Advertising lights???))",
      "city": "denver",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Circling White bursts of light traving northbound in Denver, CO December 16, 2006 (6:45 pm to 8:00 pm) Witnessed 6 or 7 circling bursts of sparkling lights with a light burst in the center of the oblong circle.  The objects moved northbound from Denver around Josephine and York Stree in Denver, CO (just South of Highway 70) to Commerse City, CO up highway 76 to just north on Highway 85.  The circling white lighted objects moved northbound.   The bright lights traveled and circled the center burst of light.  The pattern of the circling lights were the objects appeared to move to the center object or disappear and and again they would appear circling.  It was a pattern of circling burst of lights.  It was very, very odd.  I have never seen anything like this before.  The lights were traveling. ((NUFORC Note:  Possible advertising lights??  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54039.html",
      "state": "CO",
      "duration": "1 + hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b6664",
      "summary": "My son was on the gravel road leading to our home.  He saw lights that were hovering over our home.  As he neared the lights (the light",
      "city": "denver",
      "shape": "triangle",
      "date": "2008-02-14T00:00:00",
      "story": "My son was on the gravel road leading to our home.  He saw lights that were hovering over our home.  As he neared the lights (the lights maintained their position and he drove up to them) he began flashing his vehicle lights at the object.   It was two orange lights that appeared to be on a flat triangular body.   As he flashed his lights the object appeared to turn as if to acknowledge seeing him.  He stopped his vehicle once he was in our driveway and ran into the house to get us (his girlfriend, me his mother, and his 16 year old sister).   We all ran outside and the object had moved to above the neighbors field.  We watched it as it moved around in the sky.  Several planes that appeared to be jets came and were circling this object.  A helecopter also came.  The object eventually disappeared but the airplains kept circling the area for some time.   When the object was hovering near us, it made no noise at all.  It could back up or fly off at high speeds.  The lights appeared to change all the time as if they were flickering different colors. I am no expert on aircraft but I do not know of any aircraft that can make no noise yet hover and shoot off at high rates of speed.",
      "link": "http://www.nuforc.org/webreports/061/S61197.html",
      "state": "IN",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6700",
      "summary": "White object, ufo, changing shape, moving North of Denver",
      "city": "denver",
      "shape": "changing",
      "date": "2008-02-14T00:00:00",
      "story": "White object, ufo, changing shape, moving north of Denver My son and I were on our way to church in southeast Denver on the morning of January 20, 2008 (Sunday).   I looked up, as I was driving, and saw a white object through my windshield.  It seemed to be moving and changing shape.  I asked my 12 year old son if he saw it too and he said \"Yes\".   I continued to drive west, the object northwest of us.  ((name deleted)) kept the object in view and tried to take photos with our cell phones.   I had to keep my eyes on the road - but the last time I looked up to see  the object I also saw a dark shape to its left. Feel free to call me with questions.  I have not yet evaluated the photos.",
      "link": "http://www.nuforc.org/webreports/061/S61069.html",
      "state": "CO",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6859",
      "summary": "Two lights that appeared connected moving very quickly SW to NE (faster than any commercial plane or military jet) across the sky .",
      "city": "denver",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Two lights that appeared connected moving very quickly SW to NE (faster than any commercial plane or military jet) across the sky . My husband and I were sitting outside having dinner and I saw two lights close together moving very rapidly from southwest to northeast across the sky.  It was much faster than an airplane (or even a military type jet) and there was no sound associated with it.  It looked like two lights that were connected or two lights moving with extreme precision in tandem.  I said to my husband \"look at that -- what is that?\" And he looked up and saw them just before they disappeared to the north of us.  He agreed they looked unlike anything we'd ever seen before.  It wasn't a spotlight and it did not look like a meteor or shooting star.  It looked like two lights that were connected in some way moving very quickly across the sky.",
      "link": "http://www.nuforc.org/webreports/056/S56453.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ab4",
      "summary": "Fast moving oval  bright orange/amber domed object at low altitude.",
      "city": "denver",
      "shape": "oval",
      "date": "2007-06-12T00:00:00",
      "story": "Fast moving oval  bright orange/amber domed object at low altitude. Standing on my west facing porch I observed a fast moving domed oval shape object with what appeared to be wings on either side.  It was solid orange, almost amber, in color, bright in intensity and with no flashing lights.  It did not leave a \"tail or trail\" like meteors do and I didn't hear any sound. I can’t approximate the altitude but know for sure that is was flying lower and much faster than a jet or airplane. It was traveling from west to east in a straight path. I tried to follow its path after it passed over my second story roof but by the time I got to a position where I should be able to see it, it was simply gone. The sky was incredibly clear. I am an amateur astronomer and practice nightly observation of the skies. This isn’t the first time I have observed an unusual object. In the last year I have witnessed four objects. Two, including this one, that were the orange/amber color and flying vertically. Two that were silver and cylindrical rather than oval and flying horizontally. All were flying at a low altitude.",
      "link": "http://www.nuforc.org/webreports/056/S56522.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6aa7",
      "summary": "Distant white spheres seen by crowd on college campus",
      "city": "denver",
      "shape": "sphere",
      "date": "2008-02-14T00:00:00",
      "story": "((NUFORC Note:  We have elected to leave Mr. Romanek's name in this report, given that he has gone public about some of the dramatic sightings he appears to have experienced over recent years.  One of his sightings he captured on video, and we consider it to be a very interesting case.  PD))  Distant white spheres seen by crowd on college campus I was attending the Stan Romanek presentation at St Cajetan's Church on the Auraria Campus near downtown Denver. Shortly after 4:00 PM (4:15?) a break was called (the program ran from 2PM to 6PM). Many people, including me, went outside. It was a very nice day, mild (in the 40's), partly sunny, very light breeze. I just looked at the sky casually, but then I noticed a lot of people were looking and pointing and yelling about something in the sky. They were all looking north or northwest. I asked someone to point them out to me; it took me about 30 seconds to notice them for myself. They appeared to be white. Most people said they looked like spheres (in fact, some said they were PERFECT spheres) but to me they looked more flattened, like a disc would look; however, I wear glasses and my prescription is 4 years old and I know I don't have 20/20 vision with them anymore. A few people had cameras or cell phones with cameras and were trying to take pictures. I saw that one person has already posted their report and included 3 photos. They do look more rounded in the photos, so it was probably my eyesight that made them look more flattened somehow. A couple of people thought they were balloons, but I did not think so for 2 reasons. First, they did not drift together in the same direction like balloons would be if carried by the wind. They would change direction, go into and out of clouds, and move in opposite directions to one another and stop and hover, then move again. There were 3 or 4 initially, then only 2, then only 1. Then I went back inside because the program was to resume. Either the other objects took off so fast I couldn't see them, or they disappeared, or went behind a cloud or two. Stan was outside for a few minutes and also saw them but said it was hard to tell whether \"they\" were there for him and the crowd, or whether it was balloons or whatever; he didn't watch them for long and went back inside. He asked the crowd later how many people saw the objects and a lot of hands wen! t up, pr obably more people saw them than didn't. Last summer at the UFO Watchtower, where Stan also was, there was a similar looking sighting--bright white color, very distant and high in the sky.",
      "link": "http://www.nuforc.org/webreports/061/S61535.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a78",
      "summary": "Colorado Southeastern sky.  ((NUFORC Note:  Possible sighting of the star, Sirius??  PD))",
      "city": "denver",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Colorado Southeastern sky I was sitting on the couch looking out at the night sky and noticed two strange very bright lights in the southeastern sky.  They were both very high in the sky and one was slowly moving over a 40 minute time to the south.  The larger light was so bright.  It reflected bright red, blue and white.  The smaller light also reflected the same lights.  I alerted my friends to look outside as well, they also were puzzled by the two strange lights.  It was a completely clear night, and there was not a cloud in the sky.  Evenly the brighter light kept moving slow to the south and just disappeared.  The smaller light also disappeared at the same time (40 mins).  Who knows...maybe it was a satilite, but it appeared very odd.  It was brighter than any star I had ever seen.  I am not sure what to think...  Did anyone else see this? ((NUFORC Note:  Possible sighting of the star, Sirius??  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54238.html",
      "state": "CO",
      "duration": "40 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b6b89",
      "summary": "I saw two silver dots in the western sky as the sun was setting both were locked into a single position in the sky and then they were g",
      "city": "denver",
      "shape": "other",
      "date": "2008-03-31T00:00:00",
      "story": "I saw two silver dots in the western sky as the sun was setting both were locked into a single position in the sky and then they were gone. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62224.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d1a",
      "summary": "Crescent shaped object with red, green, and white lights to the east of Denver.",
      "city": "denver",
      "shape": "other",
      "date": "2008-02-14T00:00:00",
      "story": "Crescent shaped object with red, green, and white lights to the east of Denver. Me and my best friend went outside on my front porch (which faces east) to have a cigarette. He noticed an odd, bright light hovering in the sky. At first we thought it was just a planet or an exceptionally bright star, but it began blinking red, green and white lights. After about 20 minutes of watching, it began to move around in zigzag and circular patterns.  As it moved around and came closer, we were able to discern the object was crescent shaped. It alternated between moving at a regular, steady pace and quickly darting around.  We are two college students, both majoring in social sciences (I am an anthropology major, and he is a psychology major). We both pride ourselves on being highly rational. After discussing it in depth, we could find no logical explanation for what this object was other than a UFO.",
      "link": "http://www.nuforc.org/webreports/061/S61307.html",
      "state": "CO",
      "duration": "45+"
    },
    {
      "_id": "64d005f478aba2ec5a3b70b3",
      "summary": "Bright Light appears in the sky at about the same time in the AM.  ((NUFORC Note:  Sighting of Venus.  PD))",
      "city": "denver",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "Bright Light appears in the sky at about the same time in the AM. 09-23-07 Good morning!  the report pertains to  events i have witnessed for 3-4days.theres been a bright light that appears at a distance,then when i look out my window it is sitting high in the sky but i can see a bright light and it is very clear.it does not go away until the sun comes up around 7:10am.ive been watching it for a about 4 days and it moves to the same spot.i usually im up on computer all night,so i look out my window at different intervals.it does not move and i don't think it is a star.a took a photo with a camera phone and it does show a bright light that has a disc look.it's ironic about the time i don't see it anymore,when its daylight i look in the sky and ive seen a jet farther away leaving a jet stream in the sky accross the field.ive witnessed these events for 2 days now.the disc dissapears and then i see the jet leaving a jet stream.it's kinda spooky to see the light park in the same place these last few nights.are there any bright things(stars in the sky that move?,that i should know about?i hope this description of the sighting is clear to you.im retired so that allows me to stay up late. ((NUFORC Note:  Sighting of Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58891.html",
      "state": "PA",
      "duration": "2hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b7324",
      "summary": "A supposed star, at a time before there were humanly created objects in orbit, which behaved very differently from the other stars.",
      "city": "denver",
      "shape": "light",
      "date": "",
      "story": "A supposed star, at a time before there were humanly created objects in orbit, which behaved very differently from the other stars. In July of 1957, I was a cadet at the Air Force Academy which was then located at the temporary site at Lowry Air Force Base on the outskirts of Denver.  At the time of the sighting, I was taking practice celestial fixes pursuant to becoming an Air Force navigator. The exact date escapes me, but it was in July.  There were celestial navigation trainers in the quadrangle, small enclosures with astrodomes inside, that each of us used with a bubble sextant hung from an astrodome.  The sextants were 1.5 power and were pre-set by the student for azimuth and elevation.  Once the settings were in the sextant, the student would look into the eyepiece and choose the brightest star in the field to set the sextant crosshairs and hold them there for two minutes.  The two minutes was necessary for the sextant averager to arrive at the proper elevation for the precomputed time of the shot. On this night, I had precomputed a shot for Kochab in the Little Dipper, set the proper azimuth and elevation into the sextant, and had set the crosshairs on the bright star in the field.  I began the shot and was adjusting the elevation as the averager was ticking away. The \"star\" I was shooting held firm with other stars in the field for about half  minute. Then I noticed that the azimuth and elevation were changing in excess of what was usual and could see that the supposed star was changing location relative to the other stars in the field.  I took my eye from the eyepiece and watched the \"star\" slowly moving to the right and slightly downward in relation to the other stars. There were two other cadets in the trainer precomputing for a shot.  I tried to show them the \"star\", but they could not easily see it among the other stars and it was moving too slowly for them to notice it easily - so they lost interest quickly and never saw what I was attempting to show them.  I was not excited because the nothing exciting seemed to be happening.  Consequently, the other cadets went back to what they had been doing. I watched the \"star\" continuing to move for a distance of about ten degrees across the sky (perhaps it was less) and then it stopped and just stayed in place with the other stars once more.  I continued to watch the \"star\" for several minutes and checked its location again before I left the trainer (at least a half hour later).  The object never moved again during this time relative the other stars. I thought about this for some time.  I never reported it.  This was before there was ever even a Sputnik.  Later, in the Air Force, I learned of many UFO sightings that were never reported (reporting them was unwise at the time), and I began to think that what I had seen was a \"mother ship\" changing its solar orbit (otherwise, it would have been moving all the time).",
      "link": "http://www.nuforc.org/webreports/058/S58079.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7427",
      "summary": "Flying object with Triangular shaped aura spotted in Denver",
      "city": "denver",
      "shape": "triangle",
      "date": "2007-06-12T00:00:00",
      "story": "Flying object with Triangular shaped aura spotted in Denver I didn’t really know what to do so I googled and found this site.  I am too freaked out to tell anyone else, especially since no one would believe me.  I was out smoking a cigarette on my patio when I saw it.  I probably wouldn’t have noticed, but a group of people in the grocery store parking lot across the street from my apartment started honking their horns at one another.  I saw them get out of their cars and point up at the sky.  DIA airport faces in the same direction, so always see when planes when they are coming and landing… but this was most definitely no plane.  I saw a light that would have looked like a twinkling star, except for a triangular shaped bright-aura surrounding it.  It was hovering above ground a couple hundred feet for a few seconds, and then shot up higher into the sky faster than any aircraft I’ve ever seen. Then it slowed down, did a zigzag up higher while going north, then disappeared.  I went inside immediately and sat down, a little disturbed by what I saw to make sense of anything.  I went back outside after a few minutes to see if the people who had also spotted it were still there, but they had left.  It was way, WAY too fast to be a helicopter, and there is no plane I’ve seen that could do such maneuvering.  I really hope other people in Denver send you info on seeing something like this tonight.  I wasn’t a believer until now. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56740.html",
      "state": "CO",
      "duration": "20 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7528",
      "summary": "4 Bright objects fly in formation over downtown Denver and the Platte River.",
      "city": "denver",
      "shape": "formation",
      "date": "2006-12-07T00:00:00",
      "story": "4 Bright objects fly in formation over downtown Denver and the Platte River. This sighting occured after my initial sighting of a seperate craft earlier in the night (I reported that sighting separately). The four craft came from the East over downtown Denver. They were flying in an eratic formation at first (but still to fast and to presise to be birds, not to mention the fact that they were luminescent). They then made a sharp turn over the Platte River (now flying in a steady horizontal line with even spacing) and continued that way (West) untill they vanished over my building.",
      "link": "http://www.nuforc.org/webreports/053/S53326.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b75d4",
      "summary": "Circular object flying up and into the clouds before a storm.",
      "city": "denver",
      "shape": "circle",
      "date": "2007-08-14T00:00:00",
      "story": "Circular object flying up and into the clouds before a storm. I watched a dark round object make it's way across the sky from the southeast to the northwest. It flew as if a helicopter would-maybe a little slower-and made no sound. This occured as storms were rolling in from several directions. It came into my vision lower in the sky and continued rising at a steady pace as it flew northwest and into a dark storm cloud. Strangely enough, I have witnessed the same event before-right before an intense thunderstorm. It was maybe a year or two ago about a mile away from this second sighting. It happened exactly the same way, about the same time of day, but flew from the southwest to the northeast disappearing into the clouds.",
      "link": "http://www.nuforc.org/webreports/058/S58050.html",
      "state": "CO",
      "duration": "1-2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b75ae",
      "summary": "Silent and Triangular shaped craft passes above Denver residence",
      "city": "denver",
      "shape": "triangle",
      "date": "2006-12-07T00:00:00",
      "story": "Silent and Triangular shaped craft passes above Denver residence My mom and I were sitting on our deck (3rd Story) and we were looking up into the night sky watching a military helicopter circle above.  We watched the helicopter for about 10 minutes.  The helicopter then left our area and went South.  About 5 minutes passed and then the helicopter returned and circled about 3 more times before leaving.  We then saw the UFO fly right above our deck traveling west.  The craft was triangular in shape and had a light tint of brown and orange (no lights). The craft passed above us at about the same speed the helicopter was flying and made no noise at all.  It then flew out of our available sight.",
      "link": "http://www.nuforc.org/webreports/053/S53310.html",
      "state": "CO",
      "duration": "10-15 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7638",
      "summary": "2  sets of 4 crafts each in V formations completely stationary.",
      "city": "denver",
      "shape": "triangle",
      "date": "2007-06-12T00:00:00",
      "story": "2  sets of 4 crafts each in V formations completely stationary. Driving home my husband,myself and my son saw 8 different crafts in 2 sets in  V formations in 2 different parts of the sky-parallel from each other. (North and South) They were in the formation of a triangle with A very bright craft at the bottom and 3 smaller crafts at the top. They were completely still and stationary. Suddenly one smaller craft started to revolve at a very fast rate and then shot across the sky to the other crafts that were lined up exactly the same as the first set of crafts. The large craft was triangular shaped and seemed dark in color and very bright while the smaller crafts were not as bright and I could not make out the shape of them.",
      "link": "http://www.nuforc.org/webreports/056/S56824.html",
      "state": "CO",
      "duration": "still going on"
    },
    {
      "_id": "64d005f478aba2ec5a3b766a",
      "summary": "Stealthy object enters atmosphere, conducts surveillance of Denver and Arapahoe counties in Colorado",
      "city": "denver",
      "shape": "rectangle",
      "date": "2007-10-08T00:00:00",
      "story": "Stealthy object enters atmosphere, conducts surveillance of Denver and Arapahoe counties in Colorado UFO sighting by a non-believer!  Date:   10/04/07 (Thursday)  Time:   About 9:10-9:15 p.m. MST  Location:   Denver/Aurora Colorado USA Parking lot of the \"Stampede Dance Club,\" on the border of the cities of Denver and Aurora in Colorado   Two Strange Phenomena   I.  Apparent micrometeoroid flash  1)\tI went outside the club around 9:10 p.m. tonight to get some air, and walked to a dark area near the end of a parking lot between some trees. At about 50 degrees SE of the zenith there was a bright cloud over Parker, CO, at a height of about 10,000-15,000 feet.  It was oblong and extended down to the horizon.  Otherwise the seeing was great overhead with a dark and crisp sky (usual for autumn in Colorado). 2)  \tI looked up and found Cygnus (extending about 0-30 degrees southeast of the zenith), then over to the west to find Lyra (normal sky gazing for me), then back at Cygnus, and then slightly to the east. 3)  \tA very faint micrometeoroid flash occurred in Lyra.  What struck me was that it was extremely faint, so short (less than 2 moon widths) and that it had a slight “j” hook to the east. This was at about 10-20 degrees SSW of the zenith. 4)  \tTotal sightig--about 1 second.  II. UFO  1)  \tFollowing the trajectory of the micrometeoroid flash (contrail?), within  a second or so and starting about 10 degrees due south, I saw an object moving across the star field at an apparent high altitude, squareish, with a cluster of lights centrally located within the square (perhaps a violet and a white light, extremely faint, and perhaps 1-2 others). 2)  \tThe object at first moved generally east toward Cygnus, shifting erratically back and forth at 90 degrees, while jumping erratically 5+ degrees north and south, instantaneously. 3)  \tThe object appeared to maintain the same altitude throughout the sighting, and was less than ¼ of a moon width. It finally disappeared to the SE into the glare of the cloud over Parker, and I waited to see if it appeared under the cloud--it didn’t. 4)  \tTotal sighting- about 7 seconds.  III. Personal notes  1)\tI’ve been a sky gazing hobbyist for over 45 years (I’m 54 now), and I know what to look for in the constellations. 2)\tI’m a veteran of seven archaeological projects including a survey, and am used to looking quickly for unusual detail (20:13 vision). 3)\tExcept for some inconsistencies with the Nasca features and the nearby hill theory, or an occasional mutilation that goes against the predator theory, I’m afraid I’m pretty much a “Skeptical Inquirer” type.  Crop circles are all pranks, etc.",
      "link": "http://www.nuforc.org/webreports/059/S59148.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7732",
      "summary": "Large bright white light with evenly spaced smaller lights in trail east of Denver moving northeast, as seen by airline pilot at FL380",
      "city": "denver",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "Large bright white light with evenly spaced smaller lights in trail east of Denver moving northeast, as seen by airline pilot at FL380 While flying westbound at FL380 (38,000') my First Officer and I saw a very bright, white light at our 9 o'clock high position. The object was just east of Denver at what seemed to be 40 to 50 thousand feet and was moving north to northeast.  4 to 5 smaller lights appeard behind the main object at even spacing, and maintained the same altitude and speed as the lead object.  I asked Denver Center (Air Traffic Control) if they had traffic at my 9 o'clock high. They replied negative. I said \"maybe it's space junk burning up\" but another airliner on frequency said no, it was moving too horizontal and did not have a trail of burning debris.  I agreed. The lights went out as they moved off to the north and east.  I've seen many meteors while flying and this was not a meteor.  It was not a conventional aircraft as it had no positon, strobe, or anti-colllision lights.  I have 17,000+ hours of flying time over 40 years.  I'm a Captain at a major airline and a retired USAFR Lt Col fighter pilot. This event was unlike anything I've ever seen. ((NUFORC Note:  We spoke with this witness on several occasions, and we consider him to be a superlative witness.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52764.html",
      "state": "CO",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b783c",
      "summary": "Daylight sighting of unknown object.",
      "city": "denver",
      "shape": "circle",
      "date": "2007-04-27T00:00:00",
      "story": "Daylight sighting of unknown object. I was looking east from the playground at Westerly Creek Elementary School.  Object appeared bearing about 080, proceeded to track NNE, speed indeterminate-perhaps 250 knots.  Estimated distance from me between ½ and ¾ miles.  It was at the altitude of bottom of low clouds.  I Lost sight at bearing about 350.  The bottom was silvery, it appeared to be round from the bottom, kind of a fattened disk in cross-section.  Above the mid-plane, there was a dark patch.  No sign of wings or empennage.  No sound, although this could have been obscured by a jet departure from DIA.  I believe this may be of the same type my family saw flying in close (20 feet) formation above Westerly Creek park 2 summers ago-those two had silvery bottoms and straight leading edge, forward sweeping trailing edge wings.  We saw those from about 500-1000’ straight above us.",
      "link": "http://www.nuforc.org/webreports/056/S56267.html",
      "state": "CO",
      "duration": "about 1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7819",
      "summary": "My sister and I grew up in a model aviation building/flying family and we both have a keen knowledge of the state of aviation art in fl",
      "city": "denver",
      "shape": "chevron",
      "date": "2006-10-30T00:00:00",
      "story": "My sister and I grew up in a model aviation building/flying family and we both have a keen knowledge of the state of aviation art in flying machines. This experience gave me the knowledge and encouragement to become a leader in the aerospace science and international airline spaceline operations. By the grace of God I currently lead the industry as the developer of a spaceship that competed successfully in the 2004 X-Prize race to space for civilian operators. My sisters possessed this same general background in aviation to confirm that what she saw flying object just below the clouds headed directly south as if head toward Colorado Springs Colorado. While looking up into the local airspace of an extremely located south east Denver neighborhood she observed  a new type of flying ship that was shaped like a open \"V\" apexes first configuration and moving very fast while making no sound emissions at about 5:30 pm. Because of its smaller size, as compared to a major airliner, she believes that the object, which flew directly over her head at about a 90 degrees zenith point could have possible been a large UVA, CUVA or single piloted craft. What captured  her attention was the fact that  the flying machine was following an  unconventional flight route that deviated from the normal east/west ATC regulated  traffic patterns class D airspace  routing support for both DIA and our Buckley AFB  flight patterns. She observed white lights illuminate near the outer section of both delta wing tip leading edges and possessed no power-plant thrust production smoke or vapors trailing it as it few at a low altitude. She does not remember the exact day but it was seen early last week around the 2ed of October. One final note in relation to this strange sighting its interesting to note that the sighting was made just before the North Korea nuclear boom test firing event schedule which place America’s spying activities on full alert. My sister know her airplane and I believe what she saw was something new. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52946.html",
      "state": "CO",
      "duration": "30 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b794d",
      "summary": "Strange object behind a weatherman giving forecast.",
      "city": "denver",
      "shape": "unknown",
      "date": "2007-03-08T00:00:00",
      "story": "Strange object behind a weatherman giving forecast. While watching the local Fox news channel (Fox 31) in the Denver area, a weatherman was giving a forecast while standing outside on the weather deck with his back to the foothills to the west of the city.   A stange streaking object appeared over his left shoulder and continued across the screen behind his head and then over his right shoulder.  I would have thought it could have been an air plane, but it had a strange flight pattern.  I couldn't find any footage after the fact, but I do know that the time on the Fox clock at the bottom of the screen was 7:39 AM.  I would guess there is an archive someone could access to retrieve the footage, but I don't know how.  It might be worth a look.",
      "link": "http://www.nuforc.org/webreports/055/S55452.html",
      "state": "CO",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a00",
      "summary": "Triangle like object appears, lands then dissapears near littleton hospital",
      "city": "denver",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "Triangle like object appears, lands then dissapears near littleton hospital My friends and I were out for a drive in the South Broadway/Hampton area when all of a sudden we saw what appeared to be two planes flying extremley low to the ground. Upon further inspection, we noticed that the \"planes\" were connected to eachother by a beam of light, and that what we had thought to be the triad pattern of lights often seen on planes at night was acutally a part of this strange object. The best possible description of its appearence is that it was one larger triangular shape lined with red and blue lights connected to a similar but smaller triangular shape. It moved very fast and sparatically making no noise at all. It was able to turn very sharply. The larger and smaller triangular components of the object always moved relative to eachother, maintaining a perfect connection.  After aproximatley two minutes of what appeared to be random motion, the object suddenly flew away into the distance until it was no longer visible. At this point, my friends and I were positive that what we saw was not a plane/helicopter/weather ballon due to the apparent high velocity the object was able to reach in such a short amount of time, and the complexity of its movement. My emotions at this time were shock, excitement, and amazement of what I had just seen. After the object had been gone for about 6 minutes, it suddenly reappeared very close to us, approximatly 50 yards above our car. After flying around the area for for about a minute, the object came to an abrupt stop above a residential area, about four blocks away from our car. At this point, we stopped the car and I was able to get a better look at the object. The \"light beam\" connection was actually a very well lit solid connection and dark window shapes could be made out on the smaller of the two triangles. I glanced down the street and noticed that several other cars had stopped to observe the object as well. After it hovered for a few seconds, it began to descend and landed on the ground. We immediatley tried to drive to where ! it had l anded, but could not find anything. The object had apparently dissapeared or become invisible upon landing. We searced the area where it appeared to have landed intensly for about a half and hour but could find nothing. Three helicopters arrived and appeared to be activley searching during the this time, and for the remainder of the night we could see/hear helicopters near the area of the sighting. Throughout the entire sighting I never felt afraid, I just felt amazed beyond belief and lucky to have seen this object.",
      "link": "http://www.nuforc.org/webreports/052/S52908.html",
      "state": "CO",
      "duration": "15 to 20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bbc",
      "summary": "Cracked windshields reported in at least 10 - 15 planes. Pilots reported no debris while in flight. Bad weather in midwest and in/near",
      "city": "denver",
      "shape": "other",
      "date": "2007-02-24T00:00:00",
      "story": "Cracked windshields reported in at least 10 - 15 planes. Pilots reported no debris while in flight. Bad weather in midwest and in/near Denver Colo...but nothing out of the normal for them.  Mystery to people in Avaiation and pilots, etc.   UFO's playing games again?...they have been very active of late. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  We have no reason to believe that this peculiar incident is related to UFO's, but it is quite interesting.  Hence, we will post it.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55316.html",
      "state": "CO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b7bde",
      "summary": "Daylight Disk near Denver",
      "city": "denver",
      "shape": "disk",
      "date": "2006-07-16T00:00:00",
      "story": "Daylight Disk near Denver I was heading East on I70 just passing up Harlan exit (right near the amusement park, when I noticed a disk like objeck moving north (just south of the highway), became parrell with the highway-did appear to be rotating, but it was pretty high up. It seemed to change course and move west after a few seconds- then it just vanished. It was blue skies, middle of the day. I continued to travel east to about the Steele St exit and just past the colusem I saw it again, moving west ward then an up direcion before it disappeared.",
      "link": "http://www.nuforc.org/webreports/051/S51155.html",
      "state": "CO",
      "duration": "+/- min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e79",
      "summary": "Two different color orbs playing chase over denver & shortly after military aircraft shows up.",
      "city": "denver",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "Two different color orbs playing chase over denver & shortly after military aircraft shows up. The second witness and I were sitting on a trampoline in the back yard looking up at the sky and as a single small cloud passed overhead two balls of fire or orbs one bluish white and the other reddish orange came down under the cloud and then played chase over and under and threw the cloud emitting bright lights that could be seen threw the cloud even during the day, they played for no more than two or three minutes and shot straight up in the sky disappearing. No more that 5 minutes went buy and two F-18 jets came screaming out of the east directly threw the cloud where the balls of fire where just playing giving me the chilling Idea we were not the only ones who seen the flying orbs. My then girl friend ran in the house terrified & I fallowed feeling the same fascinating fear. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72663.html",
      "state": "CO",
      "duration": "3 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b807a",
      "summary": "Bright triangle lights in sky",
      "city": "denver",
      "shape": "triangle",
      "date": "2009-12-12T00:00:00",
      "story": "Bright triangle lights in sky Approx 03:38 on 9/9/09 I let my pet outside, glanced south west a saw a triangle light, extremely bright sitting in the sky. The light did not move, just hovered there. Being of an old age, I eventually went back to bed. Not sure how long it stayed in the sky.",
      "link": "http://www.nuforc.org/webreports/072/S72190.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8641",
      "summary": "Two orbs,,,one in Denver,,,,one in San Diego",
      "city": "denver",
      "shape": "sphere",
      "date": "2009-03-19T00:00:00",
      "story": "Two orbs,,,one in Denver,,,,one in San Diego This is the second UFO I have observed in my life,,in this case I wake up at around 5:00 am and get ready for work,,affter getting dressed I step out on our deck to have a smoke. I allways look to the sky in the morning to see if theres weather,, and in hopes of catching another glimps of something. On this morning I noticed a bright sphere traveling east very high ( estimate ) upper atmosphere. Looked like a satelite untill it abrubtly stopped,,changed direction and traveled at an un-earthly speed in a northern direction,,stopped again for a few seconds proceeding east again. the speed at which this craft displayed was not of this earth,,nor was the way it manuvered. it continued to travel east for a few minuets,,and displaying that same un-earthly speed shot away from the earth,not straight up but at an angle which allowed me to see it it split second longer before it was gone. Trust me Humanity has nothing that can travel as fast as the craft I wittnessed. The first UFO I wittnessed was in San Diego. Over the Ocean Off of Point Loma about 2 miles away from shore. Clear nite about 9:00 or so,,,wittnessed a Green pulsing orb traveling eraticly north in a kind of floating up and down motion as it traveled north up the coast. It was fairly close, and was not like any conventional craft I have ever seen. Me and my girlfriend watched and affter about 8 to 10 minuets It left the earth close to straight up,,,,and at a speed that was close to the blink of an eye.",
      "link": "http://www.nuforc.org/webreports/068/S68025.html",
      "state": "CO",
      "duration": "5 to 7 minuets"
    },
    {
      "_id": "64d005f478aba2ec5a3b8746",
      "summary": "Saucer shaped craft seen flying over downtown Denver from about 1-2 minutes.",
      "city": "denver",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "Saucer shaped craft seen flying over downtown Denver from about 1-2 minutes. I know this may sound somewhat ridiculous with most of the media attention surrounding the city of Denver with the DNC and all, but I had to report this. This is my second confirmed UFO sighting of an uknown object here in Denver. These are also my first 2 UFO sightings I have ever encountered. I was watching CNN coverage of the political candidates. I had just finished dinner as I had gotten off at work around 6pm. I walk to and from my office, so I always am on the lookout for anything flying by in the sky, as there always is something to look at. I live on the 3rd floor in my apartment, so I have a pretty good view of the nearby republic plaza, capital building, etc. The skies were clear, the sun was shining through my windows, so I had closed a few blinds, but left 2 open.  I had just finished my dinner while watching CNN news, with a Bill Richardson interview.  I noticed something start to pass by in my left window facing the capital. I see helicopters planes, balloons,and birds pass by all the time, but this looked very strange. What caught my attention quickly was that there was no sound. When something that close flies by, I always hear it coming.  I quickly glanced at the dark object and noticed immediately that it wasn't a plane, helicopter, or balloon. At first I couldn't pinpoint the exact shape, but it seemed to be wobbling, and tipping up and down in that motion.  It was hard to glance at with the sun shinning directly on my view, but I could make out the elliptical, disc shape as it appeared to continue its path of flight across the downtown area. The Object's distance from the ground couldn't have been more than 1,000 ft, possibly even less. It continued to fly North, at a steady speed in the same wobbly, tilting motion. It had given the impression as if it was spinning, and I knew immediately it was a saucer shaped craft when the bottom portion came it to view as it flew further away from the capital hill viewing area.  I cannot determine the speed, but it seemed to be flying at a steady pace, similar to a police / black hawk helicopter.  However, the object seemed to speed up and quickly went out of site in the distance. The only image capturing device I have is a cell phone camera, and that yielded no results, however it does provide a concept of where the object was when the picture was taken, and the time of day. I am not sure if anyone else had seen this, or noticed it going by.  There had to be individuals that had seen this from the ground. Anyone going to and from the 16th Mall downtown had to have a view. I am eager to know if anyone else seen this strange object.  Not sure if the military is flying drones of some sort around the city, or if this was some weird kind of civilian aircraft, but this was definitely not an object being controlled by wind. Weather.com had the winds at 10mph from S,SE during the time of sighting.  This object was traveling way to fast, and at varied elevation increments throughout its path; to be mistaken for any kind of balloon or bag. I'm not saying its an alien spacecraft, but this was definitely something out of the norm. There has to be some explanation of what the object was.",
      "link": "http://www.nuforc.org/webreports/065/S65335.html",
      "state": "CO",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b888b",
      "summary": "three semi-stationary lights in sky seen from Denver area but over Kansas. Able to move very fast.",
      "city": "denver",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "three semi-stationary lights in sky seen from Denver area but over Kansas. Able to move very fast. There were 6 lights. 3 to the east of Denver and 3 to the southeast. Fairly stationary, although at times one from each group would change position and move up, down or either side very quickly and over time they all were seen to move around, so we knew they weren’t stars, and planes just don’t move like that. The lights were super bright, but would intermittently go dim and then come back bright again and seemed to strobe a little bit. We thought they might be helicopters, and drove to the east to see if we could get close enough to see shape with binoculars. They couldn’t be helicopters like we thought because we would have gotten closer, but we got no closer at all and  then we realized how bright they must be and how fast the one that moved around must be moving. We decided they must either be in orbit or over Kansas somewhere.",
      "link": "http://www.nuforc.org/webreports/072/S72702.html",
      "state": "CO",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b8eb6",
      "summary": "We saw three objects, one big circular with bright lights moving fw and spinning, one and two much smaller ones flying with it.",
      "city": "denver",
      "shape": "disk",
      "date": "2010-02-14T00:00:00",
      "story": "We saw three objects, one big circular with bright lights moving fw and spinning, one and two much smaller ones flying with it. My husband and I saw this UFO coming from SW going NE, one big circular shaped airborne object with bright yellowish lights at the bottom (it looked like several lights), and two much smaller crafts moving around it in irregular motion, like forward bakwards and making circles.  The big craft was moving forward and spinning at the same time, but very slowly, the smaller crafts were much faster in their irregular motions but moving forward with big object at the same speed.  All three were flying together in the same direction, NE.  The objects were totally silent. We have no idea what that was but it was very beautiful to watch. We do not have pictures or videos.",
      "link": "http://www.nuforc.org/webreports/073/S73731.html",
      "state": "CO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8edf",
      "summary": "Bright star looking object moved in sky and turned red, blue, green, yellow and hovered in sky",
      "city": "denver",
      "shape": "unknown",
      "date": "2010-04-13T00:00:00",
      "story": "Bright star looking object moved in sky and turned red, blue, green, yellow and hovered in sky I was standing on my apartment patio on the third floor about 30 ft high.  I looked out into the sky and saw what appeared to be a bright star.  I realized that it wasn't a star because of the objects slow movement.  It didn't have any of the typical characteristic movement patterns of a plane either.  I got my sister from inside to come observe with me.  She also agreed that it didn't appear to be anything like a plane or anything that she recognized.  The object still had a bright iridescent white shine as it slowly moved.  As I watched it more, the object seemed to dim in radiance of the white glow being shown, as if the light was being dimmed down.  The object seemed to stay in one place and then slowly move in a linear fashion.  Not anything like any aircraft.  The object then appeared to start flashing different colors. It would flash a bright red, then bright green, bright blue, and yellow and then back to white in no particular order.  It seemed like the entire object donned the color that it turned to, much unlike blinking aircraft lights that are separated by wing space.  As the object turned different colors it seemed to hover in one place.  It would then slowly do a somewhat figure eight pattern or a circular movement pattern and would at instances seemingly accelerate very quickly and then slow back down and then just hover in place.  It kept doing this and I went inside after about 20 minutes.  I came back out hours later and it was gone.",
      "link": "http://www.nuforc.org/webreports/074/S74403.html",
      "state": "CO",
      "duration": "20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b9099",
      "summary": "Two twinkling, moving UFOs seen above the western horizon in Denver, CO.",
      "city": "denver",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Two twinkling, moving UFOs seen above the western horizon in Denver, CO. Two twinkling objects were seen at two different times within five minutes far above the Western horizon.  They were either flying further west or were dropping altitude, but both floated down several degrees in vision while seeming to expand and contract, and then finally they disappeared.  I might’ve thought they were jets if it weren’t for the fact that they left no trail of exhaust.  They both simply appeared in the sky and dropped down on the vertical plane of vision while changing shape and floating down, kind of like a feather does.  The first one disappeared outright, just fading out of the sky.  I may have lost sight of the second one only because it flew further west(?) behind a cloud.  A few minutes after the sighting, a jet with a short stream was seen flying to where the objects were spotted in the sky.  I lost sight of it when it disappeared behind the same cloud as the UFO. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67175.html",
      "state": "CO",
      "duration": "apprx. 5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b91b1",
      "summary": "Pale blue lights hover near Denver, Colorado in \"V\" formation",
      "city": "denver",
      "shape": "triangle",
      "date": "2010-02-14T00:00:00",
      "story": "Pale blue lights hover near Denver, Colorado in \"V\" formation When returning home from dinner on New Year‘s Eve 2009, at about 9:00 pm, we noticed unusual lights in the sky just east of Denver, Colorado.  There were three lights in a “V” formation which were pale blue in color, and the outer two lights kept changing in their intensity - “twinkling” in unison, while the center light at the tip of the “v” remained stable.   Because Denver International Airport is nearby, we thought at first the lights might belong to commercial or private aircraft -- but on closer observation we noticed there were no regulation aviation strobes.   Also, the lights hovered in the same location for the entire 15 minutes we watched.   We went indoors when the cold finally got to us and tried to find a window from which they were visible, but trees blocked our view.",
      "link": "http://www.nuforc.org/webreports/073/S73931.html",
      "state": "CO",
      "duration": "--"
    },
    {
      "_id": "64d005f478aba2ec5a3b9212",
      "summary": "Picture reveals UFO in the background",
      "city": "denver",
      "shape": "circle",
      "date": "2009-08-27T00:00:00",
      "story": "Picture reveals UFO in the background I was at a National Park just west of Denver when we took this picture.  It was in the afternoon and I was very aware if any planes, ballons and the like were flying around that day.  I observed NO aircraft in the sky that day during our visit. When I got home and had the film developed I discovered this image on this one picture.  No other pictures had this image on it. ((NUFORC Note:  Source of the report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71557.html",
      "state": "CO",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b93e7",
      "summary": "Three moving craft near Lowry.",
      "city": "denver",
      "shape": "changing",
      "date": "2008-10-31T00:00:00",
      "story": "Three moving craft near Lowry. Three craft came into formation, moved in different directions, hovered, then flew into the clouds.",
      "link": "http://www.nuforc.org/webreports/065/S65912.html",
      "state": "CO",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b941f",
      "summary": "Pulsed Contrail",
      "city": "denver",
      "shape": "changing",
      "date": "2009-01-10T00:00:00",
      "story": "As a 76 year old photo hobbyist and a former Navy aerial photographer for ten years I stopped by Washington Park Lake in Denver to enjoy the tranquility and take some autumn pictures.  While there I saw a pulsed contrail.  Above the pulsed contrail was a small object darting about making extraordinary sharp turns and darting to & fro.  Not a bird.  It rapidily disapeared behid the cloud cover or I would have a photo of it.  I did get a piture of the unusual pulsed contrail.",
      "link": "http://www.nuforc.org/webreports/067/S67294.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b97b4",
      "summary": "On May 15, 2010 I witnessed four ufo's that looked like bright stars or satellites. ((NUFORC Note:  Satellites??  PD))",
      "city": "denver",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "On May 15, 2010 I witnessed four ufo's that looked like bright stars or satellites. On Saturday May 15, 2010 I was standing in James Bible Park in Denver, CO looking at the moon and Venus which were spectacular when I looked up and noticed off the cup end of the Big Dipper a light just appeared and began to travel in a northbound direction.  It disappeared and reappeared three times before I lost it.  Then 10 minutes later I noticed two more. One was travelling southeast and the other (which I estimate to be about 5 times the brightness of Venus was travelling northeast. It appeared as though both craft were going to collide right over my head but they just missed each other.  I listened for the sound of aircraft but heard nothing.  Furthermore there were no clouds in the sky.  At this point I dialed 911 just to have an official reporting.  Then as I was on the phone I saw a fourth one appear.  It looked to me like it was following an aircraft that I noticed was far out in front of the light (maybe a mile).  I watched the light until it disappeared! and described it all to the dispatcher at 911.  By this time it was about 22:00 hours and I called my mom and her boyfriend who came out to bring me a coat and watch with me.  At approximately 23:00 hours we saw another one very similar to the first.  It appeared out of thin air directly over head moved around for about 30 seconds and then disappeared. ((NUFORC Note:  One of three reports from the same source in Denver.  Possibly not serious-minded reports.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75454.html",
      "state": "CO",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b9847",
      "summary": "On May 16, 2010 I witnessed a number of strange objects in the day time sky.",
      "city": "denver",
      "shape": "unknown",
      "date": "2010-06-03T00:00:00",
      "story": "On May 16, 2010 I witnessed a number of strange objects in the day time sky. On Sunday May 16, 2010 at approximately 16:00 I went to a friend’s house by the name of Matt Oliver. The purpose of the visit was to borrow his video camera in the hopes that I'd catch some of what I'd seen the previous evening on video. I was leaving his house with the camera when I looked up North in the sky and saw something appear in the sky seemingly out of nowhere. I can't be certain how to describe its movement but it was similar to that of a jellyfish. After about 30 seconds a second one appeared. I hollered to matt who came out on his balcony and confirmed what I thought I was seeing. They began to move in a easterly direction. Sometimes appearing to drift and at other times they looked to be propelling themselves. It’s important to note neither object drifted the same way as the wind or clouds. We watched them for about 15 minutes until they were out of sight. At that moment a plane that looked very similar to an airliner but painted all black or b! lue on the bottom swooped through from east to west at about 500 feet in altitude right where I had first seen the ufos. Then directly after the plane swooped through Matt began hollering to look directly up in the sky. Over head and very high we saw a number of lights blinking on and off and dancing around. This persisted for another half hour. Also I noticed cotton like substance falling from the sky. I collected some of the material and am hoping have it analyzed. It was very hard to catch these objects with the video camera I was using but I did capture one of them for a brief moment. ((NUFORC Note:  One of three reports from the same source in Denver.  Possibly not serious-minded reports.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75455.html",
      "state": "CO",
      "duration": "45 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9890",
      "summary": "large object hovering completely still, three lights in the center with a glowing rounded bottom.",
      "city": "denver",
      "shape": "disk",
      "date": "2010-02-14T00:00:00",
      "story": "large object hovering completely still, three lights in the center with a glowing rounded bottom. There was one object hovering low in the sky.  I was completely still for about six or seven seconds.  There were a series of thee lights, bright yellowish in color in the center, two lights on each side above the series of three center lights, and a glowing rounded bottom.  I was in my car leaving work when I noticed it out of the corner of my eye.  It was shocking because I knew it was unlike anything I had ever seen before. I kept yelling out loud \"what the hell is that\", then as I pulled out of my parking spot into the street the object was slightly hidden by a tree, so I reversed my car as to get a better look and within a blink of an eye it was completely gone.",
      "link": "http://www.nuforc.org/webreports/074/S74322.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b98fd",
      "summary": "I saw 2 rapid moving dimly glowing lights moving jaggedly vertically across the sky.",
      "city": "denver",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "I saw 2 rapid moving dimly glowing lights moving jaggedly vertically across the sky. Approx. the time mentioned above, 2 rapidly moving lights moved vertically in the sky.  The lights were dimly glowing.  They appeared to be moving jaggedly in a fluttering motion and were not in unison with each other.  They were not very high up, and the sightings could not be seen for long due to trees blocking my view.",
      "link": "http://www.nuforc.org/webreports/066/S66046.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba14d",
      "summary": "Witnessed V shaped lights moving without sound over Denver, Colorado for 20 seconds",
      "city": "denver",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Witnessed V shaped lights moving without sound over Denver, Colorado for 20 seconds On Thursday, February 26, 2009, at approximately 8:40pm my mother and I witnessed some strange lights over Denver, Colorado.   Her home is located in the central Denver area in the 80204 zip code.   As we were preparing to enter her home, she mentioned that the stronger than normal winds that the Denver metro area experienced had cleared the pollution and made the stars appear brighter.   As she mentioned the clearer night sky, we looked up, initially to the south.   As we looked up, a brighter light caught our attention approaching from the southeast moving towards the northwest.   The light initially appeared to be a shooting star, but was not as vibrant as a star and not moving as rapid as a shooting star either.   As the light moved over our heads heading towards the northwest, it appeared to be not just one light, but a group of about six lights in the shape of the letter V, or very similar to birds flying in a group.  The shape of the V formation was not perfectly symmetrical like you would see from lights on the tips of a commercial airplane. It took approximately 20 seconds for the lights to appear and to move out of sight towards the northwest.   The lights were not as bright as the lights that are on a commercial airplane.  In addition, there was absolutely no sound.   If these lights were coming from a jet or a commercial airplane, it would have to make sound moving at that speed which it did not.  Also, the lights were moving below the clouds in the sky as the clouds did not impede the lights as they moved across the sky.  The lights continued to move towards the northwest until they were no longer visible leaving no sound.",
      "link": "http://www.nuforc.org/webreports/068/S68967.html",
      "state": "CO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba248",
      "summary": "I don;t know if this is even any thing or not but I was watching Ten Thousand BC. 16 minutes into the movie is when I saw some lights i",
      "city": "denver",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "I don;t know if this is even any thing or not but I was watching Ten Thousand BC. 16 minutes into the movie is when I saw some lights in the back round it's the sine right after the early man had killed the mammoth. this movie is on cable ondemand check it out.",
      "link": "http://www.nuforc.org/webreports/069/S69404.html",
      "state": "CO",
      "duration": "3 -4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba36f",
      "summary": "Five lights moving behind cloud, none emerged.",
      "city": "denver",
      "shape": "other",
      "date": "2009-05-12T00:00:00",
      "story": "Five lights moving behind cloud, none emerged. My friends and I were hanging out in the back yard around 8:00 - 10:00. About 30 Minutes in I noticed a Dim red light in the sky.  It was moving slowly, paused, and moved behind a small cloud. I told my friend and they said they didn't see anything.  I kept watching and another appeared about 30 seconds later, and went behind the same cloud.  I showed my friend and He didn't know what to think of it, and went back to what he was doing.   Another appeared and another and another, all moving at the same speed.  They all went behind the cloud, but none ever came through the other side.  I have been puzzled ever since, and would like to know if anyone has ever experienced something like it or at least similar to it? ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69955.html",
      "state": "CO",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba4a1",
      "summary": "Craft plummeted over Denver, CO, flashing orange and blue/green, flipping end over end, suddenly ascended rapidly out of sight",
      "city": "denver",
      "shape": "disk",
      "date": "2009-06-09T00:00:00",
      "story": "Craft plummeted over Denver, CO, flashing orange and blue/green, flipping end over end, suddenly ascended rapidly out of sight From an 11th floor rooftop near Cheeseman Park, Denver, CO, while looking SE toward Glendale, one perhaps saucer-shaped craft was seen rapidly descending, alternately blinking orange or green/blue light at perhaps 2-second intervals.  It flipped rapidly during its descent, like a coin that had been tossed in the air.  It suddenly stopped plummeting and at incredible speed zipped back and forth for a few seconds, then diagonally upward, until out of sight, above and south of the Tech Center in Greenwood Village.",
      "link": "http://www.nuforc.org/webreports/070/S70361.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba481",
      "summary": "Very fast disappearing light in nighttime sky",
      "city": "denver",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Very fast disappearing light in nighttime sky Was laying on my back watching for satellites (they look like little stars that move across the sky in a systematic way). Thought we saw one but this was going at least 5 times faster (same size, same systematic way) and I thought maybe it was just a really, really fast satellite - it crossed half the sky in less than 3 seconds, but then it just disappeared out of the sky in front of my eyes. Not over the horizon or behind clouds, but poof and gone.  Have seen may satellites, but nothing like this. Definitely not an airplane - there were several of them in the sky at the same time and it was very easy to ascertain their altitude and speed/shape.",
      "link": "http://www.nuforc.org/webreports/064/S64912.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6c0",
      "summary": "Radiant green object souring through the sky than disappearing in a flash",
      "city": "denver",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Radiant green object souring through the sky than disappearing in a flash I was sitting in my bed last night looking out my window at the clear night sky when all of a sudden I saw a bright green circular light appear. The light was a bright green color and the object seemed close due to the size of the light.The light was also solid (not flashing). I sat there watching it descend downwards at an angle fairly quickly. My first thought was it was a plane that lost control and was about to crash because of the high speed it was traveling downward,  so I ran to my window. I didn’t even reach my window when I saw one sudden burst of yellow/white light from the object  after watching it for about 10-15 seconds and than it was gone in a flash. I stared out my window for the next half hour  waiting to see if I could see this light again but there was no sign of it. I did see plenty of airplanes flying after this happened, however this was flying much closer to the ground. I've always been skeptical about UFO's & aliens, but now I definately am a believer!",
      "link": "http://www.nuforc.org/webreports/065/S65000.html",
      "state": "PA",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba949",
      "summary": "V Shape ufo over my head silent moving with no light on about 200 yards above blocking out the star in the sky in Denver, Colorado",
      "city": "denver",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "V Shape ufo over my head silent moving with no light on about 200 yards above blocking out the star in the sky in Denver, Colorado Shape of the craft was like the phonix light craft, V shape. There was only one.  No sound when it was over head around 200 yards above me and my friend.  I was very large it block out the star in the sky that why I seen it and the shape.  There was no light on it.   I could give more detail when you contact me about the color and size. At the time myself and a friend a seen the craft I was living a ((deleted)) Raleigh St. in Denver, Colorado 80219",
      "link": "http://www.nuforc.org/webreports/078/S78572.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba9e7",
      "summary": "Slow flying black mass that eventually disappeared behind a cloud",
      "city": "denver",
      "shape": "cigar",
      "date": "2010-11-21T00:00:00",
      "story": "Slow flying black mass that eventually disappeared behind a cloud In late August of 2010, while on fugitive recovery, my partner, his wife and I all saw a black mass in the sky heading from west to east over I-70 in Denver, CO.  To give perspective, we were on 43rd and Decatur. What caught our eye was that there were no running lights on this vehicle (I am not a pilot, but I think it is a big no-no to fly through the city without any lights on, but I may be wrong).  As it approached from the west, traveling about the speed of a helicopter or small plane, we kept waiting to hear some kind of engine noise to help us know what we were seeing (Police helicopter, Traffic reporter, etc).  We never heard any sound. Since we never heard any sound, we thought that maybe our depth perception was off and it was actually flying higher than the 1000-2000 foot altitude than we thought. We watched it continue to fly east.  It went behind some small clouds and never came out in any direction. My partner and I are pretty skeptical and are reluctant to classify this as a \"UFO\".  Just because we do not know what it was, doesn't mean there isn't an explanation for it.  It was, however, very unusual. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78226.html",
      "state": "CO",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3babfb",
      "summary": "A Ufo Came twards me and another waiter in denver co at my night Job it was scary we saw it clearly and it flew back into space",
      "city": "denver",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "A Ufo Came twards me and another waiter in denver co at my night Job it was scary we saw it clearly and it flew back into space The First night i saw it hovering above the Movie theater Across the street from where i worked and it was moving west bound then stopped for about three Nights it has been floating.  The second night i noticed that it had a very bright light and was unusauuly brighter than any star i had ever seen I went to the restaurant outside our Hotel Parking lot where I work as a Night Auditor and told a waiter to come outside with me and take a look we both agreed that it wasn't a star and this was on 10-07-10  On 10-08-10 I went back to the restaurant and we noticed that the Bright light was not in the sky and we talked about what it could have been then we noticed a light form the same area we saw the last one comming closer to us and it had entered our air space and kept comming closer. me and the waiter was afraid because it seemed to be heading our way  About 3:30 Am I ran into the Hotel And called Denver Police they gave me the Number to FAA or Air triffic Control i called from the htel and reported it he didn't ask me any questions and was very short with me as if he didnt believe me after that I called this UFO Center reported it on the phone then wrote this report",
      "link": "http://www.nuforc.org/webreports/078/S78236.html",
      "state": "CO",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0d6",
      "summary": "large bright flashing object with pertruding light ray underneath west of denver travelling south west.",
      "city": "denver",
      "shape": "other",
      "date": "2011-05-02T00:00:00",
      "story": "large bright flashing object with pertruding light ray underneath west of denver travelling south west. one object flashing blue red white and green circular in shape flat on top with a tail or trail of light blue white in color extending below the object stayed in same area but made many small left right up down very fast movements eventually disappearing over horizon many planes seem to have passed near we have video my sister mother neighbors and myself saw the object we tried to view through scopes binoculars and telescopes what it looked like up close but it was so bright it was hard to make up details but from what i could tell it seemed distant about one to three thousand feet up and very large",
      "link": "http://www.nuforc.org/webreports/080/S80981.html",
      "state": "CO",
      "duration": "20-30 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bb22e",
      "summary": "Bright Lights Low in Eastern Denver Skyline",
      "city": "denver",
      "shape": "light",
      "date": "2011-03-10T00:00:00",
      "story": "Bright Lights Low in Eastern Denver Skyline At first we saw 2 bright lights low in the sky diagnal to eachother, then the lights moved and went to the opposite diagnal of eachother.  Few minutes later a light just below the 2nd light popped up, and literally popped into the night sky.  Then a 4th light appeared and 5th. They looked to be staggered in the sky way too low to be stars.  There's no airport strip or lit towers East of Denver in Weld County, so it couldnt have been a plane.  Satallites don't move like these lights did, they moved around eachother shining bright and fading and then reappearing brighter then ever.  They had to have been there for atleast 20-30 mins, and I watched about of 25 mins of it.  Its was breath taking, I had to call my mom. I'm just looking for a logical explination, I've seen these lights in the Eastern sky a few times before, always in the east though, and I've NEVER seen 5 of them together this completly blows my mind.   Any answers will help.  Thank you",
      "link": "http://www.nuforc.org/webreports/080/S80286.html",
      "state": "CO",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbaa5",
      "summary": "Glowing orange orb over south metro Denver.",
      "city": "denver",
      "shape": "sphere",
      "date": "2010-07-06T00:00:00",
      "story": "Glowing orange orb over south metro Denver. I was closing a window in my home when I saw a steadily glowing orange orb moving across the sky over my backyard. I went outside and observed the orb moving beneath cloud level at about the speed of a low flying airplane.  It did not blink, flash or change colors as it traveled from east to west. Size?  Maybe about the diameter of a teaspoon when held at arm's length when directly above me, growing smaller as it grew more distant.  I compared what I was seeing to several airplanes I could see in the sky at various distances and traveling in various directions.  Looked nothing like them.  Seemed to be moving too fast to be a hot air balloon.  Not enough wind tonight.",
      "link": "http://www.nuforc.org/webreports/076/S76006.html",
      "state": "CO",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbceb",
      "summary": "Denver, Cheeseman Park large ship sighted...disapears within minutes",
      "city": "denver",
      "shape": "disk",
      "date": "2011-10-10T00:00:00",
      "story": "Denver, Cheeseman Park large ship sighted...disapears within minutes I looked up from my desk this morning into the southwestern Denver sky. About 500 feet in the air was what can only be described as a large disc shaped craft. It was very dark in color and show signs of construction like additional detail tooled into the surface. I was in a chair and moved to my wheelchair to get the camera which was outside and downstairs. I decided to get binoculars in stead and in the that short length of time it moved out of view. After about a minute behind some trees, it emerged again for a few seconds then simply was't there any longer. I didn't see it move or fly away or disapear. It simply wasn't there any more.no photo. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83386.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbee0",
      "summary": "5 Orange balls of light in triagle formation followed by dim white light.",
      "city": "denver",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "5 Orange balls of light in triagle formation followed by dim white light. Last week my friend reported seeing the same 5 orange lights in a triangle formation that were reported over Denver last week.  He saw them twice in 5 minutes around 10:00pm.  He saw them the first time and brought a friend out who saw them the second time. last night he came inside around 10:00pm and said he seen them again and again they were headed west. No sound.  Moving to fast to be a plane and at high altitude.  I then went outside and looked up for about 15 minutes when I saw a dim white light that was going the speed of a shootin star.  I thought it was a shooting start but it never dimmed out.  I saw it go all the way across the sky until it disappeared behind the roof of a house.  No sound what so ever but had to be going super sonic speeds. Last night it was clear skies.  A little about me:  I was a skeptic about UFOs being extra terrestrial until I had a orange iridescent orb come flying at me, get about 7 feet away then turned and flew off of a cliff.  This orb was a little bigger than a golf ball and flew at about 20 miles an hour with no sound.  After that I believe that its not all government experiments. I have never seen another UFO until last night. Not sure at all what it was, just felt I needed to report it.",
      "link": "http://www.nuforc.org/webreports/085/S85044.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf43",
      "summary": "These objects, which looked liked stars, stood stationary, yet moved. They moved quite slowly. But there were two.  Near DIA.",
      "city": "denver",
      "shape": "diamond",
      "date": "2011-12-12T00:00:00",
      "story": "These objects, which looked liked stars, stood stationary, yet moved.  They moved quite slowly.  But there were two.  Near DIA. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85059.html",
      "state": "CO",
      "duration": "two hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf40",
      "summary": "It looked like a star, but it stayed stationary and another light moved around it.",
      "city": "denver",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "It looked like a star, but it stayed stationary and another light moved around it. It was too bright to have been a star.  I went in and out of my place, yet it was always there upon my return.  Did notice it before about a month ago.",
      "link": "http://www.nuforc.org/webreports/085/S85058.html",
      "state": "CO",
      "duration": "lasting"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf81",
      "summary": "Large silent silver spheres gliding across sky in formation.",
      "city": "denver",
      "shape": "formation",
      "date": "2011-12-12T00:00:00",
      "story": "Large silent silver spheres gliding across sky in formation. 6 or 7 large silver balls gliding just above the clouds in a triangular formation.   Very cold day could not be balloons.   Moving very slowly.  No noise. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85111.html",
      "state": "CO",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3f9",
      "summary": "Three amber lights in Lakewood, Colorado",
      "city": "denver",
      "shape": "changing",
      "date": "2011-12-12T00:00:00",
      "story": "Three amber lights in Lakewood, Colorado While driving home on I-70 West in Lakewood, I saw three lights in the shape of a triangle in the northeast sky.  I stopped my car, got out, and filmed it.  One of them moved south, while the others stayed in a fixed position.  Eventually, however, they disppeared.  If you look closely at part one, at 2:30, you'll see a bizarre flash of red. Part 1: http://www.youtube.com/watch?v=sePneXhFu5U   Part 2: http://www.youtube.com/watch?v=hIopm-xbTy8",
      "link": "http://www.nuforc.org/webreports/085/S85668.html",
      "state": "CO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8e5",
      "summary": "Huge flying-V appeared to be high in the atmosphere.",
      "city": "denver",
      "shape": "triangle",
      "date": "2011-10-25T00:00:00",
      "story": "Huge flying-V appeared to be high in the atmosphere. It was very high and the lights were faint but large. It was so huge and clearly a flying craft. A gigantic flying-V high in the atmosphere.  It was classic in appearance but must have been massive as it was so high yet was so clearly visible.  It was heading smooth as silk across the sky northwest I believe.  The lights were very faint and if I had not been looking at that part of the sky at that exact moment I would have missed it.  Although faint the white lights were much, much larger than stars in the night sky and they did not break formation which along with the documented shape led me to believe I was looking at a flying craft.  I have seen bright flashes in the night sky before that I cannot explain but this to me is hard proof.  I saw a giant flying -V that was clearly a spacecraft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84752.html",
      "state": "CO",
      "duration": "20 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bc9a0",
      "summary": "Silent V formation over Denver, CO.  ((NUFORC Note:  Report from law enforcement officer.  PD))",
      "city": "denver",
      "shape": "formation",
      "date": "2011-10-19T00:00:00",
      "story": "Silent V formation over Denver, Colorado I parked my car at 11th and Speer I got out and started to put on my uniform shirt and duty belt (I am a Deputy Sheriff).   I was facing east and as I was putting on my belt, I noticed 5 lights grouped in a V shape move over the closed bank building and flew directly over head (west bound).   At first I thought it was a Stealth Bomber, but as I watched I could tell it was numerous objects instead of one object with multiple lights (it didn’t stay uniform in shape).  The lights were hardly noticeable like they were darked out or dimmed.   My next thought is it was some kind of military jets flying in formation, but as they flew past I waited for the sound of a jet engine, but heard nothing.   These crafts were completely silent.  I watched as they flew west bound and lost sight as they neared the mountains.   These objects were flying fast about the speed of a hurried F-16.  I would estimate their altitude between 1,500 and 4,000 ft.",
      "link": "http://www.nuforc.org/webreports/084/S84625.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9a2",
      "summary": "Breen ball",
      "city": "denver",
      "shape": "fireball",
      "date": "2011-10-19T00:00:00",
      "story": "green ball   Huge green light seen at 225 am wow .  falling at a angle.  want ti know witch way it went ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84623.html",
      "state": "CO",
      "duration": "green light"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9c9",
      "summary": "We were camping in Colorado in the mountains. On our way back Sunday July 3rd we were driving and my girlfriend said whats that?  I loo",
      "city": "denver",
      "shape": "light",
      "date": "2011-07-17T00:00:00",
      "story": "We were camping in Colorado in the mountains.   On our way back, Sunday, July 3rd, we were driving and my girlfriend said whats that?    I looked out my driver side window and saw what looked like a silver triangular shaped object.   I slammed on the brakes and got the camera out.  When I stopped it started to move west and the dart back to east stopping.   Then repeating the same pattern two times almost identical.   Then it moved west and suddenly went behind a peak we didnt see it again. I have three pictures.  The orginal and two I reduced the noise and shadows to reveal more of what was behind the brightness in the picture.   Very crazy stuff.",
      "link": "http://www.nuforc.org/webreports/082/S82329.html",
      "state": "CO",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bcafe",
      "summary": "Cylinder, Spherical, and disc shaped craft making rapid to slow impossible movements, and vanishing.",
      "city": "denver",
      "shape": "cylinder",
      "date": "2011-08-21T00:00:00",
      "story": "Cylinder, Spherical, and disc shaped craft making rapid to slow impossible movements, and vanishing. Orange/Yellow Radiating Vertical Cylinder Hovering approximately 1,500 feet above the ground in the Littleton area.  Performed a series of diagonal moves at high velocity, while vanishing for a couple seconds after each.   After 3-4 of these a second Orange/Yellow Radiating Vertical Cylinder appeared hovering with it - and seemed to be attached to it.  The same series of movements were performed, with the vanishings.   However this time the direction was taken higher into the air and southwest towards the mountains.  The two cylinders then vanished.   Two to three minutes later a craft appeared which was disc shaped with 8-10 more yellow than orange lights.  This craft moved slowly towards Colorado Springs and what appeared to be following a high speed commercial plane from the lights on it (red, blue, white).   At this point I thought it would be a great idea to get this on camera and go in the street and try and film it.  After going outside for a couple of min! utes - a spherical craft that was a dull orange and seemed to fade as the glow approached the edges of the sphere appeared at about 500 ft off the ground and only 1000 ft from myself.   This craft moved south towards Colorado Springs - during this sighting I felt paralyzed and connected with the sphere.   The 2nd part of the first sighting was confirmed with someone via telephone during the events.",
      "link": "http://www.nuforc.org/webreports/083/S83333.html",
      "state": "CO",
      "duration": "20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbba",
      "summary": "White Triangle in Denver Colorado",
      "city": "denver",
      "shape": "triangle",
      "date": "2011-07-17T00:00:00",
      "story": "White Triangle in Denver Colorado I was on my way home from school listening to \"calling occupants of interplanetary craft\" when I had a feeling I should look up and there was this white triangular object.   It silently moved across the sky and then all of a sudden it disappeared!   There was a blue sky and there is no way the object could have hidden behind a cloud.",
      "link": "http://www.nuforc.org/webreports/082/S82486.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbb0",
      "summary": "Several spheres over Denver - Visibile with polarizing glasses and invisible to normal glasses.",
      "city": "denver",
      "shape": "sphere",
      "date": "2011-07-04T00:00:00",
      "story": "Several spheres over Denver - Visible with polarizing glasses and invisible to normal glasses. While at the corner of N Speer Blvd and 14th, I noticed several white spheres floating in a circular pattern over the Western edge of Denver.  These appeared to be about half the size of a dime held at arm’s length.   One of the spheres was leaving this tight cluster and going out about the distance of 40 or so of the spheres.   There was a slight haze around the cluster, and a smaller haze around the individual object, but the spheres at the center were CLEARLY visible.   Confused as to what I was seeing, I removed my prescription sunglasses (which are polarized), and put on my non-polarized indoor prescription glasses.  With these glasses on, the objects were COMPLETELY invisible against the bright blue sky.   For nearly five minutes, I watched them with my sunglasses on, and during this time I tried to watch them several more times with my normal glasses.  The objects remained invisible to my non-polarized glasses.   After approximately five minutes, the objects began heading west towards the mountain at a fairly high rate of apparent speed.",
      "link": "http://www.nuforc.org/webreports/081/S81964.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcde3",
      "summary": "Black and shiny object flying over Denver CO",
      "city": "denver",
      "shape": "other",
      "date": "2011-06-12T00:00:00",
      "story": "Black and shiny object flying over Denver CO I was sitting at my desk playing around on the computer with the blinds open.  My window faces out to the East and I have a pretty good view of the sky from where my desk is at my house.   I saw something black and shiny heading towards my house about 6-9 thousand feet up.  Lower than your usual aircraft coming in to land at DIA.  As it flew closer, I could see it tumbling over itself repeatedly and thought maybe it was a balloon at first.  But as it approached closer, I could see the sun reflecting off it very brightly and could easily tell that it wasn’t a balloon.  It started to get a little larger as it came closer and I ran outside to get a better look.  I am so glad I did that because what I saw next confirmed what I was hoping for all along. As I stood on my porch, I was able to see this thing pretty well at that point.  It was very black and shiny and was shape-shifting from a star-like object, into a triangle object and then into something I cannot even describe on any level.  But it changed shapes as it continued to tumble over itself.  But every time it tumbled, you could see something different going on, almost as if it needed to tumble in order to accomplish a particular task.  I don’t know…that’s the best way I can describe it I guess. At any rate, after watching this for 1-2 minutes, I watched it for as far as I could before it flew completely out of sight.  However, someone from downtown Denver should have been able to capture this thing well depending on his or her location.  It was heading towards the news stations so they should have been able to see this thing too. I hope someone reports it besides me.  Oh yeah, the camera on my phone wouldn’t have captured it as my phone is almost 4 years old.",
      "link": "http://www.nuforc.org/webreports/081/S81726.html",
      "state": "CO",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd61c",
      "summary": "Small bright silver round observation orb hovering and floating about in front of a Colorado beep blue sky regardless of wind atmospher",
      "city": "denver",
      "shape": "sphere",
      "date": "2012-05-13T00:00:00",
      "story": "Small bright silver round observation orb hovering and floating about in front of a Colorado beep blue sky regardless of wind atmospheric movement.  Elongated into a cigar shape briefly then back just before diapering without moving away.",
      "link": "http://www.nuforc.org/webreports/087/S87796.html",
      "state": "CO",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd76a",
      "summary": "Dark, silent object moving slowly over Denver.",
      "city": "denver",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "Dark, silent object moving slowly over Denver. Working outside, late at night, my crew and I all observed an object around 100-500feet above the ground moving southward towards downtown Denver at a speed of no more than 50mph.  There was absolutely no sound from the craft, no light emitted and the craft was completely black and/or cloaked.  We could not determine the shape of the craft but it appeared as a giant black blob in my eyes.",
      "link": "http://www.nuforc.org/webreports/093/S93434.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd998",
      "summary": "Unidentified box looking object flying across Denver Metropolitan area under intelligent control.",
      "city": "denver",
      "shape": "other",
      "date": "2012-10-30T00:00:00",
      "story": "Unidentified box looking object flying across Denver Metropolitan area under intelligent control. I was northbound on Colorado Blvd (aka State Hwy Colorado 2) going to work in Commerce City when I first saw the object about 500 feet high maybe 1/4 of a mile away.  I was able to get off the road at 52nd and get out of my car and just watch it.  I saw what looked like a big black wall....flying.  When reality hit me and I remembered there's nothing aerodynamic about a wall I just stared at the thing all the time looking for a witness, but there was no traffic on an ordinarily busy street.  Finally a young Hispanic girl with braces came along but was late to work and I couldn't even get her to look at the object.  It continued flying in a southeasterly direction and about 15 minutes later out of sight.  Important to note that it flew across Interstate 70 approaching Interstate 270 at right around 2:40PM and anybody looking up should have seen it.  The most disturbing thing is I had a good cellphone with a decent camera but I didn't even think about it and i! t remained in it's holster.  As I was watching it from behind there was at least one column like looking thing attached to the rear so ultimately I would say it was like a flying box with a propulsion mechanism attached.  It also appeared to fly over Interstate 225 a few minutes later and not far from Buckley AFB.  No noise heard during the entire encounter and as close as it was, there should have been something.",
      "link": "http://www.nuforc.org/webreports/093/S93583.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb5a",
      "summary": "At approximately 8:15pm mountain time on Wednesday 6/20/12 I saw an Unidentified Flying Object over Denver Colorado. There was a weat",
      "city": "denver",
      "shape": "triangle",
      "date": "2012-07-04T00:00:00",
      "story": "At approximately 8:15pm mountain time on Wednesday 6/20/12 I saw an Unidentified Flying Object over Denver Colorado.  There was a weather system moving from the south to the north. The leading edge of the system had broken up into small clouds creating small gaps of clear sky.  I saw what  I thought was an airliner.  I realized this object was moving to fast to be a passenger plane.  However it was at approximately the same height as a high fling airliner, somewhere in the 25000 ft range. The object itself was white. It was triangular shaped.  The leading point was farther away from the the 2 aft points making an elongated triangle. This object was moving very fast defiantly not fast enough to be an airliner.  There was no sound.  The light was very good.  The sun was at a great angle to reflect off the object while being behind the clouds of the weather system.  There was no trail or aura. I am a enthusiast of military air craft. I know the difference in shape of most military air craft.  This was not a fighter jet.  This was not an F-117 or B2 bomber. I have  a physical every year and my eye sight is checked at that time.  It has been checked at 20-10 vision.  This is better then 20-20. I can see very well. If I had to guess I would say this object was man made.  I would say it is a lifting body possibly a space plane, a plane capable of flying from ground to orbit to back.  I would guess it is the new spy plane to replace the SR-71 blackbird. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89768.html",
      "state": "CO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be01e",
      "summary": "Orange egg lights",
      "city": "denver",
      "shape": "egg",
      "date": "2012-08-19T00:00:00",
      "story": "Was on 27th floor in downtown Denver saw five orange balls as I WAS LOOKING southwest twords RedRocks and saw orange light balls in the sky coming from south to north -not a normal plane flight pattern accross my window.  Two led the way  and came close to each other and started moving west-two other were close behind and then another came into site fron behind a building.  Four started moving west and another straggeled after them-the fifth came twords the building and then back tword the other five.  I got my binoculars and watched the five head west tword the mountains -then two more came into sight- 7 in total. There was no sound -of helocopters-I dont know if they have orange lights-the craft looked like an upside down egg with the bottom cut off and there was a light rotating around the bottom. Ive never seen 7 helocopters out at once and heard no noise-just strange orange egg lights.",
      "link": "http://www.nuforc.org/webreports/091/S91838.html",
      "state": "CO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be471",
      "summary": "Orb over Denver tonight was a helium balloon",
      "city": "denver",
      "shape": "other",
      "date": "2012-08-19T00:00:00",
      "story": "Orb over Denver tonight was a helium balloon Hello Peter and center volunteers/researchers.   I'm a UFO hound and I wanted to dispel any possible false identifications this evening.   I was at a birthday party in SE Denver (roughly Iliff Ave and Colorado Blvd)with probably 25 attendees.  My children were playing with a bouquet of balloons and a large (probably 15\" x 4\") cylindrical helium filled balloon broke free and rapidly began to ascend.  People see a lot of orbs and spheres and this is one that we can effectively rule as \"identified.\".  I wanted to file a report out of respect for the purity and importance of the research that you do.  I think it's very possible that you might receive some sightings because of the balloon's startling altitude which I'm guessing was at least 1,500 feet.  The balloon traveled in a pure westerly direction at 5-10mph. ((NUFORC Note:  No reports, yet, but we are grateful to the source of this report for sharing the information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91935.html",
      "state": "CO",
      "duration": "08 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be4aa",
      "summary": "three bright objects at a stand still east of denver!  one medium object at stand still! second object below the top one! but way more",
      "city": "denver",
      "shape": "disk",
      "date": "2012-07-04T00:00:00",
      "story": "three bright objects at a stand still east of denver!  one medium object at stand still! second object below the top one! but way more illuminated than the other one's! third object can barely be seen through binoculars all objects looks like illumat ed horizontal line!",
      "link": "http://www.nuforc.org/webreports/090/S90288.html",
      "state": "CO",
      "duration": "currently stil there 5:18"
    },
    {
      "_id": "64d005f478aba2ec5a3be8f6",
      "summary": "UFO- looked like a bright star with red wings.",
      "city": "denver",
      "shape": "diamond",
      "date": "2012-04-18T00:00:00",
      "story": "UFO- looked like a bright star with red wings. I saw what looked like the giant and brightest star in the sky, but it had red wings like some sort of aircraft.  It moved in a fairly straight line very fast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88237.html",
      "state": "CO",
      "duration": "a few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb85",
      "summary": "Small Metallic Disc Sighted in Denver, CO.",
      "city": "denver",
      "shape": "disk",
      "date": "2013-02-04T00:00:00",
      "story": "Small Metallic Disc Sighted in Denver, CO Driving eastbound on Hampden Ave. (Hwy 285) in Denver,Co. As I was approaching the Federal Blvd. exit, a flash caught my eye. A small (6-12 ft.) wide classic shiny disc was flying northbound across the horizon.  I followed it with my eyes for a moment and then it just disappeared into thin air, which was pretty amazing.  I scanned the sky to see if maybe I had just lost it for a moment an at the same time was fumbling form my phone to take a shot in case I found it again.  As I scanned I noticed a dark helicopter in the vicinity flying low at about the same elevation the craft was at.  The helicopter was quite a distance off from the craft but it gave me the creeps as I am a UFO enthusiast and realized the implications.  In no way did I leave the house today wishing to sight a UFO, I am far too intelligent for hoaxes and am a true believer so would never tarnish the subject.....Extra terrestrial??  Not enough time to give a 100% thumbs up on this...I have never se! en a UFO before this day....",
      "link": "http://www.nuforc.org/webreports/096/S96035.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3becc5",
      "summary": "NO Lights or sound. Block stars light the only way it could be viewed.",
      "city": "denver",
      "shape": "triangle",
      "date": "",
      "story": "NO Lights or sound.  Block stars light the only way it could be viewed. Location: Denver, PA.  222 S. and Colonel Howard Boulevard Direction of view: N.W. Elevation: 90 Degrees Colon: Black and Triangular Object: Only One Speed: 20 to 30 MPH My wife and I were getting off 222 traveling North onto Colonel Howard Blvd W.. It was around 8:00 pm. Very dark skies. Only stars viewable. Object was triangular and very large. 100Yrds. No lights. No sound. Only way we could see it was because it block the stars as it passed. Though I would report it. Never seen anything like it. I am very well versed on air crafts. I know the speed was not enough for lift. It moved like a balloon, but it was not a balloon.  If you have any other questions my e-mail is: ((deleted)) ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97605.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beda4",
      "summary": "Transparent red balloon/bubble thing with lights. Had intelligence",
      "city": "denver",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "Transparent red balloon/bubble thing with lights. Had intelligence I was driving down Colorado Blvd going back to my sisters house when out of the corner of my eye I saw something with lights hovering above the church on 38th. I did a u-turn on 40th and turned on 38th then stopped.  I recorded it on my sisters cell phone. While recording I noticed that the object was not showing up on the screen even though I was looking right at it.  I then stopped a guy that was walking and asked him if he saw it. He said \"ya you mean that square thing with the lights, it looks like a kite\"  It was NOT a kite. It was 2:30am. I then left and drove the short distance to my sisters.  I told her about it. When I told her it was still there when I left she wanted to go see if it was still there.  We drove back to that area and it was there hovering above the church.  We stopped on 38th and sat there bewildered as to what this object was.  My sister told me to drive under it. 02 Apprehensively I decided to drive down the alley just after the ! parking lot of the church.  As we maneuvered south down the alley the object hovered above but even with the car as it moved. When we reached 37th I turned left and stopped.  The object was hovering over 37th. As we were stopped a truck passed us and pulled over to see what we were looking at. They saw the object and thought it was peculiar.  They went about their business. My sister was trying to photograph the object (which we both concluded looked like a red transparent bubble with bluish white lights that seemed to be eyes.)   When the flash went off the object hovered/floated behind some trees as if it were trying to hide. I backed up down the street so we could see it.  I then decided to see if it would \"follow\" us and drove back up the street and it did indeed stay in close proximity to the car.  We parked in the church parking lot and got out. It was not threatening in anyway, just odd.  The two guys in the truck drove back by, saw us still looking and pulled into the parking lot.  The four of us could not determine what it ! was.  It did somewhat resemble a balloon so one of the guys tried to locate where a string was that would be tethering the object and was unsuccessful. Meanwhile my sister called her boyfriend and he showed up.  He too was baffled as to what this floating/hovering object could be.  The two guys in the truck left and my sister, her boyfriend and I just watched.  It seemed to be looking at us with the lights.  The lights moved as if it were thinking or computing.  I'm not sure of the correct word... It had intelligence.  By the time we left it was 4:00am and the object never went out of sight.  We left it, it didn't disappear.  During this time we also saw 2 what seemed to be stars go from standstill to across the sky.  It was like they took it out of park and moved quickly across the entire sky.",
      "link": "http://www.nuforc.org/webreports/101/S101155.html",
      "state": "CO",
      "duration": "1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3beefa",
      "summary": "Daytime sighting in Denver City Limits, witnessed UFO color, communications, movements of 6 flying craft.",
      "city": "denver",
      "shape": "oval",
      "date": "2013-07-03T00:00:00",
      "story": "Daytime sighting in Denver City Limits, witnessed UFO color, communications, movements of 6 flying craft. Working tech support in a skyscraper downtown Denver, 18th floor, looking north over Denver, Commerce City.  A sun-shining Sunday afternoon, I watched a lone, low storm cloud move southward towards the city.  As I was helping a customer fix email connectivity, I focused on watching the cloud swirls and wisps.  I noticed a shiny flicker under the cloud ceiling.   As I honed in on the shine, I clearly saw 5 oval, pill shaped crafts, stationary in a 5 dot pattern formation.  The ships would then all swing up and out, down and back in to produce a new 5 dot pattern. (I likened it to braille patterns.  I got the impression they were producing communication with the different patterns.)  They continued to display different patterns.  I quickly put my customer on hold and ran to an adjacent room where 4 of my co-workers were on calls.  I hollered with authority for all of them to put their calls on hold and hurry to my window.  All 5 of us stood at the window watching these crafts move.   I then noticed, under the southern most tip of this lone storm cloud, was a 6th craft fully stationary.  As if in a supervisory roll, or to monitor any \"dot pattern\" messages being sent to them, idk.   The storm cloud was not high in the sky, it was smaller and by itself, so lots of sun shine.  All 6 air ships had dark bottoms and shiny metallic roofs.  I figured the dark bottoms helped them stay concealed under the dark looking storm cloud.  You probably wouldn't notice them being underneath, they may not have caught your eye to make you look up.  Remember, I was on the 18th floor looking across to them.   They flew over the area of Rocky Mountain Arsenal State Park, or the Oil Refinery in Commerce City.  The was no lights, no sounds, no flares or fire or smoke.  The movements were controlled and intelligent, similar to two like magnets repelling, but controlled. After the sighting, I emailed Art Bell at Coast to Coast AM and the local NBC 9 news station, although never hearing anything back.   These ships were real, in the daylight, and very close to the Denver vicinity.",
      "link": "http://www.nuforc.org/webreports/098/S98366.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0c6",
      "summary": "Saw flying spheres .",
      "city": "denver",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "Saw flying spheres . Saw a small unmoving white sphere at cloud level.   About two minutes later a commercial jet flew under it halfway between it and ground.  Another minute or so later another small white sphere quickly passed directly above the first sphere going from north to south.  Then clouds obscured it.   About 20 minutes later one other witness and I again saw two small white, spheres about one half mile east of us over Denver quickly going from north to south.  They were in unison, one slightly above and behind the other as they passed from view.  Their altitude was only a few hundred feet.",
      "link": "http://www.nuforc.org/webreports/098/S98435.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf50d",
      "summary": "Observer see 2 orange spherical objecta seperated by about 40 seconds.",
      "city": "denver",
      "shape": "sphere",
      "date": "2013-10-14T00:00:00",
      "story": "Observer see 2 orange spherical objecta seperated by about 40 seconds. I was driving home and saw an orange spherical object.  There was a church parking lot and I parked the car there and saw what appeared to be an spherical object at about 400 ft altitude traveling in a straight line path at about 35 MPH and at about 400 feet altitude (very rough estimates), this object was observed partially through car's windshield and partly from outside the car.  The elevation angle was loe perhaps 20 degrees.  I lost sight of the object as it passed on the otherside of a line of trees.  About 40 seconds after this event expired I saw a 2nd and apparently identical object following the same flight path and speed/altitude as the first object.",
      "link": "http://www.nuforc.org/webreports/102/S102983.html",
      "state": "PA",
      "duration": "~4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5fb",
      "summary": "Triangular light formation over Denver on the 4th.",
      "city": "denver",
      "shape": "light",
      "date": "2013-07-14T00:00:00",
      "story": "Triangular light formation over Denver on the 4th. My girlfriend and I were watching fireworks from our balcony on the 8th floor.  Looking directly North we have an open view of the city.  I'm not sure the exact time as the fireworks started about 21:00 hours and continued for most of the night but my best estimate would be somewhere around 22:00-23:00 hours. As we watched the fireworks over the city we both noticed three lights moving around about 15-20 degrees above the horizon.  Their distance from us was hard to judge but my impression was that it was a good distance away &gt;4 miles.  The lights seemed to fade in and out of sight in order from three to one then three again.   The three lights maintained what seemed an equal distance from each other at all times.  A perfect formation in a triangular shape.  If the lights were on the corners of a flat triangular shape then the flat plane of that object looked to be twisting and rolling slowly but the lights remained visible.  The size of the lights were much larger than any of the surrounding fireworks which made them stand out more and the color was the light yellow of a typical street light as I recall.",
      "link": "http://www.nuforc.org/webreports/099/S99886.html",
      "state": "CO",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7c5",
      "summary": "Triangular shaped object with a large round light on what appears to be the bottom.",
      "city": "denver",
      "shape": "triangle",
      "date": "2013-09-30T00:00:00",
      "story": "I was walking my dog around the park, being a avid photographer I always take along my camera, I saw a small spec of light in the sky, it was just sitting there not appearing to move, I had a 200mm lens on the camera and so I took a picture, when I got home I looked at the picture and saw I had snapped a small spec of light, nothing really showing up until I enlarged it by cropping, I saw I had taken a triangular shaped object with a large round light on what appears to be the bottom. I will send Photo. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102692.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf85b",
      "summary": "Light objects appearing over North Denver in a triangle formation.",
      "city": "denver",
      "shape": "fireball",
      "date": "2013-09-30T00:00:00",
      "story": "light objects appearing over North Denver in a triangle formation My husband and I seen 3 light objects above North Denver.  In a triangle formation, At first it looked like a fire work but it was standing still in mid air for awhile. The bottom right object was fading away and reappeared east of the formation. Then quickly moving side to side. It kind looked like it had tail at the end of the object. It quickly moved back to its original spot in the triangle formation. There was a helicopter flying around the object and soon there were several after the three objects disappeared.  That’s how low the objects were to the ground. We could visually see the helicopters. Took a picture of it with phone and will send it in. Looked on net for others who might have seen it with no luck. Also there was a car that lost power near our intersection, they thought they ran out of gas, put gas in and that didn’t work. The car did manage to start after awhile. And our car that was parked outside, lights did not seem to be working but work! ed afterward. Weird stuff. First time we ever experienced something like this.",
      "link": "http://www.nuforc.org/webreports/102/S102578.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf860",
      "summary": "Silent and Fast-Moving Orange Orb Over Denver",
      "city": "denver",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "Silent and Fast-Moving Orange Orb Over Denver On the evening of 5/11/13 my wife and I had our good friends over to our new house for dinner and to sit out by our fire pit afterward.  It was near the end of the evening (somewhere between 10:30 PM –11:00 PM) when a helicopter flew over and put its spot light right on us which was weird but also had it on the neighborhood briefly.  We live in a quiet neighborhood in south-east Denver and just moved from north-east Denver where police choppers – especially on the weekends were common so while this was strange we didn’t really think much of it.  What was weird and unexplainable is what happened next…   About 2-3 minutes after the helicopter flew over, we all were still a little sensitive to things flying overhead and we all saw a strange orange light moving quickly towards us from the south west (it appeared to be moving as fast as a fighter jet) but made no sound at all.  As I mentioned our neighborhood is quiet and neither of us could hear anything coming from this object.    When the object appeared directly overhead we could all see a light orange circular craft of some kind with a darker orange center that sort of pulsated but there were no blinking lights like you see on an airplane or helicopter.   We watched the object travel north east and at which point I brilliantly decided to get a video of it on my phone but I was just a tad too late.   By the time I looked up and my wife and our friends stopped making fun of me for thinking of this after it was well over our location, the object disappeared.  It was probably 20 miles or more past our house by the time we lost sig! ht.  I noticed another report came in from Steamboat Springs, CO that same night that has a similar description of the object we saw.   My wife and I and our friends (also husband and wife) are all well-educated people but none of us have ever seen anything like this.  Even with that said, we all kind of blew it off but I decided to check out if there was a way to report it since I have thought about it several times in the past couple of weeks since it occurred.   I’m sure there’s an explanation for what we saw but figured it’s worth reporting anyway.",
      "link": "http://www.nuforc.org/webreports/097/S97817.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf85c",
      "summary": "3 orange spheres.",
      "city": "denver",
      "shape": "sphere",
      "date": "2013-09-30T00:00:00",
      "story": "3 orange spheres over denver night sky, with comet like tails, moving in triangular formations one disappear and reappear.",
      "link": "http://www.nuforc.org/webreports/102/S102566.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf967",
      "summary": "Blue/sphere of light.",
      "city": "denver",
      "shape": "circle",
      "date": "2013-10-14T00:00:00",
      "story": "blue/sphere of light The object was a blue, spherical orb of light that shot across the sky, then vanished.  It was a like a spot light with no beam,  it was just the color at the end. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103062.html",
      "state": "CO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa98",
      "summary": "Star-like lights moved together over Air Force base in a V formation, then suddenly began to separate and then just go dark.",
      "city": "denver",
      "shape": "unknown",
      "date": "2013-09-30T00:00:00",
      "story": "Star-like lights moved together over Air Force base in a V formation, then suddenly began to separate and then just go dark. I was looking up at the stars last night when I noticed a satellite above. I then grabbed my cousin and uncle who were there with me to see it.  As I was trying to spot the slow moving dot in the sky I noticed a group of stars which I thought was just a constellation start to move south across the sky.  This group of stars was in the shape of a V and spaced almost perfectly apart.  As I frantically tried to point the group out to my family the stars began to separate and then suddenly went dark.  At that second my uncle found the satellite and the group was nowhere to be found.  My uncle lives right by DIA and the Air force base so I know what planes, helicopters, and even jets are capable of. None of those could have gotten as high as these lights were, and if they were anything humans make why did they just go dark all of a sudden instead of staying lit up like the satellite.",
      "link": "http://www.nuforc.org/webreports/102/S102684.html",
      "state": "CO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe13",
      "summary": "Ufo shoofing thru the sky during a national broadcadt. (NFL) 9/5/13.",
      "city": "denver",
      "shape": "disk",
      "date": "2013-09-09T00:00:00",
      "story": "Ufo shoofing thru the sky during a national broadcadt. (NFL) 9/5/13 I have on my DVR a craft flying thru the sky durning opening night nfl football.  If you pause the dvr you can see a flat looking shape.  There is also a plane in the broad cast moving at a speed no where comparable to the speed of the light.  If I could send the the clip I would. Pretty cool stuff.",
      "link": "http://www.nuforc.org/webreports/101/S101943.html",
      "state": "CO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0347",
      "summary": "lights splitting into multiple orbs",
      "city": "denver",
      "shape": "light",
      "date": "2013-07-05T00:00:00",
      "story": "lights splitting into multiple orbs my wife and I and her mother and moving step father was.watching fireworks over the city and there appeared a light in the sky due.north.   it split.into 2 lights then 4 then 6 the split up and hovered ..being independence day I know your thinking &quot;fireworks&quot;  I did too utill the lights came together and made 3 lights they moved precisely into a triangle and then moved back together.to form 1 light that moved north and faded out… iv been searching to see if anyone has reported it but have had.no luck ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99712.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0489",
      "summary": "Triangular UFO hovering over Lancaster, PA.",
      "city": "denver",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "Triangular UFO hovering over Lancaster, PA On January 17 2013 at approx. 9:45 pm EST my boyfriend and I were driving home from my work on North Reading Road when we both saw what we assumed to be a weird airplane hovering in the sky.  We drove down a different road to get in closer to the craft.  We got almost directly underneath it when we realized that this was not an airplane but dark metallic colored triangular shaped flying object. It did not make any noise and was hovering over the development.  It then made a sharp and very fast manuever over to the right, slowed its pace for a bit and the shot off into the distance.  Within seconds it appeared to be miles away!  It had to white lights on the upper corner and on the bottom right corner, with one red light in the middle.",
      "link": "http://www.nuforc.org/webreports/096/S96010.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0533",
      "summary": "Silver blue metallic spheres with glowing orange centers,under intelligent control./Denver.",
      "city": "denver",
      "shape": "circle",
      "date": "2013-02-04T00:00:00",
      "story": "Silver blue metallic spheres with glowing orange centers,under intelligent control./Denver. I clearly witnessed two silver blue metallic orbs with glowing orange centers traversing rapidly at about 2000ft. high in a defense formation one slightly above the other.  Heading in a southeast direction towards cherrycreek resovoir.   The sky was clear bright blue witch made me notice them,they would slightly deviate from one another and then come quickly closer together staying in tight formation.  Far in the distance were military jets that were off doing there own thing looked like the usual chemtrail spraying seen every afternoon here in denver.  Thank you,peter.",
      "link": "http://www.nuforc.org/webreports/096/S96056.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0655",
      "summary": "Bright orange light cruising over Denver!!!  The orb went lights out and looked like a giant bubble. Silent too!",
      "city": "denver",
      "shape": "oval",
      "date": "2013-02-18T00:00:00",
      "story": "Bright orange light cruising over Denver!!!  The orb went lights out and looked like a giant bubble. Silent too! My son saw the bright orange light in the sky going West to East in the sky.  I looked up and saw the same thing.  It appeared to be moving fast straight toward us with no sound.  We yelled for a person in house to come see.   The light went off and the altitude dropped just above tree top level.  We could still see it when it went lights out.   At that point it looked like a big bubble that was changing shape.   The thrid person saw it with lights off.  The orb Changed shape like a bubble blown with soap. The size was hard to tell but it looked to be 8 or 10 feet around.   Even though it drop in altitude it kept going directly in the path of the street until it was out of sight.   There was no wind, no noise and before it went black it was bright orange.   Most bizarre thing I have seen flying through the sky.  I hope I see one again.   :)",
      "link": "http://www.nuforc.org/webreports/096/S96356.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c076b",
      "summary": "Silver circle with black triangle ahead of storm.",
      "city": "denver",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "Silver circle with black triangle ahead of storm There was one flat disk object.  It flew directly overhead.  From below, looking up, it was a silver/grey circle with a large black equilateral triangle across the center reaching its points to the edges of the circle.  There was also a pattern of a few simple black lines across the grey area.  It was traveling low and fast, just at the height and ahead of a thunderstorm rolling in.  It appeared to either be being pushed by or trying to outrun the thunderhead.  It was very easy and clear to see and I watched it for about a minute as it flew off into the distance. Observer is a young 30s, mother, professional teacher with no previous UFO experiences.  I'm just curious what it was because it was so obvious and clear.  I assumed it was something to monitor the storm, but can't find info on any weather instruments that match the description. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105661.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c07ca",
      "summary": "5 Orange Orbs lift off in north Colorado.",
      "city": "denver",
      "shape": "other",
      "date": "2014-01-10T00:00:00",
      "story": "5 Orange Orbs lift off in north colorado. So it's tradition for our household to make it a point to go see a movie on Christmas day. The last few years we've been getting to the latter showings but we got to a show mid afternoon this year.  By the time our film was over it was dusk and by the time we got home it was dark.  My street is caddy-wampus, so the front faces north and east.  And if you look polar north, neighboring trees block the horizontal view.   Well as soon we backed into our driveway, we all took notice to a strange grouping of orbs all glowing orange traveling in the night sky.  We noticed they had a vertical trajectory, and one right after another they came up in the northern hemisphere as something that raised up into plain view, and came to stop at the same point in the sky, pulsated for a moment than vanished.  We seen 3 objects one right after another within a 5-10min span of time do this.  We though that was it, than 2 came up side by side with how manyever feet of distance between them, could've been a couple of miles could have been more. Same song same dance.  Amazing! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105645.html",
      "state": "CO",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a51",
      "summary": "Bright white orbs or points of light in cloud.",
      "city": "denver",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "Bright white orbs or points of light in cloud I noticed four incredibly bright orbs (or perhaps they were points of light from beams) inside a cloud near my house.  The orbs would meet near the middle of the cloud then each go in separate directions to skirt the edge of the cloud.   They did not make predictable circular patterns or back and forth patters such as from a spotlight on the ground, but rather changed course to stay within the boundaries of the kidney-bean shaped cloud.   There were no spotlights on the ground such as those you see during grand openings, and  frankly, the orbs were too bright, incredibly bright.  When I did see a shaft of very faint light, it seemed to be coming from ABOVE the cloud.  I am hoping there is a mundane explanation for this but I have never in my life seen anything like it.",
      "link": "http://www.nuforc.org/webreports/106/S106002.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e32",
      "summary": "I'm not sure what I saw 4-5 lights fell from the sky over Denver it looked like shooting stars but they changed direction they went da",
      "city": "denver",
      "shape": "sphere",
      "date": "2013-12-23T00:00:00",
      "story": "Im not sure wat I saw 4 or 5 lights fell from the sky over Denver it looked like shooting stars but they changed direction they went dark for a second or two then light up again",
      "link": "http://www.nuforc.org/webreports/105/S105269.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e8f",
      "summary": "4 lights over Denver. 2 turned into 4.  As they dropped from the first 2, very bright flare trails seen ascending.",
      "city": "denver",
      "shape": "sphere",
      "date": "2013-12-23T00:00:00",
      "story": "4 lights over Denver. 2 turned into 4.  As they dropped from the first 2, very bright flare trails seen ascending. Driving home headed west and 4 very large bright spheres appeared in the sky over Lakewood. Two of them dropped what looked like flares that turned into the other two lights. (4 total) The lights headed west and that was it.  The light spheres were about as big as a blimp but they moved way faster. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105315.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0eec",
      "summary": "Green light moving erratically over Stapleton at 3 am.",
      "city": "denver",
      "shape": "light",
      "date": "2014-01-24T00:00:00",
      "story": "Green light moving erratically over Stapleton at 3 am On my way to work at 3 am I observed a bright green light moving erratically in the sky over the Stapleton neighborhood near the old airport tower.  The speed at which it moved and change direction indicated that it was not an airplane or helicopter.  It was moving north to south then dipped quickly out of sight.  It made no noise and reappeared moving slowly, the bright green light turned to red then to a white light, it then quickly dipped down again out of sight.  I have a science background and am very analytical, but I can't explain what it was that I was seeing.",
      "link": "http://www.nuforc.org/webreports/106/S106414.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1152",
      "summary": "Black oval shaped object moving slow with no change in elevation.  Snowy conditions and low clouds, but object was well below clouds.",
      "city": "denver",
      "shape": "oval",
      "date": "2014-02-07T00:00:00",
      "story": "Black oval shaped object moving slow with no change in elevation.   Snowy conditions and low clouds, but object was well below cloud cover.   I was driving south bound on Colorado Blvd and  crossing  over  E. Bayaud Ave.   The object was moving east to west and seemed to be pretty much heading to go over the Cherry Creek mall.    Went  out of my field of vision with me honestly scratching my head.",
      "link": "http://www.nuforc.org/webreports/106/S106922.html",
      "state": "CO",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c15b2",
      "summary": "3 falling fireworks streams changing into 3 bright hovering lights.",
      "city": "denver",
      "shape": "light",
      "date": "2013-11-20T00:00:00",
      "story": "3 falling fireworks streams changing into 3 bright hovering lights. ((NUFORC Note:  There is a time discrepancy in the report.  The report arrived at NUFORC at 18:10 hrs. (Pacific), but the witness indicates that the sighting occurred at 19:30 (Mountain).  Not possible.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104545.html",
      "state": "CO",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1823",
      "summary": "I caught a picture of a disc!!!",
      "city": "denver",
      "shape": "disk",
      "date": "2014-07-20T00:00:00",
      "story": "I caught a picture of a disc!!! We watched the show for the 4th of July on a hill outside of the Sports Authority Stadium.   I heard a lot of people asking, \"What is that??!!?\"  I laughed, said para sailors.   As four squirming fires fell, we could tell that they were attached to parachutes.  Snapped a photo and thought nothing of it.   When  I saw the para sailors, I WITNESSED the airplane that dropped them off fly away.    My finace was really excited asking me if I had seen the disc.  I said no.  He said it was clear as day.  So I shuffled through my photos and could NOT believe my eyes.....I noticed quite a few of my friends saying they saw something as well.   I think I have a photo of it. July 4, 2014  Denver, Co",
      "link": "http://www.nuforc.org/webreports/111/S111586.html",
      "state": "CO",
      "duration": "Not sure"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a31",
      "summary": "5 fast moving lights seen over Denver.",
      "city": "denver",
      "shape": "light",
      "date": "2014-07-05T00:00:00",
      "story": "5 fast moving lights seen over denver 5 yellow lights sighted in south denver area.  these lights remained stationary for approximately 1 minute before converging into an indistinguishable number of grouped lights. then, individual lights began to break free from the grouping, traveling out of sight at incredible speed.   When two lights remained, They seemed to fade away or just disappear.",
      "link": "http://www.nuforc.org/webreports/110/S110962.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a70",
      "summary": "3 to 4 orange lights moving in a weaving formation caught on video.",
      "city": "denver",
      "shape": "sphere",
      "date": "2014-07-05T00:00:00",
      "story": "3 to 4 orange lights moving in a weaving formation caught on video.",
      "link": "http://www.nuforc.org/webreports/110/S110989.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b09",
      "summary": "At least 50 solid white lights traveling maybe more.",
      "city": "denver",
      "shape": "unknown",
      "date": "2014-07-20T00:00:00",
      "story": "At least 50 Solid white lights traveling maybe more. Through the cloudy evening clouds, I saw a herd of white led looking lights, extremely high in the sky grouped together and some that were very close together and some off in the distance.   The first group was about 25 then saw even more following behind.  At least another 25 plus even more that were hard to count.   There seemed to be more spread out all over but the clouds made it difficult to see.   This cluster appeared southeast of Denver and continued north then they continued in a northeast direction until they were no longer viewable.   Some of the lights looked as if they were staying still then would continue once the other moved.   There was no noise produced by these objects.",
      "link": "http://www.nuforc.org/webreports/111/S111593.html",
      "state": "CO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b08",
      "summary": "15-25 light orbs over southwestern Denver.",
      "city": "denver",
      "shape": "light",
      "date": "2014-07-20T00:00:00",
      "story": "15-25 light orbs over Southwestern Denver I was in my backyard, when I took a quick glance at the sky and noticed there were 15 to 25 light orbs in the sky.  These orbs were white/blue and were flying together in a weird pattern.  I stopped and stared at them for about 20 seconds because I had never seen anything like that before.  I then ran inside my home to let my brother, cousin and mom know what I was seeing and we quickly ran outside to our backyard to see what was going on. These light orbs were flying toward Northeast Denver and were very silent.  As they were heading Northeast, I noticed another orb light flying at a higher rate of speed and caught up to the rest of the orbs.  We continued observing them as they flew through the clouds.  We noticed that three of them stopped and we lost site rest of the rest.  These three orbs were stationary for about 5-10 minutes and then disappeared.",
      "link": "http://www.nuforc.org/webreports/111/S111590.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c3c",
      "summary": "Bright light hovering at DIA.",
      "city": "denver",
      "shape": "light",
      "date": "2014-06-24T00:00:00",
      "story": "Bright light hovering at DIA. We were at DIA catching a flight to Boston.  Our flight had been delayed for several hours due to mechanical errors and then poor weather conditions, so we were on the runway waiting to depart along with several other airplanes that were also delayed.  Our plane was just sitting on the runway waiting for other planes to lift off.  I was looking out the window watching how many planes were just sitting there as it was a really weird to see 8-10 planes lined up like that. It was then that I noticed a small bright light becoming larger and brighter at around 3000 ft and about a ¼ of a mile away from our plane.  I think we were looking towards the South, but I don’t know that for sure.  It was too low to be a planet or star and it was most definitely not a plane or helicopter as it sat stationary.  I asked my friend sitting next to me what she thought it was and she said she thought it was a satellite.  I laughed and said that there was no way it could be a satellite as it was just sitting there and the fact that it was so low and bright, that no satellite could do that, so I kept watching.  This is where it got really weird. It first appeared as a small white-yellowish light that became larger and brighter right in front of my eyes.  Then it became about the size of a dime (a little smaller actually) at arm’s length. It sat there for about 45-60 seconds, moved a little to the left, and then it disappeared. I pointed out to my friend that it just disappeared and she said, “Well, that’s not a satellite then!”  I kept looking to see if it would come back and it did!  This time, it did the exact same thing as before, starting out as small, got bigger and brighter, stayed put for a bit, and then moved to the left, and then it disappeared again.  But this time, my friend saw it come back and watched it do exactly what I described the first time.  We were blown away as it seemed to be observing all the aircrafts lined up waiting to take off. As we were complaining about just sitting on the runway with no movement, it came back a 3rd time and made itself known in the exact same fashion as the previous events.  This time I took a picture of it with my new phone.  I haven’t figured out a way to make the picture bigger or clearer yet, but I’m excited to see what it’ll look like once I do. Also, the following night in Cape Cod, I and 2 other friends had another sighting that just blew our minds!  I’ll make another report for that sighting under the state of Massachusetts in a little while.",
      "link": "http://www.nuforc.org/webreports/110/S110456.html",
      "state": "CO",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c91",
      "summary": "Round, fierey red, stationary object in the sky.",
      "city": "denver",
      "shape": "oval",
      "date": "2014-06-24T00:00:00",
      "story": "Round, firey red, stationary object in the sky. In the southern sky saw a round red object stationary at about two o’clock in the sky.  It did not seem to move but flickered as if on fire.  I did not have any field glasses so this was with normal vision.   The object appeared to be about the size of a pencil erasure held at arm's length.   The object grew smaller as it appeared to travel away from me at great speed.",
      "link": "http://www.nuforc.org/webreports/110/S110431.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c92",
      "summary": "Red round object with naked eye, disk shape with flames through scope in southwest  sky",
      "city": "denver",
      "shape": "disk",
      "date": "2014-06-24T00:00:00",
      "story": "Red round object with naked eye, disk shape with flames through scope in southwest  sky At approximately 9:20 PM, my husband told me to view a red round object in the southwest sky at about 2:00 in our Leica spotting scope.   It appeared with the naked eye smaller than a full moon and larger than a planet.  Viewing it through the scope it appeared to be more of a disk that was tipping slightly up and down and from side to side with white and blue flames exiting the top.  It quickly got smaller as it moved to the south very rapidly in a straight line. ((NUFORC Note:  We spoke via telephone with the source of this report, and she sounded to us to be both eloquent, and sober-minded.  We suspect her report is quite reliable.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110434.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d7c",
      "summary": "During the mid-evening of Thursday, June 5th, 2014, myself, two other adults and three children simultaneously witnessed the following.",
      "city": "denver",
      "shape": "cigar",
      "date": "2014-06-13T00:00:00",
      "story": "During the mid-evening of Thursday, June 5th, 2014, myself, two other adults and three children simultaneously witnessed the following event in the night sky.   Initially, one child alerted all of us to something strange moving through the sky.  It was definitely quite visible, but hardly discernable!!  Shortly, I called the Denver Police Dept. and inquired if anyone had informed them of something in the sky, to which they said no.   While speaking with the DPD dispatch, and having had my phone speaker on from the beginning, she could hear myself and all other witnesses excitedly speaking about first one more, then another, only this one was sort of beneath the one on the top, but they were in sync with each other.   DPD transferred me to the FAA, who also reported no reports of activities in the sky inconsistent with normalcy.\t\t For the next 10 to 12 minutes all six of us witnessed in awe at a beautiful event, ultimately involving not less than six vehicles.   They were all the same in physical appearances.  They moved horizontal and rather slow, by other accounts of vehicles.  They were steady.  They were red but not fiery red.  All of them were like this.  They were definitely well into the sky.  When, from our view point, they all reached what seemed to be the same juncture, this huge white light appeared in the front of each craft.  Then it went out and more white lights appeared, only seemingly from within the red tail.   We noticed that a plane was near-by, prompting one child to remark that it was going to collide with this “thing!”  And it sure did look like this was likely from down on the ground, but nothing happened.  Shortly thereafter, another earthly vehicle went by, both vehicles heading northward, opposite the direction of the UFO’S. \tSince we’re all were able to see the earthly vehicles, it made since to me that the UFO’s had to have been relatively close, and the passing of the earthly vehicles provided me with the only reliable means of discerning how far away and how far up they were (as there was no horizon, no sky line … just sky!",
      "link": "http://www.nuforc.org/webreports/110/S110040.html",
      "state": "CO",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f06",
      "summary": "Small light changed direction and speed, then stopped and became dim as if moving higher out of sight.",
      "city": "denver",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "Small light changed direction and speed, then stopped and became dim as if moving higher out of sight. Hubby and I laying in our new backyard.   Watched what we thought was a star or satellite change direction, move faster or slower, finally stop, and seem to get dimmer, as if moving higher and out of sight.",
      "link": "http://www.nuforc.org/webreports/109/S109815.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c216c",
      "summary": "White spheres.",
      "city": "denver",
      "shape": "sphere",
      "date": "2014-04-24T00:00:00",
      "story": "white spheres 7 slow moving white bright spheres seen more easily with sunglasses as very bright metallic looking.   Travelled together, 7th sphere trailing.   Passed in front of some clouds then seemed to gather together.   Thought might be weather balloons but apparently not going in direction of wind.",
      "link": "http://www.nuforc.org/webreports/108/S108846.html",
      "state": "CO",
      "duration": "4+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2293",
      "summary": "((HOAX??))  Squadron of enormous UFOs seen over denver at moment of full lunar eclipse.",
      "city": "denver",
      "shape": "circle",
      "date": "2014-04-18T00:00:00",
      "story": "squadron of enormous UFOs seen over denver at moment of full lunar eclipse i was looking at the just eclipsed moon through binoculars when a squadron of UFOs entered my field of view.  they were silently flying in a flat V formation with 3 on the short line and 8 on the long.  their leading edge was glowing red.  i believe the glow was from the friction of traveling fast through the upper atmosphere.  they passed over head and to my right traveling north.  when they first appeared the length of the line was about 3 times the width of the moon as it appeared in the sky.  each ship was about one ship width behind the other. on this form i checked a box under \"animals responded to the event\". i did notice just before i spotted this squadron that dogs began to bark all over the neighborhood.  at the time, i did wonder if it was in response to the eclipse or just a coincidence. i really don't think it was in response to these UFOs that were flying in the upper atmosphere.  but...  who knows? ((NUFORC Note:  We do not know whether this report is intended to be a serious one.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108654.html",
      "state": "CO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2297",
      "summary": "A boomerang-shaped black object flys overhead during an eclipse in Denver.",
      "city": "denver",
      "shape": "chevron",
      "date": "2014-04-18T00:00:00",
      "story": "A boomerang-shaped black object flys overhead during an eclipse in Denver My friend and I were watching an eclipse a little while ago when we saw this really big boomerang shaped thing start to fly over us.  You really had to look hard to see it.   At first I thought it was a huge bird but it got closer and you could tell it wasn't an animal.  It was black and blended into sky, and had white lights or dots on it but they weren't very bright.  It silently and slowly went right over the house.  It seemed like it was very close.   We paused for a moment because we thought maybe someone was flying a kite.  I went around the house to see where it went but I couldn't see it.  It didn't seem like anyone was flying a kite nearby.  It was a clear night.   My friend and I are 22, and we've known each other all our lives.  I am very skeptical, I don't know if it is likely that this was some sort of alien thing but I think its fun to entertain the idea.   My friend is more skeptical than I am and she and I were both a little weirded out by the experience.  I feel a little shaken up by it, and I wanted to tell the story because I just wanted it to be on record somewhere.   Denver is just not a place I ever expected to see a UFO, especially in a residential area.  I also know that I can't ever tell the story again because no one will believe it. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108655.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c23be",
      "summary": "Two Star-like UFO's Seen in Denver During the Time of  the  2012 Summer Olympics in August.",
      "city": "denver",
      "shape": "light",
      "date": "2014-03-27T00:00:00",
      "story": "Two Star-like UFO's Seen in Denver During the Time of  the  2012 Summer Olympics in August. I was up late and watering the grass at the small apartment complex I live in.  I was facing east and across the street there is a parking lot.  In the northwest corner area of this lot there is a tall evergreen-like tree.  I just happened to look up at the sky in that direction as I often look at the sky when watering the grass at night. Positioned above the tip top of the evergreen tree I saw what looked like a large bright star.  It looked like just a typical star, white in color, but noticeably larger, like six stars together.  It was not physically over the tree, but its position in the sky was above the tip of the tree.  I must admit I go a little alarmed because I had heard about alien abductions.  I decided to communicate with it.  But I did this inaudibly.  I sent a thought/question to it and asked if it was from the Christ (meaning Jesus).  And, if so would it blink off and back on again. The star dimmed down, like it had a dimmer switch, until it was not visible and lit up again. I then asked if it was here for the rapture.  The star dimmed down again, but this time it dimmed down and lit up twice; and, the second lighting it appeared brighter than before. I need to add that sometime during this occurence, a young man was walking across the street going southbound and I asked him if he could see that huge star.  He said something inaudible and smiled/laughed and kept walking. As I kept watching the star, it started to slowly ascend upward.  As it was doing this, off to the right, another star (this one was like an ordinary star in size) started ascending upward and to the left, like at a 45 degree angle as if going toward the larger star. Both objects went upward and out of sight.  The ascension was not swift, but slow.",
      "link": "http://www.nuforc.org/webreports/108/S108020.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2449",
      "summary": "It appeared first as a series of stars that did not twinkle and moved along the skyline until disappearing. The star like collection sh",
      "city": "denver",
      "shape": "triangle",
      "date": "2014-10-03T00:00:00",
      "story": "It appeared first as a series of stars that did not twinkle and moved along the skyline until disappearing.  The star like collection shifted into shapes and soon maintained that of a stationary structure resembling a triangle.",
      "link": "http://www.nuforc.org/webreports/113/S113994.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c24fd",
      "summary": "Denver, CO, on a late afternoon clear sky, 5 orbs appeared in the sky, some showing a streak of light before going back to orb shape.",
      "city": "denver",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "Denver, CO on a late afternoon clear sky, 5 orbs appeared in the sky, some showing a streak of light before going back to orb shape. Approximately, at 6:15 in the afternoon of October 14, 2014 my son and I witnessed the following events in downtown Denver, Colorado. I was visiting him from Atlanta and enjoying a clear blue sky in his 3rd floor loft condominium that is surrounding by windows.   I suddenly noticed a bright silver streak in the sky as if the bright son was reflecting off of an airplane.  I kept waiting for the image to change and then the streak just disappeared.  I didn’t at the point think much of it, but a few seconds after I saw what appeared to be a fire trail from nowhere burning into the clear sky. At that point, I told my son, and we quickly went to his deck to get a better view.   Just as we arrived on the deck about 3 orbs appeared.  They were far away and looked about the size of large star.  It was daylight and you could see them clearly.  Perfectly round and moving slightly; some moving faster than others. The one that was the steadiest and affixed in one place for a while as if staring at us, suddenly burst into a flame it appeared.  Making a definite light streak as you will see on the video.  On the camera it appears as white, but in reality, pink to coral was the color of the streak and quite beautiful.  In a matter of seconds, the streak was gone, but the orb remained just as it was before.  It had, to the naked eye, to not have moved at all.  As we were witnessing and trying to video this astonishing sight with a camera during the next 20 minutes, we noticed a total of 5 orbs in all.  These 5 orbs started moving toward the same location.  Some of them streaked as the moved, and they were moving due west of Downtown Denver to the right of Mount Evans.  As they approached the outlying hills, they dropped from the sky and fell behind a smaller peak.  One by one they disappeared slowly, deliberately to the same point.  I immediately called the local news channels to ask what they were.  I was hung up on by two of the major channels and finally the local ABC affiliate asked for a video.  We had to condense the video to the point I am sure it was hard to see, but as we watched the news there was no mention of these events at all.  I have called the FAA in Washington and they were helpful and told me to report these events to the local office here. Which I have done.  It does not have to be explained as aliens invading the earth, but it would be nice if the powers that be would at least tell the public they are not crazy when they see an actual event.  Thank you.",
      "link": "http://www.nuforc.org/webreports/114/S114558.html",
      "state": "CO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c250d",
      "summary": "Very huge lights flying by really slow huge across the sky; not flying in formation; seem to switch positions.",
      "city": "denver",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "Very huge lights flying by really slow huge across the sky; not flying in formation; seem to switch positions. About 1130 tonight October 14, 11:30 p.m.. I was looking south east towards Aurora at about 10 12 lights very dim amber glowing lights not flying in formation in heading south west across Denver skyline from left to right from the south east to south west direction flying very low very huge across the sky  I was at work off of I 70 and Havana  I am a welder I cut still steel beams for skyscrapers",
      "link": "http://www.nuforc.org/webreports/114/S114549.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c255d",
      "summary": "Red shiny sphere above Denver.",
      "city": "denver",
      "shape": "sphere",
      "date": "2014-11-06T00:00:00",
      "story": "Red shiny sphere above denver Spotted orange/red, shiny sphere.  Very motionless, drifted straight up higher than any plane.  Seemed unaffected by wind or crossing plane traffic.",
      "link": "http://www.nuforc.org/webreports/114/S114665.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2609",
      "summary": "a Geese shaped spacecraft vehicular vessel and a rectangular mother ship faintly appeared for 200 minutes over the Rockies stadium",
      "city": "denver",
      "shape": "other",
      "date": "2014-10-03T00:00:00",
      "story": "a Geese shaped spacecraft vehicular vessel and a rectangular mother ship faintly appeared for 200 minutes over the Rockies stadium",
      "link": "http://www.nuforc.org/webreports/114/S114162.html",
      "state": "CO",
      "duration": "200 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c25ff",
      "summary": "V-shaped craft seen over Denver.  Also, saw fast gray wispy barrel looking craft moving thru low hanging fog.",
      "city": "denver",
      "shape": "chevron",
      "date": "2014-11-06T00:00:00",
      "story": "V shaped craft seen over Denver.  Also saw fast gray wispy barrel looking craft moving thru low hanging fog 10/24/14 Friday 10:30 I was in the backyard when I saw a black\"V\"with 4 glowing yellow lights going down the 2 outer sides.  Going from my 1 o'clock position east to west.  I snapped out of it after seeing it for about 5 seconds & ran inside to get to get my husband.  We ran out to the front yard.  It had disappeared. We went to the backyard and after 5 minutes we both saw it again.  It appeared at the eve of the roof going north to south this time.  But it had undulating wings made of the same yellow colored lights.  6 of them so 3 on either side.  They were gently moving like a snake out from the center.  But the lights moved independently from either side kinda like a crawling octopus tentacle.  It lasted about 10 seconds that time. It reappeared again about 15 minutes later 12 o'clock high moving northeast to southwest.  My husband saw it first.  It was very high this time.  It was like the first one l saw again.  It lasted about 4 seconds that time. I saw another one about 10 minutes later.  It was completely different.  It looked like a wispy rod shaped gray cloud.  Either that or it occurred to me laster while writing this, that it could have been a gray long barrel shaped craft with no lights pushing thru the clouds.  It moved from 12'oclock  high to the direct south.  It was very fast again.  It lasted 3-4 seconds.  My husband didnt see that one. Then l saw the same type of wispy cloudlike thing but it was triangle shaped.  No lights.  Very strange floating motion.  It was just gliding like on ice.  It lasted about 3 seconds.  I was facing west.  It appeared   above me going west. The fifth one was 15 minutes later.  My husband had gone inside.  It was another wispy rodlike cloud going from 12:00 high to the west.  It was fast, lasting 3 seconds.",
      "link": "http://www.nuforc.org/webreports/114/S114805.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c2695",
      "summary": "Small craft with red and green lights moving erratically.",
      "city": "denver",
      "shape": "unknown",
      "date": "2014-10-03T00:00:00",
      "story": "small craft with red and green lights moving erratically. I was at 11th and Speer in Denver.  I saw an object.  It had 3 lights, red and green... Moved around erratically like a kite...At first I thought it was like an RC craft of some sort.  But then it moved away at least 2km and came back rather rapidly and finally sped away at least 600kts so that couldn't have been the case.  Also it was totally silent but maybe it made a sort of hissing noise at the point when it was closest to me (maybe it was like 400 meters away at that time).",
      "link": "http://www.nuforc.org/webreports/113/S113892.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2766",
      "summary": "V shaped craft with 5 thick red luminescent crosses, very fast, smooth, with zero noise emission.",
      "city": "denver",
      "shape": "triangle",
      "date": "2014-10-10T00:00:00",
      "story": "V shaped craft with 5 thick red luminescent crosses, very fast, smooth, with zero noise emission. Last night while casually stargazing, a UFO flew overhead.  It was V shaped with 5 thick luminescent red crosses underneath and moving smoothly at an incredible speed with zero noise emission.  It blended in very well with the night sky almost identical to it's background except for the red crosses which were dim and subtle.  I could clearly mark out the shape of the craft and follow it's path.  It was greyish but more like camouflage with the night sky above.  There was a witness there with me and we had enough time to agree it was unique and unidentifiable to aircraft technology as we know it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114201.html",
      "state": "CO",
      "duration": "1:30"
    },
    {
      "_id": "64d005f478aba2ec5a3c29f2",
      "summary": "At the Rockies game during the fireworks a lot of people were looking away from the fireworks and noticed an object with 3 lights. 2 re",
      "city": "denver",
      "shape": "disk",
      "date": "2014-09-25T00:00:00",
      "story": "At the Rockies game during the fireworks a lot of people were looking away from the fireworks and noticed an object with 3 lights.  2 red 1 green hovering in place not moving.  Would move around then hover and then completely vanished after the footwork ended. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113743.html",
      "state": "CO",
      "duration": ">5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b02",
      "summary": "One flashing ball of light and 9 other balls of light in the Denver sky.",
      "city": "denver",
      "shape": "flash",
      "date": "2014-11-21T00:00:00",
      "story": "One flashing ball of light and 9 other balls of light in the Denver sky. I didn't see stars out last night.  I saw 10 small balls of light in the sky.  One of them was flashing.  They seemed to be in a formation.  They would disappear.  Only the flashing one would remain and then all 10 would reappear.   I live downtown.  The lights were out east.  My guess is near BAFB. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115466.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c04",
      "summary": "I was standing at the top of the parking garage next to Whole Foods on 2nd Ave in Cherry Creek.  I was admiring the alpen glow looking.",
      "city": "denver",
      "shape": "oval",
      "date": "2014-11-06T00:00:00",
      "story": "I was standing at the top of the parking garage next to Whole Foods on 2nd Ave in Cherry Creek.  I was admiring the alpen glow looking west at the foothills when I noticed a oval object suspended in the sky about 30 degrees up from the mountain top.   The object gave off a very bright white light.  I took a picture of it with my phone, but it doesn't show up in the photo, possibly because I couldn't zoom in.  As I stood there watching the object, it began moving westward after a few minutes and decended out of my view as it slowly dropped down on the other side of the foothills. ((NUFORC Note:  We spoke via telephone with the witness and he emphasized how bright, and how bizarre looking, the object was.  PD",
      "link": "http://www.nuforc.org/webreports/115/S115154.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2ec2",
      "summary": "A short cylinder with slightly domed top, headed North West, disappeared not due to speeding off, but literally vanished.",
      "city": "denver",
      "shape": "cylinder",
      "date": "2014-09-18T00:00:00",
      "story": "A short cylinder with slightly domed top, headed North West, disappeared not due to speeding off, but literally vanished. UFO headed North West seen from the cross streets of Colorado Blvd and Louisiana.  It was closer and lower than a plane headed toward DIA within the range of sight.  It appeared to be disk like from my view with cylindrical sides and a slight domed top.   It had an iridescent quality, but could best be described in color as a metallic blue.  Within seconds of viewing it, the object completely disappeared, while the plane (further away) could still be seen.",
      "link": "http://www.nuforc.org/webreports/113/S113666.html",
      "state": "CO",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c30bb",
      "summary": "Two bright orange orbs in Northwest Denver synchronized, traveling northeasterly above tree line, then disappeared.",
      "city": "denver",
      "shape": "oval",
      "date": "2014-08-08T00:00:00",
      "story": "Two bright orange orbs in Northwest Denver synchronized, traveling northeasterly above tree line, then disappeared. On Saturday, August 2, 2014 at approximately 2245 mountain time, I was standing on the sidewalk in Northwest Denver, in the vicinity of 38th Avenue and Yates Street when I saw two bright orange objects traveling northeasterly in the dark night sky.  They were well above tree line and houses, and were coming from the southwest traveling in a perfectly straight line at a stable elevation, coming from the Sheridan Avenue area in the Edgewater vicinity. Two of us saw them.  They were traveling quietly and perfectly synchronized together. After between 30 and 60 seconds both bright orange glowing orbs kind of flashed brighter one time, then immediately disappeared, both at exactly the same time.  They did not appear to drop in elevation at all, they just disappeared.  They disappeared when they were probably over Yates and 41st Avenue area or a little farther northeast. I would guess the two orbs, or what ever they were, were traveling about as high as a helicopter flies around Denver, maybe a little lower.  Very bright orange, almost red glowing, appearing to be round / oval in shape.  Pretty good size; smaller than the body of a helicopter but maybe about six or seven feet in diameter, about the size of a hot tub.  It was hard to really ascertain the size or the distance they were from us in the dark night sky and with the bright orange glow they emitted. The Denver skies were partly cloudy, but the area these were in was in a completely clear sky. They were moving at a good clip, completely quiet though and perfectly synchronized together. They were probably visible by us for a total of 30 to 60 seconds.  Two of them, perfectly spaced apart and traveling side by side, but not connected to each other. We have both seen Chinese type lanterns in the night sky, but these were NOT lanterns. These were two bright orange objects, separated by space but traveling perfectly together. They appeared together and disappeared at exactly the same time.",
      "link": "http://www.nuforc.org/webreports/112/S112155.html",
      "state": "CO",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c330c",
      "summary": "Triangular craft.",
      "city": "denver",
      "shape": "triangle",
      "date": "2015-03-20T00:00:00",
      "story": "Triangular Craft I seen a craft of some kind.  In a triangular shape, with 3 flashing lights, sitting still in one spot, then zooming off to the left as fast as I could see.   It was no plane, no satellite, I never seen anything like it…  It was unreal, just hovering.",
      "link": "http://www.nuforc.org/webreports/117/S117803.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c333c",
      "summary": "15 red orbs seen in formation across the sky.",
      "city": "denver",
      "shape": "sphere",
      "date": "2015-04-08T00:00:00",
      "story": "15 red orbs seen in formation across the sky. 15 reddish/orange orbs were seen navigating across the sky in formation.  Some were moving at different velocities it seemed.",
      "link": "http://www.nuforc.org/webreports/118/S118229.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3339",
      "summary": "Orange lights floating in the sky then disappearing",
      "city": "denver",
      "shape": "other",
      "date": "2015-04-08T00:00:00",
      "story": "Orange lights floating in the sky then disappearing My father and I were walking back to our car after eating dinner in west denver, he asked for the time.  I told him it was 8:30, as we got to the car and were unlocking the doors.  I looked into the sky and seen multiple objects floating up into the sky. They were orange orbs or teardrops I couldn’t tell very well.  They floated diagonally and as they got to a certain point in the sky they disappeared, in total there had to be about 35-40 of them.  This went on for about 5 or 6 minutes.  Both of us recorded the seen but they did not appear on our devices a kindle and a galaxy s3 phone. As we drove home i looked into the sky we were going north on I-25 and we seen this orange object flash go away, then flash again.  It was going very fast then it disappeared all together.  I have no clue if they are related incidents.",
      "link": "http://www.nuforc.org/webreports/118/S118227.html",
      "state": "CO",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3473",
      "summary": "UFO over DIA.",
      "city": "denver",
      "shape": "sphere",
      "date": "2015-01-07T00:00:00",
      "story": "UFO over DIA. I am a doctor of theoretical physics.  I have never seen something in nature that behaved the way these objects did.  They flew in perfect formation pulling off maneuvers that no man made aircraft could.  It was spectacular to witness.",
      "link": "http://www.nuforc.org/webreports/116/S116242.html",
      "state": "CO",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c37db",
      "summary": "A gray/white triangular aircraft w/3 cone-shaped rockets on the bottom.  They were blue, orange, and red.",
      "city": "denver",
      "shape": "other",
      "date": "2015-01-26T00:00:00",
      "story": "A gray/white triangular aircraft w/3 cone-shaped rockets on the bottom. They were blue, orange, and red. As I was staring out my window, there was a strange orange light coming towards me.  It looked somewhat neon, but softer.  The light was vibrating rapidly at frequencies I've never seen in any man-made aircraft.   As it approached, I could see 3 different colored rockets attached on the bottom and a gray/white roof on top.  The top was sort of triangular and the bottom had 3 rockets that were cone-shaped with flames of light coming off of them.  One of the rockets flames was orange/yellowish, one was blue, and one was red. It seemed like it was vibrating instead of being propelled by an engine.   It flew about 20 feet above my window and very close to the roof of my 10-story building.  It happened very fast.  The vibration of the aircraft was so fast that taking a picture would most likely have resulted in an image of an extremely blurry light.  Although it was vibrating so fast, it seemed like it had slowed down to observe the area for some reason.   This was in Capitol Hill.",
      "link": "http://www.nuforc.org/webreports/116/S116931.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c38bd",
      "summary": "Intelligent burning fireball over University Hills/ Denver, CO.",
      "city": "denver",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "Intelligent burning fireball over University Hills/ Denver, CO My boyfriend and I were leaving to go to dinner when we both saw something strange in the sky just above my neighborhood in university hills.  It looked like something burning and on fire, which alarmed us at first.  We could tell it wasn't a plane or anything with a constant beam of light because there was a center light that was bright and the flickering fire-like light was moving up from the lower ball of light, just as flames move up and \"lick\" the air.   The object wasn't flying as high up as commercial airplanes fly, but more around the height a helicopter would hover.  It was on a constant path moving from west to east at a constant speed when it stopped suddenly for about a minute; it just hovered there and kept burning.  Then it started moving again at a slower speed moving south, also appearing to gain height in altitude as well.  We could see the light grow faint but could no longer see the burning.  At this point we were viewing the object thro! ugh the trees and watched it change course again heading slightly diagonal towards south east.   Just as fast as it had appeared out of nowhere, it began moving up in altitude very quickly until it was just a faint light, almost as if it was a star, despite the snow that was falling and the fact that no stars were visible.   I took a video that captures the main chunk of the sighting but my phone died just after it began gaining altitude and disappeared.   The fact the object was burning was alarming enough, but the intelligent speed and direction changes were enough to convince us this was something foreign and extraterrestrial.",
      "link": "http://www.nuforc.org/webreports/116/S116445.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3dbf",
      "summary": "3 low-altitude orange globes, Denver, 4th of July, 2015.",
      "city": "denver",
      "shape": "sphere",
      "date": "2015-07-06T00:00:00",
      "story": "3 low-altitude orange globes, Denver, 4th of July, 2015. Just before midnight, after all firework shows had finished for the night..  Partly cloudy with high Cirrus clouds, partial moon..     3 orange globes, about the size of my pinky nail at arm's lenth..  Easily big enough to resolve with binoculars or other sighting device, but unfortunately, I didnt have one ready..     3 Objects came into view from the south and continued due North.   We were able to watch their entire track from almost horizon to horizon.  All 3 orange globes were following the same track, about 15 seconds behind each other, and completed the horizon to horizon track in less than 1 minute.   The objects were BELOW the cloud base (eliminates meteors), moving VERY fast, and made absolutely ZERO sound.  Fireworks would be an impossibility because of the duration, speed, and precision track of the objects. I am prior Air Force, so I have extensive experience in what night flight aircraft look and sound like, expecially on clear quiet nights..  My first instinct was that these were aircraft in full military power afterburners.  But again, there was NO sound, and afterburners are VERY loud, especially at that relatively low altitude.. There was one other witness to this event..      First time in my life I can't explain away something I've seen.",
      "link": "http://www.nuforc.org/webreports/120/S120117.html",
      "state": "CO",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e57",
      "summary": "Fleet of UFO's over Denver.",
      "city": "denver",
      "shape": "unknown",
      "date": "2015-07-03T00:00:00",
      "story": "Fleet of UFO's over Denver. Heard my girl screaming, went out back and saw thirty to forty very bright objects, shining as bright as stars, flying in a loose formation not unlike birds or a school of fish.  Ran down the street until they disappeared behind cloud cover.  Five minutes later, heavy helicopters circling the area (Govt?)  Phenomenal.   Someone else had to have seen it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119977.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4473",
      "summary": "a craft enlarged in the photo with possible windows or portals. the object was clear white with dark decks.",
      "city": "denver",
      "shape": "circle",
      "date": "2015-10-29T00:00:00",
      "story": "a craft enlarged in the photo with possible windows or portals.  the object was clear white with dark decks. In this photo I have from my wife, there are about five or six lights in the sky, the one photo just to the right and above the lighted light, if you enlarge it, you will see it is a craft with maybe windows or Portal..  A craft enlarged in the photo.",
      "link": "http://www.nuforc.org/webreports/122/S122941.html",
      "state": "CO",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c46b6",
      "summary": "Facing due N on Crestline ave in Denver; witnessed what I originally believed to be an aircraft.  ((NUFORC Note:  Parachutists??  PD)",
      "city": "denver",
      "shape": "changing",
      "date": "2015-11-06T00:00:00",
      "story": "I was out on my balcony facing due north on Crestline ave in Denver when I witnessed what I originally believed to be an aircraft heading south with landing lights on,  What got my attention was the brightness and altitude of the the light...   Immediately there after the single light turned to 5 other lights which did not change observable distance on the horizon.  The objects then moved directly horizontal and vertical in a sort of pattern.   Aircraft were visible in the area and and the speed of these objects was far greater (based on observations only) than the average aircraft.   They then formed a line and one by one decended at a steep rate into an I would estimate to be near Longmont/Docono.   No clue what it was but definitely strange. ((NUFORC Note:  Parachutists??  PD)",
      "link": "http://www.nuforc.org/webreports/123/S123301.html",
      "state": "CO",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4773",
      "summary": "Dark chevron/boomerang object.",
      "city": "denver",
      "shape": "chevron",
      "date": "2015-11-06T00:00:00",
      "story": "Dark chevron/boomerang object Saw a chevron/boomerang shaped craft gliding southbound toward city park.  It was silent and couldn't have been flying higher than 250 feet, difficult to tell since it was such a barely visible object with no lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123326.html",
      "state": "CO",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4954",
      "summary": "Black triangle with five rust colored lights.",
      "city": "denver",
      "shape": "triangle",
      "date": "2015-10-16T00:00:00",
      "story": "Black triangle with five rust colored lights. Black solid triangle with five dim rust colored lights (one at front, two mid, two tail) flying due west Following highway 36.  Completely silent. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122790.html",
      "state": "CO",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4962",
      "summary": "UFO over Denver with two pulsating lights.",
      "city": "denver",
      "shape": "changing",
      "date": "2015-11-06T00:00:00",
      "story": "UFO over Denver with two pulsating lights. Out on a walk with the dog, looked up at an airliner leaving a contrail, but beyond that noticed an object moving southeast at a slow pace.  Thought it may be weather balloon etc, although it seemed to be reflective.  I could not discern the shape at this point.  The object appeared to be at a high altitude.   The object then stayed in a stationary spot in the sky.  At this point I could make out what I would compare to two golf balls connected together horizontally by a rope.  It seemed hazy, and light/metallic in color.   The two round spots seemed to brighten and dim together as the object stayed in this same spot.   This repeated a handful of times, then the object slowly vanished.",
      "link": "http://www.nuforc.org/webreports/123/S123417.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a08",
      "summary": "Red and green objects, side by side.",
      "city": "denver",
      "shape": "light",
      "date": "2015-09-25T00:00:00",
      "story": "Red and green objects, side by side. 2 objects  left was red and right was green.  They were side by side. They appeared 80% above the horizon SW hovering then accelerated at a super high rate of speed SW and disappeared 4 or so years ago we saw a white light that hovered and did the same I reported it on here.  Why here at the same time during the Denver Fair?!",
      "link": "http://www.nuforc.org/webreports/122/S122128.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a76",
      "summary": "Boomerang craft-stealth bomber like- w/round amber lights",
      "city": "denver",
      "shape": "chevron",
      "date": "2015-10-16T00:00:00",
      "story": "Boomerang craft- stealth bomber like- w/round amber lights I live on the edge of north downtown Denver.  Last night, I saw a large stealth bomber looking craft with orange lights moving across the sky, quietly, at a fluid like speed.  It was traveling south west.   Minutes later, I saw another craft traveling south at higher altitude, quietly and even faster.  I kept wiping my eyes thinking I was losing my mind.  A few minutes later another craft flew by at a high rate of speed, on the same path as the first.   I completely feel like a coo-coo bird telling people about what I saw but it actually happened.  Not sure if this is some new government craft or what.  Out of this world technology.   Plan on taking video tonight to see if it happens again. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122863.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b0a",
      "summary": "Five bright red lights holding position in fixed formation, heading 110 Degrees due east of Denver, three static in triangle, two flash",
      "city": "denver",
      "shape": "formation",
      "date": "2015-09-25T00:00:00",
      "story": "Five bright red lights holding position in fixed formation, heading 110 Degrees due east of Denver, three static in triangle, two flash Bright red lights holding position in a triangular formation due east of Denver, Colorado. Heading 110 Degrees.  Five lights total, the three brightest are holding at fixed positions while two others are dimmer and flashing at one second intervals, staggered a half second from each other.  First noticed around 21:45 MST.  Event is currently taking place and has not changed over a 20 minute duration.  Image captured with cell phone, but the two faintest lights are difficult to see. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122115.html",
      "state": "CO",
      "duration": "15+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d1f",
      "summary": "Lights west of Denver.",
      "city": "denver",
      "shape": "light",
      "date": "2015-09-11T00:00:00",
      "story": "Lights west of Denver. Looked like lights from a air craft that was to high and not moving.  Red, blue and clear lights.  Looked again at 10:30 and it was gone.  Not the 1 st time I have seen this out there.",
      "link": "http://www.nuforc.org/webreports/121/S121824.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d2e",
      "summary": "A light dashed across the sky, then a smaller light spiraled about three times before disappearing.",
      "city": "denver",
      "shape": "light",
      "date": "2015-09-02T00:00:00",
      "story": "A light dashed across the sky, then a smaller light spiraled about three times before disappearing. I saw a light move from north to south, too fast to be a plane.  It was near DIA so plenty of planes were going by for comparison.  While it was moving it disappeared then reappeared just as quickly as it had gone away, then was gone again.   There were lights from a concert stage shining in the sky, and while I continued looking up, a smaller light spiraled in the sky above the lights about three times then disappeared for good.",
      "link": "http://www.nuforc.org/webreports/121/S121536.html",
      "state": "CO",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e04",
      "summary": "Black medicine-capsule shaped object, flying horizontally at about dusk.",
      "city": "denver",
      "shape": "other",
      "date": "2015-08-13T00:00:00",
      "story": "Black medicine-capsule shaped object, flying horizontally at about dusk. This sighting was July 28, 2015.  I was lying on the sidewalk in front of my house admiring the sunset, which is something I often do.  I noticed a black, medicine-capsule shaped object flying overhead from East to West.   At first, I thought that it was just a balloon, but as I watched it, I changed my mind.  I have seen many balloons flying, as most people have.  All that I have seen go primarily upwards, and also usually move somewhat horizontally.  They usually tend to wiggle a bit and wobble as they fly.   This object did not appear to rise upwards at all.  It seemed to maintain a completely horizontal movement, and apparently moved in a straight line toward the west.  It did not wiggle or wobble at all as a small balloon would.  It made no noise at all.   I was able to watch it for a minute or two, until it traveled so far into the distance that I couldn't see it anymore.  I wasn’t really sure about the size of it, but I recently saw a helicopter in the sky at about the same location in the sky, and about the same time in the evening.  The helicopter appeared to be about the same size as the object I saw, as well as about the same altitude, and seemed to move at about the same speed.   The thing that I saw was certainly not a helicopter, as it clearly capsule-shaped, as I mentioned, and made not noise at all.   I saw something similar about two weeks earlier, that was moving the opposite direction, from West to East, at about the same time of evening.  I ran into the house to get binoculars, but it was gone when I returned.",
      "link": "http://www.nuforc.org/webreports/120/S120994.html",
      "state": "CO",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e15",
      "summary": "Light disappears, moves, reappears, and shoots short lightning-like discharge.",
      "city": "denver",
      "shape": "light",
      "date": "2015-08-13T00:00:00",
      "story": "Light disappears, moves, reappears, and shoots short lightning-like discharge. At first, I saw a light in the sky, assumed it was an airplane, except that it was a bit brighter, and there were no blinking lights on it, which is something that always gets my attention.   Then the light went completely black, just disappeared, a little bit like how a satellite goes out gradually, but this was not like that, the light instantly went out.  I felt right away that I was seeing something unusual, so I decided that I would keep looking in the area of the sky to see if it would reappear.   About a minute or so it did reappear, some distance away.  I was looking to the west, and it was shortly after the sky had become completely dark.  The light was traveling from south to north.  It disappeared slightly to the southwest, and reappeared slightly to the northwest.  At that time, I believe that it blinked off and on once or twice, and then there was what appeared to be an electrical discharge, vertically.  It was like a very short bolt of lightning, except whiter, and perfectly straight, which I estimate took up about one to two degrees of distance in the sky (or, about the thickness of my finger at arm's length).  I almost had the feeling that the light itself had moved vertically, and almost instantly. It then disappeared and stayed that way.    It definitely got my attention.  I felt that I had seen something very out of the ordinary.",
      "link": "http://www.nuforc.org/webreports/120/S120926.html",
      "state": "CO",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f85",
      "summary": "Orange lights in a formation off of I-70.",
      "city": "denver",
      "shape": "formation",
      "date": "2016-03-18T00:00:00",
      "story": "Orange lights in a formation off of I-70. I was driving on i70 going towards to city from the highlands and off to my left there were three sets of orange air craft lights in a formation hovering.  They were to big to be airplanes, and they were stagnant.",
      "link": "http://www.nuforc.org/webreports/126/S126400.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5232",
      "summary": "Is anyone else seeing this now?? I'm downtown Denver and I'm looking W above the mountains.  Really high up there are lights pulsating.",
      "city": "denver",
      "shape": "unknown",
      "date": "2016-01-29T00:00:00",
      "story": "Is anyone else seeing this now??  I'm downtown Denver and I'm looking west above the mountains.  Really high up there are lights pulsating and the UFO is stationary.",
      "link": "http://www.nuforc.org/webreports/125/S125460.html",
      "state": "CO",
      "duration": "Ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c535f",
      "summary": "Object had a tail and maintained shape and speed.",
      "city": "denver",
      "shape": "teardrop",
      "date": "2016-01-14T00:00:00",
      "story": "Object had a tail and maintained shape and speed. One plume in west sky, first white then red closer to the horizon. Moved at a steady pace east to west then Disappeared below horizon. No sound, same shape for duration of visibility.",
      "link": "http://www.nuforc.org/webreports/125/S125206.html",
      "state": "CO",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c552c",
      "summary": "Drone like objects with erratic flashing white, red, orange, green, and blue lights",
      "city": "denver",
      "shape": "unknown",
      "date": "2015-12-04T00:00:00",
      "story": "drone like objects with erratic flashing white, red, orange, green, and blue lights Dec. 3 2015, approx. 8pm  Two objects seen from Lowry in Denver to the south slightly east and low on the horizon as if they may have been over south Aurora or Greenwood Village.  I have seen them on other occasions at a much closer distance exhibiting the exact same behavior. No shape is distinguishable and they move very slowly, slower than a helicopter usually will, and almost hover in place at times with no noise.  What is seen are white, red, orange, green, and blue lights flashing in an erratic sequence and rhythm.  They seem to be placed at various positions vertically and horizontally.  The white and red lights are the most prominent.  They flash at odd intervals, short changing sequences followed by longer periods of darkness and vice versa.  The flash patterns and light placement about the craft is unlike any other aircraft I’ve ever seen. I thought they might be drones but if they are, then they are very large –at least the size of a car or truck, they can travel a long distance as every one that I’ve seen has traveled a great enough distance to completely obscure it from visibility, and they seem to be at an altitude of at least 1000ft from the ground probably more. I’m 40 yrs old, have excellent eyesight and have been a frequent night time observer for most of my life.",
      "link": "http://www.nuforc.org/webreports/124/S124500.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5946",
      "summary": "Strange behavior above Denver sky.",
      "city": "denver",
      "shape": "light",
      "date": "2016-05-26T00:00:00",
      "story": "Strange behavior above Denver sky. I have seen these objects hovering over the Denver sky every night since I first noticed them over 3 months ago.  Each one has his/their area but each one moves erratically within that area.  Strange behavior to say the least.",
      "link": "http://www.nuforc.org/webreports/127/S127441.html",
      "state": "CO",
      "duration": "indefinite"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bf5",
      "summary": "Two UFO craft sighted in Denver-One strobing with forward momentum, the other hovering.",
      "city": "denver",
      "shape": "circle",
      "date": "2016-04-01T00:00:00",
      "story": "Two UFO craft sighted in Denver - One strobing with forward momentum, the other hovering. Brilliant white strobe in circle shape VIDEO TAPED flying southbound against mountain range.  Balcony viewpoint was 10th Avenue in Denver, for perspective, cross street Broadway.   This craft appeared to be totally cylindrical, and would go from 100% illumination extremely bright white light, to absolutely 0% and totally dark, back to fully lit, back to fully dark, repeat until out of site.  Full video available. After this craft appeared to have gone out of site, within approximately two minutes, a SECOND craft appeared (first craft gone, may have been same craft but different scenario). Second craft was full bright white/orange light, also totally cylindrical, appeared to hover in place for a solid two minutes, brilliantly lit, and then appeared to gain altitude.  Zero presence of flashing lights as would be indicated on traditional commercial craft.  This literally floated/hovered mid air with no observable movement.  Southbound from balcony at 10th and Broadway, no flashing, not sure if different craft or if same craft as above but using different lighting scheme and hovering as opposed to forward/southbound momentum. Have video footage of both.  Not exactly eager to post online given scrutiny factor.",
      "link": "http://www.nuforc.org/webreports/126/S126648.html",
      "state": "CO",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c7f",
      "summary": "Two white cigar shaped UFO's stop and hover over I-25 in Denver, then change to an amber color and disappear.",
      "city": "denver",
      "shape": "cigar",
      "date": "2016-03-24T00:00:00",
      "story": "Two white cigar shaped UFO's stop and hover over I-25 in Denver, then change to an amber color and disappear. My wife and I were driving northbound on I-25 from Colorado Springs to Denver.  The sighting happened somewhere between CO 470 and Yale Avenue.  We had seen several commercial aircraft flying at low altitudes over the interstate coming from DIA before the sighting.  We then saw two flat, white discs or cigar shaped objects.  We were looking at them edge on, they were definitely not saucer or dome shaped.  The objects were moving at approximately the same altitude and speed relative to the other commercial airliners. The two objects caught our attention because they seemed to move similar to the aircraft previously seen, but didn't have wings and appeared at least twice the size of the commercial airliners.  In comparison with the Sun, they would have fit almost perfectly into the radius of the Sun's circle, with perhaps some overlap for the object closest to us (further south).  They looked like thin, bring white lines across the deep blue sky.  Today was a beautiful sunny day, so their bright white color against the deep blue back drop was very easily seen. I estimated they were a good 5 to 10 miles ahead of us, looking due North.  Of course, I'm not a good judge of aerial distances, but I use the other commercial aircraft in the area as my point of reference for this estimation.  One of the objects was obviously closer to us (further south) while the second appeared smaller and seemed to be few miles further North than the first object closest to us.   They appeared to move from an E to a NW direction, similar to the commercial aircraft coming out of DIA over downtown Denver headed west over the mountains.  Then, they suddenly stopped over I-25 or perhaps just west of I-25.   At this point we were looking at them NNW of our viewpoint on I-25N.  The two objects then hovered for about 30 seconds max (possibly less) and then began to turn a reddish orange color, slowly becoming more and more transparent with the blue sky - and then poof!  They disappeared!   This all happened in less than a minute and we were traveling at 80 mph.  So unfortunately, we didn't get a photo or video of the event.  However, it did shake up my wife and was very unsettling to her.  She has not been one to believe in UFO's and when I tried to talk to her about it afterward, she was very uncomfortable and didn't want to discuss it.  I know what I saw and this was something very \"unidentifiable.\"   If anyone else on I-25 at this same time headed northbound along side us looked up in the sky to the North-Northwest, they would have seen the same thing.  I would imagine anyone in those commercial aircraft headed west out of DIA would have also seen this.",
      "link": "http://www.nuforc.org/webreports/126/S126468.html",
      "state": "CO",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f2f",
      "summary": "5 orange lights flying in formation in the sky.",
      "city": "denver",
      "shape": "formation",
      "date": "2016-10-11T00:00:00",
      "story": "5 orange lights flying in formation in the sky. I was standing outside in a parking lot over looking Denver and I saw 5 orange bright lights that were larger and brighter than plane or helicopter lights.  The 5 orange objects were definitely flying in a formation and slow moving across the sky.  They slowly moved across the sky and as they went higher up disappeared behind clouds.",
      "link": "http://www.nuforc.org/webreports/130/S130386.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f8f",
      "summary": "So at approximately 9 pm on October 21st 2016, we were sitting outside in our front yard star gazing due to the metior showers when all",
      "city": "denver",
      "shape": "other",
      "date": "2016-10-27T00:00:00",
      "story": "So at approximately 9 pm on October 21st, 2016, we were sitting outside in our front yard star gazing due to the metior showers when all of a sudden we saw a boomerang shaped ufo flying at about approximately 200 ft above the neighborhood but completely silent  There were square shaped white reflector type things on the bottom of the craft but only on the wings of the object and nothing in the center It was flying at a slow pace completely silent towards the south west direction It had appeared out of nowhere and lasted about 5 minutes before it disappeared from our sight  I've never witnessed anything like this in my life I felt really shocked and scared at the same time I tried recording but it was too dark for the phone to catch.",
      "link": "http://www.nuforc.org/webreports/130/S130767.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6126",
      "summary": "At 928 pm friend and I talking about me seeing a red triangle shaped ufo just a week ago then see 6-8red orbs little bigger than Mars w",
      "city": "denver",
      "shape": "triangle",
      "date": "2016-09-30T00:00:00",
      "story": "At 928 pm friend and I talking about me seeing a red triangle shaped ufo just a week ago then see 6-8red orbs little bigger than Mars when it's close Moving very fast no sound.  Went from triangle then rounded out Looked like it was coming from where i70 enters the mountains.",
      "link": "http://www.nuforc.org/webreports/130/S130166.html",
      "state": "CO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c610e",
      "summary": "V-shaped craft with 4 red non flashing, dimmed huge lights flying over us while we were waiting to go inside.",
      "city": "denver",
      "shape": "other",
      "date": "2016-10-27T00:00:00",
      "story": "V shaped craft with 4 red non flashing, dimmed huge lights flying over us while we were waiting to go inside the pepsi center for a concert",
      "link": "http://www.nuforc.org/webreports/130/S130866.html",
      "state": "CO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c65b3",
      "summary": "I walked out to my backyard and saw a very bright light that looked like a star but i noticed it was moving slow. Before my eyes the cr",
      "city": "denver",
      "shape": "other",
      "date": "2016-08-16T00:00:00",
      "story": "I walked out to my backyard and saw a very bright light that looked like a star, but I noticed it was moving slow.   Before my eyes the craft went from a star-shaped object, to a cigar shape, but it also looked like it had hooked wings.   After about 3 minutes the craft took the shape of a star again, turned bright red and vanished.",
      "link": "http://www.nuforc.org/webreports/129/S129267.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6865",
      "summary": "Moved slow but made quick turns staying and circling same area I have it on security camera's that record 24/7",
      "city": "denver",
      "shape": "light",
      "date": "2017-04-20T00:00:00",
      "story": "Moved slow, but made quick turns, staying and circling same area.  I have it on security camera's that record 24/7",
      "link": "http://www.nuforc.org/webreports/133/S133721.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6995",
      "summary": "Bright object over downtown (East) Denver is observed twice, then the same thing appears in the West",
      "city": "denver",
      "shape": "circle",
      "date": "2017-03-17T00:00:00",
      "story": "Bright object over downtown (East) Denver is observed twice, then the same thing appears in the West Approx 6:30 PM, I am riding in the passenger seat with a friend on Sheridan Ave due North. I look out the passenger window to the East and notice a large, bright circular object with a bright corona in the sky over Downtown Denver.  There are no colored lights on the object to signify a conventional aircraft.  When observed through a phone seems to be either changing shapes or is emitting orbs that seemingly change the object's shape.   We take a left turn at an intersection to head West and during this time that we are turning the bright object vanishes from the sky. Approx 30 minutes later we had returned home from errands and, as we approached the door to the house, I notice the same bright, circular UFO hanging in the sky to the East.  A seemingly conventional aircraft (read: helicopter) in the same area of the sky seems to be approaching the circular object, at which point the object promptly vanishes from the night sky. I run inside to tell my friend who had already gone inside to put away items. We both return outside and observe either the same or another circular bright object to West, low on the horizon, seemingly barely above the mountains themselves.  We observe the object to the West for approx 3-5 minutes before returning inside.   5-10 minutes later I returned outside to no anomalies visible in the sky.",
      "link": "http://www.nuforc.org/webreports/133/S133120.html",
      "state": "CO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c1a",
      "summary": "3 glowing orange lights.",
      "city": "denver",
      "shape": "light",
      "date": "2017-01-12T00:00:00",
      "story": "3 glowing orange lights. Looking westward we saw three orange lights that hovered and the began to ascend two of the lights moved north east and the third was moving erratically left right and the it disappeared just above the horizon.  They moved in such a way that no plane could fly.",
      "link": "http://www.nuforc.org/webreports/132/S132085.html",
      "state": "CO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d41",
      "summary": "Dark sky, cylinder with light and clouds in it swirling around.",
      "city": "denver",
      "shape": "cylinder",
      "date": "2016-12-15T00:00:00",
      "story": "Dark sky, Cylinder with light and clouds in it swirling around. December 12, 2016.  This happened on the evening of June 12th or the 13th of 2016. I was walking up my outside stairs headed south, my home blocks the west side area until I am all the way up the stairs. this was in the evening time I dont know the time, but it was dark. I was in about the middle of the stairs, I turned up and was facing south, suddenly I saw what to me was a huge cylinder of light with white like clouds whirling around in it as it came across the sky  it was light in it like day and inside swirilling fast.  I say the cylinder was about a 50 degree angle when it came from the West, I never saw the tail end. what puzzles me the most was that the light came across like an unfolding light, it had an end to the light in the front, I never saw the end of a flashlights that was pointed in the sky, it shot across so fast, maybe I saw it for about 4 to 5 seconds, it had stopped and it was just there, then in the blink of an eye the lights just closed and dissapered, dark sky and nothing more.  it was gone and dark again. I estimated that the cylinder (I call it a cylinder because it was round ) to be maybe a mile away, but in my mind it was closer than that, not really sure. I would say for comparison the cylinder was about as wide and as round as a Train engine or a box car from a train., but it was round. from the ground level I was at.",
      "link": "http://www.nuforc.org/webreports/131/S131732.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6db9",
      "summary": "I was doing a patrol of my buildings perimeter on 06/15/17 around 10:03AM. I always tend to look at the sky and today I was lucky enoug",
      "city": "denver",
      "shape": "formation",
      "date": "2017-06-15T00:00:00",
      "story": "I was doing a patrol of my buildings perimeter on 06/15/17 around 10:03AM.  I always tend to look at the sky, and today I was lucky enough to witness about 50 sphere shaped objects flying in formation in the Denver sky.   At first I thought it was just a flock birds, but then this plane passed right by the objects and that's when I knew they couldn't be birds.  Reasons being, as soon as the plane passed by these objects got so close to each other creating like a wall and quickly moved out the way of the plane.   During this time the objects also change from their white color to a black color as if they felt in danger by the plane.   After the plane was out the frame these object continued to fly in abnormal directions in the sky.  I filmed them for about a minute and half before they finally just fanished into thin air.   The crazy thing is I saw two objects similar to these object about 4 days ago and also filmed it.  I dont know what they are but when I zoomed in to the objects they definitely weren't anything I have ever seen.  They were round with like two long black I guess poles at the top and bottom of the objects.   After everything happened.  I went back inside my building and for some reason I felt really angry and agitated.  I felt this way for about 5 minutes.   I hope I can spot some more UFOs in the future.",
      "link": "http://www.nuforc.org/webreports/134/S134590.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6fb2",
      "summary": "My family and I were driving home from Denver Co. and the day was really hazy because of the fires going on which turn the sun red and",
      "city": "denver",
      "shape": "unknown",
      "date": "2017-09-05T00:00:00",
      "story": "My family and I were driving home from Denver Co. and the day was really hazy because of the fires going on which turn the sun red and we were able to look at it without being blinded.  As we looked and took pictures of the red sun I noticed 2 black objects in front of the sun and made my wife pull over so we can look closer.  We couldn't tell what shape they were because they seemed really far away.  The pictures did not capture the objects because of the quality.   My 2 kids, wife, sister-n-law, & niece all notice these 2 objects.  It made me really nervous and excited at the same time because I've never seen anything like it.",
      "link": "http://www.nuforc.org/webreports/136/S136039.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7042",
      "summary": "Three lights sitting stationary in the east sky. Looks to be rapidly blinking in reds blues and greens so fast, its basically white.",
      "city": "denver",
      "shape": "changing",
      "date": "2017-08-24T00:00:00",
      "story": "Three lights sitting stationary in the east sky.  Looks to be rapidly blinking in reds blues and greens so fast, its basically white.  I only noticed the colors flashing when I tried to zoom in for a quick video.  When I walked onto my balcony, for the video it was no longer three orbs lights but a single large orb almost like a HUGE star or planet in visibility.   After a short video, I go back inside to my room and its now still there but three orbs again.  Going on for almost 30 minutes now as I type this.  Visibility clarification, I'm on Colorado Blvd.",
      "link": "http://www.nuforc.org/webreports/135/S135862.html",
      "state": "CO",
      "duration": "30 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3c706e",
      "summary": "I am seeing a bunch of white orb like lights moving in a circular motion and then spanning off in different directions as i am looking",
      "city": "denver",
      "shape": "",
      "date": "2017-08-04T00:00:00",
      "story": "I am seeing a bunch of white orb like lights moving in a circular motion and then spanning off in different directions as I am looking up in the sky North, Northeast in  Denver.  The lights were begind some clouds.  As the clouds dissapeared so did the lights now at approximately 23:30. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135429.html",
      "state": "CO",
      "duration": "45 minutes, still going"
    },
    {
      "_id": "64d005f478aba2ec5a3c70d2",
      "summary": "Denver Light formation 7/4  of 4-5 bright lights format just after firework show began low sky and bright N of Englewood nr Denver.",
      "city": "denver",
      "shape": "formation",
      "date": "2017-07-14T00:00:00",
      "story": "Denver Light formation 7/4  of 4-5 bright lights format just after firework show began low sky and bright N of Englewood nr Denver 4-5 bright white lights in group - appeared to change formation slightly with some of the  lights going on and off slowly - saw for about 1 minute before they disappeared without moving  Did not appear to be drones as the lights were very bright and too far away to be from that small of craft  Just as fireworks began citywide post dusk (approx 9:25) and was pointed out by a relative while our firework show was launching above us  Looking North towards West Denver from North Englewood, low in sky  approx 4-6 miles away (guess)  Short video clip posted to YouTube",
      "link": "http://www.nuforc.org/webreports/135/S135049.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c718e",
      "summary": "The sky was light. So no fireworks were visible yet.  There where two circles of light hovering above the airport in Denver.",
      "city": "denver",
      "shape": "circle",
      "date": "2017-07-07T00:00:00",
      "story": "The sky was light.  So no fireworks where visible yet there where two circles of light hovering above the airport in Denver (or in the general area).   The sky was bright, too bright to see any plane lights.  But two lights, one slightly small (or further away), stood still in the sky.",
      "link": "http://www.nuforc.org/webreports/134/S134931.html",
      "state": "CO",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c7231",
      "summary": "5 distinct bright objects moving in and out of formation and visibility.",
      "city": "denver",
      "shape": "formation",
      "date": "2017-07-07T00:00:00",
      "story": "5 distinct bright objects moving in and out of formation and visibility. The objects appeared as 5 distinct white lights and were flying in a close formation at approximately 2,000 feet above ground level.  They periodically broke formation, and some disappeared, then later reappeared and regrouped in formation again.    We suspect it might have been drones, but they were very well coordinated.   We have video taken from our cell phone.",
      "link": "http://www.nuforc.org/webreports/134/S134918.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7358",
      "summary": "Red light observed under a thundercloud, stationary for a few seconds, then went straight down and changed from red to white.",
      "city": "denver",
      "shape": "light",
      "date": "2017-06-22T00:00:00",
      "story": "Red light observed under a thundercloud, stationary for a few seconds, then went straight down and changed from red to white. A thunderstorm was forming, no rain yet, a red light was observed below the cloud and was stationary for a few seconds, then it fell straight down, disappeared, and reappeared and turned white, then fell below the tree line. ((NUFORC Note:  This report was submitted on behalf of the eyewitness, who is very experienced in the airline industry, and who wishes to remain totally anonymous.  The person who wrote the report has worked in the aerospace industry for many decades.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134687.html",
      "state": "CO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7443",
      "summary": "Huge rectangular dark object flying.  Looked Like if somehow a semi truck was flying in the sky.  ((anonymous report))",
      "city": "denver",
      "shape": "rectangle",
      "date": "2017-05-15T00:00:00",
      "story": "Huge rectangular dark object flying. Looked Like if somehow a semi truck was flying in the sky.  Was driving so I dont know how long it was flying but was seen as I was driving south toward Denver it was flying north east.  Around 6 pm daytime. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134080.html",
      "state": "CO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7442",
      "summary": "Huge rectangular dark object flying.  Looked like if somehow a semi truck was flying in the sky.  ((anonymous report))",
      "city": "denver",
      "shape": "rectangle",
      "date": "2017-05-15T00:00:00",
      "story": "Huge rectangular dark object flying.  Looked Like if somehow a semi truck was flying in the sky.   Was driving, so I dont know how long it was flying, but was seen as I was driving south toward Denver.  It was flying north east.   Around 6 pm daytime. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134078.html",
      "state": "CO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c74f9",
      "summary": "They were triangles quick and never seen anything like it.  ((anonymous report))",
      "city": "denver",
      "shape": "triangle",
      "date": "2017-05-11T00:00:00",
      "story": "They were triangles quick and never seen anything like it. This morning, I woke up to the dogs barking outside.  I looked at the clock as it struck 4:23 and looked out the window.  I saw they triangle shaped crafts in the cloudy sky.  They were in a group together and I counted 5 then another appeared out of no where.   BY the time I was able to get my phone, they were gone as if they were never there.   I need answers I need something to tell me i'm not crazy.  This experience has changed me drastically and here I share my experience. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134059.html",
      "state": "CO",
      "duration": "Morning"
    },
    {
      "_id": "64d005f478aba2ec5a3c75f5",
      "summary": "Pink flying object that disappeared into clouds",
      "city": "denver",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "Pink flying object that disappeared into clouds I have an old dog who wakes me up to go potty at all hours of the night.  She woke me up at 2:30 on the morning of October 31 and we went outside to my backyard.  I live in the approach zones for DIA so I see many aircraft flying overhead with their landing lights on for their approach to the airport.  There are 3 safety approach zones for the airport for all but police and emergency aircraft, usually helicopters.  One goes west to east, another goes south to north and the last fro southwest to the northeast. As I was sitting watching my dog I notice an unusual aircraft flying out of the normal safety zones.  I was flying way north of the west to east zone and perpendicular to the south to north zone; crossing the southwest to northeast zone.  Next its \"landing lights\" were pink, not white or yellow.  It also did not have any navigation lights flashing.  The craft was moving rather slowly then came to a complete stop for about a minute or longer.  Then it started moving again.  It disappeared into the clouds.  The entire time there was not a sound of any kind made not even my dog.",
      "link": "http://www.nuforc.org/webreports/138/S138322.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c791d",
      "summary": "My family and I first saw a circular formation of strobing red lights. We decided to stop and look and the formation changed. They star",
      "city": "denver",
      "shape": "changing",
      "date": "2017-12-10T00:00:00",
      "story": "My family and I first saw a circular formation of strobing red lights.  We decided to stop and look and the formation changed.  They started to line up and continue to move West or North it looked like.",
      "link": "http://www.nuforc.org/webreports/137/S137659.html",
      "state": "CO",
      "duration": "20+minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7950",
      "summary": "Red and white blinking lights in a downward line formation. Traveled from east to west maybe 25 miles then disappeared.",
      "city": "denver",
      "shape": "formation",
      "date": "2017-12-10T00:00:00",
      "story": "Red and white blinking lights in a downward line formation.  Traveled from east to west maybe 25 miles then disappeared.",
      "link": "http://www.nuforc.org/webreports/137/S137656.html",
      "state": "CO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7955",
      "summary": "Denver:  String of lights, in formation, no sound.  ((anonymous report))",
      "city": "denver",
      "shape": "formation",
      "date": "2017-12-10T00:00:00",
      "story": "Denver:  String of lights, in formation, no sound 9News is reporting a string of lights moving in formation, about 13, without any sound. Numerous pics and even video on YouTube.   Apparently didn’t show up on radar. .  https://youtu.be/6NG9v7Nd6cw I personally didn’t observe it, but I’m sure there is enough reports for you guys to look into it.   My guess would be military, but who knows. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137672.html",
      "state": "CO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7bb2",
      "summary": "((HOAX??))  it flew across the sky super fast me and my family saw it clearly  ((anonymous report))",
      "city": "denver",
      "shape": "disk",
      "date": "2017-11-03T00:00:00",
      "story": "it flew across the sky super fast me and my family saw it clearly ((NUFORC Note:  We assume that the sighting occurred on November 3rd, and have amended the date above.  Witness elects to remain anonymous, and provides no contact information, so we are unable to confirm the date.  Possible hoax, we susptect.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137092.html",
      "state": "CO",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7bfa",
      "summary": "8 Translucent Spheres w/ Cloud Texture.",
      "city": "denver",
      "shape": "sphere",
      "date": "2017-10-05T00:00:00",
      "story": "8 Translucent Spheres w/ Cloud Texture At 1:38pm, on Friday, September 29th, 2017, I saw a number of translucent spheres flying below me, as we were 1 minute into our initial ascent above DIA. If you have a guess as to what these UFOs were, then I would love to hear from you.  The objects were as follows:  •8 perfectly spherical objects •Translucent with \"soft\" edges, unlike the defined edges of a balloon.  They appeared to have the exact same texture as the surrounding clouds. •6-12 ft in diameter and all the same size  •Appeared stationary, but possibly moving at low speed •Each maintained a distance of about 3x their own diameter from the next object  •Arranged in no particular order or on a particular plane",
      "link": "http://www.nuforc.org/webreports/136/S136516.html",
      "state": "CO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7bed",
      "summary": "Falling star became closer to the ground by the seconds and appeared in the shape of an upside down teardrop floating above my car.",
      "city": "denver",
      "shape": "teardrop",
      "date": "2017-10-19T00:00:00",
      "story": "Falling star became closer to the ground by the seconds and appeared in the shape of an upside down teardrop floating above my car. Driving down 285 west of Santa Fe, there was what appeared to be a bright planet or star in the sky off in the West.  Driving farther west, object began dropping slowly, (almost like a falling star) closer to the ground becoming brighter.   When crossing over Federal, I drove right under the object, it had a bright light and was flashing red on the sides. It was in the shape of an upside down teardrop with circles around the top.  Object disappeared after driving under it.   After the experience, I felt extremely uneasy and eyesight was affected right after.  Almost like I came across a very powerful energy.",
      "link": "http://www.nuforc.org/webreports/136/S136823.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c5b",
      "summary": "A cluster of whitish balls with blue chevron wings over Denver Colorado",
      "city": "denver",
      "shape": "triangle",
      "date": "2017-10-05T00:00:00",
      "story": "A cluster of whitish balls with blue chevron wings over Denver Colorado We were diving from the store, when we noticed what looked like a cluster of balloons floating north.  Approximately 15 to 20 of them.  I pointed it out to my wife and daughter.  Then we noticed they were swirling in circles.  We thought they might be birds.  I thought they might have caught a air current and were playing.  But we noticed they looked like dull whitish balls with blue chevron wings.  Still, I figured they might be birds.  My wife took out her phone to video tape it, but they vanished.   We were near our home so when we got there we got out and looked for them.  I found 4 of them so I took out my phone to video tape then.  When I pointed my phone at them my phone started making a grinding sound.  Even my daughter asked me what was my phone doing. I didn't know as I've never seen my phone do that.   When I looked up to locate them, there was only 1 left and I watched it move northwest and then disappear.",
      "link": "http://www.nuforc.org/webreports/136/S136506.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d86",
      "summary": "Strange colored lights blinking and moving erratically in south Denver sky.",
      "city": "denver",
      "shape": "other",
      "date": "2017-09-08T00:00:00",
      "story": "Strange colored lights blinking and moving erratically in south Denver sky. I first noticed 2 distinctive lights.  one red and one green.  The red light was in the upper left and the green light was to the bottom right.   The lights were solid, then they began to blink.  Both started blinking in a pattern that was frequent in wavelength like that of a plane, but then they started blinking independently instead of at the same time.  Then the green light went out and the red light started moving up and down erratically and very precisely.   Then the green light came back on and blinked very erratically and the red went off.  It then flew overhead at incredible speed from the north sky to the south sky and descended out of view.  When it flew overhead, it was pure silence.   My friend who also saw it accounts that he saw blue and white lights too.  He was certain he saw them, but I am certain I did not.  We both watched very intently.  No craft was actually seen, only two lights.",
      "link": "http://www.nuforc.org/webreports/136/S136072.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8043",
      "summary": "Sighting of distant object moving at high speed exhibiting ability to almost instantly \"jump\" ahead and laterally.",
      "city": "denver",
      "shape": "light",
      "date": "2018-04-05T00:00:00",
      "story": "Sighting of distant object moving at high speed exhibiting ability to almost instantly \"jump\" ahead and laterally. On 04/03/2018, at approximately 06:00, I observed a fast-moving object at apparently very high altitude, moving from North to South.  It crossed between the two stars in Ursa Major that point towards Polaris and Polaris itself, somewhat closer to Polaris.  Object appeared to be at significantly greater altitude than commercial airliners, though possibly attainable by military aircraft.  It reminded me somewhat of early satellites which did not follow the earth's rotation in terms of brightness, but speed was greater.  The object was too distant to determine size or shape.  The sky was cloudless and dark. What caught my attention was that it appeared to consistently move at what I surmised to be several times the speed of sound, yet several times instantly “jump ahead” some distance.  Distance “jumped” was hard to estimate due to altitude, but I would say in the tens of miles each time.  Twice, the object “jumped” laterally as well, though I would estimate a shorter distance.   I followed the object until it passed the treeline at my house.",
      "link": "http://www.nuforc.org/webreports/139/S139347.html",
      "state": "NC",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8571",
      "summary": "Big orb in the W sky.  Lasted 15 mins and changed in color.  ((anonymous report))",
      "city": "denver",
      "shape": "oval",
      "date": "2018-08-10T00:00:00",
      "story": "Big orb in the western sky.  Lasted 15 mins and changed in color from time to time...at first pink then red, then gold then orange, changing color slowly.  Did not seem to move.  Then got fainter and fainter and could no longer see,",
      "link": "http://www.nuforc.org/webreports/142/S142365.html",
      "state": "CO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c857d",
      "summary": "I saw a UFO in the sky while I was on an airplane",
      "city": "denver",
      "shape": "flash",
      "date": "2018-08-31T00:00:00",
      "story": "I saw a UFO in the sky while I was on an airplane On August 18th, 2018 I was on an airplane flying from North Carolina to Los Angeles.  When we were passing Denver, Colorado, (or close to Denver, according to the airplane map), I opened my window and saw that there was a thunderstorm a couple of miles away.  I was sitting on the left side of the plane in the window seat, and the storm was directly in front of my window.  I pulled out my phone to take a video of the lightning because I thought it looked pretty cool from how high up we were.  While I was filming, I noticed a flashing red and white light flying.  It was flying the opposite direction of the plane I was in.  The object was flying in a straight line, and then it started to lower, stopped blinking for a second, and then when it started blinking again, it was up high again as if it had reversed.  It then kept flying away.  It looked almost like a drone, but because of how high up we were, there’s no way it was a drone or a building light, etc.  I also thought it could’ve been! a plane, but because of how quickly it moved, I didn’t think it could be that either.  I think I would of been able to see the outline of the plane if that had been what it was also.  It was very small and I didn’t see it’s shape because of how dark it was.  I caught it all on video though and it still confuses me.",
      "link": "http://www.nuforc.org/webreports/142/S142907.html",
      "state": "CO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c888e",
      "summary": "3 stat. lights in a triangular pattern on the E hor.  Lights then disappeared one at a time.  ((anonymous report))",
      "city": "denver",
      "shape": "unknown",
      "date": "2018-06-28T00:00:00",
      "story": "Three stationary lights in a triangular pattern on the eastern horizon.  The lights then disappeared one at a time at approximately one minute intervals.  Observed from 11th Uinta.",
      "link": "http://www.nuforc.org/webreports/141/S141965.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c88ab",
      "summary": "A cluster of lights moving quickly in my video from right to left at 4 seconds in my video.",
      "city": "denver",
      "shape": "flash",
      "date": "2018-06-21T00:00:00",
      "story": "A cluster of lights moving quickly in my video from right to left at 4 seconds in my video. I was on a plane flying from Dallas to Denver and was using my IPhone to video tape a plane an another object that was likely another plan that was flying near my plane.  The questionable object was flying from my left to right and I was following it with my phone.  However, when I showed my wife the video upon my return to Dallas, she noticed a flash that went from right to left at the 4 second spot of the 15 second video.  I slowed it down and it looks like a cluster of lights in a circular pattern.  I will submit the video following this submission, but I can't figure out what it is. ((NUFORC Note:  We have viewed the video in question, and our guess is that the flash of light was caused by a reflection from the inside surface of the aircraft's window.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141855.html",
      "state": "CO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8893",
      "summary": "I WAS WAITING FOR THE BUS AT 9TH AND GRAPE AFTER THE BOY SCOUT MEETING. I LOOKED AND THE CRAFT FLEW EAST TO WEST OVER THE PALMER SCHOOL",
      "city": "denver",
      "shape": "unknown",
      "date": "2018-06-21T00:00:00",
      "story": "I WAS WAITING FOR THE BUS AT 9TH AND GRAPE AFTER THE BOY SCOUT MEETING.  I LOOKED AND THE CRAFT FLEW EAST TO WEST OVER THE PALMER SCHOOL.  IT CHANGED COLORS FROM BLUE TO ORANGE.",
      "link": "http://www.nuforc.org/webreports/141/S141865.html",
      "state": "CO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e12",
      "summary": "Cigar, no wings, tail, or lights moving from south to north.",
      "city": "denver",
      "shape": "cigar",
      "date": "2019-01-11T00:00:00",
      "story": "Cigar, no wings, tail, or lights moving from south to north. Went out in the morning and looked east to see a large fuselage (cigar) no wings, no tail, no blinking lights.  Airplanes should still have lights on at that time.  Watched it move from south to north for several seconds, wishing I had my phone.  It went through a cloud and was never seen again.",
      "link": "http://www.nuforc.org/webreports/144/S144347.html",
      "state": "CO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fc5",
      "summary": "Clear objects with flashing lights over Carson Elementary school.",
      "city": "denver",
      "shape": "unknown",
      "date": "2018-11-30T00:00:00",
      "story": "Clear objects with flashing lights over Carson Elementary school. Looking east from playground at Carson Elementary School. Dark, stormy cloud cover made the objects more obvious.  Could not tell shape.  Approximately 8-10 objects appeared to be clear blades with flashing white lights (one or two each?) flying at varying speeds and heights.  No sounds; variety of movements and groupings.  Tried to take pictures but too far away and too small. There were other people on the playground with me, but I did not think fast enough to ask if they saw them.",
      "link": "http://www.nuforc.org/webreports/143/S143907.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9129",
      "summary": "This was over Empower Field. Three lights quickly changing formation in several different sequences",
      "city": "denver",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "This was over Empower Field.  Three lights quickly changing formation in several different sequences",
      "link": "http://www.nuforc.org/webreports/149/S149519.html",
      "state": "CO",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c91b7",
      "summary": "I saw a large triangular shaped craft with no engine sound, no lights, no exhaust trail, cloaking against the night sky over Denver.",
      "city": "denver",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "I saw a large triangular shaped craft with no engine sound, no lights, no exhaust trail, cloaking against the night sky over Denver. At approximately 8:30 PM on 10/8/19 I went out on my east-facing balcony to get some fresh air.  Beautiful clear starlit night.  I looked up and to my amazement I saw a triangular shaped black craft gliding silently coming from the north and heading south about 5,000 feet up.  There was no sound, no lights and no visible exhaust trail.  My eyes were fixated on it.  It appeared to be cloaked and blended into the night sky, but because it was moving, I could see its shape as it blocked out the stars.  I am estimating that it was less then a mile away and it appeared to be large in size.",
      "link": "http://www.nuforc.org/webreports/149/S149725.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9211",
      "summary": "I saw what looked to be a shooting star, however it was too low to be one. It was probably flying at the same altitude as a plane maybe",
      "city": "denver",
      "shape": "flash",
      "date": "2019-12-01T00:00:00",
      "story": "I saw what looked to be a shooting star, however it was too low to be one. It was probably flying at the same altitude as a plane maybe lower. It was a bright light with a blueish hue, that appeared then disappeared in a matter of seconds.",
      "link": "http://www.nuforc.org/webreports/150/S150198.html",
      "state": "CO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c94dc",
      "summary": "Unnatural movment of craft over denver - Possible UFO",
      "city": "denver",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "Unnatural movment of craft over denver - Possible UFO An unknown, eerie orange light, comparable to aircraft headlights, but much brighter, streaking across the view from my back yard. The light then disappeared- and turned into blinking red and blue lights. The \"craft\" then moved from one side of the horizon to the other, with acceleration that modern science deems impossible for aircraft. The \"craft\" then moved unnaturally, perfoming an unnatural loop in the sky, raising 1000 or more feet almost instantly. The \"craft\" then looked as if it was \"shaking\" bouncing around in an area of the sky. Then within 10 seconds, the \"craft\" lights were slowly disappearing from ny view, until they were gone.",
      "link": "http://www.nuforc.org/webreports/150/S150622.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9605",
      "summary": "Going North on Sante Fe to Evans when I saw a bright colorful light in the sky. It was going West and flashed 3 times slowly.",
      "city": "denver",
      "shape": "flash",
      "date": "2019-12-01T00:00:00",
      "story": "Going North on Sante Fe to Evans when I saw a bright colorful light in the sky. It was going West and flashed 3 times slowly while moving along the sky.  After the third flash, it disappeared into the sky.  At first, I thought it behind some clouds because of the way it disappeared but realized it was a clear sky after I let it sink in.",
      "link": "http://www.nuforc.org/webreports/150/S150855.html",
      "state": "CO",
      "duration": "~30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3c9645",
      "summary": "Several massive fireballs appearing and reappearing in different #s, 2 to 4 to 3.  No apparent formation or shape.",
      "city": "denver",
      "shape": "fireball",
      "date": "2019-10-04T00:00:00",
      "story": "Several massive fireballs disappearing and reappearing in different #s, 2 to 4 to 3.  No apparent formation or shape, would reappear in a different spots sometimes, but still close to each other.  My GF and I were walking to meet friends and we both saw them.",
      "link": "http://www.nuforc.org/webreports/149/S149230.html",
      "state": "CO",
      "duration": "5 minutes"
    }
  ]
}