{
  "city": "detroit",
  "fetch_timestamp": "2025-07-12T14:25:53.414765",
  "record_count": 81,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4c14",
      "summary": "While taking a scenic photo of Mt. Jefferson, looking S. I noticed a silver sphere motionless.  ((anonymous report))",
      "city": "detroit",
      "shape": "sphere",
      "date": "2019-06-20T00:00:00",
      "story": "While taking a scenic photo of Mt. Jefferson, looking south.  I noticed a silver sphere motionless and no sound for approx 5 minutes,  I looked away for a moment and when I looked back it was gone, I got a picture of it. ((NUFORC Note:  Witness does not send photo; elects to remain totally anonymous, so we are unable to contact him/her in order to have the photo forwarded to our Center!!  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146736.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4de7",
      "summary": "My aunt grew up in Detroit near Ford Road and Evergreen, on Minock St. About 1954 or 1955 One day when she was 12 years old her and a f",
      "city": "detroit",
      "shape": "unknown",
      "date": "",
      "story": "My aunt grew up in Detroit near Ford Road and Evergreen, on Minock St.  About 1954 or 1955 One day when she was 12 years old her and a friend were outside on the driveway.  All of a sudden there was a large unidentified flying object just over the houses across the street with flashing red and blue lights.  They screamed and a neighbor 2 doors down was working on his car and he came out yelling \"did you see that?\"  I heard the story a long time ago, and mostly forgot about it. Now that I think about it, the Army missiles were everywhere in Detroit. North and South of grandmothers house.  Really close.  My uncle from Illinois was stationed there.  The ufo was not a mile away from the Nikes. Please feel free to edit this any way you see fit. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145915.html",
      "state": "MI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5261",
      "summary": "While getting ready to walk to the store for cigarettes late on August 25, 1995, I opened my door and my dog got out .  I saw lights th",
      "city": "detroit",
      "shape": "other",
      "date": "2008-06-12T00:00:00",
      "story": "While getting ready to walk to the store for cigarettes late on August 25, 1995, I opened my door and my dog got out.  I saw lights throbbing like a light bulb going off and on coming from a distance towards my residence.   When the lights came close I saw a large black metal looking craft slowly going forward in the sky.  My view was from the side so I could not tell the over all shape other than to say it looked very angular and had ends that were not simular.  It was surrounded top and bottom by piercing beautiful blue lights.   I was scared but I also felt that the craft was in trouble and had nearly stopped due to what seemed like a power failure. Then it suddenly shot high speed toward downtown Detroit taking a nearly 90 degree turn. I ran in the house AND LOCKED MYSELF IN MY BEDROOM AND CALLED MY MOTHER AND BOYFRIEND.  My boyfriend was at the bar and all of his friends had a good laugh on me.  I told them I was sure others had seen it and  I bet they would hear about it on the news.  I loved the look on my boyfriends face when it later came on the news.   HAHAHA!!!!!",
      "link": "http://www.nuforc.org/webreports/062/S62827.html",
      "state": "MI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5778",
      "summary": "Saw UFO with eyes closed, woke me up with a start from dead dreamless sleep, i live alone!",
      "city": "detroit",
      "shape": "triangle",
      "date": "2007-11-28T00:00:00",
      "story": "Saw UFO with eyes closed, woke me up with a start from dead dreamless sleep, i live alone!   Very easy to discribe, but you wont believe. I bought a house in detroit, and i lived there about one year and started having dreams about, well everything. Then one day i was sleeping in my bed on my side facing north and I was awoken by a three dimensional triangle. It was like GOD, and totally scared me. it started between my eyes, close to my face and moved to the left in a perfect golden(actually like a silvery) line. I will explain in cartesien coords. positive X-dir points into your face, positive Y-dir points to the right, and positive Z-dir points up. I will use the unit vector space of i+j+k. start to finish it took this path in straight lines. (1,.5,0) (1,0,0) (.5,.5,sqrt 3/4)) (0,1,0) (0,.5,0) a pyrimid!!!!!   saw it with both eyes, and they were both closed. I could not open my eyes until the design was over. It was not a dream. all the lines stayed there and did not fade until the design was completed and then they all vanished at once. I have noticed stange phenominon on the abdomins of bugs. such as little spirts of light shooting directly out of one type of bug butt. all of one kind of that bug on a certain day do it exactly the same, but not at the exact same time. this is wierd because i came back thoughout the day and the light about the length of my fingure nail and as thin as a microscopic wire being lit was the same every time and from every angle, inside the house, and outside in the garden. when i look for them i can see the glittery light in my eyes any time i want now that i know what it is. I assume that it either has to do with getting someones attn. that this is the only way to comunicate from the future. such as the use of a creating a new life force with the message ebeded in the DNA, and the key is to be the first to find the new bug of the year and decode the message. I am the only one i know who also does not remember this bug from the previous year. OK, am i really that off topic? There have been more bugs that I have seen that have come in mass amounts that have not been there the year before. That bug that looks like the ladybug but was a beatle, NEW!!!. the one i saw was black, had a red v on the back and was about 2 cm long. I currently am around the cylotron at MSU alot. I saw one other design that was a flash of about 1/20 th of a second and looked like a non moving design: _ <X>, with a lines on the sides, top and bottom. Like: <|X|> with all the gaps touching                                                -  I have a book on the oldest GOD dating back to 3000 years before the pyrimids were built, THOTH. the design on the cover is,  /\\ /  \\ /----\\ / \\  / \\ /___\\/___\\ , with a dot in the middle. it is black and the design is white. If you add the three designs together you get a 23 line design, in a dream i drew the first 17 lines of the puzzle. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59160.html",
      "state": "MI",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b5951",
      "summary": "white bright circle hung in the sky for approx. 3 seconds before gliding silently in a arc away(northernly) from it's position",
      "city": "detroit",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "I had made this report soon after it happened before but can't find it.  About 10:30ish In October 1996 , I believe it was the 28th. as usual I took my dog in the backyard. to my left ( north easternly) a clean white bright circle hung in the sky for approx. 3 seconds before gliding silently in a arc away(northernly) from it's position and upwards in the sky until no longer visible.  the sky way clear.  I would guess the size to be between a quarter and a  50 cent peice held out at arms length. It seemed to be a bit away.  the whole thing took less than approx. 10 seconds.  strangely enough over the next week the dog wouldn't go into the back yard without me. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54425.html",
      "state": "MI",
      "duration": "less than a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a81",
      "summary": "The“craft” slowed to a full stop and hovered just above a cemetery that was 3 streets north of ours",
      "city": "detroit",
      "shape": "disk",
      "date": "2007-04-27T00:00:00",
      "story": "This incident occurred over 30 years ago (1974?) so I will tell it to the best of my recollection.  It was mid September early in the evening, just before the streetlights came on. 2 of my brothers, 2 friends and myself were hanging around out side in front of my parent's home. I noticed a distinct flickering light coming just east of our subdivision, in the sky. I lived right near the Detroit city airport and was used to seeing all kinds of different aircraft. Yet here was this strange flickering light coming out of the eastern sky, catching my attention!  Intrigued, the 5 of us decided to watch the path of this strange moving “craft” as it continued across the sky due west. I say “craft” now because at this point, about 5 minutes after we first noticed it one could plainly see what I can only describe as a flying saucer! There it was plane as day just moving across the sky for all to see, a classic type flying saucer. On the out side diameter were these different colored lights, red, yellow and blue. Just moving around clockwise.  Now here's where it gets really interesting, in our subdivision there was a side street that ran north and south, this is where we stood most of the time watching. The“craft” slowed to a full stop and hovered just above a cemetery that was 3 streets north of ours. It hovered  lower until it was about 60 feet above the ground. If you hold a silver dollar at arms length and held it up at about a 30 degree angle that's  the size it looked in the air. So it was abuot 40 feet in diameter.  The 5 of us thought it was just too cool! I was shaking like a leaf. We watched this thing as it hovered there,just “showing off” I thought, for about 4 minutes when suddenly it decides to hover on an angle exposing the bottom side of the “craft”.  It was the weirdest thing, the bottom was just solid black void! If the flickering lights were shut off and the “craft”  hovered above you ,you wouldn't even know it was there unless it made some kind of noise. I didn't here any distinct sound coming from it from where we stood watching. The “show-off” decided it was time to move on so the “craft” straightened  horizontally (like most flying saucers I guess). It began moving straight up in the air until it was about as high as a small Sezna plane would fly. It continued it's westerly path rather slowly, again like a small plane, then suddenly the “craft” just shot it's self like at warp speed westward and was gone out of sight. “Wow!!” I said to myself, “I always wanted to see a UFO!”  A few moments later there were 3 police choppers hovering above the cemetery were the “craft” was. I never herd or read anything about the incident from the news, “Hush-Hush” I guess. If anyone else has seen this sighting, I shure would like to know! ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56346.html",
      "state": "MI",
      "duration": "15-20 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b5ade",
      "summary": "Detroit UFO Flap of February 1978",
      "city": "detroit",
      "shape": "",
      "date": "2007-04-27T00:00:00",
      "story": "Detroit UFO Flap of February 1978 This report is of a historical nature.  I want to emphasize that I did not witness a UFO during the time period described. Back in 1978, when I was in high school, I vividly recall a major UFO Flap that occurred in February and March of that year. My friends and I were very excited by it because almost every day there were reports on the local news and radio about another UFO sighting. Some of them were quite spectacular.  However, this major UFO flap seems to have been forgotten in the UFO literature, so I did some research at a local university library of The Detroit News from that time period.  I was disappointed that only one article was written during that time. The article has been sent electronically via email. It discusses some of the UFO sightings, but not all of them.  The one I remember most distinctly occurred during afternoon rush hour.  The local television news reported that many witnesses reported a low flying UFO buzzed down the I-96 expressway in Brighton, over hundreds of cars. Apparently, many people got out of their cars to get a better look.  This occurred a week or two before the report about the UFO following the park rangers, which is in the article.  I asked a coworker if they remembered the flap.  He said that he did. Surprisingly, he went on to explain that his father was a narcotics detective for the Detroit Police Force and that one of his father’s friends flew the police helicopter. During the time period in question, the Detroit Police helicopter pilot stated that a UFO followed his helicopter. He tried to lose it but could not. I wonder how many other incidents like this may have occurred that were never reported.  I will continue to inquire regarding this interesting time period.  Perhaps other readers of your website remember this flap also and can add further details or historic sources. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55967.html",
      "state": "MI",
      "duration": "1-2 Months"
    },
    {
      "_id": "64d005f478aba2ec5a3b5baf",
      "summary": "As i was driving  to my house the craft was hovering above the road. I could make out tall things moving around inside. They stopped as",
      "city": "detroit",
      "shape": "oval",
      "date": "2006-10-30T00:00:00",
      "story": "As i was driving  to my house the craft was hovering above the road. I could make out tall things moving around inside. They stopped as i think they saw the car. There was a flash. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51583.html",
      "state": "TX",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c45",
      "summary": "Oval shape craft seen in cloudbank  tilting back and forth.",
      "city": "detroit",
      "shape": "oval",
      "date": "2007-04-27T00:00:00",
      "story": "Oval shape craft seen in cloudbank  tilting back and forth. I live about 10 miles from the Wayne County Airport and have a picture window facing southwest. This window is located in my upstairs den. My house is located along a flight path, so I often see planes landing and taking off. I often track them with binoculars and watch the spectacular sunsets and military jets that are routinely streaking across the sky. My kids and I were on our way to dinner so I took a quick look with my binoculars out the window at a cloud bank. That’s when I saw an oval/egg shaped object tipping back and forth but going in a straight line. It was a dull brown in color and the sun was behind it. The strange thing is that when I lowered my binoculars in disbelief; the craft was not visible to the naked eye. But when I raised them it was visible again and still going along the same trajectory which was west to east, I believe. I watched it until it went out of sight from my point of view. It was solid and had to be huge. The way it appeared in my view was as clear and solid as planes at the height and distance have appeared to me. A military jet followed roughly along the same path but above it 3-5 minutes later.  I’ve always believed in UFOs but this is my first sighting. I personally believe they are spiritual in nature but I digress.",
      "link": "http://www.nuforc.org/webreports/055/S55917.html",
      "state": "MI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ee7",
      "summary": "Disc sighting in Detroit",
      "city": "detroit",
      "shape": "sphere",
      "date": "2008-02-14T00:00:00",
      "story": "Disc sighting in Detroit These events happened on March 8th 1975 in Detroit MI. Sky was clear.  At about 7:00 pm in the evening I was walking to my friend’s house about a block and a half away. As I was walking I looked in the western sky and noticed a bright star, which was 90 degrees from me. It was unusual but I didn’t pay much attention. As I walked along I looked again and it not only had moved ahead but had gotten bigger which I began thinking was unusual. Walking along about 100 feet further I looked again and it had moved farther ahead and became much bigger. At this point I was nearing the end of the block and started to watch it continually. It started moving closer and became much bigger. The last time I looked I had crossed to the next block and it was hovering almost directly above me. It was a ball perhaps 150 feet in diameter, without sound and had a red light on the bottom. At this time I sprinted the half block to my friends house.",
      "link": "http://www.nuforc.org/webreports/061/S61492.html",
      "state": "MI",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b605e",
      "summary": "Disc sighting in Detroit",
      "city": "detroit",
      "shape": "disk",
      "date": "2008-02-14T00:00:00",
      "story": "Disc sighting in Detroit This happened in August of 1980 about 11:30 at night in Detroit MI. Weather was partly cloudy. Being summer, my father was sitting on the porch. He walked in and said, \"Hey, do you want to see a UFO?\"   I thought, what a silly joke but got up anyway and went out on the porch.  When I went on the porch I looked up and saw an enormous disc hovering in the sky above the trees to the east. It looked to be in the area of 300 feet long and had a row of illuminated portholes along the side.  It was silent and floating in the same manner as a boat would in water.  My mother, grandmother, aunt and uncle also came out to look. We watched it a good 10 minutes before the tops of the trees obscured it. ((NUFORC Note:  Date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61495.html",
      "state": "MI",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b626b",
      "summary": "it was a circle with a bubble on the under side with windows and it was silver",
      "city": "detroit",
      "shape": "circle",
      "date": "2006-07-16T00:00:00",
      "story": "it was a circle with a bubble on the under side with windows and it was silver me and my sister was on the roof of the place we lived about 8:00pm i saw some thing it shot out of the sky from the west and stopt about 500ft from me for about 5 to 10min i told my sister i want to go and get my camera then i told my sister no they may do some thing to me if i do that the object was a circle it was silver and had a bubble on the under side of it it looked to be windows on it then it went north east slow past me then it vanishd",
      "link": "http://www.nuforc.org/webreports/051/S51082.html",
      "state": "MI",
      "duration": "ufo"
    },
    {
      "_id": "64d005f478aba2ec5a3b660b",
      "summary": "I’m 29 years old, Caucasian male, and currently work as head of maintenance for an apartment building in downtown Detroit. I don’t make",
      "city": "detroit",
      "shape": "other",
      "date": "2008-01-21T00:00:00",
      "story": "I’m 29 years old, Caucasian male, and currently work as head of maintenance for an apartment building in downtown Detroit. I don’t make a practice of telling lies or wild stories; I don’t do any drugs, and have no criminal record. I’m not too worried about my privacy as I have nothing to hide, and if anyone has more questions about my sighting I would be happy to try and answer them.  I was on the thirteenth floor of the apartment building I work for in downtown Detroit.  It was a very sunny day, and something in the sky was reflecting the sun light and it caught my eye.  At first I thought it was one of those silver looking aluminum balloons a child might have, but it seemed to be moving towards me at a high rate of speed as it was now much to large to be a child’s balloon.  I can now make out the shape of the craft as it seems to have stopped in mid-air only a few hundred feet outside the window I’m standing at.  It has a clover shape to it.. Three disk shapes connected in the center, with a sort of bulged center area. At this point the craft starts to rotate up on its side, so that the bottom of the craft is facing towards me. I see a blinking red light in the center of the craft and each clover has a large white circular light on it taking up most of the area of the bottom of these three disks. It’s very hard to explain the features of the craft in words.  So at this point it’s been maybe 30-40 seconds that I’ve been watching this thing, and it’s now hovering at a 90 degree angle to me just a few hundred feet out my window on the thirteenth floor.  I start to get the feeling this thing knows I see it and it can see me, as it suddenly displays a light sequence of blue, green, white, and red in an extremely fast flickering pattern. I don’t know how else to describe this light array other than hypnotic in nature, it lasted only a few seconds and when the light show was over, the craft rotated back down from the right angle it was at, and floated off in a south easterly direction (basically directly over Comerica Park) until I lost sight of it.  This is absolutely 100% the truth, and the strangest experience I’ve ever had in my life. I’m not the type of person who looks for these kinds of things or believes every conspiracy theory out there, more than anything else I hope maybe someone else reported the same thing and I can help confirm there story.",
      "link": "http://www.nuforc.org/webreports/060/S60728.html",
      "state": "MI",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6abf",
      "summary": "Amazing dayligt sighting of huge silver cigar shaped ufo",
      "city": "detroit",
      "shape": "cigar",
      "date": "2007-08-07T00:00:00",
      "story": "Amazing dayligt sighting of huge silver cigar shaped ufo I was driving west on Plymouth in detroit michigan turning on north bound Telegraph. Its a rather long merge lane. As I turned into the curve I saw a cigar shaped , very bright silver ufo. I first thought it was a plane but it didnt move at all.We have a flight pattern over my house so I know the size of planes as they come in for a landing. This thing was about 4 times the size of a plane at that height and distance. It was no more than a couple hundred feet in the air and less than a mile away. There seem to be a tinge of red on the back end of it. I watched it as I turned onto telegraph rd. It stayed perfectly still. As i turned my head to make sure there were no cars in the lane I turned back to look to make sure the ufo was still there but it was gone. I looked all around but it was nowhere to be seen.",
      "link": "http://www.nuforc.org/webreports/057/S57482.html",
      "state": "MI",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7596",
      "summary": "bright comet like light streaked across the michigan sky line",
      "city": "detroit",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "bright comet like light streaked across the michigan sky line a white object streaked the sky over I-75. witnessed by my father at 5:00 am on his way to work from the michigan international airport. what was witnessed is unknown possible meteor. was not an aircraft object was moving to fast for even a fighter jet we have lived next to an airfield for the past 23 years we know how to identify aircraft and fighters. other information unavailable",
      "link": "http://www.nuforc.org/webreports/056/S56175.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7667",
      "summary": "US Air Force commercial clearly shows UFO, how many times have you watched this on TV and never seen the UFO.... WOW!!!",
      "city": "detroit",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "US Air Force commercial clearly shows UFO, how many times have you watched this on TV and never seen the UFO.... WOW!!! Sorry, I just sent this same exact report but this one (unlike the previous one) has the correct link. Sorry about that.  I don't have the editing material to make this easy to spot... but this is a big one... you won't believe it. This footage was taken via the US Airforce... and they don't even know it. This is not a hoax. I put the video up on google video and will privide the link at the end of this report. This is a TV commercial by the US Airforce... taken by their camera men, their personal, their everything. Just before the bomb blows up... you'll here the guy say:  \"Thatway nobody gets hurt...\"  When he says the word \"hurt\" look above the car... you will see a disk screaming from over the horizon and dispapearing from above the camera in under a second... I am amazed. Let me know if I can be of any help... you can leave a coment on the video page if you want to contact me. http://video.google.com/videoplay?docid=8861352531472015562  God bless you! Chris ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  We have not seen the advertisement, but we would be surprised if the USAF put UFO's in their recruiting pieces.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59091.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7778",
      "summary": "Was talking with friends when we saw two fireballs flying accross the sky in southwest detroit.  Lasted approx. 5 min.",
      "city": "detroit",
      "shape": "fireball",
      "date": "2007-06-12T00:00:00",
      "story": "Was talking with friends when we saw two fireballs flying accross the sky in southwest detroit.  Lasted approx. 5 min. I was talking with my friends outside when we saw 2 orange fireballs flying through the sky.  My friend reported seeing one of them stop in midair.  They lasted approx. 5 min and then faded away.",
      "link": "http://www.nuforc.org/webreports/056/S56895.html",
      "state": "MI",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e1b",
      "summary": "We were under brilliant illumination that was much brighter than the 2:30 pm afternoon clear day sunlight.",
      "city": "detroit",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "We were under brilliant illumination that was much brighter than the 2:30 pm afternoon clear day sunlight. While driving many years ago with a friend a bright orange light shown down and filled the passenger car department although we were shielded then stopped.  We looked at each other and said I don't know what that was but not normal.near--telegraph road and grandriver 1969 or 1979 ((NUFORC Note:  Witness indicates that date is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72965.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b84ef",
      "summary": "0N AUGUST THE 10TH 2008 I WITNESSED A CIRCLE SHAPE BRIGHT OBJECT APPEAR AND IN 3 SECONDS DISSAPEAR RIGHT BEFORE MY EYES.",
      "city": "detroit",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "0N AUGUST THE 10TH 2008 I WITNESSED A CIRCLE SHAPE BRIGHT OBJECT APPEAR AND IN 3 SECONDS DISSAPEAR RIGHT BEFORE MY EYES. I WAS SITTING IN MY WINDOW SMOKING A CIGARETTE AND OUT OF THE CLEAR SKY APPEAR A OBJECT THAT WAS LIKE A BRIGHT LIGHT COME OUT OF NOWHERE AND APPEARED OVER MY WINDOW IN PLAIN SITE FOR ABOUT 3 SECONDS AND THEN IT DISSAPEARED INTO THIN AIR.",
      "link": "http://www.nuforc.org/webreports/065/S65234.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b88a2",
      "summary": "I saw 3 lights that looked like spotlights at first.  They later started to gather together and play like children in the sky.  It was",
      "city": "detroit",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "I saw 3 lights that looked like spotlights at first.  They later started to gather together and play like children in the sky.  It was the most beautiful thing I ever saw.  I was too mesmerized to record it.",
      "link": "http://www.nuforc.org/webreports/070/S70698.html",
      "state": "MI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8cda",
      "summary": "1 craft sighted in braod daylight, I have pics I don't see where to upload.",
      "city": "detroit",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "1 craft sighted in braod daylight, I have pics I don't see where to upload. On Oct,19  2009 at around 6:30pm, I was working on the 18th floor of my apartment building in downtown Detroit, when I noticed something floating around the two smoke stacks on the power plant near my place.  It seemed to be hovering directly through the smoke of the stacks, and then around the two stacks, and then it would float a few blocks away and then back to the stacks.   At this point I had been watching this thing for about 8 minutes or so when I ran to grab my camera and returned with my girl freind and my brother in law (who was a tanker in the military).  So I snapped off these pics which I can't explain. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73038.html",
      "state": "MI",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b973e",
      "summary": "The bright fire red object moved from West to Northeast for a duration of 4-5 minutes.",
      "city": "detroit",
      "shape": "fireball",
      "date": "2009-08-27T00:00:00",
      "story": "The bright fire red object moved from West to Northeast for a duration of 4-5 minutes.  First thought it was a helicopter but it was FAR above the clouds.   Checked a weather station and the cloud ceiling was at 12,000.   Planes from the Detriot airport were visible on take-off and approach.  Object moved slowly across sky and grew dim and was gone.",
      "link": "http://www.nuforc.org/webreports/071/S71538.html",
      "state": "MI",
      "duration": "4-5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba901",
      "summary": "It moved like no other flying planes I've ever seen with quick and sharp movements, had not sound.",
      "city": "detroit",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "It moved like no other flying planes I've ever seen with quick and sharp movements, had not sound. It happened some year’s ago estimated time was 1982. I had return to Detroit, MI from living in TX for 6 months. Me and my sister were standing at a bus stop on Jefferson street near a park that sit’s in the middle of the Detroit river called Bel Island.  When a craft appeared to come from over near or from the river moving in a quick type of motion towards us we both were looking in the direction of it and stop our conversation and just were speechless. We both looked as if how is it that all of this traffic is moving and no one else seems to see this but us?  It moved so quickly we were lost for words until it left. It actually hovered over us as to observe. There was no sound. It had to be the length of a small home. It only stayed over us maybe 5 to 10 min and than left with the same sharp motion going straight than upwards so very fast. Well we than said very little until later we spoke on it. Here it is year’s later and I still think about it today.  There is no way that we are the only life, I know for myself and so does my sister. I would take any test given. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77753.html",
      "state": "MI",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3baeb2",
      "summary": "Rectangular object hovering over downtown Detroit-Windsor area during daylight hours.",
      "city": "detroit",
      "shape": "rectangle",
      "date": "2011-05-02T00:00:00",
      "story": "Rectangular object hovering over downtown Detroit-Windsor area during daylight hours. On the evening of Wednesday, April 13th, 2011, at several minutes after 7pm, I left a friend’s home in Taylor, near the crossing of Telegraph Rd. and Van Born St.  It did not take me long to get back to the highway from her house, after only a very short trip on main roads, a quick gas fill-up at the pump using my card, and then a lengthy stop at a red light, which I suspect puts the sighting at around 7:10 to 7:20 when it began, and lasted for approximately 20-25 minutes in full, though it was not completely visible for me that entire time. I drive a 1997 Pontiac Sunfire, and my sketches include features from my perspective while sitting in my vehicle.  I was driving alone with a cell phone which was packed away in a bag in my passenger seat, and because my dashboard clock does not work, I was unsure of the exact time.  I have no camera phone or other recording device, so I had to document and sketch it from memory.  To my knowledge, there were no other witnesses, although other people were driving on the same road and able to see the same thing, though none seemed to notice. On eastbound I-94 in metro Detroit, near the Southfield Highway intersection, while the interstate is significantly above ground level enough to see the object hovering near the horizon, I caught sight of what I first believed was a banner of some sort, like those trailing behind airplanes (aerial advertising).   Then I realized that this object’s relative position to me and lack of motion meant that there was no plane tugging a banner along, and I surely couldn’t spot a plane of any form near the object.  As I continued to drive, I had to fight with looking over or past other obstacles to my vision while still driving at high speeds during traffic; I did well with this, and there was luckily no danger involved during this period of time.  As I think back on it, I only wish I would have had the foresight to pull off the interstate to a main road where the object was still visible, and to watch it as long as I could.  However, I never came to the conclusion that I was the only eyewitness to this object, and surely I would see some news of it when I arrived home.  If I had the chance again, I would watch it until it left my sight on its own. As I got better and better glances at the object, I continued to move along the highway, making my way for I-75, my ultimate route back home.  At one point, I was angled so that it was visible in my passenger-side window in my direct view, with no obstacles, and showing me clearly that it was not attached to anything, and it was unlike anything I had previously seen or ever heard about here on Earth.  Though I was clearly astonished at the sight of it, I was intent on getting back home, and though I was continuously debunking my own skeptical ideas of what Earthly craft this could be, I was instinctively sure that someone somewhere was getting press coverage of this event at that very moment, and I should get home and watch the news on TV and the net.  Later, when I arrived home, I learned there was no news, no sightings on the TV or internet, and wished I would have taken action then. Because I have seen tethered balloons used as advertising, I even thought maybe it could be something like that, but the better glances I got, the more and more skeptical of my own skepticism I became. Having the object in my sights at several points on I-94, I wasn’t quite sure of where it was, or how far away it was, and therefore – how large the object might have been.  It was very difficult to discern its exact size and location, and only after looking at a Google Map of the area was I able to determine approximately where it could have been located.  Based on those figures, I would guess the craft could have been anywhere from 300 feet to a mile or more in width, and about one-quarter that in height.  If I had ever seen a rectangular blimp (an object that could hover for extended periods of time, such as this object did), I would believe this could be a blimp, but the whole concept of a rectangular aerial craft defies the use of aerodynamics used in the craft’s design in order to adequately fly the thing around during an event – this object was clearly rectangular or perhaps even more of a parallelogram, but it had relatively angular and obvious corners, with two pair! s of parallel sides.  When I first spotted the object, I could have sworn it was angled diagonally, making me think it was a banner being pulled by an airplane, though it could have been the curvature of my windshield, since I was looking between the windshield and the passenger-side window, leaning back and forward, ducking my head down and then trying to peer over – all because it was positioned somewhat behind the car frame bar between those two windows, giving me a pretty precise angle of my first sighting of it, as well as future angles. After I merged on to northbound I-75, I could see the object still in my rear-view and side mirrors, though my curving driving motion made it difficult to keep in my sight at all times.  Then, while on a straight path on the interstate, I got a very clear sighting of it in my rear-view mirror, as well as my side mirror, both separately for several seconds, enough to pinpoint a general location relative to my own position.  I have included drawings of these perspectives in my report, showing the object as it was situated in my view in both mirrors. It was still rather bright daylight outside, with the low sun nearly set, and making the colors of the sky begin to be more vibrant, giving off rosy pink tones and yellow hued light on most things reflecting it.  There were no stars visible yet, and the sky was not really dark enough for them in any location.  There were few clouds, and the ones present were very far away and thin, not having much mass or density.  No other objects appeared as solid and obvious as this one.  I could see no Earthly craft, such as planes, helicopters, or jets.  When I first glimpsed the object it was positioned in a location where it was made somewhat darker, appearing as a muted magenta or deep reddish mauve, and by the time it was positioned clearly in my window it had brightened because of the sun’s light, falling on it and the rest of the horizon. In my side window is where I caught the best glimpse of the object, and is the view I remembered when making my color renditions.  I mostly remember how the light reflected off it: it was solid, a different color than the sky, and reflected the colors of the sunset and sky, though not as if it were “shiny” so much as it was solid and had mass that caught the unique sky colors.  It did not seem to have any writings, markings, or other significant or relevant identifiers, and it not produce light, phenomena, or effects such as that.  I cannot be sure if it was silent or audible, since I was driving in a car. In full, the sites where/when the object was visible were around the Southfield Highway/I-94 intersection, for several miles, and then it was no longer visible because of the elevation of the highway for a large portion of the remaining distance to I-75.  However, it began to be visible again as I could overlook the city of Detroit from the ramp between I-94 E and I-75 N.  By the time I was heading north on I-75, it was visible in my mirrors.  I have attached a map that I got using Google Maps and adding in where I was located when I spotted the object.  Though I placed myself after Southfield Highway on my trip when I first spotted it, when I took another trip on the same route to be sure of my sighting locations, I realized that it may have been before I passed this intersection that I remember being one of my landmarks.  After driving on I-75 for some distance, I was considering getting off the highway and parking somewhere I might be able to view the object, but by that ! time I had a difficult time trying to see it, and figured it best to simply make it home and watch the news.  That was about 1-2 miles before the Davison Freeway (M-8, I believe), ending my active sighting.  I never stayed to see what the craft did, where it went, etc.  I now wish I would have parked to stay and watch it as adamantly as I did while driving on the road. The object did not seem to move, or moved incredibly slowly as if hovering, and though I could not be sure of its absolute motion or stillness due to my own driving motion, I can easily say that it did not change locations much based on the angles at which I could view it – it must have been hovering or moving incredibly slowly for an extended period of time, and no airplane could have done what it did.  As shown in one of my sketches, I broke down to myself why it could not be an airplane (with a banner or without), a simple helicopter, a military helicopter, or simple blimp, and was left with no options to my knowledge.  After extensive discussion with others as to what I could have been witnessing, the discussions have only proven to show me more ways in which the object that I witnessed was operating and was constructed unlike anything known to myself or the general public.  If it’s man-made, it isn’t publicly accessible. A friend of mine suggested that perhaps it was a Harrier jet (sp?) because they are capable of flying in one relative position for a short period, however another friend of mine who was in the US army in Iraq for three years said that that kind of jet would never hang out in one position for as long as I described, and would use a lot of fuel just to do that, while also making a loud noise that I would have heard even over my vehicle’s engine.  Lastly, though a jet is angular, this object did not have enough angles to make it a jet – only four angles, and they were simple corners.  Another friend supported my blimp theory by saying that that evening was the first night of the Red Wings play-offs, and could have been a blimp used to record the area from an aerial view. I waited to write this report in order to do some decent sketches and digital renditions of what I witnessed.  Having finished them but still seeing no coverage of the object on local media, I was about to give up my urges to report it and move on to other issues in life.  Then I saw this article (http://www.examiner.com/ufo-in-national/rectangle-ufo-appeared-a-liquid-state-over-texas?fb_comment=32512566) which described an object spotted in Texas that sounded as if it appeared similar to what I saw here in my own state.  After realizing that this thing may have made a re-appearance elsewhere, I knew I had to reveal my sighting to the world the right way.",
      "link": "http://www.nuforc.org/webreports/081/S81067.html",
      "state": "MI",
      "duration": "About 25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1b9",
      "summary": "((HOAX??)) Its at dusk on a clear in the SW corner I look tru through my glases the coors are white blue green orange it changes shapes",
      "city": "detroit",
      "shape": "other",
      "date": "2010-08-24T00:00:00",
      "story": "Its at dusk on a clear in the southwest corner I look tru through my glasses the coors are white blue green orange it changes shapes as fast as you blink your eyes its there winter and summer it has all kinds of shapes evev to a smiling mouth the lites bounce all over all kinds of shapes you can think of I wonder if anyone else sees this sometimes it can be seen in the se corner of the sky ((NUFORC Note:  If this is a serious report, we suspect that the witnesses were looking at a celestial body.  Date of sighting is not indicated in the report.  We have assigned an arbitrary date and time.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76929.html",
      "state": "MI",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bb68d",
      "summary": "I don't know what else to say! its been driving me crazy, I want to see it again",
      "city": "detroit",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "I don't know what else to say! its been driving me crazy,I want to see it again Was driving south on 75 was in an industrial was a lot of ground light.looked slightly to the left and saw what looked like a x pattern coming slowly across the highway, o lights at all.the x pattern looked like very dim ovals.barely visible.never seen anything like this before,no noise,no lights.could not make out any other shape behind the x,except a blackish back ground that seemed to absorb the ground light.I never believed in this stuff until last night.have you had any other sightings of this kind? please let me know. Thanks ((name deleted))",
      "link": "http://www.nuforc.org/webreports/079/S79005.html",
      "state": "MI",
      "duration": "15 to 20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0a3",
      "summary": "LIGHTED OBJECTS SIGHTED OVER DETROIT I75 HIGHWAY",
      "city": "detroit",
      "shape": "formation",
      "date": "2011-10-10T00:00:00",
      "story": "LIGHTED OBJECTS SIGHTED OVER DETROIT I-75 HIGHWAY My daughter and I, and two other people that we spoke to, were driving along I75N just south of the Southfield exit and saw 4 lighted objects rise into the sky, first in a sort of arched line formation, and as they ascended the formation changed into like a box formation.  I took some not too great shots with my cell phone camera.  This was not any type of aircraft or chemical light, these were OBJECTS, LIGHTED OBJECTS. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83874.html",
      "state": "MI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9f0",
      "summary": "Detroit",
      "city": "detroit",
      "shape": "sphere",
      "date": "2011-08-07T00:00:00",
      "story": "Walking home from the casino at about 12:30 AM, 7/29/11, a flying object was observed in the skies above Detroit, MI.   The object was sphere like and completely silent, appearing relatively close at first as a steady bright amber/yellow light, but gradually pulsating to a deep red color every 10 seconds or so.   The object moved swiftly across the sky moving further away.   It was observed for approx. 45 seconds, I looked away for a few moments, and when I looked back, the object had completely vanished.",
      "link": "http://www.nuforc.org/webreports/082/S82784.html",
      "state": "MI",
      "duration": "45 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bcb30",
      "summary": "A VISUAL SPHERE ON A LIVE SHOT OF DETROIT ON THE WEATHER CHANNEL AT 4:10PM",
      "city": "detroit",
      "shape": "sphere",
      "date": "2011-07-17T00:00:00",
      "story": "A VISUAL SPHERE ON A LIVE SHOT OF DETROIT ON THE WEATHER CHANNEL AT 4:10PM TODAY JULY 11, 2011,  AT 4:10pm (INDIANA TIME). I WAS WATCHING THE WEATHER CHANNEL, WHEN THEY WENT TO A LIVE SHOT OF DETORIT MI.  AND A SPHERE APPEADED ON LEFT BOTTOM OF SCREEN.  IT APPEARED TO TRAVEL ACROSS A BODY OF WATER HEADING TOWARDS THE CITY VERY,  VERY FAST. WHEN IT GOT TO THE BLUIDINGS IT SEEMED TO DO A U TURN AND MAY HAVE ENTERED THE WATER.  I WAS ABLE TO RECORD IT TO MY DVR IF A COPY OF THE FOOTAGE IS NEEDED.  THANH YOU...",
      "link": "http://www.nuforc.org/webreports/082/S82402.html",
      "state": "MI",
      "duration": "15 SEC."
    },
    {
      "_id": "64d005f478aba2ec5a3bcc0f",
      "summary": "It looked like a flaming ball of fire moving at  fast rate of speed from the South to the North.",
      "city": "detroit",
      "shape": "sphere",
      "date": "2011-07-06T00:00:00",
      "story": "It looked like a flaming ball of fire moving at  fast rate of speed from the South to the North. The first time we saw the sphere it was approximately 10:30 PM.  My neighbor saw the orange fiery sphere in the sky from the back yard.  He told us all to look and pointed at it.   It looked like it had a trail of fire moving underneath it and behind it a little too.  It was a pretty good size sphere and was moving at a high rate of speed from the South to North.  We all ran from the back yard to the front to follow it and then it stopped in the same place for about one minute then it just disappeared. At about 11:00 PM my boyfriend and I were outside in the front yard and we spotted the sphere in the same place that it disappeared.   We tried to get a video of it with our phones but we could not pick up the sphere quick enough.  This time the orange sphere was staying in the same place but only stayed glowing for about 30-45 seconds. Then the third sighting was about 11:15 PM.  I was standing alone on the back porch letting the dogs out to go to the bathroom and I saw the orange sphere again moving at a steady fast pace from South to North I ran from the back of the house and out the front door and by the time I got there I saw it disappear in the trees.",
      "link": "http://www.nuforc.org/webreports/082/S82254.html",
      "state": "MI",
      "duration": "1 hr"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4e0",
      "summary": "We were watching what we thought to be a satellite possibly and then all if a sudden it lit up! It was very bright and started moving a",
      "city": "detroit",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "We were watching what we thought to be a satellite possibly and then all if a sudden it lit up!  It was very bright and started moving a little faster.  It stayed bright for about 30 to 40 seconds.  There were 4 of us that saw it.  It then faded and you could hardly see it.  It then lit up again and then it was gone!  We also saw 2 objects which we thought again could be satellites moving right next to each other at the same exact speed.  Very interesting....",
      "link": "http://www.nuforc.org/webreports/090/S90728.html",
      "state": "OR",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd695",
      "summary": "I saw a hollow, cylinder shapped object the color of a bubble, or rainbow,  hovering and spinning above a bush.",
      "city": "detroit",
      "shape": "cylinder",
      "date": "2012-05-13T00:00:00",
      "story": "I saw a hollow, cylinder shapped object the color of a bubble, or rainbow,  hovering and spinning above a bush. Between noon and 2:00 p.m. on March 17, 2012, I went outside to get something from my son's car and noticed smoke that seemed to be streaming from a bush in the front yard on the East Side of the house that is directly across the street from my house.  There are two bushes in the front yard of the house.  One on the East side.  One on the West Side.  The entire yard is surrounded by a fence. The smoke traveled four to five feet from the bush to the rear of an SUV which is about eight feet from the fence that surrounds the house and the bush.  First I thought the bush was on fire but I didn't smell smoke, so I just felt some mischevous guys were hiding behind the bush smoking, or trying to break in the house. I walked across the street to the bush but no one was there, just smoke, with no smell, which was strange.  The bush was opened and the stems seemed old.  Because I had never seen them open like that in the fourteen years I lived here, which was also strange, I hurredly walked back to my house and stood on the steps and remained there because I was a little puzzled by all this. The smoke disappeared. Suddenly a lot of little flies or knats like the ones that gather in the middle of air appeared over the bush that the smoke seemed to be coming out the bottom.  Then a cylinder looking thing, not of this world appeared from no where on top of the bush and started spinning at a high rate of speed.  It was the color of a rainbow, translucent, with no top, or bottom (hollow inside).  It was the size of the middle of a wooden wine barrell. After the translucent, bubble like, bubble colored, rainbow colored cylinder hovered and spun over the bush about a minute or two, smoke started coming out of the center of the cylinder, seemingly from the middle of the bush. Strangely, the birds and pheasants eating grass seeds in the lot adjacent to the house appeared unscathed and did not fly away.  The bush did not burn, the smoke did not smell like smoke, or fire. Next, several of the little flies appeared on top of the bush on the West side of the house.  The cylinder started to sail to the bush on the West. The knats were still flying over the bush on the East where the cylinder was at first, but half of them seemed to be gone.  When the cylinder reached the bush on the West side of the house it hovered on top, still spinning at an out of this world speed.  Smoke came out of the middle of that bush which was not smoking at first, and did not burn.  It hovered there a couple minutes (the cylinder like thing).  Next the cylinder floated up, spinning all the time, to about the height of the light post in front of the house.  Smoke then flowed from the bush on the West, through the center of the cylinder.  In an instant, the bubble thing disappeared.  Next the smoke dissipated. My girlfriend called about this time.  I told her what I saw.  She asked if it was on my property.   I said no.  She asked if I looked down in the bushes.  I said no, and told her she should come over to look down in the bushes. I told her that I noticed several (about ten) thin, translucent lines, like spider webs, the same rainbow color of the bubble like cyliner, in front of my house.  The web like strings were in mid air and extended straight, from the West to the East in about 20 feet from the no parking sign by my house to nowhere. They were affected a little by the wind, but strangely, just floated straight across in a parallel line without falling.  The spider web things did not appear to be attached to the cylinder- bubble, but also, were not of anything I've ever seen on Earth, or could imagine.  They were the identical color.  I probably walked through them when I went across the street but the did not break, or fall. My girlfriend said run in the house, slam the door, and pull down the shades.  For some reason I was not scared but I did go in the house, close the door, and close the blinds. I peeked outside and saw the smoke again on the ground by the bushes but I had seen enough and do not know if anything else happened because about this time I began to feel a little leary and would not go, or look outside. Another strange thing happened.  The next day when my girlfriend came over to see.  She asked if I ever looked in the bushes.  I told her the bushes did not go anywhere for her to go look. Even though she wasn't going to look inside the bushes, the strangest thing happened.  When we looked across the street at the bushes, the bushes had closed all the way up, and were full, like they normally are.  The way they were opened when the cylinder appeared, it would be impossible for the bushes to close back to normal in one day, or a year. I told a couple other people and asked a couple farmers if fruit flies made these type of cylinders.    Then, I stopped becausethe people I told, and the farmers did not seem to believe I had seen something like that. However,I turned on the radio late one night.  Coast to Coast was on. The UFO man was a guest and left his number.  I called him and he said he didn't want to hear my story, I had to write it down. I didn't write it down because what I saw did not appear to be a UFO. Today I googled UFO and read some of the sightings.  One of them was identical to what I saw.  For this reason I have written this story.  Perhaps it can help others.",
      "link": "http://www.nuforc.org/webreports/088/S88414.html",
      "state": "MI",
      "duration": "10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3be0d2",
      "summary": "I saw a bright blinking white light cross the sky low enough for me to see that it was diamond shaped",
      "city": "detroit",
      "shape": "diamond",
      "date": "2012-07-04T00:00:00",
      "story": "I saw a bright blinking white light cross the sky low enough for me to see that it was diamond shaped I was thinking about the report that I just made, and waiting on my plate of barbecue to warm in the microwave, while I stood on the porch I saw a blinking light.  It was unusual since it blinked in an abnormal pattern. It was brightly blinking.  A it traveled across the sky I stepped off of my porch tp watch this object cross the sky in a due north western direction. As it got closer to me I noticed that it didn't look nothing like an airplane.  It was diamond shape.Airplanes usually have those red and blue lights flashing on them. This was a continuous white flashing light crossing the sky. I watched it for as long as I could and even walked over towards my neighbors house to keep it in sight. It was moving fast unlike the two objects I saw earlier. For as low as it was there was a slight sound to it that should've been louder like the airplane flying over me now. at 23:34 heading into the eastern direction. I can hear that plane loud and clear. But the objec! t in question I could barely even hear and it was lower than the one heading east. They didn't even blink the same. The object in question was very bright. It blinked rapidly with only white lights. I don;t know what it was, but it wasn't a normal airlines plane. And it wasn't no meteorite either. And if you say it was a weather balloon then I'm a monkey's uncle. That's how serious I am. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90141.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be0cf",
      "summary": "I saw a very faint light traveling northward and it disappeared and then another appeared traveling southwards in opposite direction",
      "city": "detroit",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "I saw a very faint light traveling northward and it disappeared and then another appeared traveling southwards in opposite direction To tell the truth there were two of them.  One was heading due north. I noticed it out of the side of my eye even though it was a extremely faint light. There were no blinkking lights on it. Neither one of them. ASn airplane flew just in front of the first one and lept goin heading east. The plane flew higher than most planes but it was still closer than this object.  Both objects to be exact. I watched this object for about 40 seconds and then lost track of it.  I scanned the sky and found another extremely faint light traveling due south off to the righ of where the original spotted light was. I don't wear glasses and I could still see this light even though it was very faint. That's why I knew that these two objects weren't traveling in our atmosphere. It was way fainter than the International Space Station would appear in the sky. Besides I don't think the ISS would travel in two opposite directions. The time was 10:35 p.m. Venus is much brighter than what ! they were. But these were white lights with no sound at all. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90137.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be131",
      "summary": "AMAZING DAY OVAL UFO",
      "city": "detroit",
      "shape": "oval",
      "date": "2012-07-04T00:00:00",
      "story": "AMAZING DAY OVAL UFO This is my third sighting. First one in the day time. I have an amazing HD image that can be zoomed in quite a bit and looks great....I also have several seconds of HD video.....It was moving qickly and rotating, I had seconds to act",
      "link": "http://www.nuforc.org/webreports/090/S90190.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be43e",
      "summary": "Bright orange object moving mid speed in sky then faded away",
      "city": "detroit",
      "shape": "unknown",
      "date": "2012-08-05T00:00:00",
      "story": "bright orange object moving mid speed in sky then faded away Look i kno wat a plane looks like at night n sounds like...this was no plane n had no sound..Bright orange sorta like a fireball moving mid speed west bound.funny thing is whrre i stay the planes pass over bout 10 mins b4 they land so yes theres always planes in the sky n there were 2 planes in the sky in route when i spotted this object so i kno the pilots had 2 see this... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91426.html",
      "state": "MI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be5a3",
      "summary": "I saw a pencil eraser sized light crossing the sky",
      "city": "detroit",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "I saw a pencil eraser sized light crossing the sky light heading due northwest bright yellowish white light with no blinking lights at 10:16 pm it was circular looking like a small moon about the size of a eraser on a pencil.   I saw this while watching a Rich Dad seminar online sitting on my porch.  It was almost dead ahead of my vision slightly off to the left of my sight.   It flew across the sky and I had to wait for a few seconds to clear away from the trees to see it again to only see it disappear behind some more trees.  This is no joke. It's what I saw though I have found that the meteor society would tell me that my sightings were mere planes or satellites.   never knew that you could see an actual satellite in space with your naked eye.  That part goes with my past report of the small barely visible lights in the sky. This however was just as bright as the moon only smaller.  My house faces east and I wartched it cross the sky heading north west ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90347.html",
      "state": "MI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be5c4",
      "summary": "3 craft hover over metro detroit from 9:45 pm 11:45pm and longer.  ((NUFORC Note:  Possible star?  PD))",
      "city": "detroit",
      "shape": "circle",
      "date": "2012-05-29T00:00:00",
      "story": "3 craft hover over metro detroit from 9:45 pm 11:45pm and longer. White,red,green, lights.  Hovering over north west area. Ground in shape.",
      "link": "http://www.nuforc.org/webreports/089/S89096.html",
      "state": "MI",
      "duration": "4 hr"
    },
    {
      "_id": "64d005f478aba2ec5a3be805",
      "summary": "Ufo's over Detroit, Dearborn western area.",
      "city": "detroit",
      "shape": "oval",
      "date": "2012-05-29T00:00:00",
      "story": "Ufo's over Detroit, Dearborn western area. On 5/23/2012 wed at 9:30pm the wife and i sat outside on the front porch facing west we saw for a second time a craft hovering in the tree line the same as sunday evening. A half hour later two more appeared one south of the first and one north of the first. We are located in Detroit's Warrendale area. The forth was east over pass our house. They are round looking flashing white,green,red lights. The white stayed on longer. I called my freind in Romulus he said he saw them also looking North of Van Born rd. Our daughter came and watch then we saw a big one flying south it had white lights all around flashing around the whole craft going South West towards metro airport over Dearborn. This was not a jet liner or any man made craft. Please note each time during the sighting dogs were braking in the area. And the crafts make no noise at all. I have stayed near metro airport since 1969 I know jets and helicopters during the day and at night. The other 3 stayed stationary as if they are surveying or surveillance almost in a triangle in the night sky. The first one in the trees it like had a bounce up and down movement and went North towards Farmington or Southfield area and fade away. We went in at 12:00 midnight",
      "link": "http://www.nuforc.org/webreports/089/S89180.html",
      "state": "MI",
      "duration": "3 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3be8f7",
      "summary": "Response to SHGbo+14a. Logansport, IN",
      "city": "detroit",
      "shape": "other",
      "date": "2012-04-18T00:00:00",
      "story": "Response to SHGbo+14a. Logansport, IN This is a copied article, posted as requested. These articles cover rare information on SETI signal SHGb02+14a  [Article 1] Mysterious signals from light years away  19:00 01 September 2004 by Eugenie Samuel Reich  In February 2003, astronomers involved in the search for extraterrestrial intelligence (SETI) pointed the massive radio telescope in Arecibo, Puerto Rico, at around 200 sections of the sky. The same telescope had previously detected unexplained radio signals at least twice from each of these regions, and the astronomers were trying to reconfirm the findings. The team has now finished analysing the data, and all the signals seem to have disappeared. Except one, which has got stronger. This radio signal, now seen on three separate occasions, is an enigma. It could be generated by a previously unknown astronomical phenomenon. Or it could be something much more mundane, maybe an artefact of the telescope itself. But it also happens to be the best candidate yet for a contact by intelligent aliens in the nearly six-year history of the SETI@home project, which uses programs running as screensavers on millions of personal computers worldwide to sift through signals picked up by the Arecibo telescope. Absorb and emit  \"It's the most interesting signal from SETI@home,\" says Dan Werthimer, a radio astronomer at the University of California, Berkeley (UCB) and the chief scientist for SETI@home. \"We're not jumping up and down, but we are continuing to observe it.\"  Named SHGb02+14a, the signal has a frequency of about 1420 megahertz. This happens to be one of the main frequencies at which hydrogen, the most common element in the universe, readily absorbs and emits energy. Some astronomers have argued that extraterrestrials trying to advertise their presence would be likely to transmit at this frequency, and SETI researchers conventionally scan this part of the radio spectrum. SHGb02+14a seems to be coming from a point between the constellations Pisces and Aries, where there is no obvious star or planetary system within 1000 light years. And the transmission is very weak. \"We are looking for something that screams out &#145;artificial',\" says UCB researcher Eric Korpela, who completed the analysis of the signal in April. \"This just doesn't do that, but it could be because it is distant.\" Unknown signature  The telescope has only observed the signal for about a minute in total, which is not long enough for astronomers to analyse it thoroughly. But, Korpela thinks it unlikely SHGb02+14a is the result of any obvious radio interference or noise, and it does not bear the signature of any known astronomical object. That does not mean that only aliens could have produced it. \"It may be a natural phenomenon of a previously undreamed-of kind like I stumbled over,\" says Jocelyn Bell Burnell of the University of Bath, UK. It was Bell Burnell who in 1967 noticed a pulsed radio signal which the research team at the time thought was from extraterrestrials but which turned out to be the first ever sighting of a pulsar. There are other oddities. For instance, the signal's frequency is drifting by between eight to 37 hertz per second. \"The signal is moving rapidly in frequency and you would expect that to happen if you are looking at a transmitter on a planet that's rotating very rapidly and where the civilisation is not correcting the transmission for the motion of the planet,\" Korpela says. This does not, however, convince Paul Horowitz, a Harvard University astronomer who looks for alien signals using optical telescopes. He points out that the SETI@home software corrects for any drift in frequency. Fishy and puzzling  The fact that the signal continues to drift after this correction is \"fishy\", he says. \"If [the aliens] are so smart, they'll adjust their signal for their planet's motion.\"  The relatively rapid drift of the signal is also puzzling for other reasons. A planet would have to be rotating nearly 40 times faster than Earth to have produced the observed drift; a transmitter on Earth would produce a signal with a drift of about 1.5 hertz per second. What is more, if telescopes are observing a signal that is drifting in frequency, then each time they look for it they should most likely encounter it at a slightly different frequency. But in the case of SHGb02+14a, every observation has first been made at 1420 megahertz, before it starts drifting. \"It just boggles my mind,\" Korpela says. The signal could be an artefact that, for some reason, always appears to be coming from the same point in the sky. The Arecibo telescope has a fixed dish reflector and scans the skies by changing the position of its receiver relative to the dish. When the receiver reaches a certain position, it might just be able to reflect waves from the ground onto the dish and then back to itself, making it seem as if the signal was coming from space.  \"Perhaps there is an object on the ground near the telescope emitting at about this frequency,\" Korpela says. This could be confirmed by using a different telescope to listen for SHGb02+14a. Possible fraud  There is also the possibility of fraud by someone hacking the SETI@home software to make it return evidence for an extraterrestrial transmission. However, SHGb02+14a was seen on two different occasions by different SETI@home users, and those calculations were confirmed by others.  Then the signal was seen a third time by the SETI@home researchers. The unusual characteristics of the signal also make it unlikely that someone is playing a prank, Korpela says. \"As I can't think of any way to make a signal like this, I can't think of any way to fake it.\"  David Anderson, director of SETI@home, remains sceptical but curious about the signal. \"It's unlikely to be real but we will definitely be re-observing it.\" Bell Burnell agrees that it is worth persisting with. \"If they can see it four, five or six times it really begins to get exciting,\" she says.  It is already exciting for IT engineers Oliver Voelker of Logpoint in Nuremberg, Germany and Nate Collins of Farin and Associates in Madison, Wisconsin, who found the signal.  Collins wonders how his bosses will react to company computers finding aliens. \"I might have to explain a little further about just how much I was using [the computers],\" he says.  Ref: http://www.newscientist.com/article/dn6341-mysterious-signals-from-light-years-away.html?full=true   [Article 2]  Radio source SHGb02+14a  Radio source SHGb02+14a is a source and a candidate in the Search for Extra-Terrestrial Intelligence (SETI), discovered on March 2003 by SETI@home and announced in New Scientist on September 1, 2004.[1]  The source was observed three times at a frequency of about 1420 MHz,[2] which is expected to be a frequency used by extraterrestrials due to its proximity to one of the main frequencies at which hydrogen absorbs and radiates photons.  There are a number of puzzling features of this candidate, which have led to a large amount of skepticism. The source is located between the constellations Pisces and Aries, a direction in which no stars are observed within 1000 light years. It is also a very weak signal. The frequency of the signal has a rapid drift, which would correspond to it being emitted from a planet orbiting nearly 40 times faster than the Earth around the sun. However, each time the signal was detected, it was again at about 1420 MHz, the original frequency before any drift.  There are also a number of potential explanations for this signal. SETI@home has denied media reports of likely extraterrestrial signal.[3][4] It could be an artifact of random chance, cosmic noise or possibly just a glitch in the technology.  Ref: http://www.multilingualarchive.com/ma/enwiki/en/Radio_source_SHGb02%252B14a",
      "link": "http://www.nuforc.org/webreports/088/S88224.html",
      "state": "MI",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3c0461",
      "summary": "Spherical type craft seen over Detroit river between the cities of Detroit and Windsor, disappears into small black rain cloud.",
      "city": "detroit",
      "shape": "sphere",
      "date": "2013-02-28T00:00:00",
      "story": "Spherical type craft seen over Detroit river between the cities of Detroit and Windsor, disappears into small black rain cloud. This event took place in the fall of 2006.  I’m not sure the day or the exact month, it was either September or November.  The time was around 11:00-12:00 noon.  I was at work in Detroit.  My office was at the Renaissance building, with my desk having a window view facing the city of Windsor, over looking the Detroit River. While I was busy talking on the phone, I noticed a small, bright light that was traveling up the river that had just passed the Ambassador Bridge that connects the USA with Canada.  At first I thought it was a small airplane or something similar, until it was close enough to notice it was a round shaped sphere.  It had a very highly polished metal that was reflecting the Sun and giving the appearance of a lighted craft.   My co-worker and I both looked taken back, as this machine was bopping up and down in the air over the river, about 20 feet or more above the surface.  It was about 10 feet in diameter or so it appeared. It made no noise, as all craft that travel on the river or anywhere in our tower can hear just about all noises from vehicles, aircraft, watercraft, etc.  The building is not very good for keeping sounds out. This machine was solid looking all over, no visible portals or attachments.  It had a round, small black little ball that traveled around the object about every second that was not attached.  The sphere turned in front of the Renaissance building and headed toward the Canadian side of the river.  Went up and over the Windsor hotel, still not high in the air, about 20 feet or so.  Weaving, bobbing ever so slightly, not traveling as though it was in a hurry, but rather seemed to be checking things out is what it felt like to us.  It climbed up and went up into a small black rain cloud.  The black rain cloud looked odd to us for some reason.  Also, it was the only cloud visible on a clear blue day.  I could see jets taking off in the background at the Windsor airport.  My co-worker and I watched the rain cloud for a long time, at least 5-10 minutes, until the cloud dissipated.  The machine never came out or went through the cloud to the other side.  I inquired with people in the building ! who would have had a good chance of hearing or seeing anything that goes on in the area.  As far as I know, we were the only people to see it, but I find it rather hard to believe, as this was broad daylight during lunchtime in downtown Detroit. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96429.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0801",
      "summary": "Orange glowing light.",
      "city": "detroit",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "Orange glowing light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107785.html",
      "state": "MI",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0af3",
      "summary": "Triangle shape object with flashings lights",
      "city": "detroit",
      "shape": "rectangle",
      "date": "2014-02-07T00:00:00",
      "story": "triangle shape object with flashings lights After seeing this we never discussed or mentioned anything about again it until maybe a few years ago.  I was around 15 or16 years old at the time and me, my sister, and a few friends were sitting on my porch, joking playing like normal teens.  Suddenly all the street lights went out, and this strange triangle shaped object with different colored lights appeared over the vacant lot across the street from my house, with lights flashing around it.   It just sat for about 30 seconds to a minute, then just shot away like a bolt of lighting.",
      "link": "http://www.nuforc.org/webreports/106/S106964.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c15b3",
      "summary": "UFL (LIGHTS) -ORANGE AND OR BLUE LIGHTS FLASHING IN THE CLOUDS FOLLOWING THIS EVENING STORM.",
      "city": "detroit",
      "shape": "light",
      "date": "2013-11-20T00:00:00",
      "story": "UFL (LIGHTS) -ORANGE AND OR BLUE LIGHTS FLASHING IN THE CLOUDS FOLLOWING THIS EVENING STORM. The colors orange or blue were flashing in random clouds, following the storm.  Each cloud flashed for the duration of 2 to 3 seconds in 30 second intervals, as it passed over.  UFL (Lights)",
      "link": "http://www.nuforc.org/webreports/104/S104551.html",
      "state": "MI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a19",
      "summary": "Saw something moving across the sky, like a red glow, but yellow at the same time my girl friend thought maybe it was a small plane.",
      "city": "detroit",
      "shape": "sphere",
      "date": "2014-07-11T00:00:00",
      "story": "Saw something moving across the sky it was like a red glow but yellow at the same time my girl friend thought maybe it was a small plane but it had no sound.",
      "link": "http://www.nuforc.org/webreports/111/S111267.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1af4",
      "summary": "White Light Moving East/West Over Detroit Faded away Than Re Appears Minutes Later",
      "city": "detroit",
      "shape": "light",
      "date": "2014-07-04T00:00:00",
      "story": "White Light Moving East/West Over Detroit Faded away Than Re Appears Minutes Later Standing Outside Looking North Towards The Big Dipper All Of A Sudden Bright White Light Illuminated The Sky traveled West To East All Of A Sudden it Stopped Than Faded Away To Nothing.  About 5 minutes Later It Lit Up Again in the same spot it had stopped Light up The Sky Than Faded Away Again.",
      "link": "http://www.nuforc.org/webreports/110/S110738.html",
      "state": "MI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1cb1",
      "summary": "There is a possibility that its a ufo.",
      "city": "detroit",
      "shape": "circle",
      "date": "2014-06-20T00:00:00",
      "story": "there is a possibility that its a ufo I was at work i went in at 11:30pm I got my first break at 1:00am so i went outside to have a smoke i look up an see a beautiful full moon so i take out my phone and start to take pictures all i see is the moon but when i look at the pictures i get a green light next to the moon so i take four more pictures and i get the same green light but at different locations of the moon at that time its time for me to go back to work than when i get in i show some friends and my brother he works with me too thay said thats crazy so i take my lunch break at three and decided that i would take more pictures at that time my brother and friends look up and see the moon but nothing so i take pictures i took about six more and it's still out there but at different locations so i had my brother take pictures with his phone and got the same green lights everyone was seriously swept i zoomed in on the pictures the lights were green and red then went back to work everyone was ser! iously swept so i get one more break at 5:00am the moon still out i take more pictures and this time it's a red light  i can't understand what it was or what it is but it doesn't belong here i have good pictures but can't tell what it is can you help me",
      "link": "http://www.nuforc.org/webreports/110/S110299.html",
      "state": "MI",
      "duration": "1300"
    },
    {
      "_id": "64d005f478aba2ec5a3c219a",
      "summary": "Fire balls in detroit sky.",
      "city": "detroit",
      "shape": "fireball",
      "date": "2014-05-08T00:00:00",
      "story": "Fire balls in detroit sky. I witnessed three fire balls flying in the sky and has they passed by fire also drop off of them then in formation the flu across the sky and disappeared.",
      "link": "http://www.nuforc.org/webreports/109/S109243.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c23d4",
      "summary": "Five ufos close together.",
      "city": "detroit",
      "shape": "formation",
      "date": "2014-03-27T00:00:00",
      "story": "Five ufos close together. Seen five ufos in the sky gray and silver not good at this better at telling u what I saw. ((NUFORC Note:  We have invited the witness to have a friend or family member write down the facts, and submit a more detailed report.  PD)) ((ADDENDUM FROM WITNESS))  Five gray and silver ufos flying a pattern  they made left angle trun straight up like they were playing a game they looked like some what like Kenneth guy from the fortys but the bottom was like a point  the  size was about 70 feet  never seen anything like this before  but they  were so close cant see how they never touch I mean  it was incredible  I hope this helps anybody  that might have seen this  ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/108/S108068.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c26a4",
      "summary": "I was driving home down livernois ave going north, as I crossed west 6 mile I saw about three red lights hovering low in the sky betwee",
      "city": "detroit",
      "shape": "fireball",
      "date": "2014-12-05T00:00:00",
      "story": "I was driving home down livernois ave going north, as I crossed west 6 mile I saw about three red lights hovering low in the sky between 7 and 7:45 pm on 11\\22\\14 as I came closer Curtis Ave it was about 6 red lights in pyramid formation in a matter of seconds I noticed there were more of these objects appearing their were about 15 to 20 of the same objects in all.  A friend of mine was following me, so I pulled over and asked her what is that, her and her passenger looked and said what the hell is that,   I then looked around to see if anyone else had witnessed what we was seeing, people in the barbershop was looking, people that was coming out the grocery store was looking and some traffic had stopped and was looking,   I turned back and looked at the objects and called my wife on her cell phone but I kept going to voicemail so I called my daughter and ask where was her mother and to go get her and look out the back window and look at all these UFOs in the sky, she woke up my wife and told her, all I can hear was my wife saying oh s***, what is going on an invasion, now all 15 or 20 of them were in a pyramid formation, I noticed that the last two on the left was coming down and stopped and went back up, they then lined up in a straight line never making a sound, they was changing colors red,orange, yellow and getting brighter they hovered a little more and then slowly moving towards northeast very slow still not making a sound I then started driving home but still looking at them, when I pulled in my driveway and could still see the last two of them and I noticed the last one was getting so bright it looked like it had a ring around the bottom that really kept getting brighter like it was drawing energy from something, it looked like a donut shape or Saturn ring, I went in the house and talked to my wife and daughter and said I'm about to follow them but when I went back outside I didn't see them anymore,I drove in the direction that they were going still didn't see them, and then rain just started pouring down instantly, I drove back home and called fox 2 news to report the objects and the news said that they had several calls about that and was waiting on video footage",
      "link": "http://www.nuforc.org/webreports/115/S115679.html",
      "state": "MI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c272f",
      "summary": "Extremely loud noise over Detroit area",
      "city": "detroit",
      "shape": "unknown",
      "date": "2014-10-10T00:00:00",
      "story": "Extremely loud noise over Detroit area At 6 mile and telegraph. At approx 11:55 tonight, myself and another witness heard an extremely loud roar pass over the area.  I was sitting under an open window, and this clearly came from the sky.  We are in a direct path for Detroit Metroit Airport.  At first, i thought it was a jet coming in.  But the rate of which the sound approached and dissipated was far too fast for a commercial jet.  Not to mention so loud, it would have been at a much lower altitude. Ive witnessed large meteorites witnessed over multiple states. I've also witnessed jets breaking the sound barrier.  This did not sound like that at all.  No impact, shockwave or sonic boom was heard.  The third witness, approximately 1.5 miles west, and outside during this event, heard it, but did not notice any lights either. Strangely, this past winter, we heard what sounded like pulse jets on occasion.  Usually at night, once during the day.  Think Nazi V1 buzz bombs. Internet searches yielded no results pertaining to aircraft making such noises in cold dense air.  Somethings definitely going on over Southeast Michigan the passed few months.",
      "link": "http://www.nuforc.org/webreports/114/S114189.html",
      "state": "MI",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c29cc",
      "summary": "Large green fireball descends from sky above Detroit silently…",
      "city": "detroit",
      "shape": "fireball",
      "date": "2014-11-21T00:00:00",
      "story": "Large green fireball descends from sky above Detroit silently… Me and my freind saw a large green fireball decend from the sky above detroit.   It was much larger than any meteorite I have ever seen.   Scared the hell out of me, this thing fell right into the city from what we could see..   Never seen anything lime it before..",
      "link": "http://www.nuforc.org/webreports/115/S115444.html",
      "state": "MI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c29e1",
      "summary": "((NUFORC Note:  Witness provides no information about the event.  PD))",
      "city": "detroit",
      "shape": "fireball",
      "date": "2014-11-26T00:00:00",
      "story": "((NUFORC Note:  Witness provides no information about the event.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115549.html",
      "state": "MI",
      "duration": "Livernois"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bcf",
      "summary": "Lights blinking alternating sequences red and green. Lights changed direction several times east, west north and south then departed ea",
      "city": "detroit",
      "shape": "light",
      "date": "2014-10-10T00:00:00",
      "story": "Lights blinking alternating sequences red and green.   Lights changed direction several times east, west north and south then departed eastward after maintaining the same position for approx 10 min.",
      "link": "http://www.nuforc.org/webreports/114/S114351.html",
      "state": "MI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c307c",
      "summary": "I'm in an empty lot near 96 & joy road in Detroit michigan. Looking up at the sky I've saw 3 lights clearly as bright as planes flying.",
      "city": "detroit",
      "shape": "light",
      "date": "2014-08-22T00:00:00",
      "story": "I'm in an empty lot near 96 & joy road in Detroit, Michigan.  Looking up at the sky, I've saw 3 lights clearly as bright as planes flying in the sky.   Lighting fast going up down left right and crossing paths.  This has been happening for 20 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112692.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c35dc",
      "summary": "5 objects changing colors then turning into giant glowing orange orbs.",
      "city": "detroit",
      "shape": "disk",
      "date": "2015-02-12T00:00:00",
      "story": "5 objects changing colors then turning into giant glowing orange orbs. The objects had small multi color lights, also with one center light that was white then would get bright and orange as the sun when lit up looked like mini sun in the night sky incredibly bright they moved in patterns.  Also moving at speeds impossible of anything known we could fly",
      "link": "http://www.nuforc.org/webreports/117/S117212.html",
      "state": "MI",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d43",
      "summary": "Single red orange ball over Detroit.",
      "city": "detroit",
      "shape": "fireball",
      "date": "2015-07-23T00:00:00",
      "story": "Single red orange ball over Detroit. Looking south towards downtown Detroit and the river that divides Detroit from Windsor in Canada (standing about a mile and a half from downtown and the river), I saw a single fire colored roundish object between me and the river.  It first appeared to be still, but then I may have been adjusting to 'this is not a small plane, where are its lights?'  Maybe it was moving, but slowly.  In general it was moving east parallel to the river.  It might have made a 'adjustments' in its movement a couple times.  Slight right turns toward the river.  Its movement was not always steady or at the same (slow) speed.  Clear night with some wispy white clouds.  After watching it just a few minutes it disappeared into a cloud.  Don't know how long it had been there before I came out at 10:20. Its height or size was that of a small plane flying at the top altitude allowed by small planes over a city.  Not the lower altitude at which a plane flying over a baseball game might be.  A neighbor was able to see it without their glasses. I searched this description, and found a lot of images matching what I saw.  The colors of fire.  Not a single spectrum red or orange light.  There was nothing else in the sky.  Quiet.  No planes, large or small, or helicopters.",
      "link": "http://www.nuforc.org/webreports/120/S120551.html",
      "state": "MI",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4338",
      "summary": "Two large, round, bright white lights above Detroit then suddenly disappear.",
      "city": "detroit",
      "shape": "formation",
      "date": "2015-11-19T00:00:00",
      "story": "Two large, round, bright white lights above Detroit then suddenly disappear. Two large, round bright white lights in the sky above Detroit.  Looked hazy around the lights which give me the impression that it was in clouds.   I didn't give the lights much notice at first but when I realized they didn't move or fade away it caught my attention.   I began watching them while driving east on I-96.   After I noticed them they disappeared about 30 seconds later.  ' They also had some very small lights around these two giant round lights. ((NUFORC Note:  Witness provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123897.html",
      "state": "MI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4337",
      "summary": "Two large, round, bright white lights above Detroit then suddenly disappear.",
      "city": "detroit",
      "shape": "formation",
      "date": "2015-11-19T00:00:00",
      "story": "Two large, round, bright white lights above Detroit then suddenly disappear. Two large, round bright white lights in the sky above Detroit.  Looked hazy around the lights which give me the impression that it was in clouds.   I didn't give the lights much notice at first but when I realized they didn't move or fade away it caught my attention.  I began watching them while driving east on I-96.   After I noticed them they disappeared about 30 seconds later.  They also had some very small lights around these two giant round lights. ((NUFORC Note:  Witness elects to remain anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123895.html",
      "state": "MI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4586",
      "summary": "Not the first time i saw it it comes around when theres not alot of people outside",
      "city": "detroit",
      "shape": "flash",
      "date": "2015-11-26T00:00:00",
      "story": "Not the first time i saw it it comes around when theres not alot of people outside I was standing at the bus stop across the street from my house with my girlfriend when these lights started flashing red, blue and green out of the sky it litterly light up the whole sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We have changed the time, to reflect a nighttime sighting.  We are unable to confirm the time.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124271.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ca9",
      "summary": "A whitish orb.  It had other colors coming and going out of focus but w/ a constant white glow.  ((NUFORC Note:  Star?  PD))",
      "city": "detroit",
      "shape": "",
      "date": "2016-11-11T00:00:00",
      "story": "A whitish orb giving in the vicinity of Redford, MI, it had other colors coming and going out of focus but had a constant white glow I watched it for 2 to 3 hours with witnesses.",
      "link": "http://www.nuforc.org/webreports/131/S131123.html",
      "state": "MI",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cd8",
      "summary": "Bright light across the sky of Detroit in day light.  ((anonymous report))",
      "city": "detroit",
      "shape": "sphere",
      "date": "2016-12-05T00:00:00",
      "story": "Bright light across the sky of Detroit in day light. ((NUFORC Note:  No time for the sighting is indicated by the source, who elects to remain totally anonymous, and who provides no contact information.  We have assigned an arbitrary time.  Hoax??  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131567.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c64ad",
      "summary": "Orange orb UFO's transform and possibly land on Detroit's westside",
      "city": "detroit",
      "shape": "circle",
      "date": "2016-08-16T00:00:00",
      "story": "Orange orb UFO's transform and possibly land on Detroit's westside I don’t know how to put this into words;  I am a great wordsmith, I just feel so much emotion at this time.  Last night (08/09/2016) I lay in my bed watching Netflix as my fiancee goes to open the front door for his friend.   After a short while, they both call my name, screaming.  The way that they were yelling made me think my cat had run into the street and got hit or something.  I jumped up and ran outside, only to find that his friend saw orange orbs in the sky.  At first, I was calm, and I replied, “Oh, I see these all the time I told you ufo are real... I see them all the time.”  His friend thought my statement to be strange; she suggested we go inside but at first, I wasn’t afraid because I see them all the time.  She was so frightened that she left.  My fiancee decided that we needed to record this, so he went inside to look for my real camera.  Now I will describe what we saw. On Bryden St., between Joy Rd and Livernois, we spotted 12 orange orbs popping up in threes to the left of the sky just over Dearborn, Michigan, Warren Ave, and Wyoming area if you were facing west like we were.  The orbs appear from nowhere low in the sky and slowly floated up over the clouds.  Once they got high over the clouds, they changed to match the clouds they became the same color and even made themselves appear the same texture as the clouds, however, they had become disc shaped.  Once in this form, they floated across the sky towards us which was north to joy from Dearborn.  They appeared to glide across the sky, and they were silent.  Once directly over my hear I could see two dark gray circles on the bottom of the craft spinning.  Once they got just across Joy Rd almost to Chicago on Central, they began to lower they turned dark grayish black and dropped down from the sky to the ground. At that point, I was crying and panicking because I never saw them do that before, and they seemed to be trying to be invisible, and I was terrified, so I ran into the house crying.  I called my best friend the only person who would believe such a crazy story, and she doesn't believe in ufo, but she believes in me… she calmed me down and told me to pack an emergency bag just in case.  Last night I could barely sleep I was so scared.  I woke up today trying to tell myself it wasn't real.  I have no one to turn to, and life feels very different to me now.  I don't know what to think or how to feel or how to function without feeling like I'm going insane.  I hope that rant made sense.",
      "link": "http://www.nuforc.org/webreports/129/S129140.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6486",
      "summary": "((HOAX??))  Moving in a single line,moving in one direction.  ((anonymous report))",
      "city": "detroit",
      "shape": "formation",
      "date": "2016-08-29T00:00:00",
      "story": "Moving in a single line,moving in one direction They came over some trees'moving with the cliuds'it was about 10 of them'my daughter seen more of them.  They were bright orange 'and all moving in a single line. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129530.html",
      "state": "MI",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c681f",
      "summary": "Just turn into a big flash and the power had went out in the house and about 30 secs later it just came back on.((anonymous report))",
      "city": "detroit",
      "shape": "flash",
      "date": "2017-03-23T00:00:00",
      "story": "It was about midnight me and a couple of friends had been eating at my dinner table and i just decided to look outside.  Once i did every thing just turn into a big flash and the power had went out in the house and about 30 secs later it just came back on.  It was like a giant thing just hovering there just as if it was camouflaged in the sky.  Then it was gone just like that like light fast like gone no where to be seen I was shocked so i just looked up ufo sighting this is where it brung me.. PS:  Just saying if there is another life out there the human life will not exist much more. Some one think about that like i did please.... ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133212.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a40",
      "summary": "((HOAX??))  Black triangle that has color change led look lights that formed triquetra in the middle very big  ((anonymous report))",
      "city": "detroit",
      "shape": "triangle",
      "date": "2017-02-17T00:00:00",
      "story": "Black triangle that has color change led look lights that formed triquetra in the middle very big but very high in the sky ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132613.html",
      "state": "MI",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ec9",
      "summary": "Diamond shaped, silver, long. Wayne county, Michigan.",
      "city": "detroit",
      "shape": "diamond",
      "date": "2017-09-05T00:00:00",
      "story": "Diamond shaped, silver, long. Wayne county, Michigan. The object was silver, very bright and was hovering about 20-30 feet in the air in a clear blue sky.  Only one witness.",
      "link": "http://www.nuforc.org/webreports/135/S135994.html",
      "state": "MI",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cd1",
      "summary": "Orange flickering light that faded over northwest Detroit around 10:30pm, Sept 11, 2017",
      "city": "detroit",
      "shape": "sphere",
      "date": "2017-09-21T00:00:00",
      "story": "Orange flickering light that faded over northwest Detroit around 10:30pm, Sept 11, 2017 At approx 10:30pm EST, on Sept. 11, 2017, my father and I witnessed an orange, flickering light.  It appeared to be at an extremely high altitude (if even in the atmosphere).  Its size resembled that of a star in the sky.  It displayed inconsistent flickering, which slowly faded out after approx. 1.5 to 2 minutes.  Object moved in a consistent path/line from southeast to northwest, at a constant, slow speed.  There was no trail/tail either.  The object did not emit any sound. As a side note, according to aerospace.org, there were no reentries since September 3rd, with the next being September 15th.",
      "link": "http://www.nuforc.org/webreports/136/S136167.html",
      "state": "MI",
      "duration": "1.5-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fe4",
      "summary": "(Mid-1983) In my backyard on clear, warm afternoon day on East-side of Detroit with 2 friends, looking up we spotted an oval shaped UFO",
      "city": "detroit",
      "shape": "oval",
      "date": "2018-04-05T00:00:00",
      "story": "(Mid-1983) In my backyard on clear, warm afternoon day on East-side of Detroit with 2 friends, looking up we spotted an oval shaped UFO with bright, solid light hovering for 5 minutes without sound.  At that point 6 or 7 smaller bright-light objects came out of the larger ship and circled the craft.  Appeared to be circling 100 yards or so from the larger craft.  Lasting approximately 10 minutes, the objects then returned one-by-one inside the main craft.  One minute later the craft accelerated so quickly it disappeared within seconds, again no sound whatsoever.  We couldn't believe what we saw. Being only 14-15 years of age we called the Detroit police who quickly dismissed us. Plane, Blimp, Weather Balloon, Helicopter?  Absolutely not.  We never read anything about the sighting in the paper or saw any TV news reports.",
      "link": "http://www.nuforc.org/webreports/139/S139351.html",
      "state": "MI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8119",
      "summary": "Oval object with depth stationary, viewed from plane.",
      "city": "detroit",
      "shape": "oval",
      "date": "2018-03-02T00:00:00",
      "story": "Oval object with depth stationary, viewed from plane I'm an engineer, I was on a plane flying to Detroit.  I was looking North at a break in the clouds.  I could see green farmland below through the clouds, the clouds were thicker on the East & West sides as the break in the clouds gave me the ability to see the ground below.  The plane was approximately 25,000 feet up.  I would not have noticed anything if the object didn't move at this very moment, it was stationary right next to the West cloud, then it moved forward some, then to the right then forward again to then hide in the East side cloud edge.  I couldn't believe my eyes.  The object was oval but it had depth and the top surface was pure white.  This oval was the shape of a track & field track, so parallel in the middle with rounded ends.  But the top surface was perfectly flat, and pure white. I would not have seen it, if it didn't move.  The sides were a grey/white color,  I could see very thin vertical black striations.  The object was rigid, the top white surface came to a very obvious edge, then 90 degrees straight down.  The vertical drop was what appeared to be about half what the short length width was.  The object had no obvious propulsion mechanism, no observable heat waves, no radiations, no light emmissions that I could see.  It did not tilt to move forward, did not tilt to the side, then did not change its orientation to move forward again.  It just moved, I believe  I would have missed it if it didn't move at all.  From my eyes it was approximately an ! inch to 1.5 inches in length.  Length is the rounded ends to each other, width then was the parallel sides to each other, depth was the white edge to the bottom of the grey striations.  The bottom also came to a very rigid end. This object definitely appeared to be hiding in the clouds.  No windows, no radar apparatus, no spinning anything, no external attachments. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138929.html",
      "state": "MI",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c83a8",
      "summary": "About 7 strange red lights seen over Detroit.",
      "city": "detroit",
      "shape": "light",
      "date": "2018-09-27T00:00:00",
      "story": "About 7 strange red lights seen over Detroit. 09/16/2018 18:00 Eastern Time about 7 small reddish orange lights appeared in the sky over Detroit.  They were seen for a little under two minutes.  They appeared and flew on.  What was that? ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143141.html",
      "state": "MI",
      "duration": "2 about"
    },
    {
      "_id": "64d005f478aba2ec5a3c849a",
      "summary": "A large orange fireball and I could see inside of ball a metallic ship with a wingspan pointing upward.",
      "city": "detroit",
      "shape": "fireball",
      "date": "2018-08-10T00:00:00",
      "story": "On 6/30/18 @ 11:27 p.m i was on front porch of my home watching neighbor's fireworks when i saw a faint object in the southwestern sky and it was coming in a downward trajectory right at me and increased in size.  A large orange fireball and I could see inside of ball a metallic ship with a wingspan pointing upward.  It made no sound at all.   I screamed and my eyes poured water from fear of what i saw.  The orange ball was so bright it reflected light off the clouds.  Fireball was translucent.  I hung the phone up and ran to take pictures.  I obtained 2 photos of rear of ship.  By then it disappeared in the northeastern sky.  I have not been the same since incident.  Everytime I think of or repeat story I breakdown weeping.  I was up close to this event.  My life will never be the same.",
      "link": "http://www.nuforc.org/webreports/142/S142493.html",
      "state": "MI",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c84a1",
      "summary": "A silver elongated metal-looking oval way up in the sky.",
      "city": "detroit",
      "shape": "oval",
      "date": "2018-09-27T00:00:00",
      "story": "A silver elongated metal-looking oval way up in the sky. Strange oval object in the sky, September 22, 2018 over Detroit, MI. I made a turn on a street in Grosse Pointe bordering the city limits of Detroit.  As I turn right, I see the beautiful sky with pink clouds on my left.  I snapped a picture of the clouds and didn’t think more of it. I looked at the picture again a day later and saw a strange oval object through an opening of the clouds.  If it was closer to the ground, I would guess the Goodyear Blimp. But I’ve seen blimps flying before and this is too high for them to fly.  It also doesn’t look like an airplane with the vapor trails.  I’ve just never seen this before.  It’s like a silver metal elongated “bullet” way up in the sky.",
      "link": "http://www.nuforc.org/webreports/143/S143252.html",
      "state": "MI",
      "duration": "a few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c855e",
      "summary": "As a security officer on the rooftop of a party club Exodus downtown Detroit we witnessed a strange light after the storm has passed we",
      "city": "detroit",
      "shape": "oval",
      "date": "2018-09-13T00:00:00",
      "story": "as a security officer on the rooftop of a party club Exodus downtown Detroit we witnessed a strange light after the storm has passed we continue to watch it as it moved in several different directions and then move swiftly over the top of Greektown Casino where we video the entire event",
      "link": "http://www.nuforc.org/webreports/143/S143064.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c868e",
      "summary": "Huge “V” shape of  approximately 30-40 lights.",
      "city": "detroit",
      "shape": "triangle",
      "date": "2018-08-10T00:00:00",
      "story": "Huge “V” shape of  approximately 30-40 lights. “V” of about 30 lights going south....stars in center of V looked distorted when craft moving ... HUGE whatever it was then it disappeared in an instant.  ?????  Didn’t keep getting smaller and smaller like birds or planes do.",
      "link": "http://www.nuforc.org/webreports/142/S142532.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c891a",
      "summary": "Square object with monitor like face flashing gylph like images while hovering over the Detroit River.",
      "city": "detroit",
      "shape": "other",
      "date": "2019-03-14T00:00:00",
      "story": "Square object with monitor like face flashing gylph like images while hovering over the Detroit River. I take pictures on my lunch break at the Detroit River with my phone.  I'm usually at Hart Plaza which sits on the river front directly across from Windsor, Canada.  Back then I took burst shots.  Didn't notice until later that day that I had captured a square like object floating above the river on the Canadian side.  It flashed different colors and glyphs on a split screen like monitor on its face.It had weird protusions around the sides of it.  I have recovered video of it which is not as sharp as the original and close ups.  If I remember right, google photos turned the burst images into a video. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145077.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d55",
      "summary": "We witnessed 3 bright objects flying in a circular pattern which at first we thought were birds.  ((anonymous report))",
      "city": "detroit",
      "shape": "flash",
      "date": "2019-01-17T00:00:00",
      "story": "We witnessed 3 bright objects flying in a circular pattern, which at first we thought were birds.  But we realize that the objects were very high in the sky.  They look to be at least Maybe 2000 to 3000 ft over head, is my guess.  They were flying in close proximity to one another making large circles and started to pulsate and glow off and on.   We were standing there looking in the sky trying to figure out what the objects were.  Then objects started moving East from our area where we first saw them.  They were still pulsating off and on and moving Eastward.  Seemed that we’re over head at first, then far away before we knew it.   I told a young lady that had witnessed the same thing to get a video of the objects before they disappear out of view.  Which we have.  By the time she started recording the objects were faraway from where we were at.  They seem like stars.  Then one object stayed on it seemed and started traveling in a straight line going southern direction.  Came to a stop.  Which at this time it looked like a bright star in the sky.  I was focused on that object when all of a sudden to the left of object another object started to glow like the first one.  They were at the same level in a straight line.  Then they disappeared.   Afterwards, I had notice on my sunglasses yellow dust was on my lens and powder of some sort was on my black hoodie sweater.  If someone wants to collect samples let me know and I won’t wash it.  It was a clear sunny day and could see the objects very clearly.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144474.html",
      "state": "MI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8df9",
      "summary": "We witnessed 3 bright objects flying in a circular pattern which at first we thought were birds.  ((anonymous report))",
      "city": "detroit",
      "shape": "flash",
      "date": "2019-01-11T00:00:00",
      "story": "We witnessed 3 bright objects flying in a circular pattern which at first we thought were birds. But we realize that the objects were very high in the sky.  They look to be at least Maybe 2000 to 3000 ft over head is my guess.  They were flying in close proximity to one another making large circles and started to pulsate and glow off and on.  We were standing there looking in the sky trying to figure out what the objects were.   Then objects started moving East from our area where we first saw them.  They were still pulsating off and on and moving Eastward.  Seemed that we’re over head at first,then far away before we knew it.I told a young lady that had witnessed the same thing to get a video of the objects before they disappear out of view.  Which we have.   By the time she started recording the objects were faraway from where we were at.  They seem like stars.  Then one object stayed on it seemed and started traveling in a straight line going southern direction.  Came to a stop.  Which at this time it looked like a bright star in the sky.  I was focused on that object, when all of a sudden to the left of object another object started to glow like the first one.  They were at the same level ina straight line.  Then they disappeared.   Afterwards, I had notice on my sunglasses yellow dust was on my lens and powder of some sort was on my black hoodie sweater.  If someone wants to collect samples let me know and I won’t wash it.  It was a clear sunny day and could see the objects very clearly.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144350.html",
      "state": "MI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8dfa",
      "summary": "We witnessed 3 bright objects flying in a circular pattern which at first we thought were birds. ((anonymous report))",
      "city": "detroit",
      "shape": "flash",
      "date": "2019-01-11T00:00:00",
      "story": "We witnessed 3 bright objects flying in a circular pattern which at first we thought were birds.  But we realize that the objects were very high in the sky.  They look to be at least Maybe 2000 to 3000 ft over head is my guess.  They were flying in close proximity to one another making large circles and started to pulsate and glow off and on.  We were standing there looking in the sky trying to figure out what the objects were.  Then objects started moving East from our area where we first saw them.  They were still pulsating off and on and moving Eastward.  Seemed that we’re over head at first,then far away before we knew it.I told a young lady that had witnessed the same thing to get a video of the objects before they disappear out of view.  Which we have.  By the time she started recording the objects were faraway from where we were at.  They seem like stars.   Then one object stayed on it seemed and started traveling in a straight line going southern direction.  Came to a st! op.Which at this time it looked like a bright star in the sky.  I was focused on that object when all of a sudden to the left of object another object started to glow like the first one.  They were at the same level ina straight line.  Then they disappeared.   Afterwards, I had notice on my sunglasses yellow dust was on my lens and powder of some sort was on my black hoodie sweater.  If someone wants to collect samples let me know and I won’t wash it.It was a clear sunny day and could see the objects very clearly.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144410.html",
      "state": "MI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fcf",
      "summary": "There was a female in a car in front of the house that saw them.",
      "city": "detroit",
      "shape": "circle",
      "date": "2018-11-24T00:00:00",
      "story": "There was a female in a car in front of the house that saw them. I have never seen anything like it in my life. On November 18, 2018, multiple bright orange circular lights (12 objects) in the sky at 12:15 am. The objects moved around to form like an Orion belt The objects moved to form an image of small triangles, three in a group. The objects then formed a straight line and disappeared quickly. ((NUFORC Note:  We spoke via telephone with the witness, and she seemed to us to be quite sincere.  We suspect that she is a highly reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143816.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c92f0",
      "summary": "IMG_1375.JPG 3 lights in a diagonal row",
      "city": "detroit",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "IMG_1375.JPG 3 lights in a diagonal row",
      "link": "http://www.nuforc.org/webreports/150/S150158.html",
      "state": "MI",
      "duration": "5 minutes"
    }
  ]
}