{
  "city": "durham",
  "fetch_timestamp": "2025-07-12T14:35:44.061322",
  "record_count": 65,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b5959",
      "summary": "large triangular craft  with 5 lights1 a red blinking light,hovering until i arrived right next to it and slowly dissappeared",
      "city": "durham",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "large triangular craft  with 5 lights1 a red blinking light,hovering until i arrived right next to it and slowly dissappeared This event took place on April 21, 2008. My buddy was taking me home that night it was about 11:30 pm driving down highway 70 between Raleigh and Durham. And coming around the bend there is a straight shot of about 2 miles of road to the intersection of page rd. and highway 70, so as soon as we go around this bend I see two really bright lights all the way down at the intersection that were noticeably brighter than any of the other lights around the area. And immediately my friend says “that’s a plane man” and I automatically agreed with him thinking it has to be… no way you know? As we got about half way down the road we noticed it hasn’t moved at all, so the next thing my friend says is that it has to be power line stand with lights or something and my reaction was were about to find out we are coming up on it now, we pass the power lines on the road which has no lights at all on it and then we pass about 300 feet of tall trees blocking the view and as we pulled up next to this craft immediately three other lights were now visible one of which was a blinking red light. It was a big black triangular object hovering completely stationary at least as long as 2 city buses together. It was only about 50 to 100 ft. over the trees, no sound completely silent no shine what so ever. I could see the angles of the craft through the light and could tell it was a three dimensional triangle about as tall as one story of a house. As soon as we stopped the car after taking a right on page rd. the craft started to move slowly away as if it had seen that we figured out what it was or as if there was some sort of intelligence looking back at us just steady slow cruising seemed to gain altitude and in a matter of seconds was totally gone, the lights we had seen two miles away had disappeared in a few seconds. See the thing is I got such a good look at this thing it is unbelievable, much less did I even believe in the phenomena but to be in the right place right time to even come in visual contact with one! blows m y mind. It looked like to me it was just sitting there watching the airport that has planes flying in and out all day but as it moved away I could tell that the blinking red light was on the back left corner cause of the direction of the leading point. I want to add that I have never been more scared in my life really my eyes were watering from shock I guess and I had goose bumps all over the place all night because of it. And other than that this is as far as I can go with it because its impossible to pursue further and half the people you actually tell your story to think you’re out of your mind but I don’t care we know exactly what we saw.And the reson i filled this out now i because it took my a while to be able to look at this site because of no internet.",
      "link": "http://www.nuforc.org/webreports/063/S63596.html",
      "state": "NC",
      "duration": "3 to 4 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b5ad5",
      "summary": "Object viewed over I-40 during daylight",
      "city": "durham",
      "shape": "oval",
      "date": "2008-06-12T00:00:00",
      "story": "Object viewed over I-40 during daylight A friend and I were travelling on I-40 West during broad daylight.  We both noticed in the distance a small black oval moving erratically over the highway. We had the same reaction 'What is that?'. It seemed to sway back and forth across the interstate.  As we continued travelling, it was briefly blocked by overhead road signs.  When it came back into view, it was slightly larger and still black in color.  Within about 30 seconds, it seemed to make a quick 90 degree turn towards the North and appeared much larger in shape... it was very bright as if was metallic and the sun was reflecting from it.  As soon as it made it's turn, it very rapidly 'swooshed' downwards and flew off towards the North at a very fast pace.  It moved so quickly, we lost sight of it as it flew behind the treeline.",
      "link": "http://www.nuforc.org/webreports/063/S63210.html",
      "state": "NC",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b644d",
      "summary": "Green Fireball moving from left to right and then descended moved at a very fast pace no sound.",
      "city": "durham",
      "shape": "fireball",
      "date": "2008-01-21T00:00:00",
      "story": "Green Fireball moving from left to right and then descended moved at a very fast pace no sound. My husband and I were outside on our deck talking and we were amazed at how bright the stars were that night.  We were ready to go in then he encouraged me to stay out a little longer so I did all of the sudden the sky lit up in a neon green. This is the best way to describe the color...I have never seen anything so bright in my life.  In fact it was so bright that I saw it coming behind the garage before we could actually see it.  I said what is that and then all the sudden we saw the fireball.  We live in a less poulated area so it is dark at night time.  It was the weirdest thing that I think I have ever felt and the coolest thing I have ever seen.  I kept saying did you see that?  Finally my husband said yes.  We just thought it was a weird metor or something.  We were kind of embarrased to tell anyone.  I am posting this because I was on the cnn site looking at the UFO thing that happened in Texas and came across other people that have seen green fireballs.  It kind of made me think I was not crazy after all. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60862.html",
      "state": "CT",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6597",
      "summary": "unbelievable ufo in sky",
      "city": "durham",
      "shape": "cigar",
      "date": "2008-06-12T00:00:00",
      "story": "unbelievable ufo in sky Basically I was outside in my backyard going to cut some flowers. I saw an airplane and looked back down. But right next to it was a strange moving, cigar shaped, silver object with a bright red light in the middle. It moved slowly in all directions. I stood there for a few seconds just to observe it and saw that it was not a plane, helicopter or weather balloon. I ran inside to get my father or a camera or something but when I went back outside I saw it for a split second and it turned even brighter red and disappeared into the trees. This is not a hoax and I am very serious about what I saw. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63460.html",
      "state": "NC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b72d1",
      "summary": "Shiney Blob of Metal Hovering in Broad Daylight Durham NC",
      "city": "durham",
      "shape": "disk",
      "date": "2008-04-17T00:00:00",
      "story": "Shiney Blob of Metal Hovering in Broad Daylight Durham NC We were dribing down Clayton Road in Durham North Carolina after school when in broad daylight, a very shiney \"blob\" of metal.  More looked like a disk.  Not aircraft shaped.  Making a turn, the object literally vanished after trees obscured out vision for a mere 5 seconds.  Was definitely NOT an aircraft.  Appeared to hover",
      "link": "http://www.nuforc.org/webreports/062/S62602.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c57",
      "summary": "Morphing object seen in the day in the same location a green-strobing object which was seen at night 2 weeks before.",
      "city": "durham",
      "shape": "changing",
      "date": "2007-02-24T00:00:00",
      "story": "Morphing object seen in the day in the same location a green-strobing object which was seen at night 2 weeks before. Two weeks ago I observed a green strobing light in the sky.   There are no mountains in that direction as well as no radio towers.    Today, I observed an object in the sky in the same general area.   The object was round, and with the same strobing pattern/frequency as the object I previously saw, changed between a cigar shaped object oriented up and down, and the sphere.",
      "link": "http://www.nuforc.org/webreports/055/S55403.html",
      "state": "NH",
      "duration": "at least 15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b80ef",
      "summary": "Stealth craft at night",
      "city": "durham",
      "shape": "",
      "date": "2009-03-19T00:00:00",
      "story": "Stealth craft at night 2/19/2009     I have been working the graveyard shift for a couple of months and have been listening to the Coast to Coast Radio Network with George Noory and other hosts. On one of the recent shows they had a guest and were talking about unidentified flying craft using stealth or camouflaging technology to imitate star patterns and such. I think what I witnessed may be similar to this. I wish I could be more specific in the date but it was some time ago and only hearing the show caused this recollection.  It was during the summer months in central Connecticut between 1975 and 1978 as best as I can remember between 10:00 p.m. and 1:00 a.m. I was with a bunch of friends at local gathering place, away from city lights out in the country. We were just hanging out as we did on many summer nights. For some reason I looked up at the night sky at the stars, which were exceptionally bright, as there was no moon and no clouds. I was just gazing at the different constellations when I noticed something out of the ordinary. A sizeable section of the sky was blacked out. Then I realized this section of black out was moving if I remember right in an east to west direction. I don’t recall if there was a noticeable shape to it, but you could see the stars disappearing behind it the reappearing as it passed. This did not have a false star pattern as some that were mentioned on the show just darkness. The only reason I saw it was due to the motion. If it were sitting still you would not have seen anything. I’m not sure of the altitude with nothing to reference it to, but my gut feeling is that it was quite high not quite Airliner high but much higher than small Airplanes fly. It did not do any sudden or erratic moves just cruised across the sky. With out being sure of the altitude it would be hard to say how fast. Again my gut feeling was that this thing was big  if it was as high as an Airliner it was really big and moving faster than an Airliner. And I did not hear any noise no jet sounds, no helicopter sounds, or visible contrail. I am very familiar with what Airplanes, Helicopters and Blimps look like and sound like this was not any of those things. I do not know what it was. I don’t know if this information is helpful or not, maybe it will correlate with something else that happened during that time. All I know is what I saw or didn’t see in this case. ((initials of witness deleted))  now in Florida ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68795.html",
      "state": "FL",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b831e",
      "summary": "A strange object moving at warp speed in the day",
      "city": "durham",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "A strange object moving at warp speed in the day What I saw was a circle shaped object off in the distance in the middle of the day. The only thing that caught my eye was a slight glare off of the silver/metal look it had. It then started to move at what seemed to be warp speed, first up then left  in what seemed to be in less than a blink of an eye, I lost sight for a second then the glare caught my attention and when I looked at it again it seemed to skip across the sky to my far right and then it vanished just as fast as it appeared. What I thought was strange is the movements made were very elusive only up, down, left, and right and even more it  never  sat still for long almost as if it knew it was being watched. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70637.html",
      "state": "NC",
      "duration": "10 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b863d",
      "summary": "This is a picture of a UFO I caught on the 3rd day of  January, 2009",
      "city": "durham",
      "shape": "diamond",
      "date": "2009-03-19T00:00:00",
      "story": "This is a picture of a UFO I caught on the 3rd day of  January, 2009 Sighting Report was west of Interstate 85, and Roxboro Rd.,N.C. The object was seen by a number of people in the area...I am a digital Photographer....",
      "link": "http://www.nuforc.org/webreports/067/S67990.html",
      "state": "NC",
      "duration": "one shot of camera"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ad4",
      "summary": "Large triangular craft seen hovering over power lines",
      "city": "durham",
      "shape": "triangle",
      "date": "2010-02-14T00:00:00",
      "story": "Large triangular craft seen hovering over power lines It was around midnight on April, 20th, 2009.  I was driving down the highway to bring a friend home when we both noticed a bright light about a mile or so up ahead, low to the ground.  As we continued to towards it, the light became brighter and still remained low to the ground.  My initial reaction was that it was a spotlight or a low helicopter or something.  As we drove up on the object, which was about 50 yards off to the side of the highway in a field with high power lines, we both stared in awe as we noticed a giant triangular shaped craft hovering above these power lines.  I was driving and my friend was in the passenger's seat, so he had a better view than I did.  I kept looking over at it every second or so and what I saw was a triangular shaped craft about 60-80 feet long on the longest parts and three bright yellowish/orange lights shining from each corner.  We took a right turn at the next light about 100 yards up the road and pulled right into a parkin! g lot next to this field.  We got out of the vehicle and stared in awe at this giant craft, not making a single sound, just hovering above the power lines.  As we stared at this craft, my friend gets in the car and pulls his camera out.  About this time the craft starts to slowly ascend into the air.  As he takes out his camera to take a picture, the camera reads, \"Memory Card Full\".  He had just taken a pictures a few hours earlier of the night and had not filled up his card yet.  I found this to be very unusual.  As the crafted started to ascend, it rose in somewhat of a rocking motion, then in an instant, it pretty much disappeared from sight.",
      "link": "http://www.nuforc.org/webreports/074/S74236.html",
      "state": "NC",
      "duration": "about 5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f4c",
      "summary": "3 bright lights over Durham",
      "city": "durham",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "3 bright lights over Durham I had just stepped out of my car in the parking lot of a restaurant. I glanced up into a very clear sky and was immediately stopped in my tracks by the sight of 2 \"stars\" approx. 3 finger widths apart, just below Cassiopiea. Being an avid sky watcher, I KNEW that those 2 stars did not belong there. I turned and walked about 5 steps back to my car, so as to brace myself against a stationary object to try and see if they moved. In the 2-3 seconds it took to walk that far, when I turned back to look at them, they had dimmed considerably, and were slowly moving, this time the 2 had become 3 points of light and were slowly moving together. They appeared to be extremely high up. No sound. I am positive they were not balloons, chinese lanterns, airplanes, satellites. No idea what they were. It was just amazing, seeing this show in the sky and knowing it was something unusual and out of the ordinary. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73085.html",
      "state": "NC",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9141",
      "summary": "Blue-white fire ball over Durham",
      "city": "durham",
      "shape": "fireball",
      "date": "2010-02-14T00:00:00",
      "story": "Blue-white fire ball over Durham Driving home on Hwy 147 towards Hillsborough, saw a large blue-white falling ball with a blue-white tail 2 1/2 times as large as object out of passenger side window.  Looked like it could be a comet, but color was wrong.  It looked close by, falling towards earth then it was gone.  It appeared to be about 1/4 mile away.   Went home thinking I would see somthing about it on the news, because many people were sure to have seen it.  Nothing was ever mentioned about it.",
      "link": "http://www.nuforc.org/webreports/073/S73882.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b94ab",
      "summary": "Have a picture of digital photo/ UFO.",
      "city": "durham",
      "shape": "diamond",
      "date": "2009-01-10T00:00:00",
      "story": "Have a picture of digital photo/ UFO. I was trying to see if I could take nightpictures of the full moon and caught somthing strange after I blew it up and found a diamond shaped craft because stars dont move across the sky, But this one did!!!",
      "link": "http://www.nuforc.org/webreports/067/S67490.html",
      "state": "NC",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b94a9",
      "summary": "Have a picture of digital photo/ UFO.",
      "city": "durham",
      "shape": "diamond",
      "date": "2009-01-10T00:00:00",
      "story": "Have a picture of digital photo/ UFO. Went outside to see if my digital camera could get some pictures of the stars and to see the quallity of my pictures and to see if my digital camera from cvs the would  pick up the stars and moon for clarity.  And I saw a number of lights/stars that were flashing then I saw what apeared to be either seperate ships or a single ship.There were 4 lights blinking in a diamond formation...you can see three lights staggered and one below the others in formation.. I had an erie feeling like my skin was crawling..I took pictures of the whole sky around me, a photographer, Amazed and  wierded out,creeped out, but never scarred.. Cordually...XX.X.X.XXXXXXXX Photo's for $10.00 ea.",
      "link": "http://www.nuforc.org/webreports/067/S67561.html",
      "state": "NC",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b06",
      "summary": "extremely brightly lit low flying almost silent helicopter type object",
      "city": "durham",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "extremely brightly lit low flying almost silent helicopter type object We thought it was a helicopter.  It was flying very low and brightly lit as thought there were spot lights. with I believe some blinking lights.  But it was almost silent.  It hovered in one spot ...we could see it from our house...on the third floor. I went out side on balcony and it was almost silent...then it just moved quickly and silently overhead and was gone.",
      "link": "http://www.nuforc.org/webreports/075/S75221.html",
      "state": "CT",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ee7",
      "summary": "3 lights diagnal very close with the center light appearing the brightest.",
      "city": "durham",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "3 lights diagnal very close with the center light appearing the brightest. A bright light sitting in the sky west of Durham. Has been seen in the past.  When looked at with the naked eye it appears as a bright light but when looked at with binoculars 3 small lights are seen diagnal with the middle light the brightest. When looked at with 16x zoom on camera the 3 lights appear blue and red tinted.  Because of the city lights it is hard to make out the object accompanied by the lights.  The object sits in place and has yet to vanish but vanished the previous sighting.",
      "link": "http://www.nuforc.org/webreports/075/S75318.html",
      "state": "NC",
      "duration": ">20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5b7",
      "summary": "Have video for sale of this UFO that seems to be a Mothership!!!There are six of them in orbit, Above  us.???  500 Lights On Object0: Y",
      "city": "durham",
      "shape": "disk",
      "date": "2009-04-14T00:00:00",
      "story": "Have video for sale of this UFO that seems to be a Mothership!!!  There are six of them in orbit, Above  us.???   It was on Dec 03,2009 was the first sighting..The Ship was one of a fleet of 6 I have whitnessed in the N.C. Sky at night. I saw 1 ship that looked like this below..If I have enough room I will make a replica of it. It had 4 lights on it and they blinked like the stars do. the lights stood out because of the ship being blackened out. You could tell. It looks real though. No wind, at all..It was quiet.A new guy I just started to know said look there!!!Look!, look!, Look!, A UFO !! He was alittle excited. I looked up and saw the same thing in the sky? It was twinkling like stars do? I took out my Digital camera and put it on video and went for it..I have been getting videos every other night except in rain..I used the Photo Viewer From Windows ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69553.html",
      "state": "NC",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bab22",
      "summary": "White fuzzy cloud like object in Sky",
      "city": "durham",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "White fuzzy cloud like object in Sky At approximately 2230 hrs., on 20Sep10, My friend James and myself were having a fire and observing Jupiter and the moon.  We went to get more firewood and upon walking towards the firewood, we both looked up to observe a white, fuzzy cloud like object with a clear nucleus flying across the sky in a slow manner, but faster than a regular cloud.  There was no wind nor any other objects including clouds in the sky.  We observed the object traveling S/W until it faded and disappeared.  Approximately a half hr. later, we heard on Fox News that National Security had launched a rocket with a \"secret\" satellite onboard.  Not sure it the object we saw in the sky was the satellite or the rocket, or maybe something other.",
      "link": "http://www.nuforc.org/webreports/077/S77944.html",
      "state": "CA",
      "duration": "2 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc48b",
      "summary": "Daylight sighting ufo with 2-4 spikes on top and haze betwean spikes possably spining object",
      "city": "durham",
      "shape": "disk",
      "date": "2011-12-12T00:00:00",
      "story": "Daylight sighting ufo with 2-4 spikes on top and haze betwean spikes possably spining object It was hovering just above the tree line  it looked like it had 2-4 curved spikes on top of it and was either spinning really fast (emphasis on really) or not moving at all in witch case it only had 2 spikes on it  and then it dipped down then when we went around the corner it wasn't there   we wear at voyager academy high school car line pick up",
      "link": "http://www.nuforc.org/webreports/085/S85612.html",
      "state": "NC",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd74",
      "summary": "Large ship seen over Durham, New Hampshire",
      "city": "durham",
      "shape": "other",
      "date": "2011-05-29T00:00:00",
      "story": "Large ship seen over Durham, New Hampshire I saw an enormous ship that was producing an electronic humming sound and had many lights and antennae protruding downward and moving across the sky at around 50,000ft.  It appeared to be made out of some sort of reddish metal, sort of like a orange, golden copper, a very obscure blend of colours.   It  moved across the sky for a bit then flashed and disappeared. Shortly thereafter, four jets shot across the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81481.html",
      "state": "NH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd96",
      "summary": "((HOAX??))  Large ship seen over Durham, New Hampshire",
      "city": "durham",
      "shape": "other",
      "date": "2011-05-29T00:00:00",
      "story": "Large ship seen over Durham, New Hampshire I saw an enormous ship that was producing an electronic humming sound and had many lights and antennae protruding downward and moving across the sky at around 50,000ft.  It appeared to be made out of some sort of reddish metal, sort of like a orange, golden copper, a very obscure blend of colours.  It moved across the sky for a bit then flashed and disappeared.   Shortly thereafter, four jets shot across the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81480.html",
      "state": "NH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd45e",
      "summary": "Hovering over a field, 6-10 bright lights on the edge of the bottom lined up. It looked 3D almost. By the time we went back, it was gon",
      "city": "durham",
      "shape": "oval",
      "date": "2012-09-24T00:00:00",
      "story": "Hovering over a field, 6-10 bright lights on the edge of the bottom lined up. It looked 3D almost. By the time we went back, it was gon My mom and I were driving near our house in Durham tonight at about 8:40 pm.  We had noticed a weird light in the sky - except it was strange.  Have you ever seen one of those balloons that are on a stick?  It looked like that - but 3D which had made it even more strange.  There were about 6-10 bright oval - like lights on it, but more underneath, if you looked at a kitchen bowl and you see the bottom edge like they were lined up in a row.  It was not moving, it was hovering, and it also looked as if it was IN Durham..not far in the sky.  By the time we turned around to see it (we were driving so we pulled over) it had been hovering in a field off of a main road. It had disappeared in those 1 minute / 2 minutes from turning around.",
      "link": "http://www.nuforc.org/webreports/092/S92348.html",
      "state": "CT",
      "duration": "2-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd758",
      "summary": "Red light stationary in sky for well over 15 minutes",
      "city": "durham",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "Red light stationary in sky for well over 15 minutes My wife and I came out from the parking lot after dinner and then stopped to try and film this thing.  It had no sound, a plane flew behind us which was drastically different than this red light in the sky. In the video, it has no color and is hard to make out exactly what it's doing.  We continued to watch it for at least 15 minutes before it started to &quot;bounce&quot; and then disappeared upwards.",
      "link": "http://www.nuforc.org/webreports/091/S91637.html",
      "state": "NC",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3be29a",
      "summary": "1950's  Durham, KS  evening  after dark 2 bright lights going across southern sky for several seconds",
      "city": "durham",
      "shape": "light",
      "date": "",
      "story": "1950'S  Durham, KS  evening  after dark  2 bright lights going across southern sky for several seconds Dear Sirs   Back in the late 1950s, Dad and I were out plowing in east central KS and come dark in the evening, we had to quit for the day as we didn't have lights on our old tractors.  Dad had gotten to the end of the field some time before I did and he was stopping at the end talking to a neighbor over the fence by the road.   They both saw these two lights on the southern horizon at a far distance that followed each other closely across from east to west at a good rate of speed---faster than any airplanes they had ever seen at the time.  The light seemed to remain consistent till they disappeared. We had no explanation except they being a UFO type sighting.  Was a clear evening with the stars coming out already. ((NUFORC Note:  Witness indicates that the date of the sighting in 1958 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88329.html",
      "state": "KS",
      "duration": "several seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be6fa",
      "summary": "Saw a light the size and color of the moon, but descending quickly.",
      "city": "durham",
      "shape": "light",
      "date": "2012-05-29T00:00:00",
      "story": "Saw a light the size and color of the moon, but descending quickly. I woke up at 2:30 a.m. EST and could not sleep.  I was laying in bed for some time completely awake when I looked out my window when a light appeared on a cloudy night.   At first I thought it was just the moon shining, but the object was moving.  I could see the white light object through the trees and it was descending downwards slowly.  I kept my eyes on it for about 30 seconds and then it went below the tree line.  I could not tell if this object was very far away or right beyond the trees, and when it went below the treeline and I could no longer see it, I did not hear any crashing sounds or any sound at all and it never reappeared.",
      "link": "http://www.nuforc.org/webreports/089/S89122.html",
      "state": "NC",
      "duration": "30 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3be7fe",
      "summary": "UFO Sighting at 10 pm on Shannon rd. facing North/NE toward 15/501  The Lights first appeared insanely bright spinning counter clock w",
      "city": "durham",
      "shape": "light",
      "date": "2012-06-05T00:00:00",
      "story": "UFO Sighting at 10 pm on Shannon rd. facing North/NE toward 15/501   The Lights first appeared insanely bright spinning counter clock wise and then slowing down in spin. As the lights slowed down they started to decrease in luminosity as if flying directly away from us. The whole phenomenon lasted about 120-140 seconds. WTF!???  I can't believe I just saw UFOs ... very eerie!!!!!!!  now at 10:34pm its raining.",
      "link": "http://www.nuforc.org/webreports/089/S89303.html",
      "state": "NC",
      "duration": "120-140 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0418",
      "summary": "Three orange globes flying in a triangle formation were witnessed in Durham, CA.",
      "city": "durham",
      "shape": "sphere",
      "date": "2013-04-12T00:00:00",
      "story": "Three orange globes flying in a triangle formation were witnessed in Durham, CA. At about 8:05 pm I viewed 3 objects in the West moving to the East directly over my head--these objects glowed like a Japanese lantern but much brighter -- At first I thought someone had lit them and set them off but these objects were not rising in the sky they were traveling at a high speed with no sound.  They were orange like a fire glow or a jack-o-lantern color the speed seemed to be faster than a large jet liner.  They were traveling in triangle formation with about 1 mile distance apart from each other",
      "link": "http://www.nuforc.org/webreports/096/S96846.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c04ae",
      "summary": "Round Silver Object Seen In Durham, NC Following an Airplane and Then Flying in a New Direction and Disappearing.",
      "city": "durham",
      "shape": "circle",
      "date": "2013-02-04T00:00:00",
      "story": "Round Silver Object Seen In Durham, NC Following an Airplane and Then Flying in a New Direction and Disappearing Around 4:00 pm January 18th on Friday afternoon in South Durham North Carolina on the &quot;Third Fork Creek Trail&quot; in the direction of the setting Sun (West) I looked up and I saw a airplane with a small comtrail heading East (away from the sun) and something else very peculiar was very close to it almost riding next to it without a comtrail. I thought that it looked very strange and was way too close to the airplane for comfort.  The other object appeared to be round and smaller than the plane. Both were moving east, almost paralleled one another and very close it appeared both moving upwards and East. I fumbled with my cell phone camera to try to get a picture and by that time the object split off from the plane and went in a new direction. It was now moving in a horizontal line, where it was headed vertically before with the plane.  I do not have details if it was a exact angle or how this happened but it was then heading in a straight line to the right, due North I believe. So the object is now moving in a different direction from the plane and it looked like it was moving much quicker than the airplane now but not so fast that it was completely unable to track. So I followed it with my eye for a few minutes and the sun illuminated it for about 10 seconds and then it got out of the sun's illumination.  So basically it is a round, silvery gray object moving in a straight line now. I noticed that it had a bit darker silver dome and a brighter silver underbelly and it was not the shape of an airplane.  I say \"dome\" because it was not elongated like a plane, it was more round. I followed it for a while and I knew it was too high up in the sky to get a cell phone image it was just too high!  I also did not want to take my eyes off it!  It was heading directly to the right, in a straight line and then it just vanished right before my eyes.  The odd thing is I had a feeling that it was going to vanish. I don't know how I knew this.  It's almost like a sense that it was going to vanish.  After it was gone I could still see the plane I originally saw and how the other object looked absolutely nothing like it. The weather that day was completely clear, crisp 40 degrees and sunny winter day without a cloud in the sky.  The other planes in the sky all had little comtrails and did not just vanish.  This other \"craft?\" definitely stood out as being bizarre...which is why I am writing this. I spoke into my phone and got all these details down as soon as it happened so things would not fade and get jumbled in my mind.  I hope this report is useful, maybe someone out there saw it too or there is an explanation.  It seemed different that just another plane.  Something unusual about it, which motivated me to write my first ever UFO report.  No one else was on the trail at that moment.  It was like just me and this thing and I was mesmerized just watching it.  It was actually a pretty incredible feeling and I am glad I witnessed it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96018.html",
      "state": "NC",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e17",
      "summary": "Bright red light performing maneuvers and landing.",
      "city": "durham",
      "shape": "light",
      "date": "2013-12-02T00:00:00",
      "story": "Bright red light performing maneuvers and landing (Addendum to earlier report)  Earlier I described my sighting of a strange red light that I saw today.  This light rose in the air about 200 yards in front of me and a friend while we were parked in my car facing NORTHWEST.  This was around 5:40 EST.  In a populated area with intersections, restaurants and bargain centers.  The sun had gone down but it wasn’t totally dark yet.  The object seemed to have structure but the light was all that could be seen. When it first caught our attention it was rising from at least 50ft from the ground.  As it rose slowly it seemed to come closer to us but mainly going straight up.  It elevated around 500-600 ft then it stops suddenly and at that point we both were puzzled because this wasn’t normal flight maneuvers for anything I’ve seen in the sky and this was so close.  There were no sounds coming from it.  Now that it’s closer it appeared to me there were actually two red lights instead of one but both were bright and bled into each other.  They were side by side but seemed to both be on one object.  I couldn’t make it out clearly, but it looked like above the lights there was structure. The object at that point seemed to slowly spin 180 degrees now showing white lights.  Then it moved to the left and right at different speeds stopping on a dime.  Very controlled and deliberate, as if showing off.  Not very fast, but too fast to start and stop, changing directions as it did.  Then, it shown red again and went away from us, we both got out of the car to get a better view and it lowered behind some trees maybe a quarter of a mile away.  I could see the red light looked to have landed in a clearing and out of view.  I kept looking and 45 seconds later it appeared again rising from the area it had lowered to.  It came back to the same area it was before in front of us.  It performed similar maneuvers again and moved very fast, up and down left and right.  Then it went away behind the trees again once more. I never saw it after that. The size is hard to estimate, maybe the size of a compact car.  The shape seemed saucer like but was not flat.  It moved in ways I’ve never seen before, very stable and strict.  It seemed to be controlled by intelligence.",
      "link": "http://www.nuforc.org/webreports/104/S104692.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e15",
      "summary": "Solid structure with red light flying low performing controlled maneuvers.",
      "city": "durham",
      "shape": "light",
      "date": "2013-12-02T00:00:00",
      "story": "Solid structure with red light flying low performing controlled maneuvers Me and a friend were sitting in my car when we seen an object with a red light rise into the air about 150 to 200 yards in front of us.  Our first thought was that it was a shiny red balloon but it rose straight up quickly maybe 500 ft in the air and just stopped suddenly and hung there.  Just a solid red light. Then it moved to the left a ways, then to the right.  It moved unlike anything I've ever seen before.  Changing speeds.  I cannot guess how big it was.  It wasn't very big, maybe the size of a car.  The light also changed to white, as if it had turned around and I was looking at a different side to it.   I got out the car to get a better look.  It went away from me and lowered seemingly to the ground about a quarter of a mile from where it was before, and it got there quickly. I could see the light go behind some trees in the distance.  I kept watching for it to rise again and it did.  It came back near the same area as before flying low and moving very deliberately and strict.   There was no noise and the area of the sighting is very busy.   There are busy intersections and many shops and strip malls.  I'm sure others had to have seen it.",
      "link": "http://www.nuforc.org/webreports/104/S104688.html",
      "state": "NC",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f4f",
      "summary": "7-8 orange objects forming a triangle and V shape. Stationary position for several minutes.",
      "city": "durham",
      "shape": "triangle",
      "date": "2014-01-24T00:00:00",
      "story": "7-8 orange objects forming a triangle and V shape. Stationary position for several minutes. There were around 7-8 orange objects, which at first formed a large V shape.  They stayed in the same spot not moving for around 2 minutes.  I went to go get a friend to come verify what I was seeing and when we got back there was nothing.  After another 20 seconds or so 3 objects reappeared in the same area forming a triangle.  They stayed there for another couple of minutes before disappearing.  We both took pictures and agreed it was definitely a UFO.",
      "link": "http://www.nuforc.org/webreports/106/S106451.html",
      "state": "NC",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11b0",
      "summary": "I was driving Eastbound on the interstate, when I looked to my left and sighted five blue glowing lights in a chevron, or V-shaped form",
      "city": "durham",
      "shape": "chevron",
      "date": "2014-02-07T00:00:00",
      "story": "I was driving Eastbound on the interstate, when I looked to my left and sighted five blue glowing lights in a chevron, or V-shaped formation, moving at a fast pace perpendicular to me.  The lights were bright and low to the ground.   They were solid lights, no blinking.   I turned away to reach for my cell phone to take a photo, and when I looked back at the glowing lights they started to disappear one by one until they were gone.   These could not have been airplanes, jets, or helicopters for I would have heard noise. ((NUFORC Note:  Witness corrects time to 6:45 p.m., or 1845 hrs.  We have changed the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106944.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11d5",
      "summary": "Bright Strobe Light, Higher than a cell phone tower.",
      "city": "durham",
      "shape": "flash",
      "date": "2013-12-02T00:00:00",
      "story": "Bright Strobe Light, Higher than a cell phone tower. There is a flashing light over in the field by Rolling View Marina.  Continuous bright super white flash.  Looks to be a cellphone tower, but it is way too tall and its not out in the clearing like a normal tower.   We have been here 30 years and know everything about the area and every event that goes on.  We are not sure what this is but we have never seen it before.   The dogs are freaking out! I do have a video.",
      "link": "http://www.nuforc.org/webreports/104/S104814.html",
      "state": "NC",
      "duration": "Still Flashing"
    },
    {
      "_id": "64d005f478aba2ec5a3c13d7",
      "summary": "Bright flashing white ball in broad daylight",
      "city": "durham",
      "shape": "circle",
      "date": "2013-11-11T00:00:00",
      "story": "Bright flashing white ball in broad daylight Around lunch time on a job site in Durham, NC, several co-workers & I looked up to see a bright circular white light in the sky.  It was a very blue sky crisp clear day, almost no clouds. It lasted for 2 to 3 minutes & mostly stayed in one spot only drifting to the right very slightly. It seemed very big as we saw other planes cross the same area throughout the day & ones that were lower to the ground you could make out in good detail.  So we do not believe there was any mistaking this ball of light for a plane or anything else. Every 8-10 seconds the light would either blink out & disappear instantly then blink back in or fade to smaller then blink out completely then a couple seconds later blink right back into view.  2-3 minutes of this fading/blinking in & out & after the last disappearance it didn't come back, it just seemed to vanish & we didn't see it anymore that day.  It almost seemed like a solid object but it was so bright white it was hard to decipher any distinct edges.   On examination of video that we took, to the lower right side of the object there seemed to be a much smaller round object floating with it & zoomed out along with it as it disappeared.  But was not visible throughout the entire video, just a few second here & there. ((NUFORC Note:  Video shows a white colored object appearing, and then disappearing, as the witness indicates above.  We will inquire whether he might have been photographing through a plate of glass, and therefore, whether the light might be a reflection.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104330.html",
      "state": "NC",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c200f",
      "summary": "Low flying, fast moving, red/white light disappears into thin air.",
      "city": "durham",
      "shape": "flash",
      "date": "2014-05-08T00:00:00",
      "story": "Low flying, fast moving, red/white light disappears into thin air.   We were outside at a public mall in a public setting.  The object flew directly over a large group of people and disappeared over a store into the night sky, but was silent and lasted about 3 seconds.  The only people who saw it happened to be looking up at the sky at that moment.  It was very low, much lower than planes/aircraft usually fly and was completely silent.",
      "link": "http://www.nuforc.org/webreports/109/S109146.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b1e",
      "summary": "Rapidly descending sparking fireball, seen over the course of several seconds",
      "city": "durham",
      "shape": "sphere",
      "date": "2014-11-06T00:00:00",
      "story": "Rapidly descending sparking fireball, seen over the course of several seconds Driving home.  Looking into the west/northwest sky.  It was dark already,   I saw a rapidly descending object spherical in shape--it was yellow/orange and shot sparks 3-4 separate times as it was descending--then I lost sight of the object.   I was almost certain that something would have crashed or fallen from the sky and it would be on the news.  I have seen nothing.   Other drivers on NC-147N seemed to see it too and hit their breaks-not finding any reports on the news or anything though.   It was definitely different from any meteor shower/aircraft/shooting star that I've observed before.",
      "link": "http://www.nuforc.org/webreports/115/S115126.html",
      "state": "NC",
      "duration": "5-6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3537",
      "summary": "I went outside at approximately 7:10 pm to let my dog out. Something caught my attention and it made me look up into the sky.",
      "city": "durham",
      "shape": "unknown",
      "date": "2015-02-20T00:00:00",
      "story": "I went outside at approximately 7:10 pm to let my dog out.  Something caught my attention and it made me look up into the sky.  For a second, it looked like the light from the separate planes, moving in formation, at the exact same speed without any deviation in formation.  But, as I looked a little closer, it almost looked like there was a solid mass. There was no sound ... not even airplane sounds. As it passed by a a star (or maybe it was Venus?) it appeared to cover the view of the star.  This is when I became really convinced that I was not looking at 3 separate planes but, instead, a single and very large object. I then saw some kind of plane appear from the left of the unidentified object.  I could gauge any distance.  It may have just been a regular plane. The object moved forward and behind the tree line, leaving me unable to observe it.",
      "link": "http://www.nuforc.org/webreports/117/S117284.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3613",
      "summary": "HUGE STAR looking craft (I guess, just one bright bright light)  One Light flew over head and then totally disappeared into thin air.",
      "city": "durham",
      "shape": "other",
      "date": "2015-02-12T00:00:00",
      "story": "HUGE STAR looking craft (I guess, just one bright bright light)  One Light flew over head and then totally disappeared into thin air. Looked Like a HUGE star that was really low over the sky, flew straight overhead of Middle of Durham, NH.   I was walking my dog down woodman road, looked up and coming from nowhere suddenly looked like A star was SUPER low flying at a medium speed overhead.  No blinking no multiple lights just as if a star had dropped down low and was floating over my head heading East.  I watched it fly over head for about thirty seconds and as it got a little past the spot where I was actually standing it just faded to nothing.  Absolutely did not go over tree line or fly so far it seemed as if i could not see it any more.  It was right over head and low and just disappeared.  CRAZIEST thing I have ever seen!!",
      "link": "http://www.nuforc.org/webreports/117/S117197.html",
      "state": "NH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c372a",
      "summary": "Multiple white circular objects at high altitude appear suddenly, cluster in a group and then disappear.",
      "city": "durham",
      "shape": "circle",
      "date": "2015-01-26T00:00:00",
      "story": "Multiple white circular objects at high altitude appear suddenly, cluster in a group and then disappear. While standing outside watching intermittent local airplane traffic I noticed three or so objects directly overhead and very high in the sky, beyond commercial jet altitudes.   The day was clear, sunny and cloudless, and no planes were in the vicinity at the time of the sighting.   The objects were circular in shape but not spherical, dime-sized and white in color, emitting no noticeable light.  They did not fly into view from a particular direction but rather just appeared in the area of sky I happened to be watching.   For approximately 15 to 20 seconds they were moving in a general area relative to one another, then seemed to cluster into a tighter group.   Immediately after that, 2 or 3 more objects appeared within the group.  This lasted maybe 10 or 15 seconds before 2 or 3 more appeared within the group making the total number of objects 8 or so.  They remained in this cluster for another 30 seconds before seeming to vanish with no discernible movement in an! y direction.   The entire sighting lasted roughly 2 minutes.",
      "link": "http://www.nuforc.org/webreports/116/S116833.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c38cd",
      "summary": "3 red orbs traveling quickly across the night sky. Disappeared within 30 sec. of sighting.",
      "city": "durham",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "",
      "link": "http://www.nuforc.org/webreports/116/S116435.html",
      "state": "NC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c38f1",
      "summary": "Diamond-shaped silent object hovers and passes overhead.",
      "city": "durham",
      "shape": "diamond",
      "date": "2015-01-09T00:00:00",
      "story": "Diamond-shaped silent object hovers and passes overhead. On the way to a gas station in northern Durham, North Carolina, my girlfriend and I witnessed an extremely bright hovering object, amber in color.  We decided to drive around to get a better view of it over the treetops and witnessed what looked like a triangular light pattern -- one very large, very bright amber light in the nose and a smaller flashing light on each wingtip and center which stayed illuminated but strobed brighter in order from left to right.  It passed in the opposite direction of our car.  Because it was so far away we could not make out any structure.  The large light was unlike anything we had seen in the sky before in terms of its size and brightness.  Once it was out of view we continued to the gas station. On the way back to the house we saw the object again, hovering back close to its original position.  It was much closer and we turned into a neighborhood to get a good look:  The object was very close.  I would compare it to watching a plane in take-off pass overhead in terms of its distance.  As we pulled into the neighborhood it stopped hovering and began moving -- drifting might be a more fitting verb -- across the sky towards us.  We parked the car and got out as the object passed directly overhead.  As it did we both witnessed the solid black outline of an equilateral diamond:  a small white running light in the center and at each tip with an over-sized, amber-colored seemingly directional (forward to forward-down) light at its nose and a significantly dimmer light on its tail.  The three lights from wingtip to wingtip constantly strobed in a left-to-right direction as it moved away from us.   The object was silent as it passed over and disappeared behind the tree line. We jumped back into our car to try and get a better angle to continue watching it but as we circled the woods which it had passed over it was nowhere in sight -- until we happened to catch the faint strobe of the object now a great distance away. We drove to my girlfriend's parents' house and watched this object glide back and forth across the sky at a great distance -- like a commercial plane at altitude --silently for over an hour.   At one point her mother came outside to watch it pass at about 45 degrees above the horizon close enough to make out the triangular front of the object.  We kept noticing that it seemed to pass in a straight line until we could not see it anymore and then begin its trajectory again from where it started -- but we never saw it fly back.  We assumed that we simply missed its return path.  Finally we watched one disappear not behind trees but simply into the distance and made sure to watch for its return.  It never flew back.  Suddenly it was once again close and over our left shoulders.  We were in disbelief that it could have 1) flown back to this position with such speed and 2) have done so without us noticing. We tracked the object as it passed about 60 degrees above the horizon when suddenly we noticed a second, identical object flying towards us from a great distance.  We continued watching these two objects pass back across the sky. The total sighting lasted from 9:20pm to 10:45pm, which is to say that at 10:45pm I finally came inside out of the frigid cold to write this report.",
      "link": "http://www.nuforc.org/webreports/116/S116552.html",
      "state": "NC",
      "duration": "80 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3bcd",
      "summary": "Driving and saw a cigar shaped object moving slowly, gliding.  Way larger than a plane. Not near the airport. Thought maybe it was a bl",
      "city": "durham",
      "shape": "cigar",
      "date": "2015-07-31T00:00:00",
      "story": "Driving and saw a cigar-shaped object moving slowly, gliding.  Way larger than a plane.  Not near the airport.  Thought maybe it was a blimp at night?  Lights on either end, but none in the middle. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120712.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3cf7",
      "summary": "Silver almost translucent, object flying over Durham.",
      "city": "durham",
      "shape": "rectangle",
      "date": "2015-07-23T00:00:00",
      "story": "Silver almost translucent, object flying over Durham. I  was driving down the highway when my boyfriend pointed out a silver, almost translucent, object in the sky.  It appeared rectangular in shape and was too low flying to have been an airplane, and granted that we are not close enough to the airport for it to have been a plane we are positive it wasn't.   My boyfriend continued observing the craft  while I had taken my eyes off it to switch lanes,it's during this 5 second period the craft disappeared completely.  He stated the craft simply vanished.  We were on open highway so there was no way we had lost sight of it and a plane could not simply disappear out of sight entirely in five seconds.",
      "link": "http://www.nuforc.org/webreports/120/S120516.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c41a5",
      "summary": "Strange sounds and aircraft that suddenly disappeared in the sky after seeing it.",
      "city": "durham",
      "shape": "fireball",
      "date": "2015-05-08T00:00:00",
      "story": "strange sounds and aircraft that suddenly disappeared in the sky after seeing it. I woke up to a horrible sound like an animal being electrocuted, then a loud sound like an jet starting.   It was completely dark in the house and I looked outside and saw lights and a craft of some sort fly by faster than any aircraft I've ever seen. there we're 3 lights that were shining and it seems to have a fireball behind it right before it disappeared into the air. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Possible hoax, we wonder??  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118820.html",
      "state": "CT",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c45fe",
      "summary": "Large red linear blinking light pattern moving south from southern Durham. Was banked sharply to the left, then rotated as it moved awa",
      "city": "durham",
      "shape": "formation",
      "date": "2015-10-29T00:00:00",
      "story": "Large red linear blinking light pattern moving south from southern Durham. Was banked sharply to the left, then rotated as it moved away to bank sharply right.  It was against a southern constellation, maybe spanning 3 degrees of angular view, within 30 seconds it was far less than 1 degree.",
      "link": "http://www.nuforc.org/webreports/122/S122997.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5064",
      "summary": "Spotted a formation of slow moving objects flying North in column with red flashing lights with one white light per craft. This occured",
      "city": "durham",
      "shape": "formation",
      "date": "2016-02-11T00:00:00",
      "story": "Spotted a formation of slow moving objects flying North in column with red flashing lights with one white light per craft.  This occured approximately 6 miles Northwest of Raleigh-Durham (RDU) airport.   The engine noise emitted was a low rumble, unlike that made by any airplane or helicopter I have ever heard.   There were inconsistencies in the placement of the lights yet they all moved in a very slow but consistent fashion.",
      "link": "http://www.nuforc.org/webreports/125/S125650.html",
      "state": "NC",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5062",
      "summary": "We witnessed a line of lights, 7 in number, alternating white, red. First thought it was a string or airplanes, but they were perfectly",
      "city": "durham",
      "shape": "light",
      "date": "2016-02-11T00:00:00",
      "story": "We witnessed a line of lights,  7 in number, alternating white, red.   First thought it was a string or airplanes, but they were perfectly in a line.  Then one light appeared, separate, much brighter than the others, white.  Drones?  Would have required extremely precise coordination.  No sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125648.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c50c8",
      "summary": "Two green one white light seen over South Square.",
      "city": "durham",
      "shape": "light",
      "date": "2016-02-26T00:00:00",
      "story": "Two green one white light seen over South Square. Observed over \"pickle\" building in South Square.  Two green lights, and one flashing white light.  Lights flew straight up, hovered, flew a bit further up, then went directly left.  Witnessed at the stoplight in front of Rooms To Go on 15-501. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126031.html",
      "state": "NC",
      "duration": "a few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c513f",
      "summary": "Triangle craft.",
      "city": "durham",
      "shape": "triangle",
      "date": "2016-02-04T00:00:00",
      "story": "Triangle craft I was standing on my porch talking on my cell phone when i spotted 3 lights in a triangle formation fly directly in front of my house.  It sounded like a distant rumble.    I quickly got my wife's attention and she was able to snap 2 photos before it flew out of view.",
      "link": "http://www.nuforc.org/webreports/125/S125537.html",
      "state": "NC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5239",
      "summary": "Moon in Western sky with light at bottom pictured with 12 white bright lights in shape of 1/2 Grey UFO.",
      "city": "durham",
      "shape": "disk",
      "date": "2016-01-05T00:00:00",
      "story": "Moon in Western sky with light at bottom pictured with 12 white bright lights in shape of 1/2 Grey UFO. Driving on Snow Hill Rd., looking in the Western sky, saw almost dark moon light under the bottom of it.   Stop to picture moon it changed to lights around the top of one half grey space saucer or UFO zoomed in on the photo and there were white oblong lights on top and bottom close together total of 12. Duration  2 Minutes - The saucer or UFO went behind the moon. I have a photo evidence with this report.",
      "link": "http://www.nuforc.org/webreports/124/S124912.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d13",
      "summary": "Wife and I saw 5 light orange disc like objects that appeared to be spinning flying W.  ((anonymous report))",
      "city": "durham",
      "shape": "disk",
      "date": "2016-12-05T00:00:00",
      "story": "As me and my wife were standing outside of a restaurant we saw 5 light orange disc like objects that appeared to be spinning flying in a westward direction in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131198.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c622a",
      "summary": "A cone/teardrop shaped object was on fire and fell from the sky across HWY 70 in Durham, NC on 9/8/2016.",
      "city": "durham",
      "shape": "teardrop",
      "date": "2016-09-15T00:00:00",
      "story": "A cone/teardrop shaped object was on fire and fell from the sky across HWY 70 in Durham, NC on 9/8/2016. Near RDU airport, while driving, I saw something cone/teardrop shaped and on fire falling from the sky.  It disappeared behind the trees in the distance.  I thought a small plane was crashing, but it was way too small for that.  My son thought it might be a meteor.  I even opened my window to try and hear or smell something.  I've never seen anything like it.",
      "link": "http://www.nuforc.org/webreports/129/S129877.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c64af",
      "summary": "Saw what sounded like a helicopter, but looked so wrong once, and then two more times during a meteor shower.",
      "city": "durham",
      "shape": "other",
      "date": "2016-08-16T00:00:00",
      "story": "saw what sounded like a helicopter but looked so wrong once, and then two more times during a meteor shower I had just gotten home from a day with my family.  My uber driver told me to look out for a meteor shower from midnight till six. I was standing outside smoking a cigarette in my driveway when I heard a strange sound. It was almost like a helicopter blade, but it sounded fake. A few minutes later, I saw the UFO. it flew low to the ground from my right side, making an arc all the way around my horizon and disappearing out of view behind the school across the street from my house.  The craft looked strange, with piercing white lights on it and one red light at the front.  The whole thing was lit with an orangeish hue. I pulled out my phone to record this first incident.  I texted my best friend who is a fellow believer and told him I'd send him the video-only to discover the video was completely gone.  There was no trace of me recording even though I had clearly done so. Freaked out, I sit on the curb on my driveway and watch the sky.  A shooting star appears and flies right into the spot I saw the craft disappear from view.  I try to calm down and I make a wish as one is supposed to do.  I'm sitting there watching the sky closely and, texting my friend. I get the strange feeling I am being watched so I stand up and shout \"I JUST WANT TO KNOW IF YOU'RE THERE.\"  Five minutes pass and I see the craft again (possibly a separate UFO of the same kind).  I am so frightened this time, not only because it has reappeared but because it seemed to have heard me.  It comes from the same direction I saw the first ship, but takes a slightly less direct route.  It makes no sound this time. Again, I try to record it with my phone.  This time, my phone actually goes completely dead out of nowhere.  The craft lazily disappears out of view, the same way the other one did. I sit down again and begin to shake.  My heart is racing and I'm scared for my life and my sanity.  I keep watching the sky only to see four or maybe five shooting stars all in the same area I saw the UFO's.  Just as I'm about to go inside and charge my phone and grab another cigarette, a third craft appears.  This time, it's coming from the left of me, and it seems closer than before. The craft appears to have a rotating circle of white lights that almost look like stars. The orange hue is very prevalent and I can clearly make out the shape...  It's almost like a \"cigar\" with lights.  I watch the craft fly towards the meteor shower, make a right turn, and then turn into a single red light.  It was almost as if it was cloaked. My friend arrives on the scene shortly after that.  Scared shitless, we sit in my driveway and watch the sky.  My friend points out a very skinny cloud on an otherwise clear night that follows the path I saw the first craft take.  We don't see anything else for a long time, until I notice a star that is blinking and changing colors, and even moving slightly.  My friend and I grab my camera and walk a few blocks, using the camera to zoom in on it.   We eventually go back to my place and I can tell the inadvertent doubt has set in for my friend.  \"Maybe it's just a star, man.\"  After all the things I saw last night, I can't be so sure.  Not to mention, now on my iPhone there are four black images where the video files should be, and the first time I tried to look closely at them my phone died instantly.",
      "link": "http://www.nuforc.org/webreports/129/S129161.html",
      "state": "NC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6f76",
      "summary": "Hovering above the trees, then it just takes off",
      "city": "durham",
      "shape": "other",
      "date": "2017-08-04T00:00:00",
      "story": "Hovering above the trees, then it just takes off I'm driving on route 4 away from Portsmouth at about 10:00 at night.  There's only one other car on the road and it's in front of mine.  We get right up to wagon hill farm when the guy in front of me slams on the brakes.  I'm looking around trying to figure out why and I don't see anything.  Then I look up, and see it.   It was some kind of aircraft hovering mid air right above the trees just in front of the car in front of me.  It had bright white lights coming from the bottom of it, but because of the angle and how dark it was, it was difficult to determine its shape.  I could tell it was larger than the car in front of me, and mine as well.  It stayed hovering there for about 10-15 seconds and then it took off.  It went so fast, I could barely tell which direction it went in.  It went left toward the hill and then out of sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135409.html",
      "state": "NH",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c73d1",
      "summary": "I was driving into work and saw for a second what looked like a silver somrthing, maybe a hot air balloon but too far away and too high",
      "city": "durham",
      "shape": "disk",
      "date": "2017-06-15T00:00:00",
      "story": "I was driving into work and saw for a second what looked like a silver something, maybe a hot air balloon, but too far away and too high.   I saw and watched it for about 10 seconds it seemed to change angels and it was gone.  No trace no smoke no stream, just gone.",
      "link": "http://www.nuforc.org/webreports/134/S134573.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c73ae",
      "summary": "Me and my mother were walking away from a neighbors party to our home when I saw a light-orange light probably 500 feet away. It was go",
      "city": "durham",
      "shape": "circle",
      "date": "2017-06-09T00:00:00",
      "story": "Me and my mother were walking away from a neighbor's party to our home, when I saw a light-orange light probably 500 feet away.  It was going in a right direction glowing faint until it started to move to the left, which the it started to glow a lot brighter and grew half it size.  It made no sound.   The temperature outside is cool and there is no sign of clouds or electrical storms.   The object kept moving back and forth  (to the left and right) for several minutes until it slowly faded out.",
      "link": "http://www.nuforc.org/webreports/134/S134420.html",
      "state": "NC",
      "duration": "5+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c74d0",
      "summary": "Bright silver shape circle.",
      "city": "durham",
      "shape": "circle",
      "date": "2017-05-11T00:00:00",
      "story": "Bright silver shape circle. On this date I was driving from downtown Durham to hwy 85.  I stop at a stoplight and saw a  bright sliver shape circle and thought maybe it was just a plane.  I turn away for a second and the object was gone.   I thought maybe it flew behind some trees but there was no trees in the area an not a cloud in the sky.  At this point I realize I just saw a UFO,  I drove off and still could not see the object. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134015.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c76fd",
      "summary": "Fast moving sphere of light.",
      "city": "durham",
      "shape": "sphere",
      "date": "2017-12-21T00:00:00",
      "story": "Fast moving sphere of light. Large bright ball of white light in North sky, low in sky, very fast- thought was meteor but seemed so big and close- not sure as I saw out corner of my eye and it was very quick and silent. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137824.html",
      "state": "NC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7957",
      "summary": "Object appeared to be a falling star or meteor.  Fell very quickly.  Was a brightly lit, falling object.  ((NUFORC Note:  Meteor?  PD))",
      "city": "durham",
      "shape": "light",
      "date": "2017-12-14T00:00:00",
      "story": "The object appeared to be a falling star or meteor.  It fell very quickly.  It was a brightly lit falling object. ((NUFORC Note:  Meteor?  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137762.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d1c",
      "summary": "Driving on Shannon Road toward 15-501 in Durham, NC. Saw group of seven to ten dark/black objects that darted across the sky at treetop",
      "city": "durham",
      "shape": "rectangle",
      "date": "2017-09-21T00:00:00",
      "story": "Driving on Shannon Road toward 15-501 in Durham, NC.  Saw group of seven to ten dark/black objects that darted across the sky at treetop level.  Moved quickly from sight.   I thought it might be a flock of large birds, but objects had hard lines – rectangular plus more.  Very odd.",
      "link": "http://www.nuforc.org/webreports/136/S136231.html",
      "state": "NC",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c81da",
      "summary": "Saw red light on top of green, both blinking White light circling underside.  ((anonymous report))",
      "city": "durham",
      "shape": "light",
      "date": "2018-01-25T00:00:00",
      "story": "Saw red light on top of green, both blinking White light circling underside. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138469.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8433",
      "summary": "Fluctuating bright white light in night sky, high up seen from route 147.",
      "city": "durham",
      "shape": "circle",
      "date": "2018-10-06T00:00:00",
      "story": "Fluctuating bright white light in night sky, high up seen from route 147. Small light in sky that looked like a star at first but then brightened to at least 200% of its size, then back to original size and then brightened again.   We were driving so cannot say the duration of time.  Pure white light and no sound.  Would love to know if anyone else saw this in night sky!",
      "link": "http://www.nuforc.org/webreports/143/S143308.html",
      "state": "NC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c914a",
      "summary": "Two sets of lights in isosceles triangular formation flew slowly over a gas station.",
      "city": "durham",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "Two sets of lights in isosceles triangular formation flew slowly over a gas station. Two sets of lights, each in isosceles triangular formation flew very slowly over a gas station in Durham, NC.  This was across the street from Planet Fitness on MLK.  I was just across the street.  I wondered if it was a medium sized airplane with all lights turned off and the wings lit up, but that makes no sense.  The lights were not normal airplane lights in any way.  Also the lights moved very slowly and were only about 50 feet above the gas station.  After about 45 seconds the lights disappeared behind some trees.  I do not believe in UFOs but don’t know how to explain this.",
      "link": "http://www.nuforc.org/webreports/149/S149593.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c944c",
      "summary": "Two sightings on cold days (Durham, NC) and 1 on a hot day (Charlotte, NC) with a picture of one",
      "city": "durham",
      "shape": "unknown",
      "date": "2019-12-19T00:00:00",
      "story": "Two sightings on cold days (Durham, NC) and 1 on a hot day (Charlotte, NC) with a picture of one Technically, there were 2 witnesses to this event. I was walking my 2 year old son home from daycare, when I put him on my shoulders. It had literally felt like the windiest day NC had ever had. I would know, as I didn't have a car at the time, nor the years preceding and following this event. Whe walking my son through a nature trail, I just happened to look up...I saw a parallelogram-shape open in the clouds, as if a garage door lifted.I blinked several times and immediately stopped walking. The shape stood open for several more seconds, then closed from top to bottom, in perfectly straight lines from start to finish.  This was not the only sighting I've witnessed. I have a picture on an older phone of a second sun-like object in the sky in November of 2013. Both the sun and this bright object were hidden by the clouds that day, so many would easily overlook it driving by, especially with the road layout on Fayetteville st in Durham, NC. I was walking to work at Lowes on the southside of town around 18:00hrs. Once it was in view, I never saw it depart. As I entered Lowes, it was still there.  The final sighting was in September of 2015, near downtown Charlotte, NC. I was walking, again, to a bus stop just southwest of downtown. I seen at least 8 red lights, in the shape of the letter \"U\", in the sky. The difference between the first to sightings was that they or it was maybe 200 yards from the ground this time. It held its position for at least 10 seconds, then one by one, the lights disappeared.This occurred around 14:00hrs.",
      "link": "http://www.nuforc.org/webreports/151/S151639.html",
      "state": "NC",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c97b3",
      "summary": "Bright yellow-ish light low and much closer than the stars moved quickly in all directions. Went straight up fast when a plane flew by.",
      "city": "durham",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Bright yellow-ish light low and much closer than the stars moved quickly in all directions. Went straight up fast when a plane flew by. Plan was much higher. Light stayed in the same area for the 15 minutes that I watched. It continually moved in small increments in different directions.",
      "link": "http://www.nuforc.org/webreports/150/S150961.html",
      "state": "NC",
      "duration": ">30 minutes"
    }
  ]
}