{
  "city": "elpaso",
  "fetch_timestamp": "2025-07-12T14:25:47.897516",
  "record_count": 83,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b44f0",
      "summary": "Crescent shaped objects over missle test range.",
      "city": "elpaso",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "Crescent shaped objects over missle test range. I was looking towards McGregor range, a missle range north of El Paso.    There I saw what I thought was a large plane flying rather high over that airspace.  It was extremely bright in the pre-twilight evening. This is a flight area for planes landing at the internation airport in El Paso so I really did not think much about it.  I saw another jet fly below it.  The second jet was definitely coming towards the airport and even though it was approaching twilight, I could not see the landing lights. It was still too light outside.   I could see the form of the plane as a shadow. The second jet left a vapor trail.  This caused me to ponder and wonder how the plane flying higher did not leave any trail. I watched the  first craft and its glistening shape changed slightly to crescent as if it had turned to reveal its profile.  It seemed to have pivoted at the spot it was at.  It made no motion in relation to objects on the ground.  From my observation point - several miles from McGregor range - and having seen a commerial aircraft look like fly specks below this craft, I suddenly was aware I was looking at something extraordinary.  This thing seemed to be about 1/4 inch wide now from my front yard - but if it were higher than commerical airliners and further away, it had to simply be huge. A speck of light sudden flew up from the ground east of the crescent and appeared slammed into the crescent at an extremely high rate of speed. I've been involve in missles and I've never seen one as fast as this one.  The crescent seemed to absorb the speck.  I thought at first that it might have been a missle from McGreor, but having just seen a commerical plane in that airspace, that did not make any sense. McGreor would have closed off its airspace before any test firings.  Commerical traffic was still using this airspace.  There did not appear to be any materials falling away from the crescent shaped object as one might expect if it were hit with a missle. From my point of view, it appeared another speck of light came from just below the crescent and also slammed into the crescent. It was not as fast as the first, but still far beyond convential craft speeds.  I realized there was no vapor trail from the smaller speck. About that time, on the horizon appeared three vapor trails in formation that were rapidly approaching the area. I suspect they were from the near by airforce base, but that is nearly 100 miles from here.  They might have been from White Sands - a little closer. The cresent turned from sunlight white to a brighter blue white light and in just a few milli-seconds was too small to see. I assume it was traveling away at an extraordinarily high speed. The three vapor trails that were approaching the area sharply did a 180 degree turn.",
      "link": "http://www.nuforc.org/webreports/050/S50130.html",
      "state": "TX",
      "duration": "less than 10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b463f",
      "summary": "\"dog fight' between stars",
      "city": "elpaso",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "\"dog fight' between stars At about 10:10 P.M. On 5/4/06,  I was in my backyard sitting down,  when I saw (flash) lighting. The whole sky lit up on the horizon, north to west. Nothing out of the ordinary, but there was'nt a cloud in the sky. Told my wife about the event and couldn't figure it out.   Went online to check local weather and current lighting strikes.  Nearest strike was in Abliene, TX.   Not a cloud in the sky. This got me curious, so I was looking in the sky for clouds or a storm.  Looking to the northwest low to the horizon (now about 5- 10 mins later), I saw 4-5 faint star looking objects floating around doing unbelievable manuvers. These objects would be moving slow at first, then at lighting speed change direction.  Sometimes you see only 1 at a time.  Sometimes two or three at a time.   The best I can describe it was it looked like a \"dog-fight\" between stars. They would move up and down, left to right,  figure eights, you name it, zig-zag, at all different speeds. Their speed was unbelievable.  This was not man-made!   Notified my wife and woke up my 8 yr. old son to witness.  My son got very scared and started crying, my wife couldn't comment.  Called a buddy who lives west of me about 7mi. Told him where to look, he didn't see anything, but his wife did.  Haven't spoke to her yet on what exactly see saw.  The whole event lasted approx. 15-20 mins.  All their manuvers stayed in the general location.  Notified local UFO hot-line and made a report.  I do not know who to turn to or what?   Just wondering if anybody else has witnessed this in the El Paso or Las Cruces, NM, area.  Thanks!",
      "link": "http://www.nuforc.org/webreports/050/S50423.html",
      "state": "TX",
      "duration": "15-20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b4713",
      "summary": "Military jet takes off and tries to intercept a disc-shaped UAP.  As jet gets close, both UAP and jet suddenly disappear.",
      "city": "elpaso",
      "shape": "disk",
      "date": "2019-06-07T00:00:00",
      "story": "Military jet takes off and tries to intercept a disc-shaped UAP. As jet gets close, both UAP and jet suddenly disappear. My friends and I were returning home, traveling north on Rte 54 (Patriot Freeway).  At about 3:01 pm I noticed a fighter jet taking off from Biggs Airfield at Fort Bliss, El Paso, TX.  As I watched it ascend, it began to turn East away from me as it climbed rapidly.  I thought its flight path unusual, and continued to watch it ascend towards a bank of clouds above it.  The jet turned so sharply that its wings were vertical to the ground as it made a U-turn back towards the South.  Then I noticed an object hovering just below the clouds over Biggs Army Airfield.  I recognized it as a UAP or UFO, and grabbed my cell phone camera.  It took me a few seconds to get the camera operating.  By that time the jet was rapidly closing the gap with the UAP.  In response, the UAP began to back up and move away from the approaching jet.  I was stunned!  I aimed my camera and pushed the shutter button, but my cell phone camera did not respond fast enough.  Suddenly both the UAP and jet both disappeared.  The photograph time is 3:03 pm, taken just after the jet and UAP disappeared.  I asked my friend, who was driving, and he said he didn't see it.  He is an audio witness to my sighting.  I have no idea what happened to that jet. The picture shows the scene with the distant Hueco Tanks Mountains and sacred Cero Alto Mountain (tallest) in the background to the East.  The picture recorded the date and time of the photograph, and even GPS location of our car at 3,000 Gateway North Boulevard (access road to the Patriot Freeway).  Visibility was excellent at 10 miles.  I overlaid the photo with an image of what type of UAP/UFO I saw and the type of jet, as best as I could make out from four miles away (map distance).  I added dots to mark the path of the jet as it made a high-angle U-turn towards the UAP/UFO. I posted this picture and account on my Facebook profile, and had a number of responses.  Ted Roe of NARCAP made an interesting comment:  T. R. (NARCAP)  My guess.... plane was too close when the ufo bolted, inside the envelope when it jumped.  Probably carried the plane with it to where ever it was when it stopped... F18.... I watched one pursuing an object that appeared to be 2 silver spheres connected with a thin bar.... it left instantaneously but the plane wasn't that close.",
      "link": "http://www.nuforc.org/webreports/146/S146576.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5018",
      "summary": "Triangular craft spotted.",
      "city": "elpaso",
      "shape": "triangle",
      "date": "2019-12-22T00:00:00",
      "story": "Triangular craft spotted.  I have reported this case to the MUFON and received no response despite hours of phone interviews. Months later I had to contact the investigator only to be told that what I saw was indeed unidentified.  I have amazing video of what I saw, strange occurrences in the sky within the following day, and strange occurrences that have happened to me after.  On the night of April 20, 2019, I was driving down my neighborhood street to the corner gas station. It was a clear, dark desert night. There are no tall trees or obstructions in this area.  When I was driving, I saw an odd light pattern in the sky that caught my interest, but as I was driving I was unable to stop.  I spent roughly fifteen minutes at the corner store before proceeding back home on the same path I had come.  At this time, 9:20 PM, I saw the light pattern again and I was able to safely stop and record. I have a twenty-second video, but I watched for around 10-15 minutes before I could no longer see. What I saw was triangular, with three white lights. The craft was low, too low to be considered normal. Too slow to be considered normal. Too quiet to be considered normal. It would stop for seconds, it would disappear for seconds. It just seemed as it was lazily passing over the neighborhood. It should be noted that there is an airport in my city as well as an Army base, but both are considerably far from where the incident occurred.  Very odd things followed for months that I do not wish to publish here but will discuss with a NUFORC member. I truly believe I have caught a UFO in film and the events surrounding will only support the story. I am a scientific person to my core and I have grown up on military bases, so I would not jump to far-fetched conclusions unless I really believed.",
      "link": "http://www.nuforc.org/webreports/151/S151734.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5220",
      "summary": "bright light over desert in el paso tx 1984",
      "city": "elpaso",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "bright light over desert in el paso tx 1984 we were in the desert sitting in bleachers listing to our instructor about night fire (shooting at night) a bright white light started moving toward us ithougth it was a helicopter maybe 2 hun ft high it stop moving it made no sound so i thought it was sme secret mil craft oh it was a clear night and a fuul moon the objects light began to glow brighter and brighter until it out shine the moon and was bigger it slowly separated into 4 smaller lights they moved away from each other at the same level and at one point were miles away from each otherthis of coures caused a great comotion but our instructor commanded us to pay attention and he never turned around to see what was happening the 4 smaller ligths came back together and formed the big light and then left in an instant we were all saying what the fu was that anyway the next mourning when i tried to talk to people about the incident i swear no one would acknowlege what we had all seen and responded to the night before also while i am at it that was not the first time when i was 10ys old and had just learned what the colour of stars meant i saw a orange object that looked like a top hat it tilted to the left for moment then in an instant flew away.and there was another time when i was 15 when one night about 9 of me and my friends were lying on our backs on a friends gargage we saw what appreared to be lights playing pin ball with each other in the sky it lasted 30in or more heres the thing next day nobody remembered except me none of did any kind of drugs and i do care if you believe or not that was what i and others saw ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63637.html",
      "state": "TX",
      "duration": "20min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d62",
      "summary": "El Paso bright orange light",
      "city": "elpaso",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "El Paso bright orange light On my way to the store, i was driving NE of the Franklin mountains, suddenly a pretty bright orange light appeared straight ahead of me what seemed maybe 4/500 yds high. I pulled over right away and tried to get a shape of the object, it was moving very slow, not up, but foward.  and with my hand held at arms length was the size of my pinky nail. after about 20 seconds it just turned off, i did not see any shapes when the light turned off, and there was no noise at all. no airplane lights or chopter lights, nada.",
      "link": "http://www.nuforc.org/webreports/062/S62728.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d8a",
      "summary": "Undified Flying Object",
      "city": "elpaso",
      "shape": "disk",
      "date": "",
      "story": "Undified Flying Object This object approachded from the West (White Sands Proving Grounds or Alamogorda New Mexico) moving to the east. I was in the army stationed at Fort Bliss Texas (the air defense center) training to shoot down aircraft.  Fort Bliss is not too far from Biggs Air Force Base. ( A SAC Bomber Base).  We had fallen out for formation around 4:30 in the morning and it was about 1 hour before sunrise.  While standing in formation (I) we observed a dish shaped object approaching from the west, white in color,( that could have been due to the altitude and the reflection of the rising sun giving it that color) and you could tell it was spinning because what appeared to be flames were coming off of it. The object stopped very suddenly and began to hover.  You could tell that the object was spinning and leaving what you could say was a vapor trail.  The object moved at great speed and would stop abruptly and change direction. The entire platoon witnessed this object for about 10 minutes.  As with any occurance like this; we talked about it during breakfast and I think that is as far as it went. We had heard on the news several reports of strange  objects being seen in other areas of the Texas panhandle around the same period of time.   Finally the object reversed itself and went out of site in the direction from where it came.  But when the sun came up the vapor trail disappeared. There were no flashing lights or lights that could be seen nor was there any sound that could be heard. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61187.html",
      "state": "TX",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ec5",
      "summary": "In June 2004, I was laying out in the back yard with my infant son, looking up at the sky, and saying things like: that is a bird, that",
      "city": "elpaso",
      "shape": "changing",
      "date": "2007-04-27T00:00:00",
      "story": "In June 2004, I was laying out in the back yard with my infant son, looking up at the sky, and saying things like: that is a bird, that is a cloud, that is a plane, that is a bird, that is a...well what is it, as soon as I realized that it was something that needed photographed, I grabbed up my infant son and ran into the house to get my video camera, I figured it was that important.  I set it up as fast as I could, the object had moved much further than I had initially anticipated it moving, but I did get it in the sights of the camera for awhile, until I couldn’t hold the focus on it anymore.  The craft was orange and looked to be a concaved sphere shape, on one end, and pointy on the other, and was rotating around, and shape-shifting, it was heading to the North-West and there was for a brief moment, another object much smaller, flew right up to it, and away again, the smaller craft was traveling to the North-East, I cant imagine the altitude, but it was WAY up there by this time.  The smaller craft that comes right up to the larger craft and moves away without slowing, I never would have seen the smaller craft without the aid of the video camera, if I hadn’t been following the larger craft, I would never have seen the smaller one.  I did later record a passing airplane, to show perspective.  I have the video recorded to VHS if you want it. \t\t\t\t\t\t\t   \t\t\t\t \t\t\t\t\t\t The triangular/star end was shifting to a circle shape, that then ballooned out to a mirror of the concaved side, then back to a circle then to the star again, and back and forth, while always spinning around.  Wish I would have had my camera outside with me in the first place.  Could have gotten a lot better video, it went almost right over the house. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55988.html",
      "state": "IL",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f77",
      "summary": "Bright Flashing Light In Western Sky w/ Multi-Colored Lights",
      "city": "elpaso",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Bright Flashing Light In Western Sky w/ Multi-Colored Lights At approximately midnight on the night of 8/16/06, the morning of 8/17/06, I was preparing to go to bed for the night and was making my rounds making sure that the doors were secured.  While locking our westward facing sliding door I noticed a stationary and flashing light that seemed to be bigger and brighter than the surrounding stars.  The size and brightness appeared to be at least twice the size of stars near the position of the light. It appeared similar to a street light from two miles away.  The somewhat large size and the quickly changing colors are what cought my eye.  The light appeared motionless long enough to be video taped for several minutes.  The sky was partly cloudy with a half moon near the eastern horizon.  With the video camera zoomed in on the light it appeared diffused with a very bright center region with multiple flashes of red, green, purple, and white lights around the edge.  When I first saw the light I assumed that it was Venus but it appeared brighter and bigger with multiple flashing colors.  I will attempt to download the digital video in the near future.  The light was positioned west by north west from my position at approximately 25 degrees from the western horizon.  At approximately 12:20am on 8/17/06 I stopped recording and went in the house to go to bed with the light still in the same position.  I have assumed that the light was Venus but crop circles have been reported 60 miles west by north west of my position and thought that I should at least report my experience.  Total vewing time would be about 20 minutes.  At one point a commercial flight passed within the \"vicintiy\" of the light without making any noticable flight path changes.  Venus?  Or Intergalatic Crop Dusters????",
      "link": "http://www.nuforc.org/webreports/052/S52157.html",
      "state": "IL",
      "duration": "15-20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5fe9",
      "summary": "Two white objects  a mile apart viewed over El Paso and another, possibly a probe, detaching from them.",
      "city": "elpaso",
      "shape": "formation",
      "date": "2007-08-07T00:00:00",
      "story": "Two white objects  a mile apart viewed over El Paso and another, possibly a probe, detaching from them. My sister her boyfriend and I exited a museum in the downtown are proceeding to our vehicle south. I was looking at the moon cresent and noticed two whitelights or bright reflections equidistant from each other at the same height. At first I thought they were balloons. I quickly realized they werent when these two round shapes started to move southwest at a slow speed. After about seven minutes of floating in that direction, we noticed a flicker of reflection,1 as if it rolled from the top end of a cigar shaped craft at one end( round white shape), and made its way round and round until it dicsipated at the other end(round white shape). After it hit the other end, there was what seemed like a long bent foil piece falling down as the two white shapes continued to move southwest still equidistant at the same speed. I observed the falling object and compare it to bent foil. It almost as if someone had bent a piece of rectangular foil several times in equal sections, then slightly unbent it. This is the most accurate description  I can give if someone trys to imagine a falling slightly unbent piece of foil and the reflctions from the sun it gives off as it falls end over end. The object stopped halfway down from the other craft? and what I thought were the suns reflections turned to a slow pulsing glow. About one every 2-3 seconds.It is at this time that the object starte to move horizontally but slighty up and down as it proceeded to move out of view behind some building towards the Northeast end of the city. I got the chills when this happened yesterday. I also called the local news station, but they transferred me to someones voicemail. I couldnt focus my cellphone camera far enough to capture it. I had no camcorder or other camera with me. I also checked to see if it might had been the shuttle detaching from the ISS, but nope that was delayed. I hope that there were other witness because passerrs by seemed oblivious to the event.2",
      "link": "http://www.nuforc.org/webreports/057/S57231.html",
      "state": "TX",
      "duration": "12 to 15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b624d",
      "summary": "UFO with five army helicopters following it over FT BLISS.",
      "city": "elpaso",
      "shape": "cigar",
      "date": "2007-06-12T00:00:00",
      "story": "UFO with five army helicopters following it over FT BLISS We were on our way to a restaurant when my sister pointed out a silvery/white cigar shaped object in the sky.  It was still and somewhat blended into the partly cloudy sky, but you could make it out.  It stayed still in the sky for a very long while and even after we came out of the restaurant it was still there.  People were calling into the radio station that we were listening to talk and just rant about the strange object in the sky  So it was a fact that numerous people had seen this thing in the sky, but there were no military crafts around it.  Then the sun set and the objected move towards the military base where were stationed at even over our neighborhood.  There were about five ARMY HELICOPTERS surrounding it and the object was VERY LOW about the same level as the helicopters.  The object's light was glowing red, purple, yellow and blue and it kept changing colors.  It looked as if maybe the objected landed but im not sure. The object disappeared and then so did the army helicopters.  I saw this thing so close up it was something out of a movie with the helicopters following its every move.  There was nothing on the news or in the papers about this.  My whole family witnessed it not to mention all the people that called into the radio station. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56915.html",
      "state": "TX",
      "duration": "5hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b63ca",
      "summary": "Well about the 19 of december 2007 I saw a \"bright light\"moving toward me ,then to the right ,left, right and then solidifies  to a squ",
      "city": "elpaso",
      "shape": "fireball",
      "date": "2008-03-04T00:00:00",
      "story": "Well about the 19 of december 2007 I saw a \"bright light\"moving toward me ,then to the right ,left, right and then solidifies  to a squared form blue and dissapears...I dont know what I saw.  No sound  at all.  It was not a plane or helicopter.  All this happened on El Paso writh on front of Ft. Dix.  About two miles away from my home.  I dont know What I saw.  It was a yellow bright light and then turn to light blue and solid rectangular form and dissapear.   It took about o1:00 hours to be seen this in time.   Again I repeat I dont know what I saw?  But I know it was not from here.  To many things like no sound and the directions it took wich it is impossible for a plane to perform.  A helicopter with no sound it is also imposible.  From right to left no sound … Hope to hear from you. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61792.html",
      "state": "TX",
      "duration": "01:00hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b64bd",
      "summary": "At approximately 17:45 Hrs while swimming in an outdoor pool in El Paso,Texas.,I saw a white dot that appeared to be frozen in the sky",
      "city": "elpaso",
      "shape": "oval",
      "date": "2007-10-08T00:00:00",
      "story": "At approximately 17:45 Hrs while swimming in an outdoor pool in El Paso,Texas.,I saw a white dot that appeared to be frozen in the sky just like a star. I went inside the house and retrieved my 8 x 30mm binoculars. I focused the lenses, and I cold barely see the object: However, it appears that it had a round center with bicycle spokes, and the object did not move. Since the object was so far I kept losing it since my binoculars were hand supported. i found the object several times, and it appears to have move just a bit or perhaps it was the earth's rotation. I found the object at approximately 18:05 and this time I was looking at TWO objects instead of one.my wife witnessed the first object, and I went inside the house to tell her that a second object had appeared. My wife did not get to witness the second object because both disappeared. I am 65 years old,and my last sighting was in the late 1940's in the El Paso area.At that particular time the newspapers reported that they were Helium balloons., in the both sightings I had to really focus my eyes in order to identify the objects. The objects did nothing. I hope that you can notify someone in the El Paso,TX area who has the right knowledge and equipment since this incident happened in a clear and sunny day. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58615.html",
      "state": "TX",
      "duration": "20 MIN."
    },
    {
      "_id": "64d005f478aba2ec5a3b69f9",
      "summary": "Group of 19 small, white bright objects traveling around larger white object seen in El Paso Texas skies.",
      "city": "elpaso",
      "shape": "oval",
      "date": "2007-04-27T00:00:00",
      "story": "Group of 19 small, white bright objects traveling around larger white object seen in El Paso Texas skies. The location and weather:  Above BIGGS Airfield, El Paso, TX. It was a beautiful clear day, no clouds and around 78 Fahrenheit. Description: One large white object, oval and moving very slowly towards the mountains.  Around the large oval object were about 19 smaller, objects looming around the larger object.  There was a very big difference in size between the larger object and the other smaller ones. The large one was very easy to see.  The smaller ones were very small and spread out.  With much difficulty we were able to count 19 of the smaller ones. Their shape:  The large one had the shape of a jellyfish oval on top and flatter on the bottom with shaded area on bottom.  The small objects were bright white specks such as a star might look in the daytime.  However, these were not stars.  They were spread out around the white object and stayed around it for 5-10 minutes.  After that, we were only able to see the bigger object and no longer saw the bright specks anywhere. There was air traffic in the area, bith civil and air force. Our background:  First observer = wife; educator in school district.  Second observer=husband; real estate.  Third observer = 7 year old son; 2nd grade student",
      "link": "http://www.nuforc.org/webreports/055/S55760.html",
      "state": "TX",
      "duration": "8 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b702b",
      "summary": "There was a flash and it vanished...",
      "city": "elpaso",
      "shape": "fireball",
      "date": "2008-03-04T00:00:00",
      "story": "There was a flash and it vanished... I was with my high school baseball team in El Paso Texas. We were in the middle of a game and I happened to look up into the sky. I noticed a bright green light, it resembled a falling star. It was traveling very fast in towards the ground. It only lasted about 3 seconds then it turned to flames and immediately dissapeared. Less than a minute later, three jets which looked to me like military fighter jets, came up from about where the light had been and branched in three directions. One went straight, one went to the right and the other to left. I never saw the planes again. 4 other players along with myself witnessed all of the above. I'm not sure if any spectators noticed what was going on. I'm not sure if it was a UFO or just an honest trick of the eye. None the less, it was strange.",
      "link": "http://www.nuforc.org/webreports/061/S61907.html",
      "state": "TX",
      "duration": "about 3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b712b",
      "summary": "Delta-shaped metallic object observed for about a minute, and then disappeared.",
      "city": "elpaso",
      "shape": "other",
      "date": "2007-08-07T00:00:00",
      "story": "Delta-shaped metallic object observed for about a minute, and then disappeared. Report on UFO Sighting 18 July, 2007, 12:45 P.M. M.D.T. El Paso, Texas  \tAt approximately 12:45 P.M. local time on July 18, 2007, I was riding my motorcycle north on Hueco Tanks Road in far-east El Paso County, Texas. Visibility was unlimited to the north, ahead of me. The sky was perfectly clear with no clouds visible in that area at all. About forty degrees above the horizon and slightly to my west I saw a flat, disk-shaped object. It appeared to be immobile, and that is what attracted my attention. It was precisely on the glide-path to El Paso International Airport, and at first glance, I assumed it was a traditional aircraft. But after watching it for perhaps five seconds, I decided that that was not the case: it did not appear to be moving, though I cannot swear to that, since I myself was traveling at sixty miles per hour. Its shape—a disk, flat top and bottom and squared off at each end, like three quarters stacked atop one another—precluded the possibility that it was any aircraft with which I am familiar. \tI observed this craft for perhaps thirty seconds from this perspective: edge-on. Then a startling thing happened: the craft banked to the left about eighty degrees and presented me with a virtually perfect view of its top surface (or perhaps its bottom surface). Still it did not appear to be moving horizontally. My vision is perfect, conditions were perfect, and I was able to get a crystal-clear sighting of this object. It was delta shaped, coming to a point at one end and flat at the other. It was not an equilateral triangle: the two sides leading to the point were somewhat longer than was the third side, by perhaps twenty-five percent or a third. In simple terms, it looked like an arrowhead. It was metallic, resembling what I can best describe as brushed stainless steel or aluminum. In other words, it was reflective and shiny, but not brilliantly so. There were no indentations or irregularities whatsoever on its perimeter. I saw no ports or evidence of openings of any kind. There was nothing to suggest any leading aerodynamic edges to indicate wings. It was a very simple, delta-shaped object with three flat sides forming its perimeter. \tSafety dictated that I glance down at the road to make sure I was still in my lane. This consumed only a fraction of a second. When I looked back toward the object, it was gone—just gone. Whether it disappeared or flew away at high speed I cannot say. I heard nothing. One fraction of a second it was there, and the next fraction of a second it was not there. If it did in fact fly away, it must have traveled at immense speed, because I could see for many miles in all directions. I scanned the sky thoroughly for quite some time, until I was convinced it was truly not there. There are some mountains in this area, but they are not large, and the object was far too high in the sky to have been obscured by any of them. That is, in my opinion, simply not a possibility. I observed the object in its banked position for perhaps fifteen seconds. As to its distance from me, that is very hard to say. I would estimate that it consumed three or perhaps four solar diameters from my perspective: similar to holding three stacked quarters between your fingers at arms length. My gut feeling is that it was quite close, because I saw it in such great detail. If it had been far away, atmospheric haze would have obscured some of that detail. I could literally see the degree of polish on its surface. This afternoon, 19 July, I called Air Traffic Control at El Paso International Airport. I spoke with an air traffic controller, asking him if anyone had reported anything unusual on radar at the time in question. He told me that no one had submitted a report, but then he went on to virtually confirm my sighting. I made no mention at all of the fact that the object I had seen had disappeared—he mentioned it. He told me that even if someone had seen something, IF IT HAD DISAPPEARED, they probably would have ignored it and not submitted a report. This seems to me to constitute some degree of confirmation. I am fifty-seven years old, a college instructor of Political Science, and had never before seen anything that I would consider a UFO. Frankly, I did not believe that they existed, though I was intrigued by the evidence. I will admit that since childhood, I have believed that we are not alone in this vast universe. But I never believed that we had been visited. I believe it now. \t\t\t",
      "link": "http://www.nuforc.org/webreports/057/S57731.html",
      "state": "TX",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7414",
      "summary": "Bright sphere, flashing light, changes in intensity and patterns.  Not consistent with weather balloon.",
      "city": "elpaso",
      "shape": "light",
      "date": "2008-02-14T00:00:00",
      "story": "Bright sphere, flashing light, changes in intensity and patterns.  Not consistent with weather balloon. A bright sphere was located in the sky near numerous contrails (314838N 1062222W).  The sphere emitted a light that changed in intensity, flashed in different patterns continuously.  The object looked to be somewhere between 35k and 40k feet (above contrails) and was moving at approximately 100-150 mph to the East/Southeast.  It stayed at approximately the same altitude for about 10 minutes before it descended to about 20k before it disappeared. I have seen weather balloons before and this object was not consistent with one.",
      "link": "http://www.nuforc.org/webreports/061/S61565.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b77b4",
      "summary": "THIS IS THE THIRD TIME AT THE SAME PLACE AND IN THE SAME TIME(7:45 P.M.). OVER THE MILITARY TERRITORY (FORT BLISS) HERE IN EL PASO TEX",
      "city": "elpaso",
      "shape": "changing",
      "date": "2006-07-16T00:00:00",
      "story": "THIS IS THE THIRD TIME AT THE SAME PLACE AND IN THE SAME TIME (7:45 P.M.). OVER THE MILITARY TERRITORY (FORT BLISS) HERE IN EL PASO TEXAS. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51117.html",
      "state": "TX",
      "duration": "27 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b77f5",
      "summary": "I took a picture of the mountain; later noticed there was a weird object in the picture.",
      "city": "elpaso",
      "shape": "unknown",
      "date": "2007-08-07T00:00:00",
      "story": "I took a picture of the mountain; later noticed there was a weird object in the picture. Basically what happened was me and my friends went in the middle of the desert where we always go and took random pictures. The next day I decided to look at the pictures and noticed that in one of them there was a weird black object that caught my attention. I have no idea what on earth it is and wish I had someone that could enhance the image. When the picture was taken I didn’t notice anything because the sun was right there blinding me. At the same time I didn’t really pay attention. I have the picture with me. Again, I have no idea what this thing is in the image.  I could be wrong all together and it just might be a bug or a weird angle. Whatever it is, it really caught my attention... This is a possible case, or nothing at all. That I leave for you to decide.",
      "link": "http://www.nuforc.org/webreports/057/S57942.html",
      "state": "TX",
      "duration": "1"
    },
    {
      "_id": "64d005f478aba2ec5a3b8131",
      "summary": "Bright light deep in space moving very fast",
      "city": "elpaso",
      "shape": "unknown",
      "date": "2009-01-10T00:00:00",
      "story": "Bright light deep in space moving very fast Not sure time & date I was in  bootcamp in a fox hole looking up I watched a light come in site from the right moving to the left it was deep in space there was a lots of stars in the sky this light was deep in space, I fires thouth it was a sattel light I watched for 10=15 mintes It went out of site. Then some time later It came back In site this time it came from the left moveing to the right. Please let me know If this was reported by any-one eals ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67658.html",
      "state": "TX",
      "duration": "30min"
    },
    {
      "_id": "64d005f478aba2ec5a3b85bc",
      "summary": "Two objects in sky over El Paso, Texas",
      "city": "elpaso",
      "shape": "teardrop",
      "date": "2008-10-31T00:00:00",
      "story": "Two objects in sky over El Paso, Texas UFO sighting El Paso, Texas August 14, 2008 @ approximately 8:12 PM MST   At approximately 8:12 pm MST, I and my step-son were heading north on Vista Del Sol Road in east El Paso, Texas on August 14, 2008. I looked up into the sky as I was driving and saw two objects about a half a mile in front of me land distance. I was just coming to the intersection of Vista Del Sol Rd. and Lomaland Rd. to a red light. It was dusk (almost dark) and their was a large thunderstorm coming in from the north. I watched the objects as I was stopped at the stop light. There were two dark (blackish/dark gray) objects floating (best description) across the sky. They stayed the same distance a part as they traveled. They were moving sort of towards the thunderstorm, perpendicular to Vista Del Sol. There movement reminded me of the gyrocopter from the movie the Road Warrior. But they were not gyrocopters I don’t think. Their size in relation to their altitude in the sky ruled that out as did their staying the same distance from each other. They sort of looked like they were being towed by something that wasn’t there and they were just floating behind. They had no lights and made no sound that I could hear. They didn’t appear to be moving that fast. I can not say how high in the sky they were but they didn’t appear to be to high. As if a balloon at the edge of your sight or a low flying helicopter or plane but not low enough to see detail.. They appeared to be sort of (aerodynamic motorcycle not German WW II) helmet shaped with some sort of “foundation” that protruded around the base. They had other protrusions but it was dark so you couldn’t make out any detail. It was weird.  I turned right on to Lomaland so I could continue observing them. They appeared to start moving at a faster pace as they were getting nearer to the thunderstorm. This is based on the speed they were going at the stop light and where they were in the sky as I proceeded up Lomaland. I wanted to see if other folks thought they were UFOs so I pulled into the first apartment complex on the right. A young man about 14years old was there in the parking lot and I pointed at them and said “Do you see those UFOs?” He looked up into the sky and his jaw immediately dropped. He turned and ran towards the apartments yelling at his companion that there were UFOs. I drove another 10 or 15 feet into the apartment complex because I saw another guy looking right up at them. I said to him, “You see those UFOs right?” and he said, “Yes I do. I wish I had a camera.” I explained quickly that I wish I had my cell phone with me. I pulled up another twenty feet and by this time the objects were moving directly towards the thunderstorm. The thunderstorm was at least 20 miles off to the north. On the other side of El Paso International Airport. Within seconds one disappeared into the storm and then the other. I came home directly after the incident and as I was driving I didn’t see anything unusual in the sky. I did see  two planes or copters over the airport as I could see their lights blinking. The whole incident lasted maybe 4 to 7 minutes.  I am a 44 year old white male. I am a wildlife biologist. I have a Bachelors degree and will complete my Masters this Winter. I have extensive scientific knowledge and spend much of my time out of doors, in the desert, from March through October many times at night. I am familiar with the southeast and southwest US. My step-son is 13 years old. He is a nature lover and watches cartoons and plays video games. He will be in the 7 th grade this year.",
      "link": "http://www.nuforc.org/webreports/065/S65227.html",
      "state": "TX",
      "duration": "4 to 7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b89d3",
      "summary": "green disc with red tail trail traveling at downward angel for 6 sec.",
      "city": "elpaso",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "green disc with red tail trail traveling at downward angel for 6 sec. Was driving home on country road by stahmans farm at 11:00 position saw green disc with red tail traveling at sharp downward angle. Went behind trees or something once 6 seconds lapsed.",
      "link": "http://www.nuforc.org/webreports/066/S66833.html",
      "state": "TX",
      "duration": "6 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b8b62",
      "summary": "Cigar-shaped UFO moving south-southwest towards Mexico",
      "city": "elpaso",
      "shape": "cigar",
      "date": "2009-01-10T00:00:00",
      "story": "Cigar-shaped UFO moving south-southwest towards Mexico I was walking into the motor pool when I noticed something in the sky.  The motor pool is very near El Paso airport, and I have an interest in aircraft, so I stopped to look at it.  It was traveling south-southwest in a sort of \"drifting\" manner.  It was brown, and \"cigar-shaped\".  I waited for its angle to change to determine if it was a helicopter (a common sight patrolling the border), but it's shape was too evenly \"cigar shaped\" so I was certain it was not a Blackhawk, and it seemed to lack the vertical stabilizer and wings of fixed-wing aviation, so I stood there and stared at it. It was not at a very high elevation, maybe 1000 feet above the ground (I'm not a trained aerial observer, so I can't gauge elevation at all), and it seemed to be just \"drifting\" over the border, like a dirigible, though it's path was even and consistently south-southwest. I pointed it out to some of my comrades as I was seeing it, but they apparently didn't see it.  I lost track of it when I had to get back to what I was doing. ((NUFORC Note:  Witness indicates that date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67502.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bb7",
      "summary": "Light's in Triangle Fromation",
      "city": "elpaso",
      "shape": "disk",
      "date": "2008-08-12T00:00:00",
      "story": "Light's in Triangle Fromation I was working the second shift at Levis Strauss and was lunch time 8:00 pm MST. I noticed a group of people in the front side of the building looking towards the Western part of the sky over the Franklin Mountains and noticed 3 blinking lights in a triangle formation. I witneesed 1 of the lights move up and then go back down into the formation. Then they all moved in unison. The lights were there for roughly 20 min when fighter jets came from the southwest and the lights moved away in remarkable speed. As the jets passed by and left the lights came back in the same triangle formation. My wife stated the local news caught footage of this, and did identify them as UFO's. A day later they came back with the same story and apologized to the people for the misunderstanding of the report, and stated the military was conducting weather experiments. I would like to know if anyone else witnessed this. Thank you.. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65039.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ce7",
      "summary": "Bright light seen hovering over the western skies of El Paso, TX follwed by smaller lights.  ((NUFORC Note:  Star??  PD))",
      "city": "elpaso",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Bright light seen hovering over the western skies of El Paso, TX follwed by smaller lights. Saw one bright light hovering over the western skies of El Paso, TX, disappeared after 10 to 15 minutes then saw smaller colorful lights (blue and red) moving diagnoly were the place of the bright light was before for about 5 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  Star??  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65645.html",
      "state": "TX",
      "duration": "45 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b91c7",
      "summary": "Floating lights disappear into night sky",
      "city": "elpaso",
      "shape": "formation",
      "date": "2009-01-10T00:00:00",
      "story": "Floating lights disappear into night sky I was driving down Edgemere between Lee Trevino and George Dieter when I noticed a group of lights in the sky facing North by Northwest. These lights covered the distance that about 4 to 5 commercial jetliners would have covered and constantly made different patterns.  I got out of my car because i couldn't believe my eyes.  I called everyone in my cellphone as quickly as I could but no one answered until it was all over.   The floating lights, because that's the only way I can describe them, stayed close together. They finally formed a straight line with one of the dots leading them all and they drifted slowly into the overcast night.  They disappeared as they drifted up and away from me and in an instant these lights were gone.  It was strange, like if it was all a dream.  I hope someone else saw because I don't want to feel like a crazy person. Thanks. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67187.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9963",
      "summary": "Bright white light along the side of mountain, that changed shape and cast a huge glow around it.",
      "city": "elpaso",
      "shape": "changing",
      "date": "2010-04-13T00:00:00",
      "story": "Bright white light along the side of mountain, that changed shape and cast a huge glow around it. Location: I was in the East side of El Paso, TX looking towards the West. The objects were just behind the mountain ridge on the west side. So it was on the other side of the ridge and down a long the side of it just slightly out of my sight. The El Paso ridge is for the most part barren and too steep for anyone drive on. Only helicopters could get to where the lights were located. Description: I could not see the craft itself, but the light coming from it was extremely bright. In order for human technology to reproduce how bright it was, it would need to be a large collection of flood lights in one place. I could just see the very edge of the light source, before the shape of the light changed and appeared to actually be two craft crossing paths over and over again. As the lights moved around, it would cast a lingering haze on the clouds nearby that would resemble a lightning strike in the sky (the light did not flutter though like lightning does, it was constant). The color was pure white, this never changed about it. There was no blinking lights that would suggest man made craft. I live nearby an airport, and have become very used to identifying different craft in the dark. None of our craft can produce such a bright light that far away. I see this ridge every night at the same time, it has never been there before. So these lights were probably not caused by any sporting event (also why would you have a sporting event at 1:45 in the morning?)",
      "link": "http://www.nuforc.org/webreports/074/S74768.html",
      "state": "TX",
      "duration": "unkown"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e0f",
      "summary": "unmoving object hanging in west texas sky.",
      "city": "elpaso",
      "shape": "oval",
      "date": "2009-05-12T00:00:00",
      "story": "unmoving object hanging in west texas sky. i  I spotted the object shortly after the sun passed blow the horizon. I was looking at the El Paso Star through my binoculars and noticed 2 objects silhouetted aprox. 2 mils above the horizon, at a magnetic azmuth of 275 degrees (west). one of the obeject turned out to be an airplane, and continued to watch the other object believing it to be an airplane also. After the object hadn't moved or changed for 5 min i called my wife out to look. she whatched it for a few minutes and i continued to watch till darkness hid the silhouette. the object didn't move change shape or size, and hung in the air the way man made things don't. I am a US Army veteran.",
      "link": "http://www.nuforc.org/webreports/069/S69710.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b9dfe",
      "summary": "4 UFO's  hovered and moved side to side, up and down and glowed. not like any man made object, and dissapeared into thin air",
      "city": "elpaso",
      "shape": "teardrop",
      "date": "2010-06-23T00:00:00",
      "story": "4 UFO's  hovered and moved side to side, up and down and glowed. not like any man made object, and dissapeared into thin air Me and my wife were at the playground on post and we were sitting there when my wife noticed a roundish shape floating upwards, initialty we taught it was a weather balloon and it was not as it stopped at 11 O'clock to left of the half moontowards the north east, and 3 more appeared 2 on the the right of the moon bearing east in a verticle formation about 2 O'clock, and there was 1 towards the north at 10 O'clock all by itself.  they hovered and then they would move slowly and sideways, not like a normal or military plane let alone a balloon.  This was clearly a UFO sightting. after it hovered for a while the one at 11 O'clock started to move west towards our direction and was moving in circular patterns and snake like/or \"S\" and not like our common aircrafts, and then we witness it just simply dissapeared in to thin air along with the other UFO's that where there and they made no sound at all.  They all dissapeared at around 17:45.",
      "link": "http://www.nuforc.org/webreports/075/S75848.html",
      "state": "TX",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e40",
      "summary": "Yellow/orange light floating back and forth in el paso's westside",
      "city": "elpaso",
      "shape": "fireball",
      "date": "2010-06-10T00:00:00",
      "story": "Yellow/orange light floating back and forth in el paso's westside While driving to the gas station, I looked up into the sky and I saw a very strange light. It was yellowish with a little orange. It was moving backward and foward. It didn't make a noise nor the light was blinking. After about 5 or 8 seconds it disapeared.",
      "link": "http://www.nuforc.org/webreports/075/S75682.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f73",
      "summary": "((HOAX??  No date provided))  3 lights form triangle in el paso texas",
      "city": "elpaso",
      "shape": "triangle",
      "date": "2009-06-09T00:00:00",
      "story": "3 lights form triangle in el paso texas well i didnt know that i was seing something diferent at first un till i noticed that it was moving slower than a plain it looked as if it was waiting looking for something it was odd to see something like that i was having  a beer outside and was buzzing so i went inside to get my friend to see if he could see it too and he told me that it was a plain but then he noticed that it stayed at one place then move slow ly to  another i dont know how far it was  from the place we saw it it looked no biger than a pack of tick taks it was a triangle 3 lights forming a triangle and they mooved onto diferent directions too but they would keep a triangle shape when they got together. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70125.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1ab",
      "summary": "6 flying cigar shape ufo's out side of El Paso,TX",
      "city": "elpaso",
      "shape": "cigar",
      "date": "2008-07-05T00:00:00",
      "story": "6 flying cigar shape ufo's out side of El Paso,TX",
      "link": "http://www.nuforc.org/webreports/064/S64082.html",
      "state": "TX",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1f5",
      "summary": "Cluster of lights over western Franklin Mountain Range in El Paso Tx, within seconds diamond shaped blue light formation appearing.",
      "city": "elpaso",
      "shape": "changing",
      "date": "2009-03-19T00:00:00",
      "story": "Cluster of lights over western Franklin Mountain Range in El Paso Tx, within seconds diamond shaped blue light formation appearing. I am a twenty six year old Army Spc. stationed at Ft. Bliss, TX.  My Fiance is a twenty five year old accountant major studying in her final semester at the University of Texas in El Paso.  My friend is a twenty year old Army Spc. stationed at Ft. Bliss as well.  My fiance and I were at this friends apartment in central El Paso between the hours of 1830 and 0200.   The electricity in El Paso was disrupted due to a vehicle collision with a power transformer approximately around 0015.  Clear skies with stars brightly visible with a low smoggy haze in the south western end of El Paso.  We stepped outside to determine if other neighboring apartments had lost power along with my friends apartment when my friend noticed an unknown number of white/yellow lights traveling across the Franklin Mountain range above the western end of El Paso.  Pointing our attention to the western skies of El Paso, my fiance and he both witnessed the cluster of lights disappearing over the mountain traveling east.  I did not witness the lights due to a highway sign obstructing my exact view.  Not able to see the lights in the western skies I turned my attention directly to the skies above me and on an angle looking towards the east.  I then witnessed four dull blue/white balls of lights in a diamond shape pattern approximately two to three miles above me traveling east to west at an unknown high rate of speed.  The pattern of lights then slowed and came to a stop directly above me.  At that time I grabbed my fiance's arm and pointed directly to the lights above us. She witnessed the formation as well.  The four lights then seemingly holding its pattern turned directly straight to the ground the forward light now at the bottom of the diamond (creating the pattern of an upside down diamond), this all taking maybe two to three seconds. It within seconds of repositioning itself continued moving towards the west at a high rate of speed. As the pattern was heading west, the far left light darted directly out of the formation to a dis! tance ap proximately a half of one mile to the north east and then snapped back into formation within one second. The formation continued to the west until it was no longer visible. My friend did not witness these lights as he was still scanning for the lights that travelled across the Franklin Mountains. Five to ten minutes passed while we continued watching the sky above us as well as the skies above the mountain range. My friend then witnessed and called our attention to a dull dark orange ball that was only noticeable due to the street and parking lights below it. It was approximately the size of a seventy five centimeter exercise ball hovering one hundred yards above the ground, two hundred yards to the west of where we were standing, above a one story building. The ball darted slowly one or two feet to the left, then up one or two feet, then right one or two feet, it then slowly traveled away from us moving west at an very slow speed, possibly three to five miles an hour, until it was no longer visible due to the smoggy haze or beyond the street lights that were illuminating it. We continued watching the sky for an additional ten minutes until retreating back inside the apartment and out of the forty five degree night air.",
      "link": "http://www.nuforc.org/webreports/069/S69018.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba305",
      "summary": "Triangular blueish lights seen over El Paso, TX.",
      "city": "elpaso",
      "shape": "triangle",
      "date": "2009-06-09T00:00:00",
      "story": "Triangular blueish lights seen over El Paso, TX. Three lights in blueish color were seen in El Paso, TX roughly at 2300.  Lights were seen for a short time above cloud cover.  I was unable to see the actual shape but the lights did reflect threw the clouds . The lights were shaped in a trianular pattern.  As I looked up i noticed the lights but heard no engine noise and did not see a red blinking light associated with commercial or military aircraft. When I turned away the lights travel towards the north west so quick that I lost visual contact with the lights in the clouds, I tried to locate them again in a cloud break but was unable to see it again. I have no type of video or photograph item with me. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70253.html",
      "state": "TX",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba4b4",
      "summary": "3 unknown objects moving across the el paso sky",
      "city": "elpaso",
      "shape": "other",
      "date": "2009-08-28T00:00:00",
      "story": "3 unknown objects moving across the el paso sky Around 10pm and 10:15pm my husband and I were sitting in our backyard talking.   As I looked up to see the big bright star, I noticed that there were three objects moving in a straight line same distance away from eachother and same pace.  The objects that I saw were as bright as a dull looking star.  I couldn't really see the shape because they were far.   I waited a few seconds before I told my husband because I wanted to make sure they were moving and that I just wasnt seeing things.  I pointed them out to him and we continued to watch them go.   I whistled at my daughter to come out and when she did.  I pointed them out to her by this time they were above my home, they were pretty high up, we thought it was impossible for them to be planes.   We couldn't see them anymore after they moved towards the front of our house.",
      "link": "http://www.nuforc.org/webreports/071/S71907.html",
      "state": "TX",
      "duration": "2-3 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3ba650",
      "summary": "2 lights in south east sky over El Paso, TX.  ((NUFORC Note:  Possible landing lights on approaching airliners??  PD))",
      "city": "elpaso",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Hello, Tonight I went for my nightly walk and I had a sighting of  2 lights in south east sky over El Paso Texas at 8:06PM, 10/23/08.the sighting was only for 20 second’s or so before the lights  faded out at the same time. The white lights were about the same size as the nearby stars but much brighter. They didn’t move at all, the brightest one was top left the other was bottom right about half inch apart, 45 degrees angle. This isn’t the first time I’ve seen lights in the south east sky over El Paso. About a year ago ( November) around the same time 8 to 9 PM. I’ve seen a very bright light about the size of a green pea, flared out with a black object in the middle.The light lit up the surrounding night sky and shrink down to a very small round white object streaked off . I thought I should file a report.. Thanks for your time.",
      "link": "http://www.nuforc.org/webreports/066/S66404.html",
      "state": "TX",
      "duration": "3 secands"
    },
    {
      "_id": "64d005f478aba2ec5a3ba96d",
      "summary": "When I lived in El Paso TX, my roomates told me about this light that they see repeatedly out the window.",
      "city": "elpaso",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "When I lived in El Paso TX, my roomates told me about this light that they see repeatedly out the window. They showed me one night, and after that, I would see it as often as they would, my roomates told me that there is no air ports or anything like that that far away. We where on the east side of El Paso looking straight south into Mexico, the object was always a super bright shining light and looked to be 150-300 miles away, and always slowly came to the surface of the earth, it took about one minute for it to do this.   Some nights I would also see it multiple times. and one night I saw the object fly up really fast in to the air then disappear. sometimes the light would have a red tint to it. ((NUFORC Note:  We cannot identify the object, of course, but we have no reason to believe that it was a genuine UFO.  Date in 2009 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78968.html",
      "state": "TX",
      "duration": "45 seconds repeatedly"
    },
    {
      "_id": "64d005f478aba2ec5a3ba9c6",
      "summary": "white light, zoom away",
      "city": "elpaso",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "white light, zoom away I was on my way to work as usual at about 3 am. Every morning before I get into my car I look at the sky since I like looking at the stars. You could see them pretty well that early in the morning even with all the city lights.  It all seemed very normal. While i was driving a cop started following me. I looked in the rear view mirror to look at him them back at the road. That's when i noticed the star.  It seemed like it moved. It wasn't a shooting star or a meteor . It was just a static white light, no pulsing, no color changes, and no movement. While i was looking at it, it zoomed away.  This movement didn't look normal. The light smeared across the sky. The best way i can describe it is the way the stars look in movies when they go light speed. While it zoomed away the color and the shape were the same just elongated. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78339.html",
      "state": "TX",
      "duration": "about 2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bab45",
      "summary": "Several different shape ufo sightings in the past few months.",
      "city": "elpaso",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Several different shape ufo sightings in the past few months. The last sighting I had was at my friends house far away from my house (40+ miles away) and it was the same thing I have on video which made me and my friend think it was following me.  The best way to describe this one is the shape of a couch pillow but metallic and it spins at a certain rate all the time. It moves in all directions and the wind has no effect on it but still spins at the same rate. I have this thing on video three different times.    Ok now for the best sighting, this thing had the shape of the Star Trek symbol but my best description of it would be if Batman had a jet plane this thing would be it.   I saw it in detail with my binoculars and could not believe what I was seeing, a batwing jet black with an oval tanish color body attached to the wing, no noise, no markings, no means of propulsion, stealthy.   My other sighting was right above my house on a Saturday noonish time.  I had just walked out of my garage to meet to friends and I looked up an! d there was two disc shaped black objects sitting still in the sky, wind was blowing some but they stood exactly still, both friends saw them also and then they just disappeared.  I also have what looks like a crop circle in my backyard in the grass.  My girlfriend who has seen the metallic pillow and I woke up one morning and we both said to each other it felt like we both had been in a very deep sleep, maybe like being tranquilized, one I have never felt before and the strange thing about it is we both told each other at the same time.  Polygraph me.",
      "link": "http://www.nuforc.org/webreports/078/S78176.html",
      "state": "TX",
      "duration": "8-10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0cb",
      "summary": "Yellow ball of light following a commercial airliner.",
      "city": "elpaso",
      "shape": "light",
      "date": "2010-08-24T00:00:00",
      "story": "Yellow ball of light following a commercial airliner. At approximately 9:20 p.m. on July 25, 2010, in El Paso, TX, I was on my apartment balcony observing an incoming commercial airliner flying from the east to west as it was making a descent to land at our local airport.  The night sky was clear, other than the clouds in the north.  It is difficult to judge the airplane's altitude, though I could see its underside in detail.  As the plane flew directly above my apartment complex, I noticed a yellow ball of light dart into a position behind the plane's tail where it began to follow the plane for about 4 seconds. The ball of light was about the size of the airplane's tail section.  The light did not seem to produce a noise, though it was difficult to know since I could only hear the sound of the plane's engines.  After it trailed the plane for a short time, the ball of light veered off in a northerly direction, and at times flew erraticly (suddenly slowing down, then speeding up). I estimate the light was traveling at least twice as fast as the plane. I continued to track the ball of light until it faded into the clouds in the north.  It was obvious to me that this ball of light was not another airplane, considering it was not displaying blinking lights, nor was it at a safe distance between the plane I was observing. This incident has great significance to me, especially having read about the increase in \"fireball\" reports recently.",
      "link": "http://www.nuforc.org/webreports/077/S77071.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bb76a",
      "summary": "The only thing I can say here is that yes, we are being watched.",
      "city": "elpaso",
      "shape": "unknown",
      "date": "2010-08-24T00:00:00",
      "story": "The only thing I can say here is that yes, we are being watched. This has happened several times in the past couple of months.  I have seen a craft in space sitting there then just take off (away from this plant)  I have seen the direction it goes.  At one point all I saw a bright light.  Then puff, it was gone.   In early July I saw a star just get bright then leave like watching a jet from behind.  Again, I saw the direct it took.",
      "link": "http://www.nuforc.org/webreports/077/S77238.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe3b",
      "summary": "On 10/28/2011 at about 21:00 hrs while running with my dog down the ditch road heading north, I observed in the west distant sky what s",
      "city": "elpaso",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "On 10/28/2011 at about 21:00 hrs while running with my dog down the ditch road heading north, I observed in the west distant sky what seem to be a red orb slowly changing from dim to bright, about every 5 seconds while moving. At first it was stationary but after 5 minutes it started to rise straight up then it changed direction going north for about 8 minutes moving extremely fast compared to the rest of the planes insight. Then it changed coarse again going back south but i seemed as if i made a type of turn because the brightness of the light increased and as it did a very dark blue light could be seen for about 2 seconds. After heading south for about 8 minutes it then stood stationary before rising again it then made a similar turn heading north were i could see the red light and blue light for a small period of time .It seemed to repeat this process several times for about 45 minutes . after this process it stopped in the south rising then slowing turn! ing to a very bright white with a small blue light then it headed north east at a fast pace in a nike tennis shoe sign .After that i could not see the strainge light anymore...",
      "link": "http://www.nuforc.org/webreports/084/S84988.html",
      "state": "TX",
      "duration": "45"
    },
    {
      "_id": "64d005f478aba2ec5a3bc569",
      "summary": "Silver orb floating over far westside of El Paso for over an hour",
      "city": "elpaso",
      "shape": "circle",
      "date": "2011-10-25T00:00:00",
      "story": "Silver orb floating over far westside of El Paso for over an hour We were on the far Westside of El Paso at my son’s baseball practice. The location of the ballpark allows for a panoramic view of the entire Westside.  At approximately 6pm I noticed a perfectly circular orb floating in the sky. It was reflecting the sunlight and was shining silver.  At first glance I thought it was a mylar balloon floating up into the sky but I kept watching and this orb was not moving. It was just sitting there in the sky perfectly still.  It did not deviate at all from its position or shape. The wind was blowing and this orb never moved, which led me to think this was something else entirely.  It was silent.  One of the other parents who were sitting alongside me noticed me staring up and asked what I was looking at.  I pointed the orb out to her and she commented on how it wasn’t moving as well. Before long all of the parents were looking at this thing.  As the sun began to set we noticed the orb getting darker and by 7:00 it appeared to be dark gray in color.   For about 1 ½ hours it sat perfectly still in the same exact spot, then it just disappeared.  We did not see it fly away or shoot off. It just disappeared. All of us were left scratching our heads. Very strange.",
      "link": "http://www.nuforc.org/webreports/084/S84674.html",
      "state": "TX",
      "duration": "1 1/2 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8c2",
      "summary": "Objects in the El Paso Sky",
      "city": "elpaso",
      "shape": "light",
      "date": "2011-10-25T00:00:00",
      "story": "Objects in the El Paso Sky Event: At approximately 1300 hrs on 23 October 2011, my wife and I witnessed 6-7 objects to our north in the backyard of our El Paso home.  The objects were in a dispersed pattern with no apparent organization.  The only relationship the objects appeared to have was that they began disappearing at the same time.  The were fairly stationary, moving very little and after watching for approximately 8 minutes, 2-3 objects began to ascend into the sky.  The objects began fading after witnessing for 15 minutes and after 20 minutes they were no longer visible with the naked eye. Object Description: The objects were quite a distance away, perhaps about 10-15 miles away.  They appeared small, but again their exact size was hard to judge from such a distance.  They were very shiny almost appearing as aluminum foil floating in the air.  They were very brilliant as they were visible in the peak of daylight. Weather: The weather was clear, and I do mean clear, I did not count a single cloud in the sky.  The temperature was approximately 87F, with the wind blowing less than 5 knots from the east. Aerial Traffic: I witnessed multiple civilian aircraft going to and from ELP International flowing along their typical landing/departure pattern.  There was also an air show underway at Biggs Army Airfield, the air show was NOT visible from my home.  The craft in the sky were not parachutes, as they did not descend they remained stationary occasionally ascending higher into the sky.  They were also not aircraft flares as they did not descend.  Civilian transport aircraft even seemed to fly amongst the objects at one point to avoid the temporary flight restrictions over Biggs Army Air Field.",
      "link": "http://www.nuforc.org/webreports/084/S84740.html",
      "state": "TX",
      "duration": "15-20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9b1",
      "summary": "Two objects seen flying east then dissapeared",
      "city": "elpaso",
      "shape": "sphere",
      "date": "2011-08-07T00:00:00",
      "story": "Two objects seen flying easat then dissapeared there was two objects seen by me flying east  one's light was brighter then as the other flew around next to other they turned off..",
      "link": "http://www.nuforc.org/webreports/082/S82748.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bca53",
      "summary": "Circular light above clouds in circular pattern over El Paso, Texas",
      "city": "elpaso",
      "shape": "circle",
      "date": "2011-08-21T00:00:00",
      "story": "Circular light above clouds in circular pattern over El Paso, Texas We witnessed a white, circular shaped light rapidly running in a circular patterned.  The source of the light appeared to be above the clouds and showing through the clouds similar to the moon showing through the clouds.   The moon was nearby this light pattern.   The circular shape continued round and round for approximately 15 to 20 twenty minutes before it stopped at the 6 o'clock point on the circle and then vanished.  We did not hear any sounds from the area of the circuling light.   We did see a helicopter quite a distance away at a much lower altitude.   We also heard the sound of a jet aircraft on the opposite side of the night sky from the location of the light in question.  Our first instinct was the jet came from Biggs Field, which is part of Ft. Bliss.  We did not see any news reports regarding this sighting.  Surely someone other than us saw this light as well.",
      "link": "http://www.nuforc.org/webreports/083/S83247.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc68",
      "summary": "Observed a massive rectangular silent object with glowing red spears on either side about 150 ft off the ground for ten minutes",
      "city": "elpaso",
      "shape": "rectangle",
      "date": "2011-06-20T00:00:00",
      "story": "Observed a massive rectangular silent object with glowing red spears on either side about 150 ft off the ground for ten minutes Traveling in separate vehicles, my husband and I observed a massive silent rectangular shaped object travel over us forward, bank to the left and continue silently onward until we saw it move over the hills.  If we had a rock we could have hit it, it was so low. had giant glowing red spears on both sides from front to back.   No apparent windows.  No sound or means of propulsion.  It was about the size of two football fields end to end.  Appeared to be about 150 ft off the ground.  I am a currently disabled (MS) Nurse and my husband is an internationally recognized artist. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81829.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bce0f",
      "summary": "Strange Orb above El Paso.",
      "city": "elpaso",
      "shape": "oval",
      "date": "2011-06-03T00:00:00",
      "story": "Strange Orb above El Paso We were both standing in front of our house staring up at the sky looking for stars that don’t blink thinking that those are planets.   I went inside to get my telescope to check some of them out.  We first saw what most people describe as a satellite floating way up in the sky.   Then I caught a flash in the corner of my eye and I looked up at the constellation of the little dipper.  To the right of it we noticed what looked like a motorcycle headlight coming straight down at us at about the level that most airplanes travel only this object had no red or blue blinking lights like a plane usually does.  The object had a bright almost halogen look to it then turned around within two seconds and it had a red glow at the end of it.   Within two seconds it began to speed away straight up into space and became smaller and smaller.  Most aircraft travel from left to right or vice versa.   This object turned around and went straight up and in seconds was gone.  There were no c! louds in the sky.   We heard not one sound coming from it.   A few minutes later a plane passed in the same area and we could hear the engines.  To me I have only seen what they show us on television.  This looked like one of those Orbs that people talk about.   It raced away into space after I pointed at it.  It was so fast that I cant describe anything on this earth that moves the way it did.   This is not a hoax.  We know what we saw.",
      "link": "http://www.nuforc.org/webreports/081/S81583.html",
      "state": "TX",
      "duration": "Less than 5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bdda2",
      "summary": "Fiery balls falling from the sky over El Paso.",
      "city": "elpaso",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Fiery balls falling from the sky over El Paso. My husband and I were driving west on 375. He pointed at something in the sky. It was a fiery ball falling from the sky. We discussed how shooting stars aren't that slow and we watched it fall. Once it fell close to the surface it stopped moving and turned into a white light instead of flaming. It stayed in that position for about 30 seconds and then disappeared. As we started to exit 375 to get onto 601 we noticed 3-4 cars parked along the side of the road. People were outside of their cars pointing toward the mountain.  As my husband and I looked over we same the same fiery ball falling toward the mountain.  This time it split into 5 separate balls, each did the same thing as the first.  They fell until they were closer to the ground then hovered once they turned into a white light.  Stayed light that for a few seconds and then disappeared.",
      "link": "http://www.nuforc.org/webreports/093/S93708.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be066",
      "summary": "Giant red circle, shrinks into the sky.",
      "city": "elpaso",
      "shape": "circle",
      "date": "2012-07-04T00:00:00",
      "story": "Giant red circle, shrinks into the sky. i looked up and saw a giant red circle it flashed white once quickly and started shrinking into a smaller circle and went up into the sky i could still see it flashing red and white it continued to get a bit bigger and then went back into a smaller circle.  i watched it for like twenty minutes and then left.",
      "link": "http://www.nuforc.org/webreports/090/S90258.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb5d",
      "summary": "Strange circular aircraft in the sky",
      "city": "elpaso",
      "shape": "circle",
      "date": "2012-02-03T00:00:00",
      "story": "Strange circular aircraft in the sky My Husband and I were watching the air traffic from our courtyard at our home here in el paso.....we see all sorts of aircraft from airliners, jets, drones, by planes and helicopters.  But then we saw what looked like a white ball gradually cruising along at the same altitude west towards new mexico.  My husband ran and got our camera and managed to zoom in on this object… This first object was pretty low and upon zooming in on it we realized it was a ball of light with what looked two matalic objects on it.. one on top and bottom almost apearing disk shaped.... Then after a while it seemed to disappear and re-appear in the sky as it got further away.....shortly after that we came back outside and noticed four more of the very same objects flying around each other in zig zag patterns....it was very unatural to me and Ive never seen anything like these things...  These four seemed to be much higher and father away. we capture and focused on as many as we could w! ith our camera at that moment but they were very hard to focus on.....when those seemed to disappear in the sky a few friends stopped by and as we were showing them what we caught on camera....another apppeared in the sky going the same direction as the first.....we caught video of that one too.... The air traffic was very busy that day but this was nothing I have ever seen before.... There were no clouds in the sky except the cem trails from the passing just we get from fort bliss. These odd objects in the sky did not make any sound and seem to fly in a most unual pattern...my close ups reveal that this is not a plane of any sorts.",
      "link": "http://www.nuforc.org/webreports/086/S86969.html",
      "state": "TX",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3ba",
      "summary": "Triangles over the Golf Course",
      "city": "elpaso",
      "shape": "triangle",
      "date": "2013-07-14T00:00:00",
      "story": "Triangles over the Golf Course My partner and I lived in an apartment complex next door to the Lee Trevino Golf Course in El Paso Texas.  We would walk our dog on this golf course at night.  On this evening, we watched as several lit triangle craft appeared over the city lights.  The craft appeared to hover and then move swiftly either to the left or to the right.   Always they returned to the center of where they initially appeared.   We eventually got tired of watching this and went inside.  We never reported the event but we did keep a watch for these craft over the next few months.   We did not see them again. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100076.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3b5",
      "summary": "Flying Lighted Chevron over the night sky.",
      "city": "elpaso",
      "shape": "chevron",
      "date": "",
      "story": "Flying Lighted Chevron over the night sky. While living in El Paso, Texas, in 1969, we were outside in our front yard.   Suddenly, out of the south, a large Chevron shaped light appeared and grew steadily louder.   My brother, sister, cousin, and friend watched as it approached our house then went over the roof of our house.   We ran through the house and yelled at my mother and aunt that there was something flying over our house.   We all ran to the back yard and watched as this thing flew silently past the rooftops and then shot straight up into the night sky.  Not shot forward to the North, but rather straight up into the universe.   Odd thing is, my mother and aunt do not remember this incident, but the four of us kids (adults now) do remember it. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100078.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfdc7",
      "summary": "Between 6:32-6:45 PM on clear blue sky noticed white \"ball-shape\" object high in sky moving eastward as nearby airline headed west.",
      "city": "elpaso",
      "shape": "sphere",
      "date": "2013-06-02T00:00:00",
      "story": "Between 6:32-6:45 PM on clear blue sky noticed white \"ball-shape\" object high in sky moving eastward as nearby airline headed west. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98181.html",
      "state": "TX",
      "duration": "5-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bffd9",
      "summary": "Light headed north then south suddenly disappeared on the horizon almost instantly.",
      "city": "elpaso",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Light headed north then south suddenly disappeared on the horizon almost instantly",
      "link": "http://www.nuforc.org/webreports/101/S101609.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d10",
      "summary": "Very bright lights . In a form of a \"S.\"",
      "city": "elpaso",
      "shape": "formation",
      "date": "2014-01-10T00:00:00",
      "story": "Very bright lights . In a form of a &quot;S&quot; . El Paso.Tx New Years .  Me and my friend were looking at fireworks being shot a few streets down.  After about a minute, we saw a string of lights , almost looking like a \"S\" .  All lights were red and very bright .   They were flickering.   They were seen NorthWest of the sky.  I immediately called my mom and my brother and they witnessed it also .  One light broke away from the string and flew way high and stood there for a few seconds .  Then about 5 of the lights dimmed out slowly.   The remaining lights formed into a Three-Dots form and floated quickly .  I was amazed how fast they were moving .  This sighting is very similar to the one in Palacios,Tx .  Im still tripping out.  All this lasted about 2-3 minutes .",
      "link": "http://www.nuforc.org/webreports/105/S105851.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fb1",
      "summary": "Single round, reddish yellowish, greenish light in the sky which moved very rapidly and stood still, then moved again then stood still",
      "city": "elpaso",
      "shape": "circle",
      "date": "2014-01-16T00:00:00",
      "story": "I will be brief.  This is the third UFO I have seen so far, and all three in the last four months (speaking in terms of linear time).  I walked out of my house in the morning to get my cannabis which I had left in my car.  (I had not consumed any yet)  Being a winter morning, the sun had not come out yet.   I love to gaze at the stars and have been doing so since I was a child almost daily,  Sometimes for hours.  (Present age 28) I know the constellations and have and can distinguish stars from planets, plus I have taken some astronomy courses in college and stargazing has been a lifelong hobby.   I noticed a single round, reddish yellowish, greenish light in the sky which moved very rapidly and stood still, then moved again then stood still.  Then moved at a constant speed, then came to a complete stop and vanished slowly into the heavens, out of my sight.  It did not share any qualities that an airplane exhibits.   An airplane’s light flickers at a constant tempo and the movement is constant and CAN NOT come to a complete stop in the middle of the sky.   If I had a compass I would say the UFO came to halt at a perfect North.  I did not have a compass so I am basing my observations on the stars’ and the sun’s movements.  Make of this experience whatever resonates with your vibrations.",
      "link": "http://www.nuforc.org/webreports/106/S106233.html",
      "state": "TX",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c151b",
      "summary": "Strange star-like object hovering over El Paso mountains, almost hit car and swooped down below the road (on mountain) disappearing.",
      "city": "elpaso",
      "shape": "light",
      "date": "2013-10-23T00:00:00",
      "story": "Strange star-like object hovering over El Paso mountains, almost hit car and swooped down below the road (on mountain) disappearing. I was sitting outside at night with 3 other people in my backyard. It was around 10:40PM or so, nearing 11PM. From my backyard I am able to see a view of the El Paso mountains in the distance, and am able to see Transmountain Road, which is a long road that is a shortcut to get from the northeast side of town to the west side by cutting through rather than going around the mountain.  From our view you can see the headlights driving by from the cars in a certain area that drive by, but they are high up in elevation on the lower half of the mountain from the view we have. Two of us (myself and another) were sitting in the backyard facing away from the mountain, while the other two were sitting able to view the mountains and transmountain road, and one of them noticed this faint light above the mountains, she pointed and asked what it was, it was probably a hundred feet above or so, not sure but it was high up enough to look like a star, because that's what we thought it was. Thankfully, she didn't believe it was a star - and kept staring at it and suddenly told us it was moving, so we all turned to focus on it, it was so faint we didn't think anything of it for a couple of minutes except it was this hazy purple, it was the exact coloring if you stare at a black light, you can't really focus on it and it had this purple tone to it.  We thought there might be a cloud in front, but it was a clear night, the object was hazy. So trying to focus on it in the sky, we can begin to see this faint purple/blue light begins to slowly move, side to side, diagonally, in very unusual patterns at different speeds, and then it began to slowly fly behind the mountain, and as we watched it, for about 5 to 10 seconds it went out of sight.  We thought that was all there was to it, but we stayed looking, we all kind of wished it would come back, and we got our wish... It suddenly came back up and began to float down the mountain but it moves down in different ways, at first it went straight down and then diagonally, just erratic movements and it suddenly gets closer to the cars that are driving on transmountain, so we see this faint purple light get closer and closer to the cars and two of us are really scared that it will crash down, but the other two people with me tried to get out a really bad telescope of mine that didn't work properly - but hoping to be able to use it to see what this object is!  Then it suddenly pauses in front of one of the cars, almost like the object hit the brakes and it lights up so brightly I squinted, and we all just gasped in awe and fear. Then immediately it shot down below the road into the base of the mountain near an area that has no residential homes, it shot down from the right, then to the left and then out of sight. Being so scared we were expecting to see it come back up into the sky, maybe even fly over us but thankfully nothing.  We called into the non emergency phone line in El Paso to ask if anyone had seen strange lights, and they told us no. After that, a day later we went up to Transmountain to see if we could see anything below in the desert, and of course we found nothing unusual looking. I've seen in the mid 90's strange objects in the sky over Ft. Bliss (military base) area which is east of where I lived, objects that would blink and shine light onto the roof of the house in front of ours (without any sound, like a helicopter light should have), but never have I seen this black light colored object, erratically flying around near where a lot of cars drive back and forth 24/7, and if it was anything government made, we wondered why it would be so close to cars, seemed dangerous.  I just wonder if the drivers on Transmountain saw the object, because when it lit up so bright it seemed everyone would have been able to see it!  But it seems nobody noticed it but us that night, and we stayed out for many nights after that hoping to see it again but we haven't yet.",
      "link": "http://www.nuforc.org/webreports/103/S103296.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d2b",
      "summary": "This was not any type of Aircraft, it had a orange steady glow, and never faded out as do most meteors.",
      "city": "elpaso",
      "shape": "",
      "date": "2014-06-24T00:00:00",
      "story": "This was not any type of Aircraft, it had a orange steady glow, and never faded out as do most meteors. At or around 21:30 HRS. on 06/20/2014, while outside in my backyard with my dog, I observed a round brightly glowing object, flying at a high rate of speed from the east heading west.   I kept my attention on the object, thinking it could be a meteor entering the atmospehere.  Then I noticed that it was not fading out as most do, and had no tail.   As it streak over, there was no noise or blinking such as you would see with a plane with its navigational lights on.   It was large in size from where I stood; it was at least two to three inches in diameter and at a very great altitude.   I also observed how smooth and even its flight trajectory appeared to be.  I live in El Paso Texas on the eastside of the Franklin Mountains.  I watched the object until it was out of sight.  Very Amazing!",
      "link": "http://www.nuforc.org/webreports/110/S110466.html",
      "state": "TX",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c221e",
      "summary": "Local news KVIA reports blue light with fire being shot down to Earth.",
      "city": "elpaso",
      "shape": "oval",
      "date": "2014-04-18T00:00:00",
      "story": "Local news KVIA reports blue light with fire being shot down to Earth.  Sightings seen from El Paso to Albuquerque and as far away as Phoenix.   Reports state that witnesses could feel the ground tremble when fire hits the Earth.   This was breaking news to start the newscast... ((NUFORC Note:  We have amended the time above, to reflect an evening event.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108585.html",
      "state": "TX",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c38a2",
      "summary": "One bright object with three flashing lights.  Then it split into two.  It happened right after midnight on new year's eve.  I obtained",
      "city": "elpaso",
      "shape": "light",
      "date": "2015-01-07T00:00:00",
      "story": "One bright object with three flashing lights.  Then it split into two.  It happened right after midnight on New Year's Eve.   I obtained some video.",
      "link": "http://www.nuforc.org/webreports/116/S116385.html",
      "state": "TX",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3fda",
      "summary": "Missing time episode and two experiences of sleep paralysis.",
      "city": "elpaso",
      "shape": "unknown",
      "date": "2015-05-22T00:00:00",
      "story": "Missing time episode and two experiences of sleep paralysis. My experience was about missing time when I was living in El Paso, TX.  On December 3, 2014 I was sleeping and I woke up like other nights.  I saw the clock that is on my table near me and I saw that the time was 1:11am.  This surprised me a bit and decided to get up to go to the bathroom.  I’m quite sure (because I was awake) I was in the bathroom two minutes.  When I return to bed, I look at the clock and it was 2:43am. I missed 1 hour 32 minutes.  I know I will not remain asleep in the bathroon because I remember everything I did.  This is very disturbing to me because I find no explanation.  Sometimes I can not sleep thinking abóut this and trying to find what happened to me. About seven years ago, I was living in Fort Worth, TX, and I had an episode of sleep paralysis.  That morning, when I woke up I could not move.  With great effort I could look at my husband who slept beside me.  I tried to scream to wake him and could not. I tried to calm down, closed my eyes tightly and when opened I could already move. Another episode I think was a sleep paralysis as well happened to me about five or six years ago (in Fort Worth, TX)  When I woke up this morning, my bed sheets were clenched as if some unknown force were grabbing the covers and pulling them down.  In this three experiences, I do not remember seeing anything unusual in the room, like lights, shadows, etc.",
      "link": "http://www.nuforc.org/webreports/118/S118971.html",
      "state": "TX",
      "duration": "1:32"
    },
    {
      "_id": "64d005f478aba2ec5a3c407d",
      "summary": "Bright Spheres Of Light Observed Flying Formation in Access of 2,500 mph",
      "city": "elpaso",
      "shape": "circle",
      "date": "2015-05-08T00:00:00",
      "story": "Bright Spheres Of Light Observed Flying Formation in Access of 2,500 mph 5 May, 2015. On 6 April, 2015, (Monday) at approximately 20:15 hrs, in El Paso, Texas, while sitting on my porch, I observed approximately 5 bright yellow/orange bright spheres of light (orbs) moving in access of 2,500 mph across the sky.  The brightly colored orbs did not glow and were approximately the four miles to the southwest of my location, over a suburban neighborhood, and four to five miles south of the El Paso International Airport at approximately 2,000 feet above the ground.   The orbs were about the size of a Volkswagen beetle and were flying horizontal to the horizon in formation.  As I was sitting down at the time of the observation looking towards the SW; the orbs appeared from behind a tree on my left and in approximately 2 seconds disappeared behind a tree on right and were moving from the SE to the NW.   I did not see or hear any aircraft flying in the vicinity of the orb sighting for at least another 15 minutes. I have been in the aviation arena for over 46 years, I was an Army helicopter pilot for 29 years and have over 6,300 hour of flight time of which over 2,000 hours were during night time.  I am an Instructor Pilot, Maintenance Test Pilot, Safety Officer/Accident Investigator, and currently a Military Airfield Manager.  In all my years of flying I have never experienced an orb sighting or head of any other aviation personnel discuss orbs. I remember viably the orbs of light that I saw on 6 April.  The five bright lights were flying in a straight line formation.  The four lights that were following the lead light were slightly accelerating and decelerating to maintain their relative position in the formation of lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118804.html",
      "state": "TX",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c428d",
      "summary": "Oval shaped, blinking lights, going in weird patterns.",
      "city": "elpaso",
      "shape": "oval",
      "date": "2015-04-23T00:00:00",
      "story": "Oval shaped, blinking lights,  going in weird patterns. Oval shaped, blinking lights. A blinking white light going around the craft.  And a blue light,orange light, and a purple light under the craft. There was exactly one craft. The craft was going in a ziz zag pattern then curved quicker than any thing the US has.  Then went straight up then came back down real quick.  Then came closer and then went far away then came back closer. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118542.html",
      "state": "TX",
      "duration": "7:13 to 8:30"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b34",
      "summary": "Circular shaped and moving in to the left very drastically and was very bright.",
      "city": "elpaso",
      "shape": "circle",
      "date": "2015-09-11T00:00:00",
      "story": "Circular shaped and moving in to the left very drastically and was very bright Tonight at 20:18 on 9/02/15, I saw a UFO.  I was watching it for almost a minute.   At first, it was going fast and then it slowed down and turned to the left very sharply and then went very fast and turned off its lights.   The lights were super bright.  And was non-visible anymore after it turned off its lights.",
      "link": "http://www.nuforc.org/webreports/121/S121639.html",
      "state": "TX",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c1c",
      "summary": "On Tuesday 9-15-15 my girlfriend and my self were in her back yard picking up pine needles , Im always looking up at the sky looking at",
      "city": "elpaso",
      "shape": "unknown",
      "date": "2015-09-17T00:00:00",
      "story": "On Tuesday, 9-15-15, my girlfriend and my self were in her back yard picking up pine needles.  I'm always looking up at the sky, looking at different type of aircraft that pass over, and can tell what kind of aircraft is flying, but on this day I saw this object that was pretty high, was just like hovering and glistening silver, and sometimes a glow of red after a few minutes it just moved left and stayed there hovering and gleaming silver a few seconds later a plane about the same altitude flew by heading north west a few seconds later the object was still high in the sky and was over Fort Bliss I tried to get a pic with my phone but couldn't, a few minutes later the object that was heading east of El Paso just vanished.   I have never ever seen any flying object that could just hover at that height, just totally amazing.  Thanks ((name deleted))",
      "link": "http://www.nuforc.org/webreports/122/S122012.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4de1",
      "summary": "While sky whatchin I was looking at orions belt I saw two lights come from the middle star , not sure if in front or behind , but two f",
      "city": "elpaso",
      "shape": "light",
      "date": "2015-08-13T00:00:00",
      "story": "While sky whatchin I was looking at orions belt I saw two lights come from the middle star , not sure if in front or behind , but two fast moving lights going opposite directions . This was around one minute until they disappeared .",
      "link": "http://www.nuforc.org/webreports/120/S120934.html",
      "state": "TX",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5278",
      "summary": "Huge six Cubed Superstructure Seen in El Paso, July 2001.",
      "city": "elpaso",
      "shape": "other",
      "date": "2016-01-23T00:00:00",
      "story": "Huge Six Cubed Superstructure Seen in El Paso, July 2001. I observed a huge megastructure floating in the sky over the Franklin Mountains in El Paso Texas.  The event lasted for two hours and thirty minutes.   I was patrolling the parking lot of a mall, and I parked vehicle to update my DAR (Daily Activity Report), and noticed that huge cubed shaped superstructure in the sky and in a row of six connected to each other.  This structure did not move, nor had any visible lights.  The sun was at its descent and blazed brightly in the sky.  The light made the structure very faded as the moon appears in the sky.  The first two cubes were ornate and seemed to have depth in the design, the other four cubes behind it seemed to be plain.   I advised my supervisors of my observations.  It was so moving I asked my Director of Security if I should make an incident report.  He said not to.   I went to the Supervisors to show them what I saw, and they were dismissive.  Another co-worker advised me not to take it so seriously.  I was upset that it really did not bother them much.  I went into the mall and asked if I could borrow a camcorder or camera and their response was no.  I invited them outside to see this megastructure and they were very glib.  I then attempted to take polaroids of the structure and the sun white washed the exposure to be useless.  This megastructure remained in view for two and a half hours as the sun set. All edges of the structure were not sharp but rounded.  I wrote on DAR that, \"Reported an UFO to Supervisors and Director of Security, asked if Incident Report needed, and they said ,\" No.\"  My female co-worker who is now my ex-wife, told me to not make a big deal about it.",
      "link": "http://www.nuforc.org/webreports/125/S125373.html",
      "state": "TX",
      "duration": "2.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c56ab",
      "summary": "Fast moving star like vessel.  ((anonymous report))",
      "city": "elpaso",
      "shape": "light",
      "date": "2016-07-08T00:00:00",
      "story": "Fast moving star like vessel. Seen the first star heading east really small but moving fast.   Seen the second moving object going north towards north east El Paso moving fast.   Third was from the east heading north but disappeared.",
      "link": "http://www.nuforc.org/webreports/128/S128260.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a3f",
      "summary": "A fireball was traveling horizontally to the left but before extinguishing a second fireball did the same and flew up into the sky",
      "city": "elpaso",
      "shape": "fireball",
      "date": "2016-05-06T00:00:00",
      "story": "A fireball was traveling horizontally to the left, but before extinguishing a second fireball did the same and flew up into the sky I was going back inside when I noticed a bright object floating slowly across the sky, my first thought was that its a nice big bright falling asteroid but when I completely focused on it I saw that it continued to glide slowly across the sky moving like a feather horizontal to the left I called my 2 friends from inside to come out and look for themselves I then moved closer to my front yard to follow the object with my eyes my 2 friends and my self witnessed the object.  I have 20/20 vision so to me this object looked perfectly round and I saw bright orange and red flames surrounding this perfect circle I kept talking out loud narrating to my friends how this was definitely no ordinary ufo sighting so this is why I say it took at least 4 min.  Unfortunately I didn't want to go inside and get my camera I was enjoying the ufo hands on very selfish like.  So now that time had past the object began to dim out and started to come down it reminded me of a hot air balloon the flames we're extinguishing and the perfect circle kept coming down vertically now at a slow pace after it was almost invisible and still falling down a second fireball appeared in the sky from where the same direction in the sky as when I saw the first one, this second object also reminded me of a hot air ballon motion only this one floated across the sky horizontally to the left but with great speed very quickly it flew to the same location the stopped above when it reached the same location as the fist object as if it was trying to catch up to it but instead of extinguishing it flew itself straight up into the sky perfectly straight up and up and up until puff just like that we couldn't see it or anything else after that.  So what happened to the first one?  Did it land??",
      "link": "http://www.nuforc.org/webreports/127/S127194.html",
      "state": "TX",
      "duration": ">4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b81",
      "summary": "Two solid white lights in a straight line formation silently moving to the NE across far NE El Paso",
      "city": "elpaso",
      "shape": "light",
      "date": "2016-04-15T00:00:00",
      "story": "Two solid white lights in a straight line formation silently moving to the NE across far NE El Paso Located in far Northeast El Paso, near Railroad Dr and Farah Dr, while star gazing, two solid white lights appeared overhead out of nowhere and moved in a straight line formation, one behind the other, to the northeast for just a short distance for about 5 minutes and disappeared. It was a clear night with no clouds.  It was a calm, windless night and there was no detectable sound from the lights passing overhead.  There were no associated blinking or colored lights as on an aircraft. The lights were brighter and more focused than stars, and were flying at an altitude far lower than high planes yet higher than any low planes.  The lights moved straight ahead with no side to side movement, and traveled too fast to be a high altitude plane or a satellite, but slower than a low altitude plane. The lights were in a straight line formation too far apart to be just a single plane.  Although no associated shape was detected, it seemed as if the lights were positioned with one at the front and one at the back. What was so startling and attention-getting was that the direction of travel was entirely not in keeping with the normal flight paths of either ELP or Biggs Army Airfield, nor of the high altitude commercial flight paths crossing El Paso.  The witness is a nightly observer of the constellations and the local commercial and Army flight paths across Northeast El Paso.",
      "link": "http://www.nuforc.org/webreports/126/S126824.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c16",
      "summary": "I let my dog outside for her last bathroom bake for the night.  I looked up at the sky as I always do, but this time I notice a flashin",
      "city": "elpaso",
      "shape": "triangle",
      "date": "2016-04-01T00:00:00",
      "story": "I let my dog outside for her last bathroom bake for the night.  I looked up at the sky as I always do, but this time I notice a flashing red light in the sky located just west of me.  It was moving really slow going in an horizontal pattern.   I called for my husband to see if he could tell what that was.  When he came out he look at the sky and said it’s a helicopter, but then I notice the flight patter change a little it, I told him are you sure?  He took another look and said I am not sure. We watch these light for what seemed like hours, then it disappeared.  I went to look it up later and all I found was a still photo taken in January of 2016 that shows 3 lights, but this one in March there was only one.",
      "link": "http://www.nuforc.org/webreports/126/S126582.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7405",
      "summary": "Saucer 50 ft. above hovering over us.",
      "city": "elpaso",
      "shape": "circle",
      "date": "2017-05-15T00:00:00",
      "story": "Saucer 50 ft. above hovering over us. It was a summer night in Texas in 1972, I was 11 years old at the time.  I remember very  vividly the local news channel my parents were watching saying there were strange sightings of flashing lights in the sky around town that were unexplained.  It didn’t seem very alarming to my parents at the time so being kids, we were not very concerned, just kind of excited to see them. \tMy sister and I went outside to see if we could get a glimpse of any of these so called lights in the sky.  She was 6 at the time so of course she followed me.  We went out to the back yard to see if we could spot any, it was around 5:00 PM, so the sun was still out.  It was about 15 minutes and we didn’t see anything so we decided to sit on the brick fence and watch for a few more minutes, nothing. \tWe were just about ready to jump off the fence when we spotted 3 flashing lights in the distance, probably no more than a few miles away.  They were still and were like flashing orbs.  We got excited and jumped off the fence (it was a small brick fence) and were going to go inside to tell my parents when all of a sudden we heard a humming from right above us.  At that point we were in the middle of the back yard.  I looked up and to my amazement, saw a ribbon of round flashing lights not 50 feet above us. It was a disk, sort of like the flying saucer you see in comic strips.  The lights were different colors and they were flashing around in circles.  It must have been no more than a few seconds when I looked at my sister to see if she was seeing the same thing.  She had fallen to the ground, passed out. I was scared and shook her to see if she was OK.  She opened her eyes and I heard a whoosh. I looked up and the saucer and gone.  Both of us were shocked and couldn’t talk. She got u! p to run in the house to tell Mom and Dad.  I stopped  her and said, “Don’t tell Mom and Dad, they won’t believe us.  This is just our secret”.  Surprisingly she did not say anything that night, or even the next few days.  I had dreams about that evening for days, not bad dreams at all, just like it was watching over us. \tYears went past and we didn’t tell a soul about that night.  We have two sisters and a brother and kept this all to ourselves.  She was very young so I thought she just forgot.  I had so many dreams about that night and after all the years went by, I convinced myself it was just a dream. \tThirty five years passed, it was Thanksgiving and we were talking about when we were kids.  I mentioned a dream I had about seeing a flying saucer when we lived in Texas.  My sister flushed, turned as white as a ghost and said she had the same dream.  She explained her and I were sitting on the back yard fence looking at the skies when she saw flashing lights in the distance.  She remembers running and looking up seeing some kind of saucer with different colored lights at the bottm and passing out after seeing it.  She remembers me waking her up saying, “Don’t tell Mom and Dad, they won’t believe us.” \tDid we both have the same dream?  I don’t think so.  I believe what we saw was real and deep in my heart, I know there are peaceful beings out there watching us.  Maybe knowing our hearts and letting us know we are not alone. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134062.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c771d",
      "summary": "With naked eye witnessed entirely lit stationary 'diamond-shaped' object hovering low 1/4 mile or less from backyard before flying off.",
      "city": "elpaso",
      "shape": "diamond",
      "date": "2017-12-04T00:00:00",
      "story": "With naked eye witnessed entirely lit stationary 'diamond-shaped' object hovering low 1/4 mile or less from backyard before flying off.",
      "link": "http://www.nuforc.org/webreports/137/S137448.html",
      "state": "TX",
      "duration": "8-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c79aa",
      "summary": "Silent flying wing moving NE for about 7 seconds.",
      "city": "elpaso",
      "shape": "other",
      "date": "2017-11-03T00:00:00",
      "story": "Silent flying wing moving NE for about 7 seconds. Could not determine altitude. Shape of contact was a flying wing.  It had 5 to 7 small lights on forward edge of the wing.   Color black. Contact was flying Northeast and turned hard and turned like a kite. Contact couldn't be heard over ambient sound. Contact appeared and turned before tracking into the night sky.",
      "link": "http://www.nuforc.org/webreports/136/S136950.html",
      "state": "TX",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8630",
      "summary": "Evening viewing of several on identified aerial objects with clear photographs.  ((NUFORC Note:  Possible high-altitude balloon.  PD))",
      "city": "elpaso",
      "shape": "circle",
      "date": "2018-08-22T00:00:00",
      "story": "Evening viewing of several on identified Ariel objects with clear photographs. Casually walking outside and glancing up three persons saw  these objects one of those three ran inside grabbed her  iPhone came out and took these two photographs. ((NUFORC Note:  Possible high-altitude balloon.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142792.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9391",
      "summary": "Fading appearing lights",
      "city": "elpaso",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Fading appearing lights We were outside smoking and we always look up at the sky and we noticed a few planes coming and going and a helicopter pass by so we can tell those lights from others. This one light which we thought was a star, began moving straight up the sky, but stayed at a constant speed and then faded away. We then noticed another 3 lights which we thought were shooting stars but they began moving in their own direction! They than faded away. A friend stopped by maybe 10 minutes into us being outside and tells us he saw a light moving down the sky and fading out while he’s telling us this we see a light move down and fade away and see another move across the sky and fade away. For our friend to come over and tell us what he saw just confirmed what we saw was real just moments before.",
      "link": "http://www.nuforc.org/webreports/150/S150318.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c93c7",
      "summary": "I was in my back yard at 4.40 pm grilling i was looking at commercial planes going over mostly Southwest Airlines 737 i then noticed a",
      "city": "elpaso",
      "shape": "sphere",
      "date": "2019-12-01T00:00:00",
      "story": "I was in my back yard at 4.40 pm grilling i was looking at commercial planes going over mostly Southwest Airlines 737 i then noticed a silvery object a little higher than the planes it was just stationery it was just thwre i went in to get my bionoculars it had moved east and was almost out of sight",
      "link": "http://www.nuforc.org/webreports/150/S150406.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9420",
      "summary": "An incomplete report given on behalf of another due to a kidnapping situation",
      "city": "elpaso",
      "shape": "other",
      "date": "2019-12-19T00:00:00",
      "story": "An incomplete report given on behalf of another due to a kidnapping situation I am submitting this record as a witness to testimonial given to me by a family relation in 2014. At that time, she detailed an est. 1969 UFO sighting in El Paso, TX with her parents (who are now deceased). So, there were at least three witnesses to the craft she described, in detail, by type of material and color. I believed she may have been in recent therapy prior to sharing the information with me. I needed to share the UFO with her husband, and did so in 2014. I did not relay to him any of the details she shared with me.  Now this incident is reported into the OSHA Whistleblower system as it became a background issue in a kidnapping in 2016.  This is an incomplete report and now I am demanding the person who gave me this information be prosecuted, along with her employers, for terrorism. I would like to be contacted by an investigator who can document this case directly with the source of the UFO sighting.",
      "link": "http://www.nuforc.org/webreports/151/S151313.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c94da",
      "summary": "8-12 objects seen from plane, above them at over 34,000'  ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "elpaso",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "8-12 objects seen from plane, above them at over 34,000' While flying at an Altitude of 34,000 feet over the SW US in a westbound direction, witnesses saw a series of about 8-12 lights in a horizontal line about 10-15 degrees above their level attitude.  The lights faded and returned in a shallow V position only to fade again. The experience lasted about 20- 30 seconds for the reporting witness. This sequence of lights caused a lot of chatter on the radio and was confirmed by 4 other aircraft in the area at different altitudes and headings.",
      "link": "http://www.nuforc.org/webreports/151/S151106.html",
      "state": "NM",
      "duration": ">30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c95c7",
      "summary": "Saw a blue light on the sky told my wife to see up the object became two and after 10 seconds it became one again",
      "city": "elpaso",
      "shape": "oval",
      "date": "2019-12-19T00:00:00",
      "story": "Saw a blue light on the sky told my wife to see up the object became two and after 10 seconds it became one again",
      "link": "http://www.nuforc.org/webreports/151/S151369.html",
      "state": "TX",
      "duration": "2 minute s"
    },
    {
      "_id": "64d005f478aba2ec5a3c97be",
      "summary": "2 gliding objects",
      "city": "elpaso",
      "shape": "unknown",
      "date": "2019-12-19T00:00:00",
      "story": "2 gliding objects Two objects were gliding left together across the sky.  I assumed they were planes until I noticed a plane flying to the right, towards the directions of the objects.  The objects didn’t have a trail, but noticed an obvious one on the plane.",
      "link": "http://www.nuforc.org/webreports/151/S151600.html",
      "state": "TX",
      "duration": "At stop light, brief"
    },
    {
      "_id": "64d005f478aba2ec5a3c9851",
      "summary": "Tear drop object in the sky",
      "city": "elpaso",
      "shape": "oval",
      "date": "2019-12-19T00:00:00",
      "story": "Tear drop object in the sky There was a tear drop looking spacecraft or object in the sky around 5:30 pm I saw it on a friends Snapchat then I looked in the sky and saw it I recorded it with a professional camera but did not show",
      "link": "http://www.nuforc.org/webreports/151/S151674.html",
      "state": "TX",
      "duration": "20 minutes"
    }
  ]
}