{
  "city": "erie",
  "fetch_timestamp": "2025-07-12T14:37:18.730376",
  "record_count": 55,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4154",
      "summary": "Planes guided into the Trade Centers by UFOs.",
      "city": "erie",
      "shape": "cigar",
      "date": "2006-05-15T00:00:00",
      "story": "Planes guided into the Trade Centers by UFOs. I can't believe not many people reported this.   I saw two ufos hit the World Trade Centers.  Is America blind.  The centers went down.  I'm not talking about the planes.  I saw 2 sebarate crafts \"watching\" from the sky.  In the confusion people might have missed it.  They seemed to guide the planes into centers.  Maybe I'm going crazy, but they weren't just spectators.  I saw them while watching the events unfold on TV.",
      "link": "http://www.nuforc.org/webreports/049/S49995.html",
      "state": "PA",
      "duration": "Many Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4456",
      "summary": "Three disk like objects flew over Erie, PA at around 3:15, there were lights and not any noticable noise.",
      "city": "erie",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "Three disk like objects flew over Erie, PA at around 3:15, there were lights and not any noticable noise. My buds and I had been at a night class for college when these three disk shaped objects flew over head.  They paused over some areas and had some dim but far shining lights.  There were other lights too, about 10.  After about 45 seconds to a minute the objects started going really fast until we couldn't see them any more.  It was really strange.  As it went over the dog started barking, but when the object was gone the dog stopped.  Maybe really high frequencies.",
      "link": "http://www.nuforc.org/webreports/049/S49988.html",
      "state": "PA",
      "duration": "45-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4455",
      "summary": "In Erie, PA we saw three disk-like objects with lights and moving quickly.",
      "city": "erie",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "In Erie, PA we saw three disk-like objects with lights and moving quickly. We we were on our way home from camping and pulled over at a gas station to go to the bathroom.  The gas station had only one other patron who was inside.  As we left we saw three disk-like objects fly over head, hovering occasionally over certain areas.  We saw them for about a minute or minute and a half before they took off at a very fast speed.  There were only a few lights, maybe 5 to 10.  Occasional \"spotlight\" beams came from the craft, they were not very bright but they were visible for a long distance.  No beings were sighted.",
      "link": "http://www.nuforc.org/webreports/049/S49970.html",
      "state": "PA",
      "duration": "60-90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b49ea",
      "summary": "Orange sphere observed flying south to north",
      "city": "erie",
      "shape": "sphere",
      "date": "2019-07-12T00:00:00",
      "story": "Orange sphere observed flying south to north After fireworks started watched glowing sphere travel south to north glowing orange no sounds no aircraft in area and was not drone at the speed it moved and size was to big for drone.",
      "link": "http://www.nuforc.org/webreports/147/S147414.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b55c4",
      "summary": "War of the Worlds",
      "city": "erie",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "War of the Worlds It was the early 70's. It got very hot at night and we used to sleep every night in tents in the back yard to stay cool. We were sitting beside our tent and I looked up at the stars as I always loved to look at them. There was a red star that caught my eye and all of a sudden, a red light about the same size of the star came from it and moved at least 5 time faster across the sky than any plane I ever saw to this day. I ran in the house to tell my grandmother about it. She came out within seconds and it had already reached the other side of the house. We were all in awe over this and then all of a sudden there were many of these lights all looking like they were coming from every star in the sky. It was really weird because they all looked like they were the same color of the twinkling star they came from. This was definately not a meteor shower. I watch them every chance I can. All the lights moved from one end of the sky to the other crossing each others path as if they were just missing each other. They never left a trail and just looked like stars moving across the sky. The lights never went out and it lasted at least a half hour. They never blinked like the stars they seemed to have came from.  It kind of freak my other family members and after a small amount of time they would not even admit it happened. There was a write-up in the paper shortly after that, that many people had saw the same thing. I can't remember exactly what the article said but I know they didn't have and explaination of what they were.  After awhile they started to get dimmer until they all disappeared. It was definately an experience I will never forget. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54491.html",
      "state": "PA",
      "duration": "1/2 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b55f5",
      "summary": "White light moved north to south and faded out.",
      "city": "erie",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "White light moved north to south and faded out. Looked up in the sky just before bedtime while waiting on the dog to pee and saw what appeared to be a bright star or planet.  The light was white and did not blink.  At first I did not notice it moving and did not give it much thought and looked away.  However, my eyes were drawn back to it as I saw it move from north to south and fade out.  I have seen many meteors (was awake for the Leonid showers) and this was moving too slow for a meteor...although, at that altitude (not sure but it seemed way up there) it must have been moving along.  Thought maybe it was a satellite that just happened to catch the sun reflecting off of it but I then saw two airplanes move in that direction.  Those were easy to identify since they had the traditional blinking lights.  The two planes appeared to be at the same altitude and moving in the same direction as the white light was moving.  I live about 2 miles from the southern lake erie shoreline and everything was moving from north to south.",
      "link": "http://www.nuforc.org/webreports/051/S51719.html",
      "state": "PA",
      "duration": "15 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c7b",
      "summary": "A bright spec of light hovered over east Erie and was brighter than anything in the night's sky.",
      "city": "erie",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "A bright spec of light hovered over east Erie and was brighter than anything in the night's sky. We noticed a bright spec of light in the sky over downtown Erie. It was much brighter than the few stars that were able to be seen tonight. As I type the light is emitting small rays of light that seem to contain every color of the light spectrum. I must stress that it is quite brighter than any of the stars and planes that are visible. The object seemed to hover and move very slowly as we continued to watch it.",
      "link": "http://www.nuforc.org/webreports/058/S58889.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b697a",
      "summary": "dark object with strobe/beacon.stationary over Interstate 90 near Erie,PA",
      "city": "erie",
      "shape": "unknown",
      "date": "2006-12-07T00:00:00",
      "story": "dark object with strobe/beacon.stationary over Interstate 90 near Erie,PA We were driving eastbound on I86 (then called NY route 17) one January night around 10pm.We had just turned onto I86 from I90 near Erie,PA. On the westbound side of the highway there are two steel frame towers (communication towers I assume),right up near the road,that each have a light at the top that slowly flash like the lights on radio towers.I've seen these towers many times while driving through the area. So when we got another half mile or so down the road,I was surprised to see what at first looked like a third tower.Actually I assumed it was another tower because of the strobe/beacon that I saw flashing. As we got closer I noticed that the light was flashing much more quickly than the lights on the towers.(and,by the way,flashing about twice the speed of a normal aircraft strobe that can be seen in the sky on any given night.) I said to my wife,\"What the hell is that?\" She only glanced at the light.(We were returning from the Erie,PA veterens hospital because her dad was there recovering from a collapsed lung...so she was thinking about her dad and not a light flashing along the expressway) As we got closer,still...almost beneath this thing,the strobe was obscured by the 'body' of the object.It was a very dark night with no moon.Whatever this thing was,it was as black as the sky.I couldnt really tell how big it was as it was invisible against the dark sky.No outline was visible at all. Now here is the thing that tells me this was not a stationary helicopter or something...and also the part that scared me. As we passed the object I kept looking up at it through my drivers side window. I saw a rectangular opening on the bottom of the object. The opening was about the size of a small car. I could see a grate or screen up inside there through which was visible a pulsing,glowing orange/red light which sort of looked like the pulsing glow of the hot coals at the base of a campfire. I've seen lots of helicopters and they all have lights and numbers on the bottom or say police or sheriff and have visible landing wheels or skids on them.I've never seen a helicopter a with pulsing,glowing rectangular opening on the bottom. By the way,the object was close up to the road...just over the tree line.The opening was about as high as the top of a 4 or 5 story building.We heard no sound as it was January and we had the car windows rolled up tight...and we were driving around 60 miles an hour. I have to admit that I began to panic a bit on the inside! My heart began to race as I realised I was looking at something very different than anything I had ever seen before in the sky! For some reason I had the feeling that whatever it was,it 'knew' I was looking at it...as if all the other cars that were going by didnt notice anything strange...as if I was the only one who noticed that this was NOT another communications tower! For a moment I feared this thing would come after us!My panic began to subside as we left the object further and further behind. I watched it in my side mirror and glanced over my shoulder at it as we continued down the road. It may have been an illusion,but I thought it looked like it moved back away from the road about 30 feet in an instant! ...like it moved in a wink! ...but it could have been an illusion because all I could see over my shoulder was the strobe blinking in the dark sky...and we were driving. As we rounded a bend and passed under a bridge I was not able to see the object any longer. My wife said it seemed weird but like I said she was preoccupied with thoughts of her elderly father we had just left back at the VA hospital. This whole thing happened in less than one minute as we drove along the highway.Just for the record,there were plenty of other cars driving in both directions...I'd say light to moderate traffic for the area...so others must have seen it.If anyone else thought it was strange I do not know. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53196.html",
      "state": "PA",
      "duration": "less than a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8495",
      "summary": "Fireballs slowly descend from the sky and disappear into Lake Erie",
      "city": "erie",
      "shape": "fireball",
      "date": "2009-08-05T00:00:00",
      "story": "Fireballs slowly descend from the sky and disappear into Lake Erie Evening of 08/11/08:  late night over lake erie. low slung storm cloud on the horizon. I and a friend were positioned facing north looking out over the lake. light rain, cool temperature for early part of August.  With the naked eye, I confirmed with my friend that there were lights out on the lake (28 miles across) as seen first with the naked eye.  Then I asked my friend if he had a pair of binoculars.  Through the binoculars it was determined at first that a small boat appeared on fire.  This first bright light was furthest East in its proximity.  Then, on closer inspection I noticed and confirmed with my friend that what we were witnessing was NOT a little boat on fire, but fire balls descending extremely slow from the underside of this low slung storm cloud.  No identifiable sounds were heard in the vacinity. No helicopters, scrambled jets nor weather planes.  The story here is eiree as the fireballs continued to fall from the sky and as the first one went down behind the horizon, another one immediately appeared and began to fall.  This happened for a period of an hour to 90 minutes.  I was a little concerned, not knowing what was happening and decided to leave the neighborhood where this sighting was occurring-- a quiet neighborhood that lines the shore of Lake Erie.   After witnessing at least thirteen of these fireballs, I left the area (my friend lives in the house overlooking the lake and was concerned as well, but not as much as I was.) I hoped that the local news had picked up on this story, but no one has ever reported any similar sightings at the same location, nor did I feel compelled to inform the Lawrence Park police.  I did not want to bring attention to the quiet little neighborhood, plus it was raining and the folks all seemed to be sleeping and not witnessing this.   Too bad, this is definitely one for the books.  I wished that I had had a powerful video camera to capture this phenomenon.",
      "link": "http://www.nuforc.org/webreports/070/S70490.html",
      "state": "PA",
      "duration": "> one hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b86fd",
      "summary": "I saw something I'm not sure what it was when getting in my van, as I was getting ready to take my wife to work.",
      "city": "erie",
      "shape": "oval",
      "date": "2009-01-10T00:00:00",
      "story": "I saw something I'm not sure what it was when getting in my van, as I was getting ready to take my wife to work. I was taking my wife to work, she is a nurse and after I she got in the van and I was circling around the back of the vehicle just as I got to the door on the drivers side I saw out of the corner of my eye a very very bright dayglo yellow meteor shaped object with a meteor type tail that was bright green its trail came from the horizon to my direct left and flew in a very straight line straight over my head about fifty to 100 feet up directly to the right horizon and it only lasted about 3 to 5 seconds and then the light green and yellow completely disappeared - end of encounter. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67104.html",
      "state": "PA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9433",
      "summary": " 3/12/10Viewed a comet like object very bright fall out of the sky about 1 mile.",
      "city": "erie",
      "shape": "changing",
      "date": "2010-04-13T00:00:00",
      "story": "3/12/10Viewed a comet like object very bright fall out of the sky about 1 mile.  Reaching That point we witnessed The Triangle Craft.",
      "link": "http://www.nuforc.org/webreports/074/S74634.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9432",
      "summary": "Viewed Cigar 2 light object change into a Complete triangle With 3 lights.",
      "city": "erie",
      "shape": "changing",
      "date": "2010-04-13T00:00:00",
      "story": "Viewed Cigar 2 light object change into a Complete triangle With 3 lights. 3/12/10 Approx Time of 07:56 PM Lasted 5mins Weather: Clear. Wind about 5-10 Mph  Me And My Wife Were Traveling West On Buffalo Road That Evening And we both witnessed  a comet like object falling from the sky with a very bright white light emitting from it. Then a few seconds later the object Stopped emitting the light and the light started up again but it jumped in the sky the. left and right before going blank to no lights.  Me and my wife came upon were the object was about 1 Mile up buffalo Road at the intersection of buffalo Rd and McClelland Ave.  We seen two red lights side by side hovering in the air without any noise or movement then a 3 light that was white appeared and the view of a giant triangle took place.  While my wife was driving I opened up the sunroof and we drove under the craft.  It was Amazing seeing something odd and big Without any noise.  We passed under the object and about 30 seconds went by and the lights were gone.  Thank you for your time and I hope More people come forward with information.",
      "link": "http://www.nuforc.org/webreports/074/S74635.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b95c6",
      "summary": "UFO East Erie Sky",
      "city": "erie",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "UFO East Erie Sky This was seen at dusk.  In the eastern sky. Just below cloud bank object hovered just under clouds did not move in any direction I saw the craft while leaving a store in the area.  After about 4 minutes the craft moved up into the clouds I did not see it again.  Craft had flickering lights Blue in color but not deep blue.  The craft was too far away to make out what it looked like.  It was very high in the air. At first i thought it to be a planet. but most planets dont flicker then move very fast up into the clouds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74669.html",
      "state": "",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b983a",
      "summary": "orb repeat",
      "city": "erie",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "orb repeat Orb of light slowing down to land in field at old bible study. As it slowed down to land it slowly  stops glowing. three nights in a row same, place same time,same routine some times clouds will just apear to block my view of the landing. Havent had time to wait in field  yet but the new owners of the property put up a fence that looks like  it is from the movie king kong and sometimes i see alot of bright lights behind it late at night???",
      "link": "http://www.nuforc.org/webreports/073/S73405.html",
      "state": "PA",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba147",
      "summary": "Bright light has been in the sky for 2 months, noticed it moved position, then it took off.",
      "city": "erie",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "Bright light has been in the sky for 2 months, noticed it moved position, then it took off. My sister and I were standing out on our porch smoking a cigarette.  We had noticed a really bright light in the sky for the last few months, but tonight it had moved lower down on the horizon.  I pointed it out to my sister and we began discussing how that could be possible.  I said that it couldn't be a star, because the axis of the earth doesn't move fast enough to change our viewpoint on stars overnight. As we were talking about this, the object moved sideways very quickly in the sky, and the light started dimming, until it looked as if it were trying to mimic a star.  We kept looking at it and were in disbelief, when suddenly the light went completely off, leaving only a faint reddish-blue point in the sky.  The reddish-blue \"craft\" started moving very rapidly in short movements diagonally and vertically, and then vanished from sight completely. I am 20 years old, and my sister is 17, and we were completely sober at the time of this happening.",
      "link": "http://www.nuforc.org/webreports/067/S67631.html",
      "state": "CO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba42f",
      "summary": "Orange orb/fireball seen across sky.",
      "city": "erie",
      "shape": "fireball",
      "date": "2009-06-09T00:00:00",
      "story": "Orange orb/fireball seen across sky. I saw it while I was on my deck. It was an orange orb the was moving at a slightly fast pace. It made no sound and never changed direction. It was going southwest to northeast. It left no contrails nor did It flash or blink. It was below the clouds or it was bright enough to be seen without any change while in the clouds. As it was about over the City of Erie it began to to get much smaller. It disappeared then reappeared a few times then it was gone.",
      "link": "http://www.nuforc.org/webreports/070/S70278.html",
      "state": "PA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bae7b",
      "summary": "Orange Flaming Orbs fall from the sky over Lake Erie, August, 2007",
      "city": "erie",
      "shape": "fireball",
      "date": "2010-08-24T00:00:00",
      "story": "Orange Flaming Orbs fall from the sky over Lake Erie, August, 2007 The Event occurred during a late summer rain storm. Although the rain was not heavy, the dark cloud over Lake Erie was distinct. The phenomena observed began as a casual observance of a single speck of light. We observed what appeared from the shoreline as a light perhaps a mile or two offshore. The only way we could observe this occurence was with an average powered pair of field binoculars. At first looking through the binoculars it appeared as if it might be a small boat, but closer examination revealed that this was something \"on fire\". I quickly alerted my companion to look into the binoculars to get his opinion. He also saw this ball of flame. What happened after this first encounter was quite startling. Let me say that I have never had a close encounter and am suspect of anything currently being written about the UFO phenomenology. However the unfolding events of that night have not only startled me, but have stayed with me for the last three years. O! nly today was I able to define my observances based on other eye-witnesses who had similar sightings. They have described what they similarly saw as \"orange flaming orbs\". Other descriptions were ascribed to them, but in my case the \"orange flaming orbs\" fits the description perfectly. I thought that one orb appearance was enough, but what makes this an even more intriguing mystery is that after this first orb disappeared beyond the Lake Erie's horizon line, another one began to fall from the low hanging dark storm cloud. I have read other accounts and descriptions of \"ascending lights\" and fast lateral moving lights but these were not like that at all. We watched as consecutive flaming orbs fell very slowly from the sky and eventually into the water. What is also amazing is how each was orchestrated in its falling velocity (extremely slow-- slower than a parachutist, so we knew this wasn't a nighttime military mission) and also that the intensity of the light stayed consistent-- from the time it appeared coming out of the dark cloud until it hit the water's horizon line. I should note that there were no sounds being emitted and no sounds of jets, airplane or helicopter engines were heard. The fact that it was a drizzling rain (with no lightning, I might add) made it impossible for this to be man-made-- such as what I thought it might be: a summer \"art performance\" by some of the local artists. No one in their right mind would want to be out in this weather on the vastness of Lake Erie. No ot! her lights appeared-- suche as boats or planes. The house we observed all of this from is remote from the city so no street, traffic or building lights could have interfered. As much as I am recreating this story, we unfortunately had no access to good night time cameras or videos, but I would testified unequivocally that this was a phenomena that deserved a full and further investigation. To continue with the observation, we stood on the back porch with a full panoramic view to the west toward Cleveland and to the east toward Buffalo. We were facing north toward Canada when these lights were observed. In the same fashion as described earlier, we observed at least 16 of these same flaming orbs extremely slowly fall from the sky and into the waters. As each one disappeared the next one began to come out from the underside of the cloud. This event went on for at least one hour. There were more that continued to fall and perhaps a whole string of them from our line of sight and down toward Buffalo, but I actually felt frightened (amazed and excited as well) and wanted to report this occurance to the Lawrence Park police, but being a skeptic and resp! ectful of this tiny suburb and being late at night I hesitated to call anyone to bring undo attention to the neighborhood. I looked in the Erie Times News the next day to see if there was a story about this light phenomena, but did not find anything, nor was there anything on the television. This event has stayed with me since 2007. It is only today that I found your reporting website and also found better descriptors based on other observances.",
      "link": "http://www.nuforc.org/webreports/077/S77134.html",
      "state": "PA",
      "duration": "over one hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bb307",
      "summary": "An unusally loud, low flying , fast aircraft, with no lights, heading north of Erie County, PA dissappears.",
      "city": "erie",
      "shape": "cigar",
      "date": "2011-01-31T00:00:00",
      "story": "An unusally loud, low flying , fast aircraft, with no lights, heading north of Erie County, PA dissappears. It was a mixed clouds/ clear skies evening, I was leaving work when a strange engine noise drew my attention to the sky.  The object I noticed nose dived then plateaud  suddenly to about 1000 feet.  The object had no lights, and the front of the craft was pointed.  The wings of the craft drew back at a sharp angle.  The rear of the vehicle had one engine but no exhaust/flames coming from it. The engine produced an irregular, loud noise, unlike any aircraft i've ever heard before.It had no propellers, was like a jet engine.  The sound coming from the aircraft was very loud and had a very deep clanking noise,although the speed of the craft did not match the sound it was producing.  It was heading north for a few seconds and abruptly disappeared because of it's speed.  It was impossible to track because there were no lights marking it's spot in the sky.",
      "link": "http://www.nuforc.org/webreports/079/S79616.html",
      "state": "PA",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb790",
      "summary": "Bright red light hovering during 4th of July-not a firework.",
      "city": "erie",
      "shape": "circle",
      "date": "2010-07-19T00:00:00",
      "story": "Bright red light hovering during 4th of July-not a firework. My family and I were watching the fireworks from a club.  My mother shouted, \"what is that? Do you see it??\"  We all looked.  It was this bright red light, looked circular from where we were.  It just appeared and then hovered there for maybe a minute, then it slowly started moving and then it was gone.  It was so bright I have never seen any light in the sky that bright.  And no, it was not a firework.  We started hearing they were investigating it and I had told a friend of mine and she says it was a firework.  That they have these disc fireworks that go up and then shoot to the side, and they come in all colors.  This was solid red, brighter than any firework I had seen.  And if it were a firework, why was it hovering?  I also want to point out that it was really high up, and I have never seen a firework that high up.",
      "link": "http://www.nuforc.org/webreports/076/S76511.html",
      "state": "PA",
      "duration": "1 to 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbcb5",
      "summary": "I was very young when I saw a UFO, and so do not remember the exact date. I was looking out a second-floor window of my house when I no",
      "city": "erie",
      "shape": "oval",
      "date": "2011-12-12T00:00:00",
      "story": "I was very young when I saw a UFO, and so do not remember the exact date.  I was looking out a second-floor window of my house when I noticed a strange craft floating lazily across the sky.  It was orange, and looked like a blimp with the cockpit and tailfins removed.  It was huge - actually about the size of a blimp, but again with some features removed.   This coupled with the fact that I have never seen any sort of zeppelin in my area before, made it clear that this was no craft I knew about.  I could see it for about two minutes before it was obstructed from view by my neighbors' house.  It reappeared on the other side and eventually disappeared from my window.  No other strange phenomena was seen while observing the craft. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85342.html",
      "state": "PA",
      "duration": "About 10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc693",
      "summary": "Obj. with a single, white light appeared over city and Lake Erie and moved in ways I have never seen any aircraft move.",
      "city": "erie",
      "shape": "cigar",
      "date": "2011-08-07T00:00:00",
      "story": "Object with a single, white light appeared over city and Lake Erie and moved in ways I have never seen any aircraft move. I have been a police officer for ten years, and I served active duty in the United States Army in a reconnaissance unit.  One of my duties in the military was to observe and be able to identify aircraft from many countries, primarily those from the United States and the former Soviet Union.  I am also a huge fan of helicopter aviation. I was working patrol on the night of 7/16/11 on the 2230-0630 shift.  I was in uniform and in a marked patrol car.  While patrolling on a main street in town, I was driving southeast away from the lake and toward the downtown area.  At approximately 2352 hrs., I noticed a single, white light in the sky moving northwest.  The light appeared to be at an altitude of approximately 1,000-2,000 feet over the downtown area.  I first thought the object was a helicopter.  Just up the street from me was a large hospital which averages probably 4-5 medical helicopter transports a week.  I am very familiar with the medical helicopters which frequent my area, and after a few seconds I realized that what I was seeing was not a helicopter.  I also heard absolutely no sound from the object. As the light came toward me, I realized that it had no navigational or hazard lights (the green and red lights which flash on an aircraft).  It had a single, white light.  It was very bright at first.  As it got closer to being directly overhead, I noticed that the light appeared to be cigar shaped.  But as it got even closer to being overhead, the light seemed to dim.  By the time it was overhead (approximately one minute since I first saw it), it was as dim as most of the stars in the sky.  In fact, if it hadn't been moving, I probably would have thought that it was a star. I actually stopped my patrol car in the middle of the street and had to stick my head out of my driver's side window to look up at the object because it was directly overhead.  The object continued to move northwest, but it was dim and appeared to be much higher than when I first saw it.  In fact, it appeared then that it was 10,000 feet or higher. Then I was amazed when the object stopped dead in it's tracks and began to zig and zag, back and forth!  It went in all directions.  I would estimate that if it was 10,000 high it was probably moving maybe 200 feet in each direction around the point where it had stopped. It became difficult for me to watch the object with my head sticking out the car window and looking over the roof of the car to my west, so I made a u-turn and parked along the curb.  I could now see the object by looking out of my window toward the west.  Shortly after I parked, I phoned my wife to tell her what I was seeing.  My cell phone indicated that I called my wife at 2353 hrs. on 7/16/11. Just after I started talking to my wife, the object stopped zigging and zagging and it began to move toward the east.  Just then, another police unit with two officers pulled up and asked what I was doing.  I ended the phone call with my wife and I informed the officers about the object that I was watching.  We then exited our respective vehicles while we watched the object.  Both officers saw what I was seeing.  One of them believed it to be an aircraft.  The other officer said she wasn't sure what it was. As we watched the object continue east, we noticed an aircraft far out in front of it, also flying east.  The object and the aircraft appeared to be around the same altitude, but the object had become so dim that it was hard to determine how high it was.  In fact, several times the object's light appeared to fade out completely and then quickly fade back in.  However, at no time did the light of the object appear to flash or blink. All three of us watched the object move east and, once again, it stopped in mid flight and began to zig and zag around the point it stopped.  The one officer continued to believe that the object was an aircraft, and the other officer said she didn't know what it was.  Then the other officers had to move their vehicle because they had stopped in the travel lane and they were blocking traffic.  I got back into my vehicle and drove east and parked in a parking lot one block east of my original location where I continued to watch the object.  It continued east and its light faded in and out a few more times.  I lost track of where the aircraft, which I had seen in front of it, had flown.  Then I received a call for service from my dispatcher and I had to leave the area.  The total time I watched the object was approximately 15 minutes. Later that night I looked to the sky in the direction I last saw the object but I didn't see it again.  Through the course of the night I did see two meteorites, one to the north of town over the lake and one to the south.  However, I am familiar with what meteorites look like and the object I watched was NOT a meteorite. Later in my shift I tried to call the local international airport to see if they had any aircraft or any other contacts on radar at that time.  But I only got an automated system and was never able to get through to anyone there.",
      "link": "http://www.nuforc.org/webreports/082/S82697.html",
      "state": "PA",
      "duration": "00:15"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbb1",
      "summary": "Reflective cigar shaped craft sighted over erie, pa; gone in seconds.",
      "city": "erie",
      "shape": "cigar",
      "date": "2011-07-04T00:00:00",
      "story": "Reflective cigar shaped craft sighted over Erie, PA; gone in seconds. Leaving the local landfill today, my friend and I saw a flash of light just north of us, and overhead.  At first we thought it was an old airplane, the kind that was just made of all sheet metal, because the reflection off of this object was extremely bright, almost blinding.  As I pointed out to my friend that I didn’t think it was an airplane due to its movement (of which there was none, it was just hovering there), it rolled (it was almost like a tumbler rolling in midair), and spun overhead.  With that simple twist, it became a bright circle, and it shot ahead of us towards the lake.  Within seconds the point of light was across Lake Erie, towards Canada, and could not be seen anymore.  It left no trail, no sounds, nothing.   The person I was with is a skeptic, and even he was dumbfounded as to how it could just disappear without a trace.   I was able to snap a photo on my cell phone camera, right when it was doing its little tumble.  It is not the greatest, but you can tell there is definitely something there.",
      "link": "http://www.nuforc.org/webreports/081/S81963.html",
      "state": "PA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcffc",
      "summary": "Erie moving lights in the sky over Lake Erie",
      "city": "erie",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Erie moving lights in the sky over Lake Erie I was returning from having dinner with friends and as we were making a turning in Abels Road we saw a blue light fly across the sky.  It then changed direction and turned green then it propelled downwards as if it was going into Lake Erie.  It was too fast to be a plane and as it changed direction we ruled out the possibility of a shooting star.  We got out of the car and waited for a while.  After a minute of no sightings we decided to drive towards the area we thought that we saw it fall however after waiting by the lake for 15 minutes we saw nothing so headed back to the camp we were staying at. Later on that night I was sitting out side of my cabin and saw two very interesting things. First as i looked up there was a grouping of 3 stars in a small triangle but when i looked closely the top star in the triangle was moving slightly to the right and the snapping back to the original position like it was attached to a piece of elastic. The second was a constant flashing light coming from the Lake Erie direciton.  A pure white light at tree level.  As I walked towards the direction, there were no cars or lights to produce the flash but it continued for a few minutes.",
      "link": "http://www.nuforc.org/webreports/092/S92187.html",
      "state": "PA",
      "duration": "5-6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd074",
      "summary": "13 bright orange lights on 8/18/12 Erie PA   9:15 pm to approximately 9:22 pm",
      "city": "erie",
      "shape": "",
      "date": "2012-09-24T00:00:00",
      "story": "13 bright orange lights on 8/18/12 Erie PA   9:15 pm to approximately 9:22 pm I was driving to pick up my son 8/18/12.  Around 9:15 pm. Driving west on Interchange and Zimmerly Road. Looked to the north and saw a shape of a look like big dipper but very condensed. Bright orange round lights 7 formed the dipper shape with 6 orange lights in a straight row east to west centerd perfectly below the dipper shape. It was almost like a perfect framed picture.  I could not stop looking at it.The sky was a deep navy blue no other stars in the sky except to the west a larger bright blinking fast orange ball. I continued driving west and looked north to view this beautiful site. I tried to call my husband but no answer to look at this. Drove on Lancaster Rd north and could still see the orange lights.   I realized this was not normal and  became nauseous and frightened. I turned onto West 38th Street going west. I could still see the lights. I pulled into a  treed driveway to pick up my son. I wanted him to take a picture. When I backed out and returned to 38th Street  driving east. The lights were gone. The sky was filled with millions of white stars. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92343.html",
      "state": "PA",
      "duration": "4-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd072",
      "summary": "Beautiful 13  bright orange light formation in Erie PA 8/18/12  9:15 PM  lasted 4-7 minutes",
      "city": "erie",
      "shape": "formation",
      "date": "2012-09-24T00:00:00",
      "story": "Beautiful 13  bright orange light formation in Erie PA 8/18/12  9:15 PM  lasted 4-7 minutes I was driving Sat. 8/18/12 on Interchange and Zimmerly Rd. when I saw what looked the the bright orange big dipper in the North sky.  These formations were the only objects in the sky.  A small version the dipper with 6 bright orange lights in a perfect row below the dipper like shape.  There were no other stars in the sky. Just this formation.  And a brighter blinking orange light in the west sky. It looked like a perfect framed picture against the dark navy sky.  Almost artificial.  I could not stop looking at the formation.  Then it hit me.  This is not normal.  I started getting nauseous and afraid.  I passed thru a treed area... then in cleared area could still see this.  I picked up my son but when I looked they were gone.  The sky was full of a million stars.  I then knew this was different.  I looked at the news that evening but no mention of this sighting. this lasted 4-7 minutes it was so beautiful",
      "link": "http://www.nuforc.org/webreports/092/S92083.html",
      "state": "PA",
      "duration": "5-7 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1d0",
      "summary": "Giant orange/red globe slowly moving across the sky.",
      "city": "erie",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Giant orange/red globe slowly moving across the sky. I was on the way home from a 4th of July picnic with my family. It was 9:30 EST time and fireworks were being set off around town.  There were plenty of fireworks all around, but I looked out of the window and seen an orange/red ball of fire in the sky, sitting high above them.  It was slowly moving across the sky, almost like how the moon will follow you when you drive, but once we got about 5 miles away from it we could only see it if we looked back.  There was no noise and it was silent. No one sitting outside of their houses seemed to notice it being that they were looking in the other direction at fireworks.  There were four of us in the car who all seen it.  My husband tried to convince everyone that it was a Chinese candle balloon, but the funny thing was the last time we looked back at it before it was out of our view, you could see two planes flying towards it-all of which looked like ants in its giant comparison.   I'd say the light could've been at leas!t half the size of the moon.",
      "link": "http://www.nuforc.org/webreports/090/S90448.html",
      "state": "PA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd205",
      "summary": "Bright greenish light that lit up entire sky",
      "city": "erie",
      "shape": "other",
      "date": "2012-09-24T00:00:00",
      "story": "Bright greenish light that lit up entire sky bright light that turned the sky green colored. East of Boulder, looked like it came from the ground but lit the entire sky green. not a strobe, nor did it just create a beam. the entire sky turned green, i thought it may have been lightening at first but was too greenish. it happened twice, both times pretty slow.",
      "link": "http://www.nuforc.org/webreports/092/S92125.html",
      "state": "CO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3a8",
      "summary": "5 orange/red, burning lights in zig-zag formation",
      "city": "erie",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "5 orange/red, burning lights in zig-zag formation Went outside to drop trash off at dumpster and saw 5 burning lights in the sky facing Southeast.  They were incredibly bright with an orange/red color; almost like they were burning. There were five out them in a vertical zig-zag formation.  They almost looked like the number &quot;3&quot; in the sky.  They were suspended and not moving. Over the course of watching them, they flickered out, from top to bottom. We got a picture but it was when there were only 3 left, and it's not that great.  Tried to get video to no avail.",
      "link": "http://www.nuforc.org/webreports/093/S93206.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7a4",
      "summary": "We saw 3 orange lights about 50-100 feet apart moving in tandem up in the sky.",
      "city": "erie",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "We saw 3 orange lights about 50-100 feet apart moving in tandem up in the sky. My husband and I were driving west across 26th at Peninsula and saw some strange orangish lights traveling in front of us up in the sky.  There were 3 lights in a kind of a arch in the sky at least 50-100 feet apart.  When I looked I could only see the lights and no other object attached.  There was absolutely no noise.  The lights kept a uniform distance from each other and moved in tandem.  Just as I thought we were getting closer to them they started going north and disappeared or left the sky. REALLY this was so WEIRD.   There was at least one car pulled over with people looking and pointing at what we were seeing.",
      "link": "http://www.nuforc.org/webreports/090/S90871.html",
      "state": "PA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bda15",
      "summary": "Bright White Light in the Sky.",
      "city": "erie",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "Bright White Light in the Sky. Me and my sister went outside to take my dog out to do her business when my sister stumbles upon something in the sky which seemed to magically appear because when we looked in that direction when we first came out of the house there was nothing there.  It was coming from the east side direction going north.  We paused and just started staring at the unusual big bright light in a circle shape.  It was just slowly moving forward and seemed to rock sideways as it moved slowly.  It made no sound and continued moving until we could not see it anymore because of the trees that was blocking the view.   am sure it was not a star or flare or anything like that because it was constantly moving, and there was many stars out but they were all still except for this and it wasn't high in the sky to say it was a star. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91518.html",
      "state": "PA",
      "duration": "3 mins and continued..."
    },
    {
      "_id": "64d005f478aba2ec5a3be0f1",
      "summary": "March 16, 2012 ufo fireball sighting!",
      "city": "erie",
      "shape": "fireball",
      "date": "2012-05-29T00:00:00",
      "story": "march 16, 2012 ufo fireball sighting! At approximately 9:00-9:15 pm est I witnessed a fireball going west to east as i was driving up peach street in Erie pa. I was at stop light looking south as I seen what appeared to be a high definition fireball flying at such a even speed as if it was never going to stop until it crashed into something. It also appeared to be going on such a straight path.  It was not like a shooting star where u barely have time to see.  It was like a computer animated fireball that gracefully cut through space for 5-8 seconds till it dissappeared.  I can't believe I'm the only one to see this UFO or super advanced technology.",
      "link": "http://www.nuforc.org/webreports/089/S89169.html",
      "state": "PA",
      "duration": "9:15"
    },
    {
      "_id": "64d005f478aba2ec5a3be397",
      "summary": "Two groups of bright red lights hovered and moved independently in all directions for about 10 minutes over Erie, PA.",
      "city": "erie",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Two groups of bright red lights hovered and moved independently in all directions for about 10 minutes over Erie, PA. I was walking out of a convenience store to my car a little before 8:30pm on September  23, and I noticed 3 very bright red lights in the sky, hovering in a triangle formation.  I couldn't figure out what they were; it was very cloudy, so I realized these couldn't be stars or planets because they were below the cloud cover.  As I continued to watch them, I noticed they were moving, flying up, down, left, right; and they moved independent of each other, so they were not connected to one aircraft.  As I watched the three red lights, a fourth one came flying from over the store into my field of vision very fast, then stopped on a dime near the other three and just hovered there next to them.  Then all 4 of them hovered, and would individually fly slowly to the left and down in my field of vision.  Then, 2 of them flew very, very close together, like they were almost touching, then separated again.  Then, one by one, they each appeared to flicker out--which prob! ably means they flew higher up into the cloud cover and out of my sight.  I watched this group for about 3 or 4 minutes. I sat there in my car a few more minutes, and sure enough, two more red lights flew from over the store into my field of vision, so they were flying from south to north.  I called my parents, who live a block away from the store, and they ran outside and saw these ones.  As I was talking to them on the phone, another one flew from south to north and joined these other two.  They hovered and flew subtly back and forth, independently, for several minutes.  Then, just like before, two of them flew so close together that they appeared to touch.  Then, they each flickered out, one by one, disappearing into the clouds. A friend of mine, who lives 1 block north of the store, said that a group of people were standing in a parking lot across the street from his house, and they were pointing and shouting things about the sky.  He regrets not going outside to look for himself. I don't know if these events are related to these UFO's, but the Internet stopped working for several hours all over the east side of Erie, and a firefighter friend of mine reported that the power went out in half of the borough of Wesleyville, which is where I saw these objects. I personally witnessed these two groups of red UFO's for about 10 minutes total, but they were already in the sky when I came out of the store, so I don't know how long they were visible before I saw them.  I don't know if the second group of 3 UFO's were the same ones I saw minutes earlier (in the first group of 4), or if there were 7 different UFO's.  There was no sound associated with this event. I am 37 years old, and I've never seen anything like this before.  I am a church music director, and I was coming home from working with my church's youth group when I saw these UFO's.",
      "link": "http://www.nuforc.org/webreports/093/S93041.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be407",
      "summary": "Witnessed two incredible UFOs heading east Erie, PA 6/30/12.",
      "city": "erie",
      "shape": "sphere",
      "date": "2012-07-04T00:00:00",
      "story": "Witnessed two incredible UFOs heading east Erie, PA 6/30/12. I had just arrived home, my friend was waiting outside my apartment in his car.   As we started to walk towards the apartment he stops me and says look when we first saw a bright orange object traveling east in the sky at an incredible speed and then soon after a bright white object appeared dimming out and then disappears also heading east.  Even some unknown young woman saw the object and was in shock.",
      "link": "http://www.nuforc.org/webreports/090/S90274.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be56e",
      "summary": "Fireball over Erie Pa. 8/18/12 duration, no more than 4 minutes.",
      "city": "erie",
      "shape": "fireball",
      "date": "2012-08-19T00:00:00",
      "story": "fireball over Erie Pa. 8/18/12 duration, no more than 4 minutes. Observed fireball, traveling east to west/southwest in the sky over Erie, Pa.  It started at a low altitude out of our eastern sky and as it traveled toward Ohio, gained both altitude and speed as it traveled.  I don't think it took more than 3.5 to 4 minutes, for this to happen.  I watched it climb until it disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91932.html",
      "state": "PA",
      "duration": "3.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf752",
      "summary": "3 silent fireballs over Lake Erie shoreline.",
      "city": "erie",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "3 silent fireballs over Lake Erie shoreline. First ball appeared in western sky just after midnight, appeared to be low altitude, silent, moving east on a direct path travel.  At the closest point over head it appeared to have a dark triangle protruding from the north and south sides of the object.   As it neared the eastern horizon over the Lake Erie shoreline another identical object appeared in the west and moved in a similar path of travel.   As this one disappeared on the eastern horizon a third similar object appeared over the west as well.  This one moved in a similar direction.  This final object appeared less direct in its path of travel ....almost wobbly for lack of a better description.   The \"fireball\" appeared to waiver and as it moved towards the eastern horizon it seemed to gain altitude until it disappeared.",
      "link": "http://www.nuforc.org/webreports/098/S98657.html",
      "state": "PA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfbbd",
      "summary": "Cylinder ufo seems to be letting out round orbs in broad daylight.",
      "city": "erie",
      "shape": "cylinder",
      "date": "2013-08-30T00:00:00",
      "story": "Cylinder ufo seems to be letting out round orbs in broad daylight. I live in  Erie, Pa,,,  I was sitting in my backyard on my patio when I noticed a airplane going over at a pretty low altitude.  That wasn't too unusual since there is a airport in  the area.  The plane was kind of different since it had a double tail connected with like a bar between them.  I was still looking up when I noticed this silver metallic looking craft slowly going over head,it was hard to judge just how high it was but it clearly visible to the eye.  The craft appeared to either change shape or was spitting out something from the rear like balls of light.   I didn't have a camera with me so I took out my cellphone an took some pictures and some videos of it.In the first video u see the cylinder object looking like balls of light coming out of it the next two don't have the cylinder object just round balls of light.  The sky was blue without a cloud in sight.  See what u think.",
      "link": "http://www.nuforc.org/webreports/101/S101563.html",
      "state": "PA",
      "duration": "~3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfbbf",
      "summary": "Cylinder object floats over no noise",
      "city": "erie",
      "shape": "cylinder",
      "date": "2013-08-30T00:00:00",
      "story": "cylinder object floats over no noise I was sitting in my backyard when I noticed a plane go over not  unusual there is a airport 10-15 miles from here except  this one was kinda big flying low with one of  those double tail.aircraft with like a dividers between the tails a few minutes after that I noticed a object floating in the sky there was no clouds blue sky looked like a cylnder or cigar but most have been really high cause could not really judge size because it was high up I just know what I saw.   The object was going real low slow no sounds but it was reflecting in a all clear blue sky.  The object traveled from the northeast from the direction of lake Erie and passed my backyard and headed southwest till I couldn't see it anymore.what caught my attention was the speed to slow for a plane or chopper  it reflected light looked silver,and metallic.  what I saw next made me wonder what was going on ,  the object either changed or well in the pictures something either flashes change shapes can some o! ne tell me.  If anyone has had a similar experience l forward to see a post.",
      "link": "http://www.nuforc.org/webreports/101/S101467.html",
      "state": "PA",
      "duration": "1:13"
    },
    {
      "_id": "64d005f478aba2ec5a3c080f",
      "summary": "((HOAX??))  Ufo visiting my neighbors.",
      "city": "erie",
      "shape": "disk",
      "date": "2014-03-18T00:00:00",
      "story": "Ufo visiting my neighbors I have seen it lowering into a residential place at night i was scared And didn't continue to watch. It was quite close to where i live. It was dark Out but the craft was bright enough for me to see it clearly at night. One other day i saw a couple of them one in the distance over the lake and Another closer over the lake. The one closer was just hovering above the lake For a few seconds then went straight up to meet the other one That was further away. They were moving in a very strange way that i have not seen In our air crafts. Obviously. No i was not high or drunk i am not crazy but i am kinda scared And i am %100 sure of what i have seen. ((NUFORC Note:  We suspect that the report is a hoax.  Date of alleged sighting is approximate.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107681.html",
      "state": "PA",
      "duration": "5-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c14c9",
      "summary": "Extremely bright white light!!",
      "city": "erie",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "extremely bright white light!! Seen in Erie, PA 11:20pm 11-5-13. Viewer was in suburb of Erie.  Object was south of him. He said it was way up in the sky. He had to tilt his head back to take the pic.  The angle was similar to if the object were 10 ft. above the building next to his house.  It was a cloudy night.  The object appeared to be high, but below the clouds. -Called 911.  They had received no reports.  They said to call the airport. -Airport didn't answer that night. When called the next morning, they said that there were no reports of anything unusual on the radar. The light field was two football fields and was very bright. Viewer visually boxed it in making a frame with his thumb and forefinger about a foot from his face.  Said it measured approx. 3” within that box. -Picture was shot with Canon gl2.  Second, brighter, picture was enhanced. -Object appeared to be completely motionless, like a picture held up in the sky. -Duration of event was approx. 8 minutes. He just stared at it at first.  Then he went inside and got his camera, and it was still there, unmoved, when he returned.  Went back inside to get a video cassette, and when he returned, it was gone. -Thoroughly checked the area in daylight to be certain that it hadn't been something that is always there, but was temporarily lit.",
      "link": "http://www.nuforc.org/webreports/104/S104239.html",
      "state": "PA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17ad",
      "summary": "At approximately 23:55, 2 students witnessed a Large Mulicolor Aura fell in Erie, PA.",
      "city": "erie",
      "shape": "fireball",
      "date": "2014-06-04T00:00:00",
      "story": "At approximately 23:55, 2 students witnessed a Large Mulicolor Aura fell in Erie, PA. I was walking with my boyfriend on Mercyhurst Campus.  I looked up in the sky  facing West, and saw this very large ball of light.  By natural instict, I hit him and yelled, \"Check it out a shooting star!\"  He turned around and missed it.  It fell behind a building in a direction toward downtown toward Lake Erie.  I thought I explained that it wasn't like a normal shooting star.  It was MASSIVELY Larger.  Another student was on campus by us and he looked at me asking if I saw that thing fall in the guy.  I agreed.  And we just looked at each other and he said, \"Do you think it was a UFO?\"  I said, it clearly wasn't a shooting star.   We both discussed and shared Identical description of the falling object.  It looked at if a massive form of light was behind a cloud, it changed colors rapidly from like a lilac, to a turqouise, to a seafoam green sometimes more than one color at once, it was just fluidly multiple colors.  The size was clearly bigger than! any manmade aircraft. It gasous size was probably the size of our sun during the winter sky.  Like the size of one's thumbnail.  Big.    We both saw it fall in the same direction, down toward Lake Erie, but it fell behind the large building on campus.  It moved quietly and at a constant speed, the direction appeared though as it was crashing, but it fell being the building. But I guess it best to sum up we saw:  A large light source much bigger than a man made air craft crashing through the sky covered in a turquoise/violet/seafoam green light.",
      "link": "http://www.nuforc.org/webreports/109/S109285.html",
      "state": "PA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a10",
      "summary": "Two very bright orange objects moving strangely in the western sky of Erie, Pa.",
      "city": "erie",
      "shape": "changing",
      "date": "2014-06-04T00:00:00",
      "story": "Two very bright  orange objects moving strangely in the western sky of Erie, Pa. Two bright orange objects low in the western sky at approximately 10:00 pm.   They would hover next to each other then one would move up into the sky kind of stretching out as it did so then returning to previous shape.  They moved around for over 7 minutes each time returning to approximately the same point as we first saw them.  I went into the house to get my girlfriend ad when I came back out the neighbors said they just took off at an extremely high rate of speed.",
      "link": "http://www.nuforc.org/webreports/109/S109619.html",
      "state": "PA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1bc7",
      "summary": "Four large round orange lights, low in the sky for at least a minute and then disappeared.",
      "city": "erie",
      "shape": "sphere",
      "date": "2014-07-20T00:00:00",
      "story": "Four large round orange lights, low in the sky for at least a minute and then disappeared. My husband and I were driving when off to our left we saw four round orange lights low in the sky.  They were in a zig zag formation.   The lights were steady but we couldn't tell how low they were.   One light moved off a bit. I pulled over to look at them but they were gone.  They were nowhere to be seen.  I am a retired govenment worker and he is the owner of a machine shop.",
      "link": "http://www.nuforc.org/webreports/111/S111638.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c24e1",
      "summary": "Huge dark disk slowly rotates over Erie, Pa",
      "city": "erie",
      "shape": "disk",
      "date": "2014-11-06T00:00:00",
      "story": "Huge dark disk slowly rotates over Erie, Pa I live in Erie, Pa on Sunday evening, October 1,2 at approximately 20:45 pm I went out back to smoke a cigarette. It was cloudy out very dark grayish clouds.While looking up at them I noticed they huge disk just below the clouds slowly floating over while rotating to the right. I had the back lights out so I got a pretty good look at it it was dark like the clouds kinda grayish like it was blended in with them.  The shape was as  if you took 2 frisbie turned one upside down and glued them together.  It was almost silent but you good hear like a electrical kind of sound very slight.  It floated off in a southwest direction.",
      "link": "http://www.nuforc.org/webreports/114/S114493.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c26bc",
      "summary": "Space debris or something else falling straight down nearby like a burning ember.",
      "city": "erie",
      "shape": "light",
      "date": "2014-10-10T00:00:00",
      "story": "Space debris or something else falling straight down nearby like a burning ember. It was still light outside but nearing dusk; I was walking outside and ahead of me and to the left (northwest of Erie) a yellowish-white fireball dropped out of the sky, splitting off at one point so there was one larger and one smaller piece beside it falling.  This may have been a meteor or satellite fragment, and was falling more like a huge burning ember and not like a typical meteor streak.  It appeared to be relatively close but the other person who saw it was also in Erie, and I'm unaware of additional reports from other nearby cities that may help to triangulate the exact location.  I noticed it start falling at about 45 degrees below the horizon and it \"fizzled out\" about 20 degrees later (about halfway to the ground from the time it was first seen). I've seen a good number of fireballs and meteors, but only a handful of these close ember-like balls over many years.  I felt extremely charged up after the sighting and couldn't quite explain why, but it was like something changed in the air; other people who hadn't seen it also seemed extra charged up.   The next morning the UFOs were seen over Breckenridge, about 60 miles away as the crow flies. ((ADDENDUM FROM WITNESS)) This is an amendment to the report just submitted from Erie. The object was first seen at 45 degrees ABOVE the horizon, not below the horizon  (alternately it could be said to be first seen at 45 degrees below zenith, but not below the horizon of course). ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/114/S114324.html",
      "state": "CO",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4886",
      "summary": "A very large, dimly lit triangular formation moved silentlly from west to east, blocking the stars behind it as it passed.",
      "city": "erie",
      "shape": "triangle",
      "date": "2015-11-20T00:00:00",
      "story": "A very large, dimly lit triangular formation moved silentlly from west to east, blocking the stars behind it as it passed. While in my backyard looking north towards lake Erie, a large triangular shaped formation of faint lights was traveling from west to east.   The formation moved silently as it passed by, blocking out the stars behind it and the very large size of the object became apparent.   There was another string of lights traveling with it that may have been a second triangular object partially blocked by the main triangular formation.",
      "link": "http://www.nuforc.org/webreports/124/S124207.html",
      "state": "PA",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a09",
      "summary": "Disc bright light around military aircraft.",
      "city": "erie",
      "shape": "disk",
      "date": "2015-08-27T00:00:00",
      "story": "Disc bright light around military aircraft. It was an early morning, I was doing my job as newspaper carrier.  It was a clear night sky and i was busy doing my job.  As i look up into the sky, i notice a military aircraft in the sky it was flying pretty low so i stopped and watched it fly over me.  As the airplane starts getting closer all of a sudden the aircraft lights (headlights and blinker lights go out)  So then, i am like where did this plane go can't see it at all.   All of a sudden the planes lights turn back on and right when these lights turned back on this disc-ball of light flew fast behind the aircradt made a shot straight up and vanished. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121137.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4bf2",
      "summary": "Large circle of light over house in front of me, the lights were spacing around and were in sync with the tapping on my window.",
      "city": "erie",
      "shape": "circle",
      "date": "2015-09-11T00:00:00",
      "story": "Large circle of light over house in front of me, the lights were spacing around and were in sync with the tapping on my window. I was laying on my bed on my phone and I kept hearing a light tapping noise on my window.  At first I ignored it but it keep repeating for maybe 20 seconds.   I initially thought it might have been a moth or a bug flying into my window so I opened the blinds.  I was in shock about what I saw.  There was a large circle over the house in front of me with blinking lights and the lights were spacing around but it was in sync with the tapping on my window.  It lasted about 20 seconds and then disappeared.   I later called a friend in shock and explained what I had saw and then I heard the tapping on my window beginning and my friend had heard it too.   I later went downstairs and spent the rest of the night down there.  Still in shock about what I had seen, I can't describe the fear and shock I am in.",
      "link": "http://www.nuforc.org/webreports/121/S121714.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c50bd",
      "summary": "5-6 objects flying in v formation",
      "city": "erie",
      "shape": "triangle",
      "date": "2016-02-19T00:00:00",
      "story": "5-6 objects flying in v formation On a somewhat windy and foggy night, I saw what appeared to be 5 or 6 objects in a triangle formation out of a small side window of my house, towards the west I think.  I did a double take and really only caught a quick glimpse, but it was dark and foggy and it stood out very oddly to me.  My immediate thought was maybe Canadian geese migrating, as I've seen a lot of them lately, so I ran to the window as soon as I saw it to confirm, and it was already gone.  Whatever it was, it was moving way too fast to be geese, there was no sight of anything by the time I moved to check....there's no way birds could move that fast. It could have been military planes in flying V formation - that's my only guess.  The Erie Airport isn't very far from here...but it's usually only small private planes that fly into that airport…I don't know what I saw, but it was strange.",
      "link": "http://www.nuforc.org/webreports/125/S125838.html",
      "state": "CO",
      "duration": "2-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6225",
      "summary": "Star-like light traveling past the stars but much slower than a satellite",
      "city": "erie",
      "shape": "light",
      "date": "2016-09-09T00:00:00",
      "story": "Star-like light traveling past the stars but much slower than a satellite My husband and I stepped out on the back deck to look at the stars, and I noticed an area of the sky to the SSW, about 2/3 the way to zenith, where something wasn't quite right.  Almost like there should be a satellite there - was something moving?  That's when my eyes zeroed in on a point of light, like a star, moving very slowly among the stars.  It moved in a mostly straight line almost like a satellite, but much slower - maybe a third the speed.  It may have meandered a bit, but that was hard to say as it was moving so slowly.  It grew dimmer over the course of 2 or 3 minutes, at which time we lost sight of it, it having moved no more than 10 degrees during that time.  I couldn't find anything on heavensabove that would indicate it was a known satellite.  My impression was that it was of an aircraft of some sort, flying at a very, very high altitude.",
      "link": "http://www.nuforc.org/webreports/129/S129720.html",
      "state": "CO",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6474",
      "summary": "4 triangular shaped craft in formation, no lights, no noise.",
      "city": "erie",
      "shape": "triangle",
      "date": "2016-08-25T00:00:00",
      "story": "4 triangular shaped craft in formation, no lights, no noise. Saw 4 triangle shaped craft coming in from NW.  No noise.  Seemed to be fairly low (maybe 500 ft. or less).  Flying in formation that changed, seemed to arrange vertically one on top of another.  Pale, with a faint pink/salmon color (my wife thought red).  No lights.  Turned slightly SE and flew off in that direction.   Waited about another 10 minutes, then gave up.  Too late and too fast for parachutes or hang-gliders.  No lights whatsoever so could not be commercial craft.",
      "link": "http://www.nuforc.org/webreports/129/S129433.html",
      "state": "CO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7054",
      "summary": "Hovering neon green circular light, seemed to be unmoving and lower to the ground than normal aircraft.  ((anonymous report))",
      "city": "erie",
      "shape": "light",
      "date": "2017-07-23T00:00:00",
      "story": "Hovering neon green, circular light, seemed to be unmoving and lower to the ground than normal aircraft. Hovering neon green light, appeared to stay in one place. witness was in a moving vehicle and stated that the light appeared to be in one stop the entire ride, or moving very slowly. shape of light was ovular, disk like, or circular. light seemed to be lower to the ground, lower than an airplane.",
      "link": "http://www.nuforc.org/webreports/135/S135274.html",
      "state": "PA",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c82cd",
      "summary": "Unknown lights in tandem disapeared and reapeared",
      "city": "erie",
      "shape": "light",
      "date": "2018-11-09T00:00:00",
      "story": "Unknown lights in tandem disapeared and reapeared driving down the road and saw two extremely bright lights very close to each other, lights then faded until they disappeared, about 30 to 45 seconds later the lights came back on and backwards dimmed would be the best word i could describe.  They dimmed from very very low brightness to extremely bright where they were radiating and reflecting light with streaks coming off of them it was brighter than anything I've ever seen before.  The lights then we're stationary and completely disappeared like they were turned off.  After the Lights disappeared 3 airplanes we're flying at a rapid speed and making maneuvers in a zigzag motion.   I've seen this motion before since I was in airforce for eight and a half years, all three aircraft were doing maneuvers in the shape of a Z. ((NUFORC Note:  We spoke via telephone with the source of the report, and he seemed to us to be quite sincere and sober-minded.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143640.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c872b",
      "summary": "First thought it was a Lifestar medivac helicopter taking off from Saint Vincent Hospital which is nearby. ((MUFON Report))",
      "city": "erie",
      "shape": "light",
      "date": "2018-07-19T00:00:00",
      "story": "First thought it was a Lifestar medivac helicopter taking off from Saint Vincent Hospital which is nearby. The witness works at a bayside outdoor bar as a doorman.  He was collecting cover charges from patrons as they entered the bar and appreciating the bayfront skyline, most notably the Port Erie Bicentennial Tower which dominates the skyline view of Dobbins landing which is the name of the district that the bar and tower are situated in.   He first noticed the object because he believed that it was a Lifestar medivac helicopter taking off from Saint Vincent Hospital which is near the place of the sighting.  It began blinking different colors alternating between red, green and then blue and white at random intervals.  It stopped and hovered in mid air and then began making bizarre right angle turns and wild oscillation in altitude before beginning lazy swoops over the bay and then heading over to Presque Isle across the bay before coming back towards the bar. (out of respect for his employers he will let them remain anonymous) it moved from NE to SW, circled the tower a few times and then began to sweep back and forth over Dobbins landing.   His immediate reaction was to observe it and conjecture what it could possibly have been.  It was too small and too quiet to be a helicopter, but the range was too far for a civilian drone and the night was too dark to be taking drone photography.  He attempted to point out the craft to a leaving patron; who was unfortunately too intoxicated to take notice of the craft.  The craft then traveled up above State Street proceeding to the S and then ascended above the cloud cover and dissipated into the cloud cover or was obscured by the light pollution of the city.  His immediate reaction was to tell his friends and immediately try and write down everything he had seen in complete detail.  He communicated this via a smartphone to three of his friends.",
      "link": "http://www.nuforc.org/webreports/142/S142307.html",
      "state": "PA",
      "duration": "several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c93ae",
      "summary": "Bright flashes in eastern sky appearing to come from the ground, noticed at a distance in the Easter sky that there was a bright object",
      "city": "erie",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "Bright flashes in eastern sky appearing to come from the ground, noticed at a distance in the Easter sky that there was a bright object flashing bright and not moving. Sky is very clear it is still there now. Used binoculars and the object seemed very large stationary and flashing red blue and white lights. It slowly moved south then back to original position. Upstairs through the window with binoculars the object appears to be wide. It had abruptly moved south and still is the same size and not moving.",
      "link": "http://www.nuforc.org/webreports/150/S150337.html",
      "state": "PA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9787",
      "summary": "They all came from a dark area of the sky.  I looked up and saw 2 what I thought were Satellite's moving West to East",
      "city": "erie",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "They all came from a dark area of the sky. But like they were coming out of something darker than the space around them. Like watching items come off a conveyor belt in a factory. It was almost mechanical in feel.  They all traveled from the southwest to the northeast. They went in a mostly single file pattern. One after another.  All looked similar to venus looks from earth(bright white lights)  They all continued northeast until fading out of view. Took about 20-30 seconds to cross the sky beginning to end.  Every few objects another would travel next to one like an escort. On northern side of line of objects.   I saw like a flare type white streak under them a time or two.  I could see sever small dimmer objects observing from what appeared further away. I would guess 3-4.  If I were to guess direction of objects travel I would guess Hudson Bay or Baffin Island from southeast Kansas.  I was so in awe I didn't think to try and capture with phone until afterwards. Used old picturesto give example.  I have seen a lot if odd thing's from the wilds of Idaho to Texas my entire life. I watch things by my nature. I never ever saw unknown objects so numerical or almost robotic in feel. Nothing that I felt compelled to share, ever.  There was air traffic and don't know how this wouldn't be seen from a large radius.   It was very clear and very open and easy to see. I am still rattled 14+ hours later",
      "link": "http://www.nuforc.org/webreports/150/S150959.html",
      "state": "KS",
      "duration": "minutes"
    }
  ]
}