{
  "city": "eugene",
  "fetch_timestamp": "2025-07-12T14:37:11.937427",
  "record_count": 99,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b5683",
      "summary": "Diamond broach shape over Eugene, OR.",
      "city": "eugene",
      "shape": "triangle",
      "date": "2007-11-28T00:00:00",
      "story": "Diamond broach shape over Eugene, OR. I was returning from taking my kids to ballet class.  It must have been winter, because it seems to me it was dark early.  As I pulled into my driveway in the north of town, I saw a huge \"diamond broach\" shape in the sky, south-southwest.  It was humungous.  If I had put my hand up, my palm would have just covered it.  It was a triangle, point up, with lights in rows inside the triangle, like diamonds.  I don't recall how many.  It could have been 6 (1 at the point, 2 in the next row, then 3 on the bottom row), or there was another row, making 10.  It wasn't moving and didn't make a sound.  I could see lights from helicopters and small planes heading towards it from every direction.  I jumped out of the car to see it better, but my kids freaked.  They ran to the house, begging me to open the door and come in.  They didn't want it to come get us.  My kids were very young at the time, the oldest about 7, the youngest at the time 4.  I don't know why they thought this thing would take us away, and I wasn't showing fear, but rather fascination, so I'm not sure whey they reacted with such terror.  For them I went inside.  Later that night, or possibly the next night, I chatted with someone on Prodigy (remember that!?) who claimed to work out at the airport in Eugene (the airport was north of the object, behind me while I was watching the triangle).  She said there was some sort of sighting, a report made even, and no official announcement of what it was, but supposedly it was noticed by the airport, or perhaps reported by them.  Again, I can't be sure of the date, but it must have been Fall or winter of 1996, or perhaps late winter of 1997, although I don't remember it being cold, just dark early. It could even have been the year before. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60014.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b627d",
      "summary": "silent, black and \"X\" shaped",
      "city": "eugene",
      "shape": "cross",
      "date": "2007-10-08T00:00:00",
      "story": "My wife spotted something in the North East sky and ran in and got the binoculars while I kept track of it. It was silent, black and \"X\" shaped. It was too far off to get any real details but it was not a plane or balloon. It was moving very slow, almost stationary, just kinda hovering slowly away from us.",
      "link": "http://www.nuforc.org/webreports/058/S58560.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6367",
      "summary": "Very black missile type craft, no windows, large, and agile as it crossed the sky and it turned and flew away",
      "city": "eugene",
      "shape": "cylinder",
      "date": "2007-11-28T00:00:00",
      "story": "Very black missile type craft, no windows, large, and agile as it crossed the sky and it turned and flew away Missile shaped craft all black no windows two short wings near front and a square tail end, at the distance I saw it looked like the size of a 727 aircraft at 400ft.   It moved in a circular turn across my wind shield then moved away frontwards at a very fast pace, when I first noticed the craft it was moving to slow to keep its altitude with the very short front wings it had, and the turn ratio was a floating type 180 degree turn ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59517.html",
      "state": "OR",
      "duration": "18 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b67fb",
      "summary": "Black, round, flat, disc flying twisting spiral pattern over the Eugene, Oregon morning sky.",
      "city": "eugene",
      "shape": "disk",
      "date": "2008-03-31T00:00:00",
      "story": "Black, round, flat, disc flying twisting spiral pattern over the Eugene, Oregon morning sky. I went outside to smoke my morning cigarette this morning (Thursday 3/6/2008, @ 7:28 AM exactly) when I noticed something out-of-the-ordinary flying in the sky to the east of me.  At first I thought it was a bird, but when no wings were moving I focused in on it with my eyes and figured that it had to be a loose 'weather' balloon, or any type of balloon for that matter, ascending into the sky with the help of the wind.  Then I realized that there was no way it could be a balloon either.  As it continued to travel toward me (to the west) and further North, I was staring at it as its path advanced very quickly throughout the sky.  I could see it moving like no other 'balloon in the wind' would ever move.  It was completely black and its shape was changing as it traveled through the air to the north before disappearing in the light layer of clouds that was layering the sky over the valley this morning.  It was clearly a thin (relative to my perspective), perfectly round disk of some sort, and while it flew, it spiraled and twisted like a flat Frisbee, a CD, or a flat rock would spiral if you were to throw one into the air.  It was twisting on it's axis while flying through the air (could not tell if it was spinning or not) very gently and softly but moving very fast though the sky.  The sighting lasted for about 2 minutes...from the moment I spotted it directly East of where I was standing, until the time it disappeared due North from my position.  I could see that it had a perfectly round shape when the angle was right, and I could also see its flatness when it shifted just enough on its side in the middle of its flight.  Its flight pattern was just like that of a bent Frisbee when thrown upside down...you know, it spiraled, sort of rotating on its lengthwise axis, as it flew, kind of twisting as its path advanced.  If you've ever thrown a CD into the air, it was flying almost exactly like that, but proportionately, probably not as fast as a CD flung in the air.  It had very slow, smooth, ! almost f loating dynamics that made it seems like it was hovering almost...but it seemed like it was moving at a constant rate throughout the sky.  I could see its round profile and its flat profile as it spun/spiraled, depending on its position in flight relative to my point-of-view.  Its color was black, but it may have been that it was being silhouetted or shadowed or the like.  It was a flat, round disk, twisting and spiraling through the sky about as fast as it would take a small airplane to fly across that much airspace.  If one side was the \"top\" of the disk, and one side \"the bottom,” I must have seen the top and the bottom about 6 to 8 times each.  That is about how many rotations it made on its axis.  Its size was not determinable, and the altitude at which it was flying was also not determinable, so I cannot make any postulation as to any of those details.  I have never in my life believed in any sort of inexplicable flying objects of any sort.  I always thought that people that believed they saw UFO either had overactive imaginations or were just ignorant in terms of existing aircraft, or a combination of many other factors.  I do not wear glasses and I have perfect 20/20 eyesight in each eye. This was my first time ever seeing what in my mind, I guess, HAS to be a 'UFO', meaning there is no way I can explain what I saw based on my own first-hand experiences.  I have never believed in \"UFO's\" simply because I have never witnessed, first-hand, anything that I would qualify as such...there always seems to be an explanation (and there probably is one in my case, with my sighting this morning too!...I just don't have one right now!).  I always said that unless I see one myself (or a Sasquatch for that matter) I can't logically claim to believe in them.  This is my first ever 'UFO' sighting.  I even caught about 30 seconds of what I thought would be good footage using my cellular phone's video application...to no avail.  Immediately upon recording the sky, I could tell that there was nothing visible showing up on my phone's screen.  Nothing showed up during the recording process and there is nothing at all on the footage I have saved on my phone...just the hazy morning sky...no black spot, no nothing!....the object must have been too far away to register on my phone (a 2 Mega-pixel camera-phone).  That is all I have to report.  Conveniently, I am making this report here because I happened to see your website on TV; a History channel special on \"the grays\" which ran last night, and that is how I knew that this is the place to come if I ever needed to make a report.  Well, wouldn't you know it...the day after that is the day I have my first UFO sighting.",
      "link": "http://www.nuforc.org/webreports/062/S62075.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b73e7",
      "summary": "Nice clear night. First time in a while. Walking in dark area of west eugene this night. Sun had set but horizon to east still some gre",
      "city": "eugene",
      "shape": "unknown",
      "date": "2008-03-31T00:00:00",
      "story": "Nice clear night. First time in a while. Walking in dark area of west eugene this night. Sun had set but horizon to east still some green and blue. I noticed a very bright high altitude object that looked to be a satallite at first, however, much brighter than I have seen satillites before and moving slower. I still thought nothing of it but watched it for the beauty of it. It then slowed in the sky and made a turn to the northeast. This caused me to give more attention. After about 10 secs more I noticed another smaller object following it at some distance. The smaller object tunrned to follow the same trajectory as the very bright object. Ive seen many satillites in my life and even saw the emrgency space shuttle re-entry landing that took place in California years ago. all I can say is that this was somewhat unusual due to size and 2 ufos with direction change. I have never reported any sighting before. ((NUFORC Note:  Witness elects to remain semi-anonymous;  provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62457.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7481",
      "summary": "Blinking, bright white light seen travelling at high altitude",
      "city": "eugene",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Blinking, bright white light seen travelling at high altitude We stepped outside into the backyard in West Eugene and saw a bright white light that was steadily blinking. It was odd... aircraft generally have one solid white light with a red and green on each side. There was no noise... just a white light that blinked steadily. It moved steadily across the sky, directly overhead, and moved behind some high, very thin clouds. At this point, it disappeared.  I stepped out into the front yard to scan the sky in the direction it was travelling.  It never reappeared! It travelled about the speed of a low-altitude plane, but was as high in the sky as a jetliner.   The light was brighter than a jet would be. Strange!   I have been a field investigator for 18 years. I've spent much of this time investigating Bigfoot reports for Oregonbigfoot.com, of which I am the director.  However, I've spent many years following up on UFO reports as well. I'm very aware of the appearance of planes and jets at all altitudes.  This did NOT have the appearance of those. I would add that there have been two occasions in the last few months that my research partner and I have been up near Oakridge, Oregon and have seen steady, bright white, soundless craft moving across the sky.  I captured these on film on one occasion.",
      "link": "http://www.nuforc.org/webreports/062/S62031.html",
      "state": "OR",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7559",
      "summary": "I WAS WITH MY GRANDMOTHER AND WE WERE ON OUR WAY TO A FARM TO GET SOME PRODUCE WHEN SHE TOLD ME TO LOOK OUTSIDE OF THE CAR WINDOW BECAU",
      "city": "eugene",
      "shape": "unknown",
      "date": "2007-08-14T00:00:00",
      "story": "I WAS WITH MY GRANDMOTHER AND WE WERE ON OUR WAY TO A FARM TO GET SOME PRODUCE WHEN SHE TOLD ME TO LOOK OUTSIDE OF THE CAR WINDOW BECAUSE SHE SAW AN OBJECT IN THE SKY NEAR SOME CLOUDS IT WAS SILVER IN COLOR. IT WAS NOT MOVING REAL FAST THERE WAS NO MARKS ON IT AND I COULD NOT HEAR ANY SOUND COMING FROM THE OBJECT.  WHEN I GOT TO THE FARM THE SILVER OBJECT HAD DISAPPEARED",
      "link": "http://www.nuforc.org/webreports/058/S58039.html",
      "state": "OR",
      "duration": "5 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a49",
      "summary": "formation of lights 4 white 1 red with amazing sign-wave pattern over entire craft.",
      "city": "eugene",
      "shape": "formation",
      "date": "2006-10-30T00:00:00",
      "story": "formation of lights 4 white 1 red with amazing sign-wave pattern over entire craft. I viewed a formation of lights that came in from the north east and traveled south, four white lights and one red, they hovered in the sky briefly then flew directly over head, there was no sound and no contrail, these craft had no visible navigation or anti-colision lights.  I was amazed as they passed over head the craft were brightly lit, and the light seemed to move around them in a sign-wave pattern like you might see on a oscilloscope or frequency generator, and they were all at the same frequency.  I am a pilot and licensed mechanic with a strong background in engineering and design, I have been viewing aircraft for thirty years  I have never seen anything quite like this I had my camera and was able to get a couple of photos, these craft were faster than normal aircraft I only had time to point and shoot,  I think it is very notable that this sighting had taken place on a day with heavy (chem-trail) spraying? Thanks.",
      "link": "http://www.nuforc.org/webreports/053/S53145.html",
      "state": "OR",
      "duration": "2-3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f8a",
      "summary": "We saw a glowing orange sphere in the sky, which moved south steadily then abruptly gained altitude and disappeared.",
      "city": "eugene",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "We saw a glowing orange sphere in the sky, which moved south steadily then abruptly gained altitude and disappeared. We saw a glowing orange sphere in the sky.  It moved south steadily, then abruptly gained altitude and disappeared.",
      "link": "http://www.nuforc.org/webreports/072/S72043.html",
      "state": "OR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b83d4",
      "summary": "This report confirms another sighting posted in Eugene Oregon on this date.  I saw the entire event.  I was walking across 6th street t",
      "city": "eugene",
      "shape": "disk",
      "date": "2009-03-19T00:00:00",
      "story": "This report confirms another sighting posted in Eugene, Oregon on this date.  I saw the entire event.   I was walking across 6th street to the store, when I heard a group of people yell \"woah\".  They were looking up and a red glowing disk had dropped from a bright star.  It streaked through the sky to my left, then white lights started comming slowly toward it from far away, they were military jets I presume.   The red craft did a quick 90 degree turn and shot in a matter of seconds into outer space/disapeared.   One guy pumping his gas took a movie with his cell phone and a group of 6 people all saw it. I am sure it was this date because it happened right after the Larry King show which was irronically about UFO's disabling US Nuclear missles.",
      "link": "http://www.nuforc.org/webreports/068/S68338.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b904e",
      "summary": "object that looked like a shooting star made a hard right",
      "city": "eugene",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "object that looked like a shooting star made a hard right It was probably nothing but I thought I was looking at a shooting star going west but then it took a hard right to go north . ((NUFORC Note:  Witness elects to remain semi-anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68412.html",
      "state": "OR",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b9087",
      "summary": "Orange light ascending at a 75 degree angle on a straight trajectory.",
      "city": "eugene",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Orange light ascending at a 75 degree angle on a straight trajectory. @ approximately 9:45 P.M (twilight) on July 4 I was standing in front of my house (facing north) watching the neighborhood firework displays in the distance when I noticed a orange light ascending at a 75 degree angle from the WNW to the NW. At first I thought it was an ember from the mortar shells but its trajectory was as straight as an arrow and was unaffected by the winds aloft. It continued from my first notice for at least 10 to 15 seconds into the high atmosphere and then the light went out. I know this could be dismissed as an ember but it didn't behave like any ember I have witnessed in the past. Being the 4th it could easily be dismissed as a firework related event but after thinking about it for 2 days I thought it worthy of reporting.",
      "link": "http://www.nuforc.org/webreports/064/S64355.html",
      "state": "OR",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b96a3",
      "summary": "A glowing orange light moves swiftly and clean, then dissapears.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2009-08-05T00:00:00",
      "story": "A glowing orange light moves swiftly and clean, then dissapears. It was 11:28 pm on a Wednesday night. I was coming outside of my house to tell my sister she had to come inside, since it was getting late. When I walked toward her out of my front door, she asked “What is that light flying in the air”? As my sister, her friend, and I watched this light is started to move in a zigzag line. I told my sister to try to record it on video on her cell phone. As she started recording I ran inside the house to grab my mother’s video camera. When I ran out side the orange light had not moved much. As I tried to get a good shot of it on the camera, it kept moving. I then zoomed in on the object and it looked like it had markings on it. As I pressed the record button the orange glowing light disappeared. I have no clue what it could have been ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71133.html",
      "state": "OR",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9718",
      "summary": "Circular object that looked like star in blue sky moved slowly south, stopped, changed directions and went north.",
      "city": "eugene",
      "shape": "circle",
      "date": "2010-06-03T00:00:00",
      "story": "Circular object that looked like star in blue sky moved slowly south, stopped, changed directions and went north. Viewed from backyard while watching chem trails in blue sky.  Object looks like star when sunshine relects from it, and like a ring when not.  Object moved very slowly on same path as chem trail only seemed much higher.  It moved unlike any airplane going south at first, then stopping completely for several minutes, then changed directions and began moving north on the same track it seemed to come from.  It showed no trails or exhaust of its own.  Object then got further away until we could no longer see it.  We did capture digital images and video.",
      "link": "http://www.nuforc.org/webreports/075/S75413.html",
      "state": "OR",
      "duration": "8-10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9742",
      "summary": "possible fighter jet chasing UFO",
      "city": "eugene",
      "shape": "disk",
      "date": "2009-08-05T00:00:00",
      "story": "possible fighter jet chasing UFO I was trying to get some orb photos and randomly shot pictures around my yard and up in the sky. I did not see anything with my eyes as I was shooting the pictures. Upon closer examination of the images I noticed a tiny dot in the sky. I zoomed in and on my Laptop display it appears to have a circular energy field around it but very hard to see. The second image has the same object but slightly tilted with the same hard to see energy field but it seems to appear more like a disk. The third image was along the side of a guest house in my back yard. I got a bit of sky in the upper left of the image and it appears to show what looks like a fighter jet chasing the small dot away towards the north of Eugene. I'm emailing the lower resolution images but have high resolution available for further investigation.",
      "link": "http://www.nuforc.org/webreports/071/S71123.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b97e9",
      "summary": "Awaken by several episodes of BRIGHT FLASHING LIGHT and a very LOUD mysterous noise.",
      "city": "eugene",
      "shape": "unknown",
      "date": "2010-02-14T00:00:00",
      "story": "Awaken by several episodes of BRIGHT FLASHING LIGHT and a very LOUD mysterous noise.",
      "link": "http://www.nuforc.org/webreports/074/S74065.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a89",
      "summary": "Something is going on in Eugene, Oregon.  Many sighting from many people across many months.",
      "city": "eugene",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Something is going on in Eugene, Oregon.  Many sighting from many people across many months. Something is going on in Eugene Oregon. If you read the reports for Eugene/Springfield, Oregon, many people are reporting the same type of sighting.  These reports are spread across many months/years. I saw the UFO last night on a walk in west Eugene.   Was a bright light moving across the sky from west to east.  This was about 5 miles south of the Eugene airport and directly in the landing/takeoff path of aircraft from the airport.  If you look at a map of the airport you will see the main runway runs north to south, so this UFO crossed directly across the path of normal air traffic.  I haven't see an airplane ever move in an west to east pattern this close to the airport. Craft details.  I have no idea how to judge the height or speed of the UFO.  It was much too bright and moving to slow to be a satellite.  We did see satellite about 10 minutes after the UFO was gone for comparison.  The craft flew directly over head and was completely silent.  As it moved east, it finally sped up and was not visible any longer. About 30 minutes, we either saw the same UFO or one that looked exactly like it.  It was moving south to north at a rapid pace, but was far to the east of us.  An airplane with blinking light was moving in the opposite direction at the same time, but the UFO was much quicker and appeared to be at a much lower altitude. I also believe we saw this UFO on July 4th.  We were north of the Eugene Airport by 10 miles.  The light appeared to be south of the Airport and stopped hovered for about 10 minutes.  Then disappeared. I would assume this UFO is some sort of manmade device, but it is very hard to speculate on its speed and height as there is nothing to use as a reference.  It also does not follow the normal traffic pattern of aircraft that frequent the airport.",
      "link": "http://www.nuforc.org/webreports/071/S71218.html",
      "state": "OR",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba153",
      "summary": "small dics shaped object, flashing blue, yellow, red, green, white lights moving very quickly in opposite directions, unnatural of anyt",
      "city": "eugene",
      "shape": "sphere",
      "date": "2009-03-19T00:00:00",
      "story": "small dics shaped object, flashing blue, yellow, red, green, white lights moving very quickly in opposite directions, unnatural of anything I have ever seen! air pirrouettes! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68969.html",
      "state": "OR",
      "duration": "45 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1b7",
      "summary": "Sheldon area double UFO sighting",
      "city": "eugene",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Sheldon area double UFO sighting As I was looking into the stars I saw two stars suddenly start to move.  At first only one was moving and my neighbors thought it was a plane then the other star started to move.  The light got bright like it was a landing plane but suddenly dimmed and started going a different dirction and then kept going and slowly faded out.  I am 100%. Sure these were not planes due to there still nature and then getting closer and changing direction multiple times.",
      "link": "http://www.nuforc.org/webreports/071/S71316.html",
      "state": "OR",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb12c",
      "summary": "The Great Northwestern Christmas UFO 2010",
      "city": "eugene",
      "shape": "oval",
      "date": "2011-01-31T00:00:00",
      "story": "The Great Northwestern Christmas UFO 2010 On Dec 31st, 2010, i awoke same as I did every day and went outside first thing and lit up a cigarette.  Upon looking up at the sky, i saw a large oval shaped object hovering in the distance.  It was the only light in the sky other than our moon, and it was much bigger in size than a star. This \"ufo\" was first seen in the skies of the great northwest.  It has been scaring me as to not knowing what it could be, and I am again clueless as to what it is.   I have included photos and videos of it.  Careful inspection of the photos revealed a large object with a black center illuminating white light. I have been seeing this \"ufo\" in the sky countless times over a month long.  You look at the evidence and tell me what you think it could be.  Be warned, it is scary.  Also, it is only visible late at night and the early mornings.",
      "link": "http://www.nuforc.org/webreports/079/S79818.html",
      "state": "OR",
      "duration": "Many Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bb165",
      "summary": "I went outside to have a cigarette and saw a object larger than a star moving erratically, back and forth then hovering, then moving ac",
      "city": "eugene",
      "shape": "sphere",
      "date": "2010-08-24T00:00:00",
      "story": "I went outside to have a cigarette and saw a object larger than a star moving erratically, back and forth then hovering, then moving across the sky at a very high rate of speed.  Object was white changing to red then green then back to white.  Object was seen moving  and then hovering for a few seconds. It was not any type of aircraft and it made no sound.  I thought it looked like a giant laser pointer in the sky.  When it went across the sky, it went from the southern most horizon to the northern horizon in no more than 2 seconds.  I have never seen anything like this before.  After about 10 seconds object came out of the northern horizon back to its original position, all the while changing colors, again object made no sound.  Object then rose up to zenith above my head, pulsated colors for a few seconds and then disappeared.  The object was there one second and gone the next and did not return.",
      "link": "http://www.nuforc.org/webreports/076/S76870.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb218",
      "summary": "huge triangle with 3 lights",
      "city": "eugene",
      "shape": "triangle",
      "date": "2011-01-31T00:00:00",
      "story": "huge triangle with 3 lights first i saw what i saw what i thought was a star then realized it was actually moving. so i pointed it out to my daughter and told her it must be an airplane super high up. she says, \"but daddy their are 3 and are in a big triangle.\"  sure enough thats what i saw also.  the lights were so far up they looked like distant stars. they moved across the sky in this pattern. it could maybe fit in the big dipper. it was headed NW. and was not visible after just a few minutes. it held this pattern and the distance between the objects did not change. when looked at as a whole it looked like a single huge object moving.  would have been hard to see without someone pointing it out.",
      "link": "http://www.nuforc.org/webreports/079/S79564.html",
      "state": "OR",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb30c",
      "summary": "slow moving of white orange colored light above eugene oregon airport at 3-5000ft vanished",
      "city": "eugene",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "slow moving of white orange colored light above eugene oregon airport at 3-5000ft vanished Thought plane was coming in to eugene from south. Had a orange glow, no blinking lights,clear night ,was moving north,went behind tall tree in view and watched it go into second tree top and did not come out other side.moved at a slow rate but not slow approx altitude was 3-5000 ft sun had set 4 hrs ago light was in the wrong flight path for airport.light should have been seen at airport as it flew over. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79286.html",
      "state": "OR",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbc18",
      "summary": "fireball over Eugene July 3rd",
      "city": "eugene",
      "shape": "fireball",
      "date": "2011-10-10T00:00:00",
      "story": "fireball over Eugene July 3rd I actually did not see it, but I talked to two separate people who did. I think something weird passed over Eugene Or, at 11:00 pm on July 3rd.  My friend knows I am into UFO's (but does not believe himself)  called me on the 4th of July to tell me he and his girlfriend saw a silent fireball slowly moving across the sky from north to south around 11:00.  Not an airplane, firework, rocket , etc. It was \"flaming\" and it faded out he said.  About 2 weeks later I was having lunch with my brother and he said he, his wife and his whole neighborhood who was out shooting off fireworks saw the same thing fly over around 11:00 on the 3rd of July.  They all said the same thing, it looked like a silent, slow moving fireball and just crossed the sky, definitely was not a plane, fireworks, or Chinese lantern. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84156.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf8d",
      "summary": "Bright fast moving light",
      "city": "eugene",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Bright fast moving light Object was going north at an extremely high velocity, made a very sharp hook west and down in elevation, and then disappeared.  Very quickly, maybe 2 seconds. was a VERY weird trajectory and curve to be a meteor.",
      "link": "http://www.nuforc.org/webreports/083/S83720.html",
      "state": "OR",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2ae",
      "summary": "One orange glow traveling west at a steady speed",
      "city": "eugene",
      "shape": "fireball",
      "date": "2012-01-12T00:00:00",
      "story": "My husband and I witnessed one orange glow traveling west at a steady speed similar to a plane. No sound was heard and it traveled in a fairly straight line.  There were no blinking lights as are typical to an airplane, instead it was a steady orange glow.  After approximately 30 seconds, it disappeared into the incoming fog. F or more clarification, it was not too foggy in our actual proximity, however, there was some light fog way overhead but mostly the fog was on the horizon. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86214.html",
      "state": "OR",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc308",
      "summary": "A single spot light shinning on me from on High above.",
      "city": "eugene",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "A single spot light shinning on me from on High above. I was sitting outdoors smoking a cigarette in my folding chair, it looked to me to be clear skies. When I looked up toward the northwest sky and I saw one bright head light (like a car head light) shining from high above towards me.  I thought it might a an airplane but I heard no jet noise.  Then the light slowly turn away from me then continuing on its course flying very high from the northwest towards the north at about 35,000 feet then the single light was turned off, I quickly got up to see if there was any other sort of lights on the craft but saw none and the craft seem to have disappeared I could not see it or its lights.",
      "link": "http://www.nuforc.org/webreports/085/S85466.html",
      "state": "OR",
      "duration": "13 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc387",
      "summary": "Five fiery lights/dark circular objects seen by young couple in Eugene, OR.",
      "city": "eugene",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "Five fiery lights/dark circular objects seen by young couple in Eugene, OR. It was about 8:50 p.m. on a Tuesday night, Tuesday the 27th of September 2011, when my fiancé and I saw what looked like a ball of fire coming from the north, moving across the sky.  The night was mostly overcast with slightly orange tinted clouds, the wind was gently blowing from the north, and the temperature was about 60-65 degrees.  We were on our way to the store, walking up and around a nearby hill, in a mostly residential neighborhood, when it appeared. I at first thought it was just a brightly lighted plain or helicopter, but then noticed that the light seemed fire-like, red-orange-yellow, and slightly flickering.  There was no sound coming from it.  The next thing we noticed, for both my fiancé and I were watching at this point, was that the fire/light seemed to be focusing towards the back of the craft, and then went out completely, about the time it passed over-head, though a little to the right from where we were standing.  And because the clouds were somewhat bright from the light pollution of the city, we both saw that, after the light had faded, there remained a small, dark, circular object.  At a distance it looked as small as a pupil, between an eighth and a quarter inch.  But there was no mistaking its flawless shape and its smooth edges. It was a perfect circle, black to my eyes, at least in the darkness.  Still silent, it continued on southward until we lost sight of it in the distance. Amazed, and a little frightened, we asked each other some typical questions, just to make sure we were both seeing the same thing as it was happening. “Could you see it?   Did you see its shape?  I can’t believe this!”  Then, about 30 seconds later, from the same direction, another one appeared, as silent as the first.  It looked the same; fiery, moving southward, and its light also slowly receded towards the rear of the craft, and then went out, again, revealing a dark, round object beneath the clouds.   We both observed that the light went out about the same moment as the first, almost directly overhead of us, but to the right.  But unlike the first craft, which held a seemingly straight course, and remained dark, this one turned left and right in small, quick and smooth movements, and relit; just a flicker in the rear, fiery like before, only faint and small.  Then, the small light that reappeared seemed to move around the edge of the craft, in either direction, but never in a ful! l circle.  (I found this particularly strange, because I assume that a round craft would most likely spin to stay in flight, but the small light that reappeared did not.)  The light then seemed to go out again as the ship went further away into the distance. Almost as soon as we lost sight of the second craft, a third appeared.  Again, it came from the north and made its way south, looking just like the first two, and making no sound.  This one acted more like the second craft though, turning slightly, this way and that, and relighting after about 5-10 seconds of darkness, during which it was revealed as another round, dark object beneath the clouds.  The light that reappeared on this craft was small like the other, and also seemed to move around the edge of the dark circle it was attached to, but not in full circles. Before the third was even out of sight, the fourth appeared, just as the others had, and acted much like the second and third.   Each one was completely silent, all moving at what looked like the same speed, and in the same direction, taking about 25 seconds to cross from one edge of the sky to the other. Then, there was no more to be seen for what felt like 2-3 minutes, and we continued on to the store, watching the sky behind us. We were heading west.  After about 2 or 3 more minutes, we reached the store and went in.  The clock in the store said that it was almost 9:00 p.m. Coming out, we looked again towards the direction of the sighting, and saw the fifth and final craft. At this point we were surrounded by a bit more tree growth, and further away, so we didn’t get a good look.  But we saw that it was plainly another light of the same color, moving in the same direction, and its light also seemed to extinguish, though we couldn’t see if it came back or not. It was the first time either of us had seen anything like this, and as soon as we got home we start searching for the right people to talk to.",
      "link": "http://www.nuforc.org/webreports/084/S84187.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc45a",
      "summary": "Bright white moving in circles, left then right, forward then back.",
      "city": "eugene",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "bright white moving in circles, left then right, forward then back. My friend and I were leaving work, when I looked in the sky I saw what looked like a crescent moon, but tiny and far up in the sky.  As I looked again I couldn't tell the shape, it was bright white.   It moved slowly forward, then appeared to move backwards.  Then it looked like it was going in tiny circle, then moving left and jerking back right.  We saw occasionally a bright red light attached to it.   My friend thought it was an airplane, but as I told her, planes to not move forward and back, in circles and then left and then right.  We then saw a plane fly over and she realized that indeed what we were looking at was NO plane.  I thought maybe a Satellite? but they don't move that way either as far as I know.",
      "link": "http://www.nuforc.org/webreports/085/S85593.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc96e",
      "summary": "Brightest object in the sky, briefly stopped before continuing",
      "city": "eugene",
      "shape": "light",
      "date": "2011-10-19T00:00:00",
      "story": "Brightest object in the sky, briefly stopped before continuing At approximately 7:30 PM this evening, October 17, 2011, I observed a bright light.  It was the brightest object in the sky moving slowly from the southwest toward the northeast just south and east of Eugene, OR. It stopped for three or four seconds while I was observing it and then continued along its path. I watched it until it was obscured by trees.  The color was similar to stars though much brighter. It appeared to be low in the sky.  There was no sound.",
      "link": "http://www.nuforc.org/webreports/084/S84589.html",
      "state": "OR",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb63",
      "summary": "Crescent shaped object bright orange.  Chinese Lantern?",
      "city": "eugene",
      "shape": "other",
      "date": "2011-07-06T00:00:00",
      "story": "Cresant shaped object bright orange  Chinese Lantern? Coburg rd area.  Orange cresent like object heading South.   Above head looked up and it was cresent shaped bright orange.  Maybe a chinese lantern?   Crescent shaped however.   Watched for 12 minutes as it just advanced in the are like a plane until it was no longer visible. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82232.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd3a",
      "summary": "lights in the night sky near Mount Piscah, Oregon",
      "city": "eugene",
      "shape": "light",
      "date": "2011-06-20T00:00:00",
      "story": "lights in the night sky near Mount Piscah, Oregon On the evening of June 17th, 2011 around 23:30 as I was at an outdoor festival at Mount Pisgah, Oregon, near Eugene, I noticed what appeared to be a very large, bright, white object in the western sky.   When I first noticed it, it was stationary and I thought it might be a planet, though it appeared to me larger than I have ever known a planet to appear.  I observed this object in a stationary position for about 10 seconds.  As I watched, this object suddenly grew slightly larger with a flash of white light then immediately shrank down to the size of the surrounding stars.   As I kept my eye on it the small shape slowly begin moving upwards toward the zenith of the star field, faded away and was gone about 5 seconds after it started moving. About 10 minutes later I noticed two very large, bright white objects in the southern sky.  They appeared exactly as the first object did in brightness and size and they appeared to be about a hands width distance apart if I stretched my arm out in front of me.  They were positioned vertically to one another.   I watched them in this stationary position for about 10 seconds.  At that time they shrank down to the size of stars and then begin moving together toward the west very slowly.  They appeared to move together as one unit, keeping an equal distance apart as they moved.   They grew dimmer and disappeared about 5 seconds after they started moving.",
      "link": "http://www.nuforc.org/webreports/081/S81851.html",
      "state": "OR",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd450",
      "summary": "Star looking lights with flashing red, green, and purple lights that just hover around ! NOT GOING ANYWHERE!  ((Star?))",
      "city": "eugene",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Star looking lights with flashing red,green,and purple lights that just hover around ! NOT GOING ANYWHERE! My girlfriend had been telling me ,a couple days before this ,that she had seen a UFO in the sky ,to the east of our house ,above the tree line.I did not pay too much attention to her ,until monday October 1st,2012 when i was watching tv and randomly looked out the window . I saw a light that caught my attention because it looked like an airplane but was not moving. I went outside on my deck and looked closer at this . It was a light that looked like a star ,but brighter,and seemed to have flickering red and green lights on it that told me it was a plane, but it was not moving anywhere.  I had a view of this between 2 trees and could tell it was not going anywhere,this light was west of my house above the treeline. As I am watching this light with my son ( 16 yrs .old ) ,  my girlfriend yelled at me that she can see another one on the other side of the house , to the east.We live outside Eugene, Oregon ,on a mountain, where there are no lights from the city ,m! aking the stars stand out with great brightness. We watched both of these lights for a while and only saw them move slightly up and down ,and side to side once in a while .  I got out my binoculars and could definately see flashing green and red lights and once in a while there was a dark ,almost purple blue light that was not constant, seemed to be random...... When I was watching the on to the west, I saw a bright flash of light close to the others that looked like maybe if you shined a realy bright light at something chrome or a mirror or something . This light never flashed again , that I saw . Ya know ,it was more like a flash of a camera, times 1000 !!!So that kinda weirded me out , but then last night Oct.2nd , we were at King Estates Winery for my birthday dinner,15 miles from our house and again on a mountain with no city lights, and there they were , in the same place as the night before !!!!!!!  This is realy tripping me out !!!! tonight my brother is bringing over! a camcorder to see if we can capture this on film, if they ar! e still there, wich i am sure they will be since they have been there for a week almost!  Somebody REALY NEEDS TO GET AHOLD OF ME !!!!!!!!! ((NUFORC Note:  We strongly suspect a sighting of a \"twinkling\" star.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93286.html",
      "state": "OR",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd565",
      "summary": "UFO's all over the night skies of eugene, oregon.",
      "city": "eugene",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "UFO's all over the night skies of eugene, oregon. Me and a friend were walking to a grocery store near coburg rd. We saw an illuminating light in the sky that was flying towards the Northwest.  We watched it fly all the way across the skyline and dissapear. After making our purchase at the store we noticed another ufo on the other side of town that was also illuminating.  Employees of the grocery store and other pedestrians also observed this flying object.  On our walk home we noticed triangulations of illuminating lights and packs of them all over the sky.   There had to be 15-20 of them at least.  There were also low flying small airplanes underneath these ufo's that looked like they were either keeping tabs on them or surveying them. Never getting too close to these objects ofcourse. This has been going on alot recently in the skies of eugene and nobody seems to want to talk about it.",
      "link": "http://www.nuforc.org/webreports/092/S92426.html",
      "state": "OR",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd79d",
      "summary": "Orange-yellow flickering light",
      "city": "eugene",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "Orange-yellow flickering light My girlfriend and I were on our way home. I was walking and she was riding my bike ahead of me about 50 yards when I noticed a flame-like light below the clouds approaching from the West.  On 8/30/2010 I had seen the exact same type of light above Veneta about 15 miles away.   As before I stopped to watch it approach.  Its speed was relatively slow and its altitude left it below the clouds. It then slowed gradually to a stop at which time I called for my girlfriend to come see.   By the time she reached me the flickering orange-yellow light had come to a stop where it remained as we watched for about a minute before it moved away in the opposite direction.  This was exactly the same behavior I had witnessed the year before. It was as if it had noticed me, stopped for a bit and then moved off. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91830.html",
      "state": "OR",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bda3f",
      "summary": "3 amber lights moving over Eugene slowly at 3000 ft. below clouds silently.",
      "city": "eugene",
      "shape": "unknown",
      "date": "2012-11-19T00:00:00",
      "story": "3 amber lights moving over Eugene slowly at 3000ft. below clouds silently UFO crafts flew from the south , northward over the city below clouds at a height of about 3000ft. in line at a distance of about 400 yards apart from each other.  Amber in color solid lights moving at what looked like 30 mph silently.  We are a train crew that stopped and watched with amazement all of us knowing what it was!  We did report this to the management .",
      "link": "http://www.nuforc.org/webreports/094/S94270.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bda39",
      "summary": "Hovering lights, like an airplane, wavering back and forth across the night sky - very slowly moving west to north at tree line level",
      "city": "eugene",
      "shape": "unknown",
      "date": "2012-09-24T00:00:00",
      "story": "hovering lights, like an airplane, wavering back and forth across the night sky - very slowly moving west to north at tree line level I have been watching, on and off, for about an hour now, what looks like like the white and red flickering lights of an airplane, but which has been hovering at the tree line level in the northwestern sky all this time.  It's not a star or satellite, apparently, because every few minutes it seems to randomly move about, sideways, back, up and down, in an erratic manner.  But essentially it is staying in the same location in the sky.  About a half hour before I noticed this, one of my dogs seemed highly agitated (unusual for her).  She's settled down now. I do live near an airport, but this object has been in the air for a long time now -- essentially hovering in place.... I just went back outside to check, and initially couldn't see the lights, then realized that it had traveled further north, and was now below the tree line from where we are. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92653.html",
      "state": "OR",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3be2fd",
      "summary": "I was driving home, less than a mile from my apartment and I noticed 5 or 6 white lights right above the tree line that looked like sta",
      "city": "eugene",
      "shape": "light",
      "date": "2012-05-29T00:00:00",
      "story": "I was driving home, less than a mile from my apartment and I noticed 5 or 6 white lights right above the tree line that looked like stars. They were about the size of Jupiter maybe slightly larger. I didn't automatically think UFO, I actually thought huh, a new street light?  It was hard to really stare and get a good look while driving but I tried and I realized that whatever it was, was not a street light.  I couldn't make out many details but this is what I observed: 5 or 6 bright white lights that were round, looked like stars and were about the size of jupiter maybe slightly larger.  There was one in the middle and I believe 5 that surrounded it. All the same size.  They reminded me of fireflies, they were not completely stationary but fluttering.  The ones on the outside were almost dancing around the middle one which stayed relatively still.  The other thing I noticed was that I couldn't really tell if they were close or far away.  Definitely closer than s! tars but much farther away than the trees but where exactly in-between those two was really hard to tell. Just a side note...i was skeptical to believe it was a ufo...i hear about these things all the time but to actually see one...  I drove the same streets the next night to see if there was in fact a new street light or any lights in the same spot and nothing.  Did anyone else see it? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89023.html",
      "state": "OR",
      "duration": "unsure"
    },
    {
      "_id": "64d005f478aba2ec5a3be8ea",
      "summary": "Black dot flashing color lights.",
      "city": "eugene",
      "shape": "oval",
      "date": "2012-05-29T00:00:00",
      "story": "Black dot flashing color lights. a black dot flying the sky, with lights flashing red,orange,and yellow.  Flying very slowly. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89235.html",
      "state": "OR",
      "duration": "4minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb73",
      "summary": "I went outside to put the garbage and recycling containers back by the side of my house and as i was doing that i looked up over the to",
      "city": "eugene",
      "shape": "unknown",
      "date": "2012-02-03T00:00:00",
      "story": "I went outside to put the garbage and recycling containers back by the side of my house and as i was doing that i looked up over the top of my neighbors house and i saw a weird light just sitting there in the sky not moving or anything",
      "link": "http://www.nuforc.org/webreports/086/S86964.html",
      "state": "OR",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bec27",
      "summary": "2 lights in the night sky",
      "city": "eugene",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "2 lights in the night sky When I first saw the two lights they were to the SW of my location, very close together, traveling in an Easterly direction. By the time I got my Flip camera they were moving in  a NE direction.  One started moving in a NW direction, it went behind a cloud and I didn't see it again.   The second light I caught on video. It went NE and came directly overhead of my location.  There was no sound associated with the lights. I am near an airport and see and hear airplanes, helicopters all the time but this was very unusual. Note:  The video appears as though the object is moving around in circles.  That movement is my unsteady hand.  Both objects were moving slow and steady with no jerky motion.",
      "link": "http://www.nuforc.org/webreports/101/S101430.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed13",
      "summary": "Star like white light/ moves across sky and disapears",
      "city": "eugene",
      "shape": "unknown",
      "date": "2013-08-30T00:00:00",
      "story": "Star like white light/ moves across sky and disapears Looks like a moving star but its way too low to be a star and its not high enough to be a satellite then it fades into the night and you cant see it anymore.   We know its not a satellite we watch them all the time we have even seen the ones that roll and flash with light.",
      "link": "http://www.nuforc.org/webreports/100/S100525.html",
      "state": "OR",
      "duration": "few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bee55",
      "summary": "Round red, yellow and blue flashing ball seen by myself and my friend 5 miles away.  ((NUFORC Note:  Possible twinkling star??  PD))",
      "city": "eugene",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "round red, yellow and blue flashing ball seen by myself and my friend 5 miles away I heard a very very loud jet of some sort go over my house about 19:55 hrs. This doesn't happen very often at all! I walked out the door to see what I could see, noticed the plane with red flashing lights.  It was going northwest and disappeared. As I was looking at the stars, I noticed an unusually bright object in the sky. At first I thought it was a plane because you could see it moving and appreared to be coming my way. Then it stopped. Red, yellow and blue lights were flashing from it as though it was a balled up rainbow. It would fade in and out of view. I ran to get binoculars and focusing in on it discovered there were two objects side by side. There was no moon shining at that time. I kept watching it by naked eye, then binoculars for approx. 5 minutes. I could barely make out the outline of a large fir tree so kept that in focus, as trees do not move. These objects kept moving.First  up and down then back and forth. They would also move away from ea! ch other, but always came back close again, Always colorful and flashing. They were very close together, but focusing on another star and keeping the binoculars very still, you could see them distance themselves then come back again closer to each other. At first they were to the left of the little dipper and the tree I had in focus. Then they gradually moved to the right of the little dipper and of the tree. I watched for over an hour till I called the local TV station. They recommended I videotape what I saw. My camcorder is broken so was not able to. They told me they would check it out. In the meantime, I got on FaceBook and found a friend that lives 5 miles from me. I explained what I seen, told her what area to look in and she seen the same things. I watched these objects for over 2 hours slowly going back and forth across the sky.All the while the lights kept flashing. Every couple of minutes they would fade away a tad, but then would be bright again. This was a very! clear sky. ((NUFORC Note:  Possible twinkling star??  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96556.html",
      "state": "OR",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bef49",
      "summary": "Sighted fiery red ball shaped object prox 50 ft in diameter with flames on all edges.",
      "city": "eugene",
      "shape": "sphere",
      "date": "2013-05-15T00:00:00",
      "story": "sighted fiery red ball shaped object prox 50 ft in diameter with flames on all edges. observed a fiery red ball with small spiked shaped flames at all edges.object was prox 50 ft in diameter. was at altitude of prox 75 feet above ground.and 50 ft off the roadside.it was moving slowly or was almost stationary.  I didnt believe what I was seeing and drove off but turned back immediately! by then the object was gone! have not seen object anymore.  will check with close neighbors to verify sighting.object was blood red ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97231.html",
      "state": "OR",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf200",
      "summary": "Six blinking lights in formation, glide up and then down again over Eugene Or.",
      "city": "eugene",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Six blinking lights in formation, glide up and then down again over Eugene Or. My Grandson called me to come look at the lights at appox. 8:40 PM.  By the time I went outside, there were six flashing lights that seemed to both rise further off the horizon and closer to us.  When they started he only saw 3, but that was because they were coming up over the horizon.  They were blinking lights in a perfect order and distance apart.  They came up and hovered and slowly went back down below the horizon. While they were up, I did call a local news station to see if there had been any sightings and some other family members.  It was a cloudly night and they didnot see them.  My compass said it was 63 degrees N.E.  They were much bigger then stars. They flashed and glided slowly, never losing formation.  I had 6 teenagers who watched for 20-30 minutes. We could not get pictures. They turned out too dark.",
      "link": "http://www.nuforc.org/webreports/097/S97255.html",
      "state": "OR",
      "duration": "20-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2d4",
      "summary": "3 sets of 3 orangy flickering flying objects completely quiet and in perfectly spaced apart from one another. then they disappeared.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "3 sets of 3 orangy flickering flying objects completely quiet and in perfectly spaced apart from one another. then they disappeared. 12/21/2012 I was in my house and my partner pounded on my front door to get me to come outside.  I went outside and looking towards the south I saw 3 groupings of 3 orange flickering flying objects in the sky.  They moved slow and gracefully across the sky in the northwest direction, there was no sound at all, helicopter size yet oblong and not the shape of helicopter, flying low like about the height of the hills nearby.  Each group of 3 flying objects were spaced apart the exact same way perfectly.  After watching them for about 1 minute they all sort of just faded out at the same time.  It was 10:06pm when it was done.",
      "link": "http://www.nuforc.org/webreports/095/S95407.html",
      "state": "OR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2d2",
      "summary": "4 sets of 3 (12) separate flying orbs/fireballs, orange, headed northwest in straight line.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "4 sets of 3 (12) separate flying orbs/fireballs, orange, headed northwest in straight line. four sets of 3 glowing orange orbs traveling northwest coming from south.   First set of 3 were visible along with a few other orange lights in the distance.  I didn’t know at first that they were a set of three until they got a little closer.  Then I saw it clearly that they were traveling in a line.  Each set of 3 had one orb in front with two behind it, each set of 3 forming a triangle.  They didn’t change direction or speed. traveled relatively slowly.  They were slightly bigger than average stars, obviously not stars.   Orange lightly twinkling but never fading or disappearing.  They were all the same size. No noise. One other witness.  fter about 4 mins of seeing them clouds came over head and blocked them from view.",
      "link": "http://www.nuforc.org/webreports/095/S95408.html",
      "state": "OR",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf872",
      "summary": "10 orange orbs moving slow from east to west.  Last one hovered before it vanished. No sound.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2013-10-14T00:00:00",
      "story": "10 orange orbs moving slow from east to west. Last one hovered before it vanished. No sound. 10 orange orbs or fireballs moving across the night sky from east to west.  They moved slow at a low altitude and made no sound.  As they moved east to west the light would grow dim then disappear.  The last one hovered for a few seconds before it vanished. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102987.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfff2",
      "summary": "Bright glowing orb, moving slowly then fading into the night.",
      "city": "eugene",
      "shape": "flash",
      "date": "2013-07-05T00:00:00",
      "story": "Bright glowing orb, moving slowly then fading into the night. Riding home on my bicycle this evening I saw a bright orange light in the sky that that grew brighter and moved slowly in the sky.  It was situated above West Eugene and moved too slowly and was up too high to have been a firework, nor could it have been a airplane because it moved too slowly and was moving vertically when it finally faded away. The UFO was looked like an orb and was a shining, bright orange.  It seemed to be quite small, maybe a few feet in diameter.  It stood out because it was much too big to be a planet or a star and did not move like a plane or a helicopter would.  When it when away, it faded very slowly and appeared to ascend further up into the sky.",
      "link": "http://www.nuforc.org/webreports/099/S99611.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c02a6",
      "summary": "I saw several orange lights traveling east and then turning south as I was driving west from Springfield to Eugene, OR right by I-5.",
      "city": "eugene",
      "shape": "light",
      "date": "2013-04-12T00:00:00",
      "story": "I saw several orange lights traveling east and then turning south as I was driving west from Springfield to Eugene, OR right by I-5. I was driving on Centennial in Springfield going back to Eugene when i saw some orange lights in the sky coming from the direction of Autzen Stadium.   I was driving a pizza delivery truck and I pulled over on a side street to get a picture and to see if I could hear noise, but I5 was between me and the lights, so I drove over I5 and pulled over again to see 2 more go over.   I got pictures of those with my cell phone.   They are like 3 I saw on June 4, 2011, in the same area.  They turned before they crossed over I-5 and went south.",
      "link": "http://www.nuforc.org/webreports/096/S96511.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0729",
      "summary": "Orange light moving slowly then hovered then faded to pin sized dot and headed West.",
      "city": "eugene",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "Orange light moving slowly then hovered then faded to pin sized dot and headed West. Orange Orb traveling slowly from South into Eugene area then stopped hovered for about 15 seconds and then faded out to pin sized white dot then moved toward South West and lost sight, no sound heard. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105805.html",
      "state": "OR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c09cd",
      "summary": "Bright orange light, flying low, moving slowly & was silent",
      "city": "eugene",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "Bright orange light, flying low, moving slowly & was silent Pitch-black, clear skies, out in the country.  We saw a large bright orangish light, what looked like sitting on top of a large hill/mountain.  As we drove down the road closer to it, it remained still in the same spot.  When we got to the base of hill area, we stopped the car, rolled down all the windows & tried to figure out what it was.  It then slowly started moving across the sky.  Low enough that we could definitely see that it had a \"airplane\" shape with wing, and the bright orange light.  It made absolutely no sound at all, was completely silent.  It was low enough that we would have absolutely been able to hear it, if it was any type of normal aircraft.  No sound.  Moved pretty slowly over us and out of sight.",
      "link": "http://www.nuforc.org/webreports/103/S103567.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d0c",
      "summary": "Southern sky, heavy clouds. First one appeared to be a hangglider, but too high never descended.  A silver-gray Stealth fighter jet sha",
      "city": "eugene",
      "shape": "changing",
      "date": "2014-02-07T00:00:00",
      "story": "Southern sky, heavy clouds. First one appeared to be a hang-glider, but too high never descended.  A silver-gray Stealth fighter jet shape, but fluid.  One \"cloud\" looked like a huge flock of birds, a spotty \"wall\".  It slightly brightened a large area of cloud before going out of sight behind the clouds.  Then something circular and black, but cloudy, then streamed away rapidly, leaving a black \"jet\" stream, not linear.  Two, small, black smoke-like \"clouds\" streamed down, then ascended back into the clouds.  All of this was difficult to visualize with the heavy clouds.  I have NEVER witnessed anything like this and I grew up in the midwest.",
      "link": "http://www.nuforc.org/webreports/106/S106836.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c18aa",
      "summary": "Objects flew straight up made a loop and then straight up and gone.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2014-07-20T00:00:00",
      "story": "Objects flew straight up made a loop and then straight up and gone. ((ADDENDUM FROM WITNESS)) The object in question was like a bright fireball. My wife and daughter saw it as well and could not identify the object. As it moved further away it looked as if sparkles of bright lights fell from it. This happened twice this morning an hour apart. ((END ADDENDUM)) ((NUFORC Note:  We have amended the date to July 12th, 2014.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111433.html",
      "state": "OR",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1909",
      "summary": "ORANGE CYLINDER OVER EUGENE ON THE 4th.",
      "city": "eugene",
      "shape": "",
      "date": "2014-07-11T00:00:00",
      "story": "ORANGE CYLINDER OVER EUGENE ON THE 4th IT WAS A CLERR NIGHT.  I FIRST OBSERVED A CIGAR SHAPED OBJECT COMING FROM THE SOUTH AND HEADING DUE NORTH.  IT SEEMED TO ME TO BE GOING 250+ MPH AND BETWEEN 500 TO 750 FEET UP.   IF I AM CORRECT IT HAD TO BE 150' LONG AND 30+' ROUND. I LIVE ON A LANDING PATH 4 MILES FROM THE AIRPORT NORTH OF ME.  THE LIGHT EMITTED WAS ORANGE AND CONSTANT.  AT FIRST, FOR THE FIRST 5 SECONDS, I THOUGHT WAS A FLAMES, BUT RULED THAT OUT BECAUSE THE SHAPE SEEMED TO BE SHARP. IT HEADED ALMOST STRAIGHT FOR MY POSITION, BUT STARTED TO VEER TO THE EAST WHEN IT GOT ABOUT 1/2 MILE AWAY AND BEGAN TO CLIMB AND HEAD DUE EAST.  I LOST SIGHT OF IT AS IT CLIMBED IN THE EAST.  IT WAS ABOUT AS ROUND AS AS THE MOON, YET AS LONG AS 7 MOONS.   THE WIND WAS FROM THE NNE.  IT SCARED ME WHEN FIRST OBSERVED.  I THOUGHT IT WAS A MISSLE OR METEOR.   MY FRIEND AND I AGREE THAT IT WAS CONTROLLED. no sound",
      "link": "http://www.nuforc.org/webreports/111/S111255.html",
      "state": "OR",
      "duration": "2.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c241b",
      "summary": "((HOAX??)) Red and blue egg like shaped.flying ahead of me then drifted like a zigzag then took off really fast the opposite way.",
      "city": "eugene",
      "shape": "egg",
      "date": "2014-03-27T00:00:00",
      "story": "Red and blue egg like shaped.  Flying ahead of me then drifted like a zigzag, then took off really fast the opposite way.   I slowed down on the freeway Red and blue egg like shaped.  Flying ahead of me then drifted like a zigzag then took off really fast the opposite way.   slowed down on the free way to watch.  it was dark out and the colors were bright more blue then red.  scared me.  to watch.  it was dark out and the colors were bright more blue then red.  scared me. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108096.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c297a",
      "summary": "Moving light slowed, then stopped, then slowly faded to darkness.",
      "city": "eugene",
      "shape": "unknown",
      "date": "2014-11-21T00:00:00",
      "story": "Moving light slowed, then stopped, then slowly faded to darkness. I was in my driveway, facing East, over my neighbors house.  As I got out of my car, I noticed a light moving relatively slowly, moving west or west southwest.  It caught my eye because the color was more orange than typical plane lights.  The speed seemed too slow for how low it appeared.   Then I began to notice the speed was slowing.  It didn't appear to turn, it just slowed until it came to a stop.  It remained stationary for 10 seconds or so, the began to fade until it just became dark.   I got a video of it on my phone, but it's just a small light that then turns off, no real detail visible.  At least it's proof that there was something there.  The night was very clear so I don't believe there was a cloud or something.  It is the only light in my video so it was the brightest light up there at the time.  I've never seen a flying object stop like that...then go dark?  Cool!",
      "link": "http://www.nuforc.org/webreports/115/S115407.html",
      "state": "OR",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b3c",
      "summary": "A moving light emits huge white bright flash",
      "city": "eugene",
      "shape": "",
      "date": "2014-08-29T00:00:00",
      "story": "A moving light emits huge white bright flash. we came out onto our back porch I looked up in the sky and saw a huge flash of light.  I tried to locate where it was coming from and faintly saw a small moving light which then pulsated a less bright flash.   The original flash lit up the sky.  My husband saw the flash from the corner of his eye.  I was looking directly at it.",
      "link": "http://www.nuforc.org/webreports/112/S112779.html",
      "state": "OR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c97",
      "summary": "Giant snowflake with pulsing lights seen over Eugene, Oregon.",
      "city": "eugene",
      "shape": "changing",
      "date": "2014-09-05T00:00:00",
      "story": "Giant snowflake with pulsing lights seen over Eugene, Oregon. On Sat. Aug. 30th, 2014, at about 10 p.m. I saw strange lights over the sky of Veneta, Oregon, and Eugene, Oregon.  What I saw looked like a giant snowflake (for lack of better way of describing it) and it had pulsing lights all over the front of it!  The pulsing lights were in vertical sections, with one section coming on really bright and then fading, while the section next to it came on very bright.  The sections alternated like that all across the front of it. This thing was traveling through the sky at a slow speed and I think it was near the Eugene airport.   After I watch it for about 30 seconds, it suddenly divided and became two rounds things of pulsing lights.  They kept traveling through the sky at a slow speed, keeping a uniform distance between them.  After about another 30 seconds, they went behind some trees and I lost sight of them.   Two vehicles were pulled off the road in strange places and no doubt the drivers had seen this also.   I did not have a camera with me and that taught me to always have one with me in the future, as I never know what I may see! ((NUFORC Note:  We spoke via telephone with the witness, and she seemed to us to be quite sincere and sober-minded.  We suspect that she is a quite reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113267.html",
      "state": "OR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c304a",
      "summary": "Bright orange light emitted by a spinning top - type craft",
      "city": "eugene",
      "shape": "other",
      "date": "2014-08-08T00:00:00",
      "story": "Bright orange light emitted by a spinning top - type craft My girlfriend and I witnessed a bright orange glowing light - at first we believed it to be Mars, but unbeleivably bright - until it started to move in various directions, seemingly hovering.  As we got dressed to go check it out, I witnessed the light dim, re-emerge, and vanish.   Its movement was unlike any vehicle I have seen.",
      "link": "http://www.nuforc.org/webreports/112/S112107.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c31d1",
      "summary": "Rectangle shape with a red and green light.",
      "city": "eugene",
      "shape": "rectangle",
      "date": "2014-08-01T00:00:00",
      "story": "Rectangle shape with a red and green light. My parents and my siblings and our friends and his kids were outside swimming at night   i was walking back outside and all of a sudden i saw a rectangular shape fly towards our house really fast then slowed to a hover with a red light on the left and a green light on the left  i told my dad and then everyone saw it and the first thing we think is aliens   it hovered and went up and down it made a humming noise  i got my video Camera and when i zoomed in i saw like a flash of green on the Camera only. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We would like to look at the alleged video, but we have no way to contact the witness to the alleged sighting.  Possible hoax, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112075.html",
      "state": "OR",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3429",
      "summary": "Fireball ufo's.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2015-04-08T00:00:00",
      "story": "fire ball ufo's At abou 0300, I was finishing my security patrol.  As I looked up I saw 2 crafts come in from the west andturn east.  One would jump ahead of another and stop.  So the second craft could catch up.   They are orb shaped and redish orange looks like fireballs.",
      "link": "http://www.nuforc.org/webreports/118/S118286.html",
      "state": "OR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3883",
      "summary": "Went out to watch the fire works at midnight.  Saw the usual aerial fireworks but then saw 2 bright red lights traveling from the west",
      "city": "eugene",
      "shape": "light",
      "date": "2015-01-07T00:00:00",
      "story": "Went out to watch the fire works at midnight.  Saw the usual aerial fireworks but then saw 2 bright red lights traveling from the west and then turning in a wide arc to the south.  At first I thought they were fireworks gone awry and waited for them to explode.  Neither of them did.  That attracted my attention as being odd.  One was above the other.  After about 3 minutes first one then the other faded and disappeared several miles southward.   Went out an hour later (at 0:54) to have a smoke and saw a red light come from the west from the direction of Florence, Oregon followed by 6 others.  As they traveled in my direction, they all appeared to be moving very fast. They appeared to be traveling high above the oregon coast mountain range.  I have always watched the weather coming in from the coast ( we live 60 miles inland) and have a pretty good idea of what the weather is going to do here in the Willamette valley based on my observations of cloud activity wes! t of us.  I've seen a lot of jets in the area but none of them flies from that direction or that fast.  All of the red lights disappeared at the same point several miles toward the south.  All of them followed the exact same trajectory and faded quickly and disappeared at the same point in the sky. I have lived less than 2 miles from the Eugene airport for the past 23 years.  I have seen private airplanes, private jets, commercial jets, cargo jets, navy sub killer aircraft conducting touch and go training flights, and a wide variety of military jets taking off after re-fueling on north to south trajectories.  I know all of the trajectories for all of the aircraft that fly over or around my home and, at times, what time of day I can expect to see particular airlines.  I am can distinguish the difference between night time aircraft lights and landing lights between fixed wing and jet aircraft.  I also know the sound that all of them make.   Tonight I neither heard nor saw anything I have ever experienced.  There were none of the usual stro! bing lig hts, throbbing engine sounds, or jet sounds.  I have also seen military jets climbing at night.  Their after burners have never looked red.  What I saw and heard were bright red lights that fluctuated minimally and felt, but did not hear, a slight bass hum.    Conditions were clear, 23 degrees F, no clouds, and a bright half moon in the sky.  I have never seen any thing like this in my 55 years on the planet.",
      "link": "http://www.nuforc.org/webreports/116/S116377.html",
      "state": "OR",
      "duration": "3 minutes each"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a20",
      "summary": "Dual orange orbs in Eugene, Oregon. 12/11/2014.",
      "city": "eugene",
      "shape": "disk",
      "date": "2014-12-12T00:00:00",
      "story": "Dual orange orbs in Eugene Oregon 12/11/2014 My wife and I were outside smoking, when we say two orange round orbs in the sky.  The color almost looked like the distant glow from a fire but was floating in the sky.  They flickered with intensity and flew in unison with one another.  They appeared to be very low and slow moving.  They were traveling north then turned northwest.  One orb started to go dim almost to the point where it looked like a star then disappeared then the other orb just disappeared.  This was not the first time we have seem this kind of activity before.  A month before in November of 2014 we saw a single orange orb that we wrote off as a balloon with a candle attached to.  The second even was the same kind of orb with the glowing orange fire like light but was in a pair.   We live close enough to the airport to see the planes come and go on a regular bases but these flying objects were different from anything we have seen before.  Regular air traffic generates a lot of noise pollution these c! rafts were silent.  We find this event and the past event very strange but don't feel threatened by the presences.   We are hoping that more individuals will share their stories to document the happenings here last night and to feel that they are not alone in their encounters.",
      "link": "http://www.nuforc.org/webreports/115/S115929.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a2f",
      "summary": "Colorful silent object flying in a zig zag pattern.",
      "city": "eugene",
      "shape": "circle",
      "date": "2015-07-03T00:00:00",
      "story": "Colorful silent object flying in a zig zag pattern. I thought it was a satellite, at first, but then I noticed it was moving way too fast.  More like the speed of an airplane, but it was flying low enough I should of heard its engine if it was an airplane.  It was also flying in a zig zag pattern.   At first the color of the object looked yellow, then as it went by blue or red, I can't remember.   It could of been an airplane, but I've never seen one move like that ever, and it was quite.",
      "link": "http://www.nuforc.org/webreports/119/S119976.html",
      "state": "OR",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b6a",
      "summary": "My neighbor and I saw a rectangle with bright blue and red lights traveling away and turning around at unexplainable speeds.",
      "city": "eugene",
      "shape": "rectangle",
      "date": "2015-07-23T00:00:00",
      "story": "My neighbor and I saw a rectangle with bright blue and red lights traveling away and turning around at unexplainable speeds. I live in Eugene, Oregon.  I live with my grown son in a trailer park, and I am very religious.  On June 30th, 2015, a little after 9pm,  I was standing outside my trailer to see the bright \"star\" of Jupiter and Venus together, which many have called the star of Bethlehem.  I waved for my neighbor to come off her porch and see.  We looked together for a minute toward the west, talking about how it has not happened in 2000 years since Jesus was born. I turned to go back to my home and she said, \"What is that?\"  I looked above my trailer in the sky and saw what seemed to be an invisible rectangular object with four sets of blue and red paired lights beneath it.  The bright blue and red lights were paired together in four places like where the wheels would be under a car.  We did not see the rectangle object, only the lights.  These were large lights, not tiny pin-sized lights. They did not blink, only glowed cobalt blue and bright red very vividly.  At first it was just hovering, then it went up, away south, around and back again and that is when I realized it was not a helicopter.  Nothing could travel or turn that fast that I have ever seen before. We watched until it went up and disappeared into the east. I had a strange feeling while watching that it had been looking at the stars as well, knew we were looking at it, and was trying to get away from us.  I don't know if that is true, it is just a sense I had.  I did not feel afraid, just calm and curious.  I brushed it off, since someone I later spoke with said it was probably a drone.  But after thinking about it, this was too big to be a drone, and much too fast.",
      "link": "http://www.nuforc.org/webreports/120/S120539.html",
      "state": "OR",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4211",
      "summary": "Strange object in northwest sky.  ((NUFORC Note:  We suspect a sighting of Venus.  PD))",
      "city": "eugene",
      "shape": "circle",
      "date": "2015-04-30T00:00:00",
      "story": "Strange object in northwest sky. At 11:07pm, I and one other person saw a bright glowing circle light yellow with a red center in the northwest sky in west Eugene.  It got brighter and then would dim repeatedly.    We checked online to see if it was a large star or perhaps a planet.   It disappeared about twenty minutes after we noticed it.",
      "link": "http://www.nuforc.org/webreports/118/S118678.html",
      "state": "OR",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c425c",
      "summary": "3 very large red balls flying in a row about 1000 ft high,approx 500 ft apart from north to south west of Eugene",
      "city": "eugene",
      "shape": "sphere",
      "date": "2015-04-23T00:00:00",
      "story": "3 very large red balls flying in a row about 1000 ft high,approx 500 ft apart from north to south west of Eugene I saw on 4-18-15 about 9:00pm, 3 very large red balls flying in a row about 1000 ft high, approx 500 ft apart from north to south west of Eugene.  The light went out in the middle one, I could see through binoculars that it was a black sphere of some kind as there was still a little light glow from sundown.  They were moving very fast, NO NOISE at all.  They disappeared just a little to the south west of Eugene, Oregon.   I have 20 hours training in a helicopter.  I've never reported before' I'm not a nut case!!!",
      "link": "http://www.nuforc.org/webreports/118/S118519.html",
      "state": "OR",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4464",
      "summary": "Light in west Eugene.",
      "city": "eugene",
      "shape": "sphere",
      "date": "2015-10-29T00:00:00",
      "story": "Light in west Eugene Standing in my driveway in west Eugene I saw a white sphere shaped white light heading south.   I live close to the airport, and see planes flying overhead all the time.  This had no sound, it had no navigation lights, moved in not exactly a  straight path in the sky.",
      "link": "http://www.nuforc.org/webreports/123/S123013.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a50",
      "summary": "Colorful Object hover over house before flying south.",
      "city": "eugene",
      "shape": "circle",
      "date": "2015-09-25T00:00:00",
      "story": "Colorful Object hover over house before flying south. I saw a really bright colorful object hover over a house across the freeway from me.  It hovered there for about 4-5 mins until it flew south (normal speed of an airplane).  It was probably 500 - 1000 feet up.  I saw the same thing in July (I reported it on this website).  I did take a video with my ipad (so the quality is crap) that I will email.",
      "link": "http://www.nuforc.org/webreports/122/S122124.html",
      "state": "OR",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a2f",
      "summary": "Saucer Disk Over Oregon Ducks Stadium Captured On Sony Camera",
      "city": "eugene",
      "shape": "disk",
      "date": "2015-10-16T00:00:00",
      "story": "Saucer Disk Over Oregon Ducks Stadium Captured On Sony Camera. Simply put – I was taking a series of pictures from the top of Skinner Butte, elevation 645 feet, in Eugene, Oregon.  One of my photos was zoomed into Autzen Stadium (Ducks) the others were of the downtown area.  There was quite a bit of haze from lingering fires on the horizon which made it difficult to take any quality photos. About an hour later I was viewing on my PC when I saw a disk – UFO – pretty clearly over and past the stadium.  I did not see or was aware of this object whatsoever when I took the picture. My camera is a new Sony Cybershot DSC-HX90V.  I had the zoom almost all the way out but was still able to capture a freeze shot at 1/320 of a second.  I was fortunate to have it on Program Auto mode with the ISO set to 80.  I used Cyberlink Photo Director to clean up the image by increasing the contrast and edging effect some.  With those simple adjustments it becomes quite obvious I have captured a large Saucer Disk.  You can use the cell tower to get an impression of the size as it is beyond that.  Maybe 60 feet long and 25 feet high. (That is purely speculative of course) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122860.html",
      "state": "OR",
      "duration": "1/320 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c4acf",
      "summary": "Spinning light orbs",
      "city": "eugene",
      "shape": "light",
      "date": "2015-09-25T00:00:00",
      "story": "Spinning light orbs Light orb or ship. I zoomed and focused on my camera and was able to see spinning lights. It stayed in the same spit for about ten minutes, then started moving up and to the right. The longer I stared at it, the more I seen color of blue and green.",
      "link": "http://www.nuforc.org/webreports/122/S122110.html",
      "state": "OR",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c50dd",
      "summary": "((HOAX??))  Orange light in sky, moving fast until a parachute opened and object descended into Eugene area.",
      "city": "eugene",
      "shape": "light",
      "date": "2016-02-19T00:00:00",
      "story": "Orange light in Sky moving fast until a parachute opened and object descended into Eugene area. Enjoying a Hot Tub in the evening noticed a distant white light traveling from south to north watched as it turned into a orange glow continually traveling at a good speed.  Than i noticed what appeared to be a parachute and object dropped down into the Valley of Eugene.  Went inside house to share sighting with Friend than came out to notice a bright orange Glow descending down from the sky seemed to be different than the first object than lost sight as it went behind some trees. ((NUFORC Note:  Probable hoax.  Date is flawed, and we have changed it.  Source elects to remain anonymous.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125860.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c53cb",
      "summary": "Viewed 4 slow moving orange-ish orbs on new years eve moving from E to W until they disappeared on the horizon.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2016-01-05T00:00:00",
      "story": "Viewed 4 slow moving orange-ish orbs on new years eve moving from E to W until they disappeared on the horizon Went outside with my boyfriend on New Year's Eve at around 12:55PM to light some fireworks to celebrate the new year.  While picking up the firework remnants, I noticed my boyfriend was staring up at the sky.  There were fireworks, but when they stopped, four slow moving orange-ish orbs moving from east to west traveled across the sky.  There were no flashing lights like a normal plane, and seeing fireworks just moments before, it was VERY clear these were not fireworks of any kind.   We watched them for quite a while and they did not dissipate-- they simply traveled until they were out of view.  For the most part they seemed spherical in nature, but if you focused closely they did appear to have some elongated part on the front.  A man down the path we were on also noticed them. ((ADDENDUM FROM WITNESS)) My name is ((deleted)).  I submitted a sighting about 10 minutes ago.  I made an error in the submission--the number of witnesses was 3, and the duration of time was 7 minutes--not the other way around. Sorry for the error! Just wanted to mail to make sure all the information is accurate! Thanks again! ((END ADDENDUM)) ((NUFORC Note:  We have amended the report, as requested.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125027.html",
      "state": "OR",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5592",
      "summary": "((HOAX??))  Out of the corner of my eye I seen a massive fireball falling.  ((anonymous report))",
      "city": "eugene",
      "shape": "fireball",
      "date": "2016-07-08T00:00:00",
      "story": "I walked outside to smoke a cigarette and mess around on my cell phone when out of the corner of my eye I seen a massive fireball falling to the Earth it was bright red orange with a blue outline I waited to see if I could hear a sound if it hit the Earth but nothing came seemed to just disappear over the tree line in the Santa Clara area of Eugene I was looking West near Beltline I've never seen anything like it but it shocked me and it seemed too massive to be a comet or meteor",
      "link": "http://www.nuforc.org/webreports/128/S128089.html",
      "state": "OR",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5651",
      "summary": "Fireball seen soaring across the sky.  Aircraft seen chasing it.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2016-07-22T00:00:00",
      "story": "Fireball seen soaring across the sky.  Aircraft seen chasing it. A fireball soared across the sky followed by a very fast and colorful aircraft.  I am a skeptic and don't believe in Ufos.  Last night changed my mind.  Wondering if any one else saw this.",
      "link": "http://www.nuforc.org/webreports/128/S128548.html",
      "state": "OR",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5779",
      "summary": "Multiple Bright orange object above Santa Clara/Eugene",
      "city": "eugene",
      "shape": "oval",
      "date": "2016-06-24T00:00:00",
      "story": "Multiple Bright orange object above Santa Clara Eugene. 6/18/2016 Time: 8:45PM PST. An orange solid very bright oval object crossed through the window just to the right of my TV view screen.  The window is located in my vaulted area of me ceiling above my front door. When I saw it I was awe struck with the size and orange brightness as it progressed to the right side of my window.  A few moments later, another Bright orange same size solid object came into view in line.  I jumped up went outside.  There they were.  Suddenly, a third was in view from the East coming in my direction.   I ran back inside and grabbed my wife out of bed.  We both saw the third and then a fourth.  They seemed to be in formation.  As they got closer they began to go towards the right or South.  As they moved silently, I noticed there was no sound.  I also looked for wind.  It was a perfect dusk night.  No wind.  No sound.  Just more lights.   I told my wife to go back inside and grab her cell.  At first she could not see anything on the cell display.  She handed me the phone and I held it up into the sky at the objects regardless and pushed the button in hope it might see something. The photo is included with this report.  Unfortunately, the image does not show a very clear shot.  The good news is there is a tree, house, low small cloud in the image for comparison. I went back in the house as the objects disappeared towards the right into the trees. A put on my pants and went back out just in case.  Who knows, perhaps they would circle around?  My neighbor was coming around the corner in his car.  He asked if I saw some -thing?  Told him hell ya.  He said he say them also and his daughter also saw them from the house.",
      "link": "http://www.nuforc.org/webreports/127/S127974.html",
      "state": "OR",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c92",
      "summary": "I went to smoke outside, when I noticed a triangle in sky.  I would say it was three separate orbs but in a perfect triangle.",
      "city": "eugene",
      "shape": "triangle",
      "date": "2016-03-24T00:00:00",
      "story": "I went to smoke a cigarette outside, when I noticed a triangle in sky.  I would say it was three separate orbs but in a perfect triangle.   The lights were vertical then flip sideways and faded out.  When it started to turn sideways another orb came into few for a few seconds before it faded as well.",
      "link": "http://www.nuforc.org/webreports/126/S126520.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6170",
      "summary": "Saw triangle shaped craft with some kind of cloaking.",
      "city": "eugene",
      "shape": "triangle",
      "date": "2016-09-30T00:00:00",
      "story": "Saw triangle shaped craft with some kind of cloaking. I am a veteran of the military and an amateur astronomer so I am pretty good at aircraft identifications and where lights should be in the sky.  Last night, 09/25/2016, at approximately 20:15 I saw what looked to be a triangle shaped craft over the city of Eugene, Oregon. I had just stepped out on my balcony for a smoke and sat down in my chair facing East overlooking most of NE Eugene and N Springfield.  Looking in the sky above and well beyond the neighbor's house at the sight line of the power lines I saw 3 orange lights equidistant apart and in a triangle.  It occurred to me that there shouldn't be bright stars in the sky in that area that time of night and time of year so I  looked closer. As I  looked closer, I saw the bottom most of the lights moving and then I thought to myself:  that makes sense it is commercial aviation.  So I looked back at the other 2 lights and saw they were moving together too and that it was one triangle shaped craft rotating on its center axis.  All the while I noticed the bright orange lights were shining through what looked like heat shimmer coming off the desert floor. Very much like a scene from the movie, \"Predator,\" the \"cloaking\" around it wavered for just a brief second and when it did I saw a large triangle shaped craft with smooth sides and a smooth metallic bottom with a smaller circular abutment in the center with a light bluish glow.  The craft stopped rotating and it looked like a harrier jet pulling up its nose on a vertical takeoff and then it disappeared.  It did leave but as it was leaving the \"cloaking\" kicked back in and it disappeared from sight. Like something out of the X files 2 helicopters showed up within 30 seconds of the object disappearing.  Eugene is a small city and helicopters are fairly rare here with just a couple of overflights a day but these stayed on station for the better part of an hour circling over the Eugene/Springfield area.",
      "link": "http://www.nuforc.org/webreports/130/S130211.html",
      "state": "OR",
      "duration": "~15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6262",
      "summary": "Bright triangle shape with iridescent \"panel\" type tail.",
      "city": "eugene",
      "shape": "triangle",
      "date": "2016-09-09T00:00:00",
      "story": "Bright triangle shape with iridescent \"panel\" type tail. I went outside before retiring for the night as I usually do to look at the stars. It was clear, no moon, no wind. Out of the corner of my eye I saw a bright object.  When I looked at it, it was something I had never seen before.  At first I thought it was a big meteor entering the atmosphere, but as I looked, it appeared to be about 500 feet up, and about 1/2 mile away, and about the size of a small business jet.  It had a brilliant white ball of light at the front, and a 3 or 4 panel-like \"tail\" sections attached to it.  The sections were distinct from each other, they were iridescent radiant colors in red, green, and blue and were roughly 6 times the length of the \"head\".  It traveled smoothly from south to north, silent, and very steady.  It looked very similar in shape to the Teston (Kent), UK/England, sighting of Saturday, August 13, 2016.  I am an amateur astronomer, can identify most aircraft, and can tell the difference between n! atural occurring phenomena and a solid object.   It was truly something like I have never seen before.  It was awesome!",
      "link": "http://www.nuforc.org/webreports/129/S129680.html",
      "state": "OR",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c62e9",
      "summary": "What at first appeared to be a satellite shoots straight towards me at high speed, then reverses direction back to where it had been.",
      "city": "eugene",
      "shape": "circle",
      "date": "2016-09-15T00:00:00",
      "story": "What at first appeared to be a satellite shoots straight towards me at high speed, then reverses direction back to where it had been. This is a correction to my submission last night.  There were 2 witnesses (1 partial) and 1 craft, instead of 1 witness and 2 craft. I've also included my email address this time around. I was sitting in a lawn chair looking up in the night sky not long after dark, when I spotted what I thought was a satellite to the east of me.  I noted that it was about the same brightness as the surrounding stars except that it was moving across the sky at the speed of the usual satellite in a SW direction.  When it was aligned in front of and above me, at about 95-100 degrees, it appeared to suddenly shoot straight down towards me at a high rate of speed growing larger and brighter (bright white) the closer it came, maybe to about 10x the size it had been, not any larger than a dime. I thought to myself that if it continued in that direction it might hit me.  Then about ½ way down it suddenly reversed direction and went back up to the approximate altitude that it had been, continuing on its course in approximately the same SW direction.  The up and down trajectory lasted not more than a second or two.  A friend of mine was walking towards me, from behind, when I exclaimed, Wh! oa! in regard to the object coming towards me.  He did not see the object until I pointed it out after the fact.  So what he saw looked like a normal satellite traveling across the night sky.  We watched the object as it continued SW with no more unusual activity.  So what was the object: a military hologram, an ET spacecraft, something going on with my eyes (doubtful), or what? ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129923.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c62e8",
      "summary": "What at first appeared to be a satellite shoots straight towards me at high speed, then reverses direction back to where it had been.",
      "city": "eugene",
      "shape": "circle",
      "date": "2016-09-15T00:00:00",
      "story": "What at first appeared to be a satellite shoots straight towards me at high speed, then reverses direction back to where it had been. I was sitting in a lawn chair looking up in the night sky not long after dark, when I spotted what I thought was a satellite to the east of me.  I noted that it was about the same brightness as the surrounding stars except that it was moving across the sky at the speed of the usual satellite in a SW direction. When it was aligned in front of and above me, at about 95-100 degrees, it appeared to suddenly shoot straight down towards me at a high rate of speed growing larger and brighter (bright white) the closer it came, maybe to about 10x the size it had been, not any larger than a dime.  I thought to myself that if it continued in that direction it might hit me.  Then about ½ way down it suddenly reversed direction and went back up to the approximate altitude that it had been, continuing on its course in approximately the same SW direction.  The up and down trajectory lasted not more than a second or two.  A friend of mine was walking towards me, from behind, whe! n I exclaimed, Whoa! in regard to the object coming towards me.  He did not see the object until I pointed it out after the fact. So what he saw looked like a normal satellite traveling across the night sky.  We watched the object as it continued SW with no more unusual activity.  So what was the object: a military hologram, an ET spacecraft, something going on with my eyes (doubtful), or what? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129913.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c650b",
      "summary": "Translucent object observed flying in the clear, blue afternoon sky.",
      "city": "eugene",
      "shape": "cigar",
      "date": "2016-08-02T00:00:00",
      "story": "Translucent object observed flying in the clear, blue afternoon sky. We were traveling north on Beltline, when we first noticed an object flying in the cloudless, blue sky from west to east.  It appeared to be translucent and made me think of how an agate would look if it was held up to the sky.  It was quite small, longer than it was tall, but it definitely had a hump top & bottom about the middle of the craft.  We could see no wings,tail, or anything extending from the craft.  The speed was not too much faster than a commercial airliner, and we were able to watch it clearly.  The strangest thing about it was that it was completely invisible to our eyes when we tried to observe it after removing our sunglasses.  When we replaced our sunglasses it was clearly visible again.",
      "link": "http://www.nuforc.org/webreports/128/S128667.html",
      "state": "OR",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6657",
      "summary": "Green light comes falling down.",
      "city": "eugene",
      "shape": "cone",
      "date": "2016-08-02T00:00:00",
      "story": "Green light comes falling down I saw a green flight coming down from the sky, it seemed to paused while entering an invisible or unknown atmosphere change.  It came down gathering speed.   It was a very bright lime green.  It had a ball with the main part and a lighter green fading into a tail.   It fell behind the trees.  I was waiting for a sound of either a crash, or people shouting, but none came.  That seemed to be the whole event.   It was very clear that it happened, but I do not know on what it is or could be.",
      "link": "http://www.nuforc.org/webreports/128/S128932.html",
      "state": "OR",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c66b5",
      "summary": "UFO flashes by in video.",
      "city": "eugene",
      "shape": "disk",
      "date": "2017-03-10T00:00:00",
      "story": "UFO flashes by in video. My husband and I were walking our dog in Day Island Park by our house.  We were on Pre's (Prefontaine's) Trail, right next to Interstate 5 and the Patterson Slough, a canal that runs through the park.  It was a very clear sunny day and there was a University of Oregon game going on nearby at Autzen Stadium.   An airplane was flying overhead with a banner trailing it, like they often do on game days.  I stopped to bring up the video recorder on my phone because I was having a hard time reading the sign and wanted to blow up the image.  My husband asked me what I was doing and you'll hear him in the video saying, \"Coors Light,\" because he could read it (without being a dork like me and video recording it).  You can also hear someone else yell \"woah\" in the background, and I am not sure what that is about.   It wasn't until much later that I was watching videos on my phone that I noticed something come into the frame of the video in the upper corner by the plane and flash by.  It's moving at a very fast speed and seems to be fairly low in the sky.  What is crazy to me is it looks disc shaped, or partially disc and cylinder shaped, when you zoom in on it.  There were no other engine sounds other than the low flying airplane with the banner.   I'm interested to know if others think this is a UFO, or if there are any other logical explanations for the object.",
      "link": "http://www.nuforc.org/webreports/133/S133028.html",
      "state": "OR",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c67fb",
      "summary": "Multiple lights in formation moving east to west and slightly upward ~ static video 5 min.",
      "city": "eugene",
      "shape": "formation",
      "date": "2017-03-23T00:00:00",
      "story": "Multiple lights in formation moving east to west and slightly upward ~ static video 5 min. I have a five-minute video, taken around 1am from approximately 18th & Chambers, looking north.  There were multiple lights, orange, traveling from west to east with a slightly upward arch.  They seemed to just disappear as they moved upward one by one in relative formation. I do NOT believe in the idea of aliens visiting our planet, but I am not able to identify what I saw or filmed on my android phone. I kept the image static, did not zoom in, and did not vocalize during the video.  You are able to see the lights and surrounding buildings in the frame.  Since I stopped in the middle of 18th street, occasionally a westbound vehicle is viewable as it passes by. I have not uploaded the image anywhere and have only shown it to a few friends to get their reactions and interpretations.  No one to this point seems to have come up with a plausible explanation. I've been unable to find any other reports of any celestial lights of this kind online.  I am not comfortable uploading the video but am willing to have anyone who's not a quack interested in viewing it to do so.  I am worried about uploading the video as I am NOT interested in having it show up on some TV idiotic show. Contact me via email or phone if interested. I would like someone to possibly tell me what these might have been.",
      "link": "http://www.nuforc.org/webreports/133/S133224.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b6d",
      "summary": "Driving on Beltline highway westbound and seen bright white ball of light streak across sky heading SW.",
      "city": "eugene",
      "shape": "sphere",
      "date": "2017-01-26T00:00:00",
      "story": "Driving on Beltline highway westbound and seen bright white ball of light streak across sky heading southwest.   It caught the attention of myself and three kids, age 12 to 15, immediately as it lit up the sky as it flew by at speeds faster than any man made aircraft could do.  Possibly a meteor or space junk?  Eugene, Oregon. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132293.html",
      "state": "OR",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c6c",
      "summary": "3 strange objects on New Years Eve.",
      "city": "eugene",
      "shape": "diamond",
      "date": "2017-01-06T00:00:00",
      "story": "3 strange objects on New Years Eve While outside on New Years eve in Eugene, Oregon, I noticed a reddish light moving slowly in a perfectly straight line at low altitude.  It appeared to be fairly close, but there was no sound whatsoever (as would be from a drone).  When I got my video camera and zoomed in on it, it was diamond shaped in appearance, and changed color from white to red.  It also seemed to have a strange phase in and out quality.  After a short time the light simply vanished.  In all we saw three, one immediately following the other, in the same exact straight line.  There was no elevation variance whatsoever that you would expect from some sort of balloon, and no \"drift\" pattern.",
      "link": "http://www.nuforc.org/webreports/131/S131958.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d33",
      "summary": "Bright star in the horizon during sundown fades away.",
      "city": "eugene",
      "shape": "light",
      "date": "2016-12-15T00:00:00",
      "story": "Bright Star in the horizon during sundown fades away. Right during sun down i was watching T.V.  I noticed a light that caught my attention in the sky.  It caught my attention because there was still light out in the sky and you could still make out the clouds. The light was a very bright white.  It seemed odd because it was not high in the sky from my point of view and because it was a very clear bright light and there were no other stars visible in the sky.  I sort of figured it was just a very bright star. I was facing South in the direction of the light. In front of my home there is a 3 story building across the street.  The light was in the distance but just above the horizon of the building from my point of view. I don't believe it was close at all since it just appeared like a very bright star in the sky at sundown. The light remained stationary, I asked the person next to me to look at the light.  They first thought it was a light from a building very far away since it was a very bright white light, sort of the type you would see on Tall building Radios. I told them that it was not because we don't have those types of tall buildings in our city. They then just said at it in confusion. There were no sounds of helicopters around and there were no other lights around it, something a helicopter might have. ( red and white )  It did not move and stayed in the same position.  After a few minutes, It suddenly began to dim. and then the light was gone just before the sun completely went down.  The Dim of the light lasted about 10 seconds before it completely went out. Could of it been a drone?  Why would a drone need such a powerful light when there was still light out? and Don't most LED lights go off suddenly?  rather than a 10 second fade away?  the light did not seem near, appeared to be very far away like a star.",
      "link": "http://www.nuforc.org/webreports/131/S131721.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e8b",
      "summary": "Those stars were definitely not stars.",
      "city": "eugene",
      "shape": "light",
      "date": "2017-09-05T00:00:00",
      "story": "Those stars were definitely not stars. Sitting outside at about 9:45pm and we see what looks like a night sky full of stars, start moving about in little zips and pauses.    Then one seemed to drop down into our atmosphere and a bright flash went off towards our direction, almost like they knew we were watching and then the brightest one went back to what \"   I'm assuming was its position\" playing possum and was just a star again.   This is not a hoax or a joke on our part... FACT.. amazing..",
      "link": "http://www.nuforc.org/webreports/135/S135965.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f42",
      "summary": "My wife and I saw what appeared to be a commercial jetliner hovering over a field in Eugene, Oregon.",
      "city": "eugene",
      "shape": "other",
      "date": "2017-08-04T00:00:00",
      "story": "My wife and I saw what appeared to be a commercial jetliner hovering over a field in Eugene, Oregon. On July 17, 2017, at approximately 7:00 PM Pacific Time, my wife and I were driving South on Lorane Hwy in Eugene, OR.  As we passed the Andrew Reasoner Wildlife Preserve, we observed to the North what appeared to be a commercial jetliner hovering over the hill, approximately one quarter mile from our position on the road, and maybe 500 feet off the ground.  My wife noticed it first and exclaimed, “Look at that.  That’s not moving at all.”  My wife was convinced it was tethered to the ground, like a dirigible.   As the driver, I was initially focused on the road, but was able to turn my head left and see the plane for about 15 seconds and it did not appear to be moving.  I tried to convince myself that it was, just flying very slowly, but I saw nothing to indicate it was changing position.   The plane was extremely low; from our vantage point, we could almost see the tops of the wing surface and we could easily see the color scheme on the side of the plane (a flash of orange writing on a white fuselage).  Considering the Eugene airport is miles away to the North, and the plane was traveling, or hanging, East to West, I find no rational explanation as to why a giant commercial jetliner would be frozen, or possibly moving at a speed slower than our car.   Although I’m relaying this as if we cognized everything immediately, it wasn’t until we rounded the next corner and the “plane” left our sight that we realized how incredibly odd what we had just witnessed was.   We immediately turned the car around and were back where we first saw the plane in less than 30 seconds.  It was gone and although we had a clear view all the way to the horizon--West, North and South--we could find no trace of the “plane” in our view.   We couldn’t see clearly to the East, but it would have been impossible for the plane to head in that direction from the position it was in when it left our view and no chance we wouldn’t have seen it if it was even possible for it to instantaneously turn around.   Considering the proximity of the “plane” to our car, we should have heard the sounds of the plane's engines, but there was only the noise of our tires on the road.  The plane made no sound and didn’t show any exhaust gases.   We both are well- familiar with the area and have never seen a commercial airliner flying so low, let alone at walking speed, if not completely frozen.  It was one of the oddest things either one of us has ever experienced.",
      "link": "http://www.nuforc.org/webreports/135/S135536.html",
      "state": "OR",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7745",
      "summary": "Unknown aircraft in the sky.",
      "city": "eugene",
      "shape": "unknown",
      "date": "2018-01-12T00:00:00",
      "story": "unknown aircraft in the sky My mom and I went outside for a cigarette and she said do you want to see a low flying plane, so I looked and what I saw didn't look like an airplane.  It was hovering in the sky and it looked like it was coming towards our apartment complex.  I walked to the right, and when I looked back up to the sky, it was gone.   I decided to walk back to the point in the sky that I saw the aircraft at and it was gone.  If that was an airplane, where did it go?   A minute later there was a meteorite that flashed across the sky.  Both of us are freaked out and want to know where it went.  There was a bright red light in front of the aircraft and the wing span was enormous.  It looked like it was hovering in the sky. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138228.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7764",
      "summary": "Flat object with lights that on the side, it was hovering for a minute then brightened up and sped off.  ((anonymous report))",
      "city": "eugene",
      "shape": "disk",
      "date": "2018-01-12T00:00:00",
      "story": "I saw above a tree a flat object with lights that on the side, it was hovering for a minute then brightened up and sped up out of view. I saw behind a tree about 60 feet above was a lit up long flat disc shaped object. It hovered there for about a minute then procceded to move slowly along the row of trees getting higher and higher.  About 50 feet away it got lower and made a simaler sound to a boom of thunder and then it got lower and lower and zoomed off in the distance.  This took about 3 minutes then it was gone. Description of object: it lit up along the whole bottom edge.  The shape was like a flat disc and was ginormous and long.  Its pace had no stops and went smoothly.  When it was hovering it was still and the lights seemed dimmer than when it started to move. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138209.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8030",
      "summary": "60deg up WNW, noticed a bright white flash about -4.0mag.",
      "city": "eugene",
      "shape": "flash",
      "date": "2018-04-05T00:00:00",
      "story": "My neighbor and I were standing in front of my garage talking, about 10:45pm, Saturday night, March 31st, when I looked up about 60deg up WNW above the trees across the street and noticed a bright white flash about -4.0mag.  Thinking it was possibly the ISS coming over, I told my neighbor to look also, but about 4 seconds later, we saw a much smaller flash about 2.0mag followed 6 seconds later by another brighter flash as the object moved very slowly from WNW toward the E. I went inside and grabbed binoculars while my neighbor tried to capture it on his Android phone. When I looked at it through the binoculars I realized it was actually two objects!  One following the other and both flashing at irregular intervals.  After watching them move slowly across the sky, the brighter one suddenly TURNED SOUTH, continuing to flash every 6-12 seconds for about 30 secs before disappearing. Never seen anything like that happen before. The dimmer object continued E also flashing at odd intervals until it moved past 90deg above us and began quickly fading as if it was going into the earths shadow. First thought was it might have been the Tiangong-1 space station, but a quick check online showed it nowhere near our latitude. A check of the satellite databases showed no objects matching the magnitude, altitude or azimuth observed for the time frame. Whatever they were they appeared to be very high altitude, possibly tumbling and moving very, very slowly compared to satellites or aircraft. Observer #1 has been an astro-imager and satellite tracker for 15yrs+, an aviation enthusiast for over 40 yrs, and has seen a lot of strange looking, but easily explainable, things in the sky.  These were VERY odd objects indeed!!   Observer #2 has had one other observation of different unknown objects 3 1/2 years ago about 2 miles from this location. ((NUFORC Note:  Possibly tumbling space debris, giving off intermittent reflections of the Sun??  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139330.html",
      "state": "OR",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c811d",
      "summary": "It looked like combat at near satellite altitude.",
      "city": "eugene",
      "shape": "flash",
      "date": "2018-03-02T00:00:00",
      "story": "It looked like combat at near satellite altitude.  There were several white flashes of different intensity.  First traveling west to east, then turning north. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138912.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8629",
      "summary": "2 Solid Teal Green lights East of my sight Both lights Stationary at First  Then both became Solid Red lights or Balls and the right li",
      "city": "eugene",
      "shape": "light",
      "date": "2018-08-10T00:00:00",
      "story": "2 Solid Teal Green lights East of my sight Both lights Stationary at First    Then both became Solid Red lights or Balls and the right light floated and moved due North... No pattern  Then both Lights sank below tree line",
      "link": "http://www.nuforc.org/webreports/142/S142462.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fee",
      "summary": "While heading W on Beltline saw what appeared to be an aircraft on fire, descending from the clouds with a trail of faint smoke.",
      "city": "eugene",
      "shape": "fireball",
      "date": "2018-11-24T00:00:00",
      "story": "While heading west on Beltline saw what appeared to be an aircraft on fire, descending from the clouds with a trail of faint smoke. ((NUFORC Note:  We see nothing of interest in the photo that was forwarded to our Center.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143860.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c954a",
      "summary": "I saw a something appear in the sky out of nowhere and shoot off across the sky like a comet that disappeared into clouds rumbling",
      "city": "eugene",
      "shape": "flash",
      "date": "2019-12-01T00:00:00",
      "story": "I saw a something appear in the sky out of nowhere and shoot off across the sky like a comet that disappeared into clouds rumbling I was on my driveway in the River Road area of Eugene Oregon teaching a martial arts lesson to a private student at night. The object was probably flying overhead around 6:30pm or later but not after 7pm. I saw a flash of light that remained consistent for about 2 seconds then disappeared flying in 1 direction headed into some clouds and disappeared. It did not come out the other end of clouds. It was as if the craft sped up and shot some fire/light out and looked almost like it could have been a close falling star or meteor. I heard a very quiet rumble and it was almost silent. I said “What is that?” And my student then looked up and saw it too. She would not have noticed unless I said something. The reason I saw it was because I saw it out of my peripheral vision above as it shot very fast into the clouds. It came from an area of no clouds heading west and flew in a dart of light into some dark clouds and disappeared. I did not see it come out anywhere else. The entire event could not have lasted more than 2 seconds. I think I may have seen a stream of smoke or a trail out like a comet or a jet stream that only started from when I saw the flash until it went into the clouds. I was not sure if the shape was a ball or a dart shape. It may have been a military jet that was silent and doing night flying. I am not sure what it was. It was very fast and before it flash! ed it was completely silent and undetectable by sound or even sight. Like it appeared in the sky and flew fast like a comet and went into a cloud and disappeared. And yes it was way lower than any meteorite but way higher than a typical airplane flies and way faster than any commercial jet flying. I am 37 years old and college educated and a martial arts teacher.  My student is 45 years old and a mother and grandmother and married.  She works as a phlebotomist at a local hospital and is also educated.",
      "link": "http://www.nuforc.org/webreports/150/S150707.html",
      "state": "OR",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c95aa",
      "summary": "3 lights in a triangular formation, disappeared after getting out of car",
      "city": "eugene",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "3 lights in a triangular formation, disappeared after getting out of car There was 1 UFO, seemingly above Spencer's butte, a local hiking spot. I was driving and noticed it, it was brighter than the brightest star/planet would be at that time of day, and moving slower than a satellite. It was also not blinking like an airplane. I was driving home, and the object seemed to continue to rise from the butte and come closer to me.  As I kept driving, I could see more of it.  I slowed down and squinted, and saw that it was 3 bright white lights in a triangular shape.  I was close to home so I sped up into my driveway, got out, and it was gone.  I scanned the entire sky, nothing to be seen.",
      "link": "http://www.nuforc.org/webreports/150/S150847.html",
      "state": "OR",
      "duration": "2 minutes"
    }
  ]
}