{
  "city": "fayetteville",
  "fetch_timestamp": "2025-07-12T14:36:31.412550",
  "record_count": 129,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b432a",
      "summary": "saw it through my car sunroof, zipped away",
      "city": "fayetteville",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "saw it through my car sunroof, zipped away I was driving to waork with my car sunroof open. when arived at work I was closing it when i saw A silver disk through my sunroof. it was making a humming sound. I thought my eyes were fooling me so i stepped out of my car to get a better look, and the second i got out i saw it zip away, leaving a glowing trail. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50541.html",
      "state": "AR",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4699",
      "summary": "A red cigar-shaped UFO with a glow around it flys up into the sky",
      "city": "fayetteville",
      "shape": "cigar",
      "date": "2006-05-15T00:00:00",
      "story": "A red cigar-shaped UFO with a glow around it flys up into the sky I was doing yardwork and I saw a large cigar-shaped red UFO hovering in the sky. It was emitting a red light. I told my freind and he came out and saw it. It moved to the left a ways and then flew straight up. I lost track of it.",
      "link": "http://www.nuforc.org/webreports/050/S50505.html",
      "state": "AR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a05",
      "summary": "Three flying crafts blinking red and green.",
      "city": "fayetteville",
      "shape": "chevron",
      "date": "2019-07-05T00:00:00",
      "story": "Three flying crafts blinking red and green Crafts were flying overhead during fireworks display.  They were changing from red to green to red to green.  Two of them stopped near each other behind us now, they stayed stationary about 20 minutes then one descended straight down.  Then about five minutes later the other descended straight down.  The third stayed on the other side of the sky where they all appeared from.  Couldn’t tell if they made sound because the fireworks were so loud.  They looked the size of small planes.  The third one eventually disappeared.  The entire sighting lasted about thirty minutes.",
      "link": "http://www.nuforc.org/webreports/147/S147341.html",
      "state": "AR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a72",
      "summary": "MADAR Node 136",
      "city": "fayetteville",
      "shape": "",
      "date": "2019-06-07T00:00:00",
      "story": "MADAR Node 136",
      "link": "http://www.nuforc.org/webreports/146/S146651.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4ad1",
      "summary": "MADAR Node 136",
      "city": "fayetteville",
      "shape": "",
      "date": "2019-06-20T00:00:00",
      "story": "MADAR Node 136",
      "link": "http://www.nuforc.org/webreports/146/S146778.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4acf",
      "summary": "MADAR Node 136",
      "city": "fayetteville",
      "shape": "",
      "date": "2019-06-20T00:00:00",
      "story": "MADAR Node 136",
      "link": "http://www.nuforc.org/webreports/146/S146780.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4bfd",
      "summary": "Flashing from a possible satellite tumbling on its arc.",
      "city": "fayetteville",
      "shape": "unknown",
      "date": "2019-06-27T00:00:00",
      "story": "Flashing from a possible satellite tumbling on its arc. Took my dog out for his last night potty run about 10:45 pm tonight.  I always look up at the stars at night as it was something Dad and I used to do when I was growing up.  He was an engineer, designing early communication satellites, and I know quite a few of his designs are above us, circling the Earth.  Dad taught me how to identify a planet as opposed to a star, and how to track the satellites when they go overhead. Tonight, I caught a glimpse of a flash of white light out of the corner of my eye traveling from the west to the east/southeast sky above the star Altair (used my Sky Guide app to figure its location), then dismissed it as I thought it was a light of an airplane high overhead.  We are under the flight lines for our local airport and the nearby military base.  I looked to the south and then back over where I saw the light and saw a smaller glimmer of it.  Continued watching that area of the sky and it flashed again and again, somewhat in a predictive sequence about 2-3 seconds in between each flash and the duration of the flash was a fraction of a second which made it very hard to predict where it was going.  When it flashed again, this time it was like a streamer flying in the wind with a 1-2 second duration and then it disappeared, only to quickly flash again a few more times before the light dimmed out of sight. I do not believe it is a UFO craft.  I believe I saw a satellite which may have been knocked so it's spinning while in orbit and caught the sun reflecting off its solar panels (the flashing light) instead of a steady glow which moves in an arc across the night sky.  The flashing light was still traveling as if it were following a satellite arc, that's how I could guess where to look when I realized it wasn't an airplane flying overhead.    Just wondered if anyone else had seen the same thing tonight.  Pretty interesting!",
      "link": "http://www.nuforc.org/webreports/146/S146978.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ce1",
      "summary": "Three flying crafts blinking red and green",
      "city": "fayetteville",
      "shape": "chevron",
      "date": "2019-07-05T00:00:00",
      "story": "Three flying crafts blinking red and green Crafts were flying overhead during fireworks display. They were changing from red to green to red to green. Two of them stopped near each other behind us now, they stayed stationary about 20 minutes then one descended straight down. Then about five minutes later the other descended straight down. The third stayed on the other side of the sky where they all appeared from. Couldn’t tell if they made sound because the fireworks were so loud. They looked the size of small planes. The third one eventually disappeared. The entire sighting lasted about thirty minutes.",
      "link": "http://www.nuforc.org/webreports/147/S147339.html",
      "state": "AR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d32",
      "summary": "MADAR Node 136",
      "city": "fayetteville",
      "shape": "",
      "date": "2019-06-07T00:00:00",
      "story": "MADAR Node 136",
      "link": "http://www.nuforc.org/webreports/146/S146638.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4fe6",
      "summary": "Shapeshifting, yellow ufo seen in broad daylight over elementary and high school in Georgia",
      "city": "fayetteville",
      "shape": "other",
      "date": "2019-03-29T00:00:00",
      "story": "Shapeshifting, yellow ufo seen in broad daylight over elementary and high school in Georgia. On Monday morning at 7:20 am, I dropped off my child to school.  I then left school, in my car, heading  towards home. At 7:40 am, while driving, l saw a yellow/light beige/dimmed white, wide V sign/open triangle v, with the point pointed towards me.  It changed shape from a wide V / open triangle, to 2 wide open V triangles, V /\\ turning from an open V triangle, to a closed overlapping square &lt;&gt; continuing to change shape from a overlapping “square” to a closed diamond \\//\\&lt;&gt;. The UFO was in constant movement/ shifting shapes not radiating light, dimmed yellow in appearance. It was higher than full grown pinetrees that were in sight next to the ufo, on the right side (trees approximately 8 feet high). It was whatsoever not right next to the trees, but far away, high in the sky. It was a pretty blue sky day and the uap was approximately 1 mile visible to an Elementary School. I was driving while this was happening and only was able to capture about 2 seconds of the ufo on my cellphone video, where you can see a yellow spot behind pine trees, before it disappeared.  Not flying away or zooming away, but here one second gone the next.  It seemed more like a clocking, then disappearing. When I returned home, I had tried to reach out for someone to “investigate”, since it had been sooo close to an elementary and high school, but without success. Eventually I called 911 to report a ufo anonymous, but I am not aware of any additional sightings from others. During this sighting there were many cars behind me and the street was in open view to many others, at this busy Monday morning, school day. ((NUFORC Note:  We spoke via telephone with this witness, and she seemed to us to be quite sincere and sober-minded.  We suspect that she is a highly reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145302.html",
      "state": "GA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b511d",
      "summary": "fayyetville,NC true ufo sighting 07/04/1978",
      "city": "fayetteville",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "fayyetville,NC true ufo sighting 07/04/1978 it was back in 1978,july 4th evening me and people were outside topeka heights apartments off camden rd,off dwelle dr,we saw this saucer disk shaped object size of a football field,hover over the parking lot completely taking up most of the sky view,full moon light nite with street lights,20 or more people saw this,we all still remember to this date,me and the guys were playing football in parking lot,we threw rocks at it,it had flashing lights around it,a low humming noise could be heard from the craft,the rocks never touch the craft,it went over the apartment building which was 2 story,it was only hovering about 30 feet above the building,it took off at the back of the building and flew away in a few seconds out of sight completely,my first and last sighting ever,i swear this is the truth so help me god,we call the air force to report this,they told us it was a weather balloon,we all know better ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52470.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5617",
      "summary": "20 min encounter with quite a machine",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "20 min encounter with quite a machine I was 16, my father and I were on a short trip to pick up his car from a shop in Muscota Illinois, we were on 4 hwy.  We were crossing the Kaskaskia River bridge, looking to the East, I saw what looked like a new bridge being built... lights lit up the river and the trees lining the banks maybe 1/8 of a mile up river, there was an expance from bank to bank. we made the left turn in Fayetteville ( a very small burg with omly a few blocks in all directions)as we started out of town ( my dad driving)I looked to my left and what I thought was a bridge project was now rising out of the river bottom and heading our way, the lights on the thing went out with only what appeared to be \"cab\" lights, the sky was clear but dark only lit by the lights of St Louis and Belville Ill. It was black on dark you could see the shape but see no detail, as we made the trip this thing paced our speed and direction from 50 mph to 75 and once we stopped to see what it would do... it stopped we shut the car off and watched for a moment, it just remained there waiting, well we had to pick up a car and there really was nothing we could do about\"it\" so on we went, as we pulled into the repair shops lot the craft when overhead and headed in the direction of Scott AFB.The craft was large maybe 200' on all sides, it's flight was around 500'up and it did not make a sound. We saw it and It seen us. contact me, I have more",
      "link": "http://www.nuforc.org/webreports/054/S54970.html",
      "state": "IL",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5dac",
      "summary": "I was watching lunar eclipse on Monday with uncle.After full eclipse decided to look at how bright the stars where.I saw Orion's belt a",
      "city": "fayetteville",
      "shape": "flash",
      "date": "2007-10-08T00:00:00",
      "story": "I was watching lunar eclipse on Monday with uncle.After full eclipse decided to look at how bright the stars where.I saw Orion's belt and looked down toward tree level when I noticed three different colors of light shining .They where red,white,and blue.At first i thought that it was an airplane .I had worked for Delta airlines for 5 years and knew that was the color of the lights they use.But within a minute of watching them they weren't moving and I didn't hear anything but crickets chirp-ping.So I got my DVD camera that i had been using for the eclipse and started filming it.Now the strange thing was that with my naked eye I could see it at all times but when I watched it on DVD later it disappears and reappears.It also changes shape on the film but looked the same to my naked eye.I have the film if anyone would like to look at it you can just email me and Ill get you a copy.Ive gotten in touch with mufon of Georgia witch i plan to meet with them this coming weekend and show them the film.Anyways thats the basic story of what happen.",
      "link": "http://www.nuforc.org/webreports/058/S58444.html",
      "state": "GA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b607b",
      "summary": "2 White flashing lights moving across the sky over Fayetteville, Ga.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "2 White flashing lights moving across the sky over Fayetteville, Ga I am in shock at what I saw last night. Ok, I was laying on the golf course with 2 friends and one of them turned to me and said what is that? I looked up and there were 2 flashing white lights moving parallel to eachother. One light would flash for a half of a second as thenother turned off for a half of a second. I know for a fact that it was not an airplane because there was no noise and I could not see the object between the lights (if there was one). They were moving about 2 times the speed of an average airplane would move in the sky. They seemed about the same altitude that an airplane would travel. I am still in shock of what happened and i cannot get it out of my mind. Can some one give me some clarification on what exactly this could have been.",
      "link": "http://www.nuforc.org/webreports/057/S57250.html",
      "state": "GA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6226",
      "summary": "Two bright star like objects swooping down then hugging tree line....",
      "city": "fayetteville",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "Two bright star like objects swooping down then hugging tree line.... January 2007, Fayetteville NC  It was around 7:00pm. I was heading west to my parents house on Cliffdale Rd. I saw these two bright lights coming out of the clouds (storm clouds just hit the area.(no rain tho) The clouds were mid altitude to low, running fast west. Now at first I thought they were helicopters, because my parents live right next to Fort Bragg. And it’s totally normal to see them in the area. Now what caught my attention was the light as they came out of the clouds (it was kinda dark all around), I thought dam that’s cool to be flying and doing that(coming out of a storm like that). I saw them and lost them as I drove. They came out of the clouds and started to head down. Now when I turned into my parents housing area, as I was going down the road and I saw the lights again behind the houses (not right behind the houses) but I could see where they were still moving west and heading down. I pulled into my parents house and ran to the back yard. The lights were bright, very bright. Both the lights seem to be independent from each other but kept a tight formation. One light was a head of the other. As I watch them, they swooped down and started hugging the tree line real close, I mean right down in the tree line. I could see the lights thru the trees, its January and the trees had relatively no leaves on them. They where constantly changing altitude, up, up, up, down, up, down up..etc... Very quick tho. I had a clear line of sight on them, before hugging the tree line. The description of the light was as follow: bright white (dead center) to white/yellowish around its edges. The light was not glowing perfectly around the object but had spikes of lights around it but north, east and west the spikes of light where at there greatest, with a long tail down (kind of like in Christmas cards, how they draw the star of Bethlehem) The tail down was really weird, it sparkled half way down the tail, slightly wavy and sparkling. As I sat there watching them, I really could not focus on them because it was all light. But I did squint m! y eyes a nd I saw a hint of blue and yellow blinking light (only one time) coming from dead center of the object. They got closer and closer down into the tree line and keep moving west right into Fort Bragg. Now I thought of every thing that it could have been. I am a military brat, seen all types of aircraft daytime and nighttime. No way was it a helicopter. If it was they are very irresponsible for flying that low in that kind of weather. Also it moved up and down so fast and tight when hugging the tree line. The other thing that I thought it could be is a flare canister with a parachute that larger military aircraft release. But the wind was strong and they would of flow apart unless they were tied together, if so I didn’t see the chute, which I think I should have been seen easily with that large of a light source. And the light was so large that I think that the chute would have caught on fire. Also when they came out of the sky the were coming down at a constant rate and smoothly straighten out before hugging the tree line. The wind was to my back going west but I tried to see if I heard anything but the wind on my ears made that impossible. The light source is what made me think. If it was any type of aircraft the light source completely envelop the whole aircraft. Never seen anything like that. I looked all over the internet and read this whole website trying to validate what I saw. The only thing that I keep reading is that people see a star like object, but I wish people be a bit more detail....thus me writing a lot...PS When I say they flew into Fort Bragg, Fort Bragg is a big base, I don’t mean the main base were the housing area is and the PX/BX, mini mall is at. But there is a large area west of bragg that’s all impact area and they have drop zones there, field exercise area, etc., also I will be sending you a map as soon as i can get it done. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56160.html",
      "state": "NC",
      "duration": "7 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6383",
      "summary": "I was driving up to Raleigh, NC on I-95 N from Fayetteville, NC to visit some friends. It was about 10:30 at night. I am pretty sure it",
      "city": "fayetteville",
      "shape": "cigar",
      "date": "2007-08-07T00:00:00",
      "story": "I was driving up to Raleigh, NC on I-95 N from Fayetteville, NC to visit some friends. It was about 10:30 at night. I am pretty sure it was June 25 (Monday).  All of a sudden I saw this large ball of blue light emerge just above the tree line and zip across the highway. It had a smaller blue light at the very end of it  - I would say both lights were more at the tips of the craft rather than on the underside of it. I also noticed vertical grooves (evenly spaced) on it as it neared the other side of the highway before disappearing over the trees. I am assuming it is cigar-shaped but from the angle I saw it at - although, it could have been saucer shaped. It made absolutely no sound whatsoever. I drove a little ways down to get a better view where there weren’t any trees. I could see all the way to the horizon. There was nothing there. It made no sense. I have traveled this road on many occasions and I am used to seeing planes fly overhead and I always like to look at them as they fly off into the distance. I couldn’t even see any lights or anything at all out there. It was as if it never happened.  Overall, I’d say I saw the craft for about 10 - 15 seconds, if that. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57790.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b66a9",
      "summary": "Satellite-like light was seen moving in various directions at a high rate of speed.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2008-01-21T00:00:00",
      "story": "Satellite-like light was seen moving in various directions at a high rate of speed. A friend and I watched a light that looked exactly like a fast moving satellite high in the Eastern sky.  I pointed this object out to my friend and she also thought it was a satellite.  As it reached the middle of the sky, it stopped moving.  It stayed stationary for several seconds and then began to move backward along its original path.  It then stopped after a few seconds and remained stationary.  It then moved in an extremely tight circle and moved between 9 and 12 degrees lower in the sky within less than a second. It remained stationary for several minutes before clouds moved in and it became difficult to see the object.",
      "link": "http://www.nuforc.org/webreports/060/S60615.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6841",
      "summary": "Brilliant amber light in sky near Fayetteville NC",
      "city": "fayetteville",
      "shape": "unknown",
      "date": "2008-02-14T00:00:00",
      "story": "Brilliant amber light in sky near Fayetteville NC I was driving on 295 headed east toward I95. I drive this road every week on either Monday or Tuesday on my way to work in Washington DC in the early Am hours. I saw an unexplained, very bright light in the sky slightly southeast of my location as I headed east. When I exited the 295 to head north on I95, the light was still sitting there and was several miles east of the BP gas station visible from the entrance ramp to I95 It never moved it just sat there shining really bright. I drive that route every week like I stated and I have never seen that bright light before or since.",
      "link": "http://www.nuforc.org/webreports/061/S61386.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f2c",
      "summary": "flying glowing cloud like object",
      "city": "fayetteville",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "flying glowing cloud like object I looked up at the sky and seen a flying glowing cloud going in a circle. First i thought it might have been a spotlight...but it was not in the shape or lit as much as a spotlight and there was not a beam coming from below. It was like a flying cloud of light circling the sky. It was VERY eerie, almost like an angel or somthing. I look up at the sky many times at night, and this almost hypnotised me but spooked me at the smae time. It was NOT a spot light, and it's circle like distance it flew was not vast.",
      "link": "http://www.nuforc.org/webreports/056/S56598.html",
      "state": "AR",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3b7886",
      "summary": "White ball with alternating colored orbs, hovering/moving above tree level in urban Arkansas neighborhood.",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2007-08-14T00:00:00",
      "story": "White ball with alternating colored orbs, hovering/moving above tree level in urban Arkansas neighborhood. I was walking my dog, when I noticed a weird white light over across the big field from where I live, just hovering. So I immediately thought there must've been a new light installed on a phone tower or something in that area. Only this white light had two smaller lights, one red, one blue, rotating around it in a circle, alternating lights. I just began to think nothing of it, and started back inside, but my dog pulled me back the other way, and as I looked back up to where it was, it had moved towards my direction, and was still moving. At this point, I thought well maybe it's plane, but that didn't explain why it was hovering before, nor did it explain the red and blue white spinning around it. So I watched it for a couple more minutes as it came towards me, and then is stopped. It stopped again in mid-air, and hovered for maybe 30 seconds, and then started moving again, only this time heading East, the whole time with the red and blue lights spinning around it. I watched it until it was out of my line of vision behind other houses and trees.  This \"craft\" emitted absolutely no sound whatsoever. I've seen planes and helicopters around here. The planes are NEVER this low to the ground, and you always hear them. Same goes for helicopters. I'm in a valley, you'd hear anything up there. This thing was maybe 50 feet up, and made absolutely no sound whatsoever.",
      "link": "http://www.nuforc.org/webreports/058/S58126.html",
      "state": "AR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b850b",
      "summary": "Possible UFO chased by fighter jet over or near Fort Bragg/Pope AFB NC.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Possible UFO chased by fighter jet over or near Fort Bragg/Pope AFB NC. I was sitting outside on the patio smoking a cigar.  It was shortly after sundown with some lingering clouds that were illuminated brightly because of the bright moon.  Looking distantly towards the north/northwest I saw an object with a reddish glow move from the east to the west.  The light did not blink, so my first thought was that the object was the space station flying overhead.  It had been a few years since I've seen the space station overhead, so I was excited to see it again.  But then I realized that the trajectory was not they typical pattern the space station orbits over the earth.  As I began to realize that this object was possibly not the space station, another object with a flashing light akin to an aircraft or fighter jet began to follow the first object.  It sped up as if it were trying to catch up to it and then when it got to a certain distance from the first object, it locked in the same speed and maintained its course and distance with the first object.  I watched for a few more seconds before I lost view of both objects behind the clouds.  This could have occurred either over Fort Bragg or Pope AFB or just to the north of these military installations.  I am located about 2 miles south of the Reilly gate of Fort Bragg. No noises were heard and no definitive shapes could be identified. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68015.html",
      "state": "NC",
      "duration": "1-2 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8711",
      "summary": "Bright light moving West to East in Northwest Arkansas...Then vanished into thin air!",
      "city": "fayetteville",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Bright light moving West to East in Northwest Arkansas...Then vanished into thin air! I went outside with my cat and noticed a bright light to the West of my house. Initially I thought it was an airplane coming straight toward my house at about 500ft. Then I noticed that the light was not flashing like an airplanes light do, and the light was moving slower than an any airplane I have ever seen. I tried to tell myself that it was just an airplane coming toward me so it only appeared slow and from the angle it was approaching I could only see the front headlights. I now doubt it was an airplane because it simply disappeared...Vanished...Gone. I have never seen anything like it. It was as bright as Venus on a clear night, but was moving from the West to the East at a very slow rate, and then simply was gone. Anyone else in NW Arkansas see this light?",
      "link": "http://www.nuforc.org/webreports/072/S72606.html",
      "state": "AR",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b87f8",
      "summary": "Satellite or Space Debris burns up over Fayetteville, AR, Nov. 3, 2008, 8:05 pm",
      "city": "fayetteville",
      "shape": "rectangle",
      "date": "2009-01-10T00:00:00",
      "story": "Satellite or Space Debris burns up over Fayetteville, AR, Nov. 3, 2008, 8:05 pm Sighting of what was most likely satellite or other space debris entering atmosphere and burning up.  Trajectory was heading N.W. over Fayetteville, AR toward Joplin, MO.  Sorry, don't think this was a \"UFO\" per se, but was a notable event in the sky... quite bright (about 1/2 as bright as a full moon!).",
      "link": "http://www.nuforc.org/webreports/066/S66691.html",
      "state": "AR",
      "duration": "2 to 3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b88b6",
      "summary": "It was a a yellow fire ball falling fast towards the noth of Fayetteville , NC",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "It was a a yellow fire ball falling fast towards the noth of Fayetteville , NC I was at my ant and uncle's house when I saw it.it was about 6:oo it looked like a yellow fireball falling very fast.it looked less than a few miles away it was falling varry fast.I bet it hit the suface.",
      "link": "http://www.nuforc.org/webreports/066/S66760.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d39",
      "summary": "Huge Blue/Green Orb over Fayetteville GA, decended straight down",
      "city": "fayetteville",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Huge Blue/Green Orb over Fayetteville GA, decended straight down Tonight, October 20, 2009 at 9:00 p.m. I was driving east on Hwy 54 from Peachtree City to Fayetteville. GA.   As I was passing Fayette Piedmont Hospital, I saw a large pulsing orb -  blue/green (turquoise) - high in the sky out my driver's side window.   It was hovering in the sky, then it became very bright (still blue/green) and decended straight down - vertically - and dropped below the tree line.  This was not a shooting star - there was no trail and it did not shoot across the sky. It decended straight down vertically like an elevator. The light (orb) appeared to be larger than any plane, helicopter or star I've ever seen in the sky at night.",
      "link": "http://www.nuforc.org/webreports/072/S72942.html",
      "state": "GA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e0a",
      "summary": "chevron, formation, evening, slow-moving",
      "city": "fayetteville",
      "shape": "chevron",
      "date": "2008-08-12T00:00:00",
      "story": "chevron, formation, evening, slow-moving I was returning from work and I pulled into my subdivision and at the second right turn, I looked up and saw green, white, and red lights in set against a dark chevron shape. What was remarkable was the speed at which it was going, about under five knots. Since this was in February, the sun sets earlier so it occurred between the end of dusk and the beginning of the night. It was a clear night with a few clouds and some stars that were visible.",
      "link": "http://www.nuforc.org/webreports/064/S64375.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9657",
      "summary": "UFO observed in front of the Moon during FULL Lunar Eclipse 20 February 2008 in Fayetteville, NC",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2009-06-09T00:00:00",
      "story": "UFO observed in front of the Moon during FULL Lunar Eclipse 20 February 2008 in Fayetteville, NC Approximately 22:40 EST, 20 February 2008, at XXXX ((deleted)) Drive, Fayetteville, NC 28311, I was observing the lunar eclipse that began about 22:30 EST. From my position in North Carolina, the moon was in full lunar eclipse; weather was ideal- \"clear blue and 22\" as we say in aviation; the moon was approximately 55 degrees South/ Southwest overhead- in other words, I had a clear unobstructed view of the lunar eclipse from my position on my front porch in Fayetteville, NC. I normally wouldn't be looking at the moon except this Lunar Eclipse event had been widely publicized on TV that evening. I was enjoying an event with unobstructed view that few will ever witness in their life time. Approximately 10 minutes into the full lunar eclipse, about 22:40 EST, I noticed on the left side of the moon (as I was facing it), a very bright, round object resembling a satellite; a bright pin-point of light object; clearly not a naturally formed object appeared suddenly, traveling in a straight line from the left side of the back side of the moon- it was clearly traveling in a straight line towards Earth. In about one to two seconds, the object made a 90 degree turn to my right, directly in front of the face of the fully eclipsed moon.  As quick as it appeared and shot across in front of my unobstructed view of the eclipsed moon, it disappeared off to my right side of the Moon and became invisible almost immediately of passing out of the Umbra shadow of the Earth eclipse of the Moon.  The entire event was less than 5 seconds. I am a US Army trained combat helicopter pilot, Desert Storm veteran of the Gulf War.  I'm accustomed and trained to look for things, especially at night.  This was not a naturally occurring object. This object made intelligent turns and in relation to the position of the moon, was traveling at as fantastic rate of speed. I am not a UFO nut.  You may even call me skeptical.  I have been able to observe a great deal of objects while flying with night vision goggles at night in various parts of the world.  I have witnessed many naturally occurring and man-made events in the sky normally not seen with the naked eye.  But this object appeared from the back-side of the moon with my un-aided view and flew directly across in front of the moon was of intelligent design and flight path.  It probably would not have been visible during the lighted or visible, not eclipsed, moon, by an un-aided human eye.  But during the eclipsed darkened view of the Moon, it was so clearly visible to the naked human eye!   I truly believe the object I observed was not of natural origin but of intelligent origin.  I am capable of distinguishing the difference between a circular type orbit versus a straight flight path.  This object was of the latter. And I know of no known human-made objects that could have produced such incredible speeds and turns based upon its observed position that night from the back side of the moon, making an instant 90 degree right turn in front and across the eclipsed moon that night. By the way, I was 47 years old at the time of the lunar eclipse and my eye sight has been evaluated as 20/12 & 20/15 in each eye during every one of my US Army Flight Physical Evaluations for the past 20 years.   I honestly believe I witnessed an intelligently driven object not of man-made origin.  I have reluctantly not reported this event to anyone before now because it was so incredible to believe myself.  And I do not want to be labeled a \"UFO Nut\".  But I witnessed, regardless of scrutiny, a truly incredible event that evening on 20 February 2008 during the Lunar Eclipse.",
      "link": "http://www.nuforc.org/webreports/070/S70325.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b97e8",
      "summary": "something followed my family and left a piece behind",
      "city": "fayetteville",
      "shape": "sphere",
      "date": "2010-02-14T00:00:00",
      "story": "something followed my family and left a piece behind At around midnight my wife was driving home with my two sons when she noticed abright orange sphere following the car just above the tree tops ,  it frightened her so she excelerated the car from 30mph to about 50mph but it matched her speed she also said the radio went out at this time, so she pulled into the drive way and her and my sons got out of the vehicle and noticed it was hovering above them at about 50ft they yelled for me and i ran out of the house and saw it but it then shot up and into the clouds but it hit abird or something and something fell off of it and when i found it it felt like plastic but it is some kind of metal we still have it but dont know what to do with it",
      "link": "http://www.nuforc.org/webreports/074/S74210.html",
      "state": "WV",
      "duration": "7 minuts"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ae1",
      "summary": "a object fell, then two hours pased.",
      "city": "fayetteville",
      "shape": "unknown",
      "date": "2009-05-12T00:00:00",
      "story": "a object fell, then two hours pased. the object burned brightly for 3 minutes.then it fell to the ground.Very slowly,though. then it hit our car.when we woke up,it was 10:31.but it felt like 10 minutes.",
      "link": "http://www.nuforc.org/webreports/069/S69752.html",
      "state": "AR",
      "duration": "8-10 Mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b9bd7",
      "summary": "2 Bright Red lights moving in opposite directions (South and North) very slowly just below the clouds. No sound.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "2 Bright Red lights moving in opposite directions (South and North) very slowly just below the clouds. No sound.",
      "link": "http://www.nuforc.org/webreports/071/S71220.html",
      "state": "AR",
      "duration": "5 Mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b9dbe",
      "summary": "A bright object that I identified to my boss incorrectly as the I.S.S. She stated it was moving to fast to be the I.S.S. and that it co",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "A bright object that I identified to my boss incorrectly as the I.S.S.  She stated it was moving to fast to be the I.S.S. and that it could only be viewed at specific times.  This was not one of those.  It moved quickly through the sky, higher than commercial air traffic.  The object than paused and shot directly up/away.  You could tell it was moving \"up\" or away because the light dimming as distance passed.  We we're both in shock and now are very much believers.  We both told each other, \"dear god, I was glad someone else saw that\".",
      "link": "http://www.nuforc.org/webreports/071/S71262.html",
      "state": "AR",
      "duration": "1min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0eb",
      "summary": "Two lights seen traveling from southwest to northeast over my location in Georgia at extreme altitude.",
      "city": "fayetteville",
      "shape": "other",
      "date": "2010-05-12T00:00:00",
      "story": "Two lights seen traveling from southwest to northeast over my location in Georgia at extreme altitude.  They appeared to be stars at first until the trailing object emitted a bright white light for about five seconds, then they resumed medium magnitude starlike appearence. They appeared to be traveling one behind the other, in a straight line, at medium slow speed but seemed to be at a very high altitude. No navigation lights were observed.",
      "link": "http://www.nuforc.org/webreports/075/S75366.html",
      "state": "GA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba591",
      "summary": "Anomalous aircraft seen over Fayetteville N.C. citizen.",
      "city": "fayetteville",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "Anomalous aircraft seen over Fayetteville N.C. citizen. Hello Reader,  Hello, I am 29 years old and my name is not important.   I am a father.  I am ex-military.   I run a small business here in Fayetteville N.C.  I have never been a real UFO enthusiast or anything but have always been a very open minded thinker.  So the other day I got a phone call from my mom telling me to contact my sister ASAP.  My sister lives in Marshalltown Iowa 1,100 miles away.  She also has to pay for outgoing long distance calls so normally we talk when I call her.   As soon as I dialed and said hello she says, very enthusiastically, “brother you’re not going to believe what I saw today!”   What was it?  I asked.   She proceeded to tell me how she was driving downtown towards the post office when she noticed an extremely bright object in the sky that appeared to be a floating star.  She described the object as being at least two stories high and definitely within the city limits.   She told me that she had no idea what it was but that she stopped and got out of her vehicle to get a better look.  When she got out looking towards the sky, she said the object was gone.   I thought about this for a moment and asked her what she thought she saw.  She said she had no idea but that it didn’t make sense the object had vanished so quickly.  I tried to offer her a reasonable explanation by telling her that it’s possible for sunlight to reflect off an aircraft very brightly and seemingly disappear when the aircraft changes direction slightly in the sky.   She was not totally satisfied with this and responded by telling me that the aircraft would have been flying too low.  When the conversation was over she seemed calmed down some.  I should mention that to her credit my sister is a very intelligent and grounded person.  Not one to make up such stories.  I believed she saw something.  The next day I had pretty much forgotten all about the phone call with my sister.  My business associate and I had just finished services at one of our customer’s property.  This was on Vista dr.  We both got into the truck and as I was starting the ignition I looked up.  Immediately I was struck by what I saw. The aircraft was big.  I’m estimating it to be about the size of a Boeing 747 passenger jet.  It was shaped almost like a blimp, “and this was the first thought that came to my mind”, but longer giving it an even more aerodynamic look.  It was very luminescent.  I could not make out any distinguishable shapes like you would expect to see on an aircraft besides the color.  The color had the appearance of mercury and I could also see some red towards the front upper portion. No tail, no undercarriage, no wings.   My mind was racing like lightning.  After about 3 seconds I yelled to my partner, “LOOK!”  And I pointed skyward.  She looked up, but not quick enough.  The craft, which was traveling at about 60 mph, had entered into the tree line overhead.  She looked back at me and I was still looking upward.  I saw it for about 2 more seconds through the trees and then disappeared back over the tree line.  I was AMPED!  I hit the gas and we began speeding through the neighborhood.  I was definitely getting another look at this thing!  I turned a sharp right at the corner and tore down the road.  We went about 7 blocks.  All the while I was looking madly up at the sky trying to see around the trees and get a better look.  It took me about 30 seconds to get to a better area.  I pulled into a parking lot and got out of the truck.  From this position I had a good 360 degree view.  It was a mostly clear sky and I could see for miles in the direction that the aircraft should have been headed.  Even then I expected to see something that made sense.  It must have been some kind of blimp or something.  There was nothing.  I was completely astounded.  Why didn’t I see something in the sky?  What the hell did I see?  It shouldn’t have been possible at the speed it was traveling to elude my range of vision when I could now easily see for miles.  This all happened at about 1: pm Oct, 21, 2008. At this point my partner was looking at me like I had gone bat shit.  So I gave her the phone and made her call the airport.  At this time I spoke to Trisha in the radar tower.  I asked her if any aircraft were currently flying above the downtown area.  She asked me what I had seen and I said that I wasn’t sure maybe a blimp.  She told me to hold on and then came back on the phone.  She told me that I had probably seen one of the many military aircraft that fly over Fayetteville.  I told her, “No Trisha, I want to know if you have any communication right now with any aircraft over the downtown area and if so, what specifically?”  She said that a C-130 had been flying over the downtown area.  I told her that,” no it was not a C-130.”  I used to jump out of this type of aircraft when I served in the military.  It is very easy for me to identify.  I should also note that I have lived in Fayetteville for 7 years now.  Being local for so long, and near Pope air force base, I am very used to looking up in the sky and seeing military aircraft.  You see everything from warthogs and C-130s to Chinook helicopters, to name a few.  Also, I live less than I mile from the air force base and have seen many different types of military aircraft, in the sky, on routine training flights.  After I spoke with Trisha in the radar tower I was both very excited and very confused.  I thought for sure that they would have some sort of explanation that made sense.  No, they had nothing.  Later that afternoon I called the police station and spoke with a dispatcher.  She had no other reports of anomalous objects in the sky.  I’m not sure if she made a report of my story or not but I told her everything.  I also called the airport back and spoke to Trisha again.  No one else had called in at all.  She gave me a number to Pope AFB.  I called and left a message to call me back please.  No one has called.  That was 48 hrs ago.  I have no easy explanation for what I experienced.  The events surrounding this seem just extraordinary, for example; my sister calling the day before.  Interestingly enough the presidential nominee Barrack Obama was here last weekend.  McCain is coming this weekend.  Do these things relate?  I can only speculate about that as I try to make some sense of things.  Another wild coincidence is that Great Britain just released a 1,500-page batch of top secret documents that were UFO related. http://news.aol.com/article/britain-releases-more-ufo-sighting-files/217434?icid=200100397x1211165486x1200734593   Although I’m not sure exactly what I saw I can tell you this.  Visibly it seemed immediate that it was anomalous.  It should have been in the sky longer.  The radar tower should have known what it was.  Many other people should have seen this as it was almost directly above downtown Fayetteville.   My sister believes she also saw something anomalous in the sky 24 hours prior to my experience.  Somehow this is all absolutely PHENOMENAL.",
      "link": "http://www.nuforc.org/webreports/066/S66401.html",
      "state": "NC",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baba9",
      "summary": "FAST RED LIGHT WITH SLOWER BUT LARGER WHITE LIGHTS FALLING",
      "city": "fayetteville",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "FAST RED LIGHT WITH SLOWER BUT LARGER WHITE LIGHTS FALLING TRAVELING EAST, ON 401 TOWARDS FAYETTEVILLE I NOTICE IN THE VACINITY OF FAYETTEVILLE AIRPORT  WHAT LOOKED LIKE A WHITE LIGHT SHAPED LIKE A COMET.  THERE WAS NO MOVEMENT AT THE TIME BUT WHEN WE CAME OUT OF A CURVE AND GOT A BETTER VIEW, THERE WAS TWO LIGHTS UNDER THE ORIGINAL LIGHTS.  THESE LIGHTS I ADMIT LOOKED LIKE FLARES BUT I WONDERED WHY FLARES NEVER HAS BEEN ON THAT SIDE OF TOWN OVER THE AIRPORT, ONLY TOWARDS FT BRAGG NC.  THATS WHEN I NOTICED AN EXTREMELY FAST VERY SMALL RED LIGHT, TRAVELING SOUTH TO NORTH,  JUST UNDER THE MAIN GROUP OF LIGHTS, MY EYES BARELY COULD KEEP UP WITH IT.  IT WAS JUST AN INSTANCE AND THE RED LIGHT WAS GONE.  AS WE WERE TRAVELING, WE DIDN'T STOP SO SOON GOT OUT OF VIEW OF THESE LIGHTS.   TOTAL TIME WAS APPROXIMATELY 3 MINS.  I PERSONALLY THINK IT WAS A METEOR THAT BROKE UP AS IT FELL.  BUT MABE SOMEONE ELSE WILL REPORT SOME MORE INFO ON THIS.",
      "link": "http://www.nuforc.org/webreports/078/S78103.html",
      "state": "NC",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3badab",
      "summary": "Bright round objects spotted over Fayetteville during Ark/Ole miss game during a severe apporaching storm on 10/23/10",
      "city": "fayetteville",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Bright round objects spotted over Fayetteville during Ark/Ole miss game during a severe apporaching storm on 10/23/10 While watching the Arkansas  Ole Miss game in Fayetteville on Saturday My wife and I along with my daughter and her boyfriend watched an approaching storm in the sowthwestern sky and say shinny round objects floating out from what appeared to be far over the mountains/horrizon and float up towards the sky to the west/north west. They seemed to float and we strikingly shinny/bright against the black storm cloud of the approaching storm. There were three game delays and it was announched that the storms were severe containing hail and high winds. I thought the weather service may have been releasing weather ballons into the sky. The floated in succession at close intervals and each one took about 2-3 minutes to be sucked up into the storm. There were at least eight of these that we saw. The game still had 25,000 people at is so many more had to notice this event.",
      "link": "http://www.nuforc.org/webreports/078/S78618.html",
      "state": "AR",
      "duration": "12"
    },
    {
      "_id": "64d005f478aba2ec5a3bb547",
      "summary": "Orange bright light over fayetteville Nc",
      "city": "fayetteville",
      "shape": "oval",
      "date": "2011-01-31T00:00:00",
      "story": "Orange bright light over fayetteville Nc In fayetteville North Carolina around 8 to 8:30pm i saw a very bright orange looking light.  It was located about 5 to 10 miles out in the North West sky.  It was maybe a mile or two up from ground level. It never moved.  It was as still as looking at any other star.  It was at least three times the size of the brightest star in the western sky. At first I thought that it was a star dying or something.  I called the kids but when they came out the door it just was gone. I started to go back in but I did not. About five minutes later it reappeared in the same spot. I called my family again and they witness the event also.  It lasted about 30 seconds again and began to get brighter than extinguished. What was it?In fayetteville North Carolina around 8 to 8:30pm i saw a very bright orange looking light. It was located about 5 to 10 miles out in the North West sky. It was maybe a mile or two up from ground level. It never moved. It was as still as looking at any other star. It was at least three times the size of the brightest star in the western sky. At first I thought that it was a star dying or something. I called the kids but when they came out the door it just was gone. I started to go back in but I did not. About five minutes later it reappeared in the same spot. I called my family again and they witness the event also.  It lasted about 30 seconds again and began to get brighter than extinguished. What was it? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79770.html",
      "state": "NC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb654",
      "summary": "One white light moveing very fast and irraticly over hope mills/fayetteville for over 4 hours.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2011-02-08T00:00:00",
      "story": "One white light moveing very fast and irraticly over hope mills/fayetteville for over 4 hours at first we thought it was a falling star..it fell very fast, straight down..stopped for a few seconds then went left straight across.It then moved back up and to the right. it would disappear behind clouds for a little bit..then reappear. It moved very fast and was very irratetic.  We watched it for over 4 hours.  It moved around like a kite on a very windy day.",
      "link": "http://www.nuforc.org/webreports/079/S79979.html",
      "state": "NC",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bc237",
      "summary": "Reddish/orange object in sky in Fayetteville, NC",
      "city": "fayetteville",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "Reddish/orange object in sky in Fayetteville, NC Spotted object at about 21:45-22:00 in Fayetteville, NC while driving.  The object flickered between red and orange like it was burning or on fire.  It seemed to be \"flying\" away, not falling. We attempted to follow it, but it disappeared from view.  We later noticed a helicopter/airplane flying in the same direction.",
      "link": "http://www.nuforc.org/webreports/086/S86168.html",
      "state": "NC",
      "duration": "~10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc253",
      "summary": "Driving east on highway #54 between Peachtree, City Ga. toward Fayetteville Ga.  My wife and I both witness what we expected to be a sh",
      "city": "fayetteville",
      "shape": "flash",
      "date": "2011-12-12T00:00:00",
      "story": "Driving east on highway #54 between Peachtree, City Ga. toward Fayetteville Ga.  My wife and I both witness what we expected to be a shooting star to our left which would be north of Fayetteville toward the Atlanta Airport.  The travel distance of the object was much shorter arc than a shooting star and was much brighter than any I have ever witnessed.   The flash made was many times the size of any celestial object or airplane light, (flash made was approximately 1/5 the size of a half moon)  it appeared as a large flash that moved a short distance and disappeared.  It ddi not appear to be very high above the ground, slightly higher than a landing plane.  It happened at 20:18 according to my vehicle clock. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85404.html",
      "state": "GA",
      "duration": "2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc47a",
      "summary": "Star-like object(s) make unusual manuevers in the night sky.",
      "city": "fayetteville",
      "shape": "unknown",
      "date": "2011-08-07T00:00:00",
      "story": "Star-like object(s) make unusual manuevers in the night sky. 07/23/2011  The events I am about to describe are absolutely true and were witnessed multiple times by myself and 1-2 other individuals at the same time.  These events were witnessed during the years of 2001-2002 and again in 2008-2009.  Under no circumstances were the individuals involved under the influence of any substance.  The following sightings were observed by multiple individuals without the influence of suggestion, or \"wishful thinking.\"  Each of these incidents was exactly alike in nature. At the time of my first sighting I was in my mid to late teens.  It was sometime in the summer months at around 10:00 p.m. to 12:00 midnight, as me and a friend of mine were awaiting his car ride home.  We had been waiting outside in the drive way under what was a perfectly clear night sky, for about forty-five minutes to an hour when something caught my eye. I have always been a bit of a “star gazer”, that is, I enjoy the beauty and awe of a well star-lit night.  So naturally, my eyes are often glancing to the stars, but this particular night I noticed what appeared to be a star in motion.  The object, from my point of view, appeared no different than the stars in the night sky: it twinkled exactly like a star and was the same size of a star from a ground-level perspective. Using my best judgments, the object seemed to be at a very high altitude- almost right outside of the earth’s atmosphere.  It was moving on a steady path at what would have been a high rate of speed in regards to how high it seemed to be traveling- much like how a plane seems to be moving slow when viewed from ground, but its actual speed is about 400 mph. I watched this strange object make its way across the sky with such curiosity and confusion in my mind regarding its identity.   During this point in my observation, I didn’t direct my friend’s attention to it because it was happening relatively fast and I was trying to process what exactly was going on.  It traveled this path for about 20 seconds from the time I noticed it until it did something that made my heart sink into my stomach. The object suddenly came to a complete and abrupt stop in mid-air, made a wide-angle turn at what looked like 4x its original speed, shot across the sky at an even higher rate of speed (without the characteristic “tail” associated with shooting stars) into the direction from which it came, and literally vanished into the night sky. In response to this, I naturally started screaming in disbelief at what I had just seen.  My friend laughed and attempted to offer suggestions as to what it could have been (a plane, satellite, comet, etc.) but I knew better.  In an attempt to explain what I had seen to my friend, I pointed to the sky and used my finger to describe the path the object had taken.  Within minutes I noticed the same object a second time, taking a similar path as the first sighting.  This time both me and my friend were observing the object repeat this similar course of travel, redirection and departure.  Needless to say, we were both baffled and I had gained another reason to watch the skies. Several years later on a similar summer night, I was standing outside in my father’s backyard beside a small bonfire talking with my brother and father.  Looking toward the stars, I noticed the same object making its course across the sky.  This time I made no hesitation to direct my company’s attention to the object.  Once again, the strange oddity followed the exact same course flight, redirection and departure.  All of us who were present saw the same events at the same time. I have no knowledge of any natural phenomenon that could occur as I have described.  There is no technology that I am aware of that could perform the way this object did.  I have no desire to create such stories for attention or for personal thrills.  I am in no way assuming that this/these object(s) are of any particular origin, be it human or “extra-terrestrial”- I simply do not have enough evidence or knowledge of the subjects to support either theory.  The only facts that I can absolutely be certain of are: 1) the events occurred exactly as described above; and 2) the object does exist. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82675.html",
      "state": "GA",
      "duration": "5 Min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc6ac",
      "summary": "A shiny fast moving oblong disk was moving through the sky over the moon and then it moved to the west out of sight!",
      "city": "fayetteville",
      "shape": "disk",
      "date": "2011-08-21T00:00:00",
      "story": "A shiny fast moving oblong disk was moving through the sky over the moon and then it moved to the west out of sight! On Saturday evening at 7:30 pm, I was playing tennis and noticed an unusual shiny oblong disk flying above the moon and then it proceeded to the west and flew out of sight.  This also happened at the same exact time on Sunday evening, when I was playing tennis (7:30 pm). On Sunday evening alot of other people saw it and discounted it as an airplane. The lady that was beside me and myself were not convinced it was an airplane. We both knew we could hear the sound of an airplane.  This UFO did not make a sound!    A few minutes later an airplane was in the sky, we could hear it plain as day!",
      "link": "http://www.nuforc.org/webreports/082/S82996.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc69",
      "summary": "seven craft of three different, unique shapes, observed over north fayetteville neighborhood.",
      "city": "fayetteville",
      "shape": "teardrop",
      "date": "2011-06-20T00:00:00",
      "story": "seven craft of three different, unique shapes, observed over north fayetteville neighborhood. My husband called me outside at about midnight or very early morning of august fifth.  He pointed up above the trees across the road at a blue, chandeleir crystal shaped object.  It seemed to be spinning flashing bright, sparkly light all around it.   Then he pointed ubove the house and there, posted like centurions was four, rectangular with triangle tops, like a childs drawing of a house.  Each of these objects were all of different colors but yet you could see through them.  Then in the middle of the road was a bright gold light.  May have been mars?   Also to the south was another bright blue sparkly thing but it wasnt as big as the other blue object.   I woke my daughter and her husband to come see.  We noticed some neighbors in pajamas looking too. There was a police cruiser who drove by right under the biggest, blue object.  He drove very slowly and he had his headlights off.   After a couple of hours I went into bed, with them still out there and watched through the window as the porchlight pulsed, as if power surges and then dimmer.  I called my mom, I then called the police but rreported anonymously.  I dont think they took me seriously.   Before I went into bed we noticed a flat, black aircraft with a bright flashing red light on top racing around the sky very quickly under these objects as if to warn them that they had been noticed by our militery?   Also, planes began arriving from the east about every three minutes.   When we got up the next morning the sky was divided into perfect pie wedges made with com trails. as if to mark each objects location.  Some very odd things happened after we all got to bed. I will discuss that part, privately with an investigator if you like. ((NUFORC Note:  Date may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81850.html",
      "state": "AR",
      "duration": "three hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd2e",
      "summary": "fayetteville nc 6-26-2011, triangle ufo 10pm",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2011-06-27T00:00:00",
      "story": "fayetteville nc 6-26-2011, triangle ufo 10pm Driving with a friend north on interstate 95 near fayetteville nc around 10pm Sunday 6-26-2011.  We saw a triangular shaped ufo appear in the east moving very slow and silent.  It had one white light near each of the three points of the triangle, and red lights flashing in the middle of the triangle.   It moved very slowly above the interstate in a westward direction and then we lost sight of it behind the trees in the distance.   No noise, no exhaust, none of the telltale signs of conventional helicopters or airplanes.     This was very near to fort bragg military complex... maybe a government craft ? ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81942.html",
      "state": "NC",
      "duration": "2-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd4a",
      "summary": "Lights Over Fayetteville",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2011-06-20T00:00:00",
      "story": "Lights Over Fayetteville At Aprox. 22:18 central (03:18 zulu time), 3 friends, and myself witnessed 10 -15, orange - yellow flying lights.  The lights appeared to be flying from south to north in Fayetteville, Arkansas, along interstate 540, in triangular like formations.   3 or 4 lights seemed too turn west along Wedington road.  At least 2 other lights disappeared from sight completely in an unknown direction, the rest of the lights continued north over interstate 540. The lights appeared to be under 10,000 feet (3,030.3 meters) and moving quite fast but at varying speeds.  I witnessed what seemed to be 1 light dropping altitude, speeding  up and  passing another light in the same formation.  The light that was passed  then broke sharp to the west and a few other lights  behind it followed along the same route west over wedington road. I can say with 100% assuredness that in my 6 yrs Launching rockets as a MLRS crew member in the US army national guard, and my time in Iraq watching night time take offs and bombing raids by US jets, multiple helicopter formation  at night, and UAV flights, that it was nothing like anything I have ever seen while being in  the military.   I am also an avid stargazer and satellite watcher.  Saturn was almost right over head (maybe 80 degrees above the horizon) and most of the lights seemd to be at least 3 to 4 times as bright as Saturn. The 2 pictures I took on  my phone did not capture the full formations, or other relative objects.  The pictures are a bad quality but I would provide the pictures to any one who wants to study further.",
      "link": "http://www.nuforc.org/webreports/081/S81840.html",
      "state": "AR",
      "duration": "1-2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bceaa",
      "summary": "We were sitting out on my back deck looking towards the southeast when all of a sudden we spotted two objects in the sky comming from t",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2011-05-29T00:00:00",
      "story": "We were sitting out on my back deck looking towards the southeast when all of a sudden we spotted two objects in the sky comming from the west.   The objects were in the shape of triangles traveling at a high rate of speed.   Both of the objects made an abrupt turn toward the southeast with the craft on the left not turning as sharply as the one on the right.   They quicky returned back in previous formation and speed off towards the southeast.  This area is near a military instslation where many aircraft fly over all day.   The objects made no engine noise at all witch is not consistant to man made aircraft and the sudden change of direction appeared to be well over a 9g turn. ((NUFORC Note:  We spoke via telephone with this witness, and he sounded to us to be quite sober-minded and credible.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81512.html",
      "state": "NC",
      "duration": "00:10"
    },
    {
      "_id": "64d005f478aba2ec5a3bd25e",
      "summary": "I saw a red orb/sphere traveling from north to south. The object was traveling towards me. The object was about 1-2 miles high, and tur",
      "city": "fayetteville",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "I saw a red orb/sphere traveling from north to south.  The object was traveling towards me. The object was about 1-2 miles high, and turned gradually to the east.  The object seemed to accent gradually and fade into the distance.  At first it looked like a helicopter with a red light.  As it got closer there was no sound and it was mostly red with a little bit of orange at the 6 o'clock position.  It almost looked like a spot light.  The object was by itself.",
      "link": "http://www.nuforc.org/webreports/090/S90429.html",
      "state": "NC",
      "duration": "1:30"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4a1",
      "summary": "Stationary craft with flashing multicolored lights",
      "city": "fayetteville",
      "shape": "unknown",
      "date": "2012-05-13T00:00:00",
      "story": "stationary craft with flashing multicolored lights A hovering craft with a belt of multicolored lights streaming in sequence from left to right.  Could not see the body of the craft because it was at night.  It stayed in one spot.  I saw a plane fly just below it so I could tell the obvious difference.  The craft slowly faded from view but never appeared the move.  It just faded to black. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88496.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd46b",
      "summary": "Orange sphere following family of four",
      "city": "fayetteville",
      "shape": "diamond",
      "date": "2012-05-13T00:00:00",
      "story": "orange sphere following family of four around nine pm my oldest son was playing at a friends house in the front yard and my son was 11yrs old at the time and he noticed an object hovering about 40 ft away at the same height as the telephone pole is at, first he said it looked like a parachute with a orange ball attached to it  but as it came closer he said it was a solid looking object and at that moment my wife pulled up to pick him up and she also noticed it and made him get in the car with her and my other son and they left  heading home and the object follwed the car at a speed of around 35mph hovering out from the drivers side at the height of the telephone poles, my wife said the car kept running but the lights went out and she noticed that the orange ball was pulsating rapidly so she increased her speed but it kept up with her until they pulled into the driveway where it just hovered above the car so they got out of the car and my oldest son ran in and got me and as i came out it shot straight up through the clouds leaving a ring in the clouds, now i served in the army for six years and have seen all kinds of aircraft and i have used flares this was NOT man made i believe this was a probe of some kind because my son and his friend said it just sat there watching them for about 10min, i have perfect eye sight and i consider myself and my family rational and honest people, this was not of this world...",
      "link": "http://www.nuforc.org/webreports/088/S88153.html",
      "state": "WV",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3be624",
      "summary": "Round, bright, mostly stationary, with neon colors.  ((NUFORC Note:  We suspect a sighting of Sirius, Jupiter, or Venus.  PD))",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2012-03-13T00:00:00",
      "story": "round, bright, mostly stationary, with neon colors one circle in sky--seemed to be stationary until at last it got lower in the sky and faded.  Had outline of blue/green.  Had green lights and at least one red light. Lights were not blinking.  Lights were at N,S, E, W on outside of circle.  Inside was bright yellow/white and seemed to be moving around. one witness said it split into two several times and went back together.  We saw with naked eye and through small telescope. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  We suspect a sighting of Sirius, Jupiter, or Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87252.html",
      "state": "NC",
      "duration": "one hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bec05",
      "summary": "Black walnut shaped craft observed in broad daylight floating across sky with no sound",
      "city": "fayetteville",
      "shape": "egg",
      "date": "2013-08-30T00:00:00",
      "story": "Black walnut shaped craft observed in broad daylight floating across sky with no sound It was after work on a week day, I stepped out into the backyard to enjoy the nice weather while I was talking on the phone with my grandmother-in-law. I had sat down in my lawn chair facing North and while talking on phone I noticed out of the corner of my left eye, which would have been to the West, what appeared at first to be a bird that was gliding. The wind was blowing out of the North and it was like when a bird faces into the wind and is able to just hold its wings out and kind of stay in one spot while riding the current of the wind. After about 30 seconds of noticing the object I realized that this thing was moving slowly but with no movement (wings flapping).  I looked over at object and to my big surprise it was not a bird but only what I could describe as a solid black walnut shape. It seemed to be so close, but is hard to say how far away from me it was.   I dropped the phone in amazement, not caring about the phone call no longer, knowing I wo! uld never witness this again. In fact, it was the weirdest feeling because my brain would not register what I was looking at. I watched this object fly into the Northeast direction, with absolutely no sound associated with the craft at all, until it dissappeared into the clouds. It stayed at the same speed the entire time of the observation, and since it moved across my vision from southwest to northeast, there were plenty of angles to tell that in did not have any wings.  I still to this day can not believe and will never forget this expereince, since it happened in broad daylight! I have seen plenty of odd acting lights in the sky over the years, knowing they were not of anything mankind has produced...at least publicly. From what I think the distance was from my position on the ground, the craft must have been around 25 to 50 feet in diameter. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101456.html",
      "state": "AR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bedc7",
      "summary": "Unidentified 'barbell-shaped vessel' cruises over dark country road.",
      "city": "fayetteville",
      "shape": "other",
      "date": "2013-08-30T00:00:00",
      "story": "Unidentified 'barbell-shaped vessel' cruises over dark country road. On the evening of july 29th, 2013 at approximately 9:45p.m. while driving home on a lonely dark country road I saw what appeared to be a set of stadium lights rising above the trees in a wooded area about 1/4th of a mile off the road. I was briefly perplexed thinking \"I didn't know there was a ball field out here.\"  Being that I was on a hill I had a fairly good view. As I proceeded down the hill I decided to pull over to get a better look.  I turned my truck off (it is a 5-speed and difficult to simply idle)and was struck by the deafening silence that surrounded me.  What had happened to the nightly frog and cricket orchestra that graced our country summers?  The two lights suddenly appeared to be so much closer (even though up until this point I had not seen them move).  They slowly advanced towards the road and within what seemed like a second were directly in front of me just a little above the tree line.  I said out loud \"oh my god, oh my god&q! uot;.  It was now evident that the two lights were connected by a long, dark 'body' which donned a row of small airplane-like lights of varying colors (red, blue, green).  The shape resembled a barbell with the lights being the weights.  It was about the size of a commercial airplane.  To be so humongous it was amazing that I heard NOTHING!  And the lights were so bright however my vision was unaffected. The vessel disappeared from my visual field once its entirety had crossed the road.  I pulled away and looking in my rear view mirror saw no further traces of the vessel.",
      "link": "http://www.nuforc.org/webreports/100/S100682.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bee98",
      "summary": "Band of lights traveled north to south, silent,. Clear night.",
      "city": "fayetteville",
      "shape": "chevron",
      "date": "2013-05-15T00:00:00",
      "story": "Band of lights traveled north to south, silent,.  Clear night.",
      "link": "http://www.nuforc.org/webreports/096/S96609.html",
      "state": "WV",
      "duration": "A few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf00c",
      "summary": "9 to 10 black triangular objects moving at low speed and altitude & a low muffled sound.",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2013-08-30T00:00:00",
      "story": "9 to 10 black triangular objects moving at low speed and altitude & a low muffled sound. My friend & I were watching a movie, when I seen a light moving through the neighborhood.  We ran outside to see what was going on & there were 9 to 10 black triangular shaped objects moving at mid speed,  They had one white lights on each corner of the wing and one in the front and a large red light in the middle.  The objects were making a low muffled sound.  The  lasted from one to two minutes,  The objects were in a straight formation almost perfect allignment.  The neibherhood dogs were barking & yelping as if alarmed.",
      "link": "http://www.nuforc.org/webreports/100/S100857.html",
      "state": "NC",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf00b",
      "summary": "Objects have never seen in our area by me. Almost hover like and moving at a slow speed. Objects were projecting beams of light.",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2013-08-30T00:00:00",
      "story": "Objects have never seen in our area by me. Almost hover like and moving at a slow speed. Objects were projecting beams of light. A friend and I were watching a movie when he noticed a light or beam flashing over our neighborhood, curious we went outside when the light turned off, but somewhere between 8-10 triangle objects with 3 white lights, one on each corner of the aircraft and a larger red flashing light in the middle.  The event lasted anywhere from 1-2 minutes before leaving out of our sight. The aircraft made a low rumbling sound and all of them were flying at a fairly low speed and altitude, the nearest military airport is 56 miles away, so they weren't ready to land and I've never seen any other planes like this in my life, it kind of reminds me of a stealth bomber which I know we're not in abundance of.  During the event neighborhood dogs acted weirdly, barking, howling and yelping, which was really weird because we live in a relativitely quiet neighborhood.  My 2 cats didn't seemed bothered by the UFO's. If I need to present further evidence I have 1 video and 2 pictures.",
      "link": "http://www.nuforc.org/webreports/100/S100858.html",
      "state": "NC",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf100",
      "summary": "Meteors or any other space debri dont turn with these angles and become stationary like this..",
      "city": "fayetteville",
      "shape": "changing",
      "date": "2013-09-30T00:00:00",
      "story": "Meteors or any other space debri dont turn with these angles and become stationary like this.. The two of us were driving into a well lit neighborhood.  I noticed in the sky what at first appeared to be space dabree of some sort.   Not unlike a meteor.it appeared to slow down , turn about a 45 degree angle, then Stop.  The tail was gone at this point and it looked like a solid white light.   The short amount I've got recorded on my phone shows it changing multiple colors before it disappeared..",
      "link": "http://www.nuforc.org/webreports/102/S102260.html",
      "state": "NC",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2b1",
      "summary": "Unearthly craft over Fayetteville/ Lumberton NC area.",
      "city": "fayetteville",
      "shape": "cross",
      "date": "2013-02-04T00:00:00",
      "story": "Unearthly craft over Fayetteville/ Lumberton NC area. To start off, both the passenger and I who witnessed the craft are members of the USAF and know characteristics of aircraft.  I work around them everyday. While traveling down I-95 about 15 miles outside of Lumberton NC,  My passenger and I witnessed a long formation of white lights above horizon. Jokingly, we talked about an aircraft landing on the highway.   As we drew closer, the line of lights made me certain that these were no landing lights of any aircraft I have encountered.  As we traveled ever closer the lights formed into somewhat of a cross/disc shape with a bright light in each corner.  A single unflashing red light accompanied the center light.  The craft was angelic in its movements and seemed to hover at a speed at which no aircraft could maintain flight.  I would estimate its altitude at 200 feet.  I could make out the feint curvature of a hull between the lights. No sound was heard when I rolled down my windows.  At this point my passenger and I couldn't comprehend what we had just seen.  The craft passed over to the trees on the right of the interstate. I knew i needed to photograph the craft so I immediately took the exit a quarter mile from our sighting, but the craft was nowhere to be seen.  I know there were other witnesses.   I consider myself an extremely logical person but have no explanation for what was seen.  It maneuvered in a manner no earthly vessel can. The fact I witnessed this on the supposed end of the world might bring discredit to my story, but I know what I saw.  After finding this site, I noted a similar account of a craft in this area very recently.",
      "link": "http://www.nuforc.org/webreports/095/S95410.html",
      "state": "NC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf328",
      "summary": "Triangle with orange lights traveled from 180° S to 240° SW over 45 seconds, then dropped vertically behind tree line.",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2013-09-30T00:00:00",
      "story": "Triangle with orange lights traveled from 180° S to 240° SW over 45 seconds, then dropped vertically behind tree line. Just after midnight, my girlfriend and I went out to smoke a cigarette.  We were on our balcony facing SW.  She noticed it first and we watched it for 45 seconds as it traveled from the South to SW.  It traveled from 180° to 240° in that time then dropped vertical behind the tree line.  Approximately 20 miles away.  Lighting was three to five orange lights, at first we saw three lights in a row but as it moved to the SW just before it dropped vertically the lights made a distinct V shape.   My girlfriend is a stay at home mom, and I'm an honorably discharged United States Marine Corps veteran.  We were both completely sober and in our right minds (which are currently going crazy now).",
      "link": "http://www.nuforc.org/webreports/102/S102122.html",
      "state": "AR",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8c6",
      "summary": "Strange luminous, transparent, oval/saucer shaped object with pink, orange, and yellow colors at 14:30 moving at incredible speed.",
      "city": "fayetteville",
      "shape": "unknown",
      "date": "2013-07-03T00:00:00",
      "story": "Strange luminous, transparent, oval/saucer shaped object with pink, orange, and yellow colors at 14:30 moving at incredible speed. At approximately 14:30 I looked outside to see a break in the storm clouds. Not sure of the elevation but I was looking in the W/SW direction. What I saw appeared to be a faintly luminous, but not artificially lit object, more oval/saucer in shape.  It was faintly yellow, pink and orange in color - almost transparent but I couldn't see the clouds through it. It seemed suspended for about three seconds in the sky and then it shot off horizontally, accelerated at a speed - defying any aircraft I've ever seen.  It left a blur of a trail, like the light of the craft had blurred in its absence as it went into the tops of the storm clouds across from it.  The cloud coverage was too dense were it went so I wasn't able to track it.",
      "link": "http://www.nuforc.org/webreports/098/S98748.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9ec",
      "summary": "Upon letting my dogs out, I observed a bright flashingight i'n the NE sky. This light moved rapidly and randomly. It appeared to have r",
      "city": "fayetteville",
      "shape": "changing",
      "date": "2013-09-30T00:00:00",
      "story": "Upon letting my dogs out, I observed a bright flashingight i'n the NE sky.  This light moved rapidly and randomly.  It appeared to have red and blue lights flashing with them.  The sky was clear and the view was clear and unobstucted I called my son's girlfriend to observe and she too witnessed these objects.  At times they would appear to disappear and reappear again.  They moved rapidly, but staying within one area of the sky.  At one point, they seemed to omit smaller lights in rapid formation coming from one of them.  I was only glad that I had another eye witness to this event as I would have thought my eyes were playing tricks on me.  I do not know what they were, but I know what we saw and it was not what one sees normally i'n the sky.  I hope this helps in some way. Thank you. ((NUFORC Note:  Sighting of Capella??  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102667.html",
      "state": "WV",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfcc7",
      "summary": "Brilliant slow moving light in fayetteville ny.",
      "city": "fayetteville",
      "shape": "chevron",
      "date": "2013-10-14T00:00:00",
      "story": "Brilliant slow moving light in fayetteville ny It started as a brilliant white, slow moving light.  No sound.  As it travelled in a northwestern direction, this whit light changed to pink.  It appeared to have a point on it.  It seemed to waver as it moved, as if it hung from a string.  No blinking lights.... As it got further away, the light dimmed, then disappeared.  Though, not behind clouds. It was not not far enough away to just disappear.  Nor was it very high in the air. This is not the first time we'd seen this.  Over the summer, we saw the same thing, traveling in the same direction, doing the exact same thing.  Though we attempted to follow it by car.  Losing its sight near Green Lakes State Park.",
      "link": "http://www.nuforc.org/webreports/103/S103163.html",
      "state": "NY",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c01ef",
      "summary": "Too erratic to be a normal action.",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "Too erractic to be a normal action. At approximately 8:45 pm an early star looking shape object appeared in the southern sky. The object seem to move in a south west diagonal direction.  The object moved faster than a celestial object ( star ) but slower than a aircraft or weather balloon.  The rising and stationary position seemed like it could be a weather balloon until it retracted to its mid way point.  The object faded as if someone was covering the object with a blanket fading in and out very fast.  At 9:05pm the object disappeared.   At approximately 9:45pm the same general direction we saw a sharp and bright light turn on with a 15 second delay of a second time. This may simply be a weather balloon phenomena but in case its not just wanted to mention it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98212.html",
      "state": "GA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c01f0",
      "summary": "Too erractic to be a normal action.",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "Too erractic to be a normal action. At approximately 8:45 pm an early star looking shape object appeared in the southern sky. The object seem to move in a south west diagonal direction.  The object moved faster than a celestial object ( star ) but slower than a aircraft or weather balloon.  The rising and stationary position seemed like it could be a weather balloon until it retracted to its mid way point.  The object faded as if someone was covering the object with a blanket fading in and out very fast.  At 9:05pm the object disappeared.  At approximately 9:45pm the same general direction we saw a sharp and bright light turn on with a 15 second delay of a second time. This may simply be a weather balloon phenomena but in case its not just wanted to mention it.",
      "link": "http://www.nuforc.org/webreports/098/S98260.html",
      "state": "GA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c045a",
      "summary": "It was v shaped/white blue lights going accross i was sure that it wasnt a stealth bomber it slowed down then sped up i took my hunt.",
      "city": "fayetteville",
      "shape": "other",
      "date": "2013-02-04T00:00:00",
      "story": "it was v shaped /  white blue lights going accross i was sure that it wasnt a stealth bomber it slowed down then sped up i took my hunting binoculars and there were no wind sheilds didnt make a sound it flew away pretty fast",
      "link": "http://www.nuforc.org/webreports/096/S96008.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c06a4",
      "summary": "Bright lights appeared then object came towards us.",
      "city": "fayetteville",
      "shape": "disk",
      "date": "2012-12-20T00:00:00",
      "story": "Bright lights appeared then object came towards us. It was a bright light that we thought was a flare but it was in the air too long.  Then it looked like it was disappearing until we saw shooting stars around it and then that is when the object appears.  It was disk shaped and it had white lights around it and a red line of lights on the side.   It was moving sideways towards us really slow.  We thought it was a plane since we stay by Fort Bragg but it was moving really slowly so we started to drive down the road to see what it was and it was close to us and started moving really fast.   It went so fast that it disappeared so we stopped where we were and turned off the lights and then it reappeared.   When we tried to follow it again it disappeared and we did not see it again.",
      "link": "http://www.nuforc.org/webreports/095/S95242.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c07a9",
      "summary": "Right around 215 in the morning a green orb came in my bedroom and hovered  for about 10mins to 15min. Ive been haunted by this for all",
      "city": "fayetteville",
      "shape": "circle",
      "date": "",
      "story": "Right around 215 in the morning a green orb came in my bedroom and hovered for about 10 mins to 15 min.  I've been haunted by this for all this time and have never told anyone about this event.   I would like to know if there was anything sighted around this time so I can move on with my life.   At the time ever we did not have air conditioning so we had the windows open and screens on the windows, the weird thing was there was no hole in the screen the next morning.   Thank you ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107744.html",
      "state": "NC",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c07e4",
      "summary": "Two waves of orange/yellow orbs with 'afterburner'  like emissions visible from the rear upon passing overhead.",
      "city": "fayetteville",
      "shape": "formation",
      "date": "2014-01-10T00:00:00",
      "story": "Two waves of orange/yellow orbs with 'afterburner' like emissions visible from the rear upon passing overhead. I was taking some shopping bags out of my car trunk at the apartment complex where I live (near the University of Arkansas campus) when I noticed moving lights at the edge of my vision.  I was closing the trunk lid when I sighted the group of 3 orange/yellow lights/orbs moving overhead from my right to my left.  The orbs displayed a bright nucleus of light surrounded by a softer glowing aura of a paler shade.  The orbs were arrayed in a loose single file pattern moving overhead from the south toward the north at an altitude one generally see's a single engine prop plane fly at.  If one held a pencil eraser at arm's length and noted it's perceived diameter the orbs would have been of a like diameter.  The light emitted by each orb was consistent and didn't flicker and was surrounded by a translucent aura as mentioned previously.  There was no noticeable sound coming from the orbs and the night sky was mostly clear with only a few diffuse clouds overhead.  The orbs were moving along at a brisk and steady pace.  When the orbs finally passed by me I could see that each had what appeared to be a pair of “afterburner” like lights/emissions trailing behind them as they moved toward the northern horizon.  The 3 orbs finally disappeared from my view.  Then I again looked  toward the southern sky and was surprised to see a group of 5 more orange/yellow orbs coming towards my position headed along a similar flight path.  4 of the orbs were grouped in a broad non-linear cluster but the 5th orb was much higher in altitude periodically obscured by some wispy clouds underneath it.  As the group of 5 orbs passed by me they too displayed what appeared to be rear mounted jet-like afterburners in their wake.   All 5 orbs disappeared shortly into the northern sky.  This group of orbs made no sounds as they passed into the distance.    As a side note I was fortunate to attend a lecture by Dr. J. Allen Hynek (Project Bluebook) in the early 70's and e! ven spoke to him briefly.  I found his presentation both fasci! nating a nd thought provoking.  I'm cautiously skeptical regarding unidentified lights and this is my first time seeing an odd aerial display of this nature.   I've witnessed a couple of Chinese lantern launches in person and these lighted orbs were unlike the lanterns I saw on those occasions.   These orbs were quite a sight to behold.",
      "link": "http://www.nuforc.org/webreports/106/S106136.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0adf",
      "summary": "Five bright white lights moving E to W at constant speed and altitude with no similarities to aircraft.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2013-12-02T00:00:00",
      "story": "Five bright white lights moving E to W at constant speed and altitude with no similarities to aircraft. On 14 Sep, 2013, at 2245, I observed a total of five bright lights moving across the sky. Initially there was one light observed moving E to W approximately 70 degrees above the northern horizon.  The brightness of the light was between my observations of the ISS and Venus.  There was no sound or any additional lights one would expect from a passing aircraft. As I was taking video of this object with my IPhone, a friend who was also observing this lighted object said toward the eastern horizon there were four more moving in the same direction and the same speed.  They also came across the sky at the same elevation as the first and the final two were closer together, only 3-5 degrees apart.  I also recorded these objects on my IPhone. The brightness of the objects maintained their intensity as they passed by but slowly became dimmer as they continued to the West until they could no longer be viewed.  It was almost as if they were satellites reflecting the light of the sun, but that would have required a significant altitude based on the sun setting nearly 2 1/2 hours before the sighting. I flew in the Air Force for 21 years and with a commercial carrier for 15 years and can say I've never seen anything similar to this observation of these objects.  I consulted with a member of the FAA TRACON in the area and after pulling the radar history for the period of observation, he could find no activity to resemble the IPhone video he viewed.. I am at a loss as to what I saw and wanted to pass this information along to see if anyone else observed something similar on the noted day and time..",
      "link": "http://www.nuforc.org/webreports/104/S104913.html",
      "state": "GA",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ad2",
      "summary": "Streak of Green Light.",
      "city": "fayetteville",
      "shape": "flash",
      "date": "2014-02-27T00:00:00",
      "story": "Streak of Green Light. Glanced through my window and saw a stream of green light bolt through the sky and disappear as if in the speed of light. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107367.html",
      "state": "AR",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0be4",
      "summary": "Blue flash over mount sequoyah with hum.",
      "city": "fayetteville",
      "shape": "flash",
      "date": "2013-11-11T00:00:00",
      "story": "Blue flash over mount sequoyah with hum My sister brought the occurance to the attention of my parents.  Over Mount Sequoyah, there was a blue flash accompanied by an audible humming sound.  It lit the sky up like lightning, but my camera was unable to capture the flash, only the humming sound.  The flash eventually rescinded after at least 20 minutes.  There was nothing in the local news about this incident. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103706.html",
      "state": "AR",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d39",
      "summary": "Flying.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "Flying over Post Office Cliff dale Rd. ((NUFORC Note:  Witness provides no other information.  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103713.html",
      "state": "NC",
      "duration": "PM"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d4a",
      "summary": "Steady Orb with tail.",
      "city": "fayetteville",
      "shape": "sphere",
      "date": "2013-12-02T00:00:00",
      "story": "Steady Orb with tail As I was driving on the south west side of Fayetteville to the east I had spotted two aircraft.  The first aircraft or orb maintained a steady altitude, then began to spiral downward.  The color of the orb was bluish white.  The orb had a tail when it spiraled, however, when it maintained a steady altitude the light emitting from the orb possessed a sphere shape.   The second aircraft seemed to be flying near the orb almost as if the aircraft was observing the orb like object.   The object did not seem to be a flare due to the movement and acceleration.",
      "link": "http://www.nuforc.org/webreports/104/S104691.html",
      "state": "",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c100d",
      "summary": "Chevron shape with an extra bend on each end, dark and completely silent,dim orange illuminating light",
      "city": "fayetteville",
      "shape": "chevron",
      "date": "2013-12-02T00:00:00",
      "story": "Chevron shape with an extra bend on each end, dark and completely silent,dim orange illuminating light It was about 9:00 p.m. on a partly cloudy night and as cold as it was that night many people were were out enjoying Christmas lights.  A friend and I had walked up a hill admiring the stars and at the top we paused.   We both noticed a gliding curve with a chevron shape at the center.  The flying object was small but wide and looked as if it was a mere line. (at first I suspected it was a flock of birds in V formation).   As I watched it float above it made absolutely no noise and appeared to be very low in the sky.   For 10 seconds or so my friend and I watched and discussed the possibilities of either birds flying south or a plane of some sort.  It couldn't have been birds because they weren't in a V formation and never once broke synchronization.   I also don't believe it was a plane because a anything flying that low and that slow would have to produce some sound.",
      "link": "http://www.nuforc.org/webreports/104/S104743.html",
      "state": "AR",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1183",
      "summary": "one fireball splits into fours falling towards earth disappearing before main fireball disappeared.",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2013-12-02T00:00:00",
      "story": "one fireball splits into fours falling towards earth disappearing before main fireball disappeared Me and my friend are riding and I happen to look in the sky first I thought it was a shooting star but it didn't move until it split up so then I thought it was fireworks but these fireworks weren't going up ..  I seen one fireball (look like shooting star ) that split into four that were falling, they disappeared but the first ball was still there before it disappeared but not before my friend seen it too (he only seen the last ball cause he was driving) also it was a craft right beside it with a light I figured a helicopter was looking. g on cause it was just floating in same spot ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104810.html",
      "state": "NC",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c122b",
      "summary": "Vertical object with red strobes moved in the northern sky from west to east.",
      "city": "fayetteville",
      "shape": "unknown",
      "date": "2013-12-23T00:00:00",
      "story": "Vertical object with red strobes moved in the northern sky from west to east. We were outside trying to observe the ISS in the NW sky - did not see it but suddenly in the N sky about 40 degrees above the horizon we saw an object that was apparently vertical, red blinking strobes (back and forth, top then bottom, rapid succession, 6 times per second roughly?) - moved from west to east.  It appeared very large, but must have been enormous as it disappeared over the horizon in the NE sky.  The lower light appeared at about 30 degrees above, the uppermost light was at more than 45 degrees above horizon.",
      "link": "http://www.nuforc.org/webreports/105/S105382.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c13d2",
      "summary": "I was watching a movie on my smartphone, suddenly the movie stopped playing to buffer. As I was waiting for it to continue I noticed 3",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2013-12-12T00:00:00",
      "story": "I was watching a movie on my smartphone, suddenly the movie stopped playing to buffer. As I was waiting for it to continue I noticed 3 orbs of light outside my window about 3-4 feet off the ground and 30 feet away.  The light orbs were moving slowly back and forth, up and down. I got up and went to the window to investigate.  I can clearly see them now, no backgrounds light, no people in the area.  As I was watching the they formed into a line and slowly moved away to the left and disappeared behind 2 vehicles.  I was completely stunned and blown away,  I wasn't really scared but more scared because I couldn't explain the lights.  Several minutes later i seen 2 cats and a dog walking the same area as the lights.",
      "link": "http://www.nuforc.org/webreports/105/S105153.html",
      "state": "NC",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c19d3",
      "summary": "Same",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2014-07-04T00:00:00",
      "story": "Same Round ball color of sun but filtered with harness over top of it with craft below and bright blue light coming out",
      "link": "http://www.nuforc.org/webreports/110/S110778.html",
      "state": "AR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a6a",
      "summary": "We were sitting on rt 19sb waiting for fireworks to begin.  I first noticed the red light around 9:15 mixed in the tree line.  Exactly",
      "city": "fayetteville",
      "shape": "light",
      "date": "2014-07-05T00:00:00",
      "story": "We were sitting on rt 19sb waiting for fireworks to begin.  I first noticed the red light around 9:15 mixed in the tree line.  Exactly south (compass) from our location sitting on the guardrail and it was glowing red and remaining in the same spot or a few minutes the it would shift.  It juat vanished.   Then 2 more appeared about 2 minutes later, before the fireworks even began.  They hovered for quite awhile then they darted about 30 feet and stopped again.  They remained after the fireworks began but completely vanishe within 5 minutes of beginning.  They glowed green and changed to red just before they vanished.",
      "link": "http://www.nuforc.org/webreports/110/S110919.html",
      "state": "WV",
      "duration": "45"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c5c",
      "summary": "Circle disk shape with pink, yellow, red, and blue lights on side. *FREAKY, ((deleted)) MAN*",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2014-07-20T00:00:00",
      "story": "Circle disk shape with pink, yellow, red, and blue lights on side. *FREAKY, ((deleted)) MAN* I was in my room when my nephew screams, \"OH ((two words deleted)) (term of endearment used by African Americans) do you believe in aliens?  Of course I said \"hell no, why?\"  ((one word deleted)), YOU ABOUT TO BELIEVE TODAY!  I believe!   He says uncle I am not going to lie to you.  I went to the back yard to get on the phone.   I looked up and I saw a circle disk in the sky hovering!  It was flashing red, blue, yellow, and pink lights on the sides.  Then it took off in the night.   \"Did it make a sound as it took off?\" I asked. \"HELL NO!  IT WAS JUST GONE!\"   He says, ((one word deleted))  I tell him.  I went to the back yard with him.  He was very jittery and didn't want to go in the fenced in backyard along side me.  I ask him \"where did you see this ((word deleted)) again?\"  He says \"it was over by the shed, right above the tree.\"  I ask him to walk along side the shed with me and he agreed.  As we walked we heard bumping.  And we ran OUR HAPPY ((one word deleted)) IN THE HOUSE!  My nephew is the last person to play alien games!  You see cause my nephew and I do not get along.  And for him to come to me as scared as he was, I believe him.",
      "link": "http://www.nuforc.org/webreports/111/S111668.html",
      "state": "NC",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c96",
      "summary": "Blue zipping light in night sky.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2014-06-13T00:00:00",
      "story": "Blue zipping light in night sky. At 11:42 pm, two of my buddies and I were about to walk in to my house, when i seen a shooting star, that stopped in place.  It was the size of a star, blue in color.  And zipped around the sky for almost 2 minutes.   Where I live is wide open sky, and I've seen many jets, plans, helicopters.  And northing move as fast as this.  And it would stop on a dime and the light would get dim and bright again.  Then back to zipping around.  My niece stepped outside and saw it and she called my dad who also saw it.   I really don't know what it was.  And would love to find out what it was.",
      "link": "http://www.nuforc.org/webreports/110/S110103.html",
      "state": "NC",
      "duration": "95 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2223",
      "summary": "Baseball on fire.",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2014-04-18T00:00:00",
      "story": "Base ball on fire. Was sitting on porch talking all of the sudden we started seeing the things floating looked like baseballs on fire but they were hovering over tree tops at a steady pace not sure what they were but there was 8 of them and they flew west.  Just weird",
      "link": "http://www.nuforc.org/webreports/108/S108611.html",
      "state": "WV",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c252f",
      "summary": "Bright red light sitting in the sky",
      "city": "fayetteville",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "Bright red light sitting in the sky At approximately 20:10 my husband, son, and friend were sitting on the porch enjoy a cool evening when they saw, hovering above the trees, a bright red light.  They said it suddenly appeared and was sitting in the same spot for several minutes.  By the time they called me out to make sure they were not seeing things, the light just disappeared. They said it did not drop, did not move, did not fly away… it just disappeared. I told them to call me out there if it came back. Not even a minute later they called me back out on the porch and showed me the light. It was bright red and just sitting in the sky above the trees. It was there for about a minute and then disappeared again. I sat with them for a few minutes to see a bright yellowish light appear, then the bright red light appear to the right of the yellowish light. The lights were sitting in the same spot, they did not move up, seem to come from below, drop, or move; they just seemed to sit in one spot then! disappear. I took video of the last occurrence and noticed just after the yellowish light disappeared, there was a green flash of light visible (only in the video; not to the naked eye) over the red light before it disappeared. I thought all of this was strange enough to share.",
      "link": "http://www.nuforc.org/webreports/114/S114583.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29df",
      "summary": "Green streak flies past road 2 or 3 times.",
      "city": "fayetteville",
      "shape": "flash",
      "date": "2014-11-26T00:00:00",
      "story": "Green streak flies past road 2 or 3 times. Driving home pas Whitewater High School and a greenish streak flew across road extremely fast 2 or 3 times.",
      "link": "http://www.nuforc.org/webreports/115/S115572.html",
      "state": "GA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c63",
      "summary": "Six light colored objects in the sky over fayetteville nc during day light hours.",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2014-09-10T00:00:00",
      "story": "Six light colored objects in the sky over fayetteville nc during day light hours. Around 12:15 noon as i was talking pictures of clouds over the capefear mall i what appears to be 6 (six) objects in my photo. All heading downward leaving what appeared to be a ligh cloudy trail behind. It was over and out of sight before i could really focus on them. Notice in the photo as it (the photos) are blown up in the left upper corner near the darkest clouds two leading objects, followed by two others,  then to the right of them two others. There was no sound and i couldn't tell how close or far away they were. I'm emailing the photos so maybe you can tell me what they are. THANKS.",
      "link": "http://www.nuforc.org/webreports/113/S113287.html",
      "state": "NC",
      "duration": "few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f18",
      "summary": "Glowing moving  lights in sky.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2014-08-08T00:00:00",
      "story": "Glowing moving  lights in sky. While driving home after New Year's Eve celebration, we noticed a series of slow moving low altitude glowing objects moving from west to east.  All object  made a turn south increased altitude and moved south till they disappeared.  All turned at the same location in the sky.  The next appeared after the previous one moved out of sight.  My wife and son witnessed these objects also.  They appeared close enough to hear a sound from them but no sound was heard.   I'm been a sky watcher my entire life; these lights were different from any I've ever seen.",
      "link": "http://www.nuforc.org/webreports/112/S112244.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36eb",
      "summary": "Bright blue light falling from the sky",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "Bright blue light falling from the sky.",
      "link": "http://www.nuforc.org/webreports/116/S116258.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c372c",
      "summary": "3 spheres or discs, V-formation at very high altitude during daylight, traveling very fast.",
      "city": "fayetteville",
      "shape": "sphere",
      "date": "2015-01-26T00:00:00",
      "story": "3 spheres or discs, V-formation at very high altitude during daylight, traveling very fast. A cluster of 3 disc or sphere shaped objects heading north.  Extremely high far above airplanes seen in the area.  3 in V formation and then 1 branched off and disappeared.  The other two continued north, one behind the other.  Very fast.",
      "link": "http://www.nuforc.org/webreports/116/S116826.html",
      "state": "AR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3838",
      "summary": "Red lights.  Would fade out and reappear in nearby at a different  height.  No sound.  Attempted to film it with cell phone.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2015-01-07T00:00:00",
      "story": "Red lights.  Would fade out and reappear in nearby at a different  height.  No sound.  Attempted to film it with cell phone but would not pick them up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116358.html",
      "state": "NC",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c91",
      "summary": "A hovering triangular craft, 2 red lights (one blinking) and 1 white light.",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2015-07-31T00:00:00",
      "story": "A hovering triangular craft, 2 red lights (one blinking) and 1 white light.",
      "link": "http://www.nuforc.org/webreports/120/S120756.html",
      "state": "AR",
      "duration": "still there"
    },
    {
      "_id": "64d005f478aba2ec5a3c403e",
      "summary": "Orange flashing craft.",
      "city": "fayetteville",
      "shape": "flash",
      "date": "2015-05-29T00:00:00",
      "story": "Orange flashing craft. Ok, I was outside just smoking a cigarette, when out of my preferral (sic.  peripheral), I saw this bright flash of light, so naturally it caught my attention and at the time nothIng was there.  Then, next thing I know, about 10-15 seconds after the flash, this little orangish red (more orange than red) light started to appear and it was getting brighter and brighter, and bigger and bigger.  It got so bright it just FLASHED, and then disappeared. I kept watching and it would do this every 15-20 seconds traveling west to east.  I watched this for about 15 minutes.  It seemed like the light would build up to maximum potential and then just flash then dissapear.   Also, the brightness of the flashes would vary, but still very bright.  At one point the flash got so bright I could see that it looked as if though the lIght was coming from the inside because I could see very distinct black spots which I assumed were the spaces between windows and I could see 4 windows that the light was emminating (sic.  emanating) from.",
      "link": "http://www.nuforc.org/webreports/119/S119155.html",
      "state": "NC",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c44e5",
      "summary": "Bright light, turned orange, and a red ball of light shot out of it.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2015-11-06T00:00:00",
      "story": "Bright light, turned orange, and a red ball of light shot out of it. Sitting on the patio at La Huerta.  Saw a bright, white light in the north east sky.  It was very still, and bright which we thought was unusual.  It then began to move south, slowly.  As it got more directly east of us, a plane came into view from the east flying towards it.   As the plane approached, the light turned bright orange.  A red ball of light shot out of it at and angle, towards the ground but disappeared maybe 20 feet below the 'craft.'  The orange glow of the craft grew very bright, and then as the plane came nearer, it disappeared completely.   I saw similar object in the sky this year (2015) on 4th of July. S ame bright light, tough none of them moving.",
      "link": "http://www.nuforc.org/webreports/123/S123350.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c48b2",
      "summary": "Looking up at night into the sky I saw a 3 orange objects moving slowly South South West. I proceeded towards the objects. As I was pul",
      "city": "fayetteville",
      "shape": "sphere",
      "date": "2015-09-17T00:00:00",
      "story": "Looking up at night into the sky I saw a 3 orange objects moving slowly South South West.  I proceeded towards the objects.  As I was pulling up to be directly under them, more came along from the North East with lights that appeared from no-where.  They came down in groups of three.  The last three that that came down started to follow the rest of the other crafts.  The second to last one stopped.  It turned off its light.  I had enough light from the moon to see that the object was a sphere with a metallic like silver color.   Soon a large beam started to glow. Within the second the beam started to circle around the obbject in a familiar, but hard to explain formation.  Within the next second the Metalic sphere was now a bright orange as it once was and then continued to move in the direction of the others.  I have seen theses objects in the area twice headed into the same direction. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122046.html",
      "state": "AR",
      "duration": "25"
    },
    {
      "_id": "64d005f478aba2ec5a3c4af5",
      "summary": "Four blinking lights over Fayetteville.",
      "city": "fayetteville",
      "shape": "unknown",
      "date": "2015-10-09T00:00:00",
      "story": "four blinking lights over fayetteville Four blinking lights two were white one was red and one was blue.  They did not seem to have a certain pattern but were blinking very rappidly.  They were also moving very slowly, not like a plane or helicopter",
      "link": "http://www.nuforc.org/webreports/122/S122639.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d0f",
      "summary": "A star-like light appeared to be flying for approximately 13-14 seconds before pulsing two bright bluish-white lights and then vanished",
      "city": "fayetteville",
      "shape": "light",
      "date": "2015-09-02T00:00:00",
      "story": "A star-like light appeared to be flying for approximately 13-14 seconds before pulsing two bright bluish-white lights and then vanished At approximately 9:00pm Thursday, August 27, 2015, I happened to be smoking a cigarette on my front porch, when I noticed a light similar to that of a distant star, but yet was moving.  I thought it may have been what at first, seemed  to be a high altitude jet flying over the New River Gorge area, yet the more I observed the object it appeared to be flying at a more than normal rate of speed and DID NOT have any flashing light as, you would see with most terrestrial aircraft.   As I walked out into the driveway to watch it further a bright bluish white light flashed twice in intervals over one second exactly apart before vanishing leaving no trace, nor light.  This entire observation lasted only fifteen second before simply vanishing in the sky.  It did not leave in one direction or the other, only ceased to be there.",
      "link": "http://www.nuforc.org/webreports/121/S121515.html",
      "state": "WV",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5495",
      "summary": "Strange light near Rim Road and Cliffdale.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2015-12-17T00:00:00",
      "story": "strange light near rim road and cliffdale was at my friends house near rim rd and cliffdale when I saw a light slowly pulsating upwards, pause for a few seconds, and then at a constant rate downwards.  I pointed it out to my friend and his wife and they saw it as well.  The sky was cloudy and It seemed too high to be any sort of drone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124662.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c55e4",
      "summary": "4 circles flying north to south in Fayetteville, NC on July 1, 2016.",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2016-07-08T00:00:00",
      "story": "4 circles flying north to south in Fayetteville, NC, on July 1, 2016. Spotted 4 circle moving from North to South in arrow formation.  Spotted from 21:30 to 21:45 hours.   Spotted civilian aircraft flying at lower altitude beneath the circles fling in a northern pattern.  3 in front and on in the rear.",
      "link": "http://www.nuforc.org/webreports/128/S128177.html",
      "state": "NC",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c56fb",
      "summary": "Unknown jerky flying red and blue flashing object seen high in the sky.",
      "city": "fayetteville",
      "shape": "flash",
      "date": "2016-07-22T00:00:00",
      "story": "Unknown jerky flying red and blue flashing object seen high in the sky. A red and blue flashing light seen, thought at first to be a plane, but it moved in jerky motions.  The object would travel forward a short distance, then move up and down, taking an abrupt sideways movement.  It reminded me of how a bumblebee moves from flower to flower, then hovers staying within a certain zone.  It would continuously move in the same type pattern.  You could see a small trail behind it as it moved about.  I watched for a while before going back to bed.   In order to have a witness, I woke up my 18 year old son.  He and I both looked at it together before I went back to my room to watch it some more.",
      "link": "http://www.nuforc.org/webreports/128/S128606.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c56d8",
      "summary": "Large, slow, flying triangle aircraft with lights.",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2016-07-15T00:00:00",
      "story": "Large slow flying triangle aircraft with lights. The aircraft flew from behind a tree line, it was triangle shape with 4 lights, 3 lights on each point and 1 in the middle.  It was flying not too high up from the tree line, and seemed to be going at a very slow speed, almost hovering across.   It did have a deep sound but not very loud.   I was in a screened in back porch of my brothers apartments, and I was in too much shock to run through the house to the front..  I am regretting that now.",
      "link": "http://www.nuforc.org/webreports/128/S128399.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c580d",
      "summary": "It rose up into the sky and to the blind eye it was just a bright light but in my camera it changed colors. It moved up and down and ba",
      "city": "fayetteville",
      "shape": "light",
      "date": "2016-06-24T00:00:00",
      "story": "It rose up into the sky and to the blind eye it was just a bright light but in my camera it changed colors.  It moved up and down and back and forth over the area even flashed a bit before it disappeared about thirty minutes later.",
      "link": "http://www.nuforc.org/webreports/128/S128041.html",
      "state": "NC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c599b",
      "summary": "Two objects flying very high and watched as  one of the objects started to come down lower, it got very bright.  ((anonymous report))",
      "city": "fayetteville",
      "shape": "formation",
      "date": "2016-05-20T00:00:00",
      "story": "Two objects flying very high and watched as one of the objects started to come down lower, it got very bright. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127349.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c59bf",
      "summary": "((HOAX??))  Silver oblong craft traveling fast crossed the horizon. N to S dir..  Visible in the daylight sky for approx. 3245 sec.",
      "city": "fayetteville",
      "shape": "oval",
      "date": "2016-05-26T00:00:00",
      "story": "Silver oblong craft traveling fast crossed the horizon.  North to south Direction.  Visible in the daylight sky for approximately 3245 seconds.   Driving in a Westerly position unable to maintain constant contact.",
      "link": "http://www.nuforc.org/webreports/127/S127514.html",
      "state": "NC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b08",
      "summary": "Bright star, then vanished.",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2016-04-15T00:00:00",
      "story": "Bright star, then vanished. I happened to look up and saw a bright \"planet\" in the sky because it was not twinkling like a star.  It had a slight red or orange glow.  As I pondered which planet it could be, it twinkled, and as I pondered that, it became much brighter.  Then it just went out.   I waited to make sure it was really gone, and I did not see anything else.   My guess?  Could have been a meteor that came straight in rather then across the sky.  The duration of it was curious for a meteor, in my opinion.",
      "link": "http://www.nuforc.org/webreports/126/S126700.html",
      "state": "AR",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e5a",
      "summary": "I was just star gazing around seven thirty pm on November 30th. Saw something bright orange out of the corner of my eye so I quickly gr",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2016-12-05T00:00:00",
      "story": "I was just star gazing around seven thirty pm on November 30th.  Saw something bright orange out of the corner of my eye so I quickly grabbed my 20x80 binoculars.   At first by just looking at it with a naked eye it seemed to just be a single orange light but under magnification I saw the three orange circle lights at each corner of the craft.   It moved fast across the horizon.  Much faster than a jet but slower than a meteor.   After 15 seconds or so it disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131554.html",
      "state": "TX",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c62ec",
      "summary": "Bright yellow light above Fayetteville, seen for a couple years in a row.",
      "city": "fayetteville",
      "shape": "oval",
      "date": "2016-08-16T00:00:00",
      "story": "Bright yellow light above Fayetteville, seen for a couple years in a row. Me and a couple friends came home from a party around one am.  We were laying in bed, when all of a sudden my friend jumped over top of me and yelled, pointing out the window so I looked over.   A yellow bright light was in the sky, about as high as power poles, maybe 50 feet from our window.  We watched it for a second before it disappeared around the side of the house.  It went slow at first and then shot off.  We immediately closed the window.   This year, around the same time, another friend was here and he saw it come up to the window.  We all did.   The light was so bright we couldn't tell how big it was.  My friends parents even saw it too.  But nobody else ever believes us.",
      "link": "http://www.nuforc.org/webreports/129/S129096.html",
      "state": "WV",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c62ff",
      "summary": "Greenish fireball shooting over treetops.  ((anonymous report))",
      "city": "fayetteville",
      "shape": "fireball",
      "date": "2016-09-15T00:00:00",
      "story": "Greenish fireball shooting over treetops. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129921.html",
      "state": "AR",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c63ed",
      "summary": "UFO seen hovering South East 4 to 6 miles from Simmons Air field near Fort Bragg.  Roughly between 15000 to 20000 feet in altitude.",
      "city": "fayetteville",
      "shape": "cylinder",
      "date": "2016-09-02T00:00:00",
      "story": "UFO seen hovering South East 4 to 6 miles from Simmons Air field near Fort Bragg.   Roughly between 15000 to 20000 feet in altitude.   One Apache helicopter with radar was seen slowly heading towards the direction of the UFO.",
      "link": "http://www.nuforc.org/webreports/129/S129594.html",
      "state": "NC",
      "duration": "Currently"
    },
    {
      "_id": "64d005f478aba2ec5a3c63f3",
      "summary": "Elongated teardrop shape fell rapidly down the sky.",
      "city": "fayetteville",
      "shape": "teardrop",
      "date": "2016-09-09T00:00:00",
      "story": "Elongated teardrop shape fell rapidly down the sky. While taking batting practice, a friend and I were sitting on a bench facing east when we saw a very bright silver looking light or object falling in the sky at an very high speed.  We saw it in the open sky and followed its progress down behind trees.  It had the shape of an elongated water drop.  The tail of the light was not very long. Once it was out of our sight, we waited for an explosion, but it didn’t happen.  I don’t know if it was a meteorite or falling space debris or what it was, but it either fell into the ocean, or it was just passing by earth. It happened very quickly, and the object looked big.  At first, I thought it was a big passenger plane, but it was moving way too fast for an airplane of any kind.   The whole event probably lasted 3 – 5 seconds.",
      "link": "http://www.nuforc.org/webreports/129/S129815.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c666a",
      "summary": "Orange yellow orb seen floating over clouds, slowly moving up and down.  ((NUFORC Note:  Twinkling star?  PD))",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2016-08-02T00:00:00",
      "story": "Orange yellow orb seen floating over clouds, slowly moving up and down, finally dipping behind large cloud. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128943.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c66e4",
      "summary": "Several Large UFO sightings over Bladen Co., N.C. between 30 Dec 2016 and April 2017.  ((anonymous report))",
      "city": "fayetteville",
      "shape": "disk",
      "date": "2017-04-20T00:00:00",
      "story": "Several Large UFO sightings over Bladen County, N.C. between 30 Dec 2016 and April 2017. It had been the fifth time this type of UFO has come to our area, which is our back yard.  The difference has been its size and distance to My home.  Every appearance, has drawn it closer and larger than the last one.  The first sighting was on 30 December 2016 @ 2300 hours.  It appeared and traveled down the street and above My neighbor's house across the street, then it came over mine.  It was so close I could have hit it with a baseball easily.  The neighbor in questioned moved from the fear of the incident.  This first one was saucer shape, reddish/orange, pulsating as it revolted, silently, eventually speeding incredibly fast over head and east off of Hwy 87.   The next two were on 26 January and 8 February, 2017.  These two were very similar in size, though larger than the first on 30 December 2016.  The one on 26 January 2017 appeared at 2145 hours, with three major reddish/orange lights equal distant apart, with a diamond like object trailing it behind and below the craft.  It diamond shape figure eventually joint the major part of the craft from underneath, then flow away as it traverse the trees at a distance.  The next one, on 8 February was huge, yet silent as well.  It didn't create no sound or disturbance of the atmosphere.  It remained steady state for approximately 45 minutes, if not more, because I was lost in its beauty.  This one too hard the three reddish/orange glow of lights, equally distant from each other and a trailing diamond shaped object.  The only difference with this observation was that the craft was larger than the last and the diamond shaped object moved more distal from the main object and freely over the neighboring homes and streets and tree lines.  The observation was the 11 April 2017, and without a doubt, the largest ever observed, and not just by Me, but by My entire family.  I've waited a long time to be vindicated by this current sighting, because all the others were seen by Me and when reported to My family, it was received rather unappreciated.  Then this sighting! occurre d and I was vindicated.  Like I said this one was the largest of them all, were every detail could be observed by everyone.  It too had the three reddish/orange lights equally distant, the bottom base could be seen perfectly, which demonstrated were the diamond shaped craft would descend from and the full range of what else there was underneath the UFO.  The bottom part, as I said, had the diamond shaped craft, along with what appeared to be a silvery bracket holding it in place, with some lighting as well.  You could see the way the edges of the UFO curved upward, all the way around.  The top seemed like a shimmering light blue glow about it. Once again, it was silent, and I expected some sound, considering the size of this UFO. The size, without question, had two be 3 and half times the size of My house, because as it traveled over it. It had extend equally on both ends, which would make it over 3 times 76 feet in diameter, since My home is 76 feet long.  Making it more than 275 feet in diameter. The only thing I question id why now? Why these recent visits to My area, and almost the exact same area.  Truth be told, since moving out to this area in 2005, I've since UFOs land near by, even to the extent of leaving circles in My back yard.  Some time floating between My property and My neighbors, but never this large or this close.  There must be something going on around here, if not with Me, since I've had several experiences in My entire life with these things, and for generations apparently. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133617.html",
      "state": "NC",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6920",
      "summary": "Three lights in a triangular shape in the sky.  One was really bright and the other two were dim.",
      "city": "fayetteville",
      "shape": "triangle",
      "date": "2017-03-10T00:00:00",
      "story": "Three lights in a triangular shape in the sky.  One was really bright and the other two were dim.  When we started looking at them they all dimmed out and was gone.",
      "link": "http://www.nuforc.org/webreports/132/S132799.html",
      "state": "TN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b7a",
      "summary": "7 sphere like objects that reflected the sunlight off its surface seen in western part of sky in a circle formation.",
      "city": "fayetteville",
      "shape": "sphere",
      "date": "2017-01-26T00:00:00",
      "story": "7 sphere like objects that reflected the sunlight off its surface seen in western part of sky in a circle formation.  Appear to be going in a circle than disappearing in clouds.",
      "link": "http://www.nuforc.org/webreports/132/S132246.html",
      "state": "NC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e4c",
      "summary": "I saw a cigar-shaped aircraft with 3 bright lights that didn't blink.",
      "city": "fayetteville",
      "shape": "cigar",
      "date": "2017-08-24T00:00:00",
      "story": "I saw a cigar shaped aircraft with 3 bright lights that didn't blink. Standing in my driveway at 1am looked up over my neighbors house over the trees  I saw a cigar-shaped thing with 3 lights hovering silently, it came  from behind the trees.  I saw it hovering in full over the street for maybe 5 seconds, direct eye contact.  Then it just went from 0mph-warped speed, and varnished.",
      "link": "http://www.nuforc.org/webreports/135/S135763.html",
      "state": "NC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c75b5",
      "summary": "Large octagonal craft flies over house and in front of moon",
      "city": "fayetteville",
      "shape": "other",
      "date": "2018-01-12T00:00:00",
      "story": "Large octagonal craft flies over house and in front of moon That night was the 'super-moon' and I went outside to look at the moon. Saw large object which blotted out stars but gave off no light or sound. It was stop-sign shaped. Silently flew away. Passed in front of the moon which up until that point I wasn't sure if it was really there or not but once I saw it silhouette the moon I was sure I had viewed a UFO.  Several planes and jets were flying around at the time but none seemed to notice the craft.  When I came back inside my two cats and one dog were all standing by the front door looking out in the direction the craft had gone.  The dog seemed startled and was jumpy for the next few nights.  Still cannot explain what me (and apparently my pets!) have seen.",
      "link": "http://www.nuforc.org/webreports/138/S138263.html",
      "state": "AR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7845",
      "summary": "Bright balls of light in sky over Fayetteville, NC.",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2018-01-12T00:00:00",
      "story": "Bright balls of light in sky over Fayetteville, NC. Saw several circular or ball-shaped objects which appeared to be stacking up on each other and moving together.  As we watched we saw a couple come out of others that were already present and separate.   There were military helicopters circling the area within a couple miles, but not too close....so they were definitely aware of the event.",
      "link": "http://www.nuforc.org/webreports/138/S138337.html",
      "state": "NC",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c78f6",
      "summary": "Outside with husband watching Geminid Meteor shower when what at first appeared to be a flock of birds in the sky realized it was NOT,",
      "city": "fayetteville",
      "shape": "formation",
      "date": "2017-12-14T00:00:00",
      "story": "Outside with husband watching Geminid Meteor shower when what at first appeared to be a flock of birds in the sky realized it was NOT, 10 to 15 small long ovals glowed slightly, went straight across sky but also appeared wavy and in formation.  Moved too fast and smooth to be a plane also made no noise.  Spotted by Peadens Seafood Restaurant.",
      "link": "http://www.nuforc.org/webreports/137/S137745.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c79a0",
      "summary": "I observed what I thought was a satellite falling from the sky or a meteor with a debris trail. But as it fell the object broke into 5",
      "city": "fayetteville",
      "shape": "formation",
      "date": "2017-12-04T00:00:00",
      "story": "I observed what I thought was a satellite falling from the sky or a meteor with a debris trail.  But as it fell the object broke into 5 pieces & stopped falling all at the same time.   This took about 1.5 minutes to take place & then they hovered for almost 50 seconds & I couldn’t see them anymore due to a tree line. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137504.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a40",
      "summary": "Several flashing strobes moving in formation, from west to east.  ((anonymous report))",
      "city": "fayetteville",
      "shape": "formation",
      "date": "2017-11-03T00:00:00",
      "story": "Several flashing strobes moving in formation, from west to east. 3 flashing strobes in triangle formation, miles apart, in the lead and several others forming various other formations but all moving in sync.  Moving west to east. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136973.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d75",
      "summary": "Fast moving white orb that pulsated twice as it flew through a cornfield right before a big storm.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2017-09-08T00:00:00",
      "story": "Fast moving white orb that pulsated twice as it flew through a cornfield right before a big storm.",
      "link": "http://www.nuforc.org/webreports/136/S136081.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7dd5",
      "summary": "Missing Time and Military Helicopter.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2018-05-31T00:00:00",
      "story": "Missing Time and Military Helicopter My son was about 1 year old and it was one of the normal evenings when my husband was \"out in the field\".  He was often gone for up to two months at a time, and I felt quite at ease being alone.  It was late fall, but the temperature outside was nice enough for me to be able to go outside in my shorts.  The \"Tonight Show\" with Johnny Carson was just going off the air and I was sitting down to watch the \"Tomorrow Show\" with Tom Snyder.  I remember this night because it was the premiere episode.  October 15th, 1973.   I could hear a beeping noise coming from outside and thought that it might have been one of the electrical transformers, so I went outside to see if I could find it.  There was not a hint of a breeze in the night air and it was fairly cool out.  There seemed to be no noise except the beeping.  I stood in the yard for a couple of minutes just listening, and then I heard a police siren coming my direction from the main road.  I went to the north side of the house to try to see what was happening but was blocked by all the pine trees.   Then I heard a helicopter coming from a distance and that was when I noticed strange lights fairly low to the ground to my east.  There should have been no lights in that direction because there was nothing that way except ten to fifteen miles of forest.   I walked down the street about 4 houses to see the main road behind the house and watched as something zoomed by.  It was just above the tree line, about 40 feet in the air, and was traveling so fast I couldn’t tell anything specific about it other than it was very well lit.  The 2 police cars zoomed by headed south following whatever was flying in front of them.  Then came the helicopter.  They stopped about a mile down the road, turned off their lights and returned in the direction of Ft. Bragg.  I turned around to see the lights in the forest and they were still in the same spot.  That was when they lifted to just above tree height and then blinked out.  I had no re! ason to be frightened but ran back in to the house anyway.  That was when I noticed that the television station had gone off the air.  The \"Tomorrow Show\" should have still been on because I had only been outside for maybe five minutes.  I checked the clock and it was now nearly two in the morning.  The show came on at 12:30 and went off at 1:30.  What had happened to that hour and a half?",
      "link": "http://www.nuforc.org/webreports/141/S141670.html",
      "state": "NC",
      "duration": "1-1/2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c7eea",
      "summary": "Me and my children were heading to my moms house when something very silvery like aluminum like so shiny flew by in the sky went in a c",
      "city": "fayetteville",
      "shape": "cigar",
      "date": "2018-05-04T00:00:00",
      "story": "Me and my children were heading to my mom's house when something very silvery like aluminum like so shiny flew by in the sky went in a cloud and disappeared...now this is over the overpass of 295 off mcauthur rd i kept driving to follow it because if it were a plane we would have been able to see it or follow it its all open no matter if it went higher foreward straight or down it was gone and was too big to have dissapeared in broad day light like that its always something strange going on in that area but it freaked me and the kids out for sure",
      "link": "http://www.nuforc.org/webreports/139/S139645.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c80e2",
      "summary": "Circular craft with beaming lights on top seen hovering over Atlanta area",
      "city": "fayetteville",
      "shape": "circle",
      "date": "2018-03-23T00:00:00",
      "story": "Circular craft with beaming lights on top seen hovering over Atlanta area. Circular craft was seen hovering in the clouds with bright beaming lights shooting from the top of the craft towards the sky.  When we attempted to take a video the craft moved slowly backwards and disappeared into the dark clouds. Not sure if it is related but traffic lights were not working and the power was out over the area we saw it.",
      "link": "http://www.nuforc.org/webreports/139/S139201.html",
      "state": "GA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c80f7",
      "summary": "((HOAX??))  Bright lights being chased by Mitlitary helicopters",
      "city": "fayetteville",
      "shape": "light",
      "date": "2018-03-23T00:00:00",
      "story": "Bright lights being chased by Mitlitary helicopters The past few nights near Andrews rd area there has been a a bright green blue light moving and hovering around the sky also a weird shaped object with 2 flashing round white lights seen as well no red flashing light to indicate its an airplane no noise either near base then all helicopters everywhere as if it is chasing these objects",
      "link": "http://www.nuforc.org/webreports/139/S139226.html",
      "state": "NC",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c82ff",
      "summary": "MADAR Node 136",
      "city": "fayetteville",
      "shape": "",
      "date": "2018-10-25T00:00:00",
      "story": "MADAR Node 136",
      "link": "http://www.nuforc.org/webreports/143/S143573.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c86cf",
      "summary": "Mysterious bright light spotted hovering over wooded area",
      "city": "fayetteville",
      "shape": "light",
      "date": "2018-08-17T00:00:00",
      "story": "Mysterious bright light spotted hovering over wooded area I reside in Fayetteville, NC, and I live in an apartment on the second floor.  I occasionally open my bedroom blinds at night to get beautiful views of the moon & stars.   Tonight around 10p.m., I opened my blinds, turned out my bedroom light and laid in bed gazing out of the window slightly to the right of where the moon is usually visible with hopes of witnessing the meteor shower.  After looking toward the sky for sometime a bright light appeared and I noticed it was actually hovering over the woods in the back of my apartment complex.  I watched the bright light as closely as possible to rule out the possibility of it being a drone being operated by someone nearby, it wasn't.   I called my husband to come look and he saw it as well.  The bright light hovered for about 30 mins in the same spot and faster then I could blink it disappeared.   The moon & stars are not even visible tonight due to the frequent thunderstorms we are having so the only explanation is that it! was certainly an extraterrestrial sighting.",
      "link": "http://www.nuforc.org/webreports/142/S142696.html",
      "state": "NC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c87a9",
      "summary": "Was watching two bats fly around the sky over my house.In the backdrop of a fading pink sky I noticed what I thought was a jet leaving",
      "city": "fayetteville",
      "shape": "cone",
      "date": "2018-07-19T00:00:00",
      "story": "Was watching two bats fly around the sky over my house.  In the backdrop of a fading pink sky I noticed what I thought was a jet leaving airport.  Since it is just to the south of me that was my first thought.   That point I realized that there wasn't a sound being produced and it was headed towards the ground faster than a jet could travel or any man made craft for that matter.  Best way to describe it was a green fireball with greenish-whiteish tail/trail behind it.  Only lasted for a few seconds at the most.  I even waited for a crash or explosion sound to rule out any crash that could've happened.",
      "link": "http://www.nuforc.org/webreports/142/S142296.html",
      "state": "AR",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b9f",
      "summary": "MADAR Node 136",
      "city": "fayetteville",
      "shape": "",
      "date": "2019-02-27T00:00:00",
      "story": "MADAR Node 136",
      "link": "http://www.nuforc.org/webreports/145/S145016.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8ca6",
      "summary": "Blackish grey egg or oval shaped craft hovering slowly then vanishing in broad day light. No sounds where heard.",
      "city": "fayetteville",
      "shape": "egg",
      "date": "2019-02-14T00:00:00",
      "story": "Blackish Grey egg or oval shaped craft hovering slowly then vanishing in broad day light. No sounds where heard.",
      "link": "http://www.nuforc.org/webreports/144/S144878.html",
      "state": "AR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f6f",
      "summary": "MADAR Node 128",
      "city": "fayetteville",
      "shape": "",
      "date": "2018-11-24T00:00:00",
      "story": "MADAR Node 128",
      "link": "http://www.nuforc.org/webreports/143/S143776.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c97d4",
      "summary": "Blue light moved quickly and with maneuvers only a craft could make.",
      "city": "fayetteville",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Blue light moved quickly and with maneuvers only a craft could make. Cloudy night, no stars visible. Blue Light appeared,jetted across the sky, slowed. Then, it dipped down at a decreased speed and sped off seemingly going out through the clouds.",
      "link": "http://www.nuforc.org/webreports/151/S151598.html",
      "state": "AR",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c994e",
      "summary": "White light craft seen for a couple seconds flying in an L, followed shortly after by 3 planes flying in a V formation",
      "city": "fayetteville",
      "shape": "light",
      "date": "2019-10-04T00:00:00",
      "story": "White light craft seen for a couple seconds flying in an L, followed shortly after by 3 planes flying in a V formation Saw a white circular light appear in the sky in front of me while on i49 for about 1.5 second. It was heading straight down toward the ground and changed course parallel to the ground, like a “L” flight path, and then disappeared.  About 5 minutes later I noticed 3 airplanes, which were not there before, flying in a “V” formation in the same direction the ufo disappeared. Lost sight of the planes but they continued in the same formation.",
      "link": "http://www.nuforc.org/webreports/149/S149368.html",
      "state": "AR",
      "duration": "2 seconds"
    }
  ]
}