{
  "city": "fontana",
  "fetch_timestamp": "2025-07-12T14:36:23.245585",
  "record_count": 32,
  "pages_fetched": 1,
  "api_calls": 2,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4231",
      "summary": "Strange orange glowing orb seen from the 210 freeway Inland empire.",
      "city": "fontana",
      "shape": "oval",
      "date": "2019-03-21T00:00:00",
      "story": "Strange orange glowing orb seen from the 210 freeway Inland empire. Large glowing orb orange in color seen n/w direction from the Fontana 210 freeway at about 0510 morning time.  It was just a large orb glowing bright orange shaped like a american football with clear cut borders with no radiating light.  Bottom half was covered by mountains/hills as it dissipated it frittered away.",
      "link": "http://www.nuforc.org/webreports/145/S145245.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4277",
      "summary": "Dark round object flying low having no lights and making no sounds.",
      "city": "fontana",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "Dark round object flying low having no lights and making no sounds. My neighbor and I were out a little after 10pm with binoculars looking at satilites as they passed overhead. I looked to the West toward Los Angeles and saw a dark object that was round in shape, actually oval at distance,  flying slowly at low altitude almost due East. I looked through the binoculars and saw nothing other than it's dark round shape. There were no lights, sounds or sensation as it passed overhead. I keep looking at it with the binoculars till it was out of sight. I have not seen this object before or since. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49642.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b43a8",
      "summary": "UFO over San Bernardino Mountains",
      "city": "fontana",
      "shape": "unknown",
      "date": "2006-05-15T00:00:00",
      "story": "UFO over San Bernardino Mountains I saw a craft today 03/22/06 around 13:30 over the San Bernardino mountains just standing still flashing a light on an off as in sunlight being reflected on a mirror or ship to ship code signaling. It did this for over 15 minutes before a jetliner flew below it leaving a chemtrail; which turned very quickly into a linear cloud, which hid the object from view.  The only day I leave my camera behind, and this happens.",
      "link": "http://www.nuforc.org/webreports/049/S49781.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b49a7",
      "summary": "Triangle over Fontana, Ca.",
      "city": "fontana",
      "shape": "triangle",
      "date": "2019-07-12T00:00:00",
      "story": "Triangle over Fontana, Ca. While lighting fireworks and watching neighbors fireworks in the sky I seen what was the shape of a triangle coming from the NE.  At 8pm there was still enough light to make out aircraft that was in route to Ontario airport or an nother destination, and they were frequently moving at a predetermined amount of time, I could see the helicopters flying in and out infrequently, but you could tell they where helicopters, a couple of low flying private planes could also be seen, but then I seen a triangle moving in from the NE then turning and going south.  The group wasn't moving fast and was pretty quiet compared to all the FW's that was going off.  I looked in my truck looking for my binoculars it wasn't there and I wasn't carrying my phone.  So I moved to a darker area to focus on those aircraft, and I could make out bands on the wings, I want to say they that they had two green bands, one on each wing, but it was dark and what they were escorting was a very bright! golden/yellow craft that I could not make out completely but that it was very bright and leading the two escort jets, and they headed south.  From my perspective if you hold you two fingers in the air, arm extended, and leave a gap of about an inch, that's approx how close they were.  My only fault is I didn't record anything.",
      "link": "http://www.nuforc.org/webreports/147/S147380.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b51bf",
      "summary": "My brother and I saw 3 lights forming a shape of a triangle",
      "city": "fontana",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "My brother and I saw 3 lights forming a shape of a triangle I was on the roof with my brother, fixing our TV antenna, when we seen 3 whitish-yellowish lights in a triangle shape coming from the other side of the San Bernardino mountains northeast of us.The lights rotated clockwise but stayed in unison.Next they spread out but stayed in a triangle shape as to form a larger triangle.After that the lights shrunk back down to its original size. Then they rotated a few more times in unison then sped off with such an incredible speed that I have never seen before in my life. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52085.html",
      "state": "CA",
      "duration": "15 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b6899",
      "summary": "Glowing light",
      "city": "fontana",
      "shape": "light",
      "date": "2008-03-31T00:00:00",
      "story": "Glowing light It was a sunny day, with just a few clouds in the sky.  I was sitting in the backyard of my mothers house, when I looked up, and saw, above the house behind her back fence, what appeared at first to me to be either a plastic shopping bag floating to the south.  As I watched it I began to think realize that it was unlikely something like that could be that high and still in the air.  Then I thought maybe it was a white balloon, but it was glowing white.  I followed it with my eyes as it ascended, still bearing south, up into the clouds, but it never dimmed and maintained the bright glow. Then seemed to change it's shape as it turned to go west.  It was completely silent.  Once the turn was complete, it regained it's original, round/oval shape. I ran into the house as it passed my view and told my brother to hurry and come into the front yard with me.  We both ran out into the front yard, and both witnessed it acsend higher and higher into the sky, appearing more like a bright star in midday.  As we continued to watch it, it dissapeared into the atmosphere... I had never really believed in UFO's, although open minded to it.  I have been looking at UFO videos, and many of the UFO's caught on video are exactly like the one I saw.",
      "link": "http://www.nuforc.org/webreports/062/S62104.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b81e7",
      "summary": "5 white circles were seen from the east going from south to north.",
      "city": "fontana",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "5 white circles were seen from the east going from south to north. 5 white circles uniformally lined from top to bottom were seen moving from the east going from south to north.",
      "link": "http://www.nuforc.org/webreports/072/S72299.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8989",
      "summary": "UFO in near I 15 near Fontana.",
      "city": "fontana",
      "shape": "formation",
      "date": "2009-03-19T00:00:00",
      "story": "UFO in near I 15 near Fontana. Driving on highway 15 heading south, We spotted an object to the far left of the highway blinking bright violet and kinda orange light. Ontario Airport was to the far east but this object appear not to be moving toward it or away from it. We stopped on the side of the rode near the 60 E exit. The object did not appear to be moving in any direction just stationary. My wife and I both concluded that it was not a plane or helicopter because it did not have a blinking red light or have alot of white light around it. In addition if it were a police helicopter, you would see a spot light if it was trying to search for something, not in this case.",
      "link": "http://www.nuforc.org/webreports/068/S68122.html",
      "state": "CA",
      "duration": "1"
    },
    {
      "_id": "64d005f478aba2ec5a3b8dde",
      "summary": "silver round object",
      "city": "fontana",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "silver round object It was a circle,round object silver color,i I was doing exercises at this middle school recreation park,when suddenly I saw this round silver object passed above my eyes while I was doing set ups facing west when coming fron east this oject show up,I followed with my eyes until it dissapear,it did not make any movements it followed one direction only going west,it was going maybe a 75 miles an hour something like that.",
      "link": "http://www.nuforc.org/webreports/072/S72994.html",
      "state": "CA",
      "duration": "25sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b8e8d",
      "summary": "Just not the same as a jet landing in Ontario airport.",
      "city": "fontana",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "Just not the same as a jet landing in Ontario airport. Sighting was traveling from North west to east south.  Almost paralell with the 10 Fwy about 3 miles north of fwy.  It had a bright red light that did blink below a white light. above the white light was another red light that blinked only going over certain areas.   At one point there was a sparkling light that did travel from the white light to the red light on top.   Mind you this is not a plane, jet, or helicopter.  The red light on top would have been at least 3 to 4 stories high from the white light and the red light never blinked in the same spot above the white light.",
      "link": "http://www.nuforc.org/webreports/074/S74391.html",
      "state": "CA",
      "duration": "4:10"
    },
    {
      "_id": "64d005f478aba2ec5a3b983d",
      "summary": "I was going to open the door of my truck, parked in our driveway, when suddenly a light beam appeared aimed at me from behind. I though",
      "city": "fontana",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "I was going to open the door of my truck, parked in our driveway, when suddenly a light beam appeared aimed at me from behind. I thought it was one of those police helicopters. A little surprised and upset, I turned around, looked up and I saw this fireball, that seemed to me was not moving. This lasted for maybe ten seconds. And it dissapeared. To me it seemed the fireball was not far from the rooftop of the house across the street. I did not notice any form of a craft, but only the fireball because I was terrified. During the first day after it happened, I thought I might have seen a meteorite or astroid that exploded. But this one was not moving fast and it did not cause a trail.",
      "link": "http://www.nuforc.org/webreports/073/S73392.html",
      "state": "CA",
      "duration": "20"
    },
    {
      "_id": "64d005f478aba2ec5a3bab51",
      "summary": "disc shape but molded its shape like a jelly fish,it glowed orange reddish lights it flow up and down hovering for about 6 sec then wen",
      "city": "fontana",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "disc shape but molded its shape like a jelly fish,it glowed orange reddish lights it flow up and down hovering for about 6 sec then went up and down again it did this for about 4 to 5 mins then flew up and just vanished there is video footage of the same object that i saw on another website video was taken dec 16 2009 ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77999.html",
      "state": "CA",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb387",
      "summary": "Fireball over Jurupa Hills in South side part of Fontana Ca.  San Bernardino County 11/08/2010",
      "city": "fontana",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "Fireball over Jurupa Hills in South side part of Fontana Ca.  San Bernardino County 11/08/2010 At approx 21:30, we saw a huge fireball in the sky burning toward the Jurupa hills on South Side part of Fontana Ca.  The object was light blue in color with a flame trail that stretched far back.  Ive see plenty of shooting stars, and thats not what it was!  We were expecting a loud crash but nothing was heard.  Been looking at the news but no reports. Weird!!",
      "link": "http://www.nuforc.org/webreports/078/S78806.html",
      "state": "CA",
      "duration": "5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb513",
      "summary": "Round fire object dropping smaller fire objects and quickly disappearing.",
      "city": "fontana",
      "shape": "circle",
      "date": "2011-02-23T00:00:00",
      "story": "Round fire object dropping smaller fire objects and quickly disappearing. Round orange glowy object dropping glowy lights and quickly disappearing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80151.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb81a",
      "summary": "Green lights in fontana ca could be seen i you were out side at mid night",
      "city": "fontana",
      "shape": "formation",
      "date": "2010-07-28T00:00:00",
      "story": "green lights in fontana ca could be seen i you were out side at mid night it was a nice and peaceful night until me an three other friends noticed that the light bulb from the front of the was flickering like before  a black out.  and then my dogs ferules luoe and cinnamon were all acting aggressive then the black out happens   and then 5 minutes later the lights went out we looked around to try to fond each other in the dark night   after that we herd a sound that went  bum bum pu bum pe the last sound was a very high pitch we looked up and saw 4  green glowing one of the objects semed to float and shot a blue light from the bottom. they all looked like looked like if they where like  huge diamonds with red and blue lights  5 later a boomerang shaped thing passed with no noise  and passed by fast and we thought that is was the air force checking out what was happening in the sky 10 minutes later the lights went back on than the floating shapes despiser from the sky but not from my head. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76703.html",
      "state": "CA",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bca58",
      "summary": "Lights on the sky evry night",
      "city": "fontana",
      "shape": "light",
      "date": "2011-08-21T00:00:00",
      "story": "Lights on the sky evry night For quite some time my family and I, have been watching these lights across the night sky, they appear on a daily bases. The objects seem to have some sort of intelligense since they move in a zig zag motion, which is why I discarted them from being meteorites or satellites. I live near an airport(5 miles)it can easily be seing that they're not planes, in fact when a plane comes near one of this objects they dimn down or completely disappear.  When two of the objects come across each other on of them flashes a bright blue light before dissapearing. These objects we been spotting on everynight from 3 or 4, a night to 11 even 13. We do not believe this objects to be military, they're to fast and sometimes at a very high altitud.",
      "link": "http://www.nuforc.org/webreports/083/S83256.html",
      "state": "CA",
      "duration": "1 MIN."
    },
    {
      "_id": "64d005f478aba2ec5a3bcb90",
      "summary": "06/25/2011 A brief sighting of what appeared to be an offset horse shoe with 2 bright white lights.",
      "city": "fontana",
      "shape": "other",
      "date": "2011-07-04T00:00:00",
      "story": "06/25/2011 A brief sighting of what appeared to be an offset horse shoe with 2 bright white lights. I was heading east on my way to work that nite.  I had been scanning the skies for the past few nites looking for sattelites.  As I approached a stop light I looked to my left, (south), when I noticed  an unusually bright light fairly low in the sky.  It really caught my attention beacuse it was so bright.   At first I thought it to be a passenger jet due to the fact that we are within miles of an intrenantional air port..  But the color of the light was quite different from other air craft that were traveling through the skies at that time...   My second thought was that it must have been a hellicopter with its search light on.   As I watched it for a few seconds, I noticed that it was moving rather quickly across the sky heading in a north eastern direction.  I began to think, \"What is that?????\"   As i continued to watch it, I noticed that there were no other blinking lights around the main light.  Not only that, the color of the light was bright soft white and the center had a bluish tint to it.  It resembled the hue of a halogen head light on a car, but much more intense. Then I noticed hat there were 2 lights on the object, one apparently in the front, and one in the back.  Both had the same type of glow, but the 1 in the back seemed less intense.   I took notice that there were still a lack of any other blinking lights to show me that it was a typical air craft.   As I watched it traveling across the sky, it appeared to be traveling closer to where I was on the road.  The 2 lights were not even in thier alighnment but they seemed to be part of the same craft, due to the flow of the flight pattern.  The rear light (the dimmer of thye 2) was a bit higher than the front (brighter) light.  Looking at the way the lights were slightly off set, I thought it to be sort of a horse shoe- offset squarish shape.  The lights being on the bottom front and rear feet. Now, the way it was fluently and very quickly cutting through the sky was what really caught my attention.  It cut across the sky traveling both easten and northern simultaneously.  It was like it didn't need to turn or change any direction in order to travel in in a direction.  It was like it was able to cut across the sky and not have to steer.  It flew faster than any other craft that I have ever seen. It was almost like it wasn't propelled by a fuel type of means.  It was too perfect and fast.  It seemed silent, almost as if it were skimming across. As it continued to cut across from the south western sky into the south east, I really took notice of the lights.  The intensity and the brightness.  I could see a very thin and vague trace of a beam that came from the rear light and pointed at an angle to the rear and slightly downward.  It quickly made its way across my view heading northerly with a hint of an easterly direction.  As if it could go both directions at once. I began to notice that it seemed to be losing altitude as it glided tword the mountains.  I quickly decided to try and track it as the light changed. I quickly decided to make a right and head north to attempt to track it.   As I approached the next signal light I could tell that it actually semmed to be descending tword the base of the mountain range.  I saw it come down to wher the mountains actually shallow out. That is when I lost sight of it.  I continued to search  it out, but by the time I got out of the buildings that covered its decent, It was gone.  I went to a gas station where I could get  good view of the exact area where I saw it descend.  But there was nothing. I figured someone else had to have seen the same thing.  There were quite a few cars out on the road for that time of nite.",
      "link": "http://www.nuforc.org/webreports/081/S81965.html",
      "state": "CA",
      "duration": "3-4 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bdaec",
      "summary": "Small metalic teardrop shape object that made a parallel front-back movement.",
      "city": "fontana",
      "shape": "teardrop",
      "date": "2012-08-05T00:00:00",
      "story": "Small metalic teardrop shape object that made a parallel front-back movement. The object I saw was through my window, it made like some type of parallel front and back movement (slowly) then suddenly disappeared.  It made this same movement one more time before disappearing once again.  It had a sliverish metalic shiny color.  It was not an airplane or a helicopter beacause it made no noise.",
      "link": "http://www.nuforc.org/webreports/090/S90993.html",
      "state": "CA",
      "duration": "Approx. 8-10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3be710",
      "summary": "2 Bright Orange Lights Over Fontana.",
      "city": "fontana",
      "shape": "circle",
      "date": "2012-04-18T00:00:00",
      "story": "2 Bright Orange Lights Over Fontana. I went outside to walk my girlfriend to her car, while I looked towards the Moon and seen a Orange Brightly Lit Object in the sky moving like a plane, but with none of the usual blinking red/blue lights you see from an airplane.  I pointed it out to my girlfriend as the object passed thru the sky and vanished into the clouds.  For some reason, I went outside a second time, looked towards the same direction towards the moon and I seen another object following the same path as the other, and that's when I pulled out camera.",
      "link": "http://www.nuforc.org/webreports/088/S88028.html",
      "state": "CA",
      "duration": "15-25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6d9",
      "summary": "Fireballs in Fontana, CA.",
      "city": "fontana",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "fireballs in Fontana,CA In mid September then again about 3 weeks later.  About 7 friends and family were sitting around outside, when my boyfriend shouted for me to look at the sky.  Thier were about 7 or 8 fireball looking objects.  We brushed it off as bags with candels or something like that.  I found it very interesting.",
      "link": "http://www.nuforc.org/webreports/095/S95173.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0df3",
      "summary": "I believe that I witnessed a ufo, star, or planet disintegrating.",
      "city": "fontana",
      "shape": "fireball",
      "date": "2014-03-18T00:00:00",
      "story": "I believe that I witnessed a ufo, star, or planet disintegrating. I witnessed a bright orange what at first glance appeared to be a planet or star in the Northern sky.  Within seconds it began to fade away.  When it was almost completely gone another object which looked like a shooting star passed directly beneath horizontaly.  I have perfect vision & know what I saw was not a figment of my imagination.",
      "link": "http://www.nuforc.org/webreports/107/S107881.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c205b",
      "summary": "Diamond Shaped Objects in Broad Daylight",
      "city": "fontana",
      "shape": "diamond",
      "date": "2014-06-13T00:00:00",
      "story": "Diamond Shaped Objects in Broad Daylight Driving to work in broad daylight, it was a bit smoggy, but it looked like the object was flying under the smog.   Too low to be a plane, and was two diamond shapes all black connected, it was no way it could be a helicopter.   I looked up and had to take a double look.  It was much faster.  Truly amazed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110142.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3056",
      "summary": "Bright red and blue light in the sky shooting around at unbelievable speed.",
      "city": "fontana",
      "shape": "cigar",
      "date": "2014-08-29T00:00:00",
      "story": "Bright red and blue light in the sky shooting around at unbelievable speed. I saw 2 very bright blue lights in the sky,  I thought It was a plane at first, then two red lights suddenly came on making a red, blue, red, blue pattern.  I thought ok maybe helicopter, but it shot straight up inthe air at a rate of speed I've never seen a helicopter go.   Then all lights went out, a white light came on and it shot back down just as quickly out of my sight.   I yelled to my husband and ran further down my yard to see if I could see it again, by this point the white light is out red and blue are back on it shot down again but this time it shot diagonally.  My husband and I saw this.   After shooting diagonally, it shot straight back down at an unbelievable speed and disappeared out of sight behind houses.",
      "link": "http://www.nuforc.org/webreports/113/S113018.html",
      "state": "CA",
      "duration": "30 sconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3134",
      "summary": "Oval bright with red lights vanish.",
      "city": "fontana",
      "shape": "oval",
      "date": "2014-08-08T00:00:00",
      "story": "Oval bright with red lights vanish. It was oval bright with red lights all around far distance vainish within seconds I still can't believe it at first I thought it was a plane or a helicopter or a shooting star it was to bright for a plane or a helicopter and it could not been a shooting star because shooting stars have a line this one was bright and oval and it vanish right when I was staring at it was like not even 25-30 seconds but it was amazing .",
      "link": "http://www.nuforc.org/webreports/112/S112235.html",
      "state": "CA",
      "duration": "towards heading back home"
    },
    {
      "_id": "64d005f478aba2ec5a3c49cf",
      "summary": "Saw several lights over mtns. Orange-red in color, like nothing I've ever seen.  Each disappeared at once.  Also, have film, pictures.",
      "city": "fontana",
      "shape": "circle",
      "date": "2015-09-29T00:00:00",
      "story": "Saw several lights over mountains.  Orange-red in color, like nothing I have ever seen.  Each disappeared at once.  Also, have film, pictures.",
      "link": "http://www.nuforc.org/webreports/122/S122311.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3c4aac",
      "summary": "An odd \"bubble like\" unidentified, but seen by the naked eye; appeared close to moon during Super Moon Eclipse.",
      "city": "fontana",
      "shape": "circle",
      "date": "2015-10-02T00:00:00",
      "story": "An odd \"bubble like\" unidentified, but seen by the naked eye; appeared close to moon during Super Moon Eclipse. A friend and I were trying to get some good photos of the \"Supermoon\" Lunar Eclipse on Sept. 28th, around midnight.  We were out on the balcony of our apartment and were using both my cell phone for pics and his out dated telescope to try to possibly take some nice pics of this cool event. I downloaded 3 applications that would possibly have a telescopic or zoom affect on my phone for odvious reasons..the camera is terrible for far away pics.  During this period of pics taken I did not use my friends telescope to capture photos ..only my phone. The applications were a telescopic for telescope pics( can attach cell to telescope physically) and a so called filter or night vision app. and an app that flip flops dark and light..whatever the object being photographed the whiter or lighter colored object is reversed to black and the black object is reversed to white (easier to see in dark conditions). I started to take pics noticing an odd \"bubble like\" object that kind of bounced in front of the huge glowing moon.  It would be in front of the moon for a second..then to the right side diagonally and then in front like it was closer to me.  This lasted about 15 min.'s. In the beginning I thought maybe it was my camera reflecting the brightness of the illuminated moon. I wiped the lense over and over.  The object was still the same shape and continued to become clearer.  It appeared to look like a star when I looked by eye and when I looked through the camera on my phone, which was magnified it looked to be a clearish blue-tinted bubble and then turned a pale pink. I believe there were two objects but the other disappeared and I was only able to really capture this single object.  The photos are taken with 3 seperate apps but same cell phone. I cannot say what this was that I saw and I have no opinion to voice. My friend and I were wondering if anyone else could shed some light on this \"very cool\" occurance.  So glad I was able to share my pics. Thank you.",
      "link": "http://www.nuforc.org/webreports/122/S122443.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4fa6",
      "summary": "No craft just a long white smoke (thin white cloud) trail.  ((NUFORC Note:  Possible contrail?  PD))",
      "city": "fontana",
      "shape": "",
      "date": "2016-02-26T00:00:00",
      "story": "No craft just a long white smoke (thin white cloud) trail. Peter Davenport UFO Report:\t\t\t\t  Woke up around 3:30 AM, Tuesday morning, 2/23/15. Looking out my south facing bedroom window; I saw a white smoked trail going from east to west or from west to east.  This was In the San Bernardino area to Los Angeles area.  Not sure what it was. Thanks!  Just thought you might want to know.",
      "link": "http://www.nuforc.org/webreports/126/S126015.html",
      "state": "CA",
      "duration": "1 hour?"
    },
    {
      "_id": "64d005f478aba2ec5a3c6824",
      "summary": "Round orb yellowish in color kept moving from side to side and apearing and disapering",
      "city": "fontana",
      "shape": "sphere",
      "date": "2017-04-13T00:00:00",
      "story": "Round orb yellowish in color kept moving from side to side and apearing and disapering Looked like a round orb yellowish in color.  Fist noticed in northern part of sky.  Fist caught my attention when it moved side to side then stopped.  Then disappeared and re appeared again. the totally disappeared when I zoomed in on it like it knew I was wanting a closer look. never seen again.  Have it on my camcorder right as it was zoomed in on and when it disappeared.  No clouds and there was a clear sky.",
      "link": "http://www.nuforc.org/webreports/133/S133555.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7391",
      "summary": "White light moved like shooting star till it shoot back then way it came 1 man shocked by what he just saw",
      "city": "fontana",
      "shape": "light",
      "date": "2017-06-02T00:00:00",
      "story": "White light moved like shooting star till it shoot back then way it came 1 man shocked by what he just saw I was outside having final cigarette before going to bed, I always look at the stars at night, I noticed what appeared to be a shooting star, the closer it came the brighter it got, I was getting excited cause it looked like it was go to pass over me, that would be the first time that happen, but it shoot back in the way it came in a flash.  Never seen anything like it.  No plane moves that fast so it is a unidentified flying object.   I still don't know how to wrap my mind around what I just saw.  I'm so sorry to all the UFO people I doubted and laughed at. If your seeing regularly then all I can say is wow",
      "link": "http://www.nuforc.org/webreports/134/S134204.html",
      "state": "CA",
      "duration": "33 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f69",
      "summary": "Four rectangular lights moving up and down like a snake would travel",
      "city": "fontana",
      "shape": "unknown",
      "date": "2018-05-04T00:00:00",
      "story": "Four rectangular lights moving up and down like a snake would travel. On the night of 05/03/2018, I saw two sightings, both times the shape of the light emitted from the object was the same. First one was heading north as me and my friend looked eastward. The second we were facing south and the object was heading west.  The light was 4 rectangle lights going up and down like a snake slithering.  It looked like notes on music sheets dancing in sync up and down. I was with a friend and we both confirmed what we just witnessed to ourselves. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139720.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c84b4",
      "summary": "Saw flashing lights reflecting on my window, it stopped flashing and took the shape of a fireball that dropped smaller flashing lights.",
      "city": "fontana",
      "shape": "fireball",
      "date": "2018-10-06T00:00:00",
      "story": "Saw flashing lights reflecting on my window, it stopped flashing and took the shape of a fireball that dropped smaller flashing lights.",
      "link": "http://www.nuforc.org/webreports/143/S143341.html",
      "state": "CA",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b4f",
      "summary": "Looking west, very low in the sky ( if I compare it most of the planes that go to and from the airport we have nearby),  I noticed a br",
      "city": "fontana",
      "shape": "changing",
      "date": "2019-03-14T00:00:00",
      "story": "Looking west, very low in the sky (if I compare it most of the planes that go to and from the airport we have nearby),  I noticed a bright white light racing across the sky heading north.  I did not think it was a shooting start because it was closer than I had ever seen one before and it did not leave the bright trail of light  behind it ....at first.  Seeing it at first I thought it was an airplane and was concerned at tithe fact that it seemed to be traveling much faster than any plane I had seen, so my next thought was that it might be in trouble and perhaps going to crash.  After a few more seconds I observed the light produce two more smaller lights that seemed to break of or fall of the original one.  The two lights each went off in different directions then disappeared soon after.  The original larger white light began changing color from a blue green hue to almost all green and gave off a flickering or kind of flashing light display and seemed to be sl! owly of fading (or what I’d picture sputtering to look like), still heading north it seemed to descend as it sputtered out and soon disappeared.  Once it had began changing color from the white to the green and gave off a lighter green aura around it   I noticed it had also started to produce a trail of light behind it, just like I’ve always seen accompanying shooting stars but much more colorful, brighter, and larger than any I’ve seen before.  Could very well be a shooting star or many other perfectly normal explanation for it but I thought I’d post in the case that it’s  not.",
      "link": "http://www.nuforc.org/webreports/145/S145112.html",
      "state": "CA",
      "duration": "~1 minute"
    }
  ]
}