{
  "city": "fortlauderdale",
  "fetch_timestamp": "2025-07-12T14:37:15.836985",
  "record_count": 91,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4210",
      "summary": "On March 15th at 1052pm I witnessed an unusual object while viewing a live camera feed. It was east of the FLL airport. The object was",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2019-03-21T00:00:00",
      "story": "On March 15th at 1052pm, I witnessed an unusual object while viewing a live camera feed.  It was east of the FLL airport.  The object was spherical and bright white.  It seemed to pulsate. It descended and levelled out, floating very rapidly from the East to the ENE.  It was confirmed to not be an aircraft on radar.",
      "link": "http://www.nuforc.org/webreports/145/S145228.html",
      "state": "FL",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4348",
      "summary": "RED FLASHING LIGHTS WITH A ZIP OF LIGHT GONE WITH GAS CLOUDS OF RED AND GREEN IN FT LAUDERDALE",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "RED FLASHING LIGHTS WITH A ZIP OF LIGHT GONE WITH GAS CLOUDS OF RED AND GREEN IN FT LAUDERDALE WE WERE ON OUR BOAT IN FT LAUDERDALE LOOKING AT THE PLANES COME IN I SAW RED LIGHT GOING IN A CIRCLE WE WERE IN DENILE THINKING IT WAS A PLANE BUT PLANES HAVE HEADLIGHTS AND BLINK RED AND GREEN ETC THEN ALL OF A SUDDEN IT STARTED TO ZIP AROUND AND WE KNEW IT WASEN'T A PLANE. THAN IN A ZIP IT WAS GONE. A FEW MINUTES LATER YOU SAW DEEP DEEP IN THE SKY CLOUDS OF RED AND GREEN IT WAS COOL BUT WE WERE SCARED AND WENT BACK INTO PORT",
      "link": "http://www.nuforc.org/webreports/049/S49596.html",
      "state": "FL",
      "duration": "10 MIN"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a46",
      "summary": "Red gas emitting from bright yellow light UFO",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2019-07-05T00:00:00",
      "story": "Red gas emitting from bright yellow light UFO Tuesday 6/25  Walking by Sea Spray Inn in Fort Lauderdale with a friend when we see a big yellow light in the sky, emitting a red gas coming out of it.  It was thin like gas coming out of the bright yellow light.  The yellow light then had another yellow light come from behind and went fast towards the right (going east).  Both lights then disappeared.   Me and my friend then proceeded to walk more east towards the beach when then we saw another 2 yellow lights this time closer to ground, then both disappeared again.  Both times the lights seemed sort of close but far somewhere out there in the stratosphere.",
      "link": "http://www.nuforc.org/webreports/147/S147139.html",
      "state": "FL",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cea",
      "summary": "Triangle shaped, 3 lights flashing red from a distance, looked like a bright star in the sky.",
      "city": "fortlauderdale",
      "shape": "changing",
      "date": "2019-06-07T00:00:00",
      "story": "Triangle shaped, 3 lights flashing red from a distance, looked like a bright star in the sky I was walking home from dinner with sister my 9 year old daughter.  We live one block from the beach in Fort Lauderdale.  There are multiple ways to go home but it was such a beautiful night we decided to walk along the beach last night.  My daughter saw a VERY BRIGHT STAR (as we were walking north towards our home).  My sister jokes that it’s not a star but a planet. We saw another similar looking star not far away start to move -?we assumed it was a plane because we are about 20 minutes from the airport. However the airport is South of us & remember we are headed north.  No big deal at the moment... then the bright star began to move we thought it was our imagination so kept walking home.  My sister has a headache so we rushed back to our condo because friends were coming to meet us by the beach.  As I was coming out of my bathroom my sister screamed that as our friends were walking along the beach to us (2 miles south) they captured glowing flying objects in the! sky - our friend happens to believe in aliens & UFOs.  All of us do, however we didn’t assume that’s what they were at first.  We went back to the beach out of curiosity. All 3 of us climbed into a life guard stand facing the ocean to get a better look - sure enough we saw the flying glowing wings objects overhead.  One few over us and we could clearly see 3 lights in a triangle formation.  The lights looked read from a distance (almost like a ball of fire that has been contained).  They seemed to communicate with us on the ground & to each other through these lights.  The strange thing is that none of these large objects made any sound - we have the Airshow every April in Ft Lauderdale & it is extremely loud & noisy.  Furthermore, one object would stop & literallyvresemble a very bright star then wait for a few more to meet up & move together in unison.  No matter how many of these objects were in the sky at once... we watch from my balcony facing the intercostal an hour later - ! they never crossed paths. We took 5 videos on social media sho! wing pro of of these lights .  I watched other videos on YouTube & various news sources from others.  They look EXACTLY the same as ours.  This went in for 3 hours. Then we noticed they appeared to be landing behind the Las Olas bridge one after another. I would say without exaggeration at least 25-30 kept waiting them disappear and another one would show up. The oddest thing was before we left the beach there was a silent one that started water skiing it was also silent but had the 3 lights & it changed shape.  Since all we had were street lights... I could see waves follow it however it was completely quiet. Nobody water skis with only 3 small lights at 11pm.  That isvwhen they sharks come out. We know what we saw...  it was exhilarating yet mysterious.  We didn’t feel that there was any harm meant for us.  Now with all these other sightings world wide I would like some answers please & Thabk You for reading my report if you made it this far.  Cheers.",
      "link": "http://www.nuforc.org/webreports/146/S146557.html",
      "state": "FL",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b51a6",
      "summary": "Object shot across sky,  then came to complete stop and began glowing, and growing in size,.",
      "city": "fortlauderdale",
      "shape": "cigar",
      "date": "",
      "story": "Object shot across sky,  then came to complete stop and began glowing, and growing in size,. We were sitting on our front lawn, enjoying the early evening air, when suddenly a streak of light  appeared above us. It was a cigar shaped object and it came to a complete stop, hovering in the air. As it did so, it started to grow and mushroom in size, throbbing and glowing circles of light around it. First one circle of light, and then another like as if you throw a stone in a lake and there is a ripple effect all around the stone. This is how the light grew around the object. We were not able to fully observe as we were scared, and ran inside the house away from it. We were both very well balanced people, never had taken any drugs at the time and entirely health concious vegetarians. Being so healthy inclined, we were not hallucinating. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63273.html",
      "state": "FL",
      "duration": "3mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b51ef",
      "summary": "Slow moving classic disc 50ft up",
      "city": "fortlauderdale",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "Slow moving classic disc 50ft up Date is approximate(I chose this date as a very similiar report has this date) also actual city was West Hollywood which is a surrounding area of Fort Lauderdale. I was about 12 or 13 at the time.  I was riding my bicycle up and down the street in our apartment complex, which was approx. 1/3 of a mile long.  From the North end of the street a \"classic flying saucer\" came hovering over the tree line about 40 to 60 feet high. It was like right out of the movies, a metallic disc with colored lights rotating around it (I'm colorblind so sorry I can't tell you the colors).  Diameter was about 30 to 40 feet, 10 to 15 feet in height symetrical top and bottom.  It made no noise. At the time I was not scared, but only interested and I followed it from one end of the street to the other.  I literally road my bicycle under it the entire length of the street (1/3 mile) which it strangely hovered directly over seeming to follow the road.  I was easily able to keep pace with it so I estimate its speed at no more than 15 MPH.  At the end of our street I stopped and watched it continue on at the same pace.  Because of its low altitude it disappeared from view before to long. At that time the Goodyear blimp was a regular sight in Lauderdale and TV/movies portrayed UFO exactly like this one; so even at that young age I was skeptical, thinking that this was to good to be true.  I figured I would hear of a hoax or some explanation.  That never happened.  Now as I've grown older I realize the importance and significance of such a \"clear and close\" sighting.  I will try to send(email) more info(map and illustration), Thanx ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62915.html",
      "state": "FL",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b56a7",
      "summary": "fast moving light, not flashing or blinking(excluding it being an airplane), turned quite sharply (est. 70 degrees)",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "fast moving light, not flashing or blinking(excluding it being an airplane), turned quite sharply (est. 70 degrees)",
      "link": "http://www.nuforc.org/webreports/051/S51712.html",
      "state": "FL",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5aaf",
      "summary": "Object Seen In Florida",
      "city": "fortlauderdale",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "Object Seen In Florida We were on our way to the HardRock Casino.  We parked on the top of the garage...the very top level.  We were about to get out of the car when we  looked up in the sky and at first I saw a light.  It was a clear night.  We noticed it was not a plane and it was not a star.  At first it was hovering in the air, then it became clear to see it was an object and it had a shape. It started to move left to right and back and forth for a few seconds...then it disappeared behind a cloud.  Then it came from behind the clound.  It was dark ...its shape was like a saucer.  I tried to reach in the back seat of the car to get the video camera, but as soon as I was about to press the record button...the object started to leave.  It was very visable until we got the camera out.  It seemed to fade away after I was about to get it on video.  Then it took off at an unblievable speed.  At that exact moment, it started to thunder and rain.  From the same cloud it disappeared behind, came a lightening.  It only rained for only about one minute.  Its rare for it to rain in Florida at that time of day. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58332.html",
      "state": "FL",
      "duration": "2min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5aca",
      "summary": "object vented some type of vapor and left a cone shaped vortex when it left the atmosphere",
      "city": "fortlauderdale",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "object vented some type of vapor and left a cone shaped vortex when it left the atmosphere Two days before Hurricane Francis came ashore in south Fl. I was preparing my home and property for the storm. As I walked around my pool, I noticed off to the west what I thought was just a bright star and only looked at it for a second as I was quite busy. A few minutes later I thought to look at it again just because it was so bright. This time it appeared much closer so I watched it for a moment. It was a clear evening with just a few puffy white clouds moving to the west and I knew this was an object other than a star because it was moving to the east, towards my location. I called into the house for my wife and friend to step outside and watch the light. It got to within I would say a mile off where I was and it height was below the level of the clouds as I noticed one pass behind what ever it was I was looking at. It slowed to a stop and began to hover and then it went dark. We could tell there was something there but even with binoculars we could not make out the shape of the object. There was no sound that we could connect with the object but it was right in the middle of a large residential/commercial area and within a mile of the executive airport. What really got us a little freaked out about it was when the object began to expell some sort of mist or fumes that took the form of wings or some type of venting and both of the flumes, for lack of a better word, were huge. I estimate they were more than 100 yards one off to each side of the object. After 15 minutes or so, the craft moved off to the north and appeared to be going higher. As it disappeared out of site a cone shaped, I want to say vortex, appeared way up in the sky about where we last saw the craft. THe point of the cone was pointing towards space but angled off to the north a bit. I have no clue what this could have been but it was truly a life changing experience for me as it has truly opened my mind far beyond what I would have previosly considered within the realm of possibilities. ((NUFORC Note:  Date of sighting may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54315.html",
      "state": "FL",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f17",
      "summary": "1969 summer Ft. Lauderdale spiraling pinpoint of white light, spirals across the night sky with neon green cloud alongside.",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2008-01-21T00:00:00",
      "story": "1969 summer Ft. Lauderdale spiraling pinpoint of white light, spirals across the night sky with neon green cloud alongside. I was 15 and living with my married sister (26) while she was pregnant in a residential area of Fort Lauderdale, FL near the inter-coastal waterway. We went into her backyard, behind the pool to steal lemons off of her neighbor's lemon tree.  It was dark and a clear night. My sister exclaimed & grabbed my arm & pointed up towards the sky.  STRAIGHT UP was the brightest white light I'd ever seen (brighter than a Klieg light), a pinpoint of white light that spiraled out in lines that were so even they could have been made with a 'compass'... the pinpoint of light continued to shine as the spiraling lines filled the entire upper horizon... but what was odd is that we could see through the widening white, spiraling lines... we could see the starry sky through the widening white lines.  Next to the pinpoint of white light was a neon green cloud.  A cloud, like a white cloud you'd seen on a blue-sky day, except this cloud was green and it glowed like a green neon sign.  We both stood there with our mouths agape and watched this entire phenomenon for about 2 minutes... the white, transparent, WIDE spiral lines filled the entire upper horizon and then the white pinpoint just stopped emanating light and the green cloud took a few more minutes to fade away.  Apparently, thousands of people in Ft. Lauderdale saw this and called into police.  NASA claimed the next day that it was a 'reflection off of a rocket that was shot over the ocean... as the sun was going down.'  The only problem is, it was DARK, it was 8:30 PM and the sun sets on the Gulf/west side of Florida.  We were on the east side of Florida, quite close to the Atlantic ocean (perhaps 1 mile).  There was no way this was a reflection off a rocket as it was STRAIGHT UP and the pinpoint of light was emanating from above the earth (from space) and it shown down to the atmosphere where it spread out across the entire upper sky.  In my opinion, some superior visitors were taking a very large 'photo' of the area.  The green cloud was translucent.  The white spiral lines were transparent.  I work in the film business and there is no light we have today that is as bright as the pinpoint of very white light was. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60980.html",
      "state": "FL",
      "duration": "3--5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6061",
      "summary": "lights by my bedroom window",
      "city": "fortlauderdale",
      "shape": "",
      "date": "2008-02-14T00:00:00",
      "story": "lights by my bedroom window i told people about this before then seen someone else have had the same encounter. i was about six years of age around chrismas i was sleep one nigth when a green flashing light was coming from my bedroom window. When i looked outside i saw a shape of a man but it was glowing green light flashing on and off. it stood right in front of me. i tapped the window and said hey..hey.. it turned around and walked into the bushes. i ran to my mom room beating down the door. she looked but it was gone, still till this day my mom dont belive me. but to day i was just looking at your reveiws and the same thing i told my mom for all these years the exect same thing happen to someone else.... ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60323.html",
      "state": "FL",
      "duration": "lights"
    },
    {
      "_id": "64d005f478aba2ec5a3b6751",
      "summary": "red blinking object..very small moving at steady speed..then vanished",
      "city": "fortlauderdale",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "red blinking object..very small moving at steady speed..then vanished I was driving home heading north on I 95 when I looked into the sky and saw a blinking red light.  It was moving at a steady pace and it wasn't loud as if it were a plane or helicopter.  It was a lot smaller than either of them.  I thought maybe I had seen a one of those blinking tower lights flashing, but once I focused on the red flashing object and realized it wasnt a blinking light from the electric poles, it vanished into thin air.",
      "link": "http://www.nuforc.org/webreports/062/S62060.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c26",
      "summary": "red ball of light with orange tail then vanshed",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2008-03-31T00:00:00",
      "story": "red ball of light with orange tail then vanshed Heading east bound on interstate 595 saw a ball of light with a orange tail behind it watched it for a minute or two before the orange light went away and it became a red ball of light. Then proceeded south on interstate 95 where the object stayed parallel with our vehicle. It was about 5,000 feet in the air and really bright The red ball of light stayed with our car as we were watching it to our east. All of a sudden as were staring at this ball of light we see a small orange glow from behind it and the red ball of light disappeared into thin air on a cloudless night. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62198.html",
      "state": "FL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c70",
      "summary": "On January 28, 2008 at approxmently 0955, I was driving north on A1A from Sunrise Blvd to 2100 block of Ft Lauderdale, Fla.  It is a cl",
      "city": "fortlauderdale",
      "shape": "cylinder",
      "date": "2008-02-14T00:00:00",
      "story": "On January 28, 2008 at approxmently 0955, I was driving north on A1A from Sunrise Blvd to 2100 block of Ft Lauderdale, Fla.  It is a clear blue sky day and the highway is next to the Atlantic Ocean.  The ocean was calm and less than 12in waves crashing the shore.  Out to sea, I could see three large freighters anchored off of Port Everglades, approx three miles off shore. Some small recreational boats numbering less than 5 were crossing the horizon heading north and south and out to sea to weed line for fishing. Out to the NE I would guess approxmently 7 to 10 miles I could see two very large standing tall white cylinders and two to three white cubes next to the cylinders.  It looked like tall buildings out in the ocean; I would say that they were 8 to 12 stories high and 4 stories wide. The 2 to 3 cubes were ½ the size.  There are no oil rigs off of Broward County; this was not a ship, a cruise ship, boat, and water spout or condominium refection from the shore line.  I don’t know what it was, but it was out there, on the ocean like a city on the sea.",
      "link": "http://www.nuforc.org/webreports/061/S61267.html",
      "state": "FL",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f9d",
      "summary": "Blue lights seen hovering 300 -400 feet above westbound lanes of I-75.",
      "city": "fortlauderdale",
      "shape": "unknown",
      "date": "2008-04-17T00:00:00",
      "story": "Blue lights seen hovering 300 -400 feet above westbound lanes of I-75. Monday, March 31st 2008  On the evening of March 31, 2008, I traveled west via I-75. I had left a softball game in Davie, FL to return to my home to Naples, FL. I was traveling westbound to Naples, FL on Interstate 75, otherwise known as Alligator Alley, as I neared exit 49, I thought I was seeing an airplane traveling at a very low altitude. I noticed lights in the sky just beyond the overpass, when I came to the other side of the overpass; I realized that this was not any airplane. I saw an object with four bluish lights on four corners, like the shape of a square or a cross. Since it was dark, I did not see the exact shape. The object was about 300 - 400 feet above the ground and it did not travel at the speed of an airplane, instead it hovered over a certain area. It caught my attention because it hardly moved. I drove directly underneath the object. It covered the two westbound lanes of the highway and half of the median. I continued on and did not stop because I got scared. I looked at my car radio and it was exactly 11:50 PM. What I saw was not anything I have ever seen. I am very confident that I seen a UFO. I wonder if anyone else seen what I did because I was not the only one traveling on that road that night.",
      "link": "http://www.nuforc.org/webreports/062/S62483.html",
      "state": "FL",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b726d",
      "summary": "Stationary triangle shaped light seen over Ft. Lauderdale beach area. Seen east (away from the sea). Estimated altitude 3,000 feet.",
      "city": "fortlauderdale",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "Stationary triangle shaped light seen over Ft. Lauderdale beach area. Seen east (away from the sea). Estimated altitude 3,000 feet. At about 9:15 PM (23:15 hrs.), I and other two witnesses (wife and nephew) saw a bright white-yellow triangle shaped light (brighter than any star or planet at that time in the sky (as an amateur astronomer, I am familiar with the position of major stars and planets for that date in the sky). The light maintained its position for about 15 minutes and later disappeared. No aircraft navigation lights were observed, and no sound was heard from the object ( I have a degree in aeronautics, and I am familiar with most military and commercial aircraft configurations).",
      "link": "http://www.nuforc.org/webreports/057/S57922.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b751b",
      "summary": "Iluminated straight line in clear blue sky",
      "city": "fortlauderdale",
      "shape": "other",
      "date": "2007-04-27T00:00:00",
      "story": "Iluminated straight line in clear blue sky 04/08/07 Time 3:20 pm Location East Ft Lauderdale Florida Weather Conditions: The sky was perfect and blue. Not a cloud in sight and there was no sun to obstruct my view.  As I was lying out doors in my back yard on my back and looking directly straight up into the clear blue sky I noticed an illuminated thin straight line that appeared directly in my site of view. It shined for a second and looked like it was glass or metallic. At my first sight of the illuminated line it was vertical. It then switched to a horizontal position in a split second and was about 1/4 to 1/2 of an inch in length against the blue sky. I watched the horizontal illuminated perfect straight line tilt up on its right side and move up and down and to the left and to the right. Then I watched it tilt up on its left side and move around the same way. It moved with such speed and accuracy I have never seen anything like this before in my life. It then leveled off to a horizontal position, hovered for a second and then took off crossing the entire south side of the sky in a split second. It had easily covered a 180 degree angle if not more. The object was always a perfect straight illuminated line and never did it bend. It broke every law of physics regarding speed and flight capability. I am very lucky, honored and privileged to have experienced something of this magnitude in my life time. It was truly something that was NOT even close to being of this world or man made. The object sighting lasted for about 5.5 to 6 seconds. If one wasn’t looking into this exact section/area of the sky at this exact moment one would not be able to see what I saw. It was not visible to all. You really had to be focused on that exact area. The speed of the object was like taking a laser pen and pointing it against a wall and moving it rapidly around up and down to the left and to the right. It was moving that fast in the sky. This is only something one could see if they were watching a sci- fi movie. The technology we have in our armed forces and in this world today are (stone- aged) compared to what I have witnessed and I would take a polygraph test 100 times just to prove what I saw was in fact real.   I am so happy and excited that I was able to witness such an extraordinary event in my life time and it was even on Easter Sunday 2007. Thank you,  MH",
      "link": "http://www.nuforc.org/webreports/056/S56161.html",
      "state": "FL",
      "duration": "5.5 to 6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b768e",
      "summary": "On a cruise saw three whirling lights formed in a triangular figuration.",
      "city": "fortlauderdale",
      "shape": "triangle",
      "date": "2006-12-07T00:00:00",
      "story": "On a cruise saw three whirling lights formed in a triangular figuration.",
      "link": "http://www.nuforc.org/webreports/053/S53496.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b794b",
      "summary": "Very dim v shape object travelinf sw fast across the sky in Ft Lauderdale 2/22/07 8:25pm",
      "city": "fortlauderdale",
      "shape": "triangle",
      "date": "2007-03-08T00:00:00",
      "story": "Very dim v shape object travelinf sw fast across the sky in Ft Lauderdale 2/22/07 8:25pm On Feb 22, 2007 at 8:25 pm on a boat in Ft.Lauderdale.  Looking at the stars we saw a very dim set of lights that moved quickly across the sky.  It was traveling S-Saw what looked like a dim red color.  The shape was V but not in perfect form, more like a flock of birds flying.  It moved from the north star to what I believe to be Venus (S of north star) and disappeared.",
      "link": "http://www.nuforc.org/webreports/055/S55429.html",
      "state": "FL",
      "duration": "4sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b79fe",
      "summary": "Burning fireball shoots through northern sky over Florida",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2007-03-08T00:00:00",
      "story": "Burning fireball shoots through northern sky over Florida My bf and I were walking back to our hotel at approximately 11:00 at nite when I saw what looked like a fireball with a glowing, burning tail trailing behind it flying through the sky at a very fast speed. I pointed it out and asked him what it was because I knew it was not a plane but it seemed too large and bright to be a shooting star.  He replied he did not know and we ran to keep watching it as it disappeared behind the view of building but it was gone.",
      "link": "http://www.nuforc.org/webreports/055/S55469.html",
      "state": "FL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f0f",
      "summary": "Light cought on secuaret camery",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Light cought on secuaret camery I hade my vcr recording my front door secuarty camera from 1 am to 7:30 am. When I looked at the tape I found I have a light rase up over the roof and move out ond up.No sound on can be herd.I have the tape and woule like for someone to see what thay think. Maby a plane I cant tell and I have never seen it before.",
      "link": "http://www.nuforc.org/webreports/072/S72755.html",
      "state": "FL",
      "duration": "20 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b8ba5",
      "summary": "Crystal sphere no sound over Fort Lauderdale and Miami Airport",
      "city": "fortlauderdale",
      "shape": "sphere",
      "date": "2010-02-14T00:00:00",
      "story": "Crystal sphere no sound over Fort Lauderdale and Miami Airport It was 8.05 PM  September 28 2009 when i was outside with my friend next house sitting and smoking when my friend told me look this plane it s not suppose to pass this way.cause we are just by the airport and the runaway go to est-west and no airplane can cross north south or south north it s forbidden. This with light was very bright all around and under not just on the front.It was looking like a big ball of Crystal  We noticed it was moving from NW sky heading SE. It was moving at a steady speed and past just over the Fort Lauderdale airport and crossing the runaway  at maybe around 4 or 5000 feet in a steady slow speed (maybe 100Mph.)the size of the object was almost about half size of a regular commercial air line plane. No noise no green light no red light no withe strobe.  Something strange there s normally always many airplanes around that we can see  but during all the time about 3 minutes that this object was passing  there was no airplane around son after this object reach this ocean  we can see many airplane come back  around again. It was like if they were advise to not come around during the object was passing. Thanks for reading.  Jack scott    Here a copy of somebody who saw the same thing of me 10 minutes after over the Miami airport.    At approximately 8:15PM on 9/28/09 I walked out and as usual I looked up into the evening sky.  I observed a very bright light in the northeastern sky moving in a southerly direction. What made this unusual was the fact of how bright the light was. My first impression that is was an aircraft, since I live about 6 miles from the Miami International Airport. The best description of intensity of the light that I can describe is that of Venus in the night sky.  As I looked at it more closely, I could see no navigational markers (red, green or flashing strobe) visible. During the duration of the sighting I heard no noise from the object.  The speed of the object was that of a jet flying at altitude, but the altitude was much lower, maybe 10000 ft (but that is just a guess since it was difficult to determine since it was dark).  Living as close to the airport as I do, I am familiar with the flight patterns of aircraft. This object appeared to fly directly over Miami International Airport which is unusual again based on the objects apparent altitude. Another oddity observed was during the sighting no aircraft were visible either landing or taking off.  The object continued on its southerly course and made a turn to the east. Even when it made its turn the intensity of the light remained constant. IF it had been an aircraft I would have noticed its national markers. One other note was as I watched it make its easterly turn; I noticed an aircraft to the southeast and its navigational beacons where quite visible. Once it made its turn, I moved to follow the object but lost it between tress and other houses.",
      "link": "http://www.nuforc.org/webreports/073/S73698.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ea0",
      "summary": "3 UFOs seen around Fort Lauderdale, Florida, USA.",
      "city": "fortlauderdale",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "3 UFOs seen around Fort Lauderdale, Florida, USA. Yesterday, 15-Sep-2008, at 7:30 pm EST, I was out in Fort Lauderdale's State Route A1A and Las Olas Blvd. beach, more precisely at Lat 26°6'49\"N and Lon 80°6'17\"W, getting ready to photograph the rising of the moon expected to happen from that point at Altitude 14.3° and Azimuth 93.1° E of N.  The sun at that time and location was at Altitude -17.7° and Azimuth 281.8° E of N. Slightly north of the moon's expected rising point, at about 80° to 75°Azimuth, I saw what at first I thought were Venus and Mercury in a formation I saw two years ago in Bogotá, Colombia, when Mercury was seen above and to the left of Venus in the city's southern night sky.  Yesterday's \"Venus,\" however, was unusually large, round and bright, and \"Mercury\" moved quickly in an up-and-to-the-left motion, right before I aimed my Sony DSC-F828 camera towards my \"planets\" and took several pictures, e-mailing separately:  DSC00066: At 7:39 pm \"Venus\" is bright and clear above a cloud formation that has two horn-like extensions on top.  \"Mercury\" is no longer white, it is now a yellow moving element as it moves away quickly in an up-and-to-the-left motion from its previous position above \"Venus.\"  Neither \"Venus\" nor \"Mercury\" have strobe red and bluish-white lights which would identify them as commercial aircraft, approaching FLL's international airport.  At the lower-left, another yellow light is seen. DSC00067: Still at 7:39 pm, \"Venus\" is at its same position above the cloud and the yellow light from DSC00066's lower-left area begins to move rapidly in an upward direction. DSC00068: Still at 7:39 pm, I zoom in into \"Venus\" and my camera's automatic focus, without clear referencing points, blurs the picture. DSC00069: Now at 7:40 pm, I still cannot get my camera to focus correctly, \"Venus\" has not moved from its original position. DSC00070: Still at 7:40 pm, I zoom out as \"Venus\" shoots up and to the left, caught here emitting white light from its bottom and yellow light from its top.  Two small lights to its right and one more small white light to its left suggest a wide, round, dish-like aircraft, producing a powerful white radiant light from its bottom and two also strong lights from its top. DSC00071: Still at 7:40 pm, \"Venus\" holds still before disappearing in a fast, upward motion. DSC00072: At 7:41 pm, that is the moon.",
      "link": "http://www.nuforc.org/webreports/065/S65708.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b98f0",
      "summary": "Two stationary lights off Fort Lauderdale",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "Two stationary lights off Fort Lauderdale I was sitting at restaurant on Fort Lauderdale Beach facing the ocean and saw a stationary white orb over the ocean.  It appeared to be far out to sea. (Eight or ten miles or more.)   At first I assumed it to be an approaching aircraft but it did't move at all which drew my attention. It was completely stationary, which is impossible even for a helicopter.  It was absolutely stationary for about 10 minutes, then another orb appeared as if it were a light being turned on. The second orb was identical to the first and appeared to the right and slightly higher than the first.  They both remained completely stationary in relation to the surface of ocean and to each other. No way these were stars.  It was still light out and slightly hazy and the objects were slightly above the ocean. There were literally thousands of people in and around the beach so others must have seen it.  I took a picture with a hi res SLR camera but the lights were so far out to sea that they look like two white dots then moved on.  A short time later I looked again but the lights were gone. This is the second time I have seen something weird in the sky.  The first was in 1986 or 1987 and that was a completely different object.  Wondering if anyone else on the beach saw these objects. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75175.html",
      "state": "FL",
      "duration": "20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b59",
      "summary": "Black triangle observed from commercial aircraft passengers a short time out of  Ft Lauderdale, Fla",
      "city": "fortlauderdale",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Black triangle observed from commercial aircraft passengers a short time out of  Ft Lauderdale, Fla I was on a continental flight, a short time out of Ft. Lauderdale, FL.  I observed a very black dot above the clouds, out the right side of the aircraft.  It looked like it was expanding, and became a very black triangle, it appeared to be several miles away.  It seemed to not move for 3-5 seconds then turned to a black line going the opposite direction of our aircraft.  I showed my wife the triangle and tried to get some pictures with our digital camera, but only show the black streak.   The visibility was good and we were at 37000'.  I spoke to the pilot about it when we landed in Newark, but he did not see it, or know anything about it.",
      "link": "http://www.nuforc.org/webreports/067/S67695.html",
      "state": "FL",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c9e",
      "summary": "Neon Blue UFO",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "Neon Blue UFO Driving south on North federal highway @ Broward Blvd. intersection.  Bright neon blue sphere seen south with purple trail traveling from west to east @ a very high rate of speed.  Twice the size of a 747 aircraft and traveling approx. 6 times faster @ a downward angle as if headed into the ocean.",
      "link": "http://www.nuforc.org/webreports/067/S67530.html",
      "state": "FL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d41",
      "summary": "Brilliant Blue object seen by dozens @ low altitude.  Appeared to me to be in U.S. Airspace",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "Brilliant Blue object seen by dozens @ low altitude.  Appeared to me to be in U.S. Airspace 17 witnesses at this website:  I've also reported this once before but, thought you might like to read other witness accounts.  A boater appeared to be closer to the object clamming the front of the object was flat.  Here are the posts  http://www.topix.com/forum/city/sarasota-fl/TONAOR9T82GKBVJ1I#lastPost   I witnessed the event @ North Federal Highway & Broward Blvd. intersection in Fort Lauderdale.  If you happen to be looking south there was no way you could have missed it.  That thing was big!",
      "link": "http://www.nuforc.org/webreports/067/S67608.html",
      "state": "FL",
      "duration": "1.6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d3e",
      "summary": "Fort Lauderdale streaking light.",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Fort Lauderdale streaking light. I was walking along US 1 before the Las Olas intersection, and saw a bright streak of light moving horizontally towards Fort Lauderdale airport.  It was a greenish hue, and was moving very fast.   I've seen many jet fighters, but this was moving far faster than anything I've ever seen.   I couldn't hear any noise. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67521.html",
      "state": "FL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e31",
      "summary": "The UFO was a flashing color in the northwest direction. It was flashing colors such as blue, green, red, and yellow. It started around",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "The UFO was a flashing color in the northwest direction. It was flashing colors such as blue, green, red, and yellow. It started around 10:00 p.m. EST and has not stopped yet. It is not moving that can be noticeable to the eye. I used binoculars to get a closer look but still appeared to be to far away.",
      "link": "http://www.nuforc.org/webreports/075/S75279.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9ed8",
      "summary": "Strange black object flies inland from ocean preceding sunrise",
      "city": "fortlauderdale",
      "shape": "unknown",
      "date": "2010-06-03T00:00:00",
      "story": "Strange black object flies inland from ocean preceding sunrise My girlfriend and I walked out to the beach this morning to watch the sunrise. It was approximately 15-20 minutes before actual sunrise, when the sky was just lighting up, very clear out, we were standing in front of the Westin on A1A just north of Las Olas Blvd. We got to the water's edge and after a couple seconds I looked up and my eyes immediately fixated on something moving across the sky. It's very difficult to describe what we saw. The object was black - at first I thought it might be a bird very high up, but I couldn't discern any wings flapping, it just looked like a solid object moving slowly over the ocean, over and past us and continuing inland. There were no flashing lights, and as there were quite a few planes on the horizon, it was quite easy to see that this was not one of them. It was hard to focus on also, it seemed far away but quite low at the same time; for a second I actually thought it sort of looked like a person flying, but I dismissed this for obvious reasons. My girlfriend described it as \"an asymmetrical rectangular blob floating westward, not like a bird that varies direction and flaps its wings, but more like a balloon\". Very creepy, no sound at all, and again this thing flew in from the ocean, maybe 1,000 ft (?) up, and proceeded inland. There were several planes on the horizon, several miles away and clearly discernible as conventional aircraft. The object that passed above us most definitely was not.",
      "link": "http://www.nuforc.org/webreports/075/S75593.html",
      "state": "FL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba014",
      "summary": "Round with bright lights.",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2009-06-09T00:00:00",
      "story": "Round with bright lights. Outside of the mall up in the sky big round with lights that where blue and white.",
      "link": "http://www.nuforc.org/webreports/070/S70158.html",
      "state": "FL",
      "duration": "sawgrass mall"
    },
    {
      "_id": "64d005f478aba2ec5a3ba260",
      "summary": "Long cone shaped yellowish-green light beam projected from clouds to Ft. Lauderdale, Florida",
      "city": "fortlauderdale",
      "shape": "cone",
      "date": "2008-08-12T00:00:00",
      "story": "Long cone shaped yellowish-green light beam projected from clouds to Ft. Lauderdale, Florida Driving North on I-95 between South Beach, Miami, Florida and Deerfield Beach, driving through Ft. Lauderdale, there was a lot of lightening activity up around the clouds.  We call this Heat Lightening.  None was touching down to Earth.  At a certain point, I noticed that a few clouds which had been disbursed and were not overlapping, finally became quite tightly knit together.  This,  I could tell because the light emitted revealed this. I had been watching them for miles.  All of a sudden, from this grouping of clouds which were intertwined came a beam of light in the shape of a tube/cone starting from the sky projected onto what seemed to be Ft. Lauderdale and this beam took the shape of a cone beam.  Larger at the bottom.  This lasted for about 2 seconds and retracted.  It did not just disappear, it retracted. Since it was at a distance, it was difficult to say whether it was over the ocean or land. At our angle on the freeway, above the rooftops but 1 mile South of Fort Lauderdale, this was difficult to determine.  I was driving with a friend who was visiting Florida and has absolutely no experience or interest in UFOs.  I asked her whether she was aware of what just happened.  Her response was sort of comical insinuating she couldn’t believe her eyes.  We were both waiting for the helicopter to appear and continue to shine its beam but it never happened and the beam was way to intense and wide to be from a copter.  The quality of light was yellow with a tinge of green.  A copter reflector is more white, not as thick in width nor quality.  It sort of looked like a tube of water with light shining through it, from end to end.",
      "link": "http://www.nuforc.org/webreports/064/S64814.html",
      "state": "FL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba488",
      "summary": "Orange Fire Balls headed East over Atlantic Ocean",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Orange Fire Balls headed East over Atlantic Ocean Two low flying fire balls traveled from the Northwest in an Easterly direction out to the Atlantic Ocean.  The approximated altitude is estimated at 5000 feet and climbing intot he atmosphere as it approached the ocean.  The orange-colored fireballs took approximately 3 minutes to travel the entire landscape over me.  The lights discipated as they distanced over the ocean.  It was very difficult to focus on the objects.  They traveled in nearly identical patterns.",
      "link": "http://www.nuforc.org/webreports/067/S67782.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5c4",
      "summary": "Bright light circles north star and then strangley moves away",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Bright light circles north star and then strangley moves away A bright light circles North Star. It was difficult to see which was the actual star. They both were equal in brightness and color. The lower light moved vertically creating a semi -circle around the North Star. It then proceeded Northwest into the sky. The light dimmed as it moved quickly through the sky. It did not move as quick as a shooting star, but it's movement was fast at frist then slowed down. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64996.html",
      "state": "FL",
      "duration": "few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba615",
      "summary": "Star Like Object..mimics the north star..and shoots out into atmosphere.",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2008-08-12T00:00:00",
      "story": "Star Like Object..mimics the north star..and shoots out into atmosphere. We were just about to depart for a night of boating on the Intercoastal,.When we noticed an object that appeared to be the same shape as a bright star..as we were watching it made a half moon movement around the star. Almost rotating around the star..then.its glow got smaller..it shot out into space with incredable speed. we could still see it barely..as it headed north. but by this time, it was well above any distance in which a any commercail airline would fly.As it proceeded out into the atmosphere, we could see a trail coming from the back of the object.This was the second sighting by myself.and the first for the others that were with me. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64999.html",
      "state": "FL",
      "duration": "12 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbf6",
      "summary": "Saw a large hot lava colored orb coming from the ground floating towards us",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2011-10-10T00:00:00",
      "story": "saw a large hot lava colored orb coming from the ground floating towards us my daughter and I were going south on the cross florida freeway toward Fort Lauderdale.  We saw a fireball? hot lava colored fireball orb like object rising from what appeared  to be the ground and coming toward us.  I had droped my camera or I could have gotten a good picture of it.  I didn't want to take my eyes off of it.  It seemed to have spike like objects coming out of it as it passed over the car.  I lost sight of it after it passed over the car.  It seemed quite large going over us.",
      "link": "http://www.nuforc.org/webreports/084/S84357.html",
      "state": "FL",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bc128",
      "summary": "Balls or orbs night sky, traveling west in a group a few stragglers, more like a bird movement but high in the sky, one was low and had",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "balls or orbs night sky, traveling west in a group a few stragglers, more like a bird movement but high in the sky, one was low and had spiral sparkle in red cirlce about ten times larger than the light of plane, red, not orange, but resembled fireballs, very fast, saw a plane at same time and it was slower and higher, two of the balls actually intercepted and lost sight of one of them.  Sure it was something mechanical yet seemed organic in movement.",
      "link": "http://www.nuforc.org/webreports/085/S85274.html",
      "state": "FL",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd30b",
      "summary": "A giant wing shaped object, little slower than the typical passenger jets that fly over regularly. No lights or sound at all.",
      "city": "fortlauderdale",
      "shape": "chevron",
      "date": "2012-10-30T00:00:00",
      "story": "A giant wing shaped object, little slower than the typical passenger jets that fly over regularly. No lights or sound at all. It went from one cloud bank across the clear black sky into another cloud bank.  Lasted about 45 very long seconds.  Was shaped more like giant boomerang.  It was about the same color as the clouds that night.  I have no idea what is was...but it was such an incredible sight.  We could tell it was much higher than an airplane.  It was minimum 20 times the wingspan of a 747.  That's what was so shocking about it.  It seemed to be fuzzy around the edges...like a cloud...but unmistakably not a cloud. It was a giant wing shaped object...traveling a little slower than the typical passenger jets that fly over regularly. No lights at all...no sound. I found a couple picture on the internet that match it perfectly.",
      "link": "http://www.nuforc.org/webreports/093/S93135.html",
      "state": "FL",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be82d",
      "summary": "Strange flying objects in the sky",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2012-06-05T00:00:00",
      "story": "Strange flying objects in the sky I walked outside to go to the store and looked up into the night sky as I always do when I go outside at night.  I saw all of those lights, approximately 4 in the lead in a line followed by a V formation of approximately 8 lights, followed by another v formation of lights, same amount, followed by a trail of lights in a staggered line of about 4 lights.     They all moved at the same pace, far too close to each other to be planes under the control of the Federal aviation center, but they looked like lights on a plane- the color in the center of the lights were red surrounded by orange and the outer portion yellow.  The lights were pulsating. One by one they just disappeared as they reached the same spot in the sky.",
      "link": "http://www.nuforc.org/webreports/089/S89313.html",
      "state": "FL",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bebe3",
      "summary": "Two unusual objects spotted in the night sky over Fort Lauderdale, FL",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Two unusual objects spotted in the night sky over Fort Lauderdale, FL When walking my dogs, I noticed two unusual objects in the sky over eastern Broward county.  One object appeared to have two lights that toggled back and forth.  Since distance could not be ascertained, I assumed that the lights came from a single object. The lights were white and moved together, slowly, toward the south. Further south, there was a single point of light that appeared to be a separate object.  That light was larger and brighter.  Briefly, a large flare (also white) seemed to follow the object. Although the flare implied speed, as if it were a tail of a comet, the object appeared to be moving slowly. The flare went away after a few seconds.  The objects slowly faded away as I watched them. They remained white and slow moving.  I attempted to shoot a video with my iPhone. The objects are visible but only as a very tiny speck against a black sky.  The lights appeared to be the height that a jet might fly but I had no way to estimate their size, distanc! e, or speed.  I heard no sound other than my dogs. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100893.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3becb1",
      "summary": "Orange &quot;fireball&quot; colored light no noise moving W to E South of FLL.",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Orange &quot;fireball&quot; colored light no noise moving W to E South of FLL Looking south from Ft Lauderdale in the direction of FLL I noticed the light because of the dark orange \"fire\" looking color.  After focusing on on it, I can describe that it looked like the upper part of it was more white in color and was shaped like a triangle or jib sail and was a darker \"fire\" looking color towards the center. At first it appeared to be moving North but as it got closer, it seems, it was moving pretty much due east.  The object light was pulsating in a random pattern like a fire would do.  As it moved west it resembled what a rocket looks like traveling away from.  The speed seemed to be no more than what a typical airliner travels.  There was no trail and never any noise that I could hear. I have no way to tell the distance from my vantage.  I can say that I could never get a defined shape as it was a bit fuzzy looking.  I did take two photos though.",
      "link": "http://www.nuforc.org/webreports/100/S100455.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf094",
      "summary": "Hovering object lit with red and white lights, no engine sounds, no directional movement.",
      "city": "fortlauderdale",
      "shape": "oval",
      "date": "2013-09-30T00:00:00",
      "story": "Hovering object lit with red and white lights, no engine sounds, no directional movement. oval aircraft, hovering almost directly above my neighborhood.  No engine noise, flashing raspberry and white colored lights.  I left and returned an hour later.  The same aircraft is still hovering but further away, over the atlantic.  It still was not moving in any particular direction, just hovering.  Not lit like any other aircraft i've ever seen.  It appears is could be actually spinning. ((NUFORC Note:  Possible sighting of a \"twinkling\" star, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102077.html",
      "state": "FL",
      "duration": "still occuring"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3a5",
      "summary": "Multiple events, red/orange lights in S. Forida.",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Multiple events, red/orange lights in S. Forida. Multiple events in past 6 mos. Identical conditions in regards to low cloud ceiling. First event, early 2013.  Time approximately 19:30 Looking south towards Miami two orange lights slowly moving east to west. Altitude approximately 250 feet. Distance approximately 1/2 mile. Continued in a western path for five minutes until lights disappeared into low cloud ceiling. Witnesses 3. Second event, June 09 2013 (If I remember correctly).  Time approximately 21:20 Once again, looking south towards Miami 15-20 lights moving west to east.  Altitude approximately 500-700 Ft. Distance approximately 1 1/2 - 2 miles. Although objects were not uniform (IE: triangle), they did not deviate from their own close proximity. If these objects were indeed chinese lanterns then someone had connected them with some sort of string, rope, or cordage, thus allowing a somewhat uniform appearance and movement. As an ex service member I can ensure these objects were not flares, as these object maintained their altitude for approximately 10 minutes before disappearing into the low cloud ceiling. Witnesses 2  Third event, April ? 2013. Looking north from same location. Time approximately 1630. Conditions partly cloudy. A white/light anomaly appeared (other witnesses claim seeing two side by side before I had come outside). Very very strange. Although anomaly appeared close, and conditions of full daylight, I could not gauge distance or altitude. Certainly not low level clouds reflecting sunlight. Still try to rationalize this event in my mind, but I cannot. When reflecting on this event it almost seemed like a dimensional anomaly. I honestly have no way of explaining this event rationally. Witnesses 4  I did not take down exact time, wind, or cloud ceiling conditions because, frankly, I never thought I would be filing a report on them. After hearing a report on Coast to Coast on 25 June 2013 of many events, I figured I should at least make a report on these events. This is coming from someone who has never witnessed any event prior to 2013, so to have 3 events in less than 6 mos is very odd.",
      "link": "http://www.nuforc.org/webreports/098/S98979.html",
      "state": "FL",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3bf447",
      "summary": "Equal in size to 2/3rds of a football field. Bright orange/melon single lighting covering entire craft. Moved from ocean beach area 150",
      "city": "fortlauderdale",
      "shape": "disk",
      "date": "2013-08-30T00:00:00",
      "story": "Equal in size to 2/3rds of a football field.  Bright orange/melon single lighting covering entire craft.  Moved from ocean beach area 1500 feet above surface in North/Northeasterly direction at speed of around 60 MPH.  Color ended above my head and became a circular craft with faint lights around the entire base.   My wife and I saw another one almost exactly 1 year ago 1000 feet above the surface which was triangular.  Neither craft emitted any sound whatsoever and both were directly above our heads.  I am a 66-year old attorney in Ft. Lauderdale.",
      "link": "http://www.nuforc.org/webreports/101/S101170.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfab1",
      "summary": "4 orange circle above me.",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2013-10-14T00:00:00",
      "story": "4 orange circle above me. I was walking from the bus stop and took a side street on SE 15th St.  I heard very low pitch hum very smooth I barely heard it.   I looked up and saw 4 yellow orange shape crafts with slight glow.  One next to each other. going at what seem a very low speed.   The furthest on the right was moving around almost as if playing around left, forward and back. there was also a plain in the horizon, but this UFO were right above me.   I kept looking for suddenly they move  away or disappeared.",
      "link": "http://www.nuforc.org/webreports/103/S103072.html",
      "state": "FL",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3bfde3",
      "summary": "Red orange lights spaced minutes apart moving E to W at aircraft speeds total of 7 lights over 10 minutes",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Red orange lights spaced minutes apart moving E to W at aircraft speeds total of 7 lights over 10 minutes Orange red lights moving east to west below clouds similar to flares but moving too fast to be flares and at to high altitude then fading and going out over western glades.",
      "link": "http://www.nuforc.org/webreports/098/S98872.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0084",
      "summary": "Flickering amber light and constant noise.",
      "city": "fortlauderdale",
      "shape": "unknown",
      "date": "2013-07-22T00:00:00",
      "story": "Flickering amber light and constant noise My husband and I saw flickering amber lights and heard a monotonous constant noise, sounding like an electric motorbike travelling South to North right over our property in Fort Lauderdale around 330 am on Wednesday, July 18.  Does someone know what that could have been?",
      "link": "http://www.nuforc.org/webreports/100/S100309.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c020a",
      "summary": "Red formation of lights appear about 10 up and then down northerly flow fort lauderdale.",
      "city": "fortlauderdale",
      "shape": "",
      "date": "2013-02-04T00:00:00",
      "story": "RED  formation of lights appear about 10 up and then down northerly flow fort lauderdale we were looking out the balcony and noticed a weird formation (maybe 10) lights mostly reddish came up and then down then up again..  Totally freaked...went to get camera but the lights didnt show up? wish someone else saw this or had an explaination... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95850.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04ef",
      "summary": "Some kind of craft 20 miles above FLL airport Hovering then moving west and then moving at high rate of speed NE",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2013-04-12T00:00:00",
      "story": "some kind of craft 20 miles above FLL airport  Hovering then moving west and then moving at high rate of speed NE was in front of my house around 8:30 when i look up and saw a bright light that at first thought was a star .  but it started moving slow to the west .  then it stop .   i grab my camera to see if i cold grab some video . i live next to the FLL airport so i see all kind of planes and i know what satellites look like in the night sky.   this thing was about 20 miles up night the sky .  and was moving west at first then was hovering over FLL then started moving NE faster and faster .  till i could not see it any more . ((ADDENDUM FROM WITNESS)) add my link to report i wold like to add this you tube link to my report , thank you http://youtu.be/h6kP_NeksXI ((END ADDENDUM)) ((NUFORC Note:  We spoke with this witness, and he sounded to us to be quite sober-mined.  He described himself as being former military.  We have corrected the sighting time above.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96979.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0893",
      "summary": "Some kind of sonic boom followed by rumble.",
      "city": "fortlauderdale",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "Some kind of sonic boom followed by rumble. Below is the exact description I sent in an email to george noory of coast to coast am the evening after the incident which took place just after midnight on christmas night.  I decided to finally report this after hearing of so many other incidents that sounded almost exactly like mine which occurred more and more in the months and years after my experience and came to believe it may be related to the UFO phenomenon. On Christmas night I was sweeping my sons floor and I hear a huge explosion which scared me at first but I immediately assumed it was a large firework from someone messing around and continued sweeping but then immediately realized it was still making an after sound like when you hear the rumble of thunder after a big lightning strike.  It was loud enough to set off a bunch of car alarms and rattle my windows.  When I thought it was thunder I promptly ran outside thinking it might start pouring rain and I had to cover my motorcycle.   So I ran out there looked up and there wasn't a cloud in the sky.  It was one of the clearest nights you could ever find in south Florida.  It couldn't have been a lightning strike with a clear sky.  I know it wasn't fireworks because I know exactly what those sound like up close.   My only other thought was a sonic boom which I have heard before but there were no jets or jet sounds, I didn't even see any regular planes in the sky just stars and I looked very carefully.  My neighbors heard it to but no one had any idea what it was.   Just thought my story should be out there and wondering how many other people may have heard this boom.",
      "link": "http://www.nuforc.org/webreports/103/S103626.html",
      "state": "FL",
      "duration": "~5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c09ab",
      "summary": "I was looking at the Port Everglades webcam when this sight occurred. It took less than seconds for craft to ascend incredible distance",
      "city": "fortlauderdale",
      "shape": "disk",
      "date": "2014-03-18T00:00:00",
      "story": "I was looking at the Port Everglades webcam when this sight occurred.   It took less than seconds for craft to ascend incredible distance and disappear into the cloud cover.",
      "link": "http://www.nuforc.org/webreports/107/S107648.html",
      "state": "FL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a7c",
      "summary": "Strange reddish sphere w/bright yellow lights in center moving slowly, then hovering, then moving west again.",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "strange reddish sphere w/bright yellow lights in center moving slowly, then hovering, then moving west again I walked outside to the parking lot at approximately 9:00 pm on 12/31/2013.  I live in a small apartment complex near Fort Lauderdale beach.  I was leaning against my car, thinking about my son, when I looked up into the sky and saw a strange, bright red ball coming from the east ocean side.  It was a large, bright red circle and in the middle it had a very bright yellowish light.   It was heading west, moving swiftly.  As the object moved, the red area that encircled the middle was almost a translucent red, like an aura but well defined.   As I stared at it, the object started to slow down and hover over me, for about 2-3 seconds.  Then it moved down slowly, and “floated” in the sky for about 10-15 seconds, then very slowly started to move upwards, then it stopped again for about 2 seconds, and then it began it’s slow westward trajectory.   The object moved over my apartment complex, stopped, then it faded.  The night was breezy w/clear skies.  The event lasted for ab! out 3-4 minutes.   My mom was with me and said to me, as we both stared at the circle, “Oh my, how beautiful.”  I have never experienced, or seen, anything like this before.",
      "link": "http://www.nuforc.org/webreports/105/S105953.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cdc",
      "summary": "Very slow object.",
      "city": "fortlauderdale",
      "shape": "unknown",
      "date": "2013-11-11T00:00:00",
      "story": "Very slow object Driving east bound on 17th street causeway near Broward General Medical Center in the SE sky a very slow moving object was traveling straight up with a large plum behind.  Once I dropped off my friend to work (25 sec) I stopped in the Wells Farge parking lot across from the hospital to get a better look.  The whole plume of smoke was gone and there was just a very small puff of white smoke where the object was located.  I took aprox 6 photographs of the puff of smoke.  I looked at them via Photoshop and the puff of smoke was discolored yellow and orange.",
      "link": "http://www.nuforc.org/webreports/103/S103702.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1225",
      "summary": "Extremely  loud boom!",
      "city": "fortlauderdale",
      "shape": "",
      "date": "2014-01-30T00:00:00",
      "story": "Extremely  loud boom!",
      "link": "http://www.nuforc.org/webreports/106/S106746.html",
      "state": "FL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1de8",
      "summary": "Glowing baby blue disk ascending from the clouds, witnessed by 3-4 and photographed",
      "city": "fortlauderdale",
      "shape": "disk",
      "date": "2014-06-27T00:00:00",
      "story": "Glowing baby blue disk ascending from the clouds, witnessed by 3-4 and photographed On june 24th, 2014, I witnessed a craft ascending within a cloud formation. This movement created what looked like a cloud table on which the UFO sat atop. The UFO was glowing a solid baby blue color, much like a florescent bulb. The craft was not flashing, but remained illuminated at all times. As the craft ascended, the cloud formation below it grew in size. The craft was also illuminating the clouds above it, proving that it was resting in-between the clouds. After about 3 minutes, the craft slid sideways from the cloud table, exposing itself for about a 30-60 seconds and then disappeared in a blink. I was able to take 2 decent photos of the incident, although the color does not appear in the photos as it did in person.  I am a non drinking, non drugging, 44 year old medical college student and business owner. Also witnessed by 2-3 valet/parking attendants who were trying to talk themselves out of what they had seen.",
      "link": "http://www.nuforc.org/webreports/110/S110589.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c204a",
      "summary": "Silver chevron object in clear blue sky over Fort Lauderdale at 5 pm in afternoon.",
      "city": "fortlauderdale",
      "shape": "chevron",
      "date": "2014-06-06T00:00:00",
      "story": "Silver Chevron Object in clear blue sky over Fort Lauderdale at 5 pm in afternoon. I was heading South on Federal Highway, US1 at the junction of Bayview Drive and I spotted a silver object in the sky ahead of me.  I watched it and \"followed\" it for approx. 30 seconds.   It was travelling quickly but was not \"really\" high in the sky.   All of a sudden it just vanished. It all happened very quickly and I was in my car at the time.  Traffic was somewhat heavy but moving, others must have seen it. I am a married businessman in my mid forties, quite sane & not a \"tin foil hat\" wearer, but I know what I saw.   I wish I could have taken a photo.",
      "link": "http://www.nuforc.org/webreports/109/S109967.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b62",
      "summary": "Bluish light over Ft. Lauderdale seen many times in the same area.",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2014-11-26T00:00:00",
      "story": "Bluish light over Fort Lauderdale seen many times in the same area. From our house looking east towards the ocean, we have repeatedly seen a bluish, silver colored light making very fast movements straight up, sideways and back down.   It appears to be in the same area each time as we have seen this light more than 10 times over the past few months.   The light appears to be several miles from our home. Ft. Lauderdale/Hollywood airport is to the south of where this light is seen.",
      "link": "http://www.nuforc.org/webreports/115/S115624.html",
      "state": "FL",
      "duration": "Varies"
    },
    {
      "_id": "64d005f478aba2ec5a3c35f3",
      "summary": "Floating red sphere object hovering across sky at night clear sky then disappeared",
      "city": "fortlauderdale",
      "shape": "sphere",
      "date": "2015-02-20T00:00:00",
      "story": "Floating red sphere object hovering across sky at night clear sky then disappeared Brigt red sphere hovering across sky very noticeable clear sky at night no clouds in sky it was twice as big as the north star  as 4 of us followed it .  To slow for a meteor  faster then a plane  ,went from seeing it to it vanishing in literally one second ,it did not shoot away ,it just vanished like it was never there. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  For some reason not understood by us, witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117338.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e0b",
      "summary": "((HOAX??))  triangulate red lights.",
      "city": "fortlauderdale",
      "shape": "rectangle",
      "date": "2015-06-24T00:00:00",
      "story": "triangulate red lights We saw in the sky triangulate red ligts with green center slowly flying over one area then one after the other one then disappeared. ((NUFORC Note:  Witness does not indicate the time of the sighting.  Also, person elects to remain totally anonymous, and provides no contact information.  Possible hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119668.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e94",
      "summary": "Two black objects very high in the sky totally overcasts, several commercial planes flew between the two objects going east.",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2015-06-15T00:00:00",
      "story": "Two black objects very high in the sky totally overcasts, several commercial planes flew between the two objects going east. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119364.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c41e1",
      "summary": "Large oval on its side with orange bands of light.",
      "city": "fortlauderdale",
      "shape": "oval",
      "date": "2015-05-08T00:00:00",
      "story": "large oval on its side with orange bands of light. At approximately 11:25 p.m., I observed a very large object off the coast, due east of my location.  It was approximately the size of a full moon.  It looked to hold a constant altitude and was slowly moving north to south.  It was shaped like an oval on its side and had bright burnt orange light emanating from it.   The bands of light were roughly vertical and were moving from left to right on the object.  The light seemed to bend, with the ends of each band curving towards the center.  When the light bands were towards the left side of the object, the ends bent to the right.  When the lights had rotated to the right side of the object, the bands bent to the left.  As the light bands reached towards the center of the object they appeared vertical.   It was observed during the beginning of a lightning storm a few miles off the coast, just about where the Gulf Stream scoops and towards the coast.  After maybe 15 minutes it quickly faded and the disappeared, possibly into ! the clouds.  Shortly thereafter I heard choppers but saw no lights.  Very strange for around here as we have a lot of air traffic and to run without lights would be extremely risky.   I tried to snap a picture but considering it was with the camera phone the quality is very poor. ((NUFORC Note:  We spoke via telephone with the source of this report, and he sounded to us to be quite sober-minded.  We suspect that he is a very good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118857.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c456c",
      "summary": "I saw a  green flash, then a pink flash, lasting approximately 1 second each, followed by a trumpet sound occurring twice.",
      "city": "fortlauderdale",
      "shape": "flash",
      "date": "2015-10-29T00:00:00",
      "story": "I saw a  green flash, then a pink flash, lasting approximately 1 second each, followed by a trumpet sound occurring twice.",
      "link": "http://www.nuforc.org/webreports/122/S122962.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4909",
      "summary": "2 sightings of small discs flying in v-formation 15-20 minutes apart.",
      "city": "fortlauderdale",
      "shape": "chevron",
      "date": "2015-10-09T00:00:00",
      "story": "2 sightings of small discs flying in v-formation 15-20 minutes apart. Approx. 1 block west of US-1.  Approximately a dozen smaller discs flying in v-formation, no sound made at low altitude (under 1k feet).  Came into vision and passed overhead out of sight.  Approximately 15-20 min later, same shape, same duration at slightly higher altitude just further east.  Dim lighting around crafts during each episode.   Observers were sitting on a 7th floor patio at apartments near 6th street and 4th avenue (one block west of US-1), facing northward.  Objects were moving north to south, and passed out of site over our heads and beyond the building where we sat. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122547.html",
      "state": "FL",
      "duration": "2 separate, 15 min apart."
    },
    {
      "_id": "64d005f478aba2ec5a3c4ae8",
      "summary": "I saw approximately ten red glowing lights traveling from south to north last night in the western sky and they blanked out after they",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2015-10-02T00:00:00",
      "story": "I saw approximately ten red glowing lights traveling from south to north last night in the western sky, and they blanked out after they reached a certain point!   They seemed to march along in a row, and then dissipate shortly thereafter.   I did take my amateur photos and video!",
      "link": "http://www.nuforc.org/webreports/122/S122415.html",
      "state": "FL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e3b",
      "summary": "Bright light hovered in the sky, and after, disappeared.",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2015-08-13T00:00:00",
      "story": "Bright light hovered in the sky, and after, disappeared. While driving, I noticed a bright light in the blue sky.  At first it seemed to look like a bright star, while no other stars were visual.  I parked my vehicle just of a curiosity and it was hovering above without a move.  It looked strange and was too bright than a star on a clear sky.  I watch it for 2 minutes and with in this period of time it moved to the left very slowly, then stopped again.   After it took off again and started to move towards SE, I continued to follow it, and then it just disappeared from site. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120942.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f57",
      "summary": "Fireball at dusk in south Florida.",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2016-03-18T00:00:00",
      "story": "Fireball at dusk in south Florida. We just finished eating some tacos and walked out of the restaurant. I looked up at the sky and saw what looked like a fireball shooting straight down in the distance.   This ball did not disappear and left a trail as it continued to shoot downward and disagreed behind some thick dark clouds.",
      "link": "http://www.nuforc.org/webreports/126/S126383.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c506e",
      "summary": "Light beings bring ships onto sand @ Ft. Lauderdale Beach",
      "city": "fortlauderdale",
      "shape": "changing",
      "date": "2016-02-19T00:00:00",
      "story": "Light beings bring ships onto sand @ Ft. Lauderdale Beach I was at Fort Lauderdale Beach with four of my friends, around 11 P.M., on February 12, 2016.  In the sky there was a lot of bright stars and what we thought was a planet.  This “planet” gave off a light light that was shining so bright the surface of the ocean lit up.  There also seemed to be a large amount of incoming planes from over the horizon, which were also reflecting light off the water.  (Airplanes do not have lights that bright.) More “planes” kept coming and they kept getting lower. \tWe soon realized that these were ships morphing into and disguising as our crafts. We could see it happening.  All of the lights began coming closer and brighter.  I saw the light that looked like a planet come from high in the sky to low and it slowly moved towards us.  Once it got close, it looked like a huge military ship, but it was translucent.  It gave off both blueish and redish glows.  Within the huge ship were several small light beings that seemed to control the ship.  They got so close that the ship was coming onto the sand.  We receded back to the parking lot and it kept coming closer. It remained hovering stationary for about 15-20 minutes. \tThis being was within 10 feet of us.  We didn’t know what to do and we were all trying to process what we were seeing.  I was really worked up and excited. When I left, I felt like the beings had contacted me telepathically (but I can’t speak for the others).  I didn’t hear a voice, but it was like my brain received a message.  I knew that the thoughts I had about the way they felt came right from them. They told me they had the power to do ANYTHING and they are invincible.  They are light beings making contact with us because we attracted them to us.  They came in peace and I left with feelings of euphoria.",
      "link": "http://www.nuforc.org/webreports/125/S125817.html",
      "state": "FL",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5983",
      "summary": "Glowing orange dots chevron formation.",
      "city": "fortlauderdale",
      "shape": "",
      "date": "2016-05-26T00:00:00",
      "story": "Glowing orange dots chevron formation. Driving East on I-595 looking up at the blue moon when we noticed towards the southeast about 7-8 orange glowing 'dots' flying in a perfect \"V\" formation.   They seemed to be 'hanging' in that spot then within a minute or so most disappeared and only one remained.  The last one then just faded and disappeared.",
      "link": "http://www.nuforc.org/webreports/127/S127449.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c49",
      "summary": "Large light moving in a pendulum like motion.",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2016-04-01T00:00:00",
      "story": "Large light moving in a pendulum like motion I came outside with a friend that was visiting to smoke a cigarette and noticed what I initially though was a very bright and large star.   After looking closer, I realized no other stars were visible because it was quite overcast with clouds that night.  So I'm looking at it trying to figure out whether it was a plane but it was originally not moving at all, just sort of hovering there.   I called my other friend who was visiting to come outside to see what he thought of it.  After he came outside it started maneuvering back and forth from right to left for around a minute.   After the back in forth motion, it started moving back and forth again but this time descending.  The motion this time was kind of odd.  It almost looked like it was a light on a pendulum being lowered.  This motion lasted for around another minute.   Shortly after the light slowly faded out or went behind a cloud and we saw no more of it.",
      "link": "http://www.nuforc.org/webreports/126/S126644.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f88",
      "summary": "Orange light, occasionally blinking.",
      "city": "fortlauderdale",
      "shape": "sphere",
      "date": "2016-11-04T00:00:00",
      "story": "Orange light, occasionally blinking. Sitting in my backyard at night while on my laptop (computer), facing towards the west, I noticed an orange sphere.  It flew in a straight line & occasionally it would start blinking. It looked like an aircraft navigation light, however I thought it was odd that it clearly was orange & not red.  It so happened that I was about to read reports on NUFORC & read that there were other reports in our state of \"orange\" lights/spheres.  If I had read these reports before seeing the orange light, I would have watched it longer.  But again, it was not a red navigation light; it was clearly orange like orange fruit, & I could see other red navigation lights to reference as there were multiple aircraft in the area. I just wanted to point out that I'm an Air Force veteran & have witnessed the \"triangle UFO\" & I have witnessed a \"green fireball\".  Both incidences included multiple witnesses.  This \"orange light\" incident however was not as vivid & clear and therefore, it may have been an actual aircraft; however, I believe that taking the other similar sightings into consideration, that for a few reasons it would be better to report this incident.",
      "link": "http://www.nuforc.org/webreports/130/S130913.html",
      "state": "FL",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6027",
      "summary": "I was watching coast helicopter hovering 10 feet off water for 30 mins in same spot , after about 20 mins , a boat came in and helicopt",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2016-11-04T00:00:00",
      "story": "I was watching coast helicopter hovering 10 feet off water for 30 mins in same spot, after about 20 mins, a boat came in and helicopter was following boat for with spot light for another 15 mins within 10 feet of boat '  They started moving north after about 10 mins I seen a super bright circle take off super fast in opposite direction ! I have seen an object that bright move so fast , then the object disappeared in 10 seconds ,  I have video of helicopter hovering but did not get light taking off in oppposite direction ! I had already shut my phone off !",
      "link": "http://www.nuforc.org/webreports/130/S130952.html",
      "state": "FL",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61b6",
      "summary": "Fast traveling craft 03:30.",
      "city": "fortlauderdale",
      "shape": "other",
      "date": "2016-10-11T00:00:00",
      "story": "fast traveling craft 03:30 shape crossed sky heading south.zero flashing lights only a steady glow.  speed, hard to say as altitude is not known.  the craft came into sight and went out of sight in less than 2 minutes.  My guess is some type of surveillance craft at high altitude.",
      "link": "http://www.nuforc.org/webreports/130/S130553.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c64e2",
      "summary": "Driving down the highway there was a big bright circular light, it would dim and get really bright again. Then it would break off into",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2016-08-16T00:00:00",
      "story": "Driving down the highway, there was a big bright circular light, it would dim and get really bright again.  Then it would break off into smaller lights and speed up into the sky.  I watched them for 15 minutes until they all disappeared.",
      "link": "http://www.nuforc.org/webreports/129/S129217.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c67c0",
      "summary": "bright orange fireball west to east movement.  ((anonymous report))",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2017-03-10T00:00:00",
      "story": "bight orange fireball west to east movement fireball from west to east, bright orange directly over house seemed to climb as moving east ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132934.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6804",
      "summary": "Around 8:15 Sunday evening saw red orange glow moving across sky from E beach area to the W. ((anonymous report))",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2017-04-07T00:00:00",
      "story": "Around 8:15 Sunday evening saw red orange glow moving across sky from East beach area to the West. Took a couple of pictures and got a squiggly orange line as it flew from view. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133320.html",
      "state": "FL",
      "duration": "4 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c69b5",
      "summary": "Amazing.",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2017-03-10T00:00:00",
      "story": "Amazing I went out to my driveway and I usually look up because is not the first time I have seen this flying objects, it was 7:11 pm when I saw that white round shape flying right over me between the skies flying east to west at a fast speed,that didn't give me the chance to record it.thanks.",
      "link": "http://www.nuforc.org/webreports/133/S133008.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ab3",
      "summary": "We saw a total of 7 red/ orange lights.  We were facing N, and they were coming from the NE towards the SW.  ((anonymous report))",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2017-02-10T00:00:00",
      "story": "We saw a total of 7 red/ orange lights.  We were facing north, and they were coming from the northeast towards the southwest.  The first group were 2 running parallel and a smaller one following suit.  The 2 running parallel, the one on the left veered slightly to the west, and shot straight up into a little puffy cloud to never to be seen.  The one running parrellel with it moved in a similar direction about thirty seconds after the first to shoot up into a cloud to never be seen.  The third one following which seemed to be smaller, about thirty seconds after seemed to follow the other two in the same direction never to be seen.  The next set were four of the same color lights, no particular formation, did the same pattern one by one and disappeared, maybe 10 seconds between each, never to be seen again.  These were definitely not planes, drones, weather balloons etc.  We found it interesting and have noticed 2 other posts that saw similar lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132533.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b0d",
      "summary": "Circular, reddish UFO's spotted over FTL airport interact with each other & vanish!",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2017-02-03T00:00:00",
      "story": "Circular, reddish UFO's spotted over FTL airport interact with each other & vanish! My friend was getting into his car at around 8:30-9:00pm, when he noticed something flying in the air.  He called me over and pointed toward the object he was watching and my eyes immediately fixated on it.  The object was very high in the sky and I live near the Fort Lauderdale airport so I know most aircrafts do not reach those altitudes when preparing to land or even after taking off.  Most airplanes I am familiar with never reach altitudes past 60,000 feet but the object had to have been up at least 100,000 feet.  The UFO appeared as a seemingly small, circular, reddish dot in the sky, it did not flash or glow.  It was traveling at relatively high speeds but that was the least interesting thing about it.   After we stood watching it for almost a minute, I pulled out my phone in an attempt to get real footage of what we witnessed.  I had an iPhone 6s Plus and the quality of the camera along with the height of the UFO made it impossible to capture due to the time ! of night.  (This has made me into more of a believer than before knowing that even modern day technology is barely capable of capturing something so astonishingly high in the sky.)  It made no audible sounds possibly because of its altitude.   We watched the object continue across the sky until we noticed another exactly similar one!  They were flying towards each other until they got very close to one another.  I knew this was beyond human capability, because one UFO (the second one to be spotted) came to an abrupt stop.  The UFO we originally seen continued on after they had crossed paths for approximately 5-10 seconds.  We watched in amazement and curiosity as the second UFO stopped moving as if it had spotted us!  It shot a white, star-colored dust into the air which dissipated very quickly, which after deep thought, we believe to be a thruster of some sort because the second UFO vanished moments later.   In total, we witnessed about 2 minutes of seemingly unexplainable activity happening thousands of feet above us.  My only dream now is to make contact with those potential life forms as I find humans intolerant or ignorant to the concept of extraterrestrial life inhospitable.  Please do not take this as a joke, there is clear, consistent evidence of extraterritorial contact being covered up by governments around the world.  If there is any way I could assist the NUFORC or MUFON team in proving other-worldly existence, please reach out to me!",
      "link": "http://www.nuforc.org/webreports/132/S132437.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b48",
      "summary": "Traveling N on I-I95, I could Not help but to notice 3 bright yellow lights toward the East",
      "city": "fortlauderdale",
      "shape": "fireball",
      "date": "2017-02-03T00:00:00",
      "story": "On my way home from work traveling northbound on Interstate I95, I could not help but to notice 3 bright yellow lights toward the E horizon of Ft. Lauderdale.   At first glance I believed them to be planes, since the airport is in that same vicinity, however these lights hovered for over 30 minutes and never moved.  They looked like flares that would not turn off.  What are those?",
      "link": "http://www.nuforc.org/webreports/132/S132385.html",
      "state": "FL",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b79",
      "summary": "Moving slowly from S to N along FTL Beach bright red lights glided quietly without sound in plain sight.  ((anonymous report))",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2017-01-26T00:00:00",
      "story": "Moving slowly from South to North along FTL Beach, bright red lights glided quietly without sound in plain sight.  I looked through binoculars to see better.  Only Red/Orange light was visible no shape. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132244.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6da8",
      "summary": "Rapidly moving green light flying south to north at very rapid pace.",
      "city": "fortlauderdale",
      "shape": "circle",
      "date": "2016-12-15T00:00:00",
      "story": "Rapidly moving green light flying south to north at very rapid pace. Noticed a small green orb traveling very rapidly rapidly from south to north.  Based on its size and speed, it was not a typical aircraft.",
      "link": "http://www.nuforc.org/webreports/131/S131739.html",
      "state": "FL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c71c0",
      "summary": "It was 4 objects hovering together and forming various shapes.  ((NUFORC Note:  Possible advertising lights??  PD))",
      "city": "fortlauderdale",
      "shape": "formation",
      "date": "2017-07-23T00:00:00",
      "story": "it was 4 objects hovering together and forming various shapes. it was 4 objects hovering together...sometimes forming a diamond, sometimes coming close together, sometimes separating quite a bit apart...but always in the same location.  Then moved slowly across the sky, stopping again and then going higher, until disappeared.",
      "link": "http://www.nuforc.org/webreports/135/S135254.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c721a",
      "summary": "Orb that reflected sky...moved on left sidea of moon headed north..then tracked back and moved to higher position , then lower and the",
      "city": "fortlauderdale",
      "shape": "sphere",
      "date": "2017-06-02T00:00:00",
      "story": "Orb that reflected sky ...moved on left sidea of moon headed north..then tracked back and moved to higher position, then lower and then tracked the coast line. A spherical orb like object moving in an intelligent manner.",
      "link": "http://www.nuforc.org/webreports/134/S134363.html",
      "state": "FL",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c71f5",
      "summary": "Very large V-shaped object. blended in with sky seemed to float in direction headed W.  Seemed low to ground.",
      "city": "fortlauderdale",
      "shape": "chevron",
      "date": "2017-06-02T00:00:00",
      "story": "very large v shaped object. blended in with sky seemed to float in direction  headed west seemed low to ground. . I am not sure of the date, but I do remember it was late at night, 3am.  The craft was huge and made no sound or maybe a humming.  When I first saw it I was probably only seeing the wing of it.It was north of me,moving towards the west.  There seemed to be light in the front of the right wing.  Not a light like on a plane.  It was more like a glow.  I also thought I saw  piping in the shape of coils in an octagon shape taking up most of the space on what could be called the right wing.  Again, it all was hard to see because it was the color of the night sky.It almost looked transparent.  As it got further away, I it looked like a v standing upright, just floating away till it was too far away to see.  I saw no  blinking lights or heard no engine sounds.  The object was large enough to take up most of the sky line when it was directly north of me.  It seemed to be moving slowly.  As it moved to my right I saw the back of it.  It was just black and thin.  In the shape of a v.  It seemed to be very low in the sky.",
      "link": "http://www.nuforc.org/webreports/134/S134285.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c75ca",
      "summary": "Me and my girlfriend was coming home and got out of the car and she told me to look up in the sky and I did but I didn’t see any anythi",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "Me and my girlfriend was coming home and got out of the car and she told me to look up in the sky and I did but I didn’t see any anything and that’s when she said over there way up out in space and that when I seen this light slaking up in space and all of a second it shot across so fast and stop like it had brakes in space and it started shaking again and then shot across space so fast again and shopped and fro about 5 second and shot out of sight. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138141.html",
      "state": "FL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fd4",
      "summary": "Spheres off of wing.",
      "city": "fortlauderdale",
      "shape": "sphere",
      "date": "2018-04-19T00:00:00",
      "story": "Spheres off of wing Flying from BWI to FLL.  On downwind for 10L, aboard Spirit flight 301.  I was sitting at a window seat just enjoying as always (I fly a lot) and I noticed something off of our left wing. First thought it was a drone.  This \"thing\" was about 20 feet off the wing. There was some forward motion to it  because we didn't pass it quickly. It was a small sphere with two smaller \"things\" next to it. Then it just went away, not disappeared but just went away.",
      "link": "http://www.nuforc.org/webreports/139/S139509.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c823d",
      "summary": "1 helicopter was seen chasing behind.",
      "city": "fortlauderdale",
      "shape": "sphere",
      "date": "2018-01-18T00:00:00",
      "story": "Originally in a V formation but after getting closer, or it coming closer to me, a straight line 6-8 metallic spheres with a small red light towards top on all of them.  1 Helicopter was seen chasing behind.",
      "link": "http://www.nuforc.org/webreports/138/S138402.html",
      "state": "FL",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c82cb",
      "summary": "We were on the highway near exit 23 by Hollywood fl. And we saw 3 lights in the sky. Right above the tree line and below the stars. The",
      "city": "fortlauderdale",
      "shape": "light",
      "date": "2018-11-09T00:00:00",
      "story": "We were on the highway near exit 23 by Hollywood, FL, and we saw 3 lights in the sky.  Right above the tree line and below the stars.  They were higher than a building though.  They were in a triangle formation and weren't really moving.  I saw the ground where they were for about 3 seconds and saw more and they were all in a half circle shale to the ground but I couldn't see after a while because we were driving.  Just giant balls of light.   On the way back home we saw nothing that looked like it and there were strange vehicles and cop cars all near the area where we saw them. ((NUFORC Note:  Witness provides a photo, which indicates three brightly lighted objects, against a dark night sky.  However, the lights are blurred and \"smeared\" in the photo.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143680.html",
      "state": "FL",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a7a",
      "summary": "Bright orange cigar ufo.",
      "city": "fortlauderdale",
      "shape": "cigar",
      "date": "2019-09-06T00:00:00",
      "story": "Bright orange cigar ufo. UFO came out of the clouds stayed still for 4 minutes bright orange in color. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148642.html",
      "state": "FL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ccf",
      "summary": "Oval, red white alternating colors.",
      "city": "fortlauderdale",
      "shape": "oval",
      "date": "2019-01-24T00:00:00",
      "story": "Oval, red white alternating colors On Jan 10, 2019.  20 miles off the coast of Florida, near the F.t Lauderdale airport.  Myself and my coworker saw a UFO about 3 miles off the port bow.  It did not show up on radar. Amazingly, I got to see it with binoculars.  It was approx 30 to 40 feet tall and 20-ish wide.  Ovalish in shape.  With red and white alternating colors on its hull.  I saw it descend, rise, and hover.  Then move out of range from a large object to a pin prick and gone in less than a second.  Anything moving that fast couldn't possibly be manned.",
      "link": "http://www.nuforc.org/webreports/144/S144565.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c9409",
      "summary": "I was with a friend on the highest level of a car garage when I saw a V-shaped, almost like the phoenix lights, craft flying with about",
      "city": "fortlauderdale",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "I was with a friend on the highest level of a car garage when I saw a V-shaped, almost like the phoenix lights, craft flying with about four lights on each side; none of the lights flashed like a normal plane would and it was extremely silent, seemed to be going relatively fast.",
      "link": "http://www.nuforc.org/webreports/150/S150490.html",
      "state": "FL",
      "duration": "30 seconds"
    }
  ]
}