{
  "city": "fortwayne",
  "fetch_timestamp": "2025-07-12T14:35:27.526985",
  "record_count": 75,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4249",
      "summary": "Stationary Sphere Viewed Off Tip of Crescent Moon Not Far From Ft. Wayne, Indiana",
      "city": "fortwayne",
      "shape": "sphere",
      "date": "2006-05-15T00:00:00",
      "story": "Stationary Sphere Viewed Off Tip of Crescent Moon Not Far From Ft. Wayne, Indiana I was returning from visiting my son in Ft. Wayne, Indiana and while driving down Hwy 33 heading towards St Rd 6 traveling NW towards Elkhart, Indiana area, I witnessed what I now believe to be an Orb or Sphere shaped object.  I was in the country area just about 50 miles NW of Ft. Wayne and I happened to look up at the cresent moon which was to the left of my drivers window.  What caught my eye was that just off the tip of the cresent moon, there was an object which reminded me of a drop of water haning off the tip of the moon.  I starred for a while and determined that it was definitely not a star.  I could see that it had a circular shape and reflected the sun light as did the moon. I continued to see the object (which never moved from its \"hanging off the tip of the moon position\".  And eventually the road turned and I stopped paying attention.   But when I got home, I was so baffled by what I had seen, that I called the local weather station and asked about possible satelites in the area, but was told there werent any that i could see or anything that would be there like I described.  I have recently seen videos and pictures of what I can now saw if very much like what I thought i saw that night.  And due to the fact that these spheres have been documented as moving and being still, i do believe that is what i saw that night.   All I know for sure is that it was NOT A STAR!   And it was not there later on in the night.  Since it was a routine journey, it did not have a camera on hand unfortunately. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50061.html",
      "state": "IN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c0e",
      "summary": "IA black helicopter land in Fort Wayne and parked. If you have any interest I took some pictures. Enjoy you on Rense program.",
      "city": "fortwayne",
      "shape": "",
      "date": "2006-10-30T00:00:00",
      "story": "IA black helicopter land in Fort Wayne and parked. If you have any interest I took some pictures. Enjoy you on Rense program.",
      "link": "http://www.nuforc.org/webreports/051/S51498.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b6386",
      "summary": "Dark, Figure Eight Craft",
      "city": "fortwayne",
      "shape": "oval",
      "date": "2007-08-07T00:00:00",
      "story": "Dark, Figure Eight Craft Figure eight shape craft rotating counter clock-wise.  Dark in color traveled across the sky from SW to NE.",
      "link": "http://www.nuforc.org/webreports/057/S57332.html",
      "state": "IN",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6ac5",
      "summary": "This craft was obviously aware of us getting the camera.",
      "city": "fortwayne",
      "shape": "fireball",
      "date": "2007-08-07T00:00:00",
      "story": "This craft was obviously aware of us getting the camera. We were walking home and as we looked up into the air, we saw fireworks. However one spark didin't fade away from the rest, it kept moving horizontally. It kept moving like an airplane, but it was bright orange and looked like it was flaming. one of us went to get a camera but it flew away extremely fast like it went into hyperspeed or something. we managed to get two very blurry pictures of it that we are trying to clean up right now.",
      "link": "http://www.nuforc.org/webreports/057/S57541.html",
      "state": "IN",
      "duration": "About 20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f78",
      "summary": "5 disc shaped objects flyin in unicon with no lights...........",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2008-03-31T00:00:00",
      "story": "5 disc shaped objects flyin in unicon with no lights........... My girlfriend and I were leaving her apartment to go to the store at 9:54 exact.  She lives in an area where there is not much light pollution. There is some from a near by gas station and some street lights and a liquor store and houses that would emit light.  I walked out first and she was still up stairs locking the door.  I’m an observant person and always look up at the sky to see what stars are out.  I waited at the steps for her to grab her things and lock the door.  We began to walk to her car and I was still looking up and was going to comment on how it would be a good night for telescopes. When I looked up, there were five disc shaped objects flying in a perfect diagonal line heading north east.  I was scared at first and extremely uneasy. The car wanst unlocked yet and she noticed me acting out of sorts and I remember saying, \"look, look, look up!!!\"  I was frantic. I ran around the car and grabbed her head and pointed her eyes to the sky where they should have been, but there was nothing. They had disappeared. After the sighting I became tremendously nervous about what I have seen.  I have always wished to see a U.F.O. and now, I wished I haven’t. There were five of them in a perfect diagonal line flying north east. There was no sound and no lights. I believe they were pretty close in proximity to the ground.  They moved very gracefully in formation, they had to have been at least 20-25 feet apart from each other.  I know as well as anyone that balloons do not fly in such a tight pattern. The only way these objects were visible is due to the very low lights in the area; it seemed like five soft balls flying together.  I don’t know any other way to describe them.  I have called the local authorities to tell them about this sighting. I have always believed in U.F.O.s and now I wish I have never seen these tonight.  I am honestly scared and excited at the same time.  I dunno. I wish to get in contact with people that share the same. I am a smart person and I know that these objects were not of anything made by man.  I wish I have never saw them.  I would rather wonder than to know now. ((Name deleted))",
      "link": "http://www.nuforc.org/webreports/062/S62293.html",
      "state": "IN",
      "duration": "20-25 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b7b0c",
      "summary": "Dark Triangular shaped 1 blue/white light aft of center of ship",
      "city": "fortwayne",
      "shape": "triangle",
      "date": "2007-02-24T00:00:00",
      "story": "Dark Triangular shaped 1 blue/white light aft of center of ship Feb. 9, 2007 @ 0445, I69 North, Ft. Wayne IN  I travel the same route at the same time everyday and have for the last 7 years.  Have never seen anything out of the ordinary until this morning.  I always watch the stars and know the constellations, as they are the same everyday.  This morning I noticed a blue-white light in the sky, similar to an LED type light.  This light did not appear to move in any direction and was not a star, planet, helicopter or airplane.  I noticed that the stars that should have been in that part of the sky were no longer visible because something was blocking them out.   As I approached Ft. Wayne, the light appeared brighter but still wasn’t moving.  I pulled over to the side of the road and came to a complete stop.  When I got out of my truck to observe the object in the sky, it blended in nearly perfectly with the night sky but was one or two shades darker.  The blue-white light was near the rear of the craft on the belly.  The light was round in shape with conical shaped protrusion coming off the bottom.  The light was bright but you could see through it enough to identify the structure emitting the light.  The light was not in the shape of a beam or floodlight but rather was more iridescent.  All the edges of the craft distorted the night sky similar to the heat you see shimmering off of a hot blacktop road surface.  The object was triangular in shape but turned on its side, resembling a wedge, with the point facing northwest.  It was moving at an extremely slow rate.  There was no sound.  There were no other distinguishing features to describe. I had to continue on my way turning northwest with the object; it remained constant in the sky until I headed south and lost site of it. I called 911 in Ft. Wayne (Allen Co.) and reported the object and was told that there had been several other reports of the same thing.  The dispatcher that took my information was very dismissive. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  However, we believe that this report was submitted by the gentleman with whom we spoke via telephone.  He sounded exceptionally sober-minded, in our opinion, and we suspect that he may be a highly reliable witness.  We have spoken with the Allen County Sheriff's Office, and we are awaiting a response from that office, regarding the possibility of other reports.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55235.html",
      "state": "IN",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d8d",
      "summary": "Unknown object floating across a city airspace",
      "city": "fortwayne",
      "shape": "other",
      "date": "2006-12-07T00:00:00",
      "story": "Unknown object floating across a city airspace Last night shortly after 9PM EST, I was standing by the kitchen window. And as always I look out to check the sky condition. The window has a csoutherly view and I can easily see the zodiak and I like to check the sky condition and watch the planets traverse across my view.  The sky last night was a broken layer of this stratocumulus ans, as usual, the city haize cast an eirie glow on the clouds. Then I seen what I thought was an aircraft loosing aititude in preparation for the final landing approach to the city's larger passenger airport or so I thought.  But the aircraft did not look normal, first of all the city haise illuminated the object as it slowly moved acrost my view. It had a, sort of, saucer appearance, a scetch will be sent in conjunction to this report.  The object appeared a grey color similiar to how the clouds looked. I seen what looked like three round windows on the \"side.\" I will estimate the angular height of about two and a half clemched fists, at arms length, and the widest portion of the object was from a half to one full thumbs width.  Next I seen no navigation lights or landing lights which I normally see on aircraft of any size at night. I watch the object for a few minutes and resumed my business as I pordered what I saw. It was then that I decided that what I seen was no airplane but instead it was an artifact that was made here on earth or somewhere else in the cosmos by an intelligence that we cnnot comprehend althought we try.  I have been an amateur astronomer for about sixty years now and I typically see lights in the sky that I cannot explain using out technology so I basically ignore them but this time I got a physical outline to study. ((NUFORC Note:  We spoke with this witness via telephone, and he sounded very sincere, and sober-minded, to us.  We suspect that he is an excellent witness.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53828.html",
      "state": "IN",
      "duration": "About 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8775",
      "summary": "Craft sighting in Fort Wayne, Indiana.",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "Craft sighting in Fort Wayne, Indiana. My son and his two friends were outside and saw a disk shaped object come over the horizon of the trees about 50 feet up. The craft was moving slow then made a 90 degree turn and went straight then tilted on its side. The saw red and yellow lights blinking slowly. Then it disappeared.",
      "link": "http://www.nuforc.org/webreports/072/S72620.html",
      "state": "IN",
      "duration": "30 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b88ae",
      "summary": "Close Encounters of the ??? Kind",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2010-02-14T00:00:00",
      "story": "Close Encounters of the ??? Kind This was sometime during the fall of 1977. I was six years old.  My father was stationed at Ft. Wayne, Indiana.  Our family was late night fishing at a lake near the military installation.  The lake was in a secluded wooded area.  The approximate time was 11:30 p.m. I recall that it was a clear and cool night.  The object first appeared in the distance flying military crest along the mountains.  We could only see the lights which were approximately 5-8 miles away.  My father, an aircraft mechanic for the Army, was not sure of the object.  He stated that it was moving too fast for a helicopter and flying much too low and fast to be a prop aircraft.  We ignored it after that it wasn’t until 15 minutes later the object was hovering near us at the lake.  It was approximately 100 ft from our location, in the open observing us.  We remained motionless and stared at the craft during the entire duration.  The object was hovering 50 ft off the ground.  It was a disc shaped objec! t about 75 ft in diameter, with domes above and below the main hull.  Lights of various colors flashed around the domes.  The craft was silent and remained hovering for 10 mins before lifting off slowly, heading away from our location then accelerated quickly out of sight.  I will never forget this night.",
      "link": "http://www.nuforc.org/webreports/074/S74092.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c98",
      "summary": "Multiple sightings of fast moving points of light with changing motion, no identifiable shape, sudden appearances and disappearances.",
      "city": "fortwayne",
      "shape": "formation",
      "date": "2009-08-05T00:00:00",
      "story": "Multiple sightings of fast moving points of light with changing motion, no identifiable shape, sudden appearances and disappearances. Multiple sightings of unidentified objects have occurred in the past few weeks over Fort Wayne, Indiana. Sightings have been made by myself and 5 other people.  I have experience in astronomy, astrology, and physics, as do two other witnesses.  REPORT:  On clear nights the unknown objects have been seen flying across the sky as (apparently) tiny points of light--NOT BLINKING, with a constant glow--, about the size/brightness of an average star (from our perspective). At first we assumed they were planes or possibly satellites, but for how small they were--seeing as they were at extremely high altitudes--they were moving far too fast.  The objects moved at a seemingly constant velocity, but their independent trajectories are  not constant.  We have seen them travel in straight paths, in exaggerated arcs, and even move back in forth in a kind of weaving motion. What is peculiar is that the objects do not appear off the horizon, they simply appear at random points in the sky, sometimes along with barely noticeable flashes of light.  Some are stationary and then begin to move very suddenly with no detectable acceleration.  Furthermore, the objects do not necessarily fly toward the horizon as they move away from us.  Instead they either fade away or simply blip out of sight.  We assume that this means they are not following the curve of the earth, but moving on some kind of tangent.  One object was the most interesting.  It was much lower in the atmosphere then the others, appearing very large and bright, but with no obvious shape.  It was just a point of light.  It moved very quickly across the sky, and disappeared in a very sudden and almost undetectable flash of light.  It was nowhere near the horizon at the time of its disappearance.  The color of light coming from the larger object seemed to be a yellow shade, the wavelength being around 580nm. The most recent sighting was witnessed by myself alone at approximately 4:15 am, Wednesday, July 15 2009.  There was a small flash and then a poi! nt of li ght like others before.  This time, though,as the object moved directly over my position, the amplitude of the light it emitted greatly increased until it was very very bright.  It dimmed again, then brightened for a shorter amount of time, before quickly speeding up and simply disappearing at about 75 degrees off the horizon. ** I realize this report is not very well organized, but it is in all aspects completely serious.  I would very sincerely appreciate if someone were to look into this case. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71096.html",
      "state": "IN",
      "duration": "several weeks"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f3c",
      "summary": "Red, blue, green, and white lights flashing from a circular craft.  ((NUFORC Note:  Object may have been Sirius.  PD))",
      "city": "fortwayne",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "Red, blue, green, and white lights flashing from a circular craft seem to be commucating with other small circlular crafts to the west. On January 31, 2009 at 6:30 pm, my family and I were traveling east on State Street and in the sky my five year old daughter ask us why was that star was flashing up in the sky. When we looked at what she was talking about at first we thought it was an airplane and then realized it wasn’t so we pull over into a parking lot.  When we were watching this craft is was circular and had different lights flashing from it.  The colors were red, blue, green and white.  It also had an aura around it.  We watch it for about an hour.  It just kept on floating from left to right and up and down.  Also coming closer to us then fading back away.  Then all of a sudden my husband decided to look directly up to see if there was anything else in the sky.  We saw these small circular objects moving so fast through the sky, moving left to right and diagonally.  One of the objects went directly towards an airplane it looked like it was going to hit it.  We think the first craft we saw might have been commutating with the little crafts.  During this sighting my husband had called his mother and his brother to tell them to look in the sky toward the east to see if they can see what we were seeing.   After a few minutes his brother saw it and then so did his mother.  His brother also saw the little crafts going toward the airplane and zipping back and forth in the sky.  We were all amazed at what we were seeing, it was very weird.  This was my first sighting of a UFO, this was my husband’s second sighting.  It all seem too weird to be true but it was since his family seen it too and they were on the other side of the town.  Well needless to say that it was our daughters’ first UFO sighting, she was really scared and kept her eyes closed and said can we just get to the store already. ((NUFORC Note:  Object may have been Sirius.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68376.html",
      "state": "IN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba18c",
      "summary": "fireball in the sky  ((NUFORC Note:  Venus.  We spoke with the witness, who indicated a time of 11:00 p.m...  PD))",
      "city": "fortwayne",
      "shape": "fireball",
      "date": "2010-06-03T00:00:00",
      "story": "fireball in the sky object in the north west ksy..very bright and flashing...light was very intense to the naked eye it appears to ve a very bright start. got out binoculars and it has very brilliant colors, red green and orange ((NUFORC Note:  Venus.  We spoke with the witness, who indicated a time of 11:00 p.m...  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75664.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba8a3",
      "summary": "2 wierd objects appeared in sky- floating and disappeared into city skylights with in 1 min of each other.",
      "city": "fortwayne",
      "shape": "fireball",
      "date": "2008-07-05T00:00:00",
      "story": "2 wierd objects appeared in sky- floating and disappeared into city skylights with in 1 min of each other. We were watching the fireworks and just hanging out after when he said \"what's that?\"  We watched the object move across the skyline and first thought it was a firework.   After several seconds of continued orange-yellow color, the object seems to be moving/float at a steady speed seemingly closer to us.  There was no sound of an airplane or medical helicopter.   We watched as it floated across the sky almost 180 degrees in a arch. IT was NOT a firework- it was slower then that!  We watched this until it disappeared into the city lights.  A few moments later, a second object identical or very close to it, appeared at the same place we saw the first one appear.   The same sequence of events took place, same route, same speed, same wierd glow of color.  Again, this object disappeared into the lights above the city.   The sky was clear- the smoke from the fireworks had cleared.  We also noticed with both objects they seemed to almost...wiggle back and forth while glided/floating through the sky.",
      "link": "http://www.nuforc.org/webreports/064/S64303.html",
      "state": "IN",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3baaf3",
      "summary": "oval or disc-like shaped metallic object that was moving faster than a plane horizontally across the sky",
      "city": "fortwayne",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "Thursday September 16, 2010 at approximately 3:00 p.m., I was driving north on Broadway with my 13 year old daughter in the front passenger seat.  She was gazing out the window when she suddenly shouted, “What’s that?!” and “Look!”  She kept pointing east and up beyond what I could see from the driver’s side of the car.  She described what she saw as an oval or disc-like shaped metallic object that was moving faster than a plane horizontally across the sky before it accelerated and shot off in a vertical motion and disappeared.  The sky at the time was clear with few clouds.",
      "link": "http://www.nuforc.org/webreports/078/S78090.html",
      "state": "IN",
      "duration": "less than a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb06",
      "summary": "A slowly floating black circle with a faint red light in front",
      "city": "fortwayne",
      "shape": "circle",
      "date": "2010-07-06T00:00:00",
      "story": "A slowly floating black circle with a faint red light in front ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We are uncertain as to the time and date of the sighting, and have amended the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76088.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc5b1",
      "summary": "My 3-year-old child, a friend and myself were sitting outside on my porch at our new home together one evening.  It was a pretty chilly",
      "city": "fortwayne",
      "shape": "circle",
      "date": "2011-10-25T00:00:00",
      "story": "My 3-year-old child, a friend and myself were sitting outside on my porch at our new home together one evening.  It was a pretty chilly and breezy fall Sunday night but we wanted to look at the stars since we had just moved recently and were excited to view the night sky since it was so clear out.  Within just a few minutes an unusual traveling bright circular bluish white light caught our attention at an instant.  At first I thought it was a shooting star, but then it appeared to be moving closer towards us and not disappearing we knew such to be.  We watched it travel closer towards us for about a minute staring in amazement, disbelief and even a little fear that it may be an asteroid or bomb. We watched it get closer and brighter for about 30 seconds, moving further east then remain quite stationary for about 3 seconds when it was at its brightest before vanishing into the eastern night sky at a rapid but steady gliding speed for about 6 seconds until it totally disappeared.  It seemed to have come into our atmosphere from space, descend and then leave a different direction. I noticed an orbiting satellite and airplanes in flight and compared how different the light and motion of travel was in every way just to rule out things from our planet that travel regularly.  We had cancelled out everything and both believed we had encountered an UFO. I was convinced within 5 seconds that it could possibly be an UFO because of a prior experience.  While walking my dog a few years ago with my husband I noticed a black triangular object in the sky just before dusk thinking it was a bird at first until it just kept descending and appearing more like the size of a helicopter. and then within a few blinks of an eye went back up into the sky faster than I’ve ever seen anything move that distance.  What I saw in both experiences are almost exactly the same as far as the flight pattern and vanishing so fast.",
      "link": "http://www.nuforc.org/webreports/084/S84659.html",
      "state": "IN",
      "duration": "1 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc9dd",
      "summary": "15+ a night flashing nights, streaks thru the night. Ships posing as stars PICS http://s819.photobucket.com/albums/zz112/itis33/8-5-201",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2011-08-21T00:00:00",
      "story": "15+ a night flashing nights, streaks thru the night. Ships posing as stars PICS http://s819.photobucket.com/albums/zz112/itis33/8-5-201 I am seeing UFO in my area for months now. There are stars possing as stars, also aircraft rising up in the North/West Direction and travling the same pattern most everytime.  I wonder why we are having so many everynight in my area?  I mean I see at least 15 a night. Streaks in the sky.   Then to top it off those ships posing as star.  At  least 8 of them from 9-sun up.  Help me out anyone else having this happen.  ((name deleted))",
      "link": "http://www.nuforc.org/webreports/083/S83183.html",
      "state": "IN",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6dd",
      "summary": "4 white disk shape objects circling at the night sky.  ((NUFORC Note:  We suspect the lights might have been advertising lights.  PD))",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2012-10-30T00:00:00",
      "story": "4 white disk shape objects circling at the night sky. 4 white disk-shaped objects circling at night sky.  Going round-and-round every 2 seconds. They make circles around the night sky and then come together at one dot, and they resume the circling motion.  The circling motion also moves as my car movies continuously from one spot to another.  Then I was forced to stop my car to let the pedestrians cross who live at my apartment (Island Club Apartment). I am a first year pharmacy student and I have no religious background. ((NUFORC Note:  We suspect the lights might have been advertising lights.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93372.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7e1",
      "summary": "Strange signal detected",
      "city": "fortwayne",
      "shape": "",
      "date": "2012-05-13T00:00:00",
      "story": "Latest signal reported on Godlikeproductions. Type in search \"Strange signal detected.  Has a link also of Ham operaters trying to explain signal from space.",
      "link": "http://www.nuforc.org/webreports/087/S87848.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bd892",
      "summary": "Seven large round lights traveling from the north end of Fort Wayne Indiana to the south.  The faded out in the clear sky",
      "city": "fortwayne",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Seven large round lights traveling from the north end of Fort Wayne Indiana to the south.  The faded out in the clear sky On Saturday, 09-08-12 at 21:15 hours, family and friends were sitting outback on the patio talking.  The five of us were enjoying the clear evening.  The sky was full with bright stars and no clouds were seen during this time.  I noticed a triangular formation of four bright orange lights traveling from the North to the South of the Fort Wayne Area.  Then we noticed one single orange light actually leading the formation and then two following the formation from the rear.  The lights appeared to be moving at a continuas speed with the four in the triangular formation staying in a perfect formation.  The first ofject, after watching all of them travel past us with absolutly no noise, faded out and was never seen again.  The four in the formation then began to fade out in the same area as the one.  The two from the rear also faded out at what appeared to the be the same area of the sky that the previous five disappeared!  The large orange fireball style of ligh! ting was very bright, moving at a constant speed but made no sound.  There was no strange activity prior to or after the observation of these lights.",
      "link": "http://www.nuforc.org/webreports/092/S92617.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd9e4",
      "summary": "Fort Wayne - 10 second sighting of Slow Medium Oval Object - 1:22am September 10th 2012",
      "city": "fortwayne",
      "shape": "oval",
      "date": "2012-09-24T00:00:00",
      "story": "Fort Wayne - 10 second sighting of Slow Medium Oval Object - 1:22am September 10th 2012 Spotted a medium sized object (approximately 5x larger than aicraft at 10k altitude).  It was white/yellow oval light with no sound.  Spotted through large window in living room, and caught eye because of size and slow speed.  Object was moving from SSE to NNW. Object quickly slowed down from faster rate of speed.  I went outside in time to see object come to a near complete stop and then its lights turned off.  No sound or lights after spotting.  Clear sky with good star visibility. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92611.html",
      "state": "IN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bde8d",
      "summary": "Back in 63-65 pl. playing basketball outside on our street. Marietta Dr. off HWY 14. Rounded triangle shape, very low over trees then a",
      "city": "fortwayne",
      "shape": "triangle",
      "date": "",
      "story": "Back in 63-65 pl. playing basketball outside on our street.  Marietta Dr. off HWY 14.   Rounded triangle shape, very low over trees then across field and right above us.   We freaked, I ran in to call my mom, just down the street, we ran back out and so did she, GONE.   Talked to many other that saw the same thing, one called airport and got the same descriptions all over..   I’ve tried contacting my neighbor since but no luck.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93992.html",
      "state": "IN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be9eb",
      "summary": "I reported a few nights ago seeing these same 2 bright lights in the sky. I made an error on the other report the lights are in the wes",
      "city": "fortwayne",
      "shape": "light",
      "date": "2012-03-16T00:00:00",
      "story": "I reported a few nights ago seeing these same 2 bright lights in the sky.  I made an error on the other report the lights are in the west not in the southern sky.  I had my niece, sister, & brother-in-law witness this the other night.   Tonight I took pictures tonight with my cell phone and I can see the smaller light on the left side has red lights flashing when I move my phone so it takes as close up picture.  With the naked eye you cannot see the red lights flashing.  Very strange sight to see.",
      "link": "http://www.nuforc.org/webreports/087/S87648.html",
      "state": "IN",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bea55",
      "summary": "Unusual lights in the southern sky.  ((NUFORC Note:  Sighting of Jupiter and Venus?  PD))",
      "city": "fortwayne",
      "shape": "unknown",
      "date": "2012-03-13T00:00:00",
      "story": "Unusual lights in the southern sky. I was driving my son to his work to get his scheduled working hours for the next week of work.  In the southern sky as we were driving I noticed 2 unusual very light bright lights.  One was higher up above and to the left of the other one.  Neither one of them were moving just sitting there very bright.  Compared to other stars in the sky they were much brighter.  I text my niece that lives approx. 40 miles north of where I live & ask her to look in the southern sky to see if she could see what we were seeing.  She text back that she is at her Mother & Step-Dad's house & they also see them.  They agree that they are unusual and bright and tend to get dim and then brighten up again.  I have no idea what we were seeing but I wanted to report it in case anyone else in this area of the country witnessed or reported this. ((NUFORC Note:  Sighting of Jupiter and Venus?  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87589.html",
      "state": "IN",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bee0d",
      "summary": "Fort Wayne Lights",
      "city": "fortwayne",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Fort Wayne Lights My fiance and I happened to be inside our hotel room at the time, and I stepped outside for a cigarette.  I happened to look up towards the southeast, looking for the moon. It was somewhat cloudy that night, but there were stars.  But there were at least several in particular that caught my eye.  They appeared stationery; but they appeared to be moving at high speeds, while some moved slowly, stopped, changed direction, then moved off in a westward direction.  I noticed there were planes in the sky that night, because I could see their running lights.  These lights were a solid, with no flashing lights. I snapped a photo with my digital camera, which appeared to catch nothing but blackness.  I also attempted to capture video, but it, too, displayed only blackness, with no sight of anything.  I know that at least twice my fiance observed the lights with me.  Fort Wayne is near an airport, so I see aircraft in the sky quite frequently. I'm familiar with aircraft maneuverability, and this was quite unique for me.",
      "link": "http://www.nuforc.org/webreports/096/S96803.html",
      "state": "IN",
      "duration": "25-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf4ad",
      "summary": "Just after dusk on the 4th of July, I witnessed what I thought were UFO just to the eastern horizon......I did investigate",
      "city": "fortwayne",
      "shape": "oval",
      "date": "2012-12-20T00:00:00",
      "story": "Just after dusk on the 4th of July, I witnessed what I thought were UFO just to the eastern horizon......I did investigate .......and found out they were chinese Lantern balloon things Maybe these people are seeing these sames things.... as you reported to George Noury.... JUST A THOUGHT!!!! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We doubt that many of the reports of clusters of orange or red lights are caused by so-called \"Chinese\" lanterns.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95066.html",
      "state": "IN",
      "duration": "30 minutes+"
    },
    {
      "_id": "64d005f478aba2ec5a3bf597",
      "summary": "Triangle shaped object with lights floating in a forward motion stops after we notice it reverses and disappear.",
      "city": "fortwayne",
      "shape": "triangle",
      "date": "2013-07-03T00:00:00",
      "story": "triangle shaped object with lights floating in a forward motion stops after we notice it reverses and disappear. On 06/13/2013, me my brother and my sons mother pulled up to the night club (note that we haven't been drinking yet) and as soon as we parked I happened to look up out of the windshield of the car and I notice a plane go by and a strange triangle shape object with a light at each point of the triangle going in a forward motion and when I asked the two people in the car do they see the ufo( who then looked up an noticed the ufo) it stopped its forward motion in mid stride and reversed and disappeared behind a tall enough building to were we weren't able to see it anymore...",
      "link": "http://www.nuforc.org/webreports/098/S98638.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7d7",
      "summary": "Orange/yellow lights in formation moving Fort Wayne indiana",
      "city": "fortwayne",
      "shape": "unknown",
      "date": "2013-08-30T00:00:00",
      "story": "Orange/yellow lights in formation moving Fort Wayne indiana We first observed 7 objects. Four of them made a diamond like formation with three trailing behind them.  All had the same color of a orange yellow light.  The three following the diamond formation where in a line in my opinion.   Then a circular object with no lights passed by the moon light and was seen but did not capure that on video.   Once the four lights in formation disappeared.  Two additional lights followed into the line that was formed.   So a total of nine lights were send.   I will have to download my video to my computer and upload what we saw.   Amazing and scary at the same time.  The whole event lasted appx 5-7 mins long.  They moved pretty fast cause at first the thought could be lanterns but they moved to fast and in a pattern.",
      "link": "http://www.nuforc.org/webreports/101/S101283.html",
      "state": "IN",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf94a",
      "summary": "Midwest clear sky unidentified flashing object.",
      "city": "fortwayne",
      "shape": "flash",
      "date": "2013-09-30T00:00:00",
      "story": "Midwest clear sky unidentified flashing object A very clear night right before the clouds came i seen a flashing brite white light, flashed every second and would be in further position in sky when it would reappear i thought i may have been mistaken until it made a circular turn In mid flight and went in a total different direction!...i know planes have flashing blue and red lights and i have NEVER seen a plane move like that....ever!  I knew no one else would believe me, i quickly went to grab my phone to record..behold, low battery warning wouldnt allow it...so dissapointing.  For now.",
      "link": "http://www.nuforc.org/webreports/102/S102613.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9b8",
      "summary": "Star like objects moving in random directions.",
      "city": "fortwayne",
      "shape": "light",
      "date": "2013-10-14T00:00:00",
      "story": "Star like objects moving in random directions. Every night for the past week my friends and I have been seeing star like objects in the sky. They move in random directions but stay in the same general area.  They go in circles, zig zags, straight left or right and up and down.  At first glance they look exactly like stars. But when you pay attention to one for a while you will realize it's moving.  Sometimes they move kinda slow, and others move really fast.  They are all over the sky, and we see them every single night all night long.   I can't think of any explanation for these things, I've never seen anything like them. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103057.html",
      "state": "IN",
      "duration": "All night, every night"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa3d",
      "summary": "It was just before dawn and the sky was clear with just a little fog. I was just getting out of my car at work when I saw the bright fi",
      "city": "fortwayne",
      "shape": "fireball",
      "date": "2013-09-30T00:00:00",
      "story": "It was just before dawn and the sky was clear with just a little fog. I was just getting out of my car at work when I saw the bright fireball traveling from almost northwest to southeast breaking up and changing from yellow to blue.  There was no sound from the object.",
      "link": "http://www.nuforc.org/webreports/102/S102635.html",
      "state": "IN",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfaa6",
      "summary": "Glowing object in sky,",
      "city": "fortwayne",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Glowing object in sky, My daughter and I stepped out of our truck as I noticed a glowing object flying across the sky.  The object appeared to be flying from the S/W and slightly turned to a north direction. No sound, no blinking lights, appeared to be at a high altitude could not make out any type of shape.  Object seemed to get brighter to dim over a 10-20 second time period and kept repeating this.   We watched this for about 7-10 min until it seemed to disappear.  Cell phone acted really weird afterwards.  I took photos of said object!",
      "link": "http://www.nuforc.org/webreports/101/S101396.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe2c",
      "summary": "2 circle bright white objects seen by 8 witnesses.",
      "city": "fortwayne",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "2 circle bright white objects seen by 8 witnesses My family was sitting outside roasting marshmellows over a fire in our backyard when we Seen 2 circle bright white objects.one moving very fast and disappeared, the other moved very slow in the opposite direction for 20 minutes no sound at all just a bright white light.we live close to the airport so we know these were NOT planes!!",
      "link": "http://www.nuforc.org/webreports/101/S101560.html",
      "state": "IN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c00d6",
      "summary": "Fast, silent, squadrons of oval shaped almost transparent objects flying at night",
      "city": "fortwayne",
      "shape": "oval",
      "date": "2013-07-14T00:00:00",
      "story": "Fast, silent, squadrons of oval shaped almost transparent objects flying at night We (my wife, in-laws, and me) were located off of Union Chapel Rd near Leo, IN at approximately 11:15 pm July 12, 2013.   There were four of us this evening star gazing around a small camp fire.  We spotted objects in the air flying out of the east horizon.  They moved strongly west (slightly southwest) at speeds consistent with incredibly fast/low flying fighter jets which we have at our local air base in Fort Wayne, IN.  They flew almost directly above us but slightly to the south of our vantage point.   There were objects (at least three dozen or so) which appeared to be circular in nature but more oval shaped (similar to the body of a jellyfish).  There were no sounds at all or any beacon type lighting.  They blended in with the sky very well but seemed illuminated by the ground lights of the city/suburbs near us.   The moon was not visible to us for any comparison but they were much bigger than any stars (about the size of a quarter or fifty cent piece hel! d at arms-distance).  When we first noticed them, they came in “squadrons” of about three in a seeming v-type formation.   There were several of these and were followed last by a very large clustering with no definite formation other than being in a large group.  They were all flying at speeds consistent with each other and very close together, not breaking from their location in relation to their set patterns and the other objects.   They seemed to be headed for a specific location and quickly.  It is a cloudless, very calm evening with virtually no distinct wind at ground level.  Our ground elevation is 826’.",
      "link": "http://www.nuforc.org/webreports/100/S100068.html",
      "state": "IN",
      "duration": ">30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0151",
      "summary": "Two UFO above Fort Wayne.",
      "city": "fortwayne",
      "shape": "fireball",
      "date": "2013-09-09T00:00:00",
      "story": "Two UFO above Fort Wayne We were in Lutheran Park walking the dogs when my friend spotted two orange flickering balls in sky, travelling north out the southwest sky.  We watched them zigzag across the sky the lead ball flickered white and disappeared under the moon.  The second orb continued to zigzag and then stopped and hovered for about five minutes then went straight up out of sight.",
      "link": "http://www.nuforc.org/webreports/102/S102042.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0249",
      "summary": "Dull reddish glow seen NE of Fort Wayne, IN.",
      "city": "fortwayne",
      "shape": "unknown",
      "date": "2013-07-05T00:00:00",
      "story": "Dull reddish glow seen NE of Fort Wayne, IN. The UFO seen was in the distance, but a UFO for sure. It was first spotted by my mom when we were lighting fireworks.  At first I thought it was just a spark from a firework in the sky, but it hung in the night, with a dull red glow, far in the distance, unmoving. It lasted for about 5 minutes, and then, while our eyes were off it, it disappeared.  I'm sorry I can't give you more details, but it was NE of Fort Wayne, IN.  That's the best I can give you.  I hope that this helps you some what!",
      "link": "http://www.nuforc.org/webreports/099/S99662.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0424",
      "summary": "Bright light, hovering, close to ground, about the size of a car.",
      "city": "fortwayne",
      "shape": "diamond",
      "date": "2012-12-20T00:00:00",
      "story": "Bright light, hovering, close to ground, about the size of a car I was driving home on the east side of town, down state st, and I looked up and saw a bright light in the sky a ways down the road.  It was like a single headlight was shining toward me. I turned right down coliseum and as I drove the object followed to the left of me.  I must have seen it from a different angle then because the bright light was gone and instead there were two white lights and a blinking red one in the middle.  At first I thought it was a helicopter but then when I stopped at the light so did it. It was the strangest thing. I pulled into the nearby parking lot and sort of followed it.  It hovered a while and then sank down behind a hill.  I could see the outline of a sort of 3d diamond shape though.  I've never seen anything like this before.  But I did see a lady next to me watching it too so at least I know I'm not crazy right (:",
      "link": "http://www.nuforc.org/webreports/094/S94998.html",
      "state": "IN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c05ef",
      "summary": "Fleet sighting in Indiana.",
      "city": "fortwayne",
      "shape": "light",
      "date": "2013-02-18T00:00:00",
      "story": "Fleet sighting in Indiana Tonight at approximately 9:35pm local time I stepped outside onto my 4th floor apartment deck to smoke a cigarette and happened to look up and see multiple bright objects flying by overhead.  They were all a brilliant white and were traveling east to west at different altitudes.  Their speed seemed to be around twice that of the passenger jets that I see frequently flying east to west or vice versa.  Some of these objects were below the clouds some were in the clouds and some were at very high altitude.  I heard no sound associated with this phenomena.  The sighting lasted approximately 20 to 25 minutes as I counted in excess of 50 objects flying by at different speeds and altitudes.  The objects seemed to pulsate bright white. There were no navigation lights on these objects.  There were also airplanes in the area that were significantly dimmer and flashing colored navigation lights.  On several occasions I saw objects change direction and or stop in-flight to avoid flying aircraft.  In fact I saw two objects change direction at 90° angles instantaneously to avoid aircraft, then continue their Westerly progress. I have been an amateur astronomer most of my life.  Consequently I know an airplane when I see it. These were not airplanes.  I have always been a skeptic of these kinds of phenomena.  I am 55 years old and can honestly say I have never ever seen anything like this in my lifetime. I attempted taking video with my I-phone and photographs with my digital camera (which has a zoom lens).  The video did not turn out, however I do have a couple of photographs with stationary stars in the background and an image of one of the objects as a white streak.  If you request I would be happy to forward these to you.",
      "link": "http://www.nuforc.org/webreports/096/S96305.html",
      "state": "IN",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c08f2",
      "summary": "It was triangular with 3 different colors of lights (red, orange and yellow) there was just 1 ufo.  It just flew around.",
      "city": "fortwayne",
      "shape": "triangle",
      "date": "2014-03-18T00:00:00",
      "story": "It was triangular with 3 different colors of lights (red, orange and yellow) there was just 1 ufo.  It just flew around from what I could see.   The ufo main color was black as night sky.",
      "link": "http://www.nuforc.org/webreports/107/S107552.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c0991",
      "summary": "Drones/Ufo Sky.",
      "city": "fortwayne",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "Drones/Ufo Sky Hovering light objects seperated in the sky flashing and remaining unmoved for 20 minutes as of now.   Look up into SE sky if you read this tonight.   I saw these a week ago anx didnt report.  Possible hovering or stationary drones. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107631.html",
      "state": "IN",
      "duration": "active"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f97",
      "summary": "((HOAX??))  Orange beams in the sky; a \"V\" shaped lighting bolt struck it; I-65 S, N of Ft. Wayne and north of Indianapolis.",
      "city": "fortwayne",
      "shape": "light",
      "date": "2014-02-27T00:00:00",
      "story": "Orange beams in the sky and when it disappeared a \"V\" shaped lighting bolt struck it; I-65 S, N of Ft. Wayne and north of Indianapolis. I was traveling from Michigan to Alabama and somewhere around exit 333 on I-65 I saw a really bright beam of orange light with a very bright orange-red glow.   As soon as the beam of light disappeared a \"V\" shaped lighting bolt hit the ground exactly where the center of the beam was.   About an hour and a half later before I got into Indianapolis (still off I 65 S), I saw more orange beams with the bright glows.  The first beam of light I saw north of Ft. Wayne was by far the weirdest and brightest. ((NUFORC Note:  We cannot certify that this is a serious report.  Date may be flawed.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107465.html",
      "state": "IN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c12b1",
      "summary": "Two white lights seen stationary, then &quot;parted&quot; and traveled out of sight.",
      "city": "fortwayne",
      "shape": "light",
      "date": "2014-01-30T00:00:00",
      "story": "Two white lights seen stationary, then &quot;parted&quot; and traveled out of sight. Driving due South January 29, 2014, at 20:00, three witnesses spotted a white light that was somewhat stationary in the sky.  We rolled down the windows, but heard no noise.  There was another light that was close to the main light, then it “parted” from that light and both continued in a due West direction.  The lights disappeared behind the trees within about 30 seconds of the spotting.  These lights were stationary at first…then seemed to distance each other..then proceed to travel at about the same speed out of sight.",
      "link": "http://www.nuforc.org/webreports/106/S106753.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c12b3",
      "summary": "3 lights in the shape of a triangle hover and then travel S, SW.",
      "city": "fortwayne",
      "shape": "triangle",
      "date": "2014-01-30T00:00:00",
      "story": "3 lights in the shape of a triangle hover and then travel S, SW. While looking out the window, my two children(ages 13 and 15) spotted a stationary object with three lights in the form of a triangle.  It was about 45 min after we spotted lights in the sky while driving home.  I also saw this object, and it appeared to be traveling at a very slow rate, going South-South West.",
      "link": "http://www.nuforc.org/webreports/106/S106759.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c172c",
      "summary": "Orange ball flying through sky and vanished",
      "city": "fortwayne",
      "shape": "sphere",
      "date": "2014-06-04T00:00:00",
      "story": "orange ball flying through sky and vanished so it was like 10:30pm and the sky was dark. and me, my brother and sister, and our neighbor was playing outside and we saw a little orange ball like figure on the sky.  we thought nothing of it until it grew larger and larger.  i tried to take pictures but somehow it didnt show up.  it stopped growing then it looked like it vanished then 2 seconds later it appeared again and it was huge then it raced away and vanished.",
      "link": "http://www.nuforc.org/webreports/109/S109615.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1750",
      "summary": "3 balls of spherical lights almost landing.",
      "city": "fortwayne",
      "shape": "formation",
      "date": "2014-06-04T00:00:00",
      "story": "3 balls of spherical lights almost landing. I was headed back home with my mom and her boyfriend and my little brother.  We started to hear a faint noise almost like a scratching chalkboard or something similar to that.  We looked up at the sky and we saw what it looked like 3 balls of yellowish white balls in triangular formation.  I thought it was a plane because they were close to each other. but then it separated and it was going down like it was landing. but then the noise stopped and the lights dissappeared.   I never got the chance to take pictures because my phone and my moms phone was low battery when it was half full. I do remember what they look like though.",
      "link": "http://www.nuforc.org/webreports/109/S109613.html",
      "state": "IN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c190a",
      "summary": "A red flashing object seen by by 3 people in Fort Wayne.",
      "city": "fortwayne",
      "shape": "flash",
      "date": "2014-07-11T00:00:00",
      "story": "A red flashing object seen by by 3 people in Fort Wayne. I was inside and looked out my window- into the front yard, and saw a red flashing thing and at fist we thought it was a plane but we found out it wasn't!!!   i told my parent but they didn't believe me. so we all went outside- to the backyard to watch fireworks when we saw a red flashing ball it light up really bright once and then turned back to red, it headed towards the moon.Then it dissappered. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We have changed the time and date of the report.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111344.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b86",
      "summary": "Group of orange lights passing southward in sky",
      "city": "fortwayne",
      "shape": "sphere",
      "date": "2014-07-20T00:00:00",
      "story": "Group of orange lights passing southward in sky I was walking out of work to my work van and glanced up at a jet passing over in the distance and noticed two faint orange lights which appeared to be behind the jet and at a much higher altitude.  (The jet could have been leaving the Fort Wayne Int’l airport).    As I put on my polarized sunglasses the lights became much clearer and I noticed at total of five lights.  Three were stacked vertically and two were side by side horizontally – which were a bit lower and to the left than the 3 vertical ones.  They were moving slowly south/southeast.  As they made their way south I saw another one to the North end of the sky line, and then one more that either became more noticeable or “appeared” to its left. It’s possible that they were Chinese lanterns but they seemed far too high and bright given the clear sky and full daylight.  Also, I checked the wind direction at Intellicast.com under their local weather report and the timestamp at 08:54 showed the wind moving 6mph NNW. My cell phone does not take great pictures, so I pulled my digital cam out of my book bag but the battery was exhausted go figure.",
      "link": "http://www.nuforc.org/webreports/111/S111622.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b33",
      "summary": "Two orange spheres seen. The first one traveling south to north and disappeared into a low level cloud.  The second one came from the s",
      "city": "fortwayne",
      "shape": "sphere",
      "date": "2014-07-04T00:00:00",
      "story": "Two orange spheres seen.  The first one traveling south to north and disappeared into a low level cloud.  The second one came from the south but took a sharp turn to the west and disappeared from sight within a few seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110833.html",
      "state": "IN",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2267",
      "summary": "Red glowing globes moving west to east in formation at what appeared to be about 10k feet.",
      "city": "fortwayne",
      "shape": "sphere",
      "date": "2014-04-11T00:00:00",
      "story": "Red glowing globes moving west to east in formation at what appeared to be about 10k feet. Several red glowing object moving west to east hovering for a bit then moving rapidly and increasing in elevation.  Near Fort Wayne, international airport/122nd fighter wing.  Lights went out in succession.  Called 911 to verify no aircraft seen on radar.  They moved in formation and teams of 2.",
      "link": "http://www.nuforc.org/webreports/108/S108393.html",
      "state": "IN",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2454",
      "summary": "While driving, two individuals saw a very bright Red/orange circlular object vanished after two minutes of observation.",
      "city": "fortwayne",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "While driving, two individuals saw a very bright Red/orange circlular object vanished after two minutes of observation. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114606.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2681",
      "summary": "Slow moving craft I-69 and DuPont road.",
      "city": "fortwayne",
      "shape": "circle",
      "date": "2014-10-10T00:00:00",
      "story": "Slow moving craft I-69 and DuPont road. I witnessed the same thing that another reported on 09/16.  It was so low and so bright I thought it was a hoax.  But I can't get it out of my mind.  Just like previously reported it was right above 69 and DuPont.  And right above my apartment complex.   If anyone else seen it please say so.thanks.  I swear I'm totally real.  Still kind of freaked out.   It was right above my head at times about 500 feet above me and made absolutely no noise and the lights kept turning on and off.   When the lights were off you could see a single whit light at the center of the craft. It was probably 50 feet wide",
      "link": "http://www.nuforc.org/webreports/114/S114246.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c288e",
      "summary": "It was a saucer moving faster than anything I have ever seen, for a few moments and then it went straight up in the air and vanished.",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2014-11-14T00:00:00",
      "story": "It was a saucer moving faster than anything I have ever seen, for a few moments and then it went straight up in the air and vanished I was looking upward, out my window to see what the weather was like. All of a sudden a saucer shaped object went by at a very fast and low in the sky. I have never seen anything fly that fast.  And i could see the shape of it very clearly. It had two lights on it very bright.  They were on the side I was seeing, they were in the middle of the side, a little ways apart. In a seconds time, the saucer went straight up in the air at a high rate of speed. It was heading south, before it went straight up and vanished",
      "link": "http://www.nuforc.org/webreports/115/S115285.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29ae",
      "summary": "While looking at a beautiful rainbow in the sky, a co-worker and I saw several shining objects near the rainbow. They looked like glitt",
      "city": "fortwayne",
      "shape": "light",
      "date": "2014-10-10T00:00:00",
      "story": "While looking at a beautiful rainbow in the sky, a co-worker and I saw several shining objects near the rainbow.  They looked like glitter.   We were cleaning a hospital room, and paused to gaze at the rainbow, when we saw 5 to 7 glittery objects in the sky.  She said to me, \"Do you see those things?  Or am I just crazy?\" (Or something to that effect).  I said that I saw them too.   At that point they disappeared and instantly reappeared in another location of the sky, but still close to the rainbow.  We looked at them for a few more seconds, then they were gone.   As we cleaned the room we continued to watch for them, but they did not return.   Then about a minute later, we noticed a double rainbow!  The second was not as vivid as the first.  The glittery objects did not return.",
      "link": "http://www.nuforc.org/webreports/114/S114292.html",
      "state": "IN",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a21",
      "summary": "Three large bright lights slowly moved south. I could not see the craft itself. The lights slowed and stayed in one spot low in the sky",
      "city": "fortwayne",
      "shape": "formation",
      "date": "2014-11-21T00:00:00",
      "story": "Three large bright lights slowly moved south.  I could not see the craft itself.   The lights slowed and stayed in one spot low in the sky then slowly moved south again where a fourth light became visible.  Then it was gone.   Definitely not an airplane.",
      "link": "http://www.nuforc.org/webreports/115/S115443.html",
      "state": "IN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2abf",
      "summary": "Red fireball changing direction in sky.",
      "city": "fortwayne",
      "shape": "fireball",
      "date": "2014-12-05T00:00:00",
      "story": "Red fireball changing direction in sky Leaving to grocery store we noticed a red fireball in the sky.  It was heading down at first then turned to the right and left a trail of smoke behind it.   After about 9 min it started going up again until it vanished.   We live north east Fort Wayne, IN.  We both have never seen anything like this.  Our dogs were going crazy barking!!",
      "link": "http://www.nuforc.org/webreports/115/S115814.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e0b",
      "summary": "Blue saucer above I-69 and DuPont Road exit.",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2014-09-18T00:00:00",
      "story": "Blue saucer above I-69 and DuPont Road exit. Craft was traveling north to south above I-69 from 469 to DuPont rd exit.   Craft changed colors from a bright two tone blue and dark blue then change to red and white lights.   As to us that were video taping craft, it would kill all the lights every 20-30 seconds and then turn them back on.   No motor sounds what so ever.  Craft was seen for 15 min then it turned off lights and disappeared in the night sky.   Elevation of the craft was roughly 200-300 feet.",
      "link": "http://www.nuforc.org/webreports/113/S113628.html",
      "state": "IN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c32dc",
      "summary": "After dropping my son off at school I was traveling east on aboit's center road when I observed a hughe object hovering in the sky with",
      "city": "fortwayne",
      "shape": "circle",
      "date": "2015-03-20T00:00:00",
      "story": "After dropping my son off at school, I was traveling east on Aboit's Center Road, when I observed a hughe object hovering in the sky with bright flashing lights.  It appeared to be larger then at least 2 airplanes.   The sun was just about to rise there was a red glow in the sky.  As I reached for my cell phone to take a picture, the objects lights dimmed and the object slowly moved east and was soon out of sight with the speed of light! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117800.html",
      "state": "IN",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c337e",
      "summary": "walked outside to see a craft i couldnt believe, even as i was staring at it trying to find reason to dismiss it.",
      "city": "fortwayne",
      "shape": "triangle",
      "date": "2015-04-03T00:00:00",
      "story": "walked outside to see a craft i couldnt believe, even as i was staring at it trying to find reason to dismiss it. i was leaving my house at around 9:30pm to run to arbys to get some dinner, as i walked out i noticed how clear the sky was and looked towards orion since it is always in view and beautiful on a clear night from my front yard. as i looked at orion i seen a airplane flying in front of it. now here is the strange part, as i turned my head towards the southeast to scan the sky, i seen a triangle craft with 4 large lights, almost taking up the whole bottom of the plane, gliding across the sky. almost directly overhead. after i caught view of the craft my mouth dropped and i turned away. having seen this same thing as a child i always wondered if i was just tired as a kid and imagined something. when i turned back to the craft it was to my surprise that it was still there. it continued completely silently arcoss the sky until i lost view of it behind a tree and the horizon. now i feel pretty fortunate because this was a long enough event that i was able to process some of it while it was happening. initially my mind said \"wow that is a unique craft, maybe the local air guard base is trying out some new toys, or there is a stealth mission flying overhead\" as neither of these event are uncommon. and i try to be skeptical, maybe to a fault. after i thought of this i strained to focus on the craft, it was then i noticed that the craft had a triangle shape \"fuselage\" for lack of a better word. coming off of this fuselage were \"wings\", coming off the rear of the craft extending the overall triangle shape of the craft. it is hard to describe through text, but it was like a large triangle with the bottom third missing except for strips along the edges. there was two large lights on the fuselage taking up the majority of the frame, while the wings or tails, had two lights about half the size, again taking up the majority of the frame of the craft. they were a dim yellow, constant, and i can think of no purpose for them, they were not indication lights, unless it was to indicate to someone below the craft. the movement of the craft was completely silent. when i was trying to figure out what it was i paused a moment and tried to listen to anything that might be a jet engine.only to hear nothing of the sort, just normal city noise. now the size of the craft is something that confuses me. I hesitate to offer an estimation as i have no real source for my comparison except everyday life. to me it looked  the size of a jetliner maybe 1-5000 feet up.  a comparison for me would be a jetliner taking off and being maybe 30-45second into flight. not that ive seen that exact scenario, but that is the estimation i can give. It looked huge, i could see the edges, i could make the outline, but it appeared as though it was shrouded by clouds. it could be that the craft was huge and flying in the clouds, but there is no way any craft ive seen would look that big being up in the clouds. if this craft was up in the clouds, i couldnt even give you an estimate as to size. i have no comparison, simple as that. if the craft were closer to ground, the size would seem more plausible,barely.  still the shape and silence of the craft wouldn't. but none the less, closer to the ground brings the issue of why was it shrouded by clouds. i wont deny that i have had a fascination with UFOs, airplanes, spacecraft, science in general. which makes this experience even more shaking. I frequent nasa's page, i play computer games where you build aircraft, ive always had a passion for aviation. i COULD NOT explain what i was looking at. even while i was looking at it, trying to think of possible critiques and explanations.",
      "link": "http://www.nuforc.org/webreports/118/S118147.html",
      "state": "IN",
      "duration": "30 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c41a8",
      "summary": "It traveled vertical and horizontal.",
      "city": "fortwayne",
      "shape": "other",
      "date": "2015-05-08T00:00:00",
      "story": "It traveled vertical and horizontal. We first thought it was a black kite or drone.  It was still light out so we could not determine if there were lights.  It had appeared to have just taken off or flying very low. It was diamond in shape with wings and an acute flap at end.  It floated up and traveled West slowly.  There is video after we ruled out kite and drone but not good quality.",
      "link": "http://www.nuforc.org/webreports/118/S118839.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c41ad",
      "summary": "Bright white disk that made a ton of noise.  At first thought it was a place then it turned sideways and showed its circular shape.",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2015-04-30T00:00:00",
      "story": "Bright white disk that made a ton of noise.  At first thought it was a place then it turned sideways and showed its circular shape. dozens of lights flickered like none on any plane.  The craft zoomed off for a second of two only to reappear and fly in my direction next.  It did the same disappearance after this and didn't come back.",
      "link": "http://www.nuforc.org/webreports/118/S118621.html",
      "state": "IN",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42c3",
      "summary": "I saw my first UFO!  White light with red lights on bottom pulsating!",
      "city": "fortwayne",
      "shape": "oval",
      "date": "2015-04-17T00:00:00",
      "story": "I saw my first UFO!  White light with red lights on bottom pulsating! Walking my Shih Tzu around pond I noticed a light in the sky with some blinking red heading north east.   I thought it was just a plane until it cut sharp to the right and then down and then to the left.  The only shape I could make out was round or oval.  As I got almost around the pond it reappeared and was to the north of me.   The thing had like a heart beat as it pulsed.  I was so shocked I couldn't take my eyes off it.   It was high up above houses before it went up into cloud coverage.   I did get two videos but it's very hard to see as it looks like a dot in them.  I used my iPhone. I will say I saw my 1st real UFO!!",
      "link": "http://www.nuforc.org/webreports/118/S118453.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c496f",
      "summary": "Orange glowing balls of light in V-formation seen gliding across night sky above restaurant & theater",
      "city": "fortwayne",
      "shape": "light",
      "date": "2015-09-25T00:00:00",
      "story": "Orange glowing balls of light in V-formation seen gliding across night sky above restaurant & theater While leaving the Smokey Bones restaurant in Fort Wayne, Indiana, tonight (Friday, Sept. 18, 2015) around 9:10 p.m., I looked up at the sky after noticing sheet lightning in the NE and wondered if a thunderstorm was rolling in.   As I turned around to get into the car, I saw three bright orange lights in a “V” formation and a fourth “straggler” slightly behind, moving slowly across the sky from the SW toward the NE.   My husband was already in the car and I told him to get out and take a look.  We both were watching the 4 lights, which seemed to disappear behind the thick cloud cover, but as we again turned to get into the car, there was another group of 4 orange lights, the first 3 in V-formation.  This time the 4th one was much further behind, but they all were traveling SW to NE.   Because our intention tonight was to get the grocery shopping done, we drove over to Meijer.  As we parked the car in the Meijer lot, we could still the 4th “straggler” of the second group of orange lights and we stood in the parking lot watching until the light seemed to fade behind the clouds.   My husband dismissed these orange lights as most likely “military.”  But they were not your typical air plane lights.  They were orange, with a slight yellow waver and were steady with no blinking.  The speed at which they traveled was slower than a plane, but made me think of a glider.  As far as I could tell, they made no sound.  All I could hear was highway traffic and shopping center traffic.   We saw these unusual lights flying in this formation above a busy outdoor shopping mall, with people coming and going from the theater and restaurants.  I was looking around for someone else to look up or someone close enough that we could talk to and ask if they could see these lights too, but the people we saw were too far away and/or on their cell phones!  What were these lights?  Weather balloons?  Drones?  A group of eight people flying gliders at night?   My husband and I both have Bachelor degrees, he in Computer Science and I in Liberal Arts (English Literature).  I'm always looking at the sky and am knowledgable about the planets and stars, thanks to Stardate.org.",
      "link": "http://www.nuforc.org/webreports/122/S122171.html",
      "state": "IN",
      "duration": "8-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b68",
      "summary": "We were outside and looked up to see what we thought was a satellite, it was moving across the sky pretty fast, My father in law grabbe",
      "city": "fortwayne",
      "shape": "triangle",
      "date": "2015-09-11T00:00:00",
      "story": "We were outside and looked up to see what we thought was a satellite, it was moving across the sky pretty fast,   My father in law grabbed his binoculars and looked up and said wow,  I grabbed them and looked up to see a triangle craft with three lights or what looked like fire in each corner,  the object made no sound what so ever.  Then it sped up and was gone in a blink of an eye. I tried to take pictures but they did not turn out very well.",
      "link": "http://www.nuforc.org/webreports/121/S121663.html",
      "state": "IN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c575a",
      "summary": "Masala craft coming towards us in the sky just over the Treetops. It looked like a fireball but it did not move in a straight line. It",
      "city": "fortwayne",
      "shape": "cigar",
      "date": "2016-07-08T00:00:00",
      "story": "Masala craft coming towards us in the sky just over the Treetops.  It looked like a fireball but it did not move in a straight line.  It went over head and then went off into the distance. We were able to capture video and photographed as well. ((nuforc Note:  We spoke via telephone with the witness, and he corrected the time.  He stated that he will send the video clips that they caught of the object.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128264.html",
      "state": "IN",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c575b",
      "summary": "Cigar-shaped objects with the orange flame in the front flying in a grid pattern.",
      "city": "fortwayne",
      "shape": "cigar",
      "date": "2016-07-08T00:00:00",
      "story": "cigar shaped objects with the orange flame in the front flying in a grid pattern. myself and my daughter saw the light come up over the trees to the south west. she had her phone and I got mine and started filming. it flew to the northeast. it did not take long to get behind the trees. I asked het to take photos with her I phone,  since I was having trouble getting a clear image on my phone. we set and talked about it for 10 minutes then we saw another one on the same path but it appeared to be closer.  she went back inside then 10 minutes later I saw another one to the northwest heading to the southeast.  I tried to film it but the camera was having a hard time picking it up. after it past over the horizon I sat back down.  then about 10 minutes later a saw another one on the same path but farther away.  I watched it disappear and then sat back down. 10 minutes later a saw another one on the same path as the previous 2.  it was so far off that I could not get it on my phone. they looked cigar shaped. the thing that made them stand out is that it looked like a rocket flying backwards. the flame was in the front of the unit. I had seen the same thing the day before it came into view from the southwest then it made a 180 degree turn and shot off to the south very fast.",
      "link": "http://www.nuforc.org/webreports/128/S128354.html",
      "state": "IN",
      "duration": ">1 hour (for all 5)"
    },
    {
      "_id": "64d005f478aba2ec5a3c58bf",
      "summary": "Multiple balls of light in the sky that constantly changed position for 15 minutes plus",
      "city": "fortwayne",
      "shape": "formation",
      "date": "2016-06-03T00:00:00",
      "story": "Multiple balls of light in the sky that constantly changed position for 15 minutes plus I was looking out the window of my two story house towards an empty field.  Today, the field that I was looking at has become an addition.  There is a large water tower that abuts the addition I live in.  Off in the distance, beyond the water tower, were over five glowing balls of light in the sky.  Airplanes usually pass over this area, as there is an airport that is off to one direction, but these did not behave like aircraft.  In fact, they moved constantly for about 15 minutes, weaving and ducking in the sky.  At one point, they almost made a triangular shape.  Then, in one instant, they moved away, so quickly, that it could not have been an airplane.  It was like a rocket, and they all took off at once, every single ball of light, as if it was coming from one craft. I didn't see any aircraft chasing the object, but I have been puzzled thinking about it ever since it had happened.  Usually, I'm not one to believe in this kind of stuff.  When I saw what I saw though, I instantly believed.  I have never seen anything like it before in my life. ((NUFORC Note:  Date and time may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127661.html",
      "state": "IN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61ea",
      "summary": "Dozens of lights move slowly in unison, then ascend",
      "city": "fortwayne",
      "shape": "other",
      "date": "2016-09-22T00:00:00",
      "story": "dozens of lights move slowly in unison, then ascend It was directly above me in my front yard, I opened our front door to tell my wife, \"Hey come out.  I think I'm seeing a UFO.\" What had appeared was a grouping of lights that gradually became longer and more numerous.  It was in the shape of a whale or fish.  It was difficult to ascertain whether it was one large shape with dozens of lights, or dozens of separate objects flying together.  When my wife came out, I began to try to get video with my phone,(which came out blank with only audio)   We live in a heavily wooded area, and we watched as the object(s) passed slowly overhead and were then obscured from our vision by trees.  I jumped on my bicycle and rode a short distance to where the trees clear, and tried to get more video.  The cluster of lights had continued to move slowly and ascend in altitude until, if it had been motionless, would look like a fuzzy galaxy or other \"normal\" object, eventually disappearing altogether.",
      "link": "http://www.nuforc.org/webreports/130/S130043.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6364",
      "summary": "sceptic seeing first hand cant deny it anymore.",
      "city": "fortwayne",
      "shape": "light",
      "date": "2016-08-25T00:00:00",
      "story": "sceptic seeing first hand cant deny it anymore. I usually wouldn't humor this UFO stuff.. but my son and I seen this for ourselves...   Driving over the 469 overpass on highway 1, looking east past the catholic church and fields, was a blue light-  I told my son it was probably a new radio tower or something.   I slowed down and we kept an eye on it driving in my convertible- top down- full view- And I noticed it was a little higher up off the ground then I thought..  Suddenly this blue light that was stationary in one spot for a good minute or more just went from 0-1,000 mph shooting off southward and climbing north into the sky by about 30 degree incline..   So, given this was near our airport- I'm wondering if this is the reason why we constantly are seeing the Warthog jets flying circles overhead almost daily since then.  And I watched videos of military prototypes of flying disc and other experimental things and they cannot take off like that..  they go slow and hover and do more spy like missions.  They are not capable of shooting off that fast, and military stuff doesn't emit a bright blue light in the center.",
      "link": "http://www.nuforc.org/webreports/129/S129381.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c666c",
      "summary": "Cream-colored saucer photographed over Fort Wayne, Indiana.",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2016-08-02T00:00:00",
      "story": "cream colored saucer photographed over Fort Wayne, Indiana. I was outside taking pictures of the clear blue sky after cleaning my Canon Rebel T3 digital camera checking for dust on the mirror.   I noticed one of the photos, a cream colored saucer shaped object towards the top left.   I didn't see it with the naked eye, so I don't know what direction it was traveling.  It appears large and at a high altitude.",
      "link": "http://www.nuforc.org/webreports/128/S128942.html",
      "state": "IN",
      "duration": "~2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c729b",
      "summary": "Bright orange light slowly moves soundlessly over northeast Fort Wayne, IN.",
      "city": "fortwayne",
      "shape": "unknown",
      "date": "2017-07-07T00:00:00",
      "story": "Bright orange light slowly moves soundlessly over northeast Fort Wayne, IN. On July 5, 2017, at approx 11:15 PM, in a northeastern suburb of the city of Fort Wayne, Indiana, there was a very large, bright, orange light moving in an arc in the night sky from the southeast to west.  The object was visible for about 2 minutes.   The object was at least cloud level or above, as it either became slowly obscured by clouds or gradually diminished.  The speed during the observation was roughly that of a typical traffic helicopter, but the object was not a helicopter.  It made absolutely no sound. For comparison, moments afterwards, an airplane was observed moving in a southwesterly direction.  It was at a much higher altitude, loud, and easily identifiable through the spotty breaks in the cloud cover. The observers were a middle-aged husband and wife.  The husband is an Army veteran (84C) and autoworker.  The wife did not have her glasses.",
      "link": "http://www.nuforc.org/webreports/134/S134963.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7713",
      "summary": "((HOAX??))  I noticed this black,hazy, dark object swirling around & zig zagging from the direction of the sun! ((anonymous report))",
      "city": "fortwayne",
      "shape": "other",
      "date": "2017-12-21T00:00:00",
      "story": "I noticed this black,hazy, dark object swirling around & zig zagging from the direction of the sun!  It flew quickly & disappeared! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137822.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c787b",
      "summary": "Orb of light traveling silently",
      "city": "fortwayne",
      "shape": "light",
      "date": "2017-10-19T00:00:00",
      "story": "orb of light traveling silently The evenings of September 25th, 26th, and the 27th, I and my fiancée witnessed a ball of light in the sky.  The first night I was by myself outside on my back porch and I saw a ball of light move from the southwest to what seemed like the northeast and it faded away in like five seconds but it was not a meteor cause  of the speed it was moving at which seem very slow and it wasn’t a plane. The next evening, I was outside with my fiancée and we were out around the same time as I was the night before 8:30 and we both saw a light like I did before except moving from east to west.  We saw it for about four or five seconds then it disappeared.  We thought that was cool and said it was interesting and as we said that it reappered for like a second heading in the direction. The third night was the weirdest cause around the same time on the 27th I and my fiancée were sitting and I asked her if I should ask Yahweh to send a ufo for us to observe and she said sure.  So I stretched my arms out and ask Yahweh to seen a ufo.  We sat there for five minutes and she went inside.  I stayed for a few more minutes and just as I was about to go inside I saw it in the corner of my eyes.  \tI turned to see a white flashing light blink several times so I yelled for my fiancée to come back outside and she made it in time to see the light.  It flashed about 8 more times not in a pattern but once then three times then two and it started to faded away and it was gone. Yeah, I know it sounds weird, but that’s my story, and I’m sticking to it.",
      "link": "http://www.nuforc.org/webreports/136/S136620.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ea3",
      "summary": "Young couple observes two cigar-shaped objects with lights on ends over a short period. ((MUFON report))",
      "city": "fortwayne",
      "shape": "cylinder",
      "date": "2018-05-04T00:00:00",
      "story": "Young couple observes two cigar-shaped objects with lights on ends over a short period. Young couple were outside at his home, and the young lady saw a light in the sky that caught her eye..  She asked her boyfriend to look up and check it out..  It was a cigar shaped object with white lights on both ends. and was moving from the SW to the NE at a moderate speed.  They first thought it was a passenger jet, but this object had no wings and was totally silent.  This was the first sighting.  A few minutes later, another cigar shaped object was observed following the same flight path but with yellow lights on both ends.  The first one was fluorescent with a dark circle in the center. (MUFON 59027)",
      "link": "http://www.nuforc.org/webreports/139/S139702.html",
      "state": "IN",
      "duration": "Several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ebf",
      "summary": "Loud sound like you would hear in a moive",
      "city": "fortwayne",
      "shape": "unknown",
      "date": "2019-01-04T00:00:00",
      "story": "Loud sound like you would hear in a moive Between around 1:20-1:40 am, me and a friend were on FaceTime and he noticed a deep VERY loud and deep engine like noise coming from outside.  Mind you that we love basically 2 neighborhoods/8 Streets away from each other and we both heard the noise VERY clearly and we both look outside And nothing is there but a purple sky.",
      "link": "http://www.nuforc.org/webreports/144/S144267.html",
      "state": "IN",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c95ab",
      "summary": "3 glowing objects moving due West. Non blinking lights. No noise of craft.",
      "city": "fortwayne",
      "shape": "disk",
      "date": "2019-12-01T00:00:00",
      "story": "3 glowing objects moving due West. Non blinking lights. No noise of craft. I saw a bright object in the sky.  Figured it was a airplane taking off from local airport then noticed just how bright it was and that it did NOT have blinking lights.  Watched that for a few seconds then noticed two more of the same things nearly overhead but off to the right.  They were moving at a pretty good speed but not blindingly fast or anything.  They were travelling next to each other but separated by a few hundred yards.  Watched for a few seconds. Looked back at the first one and it was gone.  It thought it might of gone behind a cloud. Looked back at the two.  They were all orangey red.  Disc shaped. Flat but almost a flame like quality.  Noticed what I thought might be three lights on edge of disc. But hard to discern clearly due to the glow of the disc.  I had been walking toward my truck this whole time and was going to pass past it and get to the field but I had to look down to step over the curb. When I looked up the two were gone as well. At the sp! eed they were going they might of reached the cloud as well. At no time did I see any navigational lights blinking or did I HEAR anything as I watched the sky for another 30 seconds.",
      "link": "http://www.nuforc.org/webreports/150/S150853.html",
      "state": "IN",
      "duration": "12 secs"
    }
  ]
}