{
  "city": "fortworth",
  "fetch_timestamp": "2025-07-12T14:18:50.274505",
  "record_count": 63,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b418b",
      "summary": "I was a kid and here i what i remember. I was all ready looking strait up at it. It was a disk shaped craft, golden color, round window",
      "city": "fortworth",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "I was a kid and here i what i remember.  I was all ready looking strait up at it. It was a disk shaped craft, golden color, round windows. i was out side my house playing like always,in the front yard. I did not see or hear it coming or come. It was strait over my house, above me, i could throw a rock at it, like i said all i know is i was already looking at it strait over me.I was not afraid, i did not run.After locking for a minet it took off at the speed of lite, and made no noise.I told no one. after that my noise would start bleeding, my head would spin and i got the out of body feelings,along with a sort of huming in my head, this would happen thruw the rest off my childhood.I did not watch tv nor know what a ufo was, i kept my self intertaned. i am 40 now and can tell you some storys. there is some technology that can hook on to your neurons, and bodie, and talk to you, talk to your neurons, your brain. this technology can control your bodie functions,totaly. brother im telling you that you dont even have to be around this technology, it is global. ive traveled on a plain and the same results,controling all around. i can pick up the phone and call any one in the phone diretery and by the time they pick up every one around is on it. i mean every has some thing telling them about this guy that they never met or know, this tech will point him out when he comes around, rigth in your head, your brain, neurons.the tech can torture you or your freinds, r all of them all at the same time ,global.i know more than the avarege guy. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49724.html",
      "state": "TX",
      "duration": "1minet"
    },
    {
      "_id": "64d005f478aba2ec5a3b44df",
      "summary": "Two star like objects moving together in a clear night sky.",
      "city": "fortworth",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "Two star like objects moving together in a clear night sky. I was sitting in my backyard looking at the sky, as I often do at night, when something unusual caught my attention. Two star looking dots, lined up along a North/South axis, seemed to move slowly towards the south. They were actually so slow that at first, I thought they were stars and I was just experiencing a perspective illusion. However, the gap between these two objects and the closest constellation was constantly increasing. I thought of satellites maybe. They were not travelling as fast as satellites. Then, what are the odds of two satellites travelling on the same elipse, at apparently the same speed? There was neither any jet sound, even high altitude ones, nor any port, starboard or tail lights. I rusehd inside to get binoculars, which literally took me 20 seconds, but by the time I returned, I could not locate the objects anymore. Had they been static, I could never have told them from regular stars.",
      "link": "http://www.nuforc.org/webreports/050/S50126.html",
      "state": "TX",
      "duration": "30s"
    },
    {
      "_id": "64d005f478aba2ec5a3b482a",
      "summary": "Saw a vertical rectangle, looked like a lower case letter i, move across the sky.  Daytime - no lights on object.",
      "city": "fortworth",
      "shape": "rectangle",
      "date": "2019-06-07T00:00:00",
      "story": "Saw a vertical rectangle, looked like a lower case letter i, move across the sky.  Daytime - no lights on object. Stepped out of my garage and over the neighbors trees I saw a rectangular object moving across the sky.  It caught my eye because it looked almost like a lower case I moving over the trees.  Appeared to be heading in a south/southwesterly direction and seemed to be 1/4 to 1/2 mile away.  Had my 14 year old daughter come out because it looked so weird and neither of us could figure out what it was.  Watched it continue on until it was hidden behind trees.  Neither of us had our phones to take a picture.  It was still pretty light outside.  Didn't see any lights on the object.",
      "link": "http://www.nuforc.org/webreports/146/S146135.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b49d0",
      "summary": "Round bright white light traveling at a high rate of speed.",
      "city": "fortworth",
      "shape": "circle",
      "date": "2019-07-25T00:00:00",
      "story": "Round bright white light traveling at a high rate of speed. Single round bright white light at approximately 3000' - 5000' traveling at a high rate of speed (it appeared faster than the jets from nearby DFW airport and the Joint Naval Reserve) traveling in a linear north- northeast direction.  No trail or aura other colors or objects.",
      "link": "http://www.nuforc.org/webreports/147/S147658.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b511f",
      "summary": "Grayish metallic triangle shaped craft emits green aura over Texas.",
      "city": "fortworth",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "Grayish metallic triangle shaped craft emits green aura over Texas. On this summer day my brother, a friend and I were walking down the street.  I sensed something unusual and we began to run not even knowing why.  We hid behind an auto and watched this craft hover silently from the east to west. It was right over head and it hovered to a stop right above us.  It was in plain sight during broad daylight.  As it hovered above us, it started to glow, an aura around it. It was glowing a greenish color.  I also observed that it had what looked like a circle of red in its center like a neon light.  It remained still for about 1 minute then slowly curved toward the south and left. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52680.html",
      "state": "TX",
      "duration": "8 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b593e",
      "summary": "Bright flash of light in southern sky seen from far north Fort Worth.",
      "city": "fortworth",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Bright flash of light in southern sky seen from far north Fort Worth. Approx. 2330hrs on 1 August 06, I was standing in my back yard facing south (almost exactly 180 degrees).  A flash of light more brilliant than anything I have seen before appeared almost directly in front of me (maybe 2 or 3 degrees to the west of where I was facing) and was moving downward.  It disappeared less than 2-3 seconds after it appeared.  No other witnesses.  I did call the local FD, assuming it may have been kids with fireworks.  Within 20 minutes, I began to hear sirens from emergency vehicles and PD choppers were circling that area of the sky.",
      "link": "http://www.nuforc.org/webreports/051/S51844.html",
      "state": "TX",
      "duration": "2-3 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d6b",
      "summary": "Craft with intense white light",
      "city": "fortworth",
      "shape": "oval",
      "date": "2008-06-12T00:00:00",
      "story": "Craft with intense white light I was out in the backyard on the phone and happened to locate what I thought was a star, moving at a speed faster than an airliner. It came from the northwest traveling to southeast.  As I was about to lose sight , it suddenly turned into an intense white light for about 10 seconds, almost like a spotlight and then dimmed back to its original star appearance. It could have been a satellite, but I have never seen an intense light come from one like that before.",
      "link": "http://www.nuforc.org/webreports/062/S62963.html",
      "state": "TX",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b61d5",
      "summary": "Unknown Object  appear ,changing colors moving Southeast direction  over Ft Worth ,TX.",
      "city": "fortworth",
      "shape": "teardrop",
      "date": "2006-07-16T00:00:00",
      "story": "Unknown Object  appear ,changing colors moving Southeast direction  over Ft Worth ,TX. There was a circle flaming object, behind us located about 2 and half stories in a tree, as it was watching us, the colores where orange,gold,yellow,red, then it suddenly rose from the tree and aheaded in a northwest direction.this object dia.was 5 to 7 feet in dia. Less then 60 second later, a second object appear,The length of two Ft. Worth water towers ,and the height of 3 stories bldg.there was an haze around it, which change colors, there was also an oval-shape cricle in the middle it an a rotating light, colors where ,red and blue.there was no engine sounds,or any noise of any kind.Note: just before it appear,and all the insects,cats,birds and dogs all became silence.This event took place late in the evening with a full moon present.",
      "link": "http://www.nuforc.org/webreports/051/S51144.html",
      "state": "TX",
      "duration": "7 Min."
    },
    {
      "_id": "64d005f478aba2ec5a3b661f",
      "summary": "We were standing at the back door smoking a cigarette when I looked up to the right in the sky there  was a  one spinning disk  I only",
      "city": "fortworth",
      "shape": "circle",
      "date": "2008-03-31T00:00:00",
      "story": "We were standing at the back door smoking a cigarette when I looked up to the right in the sky there  was a  one spinning disk  I only saw what seemed to be the bottom and it was a dark black/brown color with a noticeable orange glow around the craft.  It was moving at a high rate of speed its direction of travel was east to west it seemed to move effortlessly. But its movements were very jerky. There was an eerie humming noise it was a very low tone. It hovered in one spot for a few seconds then jerked diagonally up ward to the right and stopped and hovered for a couple seconds, spinning the entire time.  Then it jerked diagonally down to the right were it stopped and hovered. Then it dropped just a little in its altitude before accelerating at an amazing speed and disappearing almost immediately after this acceleration began, not even a second after it was gone. Even though it was dark outside you could see where the disk disturbed the air it was just in and you could see the path it traveled for about 10 seconds after the craft was totally gone.",
      "link": "http://www.nuforc.org/webreports/062/S62356.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b72ba",
      "summary": "Stationary small white object in the northern sky, not moving.",
      "city": "fortworth",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "Stationary small white object in the northern sky, not moving. At approximately 11:30 AM. while at work, I looked up into the northern sector of the sky at about the 1:00 or 2:00 position.  Difficult to see was a small sphere like object, white in appearance and resembling a star but rounder edges. Two co-workers also saw the object.  It did not move for a period of at least 30 mins. It was very bright, sunny day, with wispy high clouds that moved fairly rapidly as it was quite windy.  My first thought that is was possibly a weather balloon.  It was difficult to spot, and the fourth person was not able to see it because of the bright sky, though the sun was behind and above us.  I took photos with my cell phone, but strangely there is the pole I used as a marker but instead of the very small object we were looking at there is an oval large bright light.  This happened in two consecutive photos. I was wondering if anyone else has reported anything like this today.  There was a tremendous amount of jet traffic and contrails in that sector of the sky. As far as I have checked there were no unusual celestial events going on either.  I thought I would go ahead and report this since we have had some ufo sightings in this area recently. ((NUFORC Note:  We just spoke with this witness, and we found her to be quite credible.  She had contacted the National Weather Service, and Carlswell AFB, attempting to determine whether they might have launched weather balloons, and they both reported that they had not done so.  We do not know what the witnesses observed.   Also, the witness reported that there was quite a strong wind at ground level, and that the object appeared to the several witnesses to remain motionless for in excess of 30 minutes.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61991.html",
      "state": "TX",
      "duration": "30 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b74e3",
      "summary": "White Crescent shaped objects spotted.",
      "city": "fortworth",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "White Crescent shaped objects spotted. Heading down 377 Northbound just before coming Bear Creek in outer Fort Worth Texas (I am unsure of the exact name of the town) I spotted 2 white crecent shaped objects flying in the sky to my 9 o clock. Objects flew straight in unison until they disappeared.  About a minute later I noticed to my 11 o'clock another group of 4 flying at the same speed until they disappeared.",
      "link": "http://www.nuforc.org/webreports/052/S52731.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7739",
      "summary": "there were white red and blue lights hovering in all directions.it moved unlike any man mad aircraft and i watched it for about 20-30 m",
      "city": "fortworth",
      "shape": "unknown",
      "date": "2006-07-16T00:00:00",
      "story": "there were white red and blue lights hovering in all directions.it moved unlike any man mad aircraft and i watched it for about 20-30 miniutes.i even got to see it from diffarent angles and i couldnt believe what i was looking at.i then went inside and woke my roomate to come and see it and he came to the same conclusion ass i did.",
      "link": "http://www.nuforc.org/webreports/050/S50837.html",
      "state": "TX",
      "duration": "30 minuits"
    },
    {
      "_id": "64d005f478aba2ec5a3b7969",
      "summary": "I saw a dark object that at times had a triangular appearance.  No noise was detected and there were no lights at all.",
      "city": "fortworth",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "I saw a dark object that at times had a triangular appearance.  No noise was detected and there were no lights at all. I was walking the dog about 5:30 PM Wed..,  Jan 24th, 2007.  The weather was very clear and breezy with some clouds.  The sun was beginning to go down in the west. I saw an object way off in the distance approaching from the north west.  It was quite high in the sky and moving slower than a jet plane moves. There were no clouds obscuring my view of the object.   I watched to see if I could see any lights but there were no bright lights or blinking lights. I could see no wings.  It was difficult to determine the shape but looked slightly triangular at one point.  I thought I could determine some shifting of the shape but I couldn't really tell.  It curved around to the west towards the setting sun.  It never varied in altitude, neither going up or down and the speed always remained the same.  I wondered if possibly it was a weather balloon but I have seen those before and usually the balloons relect white and this was dark brown.   I wondered about a large bird but it looked too big a bird and it wasn't a flock of birds but a solid object.  I watched this object for about ten to twelve minutes and then had to go inside because of the cold air.  It was still in sight when I went in.   Unfortunately I did not have my camera and was the only person outside at the time.   From my vantage point it was high enough in the sky to be way above the two story buildings and trees.  The size from where I was was about one eighth of an inch to a quarter of an inch.   We have alot of air traffic in the area because of DFW airport, Lockheed, and  what used to be Carswell AFB.  It looked as if it was high over the base at one point.   I am familiar with all types of aircrafts and balloons and this looked nothing like anything I have ever seen.    I would really like to know if this was a weather balloon or if any other reports have come in.",
      "link": "http://www.nuforc.org/webreports/054/S54941.html",
      "state": "TX",
      "duration": "30 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b807e",
      "summary": "Black round silent object moving slowly to northwest from southwest., no lights, no jet trail, no sound.",
      "city": "fortworth",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Black round silent object moving slowly to northwest from southwest., no lights, no jet trail, no sound. This evening at approximately 7:32PM, Sept. 9, ’09, I was out walking and looked up slightly to the north, and saw a small black object.  At first, I thought it was a large bird, but there was no wing movement.  No sound, no jet trail, no lights, very black.  It stayed on a steady course from the southwest to the northwest. moving very slowly.  I saw a similar object last July 3, 2008, but the sky was slightly darker, and the object was lower.  It moved very slowly, as I was able to watch it for at least ten minutes, both times. This year, there were clouds, and they appeared high and thin.  The object was black and showed up against the sky and clouds as did the object last year.  I did file a report with the National UFO Reporting Center last year as well.  The object last year, appeared to have some indentation at the top and was very black.  This time it looked more round, but the movement was exactly the same.  There is an air base (joint command) off a! bout three miles from where I live in Fort Worth, TX. in the direction the object was moving.  Last year, when I described what I had seen with a coworker he had seen the same object. He lives close to where I live.  He described the object exactly as I did, moving from the southwest to the northwest.  Interestingly, he said one of his neighbors had their cell phone and it began to make noises and light up as the object passed.  I think possibly it might be a government experiment, but it was very strange.  No triangular shape.  Just a rounder shape.  I did take a photo of the object with my cell phone, but I am not sure I captured it as it was high.  I would be glad to foreward the photo to be analyzed.  It would appear as just a black spot, small.",
      "link": "http://www.nuforc.org/webreports/072/S72197.html",
      "state": "TX",
      "duration": "10 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b8805",
      "summary": "Boomerang shaped craft glides across the sky early in the morning",
      "city": "fortworth",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "Boomerang shaped craft glides across the sky early in the morning At approximately 4:15-4:30AM I was in my front yard, leaning against my car parked in the driveway smoking a cigarette. The sky was very clear that night and there were hardly any clouds out, making the stars and neighboring planets exceptionally visible. As I gazed up at the stars, a boomerang shaped object glided at a moderate speed across my field of vision. Its altitude was much lower than that of a commercial airliner and was closer to the height a helicopter would be flying at. It was a very quiet night and yet when the object flew by, there wasn’t even the smallest audible sound. The object did not have lights and was rather dark but I followed it with my eyes until I couldn’t see it anymore. I was so convinced that what I saw was a UFO, I quickly ran inside and woke up my parents to tell them of my encounter. It was amazing.",
      "link": "http://www.nuforc.org/webreports/072/S72650.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8dac",
      "summary": "strange zooming light over Fort Worth.",
      "city": "fortworth",
      "shape": "other",
      "date": "2010-02-14T00:00:00",
      "story": "strange zooming light over Fort Worth. December 13, 2009 at around 2245 -2300 hrs, I was walking out to my truck and as I was coming out of the walk way onto the parking lot that is on the East side of the apartment building, I was looking up at the night sky seeing that it was clear and breezy and noticed that, Orion something else that looked like it, was southwest at about 45 degrees from where I was standing.   While looking up at it – something caught my eye, at first looked like an airplane and I would have regarded it as one if it had not been traveling at the speed it was. My next guess would have been a satellite since they sometimes do move pretty quickly across the night sky, but what caught my eye was that it zoom for a good distance it seemed to have slowed down and zoomed again.  I followed this tiny light and noticed it kind of curved towards the western direction and it came to a hover this time there seemed to be more lights that I had not noticed earlier – it almost looked like a ! string of lights or set of lights.. it hovered and then started descending and moving back towards the East…ran inside to get my binoculars and see if I could take a better look, but when I got back with them – this thing was gone, I waited for a while as to see if I could see it again , but with no luck. If anyone else has any information or saw the same thing, post something on here as to share information and compare notes.",
      "link": "http://www.nuforc.org/webreports/073/S73679.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b961a",
      "summary": "Colorful and bright huge objects in sky.",
      "city": "fortworth",
      "shape": "chevron",
      "date": "2010-02-14T00:00:00",
      "story": "Colorful and bright huge objects in sky. At first I only noticed one object with very colorful and bright lights (red, green, blue, orange) shimmering rapidly from the object about 20 miles away in the sky from where I was looking, which was Southwest bound from Bedford, TX to Fort Worth. Then I saw another identical one  appear and slowly hover away.   No news reports as of yet to see what these things were.  I want to know! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74019.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9621",
      "summary": "((HOAX??))  Large Triangular U.F.O. Battles with Smaller U.F.O.s in Night Sky Over Ft. Worth, TX",
      "city": "fortworth",
      "shape": "triangle",
      "date": "2008-08-12T00:00:00",
      "story": "Large Triangular U.F.O. Battles with Smaller U.F.O.s in Night Sky Over Ft. Worth, TX Below, you will find an email that I just sent to some friends.  Note:  I filed one report on your website earlier, and left a voicemail message, so this is an important update.  I tried to leave another voicemail message, but your mailbox had become full.  Note:  I use the nickname \"Thoth\" with some of my spiritual friends.  URGENT: U.F.O.s Battle in Night Sky Over Ft. Worth, Texas  Large triangular craft dogfights with smaller disc-shaped U.F.O.s.  My spiritual friend XXXX in Ft. Worth, Texas, a fellow 11:11 \"promptee,\" sent me an update at 4:55 a.m. Eastern (3:55 Central [Ft. Worth]) on what she and her stepfather have been witnessing in the skies above their house tonight, Saturday July 12- Sunday, July 13, 2008.  Below is her latest email followed by my response.  Again, this is not a hoax people. I am a writer, metaphysician, and former professional journalist with the Hearst Newspaper Corp, CBS and NBC TV-news affiliates and would not joke about something like this. This is history being made!  ************************************************************  (my nickname),  Okay, I was just out there again. The sky was real clouded up, but not like normal clouds! More like how chemtrails are, a trail that swells up and gets fatter as it spreads out.I could see two of them, and yes, definatly what a dogfight would look like!  What I (we) saw earlier looked like a very large triangular shaped craft with several white lights around it and one red light. But they were blinking or rotating. The other ones were very small in comparison to those.Because it looked like they were flying right at them and then they would turn away sharply then the big craft would sort of chase it and then shoot out the opposite direction really fast.At one time we counted 6 of the large ones.  I am so glad my step-dad was there to see it too, I would of thought I was seeing things and not ever told anyone else. But I know what we saw!  (friend's name)  *************************************************************  (friend's name):  Okay, so are you telling me that it looked like a dogfight between a very large triangular U.F.O. and a bunch of smaller disc-shaped U.F.O.s?  If so, this mirrors what a few people have seen using expensive, military-style, night-vision scopes. They actually had a show on Coast-to-Coast about this several months ago, but I've never heard of anyone being able to see something like this without night-vision equipment. I know this sounds like something out of Star Trek, but the U.F.O.s must have had their cloaking systems down?  Remember how I told you recently that there are good E.T.s and others? Well, some who are supposed to be in-the-know say they have been fighting around the Earth lately because, believe it or not, and again this sounds like something out of a Sci-Fi movie, our planet supposedly is the site of the last struggle between the Light and the dark.  You, (friend's name), may have witnessed the opening salvos of the open Battle for Planet Earth.  Is this real or what?  Wow! You have witnessed history, Jeanne, and I have been able to tell the world about it. This really is something else!!!!!!!!!!!!!!!  What else can I say? Thanks for this update, keep watching the sky, and please try to keep track of all details regarding colors, shapes, time of events, etc. Do you have a camcorder? If so, use it!  Let me know more asap.  Thanks, and may God and the Angels be with you.  I will forward your update to everyone.  Again, please keep me posted.  (my nickname)  Important Note:  I sent a follow-up email to my friend in Ft. Worth with NUFORC's phone number, a link to your online-report form, and asked my friend, if she was able and willing, to contact NUFORC directly since she was the one who actually witnessed these potentially-historic events.  ((NUFORC Note:  Probable hoax, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64500.html",
      "state": "TX",
      "duration": "unsure"
    },
    {
      "_id": "64d005f478aba2ec5a3b9623",
      "summary": "Large triangular shaped craft with white lights blinking or rotating around it.  ((NUFORC Note:  Twinkling stars?  PD))",
      "city": "fortworth",
      "shape": "triangle",
      "date": "2008-08-12T00:00:00",
      "story": "Large triangular shaped craft with white lights blinking or rotating around it and one red light, July 12, 2008 10:30  p.m. Fort Worth, Tx. I was sitting outside in the dark looking at the sky and noticed what I at first thought was a star. Then it began moving around and changing directions real fast. It was triangular shaped with white lights all around it and one red light. The lights were blinking or rotating. There appeared to be other smaller crafts darting toward it and then they would turn sharply and go in the opposite direction. And the large triangular craft would sort of chase after them. Either the smaller crafts were shooting at the larger one or vise a versa. But you could see smoke trails  all around it from what looked like missiles. I went in the house and told my step-dad and he came outside too with his binoculars. We counted at least six of the larger crafts all around the sky. We could see what looked like laser lights shooting all around it, then it looked almost like fireworks. Then I saw something out of the corner of my eye and had to take a double look. Above the trees and the house next door was a ball of fire falling slowly to the ground but it almost looked like a big balloon drifting down real slow. I yelled at my step-dad to look, we stood there watching it trying to figure out what it was. It was real close and it looked like it was landing in the back yard across the street. I tried to follow it but lost it. I know it must be in the close area.",
      "link": "http://www.nuforc.org/webreports/064/S64503.html",
      "state": "TX",
      "duration": "approx. 3 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b985e",
      "summary": "Triangular craft with white glowing lights",
      "city": "fortworth",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "Triangular craft with white glowing lights My friend and i were driving, heading westbound on a near by dirt road, when a glowing light caught my eye. This wouldn't be the first time a glowing light has grabbed my attention before because i've spotted this same craft three times already. It was dark outside, but you could definately see the distinct shape of the ship- a triangle. It had two white larger lights glowing on each side of it, and four white smaller lights in the direct center.  I watched it for a good 30 seconds and it shot up right, paused- hovering, floated a little more to the right, then shot straight up into the air and disappeared.",
      "link": "http://www.nuforc.org/webreports/066/S66030.html",
      "state": "TX",
      "duration": "2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9909",
      "summary": "Does anyone know what is in the western sky from Fort Worth tonight. I saw 2 and one is still high in the western sky. It looks like 4",
      "city": "fortworth",
      "shape": "disk",
      "date": "2009-08-27T00:00:00",
      "story": "Does anyone know what is in the western sky from Fort Worth tonight. I saw 2 and one is still high in the western sky. It looks like 4 lights together that constantly move back and forth.  The other one we saw was visible to the north of the one there now and then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71576.html",
      "state": "TX",
      "duration": "still there"
    },
    {
      "_id": "64d005f478aba2ec5a3ba99e",
      "summary": "Red ball of light hanging in the sky July 4th 2010",
      "city": "fortworth",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Red ball of light hanging in the sky July 4th 2010 Oct. 3, 2010 Report Filing:   On the evening of July 4, 2010 at dusk, I was traveling north on a rural road west of Fort Worth, TX. Fireworks had begun in the distance; however over an unpopulated area, a bright glow was evident.  Note that it was just beginning to be dark and landmarks were visible. The object was North West of my position; about 70 degrees above the horizon.  The color was bright red along the color of a road flare.  The size I estimate was close to the size of a van or small moving truck.  The object was round in shape and a constant glow that was very visible.  I do not believe it to be a firework product since no others were seen anywhere or anytime during the 4th. The object was stationary for 30 to 45 seconds and went out instantly.  No smoke was observed in the area of the sighting.  I was shocked to read about this in several publications and decided to file this report.  I cannot identify the origin of the object but I will confess it struck me oddly at the time; and to this day.   Please note I am very sincere about this happening since it occurred near a Navy Air Base.",
      "link": "http://www.nuforc.org/webreports/078/S78123.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bab92",
      "summary": "At around  midnight I saw a UFO flying across the sky.  Two triangles Flying one in front of the other with a blinking light on the end",
      "city": "fortworth",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "At around  midnight I saw a UFO flying across the sky.  Two triangles Flying one in front of the other with a blinking light on the end As I was sitting outside with my little brother, something caught our eye in the sky. We looked up surprised at what we saw.  There were two triangle Unidentified Flying Objects in the sky flying one in front of the other.  The one in the back had a red blinking light on the back of it and was probably the brightest I have ever seen.  It was no more than 300 feet away from my brother and I. The sound was like a breath of air after being held under water for two minutes. Just an unpleasnt almost screatching breath in your ear. Like nothing i have ever heard before.  It was quiet but at the same time loud. its slowd down towards the middle of my sight as if it saw me.  Then quickly sped into the darkness, and disappeard.",
      "link": "http://www.nuforc.org/webreports/078/S78077.html",
      "state": "TX",
      "duration": "about 30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3babf0",
      "summary": "Very bright twin planet-like lights appearing to E/SE of Fort worth, TX that faded out very fast.",
      "city": "fortworth",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "Very bright twin planet-like lights appearing to E/SE of Fort worth, TX that faded out very fast. First of all, I am a believer in UFOs, although I have never actually seen one. I was sitting on the back porch, as I do every night, and watching the stars appear.  I noticed very bright lights in the East Southeast sky that were unusually bright.  They had the appearance and bright light of a planet but I knew this could not be the case. I am not sure what planet is in the Eastern sky over Texas this time of year, but these two objects were due South of this planet and appeared just as bright.  Almost to the point where you would think there three planets in a small cluster. There were several planes in the sky at the time, so it was easy to distinguish the two objects that I was observing and determine that they were not planes.  Plus, the objects were at a such a far distance that you would not be able to spot a plane that far away. As soon as I got up out of my chair to observe further, the object closest to the South vanished very quickly.  It did not appear to move away quickly, but rather it just faded out very fast. The other object was still shining brightly, just as bright as the planet to the North, and then, it too vanished almost immediately. Although I live very near to an Air Force and observe the flight patterns all of the time, this by no means resembled any of the planes that fly by and these objects were so very, very far in the distance that I do not think a plane could fly that high.",
      "link": "http://www.nuforc.org/webreports/078/S78221.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bae9a",
      "summary": "In 1958 witness 3 flying saucers from a distance of only 20 feet.",
      "city": "fortworth",
      "shape": "disk",
      "date": "",
      "story": "In 1958 witness 3 flying saucers from a distance of only 20 feet. This happened during the summer in 1958.  I lived in the only two-story house on my block when I was 8 years old.  My double bedroom window faced the East.  I always had to go to bed at 8 PM.  As I was climbing the stairs I began to hear a faint humming sound.  As I arrived at the top of the stairs and turned left to my open bedroom door, I walked across my room to my opened windows, as the humming became easier to hear.  As I looked out my window, hovering over my neighbor’s house were three small flying saucers hovering.  They were around 5 feet in diameter in a formation of a triangle, one in front and the other two behind the first.  They were roughly 5 feet below my window seal and no more then 20 feet away.  Back in the 50’s we didn’t have shows that were about UFO’s much less thought about them at my age.  I froze in disbelieve.  For at least a minute I watch and listened.  All three were identical.  First being saucer shape with a 2-foot diameter dome no more th! en a foot high, the outer skin was like frosted glass, barley transparent.  Around the edge was a 6 inch blue ring, shaped like dominos side by side.  In the middle of the dome was a pendulum that went counter clock wise around and around. It was easy to see passing under the frosted glass shell and the blue rings.  All the time making the humming noise as it revolved.  I had to prove to myself that this was real. I turned around with my back to them, but still heard the humming sounds they were making.  I turned back facing them and watch in amusement for at least another minute.  I again turned my back to them. As soon as I did, a few seconds past and the humming sound stopped.  I turn back towards my window and they were gone. I don’t expect anyone to believe me.  My parents just laughed just as anyone else would have who has never witness such an unbelievable sight.  I even don’t expect whoever reads this to believe my story.  I never told a soul till a few years back to my wife of 22 years.  As I told her, I am probably just a few people on earth who ever saw a UFO up close, much less three.  Most sightings I read about are lights in the sky, not something as clear as looking at your TV set across the room. I would not mind being tested under hypnosis or any other test to make believers of what I witness when I was eight years old, but I doubt if even that would ever happen. Because of my sighting I have no doubt what so ever that there are others in our universe.  As I became older I figured the small spacecrafts were more of a surveillance craft sending images to the Mother ship.  Not occupied by small aliens. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80381.html",
      "state": "TX",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bafbc",
      "summary": "In 1958 witness 3 flying saucers from a distance of only 20 feet.",
      "city": "fortworth",
      "shape": "disk",
      "date": "",
      "story": "In 1958 witness 3 flying saucers from a distance of only 20 feet. This happened during the summer in 1958 in Ft. Worth, TX.  I can’t remember the exact date since this happen almost 53 years ago, but I will never forget the moment I saw a UFO up close and in such explicit detail.  The colors and the moving parts of the spacecrafts. I lived in the only two-story house on my block when I was 8 years old.  My double bedroom window faced the East. I always had to go to bed at 8 PM.  As I was climbing the stairs I began to hear a faint humming sound.  As I arrived at the top of the stairs and turned left to my open bedroom door, I walked across my room to my opened windows, as the humming became easier to hear.  As I looked out my window, hovering over my neighbor’s house were three small flying saucers hovering.  They were not just hovering in a stable state, but were tiltering slightly as they were in their suspended state.  They were around 5 feet in diameter in a formation of a triangle, one in front and the other two behind the first.  They were roughly 5 feet below my window seal and no more then 20 feet away. Back in the 50’s we didn’t have shows that were about UFO’s much less thought about them at my age.  I froze in disbelieve.  For at least a minute I watch and listened.  All three were identical. First being saucer shape with a 2-foot diameter dome no more then a foot high, the outer skin was like frosted glass, barley transparent with a soft light within.  Around the edge was a 6-inch blue ring resembling dominos side by side.  In the middle of the dome was a pendulum that went counter clock wise around and around.  It was easy to see passing under the frosted glass shell and the blue ring, which encircled the outer edge of the top of the spacecraft..  As the pendulum past under the blue ring of adjoining blocks, each block darkened as I watch it pass going slowly counter-clockwise around and around.  All the time making the humming noise as it revolved.   saw no movement of life inside except the moving part of the pendulum. I had to prove to myself that this was real.  I turned around with my back to them, but still heard the humming sounds they were making.  I turned back facing them and watch in amusement for at least another minute.  I again turned my back to them.  As soon as I did, a few seconds past and the humming sound stopped. I turn back towards my window and they were gone. I don’t expect anyone to believe me.  My parents just laughed just as anyone else would have who has never witness such an unbelievable sight.  I even don’t expect whoever reads this to believe my story.  I never told a soul till a few years back to my wife of 22 years.  As I told her, I am probably just a few people on earth who ever saw a UFO up close, much less three.  Most sightings I read about are lights in the sky, not something as clear as looking at your TV set across the room. I would not mind being tested under hypnosis or any other test to make believers of what I witness when I was eight years old, but I doubt if even that would ever happen. Because of my sighting I have no doubt what so ever that there are others in our universe.  As I became older I figured the small spacecrafts were more of a surveillance craft sending images back to the Mother ship.  Not occupied by small aliens. ((NUFORC Note:  Date in 1958 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80534.html",
      "state": "TX",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bafd1",
      "summary": "texas",
      "city": "fortworth",
      "shape": "sphere",
      "date": "2010-08-24T00:00:00",
      "story": "texas was watching stars, seen glowing orange orb, took picture.",
      "link": "http://www.nuforc.org/webreports/076/S76936.html",
      "state": "TX",
      "duration": "1-2mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb025",
      "summary": "2 low flying crafts 400 yards high, no sounds of engines.",
      "city": "fortworth",
      "shape": "oval",
      "date": "2011-05-02T00:00:00",
      "story": "2 low flying crafts 400 yards high, no sounds of engines. Walked out side to look at stars within 20 seconds of being outside I saw 2 objects flying overhead at about 400 yards high, I did not hear any sounds of an engine.   I live by a Navy Airbase and Lockheed Martin so I am used to hearing planes fly over esp when flying that low to the ground.   The 2 objects curved off at about the same speed as a helicopter maybe faster, other possibility are it could have been a Navy UAV but they dont usally fly that low it seemed like the objects wanted to be low to the ground for some sort of Recon ((NUFORC Note:  Date may be wrong.  We have changed it to reflect a date in 2011.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80934.html",
      "state": "TX",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2df",
      "summary": "I saw a green circle with a red triangle under it and a round white circle off to the side dancing around in zig zag jurking munements",
      "city": "fortworth",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "I saw a green circle with a red triangle under it and a round white circle off to the side dancing around in zig zag jurking munements making no sound  The sky was clear with many stars. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Time of alleged sighting not indicated, so we have assigned an arbitrary time, based on the difference between time zones.  .  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78791.html",
      "state": "TX",
      "duration": "20 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bb645",
      "summary": "I went outside to sit and smoke a cigarette. A few seconds after lighting it, I looked over to the North and saw three glowing orange o",
      "city": "fortworth",
      "shape": "fireball",
      "date": "2011-01-05T00:00:00",
      "story": "I went outside to sit and smoke a cigarette.  A few seconds after lighting it, I looked over to the North and saw three glowing orange orbs in the sky. I immediately yelled for my husband to come outside. He came out and saw all three in the sky.  He went back in the house to find the video camera but couldn't locate it.  When he returned outside two of them had dissapeared.   We watched as the third and finale one slowly seemed to burn out and turn into a small silver speck in the night sky.  The three objects where heading from the Nort to a East by Southeast direction.  There where two other airplanes in the area shortly after the UFO's where gone.",
      "link": "http://www.nuforc.org/webreports/079/S79444.html",
      "state": "TX",
      "duration": "6 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc17e",
      "summary": "Red LED lite @ incredible speed, approached saw circular sheer curtain of opalecent color 6 rays glowed around circle",
      "city": "fortworth",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "Red LED lite @ incredible speed, approached saw circular sheer curtain of opalecent color 6 rays glowed around circle Saturday September 17, 2011 4:31am: I went outside, was on 2nd floor balcony, which faces due south, smoking a cigarette before I went to sleep, wasn't looking into sky, and was looking straight ahead into next apartment building breezeway. A small non-flashing, red light (like a LED light or power indicator light) came into my field of vision; I wasn’t looking up at the sky or anything.  It immediately captured my interest because I thought it was flying extremely low.  I then considered a logical explanation; I thought it must be a helicopter?  However we don’t see many helicopters in this neighborhood unless it’s the law chasing somebody & if that were the case, there would have been searchlights.  We are not close to the hospital district, downtown police helicopter landing strip, or airbases. I considered that maybe it was an airplane of some sort?  If it was, wouldn’t it be flashing?  In addition, don’t they have flashing white lights as well?   As it approached, I heard absolutely no sound whatsoever. The sky was clear; however it had rained for the 1st time in over four months most of the day before.  The air was humid & thick.  What I saw was moving at an extreme high rate of speed, faster than anything I've seen.  I couldn’t take my eyes off it and I blinked a couple times, just in case my eyes were playing tricks on me. It remained at the same elevation, heading from my right to left diagonal path.  As it grew closer, I noticed some sort of circular type field around the red light in center.  This circle was not a sphere; it was more like a sheer curtain, flat, possibly a force field?  The circle was translucent & it was glistening/shimmering opalecant colors (pink, blue, green crystal).  It was not twinkling like Christmas lights, no blink pattern at all, it was more iridescent like abalone shell, but again it was about 40% transparency.  There was also some sort of crystal beams or rays; I think 6, surrounding the opal circle.  They were shining from the circular field, all the same length, just about the length of the circle in size. I simply couldn't take my eyes off it. I then realized I had my Android mobile in my hand, so I hit the buttons to quickly try to capture it on digital.  It took me less than 5 seconds to get it started, by then; the object was straight above me. I tried to get it in my viewfinder, but it was moving so quickly, I just couldn't keep up.  I attempted 3 shots, about 8 seconds apart, unfortunately, I've no flash & the lens was on the full zoom out level. It then was out of my view as it flew over the building.  I ran down the stairs trying to adjust the zoom in, I got to ground level and out of the breezeway.  However, my view was then blocked by the building. In retrospect, I should have run to the street, but I didn't think of it, I was so amazed!  The event lasted about two minute’s total.  I felt no fear of the object; I know they didn’t notice me.  I gave up & went upstairs & into the apartment.  I looked to see what I might have gotten on digital, but with no luck, just darkness.  I went to sleep.  I woke up at 10am & the first thing that went through my mind was the event.  I plan to upload the photos onto my computer & see if I can find anything by resizing them.  I have started a drawing of the object in Adobe Photoshop.  To my knowledge, no one else witnessed the event. I will send a drawing of what I saw in a future report.  Lat: 32.65, Long: -97.40 (this is the info from the camera)",
      "link": "http://www.nuforc.org/webreports/084/S84023.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bce1a",
      "summary": "10 flashing white lights hovering in place. Pyramid formation. Disappeared after 20 minutes",
      "city": "fortworth",
      "shape": "formation",
      "date": "2011-05-29T00:00:00",
      "story": "10 flashing white lights hovering in place.  Pyramid formation.  Disappeared after 20 minutes My roommate and I were having a cigarette on the back porch last night (technically this morning).  There's a wooded area just east of our house.  Over the course of about 20 minutes, a group of whitish lights began to flash Over the woods.  I would estimate that they were about  a mile away, maybe half a mile off the ground.  The lights seemed to hover in place in a vaguely pyramid shape.   My roommate tried to get a video of it on his phone, but his camera is pretty useless and wouldn't help my case at all.   After 20 minutes had passed, the lights slowly began to fade.",
      "link": "http://www.nuforc.org/webreports/081/S81284.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcf93",
      "summary": "Large sphere UFO passing next to my house, twice the size of a full moon",
      "city": "fortworth",
      "shape": "sphere",
      "date": "2012-09-24T00:00:00",
      "story": "large sphere UFO passing next to my house, twice the size of a full moon Date/Time: 2011-03-12 22:35 City:    Fort Worth State:    Texas Shape:    Circle Distance:    One mile or less Entity Type:    None, Unknown Vallee Index:    FB1 Summary: Moon like globe shoots across the sky from left to right  Report: I was sitting by my pool facing the east playing my flute. It was a warm evening with good visablity. While I was playing my flute, all of a sudden I saw in the corner of my eye a bright white light coming in to my view from the southeast part of the sky. I stopped playing and watched as this bright white globe streamed across the sky from  (southeast to north), desending from right to left at about a 40 degree angle towards the ground. It was very close, not far away. I did'nt know what it could be. I really didn't have time to think about it, it happened really fast. It looked like it was just above the greenbelt behind my house. It appeared like the full moon, yet it was at least twice as large as a full moon. Also, the moon was behind me and was only partially lit, maybe a 3rd of the moon was lit. So it definitly wasn't the moon.  It almost seemed like it was just east of the house next to me, maybe a little further, maybe a 100 yards, where there is a green belt that separates our houses from the apartments that are on the top of the hill. As it streamed across the sky, after about 4 or 5 seconds it produced two little white flare like jets of fire, one on the top, and one on the bottom of the globe. The outside part  of the globe then started spinning in a clockwise motion while it was descending, the inside of the globe was stationary. This lasted about 3 or 4 seconds. Then, it fell towards the ground. When it was about to hit the ground I, stood up and screamed &quot; Oh My God &quot;, as I expected to hear a large explosion. But it went behind the trees and dissappeared with no sound. The whole time of the sighting, there was no sound coming from it. I looked at my watch and it read 10:35 PM CST. I want to repeat that this globe was large and moving slowly at a 40 degree angle downwards. It wasn't the moon, it wasn't an airplane or helicopter. I've never seen a ufo before,and I never expected I would ever see something like this. It's ! the most incredible thing I've ever seen in my life. In regard! s to my feelings, I started thinking about the events that are happening around the world. In Japan, New Zealand, and the volcanoe in Indoensia erupting. I started becoming concerned that this was a sign or a warning. I was worried that more was about to happen, but it didn't.  At least not last night.  These were just my feelings.  The experience was very intense and I still have so many questions.  That's really all I can convey at this time.",
      "link": "http://www.nuforc.org/webreports/092/S92420.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7b9",
      "summary": "My wife and I were sleeping in our bedroom and around 2:45am I was suddenly woken up. I was facing a closed window in our room and the",
      "city": "fortworth",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "My wife and I were sleeping in our bedroom and around 2:45am I was suddenly woken up. I was facing a closed window in our room and the window has a brown shade over it.  However, I noticed a red ball of light on the inside that quickly passed through the shade and window and disappeared, either moving away or dissolving on the outside of our house. I just read a ton about ball lightning, but I doubt ball lightning inspects people or their houses when people are sleeping. It sounds more like a monitoring tool of some sort.  I remembered watching UFO reports about balls of red light floating over houses and fields.  And I wonder if this is one of them.  Anyone else experience something like this?   I can only hope that if it is a monitoring tool, that we didn't show any reason for further interest in us!  Haven't been able to get back to sleep yet for the past hour and a half.",
      "link": "http://www.nuforc.org/webreports/092/S92535.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bda2f",
      "summary": "Me and some friends were in northside in fort worth TX,  going home when we seen what look liked 2 fireballs coming down fast,  we all",
      "city": "fortworth",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Me and some friends were in northside in fort worth TX,  going home when we seen what look liked 2 fireballs coming down fast,  we all looked up to see cause some friends were in the truck bed and they pointed them out.   I kept good eye on one of them to see if it was going to hit but as it approached closer it seemed like it was a oval with a halo around it the color was red was flying about airplane height & then as it slowed down it started to fly away really fast,   last maybe about 2 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93571.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bdbd2",
      "summary": "I was walking to my laundrymat in my apartment and looked directly in the air maybe looking 2 miles away and my attention was instantly",
      "city": "fortworth",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "I was walking to my laundrymat in my apartment and looked directly in the air maybe looking 2 miles away and my attention was instantly drawn to.  A bright glowing orange ball and instantly ran to my apt to get my brother to check this out I had a overwhelming feeling over me like panic yelled at my brother to get his ass off the couch and it took me about 10 secs to get to my apt and by the time.  My brother walked out it was overhead myself 1 mileabove a bright glowingappearedthecolomorningsun for10seconds we witnessesed ittravell about a mile and instantly ear jet aircraft ad a helicopter appeared and the object gradually dissapeared like it had a cloaking device. I don't have video proof but I know there is obvious radar problem if jets were scrambled. I believe I would have diffinitive proofs of advanced technology.  I know I waswnot the only witness. Check radar and flightplans at 8:22 pm and see.  Were you get. I don't havve the means or I would.Cl this out pl! ease.  Whatever I witnessed was overwhelming.  And I instantly had a Denver that I was witnessing a anomaly or something advanced ((nuforc Note:  Date is flawed.  We have assigned the date that we suspect the witness intended.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92713.html",
      "state": "TX",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be14b",
      "summary": "Large grey UFO flies with no sound",
      "city": "fortworth",
      "shape": "chevron",
      "date": "2012-05-29T00:00:00",
      "story": "Large grey UFO flies with no sound I was sitting out in my backyard, watching the meteor shower we were having. If my eyes had not been fixed on the sky, I would have missed it.  The UFO was a Grey color, almost blending into the sky behind it. It was a strange shape, and it was flying pretty low (I can't say how many feet).   What struck me was the fact that there were no lights and it made absolutely no sound as it was flying. I honestly couldn't believe what I was seeing.  I have never reported anything like this before, and felt really silly telling my friend who was on the phone what was happening to me, but I've never seen anything like that before.  It was unbelievable. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89029.html",
      "state": "TX",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be855",
      "summary": "Huge UFO over Fort Worth may 8, 2012",
      "city": "fortworth",
      "shape": "disk",
      "date": "2012-05-13T00:00:00",
      "story": "Huge UFO over Fort Worth may 8, 2012 I was driving down Ray White Boulevard when I looked up to the sky and saw a huge aircraft hovering by a water tower.  It had 4 bright white head light, 1 blue-ish light on the tailed and one red light underneath on the bottom of the saucer.  It hovered for a few seconds after it had made its way to the water tower, then it sped off in a upward, and I the right direction.  As I chased it, it went out of my view and I drove around the corner and found it hovering above a local middle school.I stopped looking for it.  Then I started chasing it again and it sped away, in the upward to the right motion. I couldn't find it anymore do I went home.",
      "link": "http://www.nuforc.org/webreports/088/S88861.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb78",
      "summary": "Dark triangle with three Blue lights!!!",
      "city": "fortworth",
      "shape": "triangle",
      "date": "2012-02-03T00:00:00",
      "story": "Dark triangle with three Blue lights!!! My boys out side after dark picking up Skate ramp notice 3 blue lights from corner of eyes. Looked up about 100 ft and noticed a dark triangle with 3 blue lights hovering for about 10 seconds then the whole object just dissapared !!!!  The object was the size of a 2 story house and made no sound!!!",
      "link": "http://www.nuforc.org/webreports/086/S86990.html",
      "state": "TX",
      "duration": "10sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bedaa",
      "summary": "Stationary Light with lights shooting down to ground",
      "city": "fortworth",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Stationary Light with lights shooting down to ground About 6:50 AM CST this morning I was outside have my morning coffee.. It was still very dark the sun was not yet rising.  I was looking SW in the sky. I saw a stationary light just above the horizon..  At first I thought it was maybe a helicopter because it was not moving. I saw another light approach the stationary light then suddenly 4-5 lights dropped out of the stationary light straight down to the ground.  The stationary light disappeared. I watch the sky for another 20 minutes but saw nothing",
      "link": "http://www.nuforc.org/webreports/096/S96713.html",
      "state": "TX",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2b6",
      "summary": "Fireball.",
      "city": "fortworth",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "fire ball Traveling from south to north, about the speed of a plane without any noise.  Looked like a flame across the dark cloudy sky for about two minutes",
      "link": "http://www.nuforc.org/webreports/097/S97159.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd30",
      "summary": "Glowing orange/red object, seemingly traveling at a slower speed, definitely NOT a plane.",
      "city": "fortworth",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "Glowing orange/red object, seemingly traveling at a slower speed, definitely NOT a plane It was a glowing orange/red light floating across the sky.  We were initially facing North and watched it travel over ours heads in a southerly direction.   Rather than disappearing into the southern horizon, the object continued traveling at a 40 degree angle, eventually disappearing out of sight.   The object's speed was that of a slower airplane and its elevation was below the clouds yet no discernible features were visible.   It was slightly larger than a typical lighted plane. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95663.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0150",
      "summary": "A round ball of fast flashing a solid White, Red, and Green lights (as this * looking much like a planet in size) in the southwest sky.",
      "city": "fortworth",
      "shape": "light",
      "date": "2013-09-09T00:00:00",
      "story": "The shape was a round ball of fast flashing a solid White, Red, and Green lights (as this * looking much like a planet in size)in the southwest sky.  It would sink a tiny bit then raise again then head towards the northwest a tiny bit and back again, but always staying in same vicinity.  We saw it a couple of weeks ago as well staying about the same amount of time. Unable to take a photo with our small Canon.  Tonight we looked through the binoculars 7x50mm field of view 1000 yds=376ft. not the best but it was all we had.",
      "link": "http://www.nuforc.org/webreports/102/S102044.html",
      "state": "TX",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ea3",
      "summary": "Orange ball stationary in sky above neighborhood south of Fort Worth before leaving northbound.",
      "city": "fortworth",
      "shape": "oval",
      "date": "2014-01-10T00:00:00",
      "story": "Orange ball stationary in sky above neighborhood south of Fort Worth before leaving northbound While driving northbound out of the Carson Ranch estates, north of Crowley and south of Fort Worth TX, my daughter and I observed an orange light or “thing” floating completely motionless above the neighborhood at an altitude of what I perceived to be between 50 and 100 ft.  It seemed to appear out of nowhere. The sky was clear. At first we thought it was some kind of flaring firework because people had been setting off fireworks in the area as the New Year began 45 minutes prior.  We were baffled that this “firework” was suspended motionless in the air as we were driving past it.  It was more baffling that, upon further observation, the light appeared to be an illuminated, orange ball hovering in the sky.  It did not appear perfectly round like a sphere; but, rather, it looked more ecliptic or egg shaped.  The object was to the right, or east, of us by a perceived 200 or 300 meters away.  After looking at it for about 15 or 20 seconds as we were driving by, the object suddenly started moving!  It travelled northward.  Neither my daughter nor I heard any noise emanating from it. With my curiosity peaked, I proceeded to “chase” the object and turned eastbound as it continued northbound, east of us.  The object appeared to start accelerating and gaining altitude as I drove under its path of flight.  At this point, I got my phone camera rolling. I turned northbound at the next street.  However, the object was now going too fast to catch up while driving down residential roads.  I stopped my car and continued filming for a few more seconds until it was too far and faint for the camera to pick up anymore.  However, I could still see it with my eyes as it changed its heading from north to northeast.  I could tell that it changed course by using a street light as a reference point. As the object was moving, its illumination had a slow, subtle pulse to it in about 2 or 3 second intervals, from bright to dim then bright again, repeatedly.  The pulsing was very subtle and not immediately obvious. This was NO Chinese lantern!  It had started moving from its initial stationary position much too quickly. It was not windy; 5 mph at the most.  This also had too much range and speed to be a remote controlled helicopter.  If it was a drone or UAV, why would it be illuminated orange as a whole?  And why so low?  I am very curious as to what this object could have been.",
      "link": "http://www.nuforc.org/webreports/105/S105925.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11a7",
      "summary": "We took our dog out around 7:45, when I noticed a bright light in the Western sky.  I go out several times at night and I have never se",
      "city": "fortworth",
      "shape": "light",
      "date": "2013-12-23T00:00:00",
      "story": "We took our dog out around 7:45, when I noticed a bright light in the Western sky.  I go out several times at night and I have never seen a star there this past month, mostly due to city lights.   I went and got our binoculars and observed through them that the light was rapidly flashing multiple colors.  Red, yellow, blue, and green.   It has not moved yet at 8:11 pm.  I am going back outside to watch it.",
      "link": "http://www.nuforc.org/webreports/105/S105367.html",
      "state": "TX",
      "duration": "Still there"
    },
    {
      "_id": "64d005f478aba2ec5a3c164f",
      "summary": "Me and a friend of mine were driving down Alemeda St between Westpoint Blvd and Academy Blvd when we saw an orange orb in the sky. Once",
      "city": "fortworth",
      "shape": "cylinder",
      "date": "2013-10-23T00:00:00",
      "story": "Me and a friend of mine were driving down Alemeda St between Westpoint Blvd and Academy Blvd when we saw an orange orb in the sky.   Once we stopped, the orb started moving south and slowly went dark.  Once it was dark we could see it was some sort of craft that was tubular and black.  It was completely soundless and very smooth in its movements.   As it was moving south it would slowly spin but kept moving in a straight line.  It stopped near the I-30 and I-820 interchange and hovered there for a few seconds and then flew west at a very high rate of speed and still made no sound.   We tried to find it again, but we were unsuccessful.  I tried to take a video with my cell phone, but nothing can be seen but the night sky and moon.",
      "link": "http://www.nuforc.org/webreports/103/S103306.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ab1",
      "summary": "Blue & Red Orbs Merge & Vanish.",
      "city": "fortworth",
      "shape": "unknown",
      "date": "2014-07-26T00:00:00",
      "story": "Blue & Red Orbs Merge & Vanish I do not know what I saw.  It was gone as fast as I saw it.   All I can say for certain is a blue orb, and a red orb on the west horizon seemed to collide, with no sound, or explosion.   It happened very fast as the two objected merged, and quickly disappeared.",
      "link": "http://www.nuforc.org/webreports/111/S111757.html",
      "state": "TX",
      "duration": "~5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c28c7",
      "summary": "I know the Feds know more than what they're claiming too, I've swatched from the shadows too many years.",
      "city": "fortworth",
      "shape": "sphere",
      "date": "2014-08-29T00:00:00",
      "story": "I know the Feds know more than what they're claiming too, I've swatched from the shadows too many years. \tI was a warehouse worker, on the job, at 620 pm, at one of the factories on the Southside of Fort Worth, Texas, during the evening--shortly before sunset. \t\tI was moving stock up a ramp, in back of the main 2 story office/factory building, when I noticed a sun glint, in the sky, over a neighborhood across the street from the plant. \t\tThe gilt was around 20-30 stories high as I measure the downtown towers, I use to work around high-rise buildings for a number of years. \t\tBecause of their size, I at first mistook them for a C-130 cargo plane, climbing, as UPS and other carriers often fly over from the airport, so I was just about to look away, when I noticed an odd pale glow. I took out my pocket binoculars to look closer and saw two metallic spheres. They had deep groves along the equator, with plated skin like an air craft. They were close together as if they were magnetized – with a white vertical beam of light or gas jet that seemed to balance them – as they made see-saw and wobbling motion from the high wind gust—they seemed weightless. They reminded me of a bubble head doll as they moved north by south wobbling, and this odd white beam remained fixed between them like a balancing rod. They seemed in a hurry and one seemed disabled, with the other, facing south as the tolling craft. I could tell that they were flying directly over the houses across the way on Mcart Street. I soon got concerned about that white beam pointed toward the ground, as I watched the objects move through a cloud, I lost sight of them, and became fearful they might turn my direction. That beam was at least 200 feet downward with 5 feet width or more, as far as I could guess, but I couldn’t tell what kind of energy it was made of – gas or light. I quickly went inside the building. When I got the nerve to come back out, on the street side, I noticed a man walking on that sidewalk unharmed. So I quickly moved to the sidewalk on Mcart – but when I got out where I could see the sky better, the objects were gone. An airbus came from the south direction at the same altitude – so I got to compare its size, using my finger and I determined the two spheres were half as long as the airbus. That meant each had enough room for at least 50 human size passengers. The fact, I didn’t see the spheres anymore – didn’t surprise me, as that wasn’t the first sighting of such objects, in that area and elsewhere about the city. Here’s a spot for more of my background. My interest in UFO has been a on and off affair –since my mother recounted a close encounter at a very young age. She the youngest girl and a uncle the youngest boy of 13, on a farm around 1934 or 5, where they came within ten feet of a glowing sphere. “It was a huge white ball with black lines running from pole to pole and it hummed like a high voltage transformer.”  I asked her how close it was.   She pointed to a wall about ten feet away.   She said, “We had snuck out that night and was about to cross an open field, when this huge ball suddenly lit up in front of us!  We just watched it for a few minutes, then, the older ones grabbed {her & my uncle} and took off down the road…we never saw it again.” That story was verified by her siblings as much as 40 years apart – each time they initiated it. It wasn’t until July 1973 when I had my first sighting. I had just arrived in Texas and was living in Dallas at that time.  I was outside reading a book, on the back lawn, when I notice a squadron of F-16 fly over.  They were moving rapidly west to east -- in formation with 5 or 6 glowing spheres that phased in and out of sight. That incident made me more aware of my surrounding, but it wasn’t until a night in July 1997 that I saw a test flight of a craft that was man made; it took off along I-35w near an air strip I know of in Keller, TX. It was long and big about the size of a 727 and that was about 9 pm as I was moving north on I-35.  I saw it lift off from below the trees – it had a faint pale greenish blue glow.\t \tIt was invisible to anyone beneath a street light or anyone in downtown area. \tI just happen to be in the right spot at the right time, when it climbed to a height directly over the Bass tower in Fort Worth, and it stopped on a dime.  It remained at station keeping for several seconds; it began moving in wide circular patterns, so fast, it seemed to be two places at once. \tThat went on for almost 30 minutes, then, it returned to its landing strip.  Being a member of a large family, I had relatives in various fields – like the corps of engineers. Sometimes they went to work at the D.U.M.B. where CIA security have to supervise their handling of blueprints stored in a metal scroll like device, so only their area of work is visible. We figured down there is where the craft proto-types are stored and developed. \tSince I worked at this factory location, I’ve been able to spot a number of alien objects and observed the government’s reaction. It was a clear night, on a Friday, in Feb. 2008; I had just arrived for work at 11pm, when I saw a bright object drop in the southeast. I thought it was a meteorite and looked away, I continued walking north along the loading rim of the loading dock. I went up a short flight of stairs, got my clipboard and continued north, passing 3 overhead docks door. I was about to cross the space of 45ft, between buildings, when I glanced to my left, towards a long 1 story building that ran north by south and next to it was the 2 story front office building. I looked and saw that same bright yellow object still in the sky. “That’s no meteorite!”  I said out loud, as I watched the object make a controlled landing not more then a few blocks away from where I stood.   It looked that close.  And it was at least 30ft wide shaped like an egg – but extremely bright like the sun,  I use to work at an airport and seen hundreds of chopper landings in all weather conditions and that thing made a perfect soft vertical landing. I just took off for the front as fast as I could navigate the complex and when I got to Mcart Street – I saw no trace of it. That object was as bright as the sun.  I expected to see a fire on somebody’s roof – it came down right below the roof level of our complex – and it appeared very close. I was expecting a chopper to arrive, one did, a gray one, but it was circling the wrong area.  It did so all night, leaving once to refuel and came back. Days later, I saw one odd looking black chopper fly about the area, in a search pattern, but it didn’t stay long. About 2 week after that, the chemtrails started and so did larger objects appear. I’ve lived and worked in this area 10 years and never seen a chemtrail.   But now, it sprayed as thick as a blanket, until the sky has an eerie look and smell. \tOne weekend I noticed a small blimp with an Insurance company logo, fly over this cluster of houses located in an isolated spot where gravel is dump and hauled. \t\tI was driving stock toward the warehouse headed west as I saw it, the blimp turned toward me.  It came directly overhead, I suddenly got sick.  My pulse started racing and I felt flushed and it lasted until the blimp moved away from me. \t\tI moved clear of the area and watched with my binoculars as the blimp just kept circling this one cluster of houses for several hours until just before sundown and then it went away headed north. \tI saw it return weeks later, from the north and circle this same group of houses, seemly all afternoon, then, it would leave the way it came.  Inside the blimp I saw one, or two people in the cabin at the flight controls – but no passengers. Shortly after that, maybe a week or more, I saw an airbus moving eastward with a huge thick trail of dark smoke behind it.  I almost thought it was in trouble, because I saw what I took for smoke move away from the cabin, but it wasn’t smoke. \t\tI was wearing a pair of very dark sun glasses that enabled me to see the object clearly, as it was almost invisible to the naked eye. This object that cut across the path of this airbus was huge – it dwarfed the plane by thousands of feet. It moved toward the ground in a U shape – when it reached the ground it dissipated. \tI looked toward the south of the plane where the sky hadn’t been spray-- and saw this mass of objects move from the upper atmosphere and cross paths with the plane, once again moving toward the ground. I thought they were meteorites. I could see grainy chunks moving in mass toward the ground, with a faint pale yellow green color and dissipate as they reached about 100 feet. After a moment of trying to figure out what I was seeing, I then thought it was a sun flare that had punched through the atmosphere.  But it wasn’t that. I saw another object come down and cross paths with the airbus, and as I advanced closer, I could see chunks of inner mass move in long stringy formations, like a jellyfish tentacles.  \tAt that point I began to wonder, if I wasn’t seeing something that was alive. Then I realized, all during this incident, the plane hadn’t moved much since I first saw it.  It was still in the same place in the sky. \tThat plane was spraying a huge mass of chemicals and I was ready to stay clear of it, so I fled indoors.  \tThe black opts projects in Texas are in full gear! Since May, 30, 2008.  I’ve stood below test shots of energy beams, 20  to 30 feet wide, shot from a University rooftop at clouds 60 ft above my neighborhood,  I seen metal framed jet powered drones fly overhead. \tI’ve even seen our folk, or them, make a huge Jacob’s ladder or escalator in the clouds for about 55 minutes. \tYou could see the moment they turned the switch off, the wind and clouds settled down, as if nothing had happened.",
      "link": "http://www.nuforc.org/webreports/112/S112770.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e49",
      "summary": "“Star” after sundown before stars out; instantly became brighter; white cloud like explosion; an object shot out.",
      "city": "fortworth",
      "shape": "other",
      "date": "2014-09-05T00:00:00",
      "story": "“Star” after sundown before stars out; instantly became brighter; white cloud like explosion; an object shot out My wife and I witnessed an event that appeared to be an explosion of a very high aircraft or even a spacecraft.  I reported to 911 as we were observing it.  The 911 operator called back about 40 minutes later advising that she reported our sighting to the FAA and suggested I submit a report to you. At 8:05 PM, about 30 minutes after sundown my wife and I were in the back yard.  The sky was clear, half moon very bright.  Light from the sun was still glowing in the western half of the sky.  No stars were visible yet. My wife pointed to a very bright star almost directly overhead.  It was a Venus type brightness.  I realized that it was too early for stars and is Venus currently visible at dawn.  I then assumed it was a satellite reflecting sunlight which we often see.  I quickly realized if it was a satellite it had to very large, like the International Space Station which we are familiar with.  The ISS is not visible for us at this time.   I immediately recognized the “star” object was not a satellite because it seemed stationary almost directly overhead.  It was absolutely not moving across the mid-point of the sky at the pace we often seen evening satellites moving. Looking at the object for ten plus seconds it suddenly became several times brighter.  The new brightness lasted about five seconds and then quickly dimmed to less brightness than it was originally.   A few seconds later a white cloud appeared around the star like object.   We describe the size of the cloud as 20-30 diameters of the “star” object.  I arrived at that diameter simulating the size of the “star” object with an ink dot and thereby extrapolating the size of the cloud.  The cloud was semitransparent rather that a very solid white; however it was definitely white.   Suddenly a bright “star” like object moved out of the cloud area at an angle to the right and from our perspective it appeared to be moving downward as if falling toward earth.  The “falling” object was far less bright than the original object. I had my cell phone in hand so I dialed 911 to report the sighting in case it was some type of high altitude explosion.  The cloud and falling object were visible as I made contact with the 911 operator and gave my report.  The cloud and then the object faded from view while I was still on the phone, which I assume was about a minute. I checked the exact time of the sighting by my cell phone record of the 911 call. After the sighting faded, I looked around in the sky and because of the fading sunlight, there were no stars or planets visible.",
      "link": "http://www.nuforc.org/webreports/113/S113186.html",
      "state": "TX",
      "duration": "100-120 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c304e",
      "summary": "A blue meteor that suddenly stopped.",
      "city": "fortworth",
      "shape": "circle",
      "date": "2014-08-08T00:00:00",
      "story": "A blue meteor that suddenly stopped On August 2, 2014, 5:58am I was driving westbound on John T White Rd in east Fort Worth, just off Eastchase Parkway.   My wife was in the passenger seat.  I witnessed a blue meteor directly through my front windshield just to the left of my rear view mirror.  I started to point and tell my wife there was a meteor and then it stopped in place.  She asked me why I was pointing at a star and I told her it could not be a star.   The object appeared to have come from the northwest and traveled across the sky rapidly like a typical meteor only it stopped suddenly.  It stopped in the western portion of the sky about a quarter of the sky up from where the sun would set before I lost visual.  There was no fluctuation in the light at all and no tail.  There were no blinking lights only solid blue like a bright star.  I told no one about this except my wife who was with me.   The next day on Facebook a few friends mentioned seeing a blue light in the sky behaving oddly so I knew it was not just a onetime fluke.",
      "link": "http://www.nuforc.org/webreports/112/S112278.html",
      "state": "TX",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4186",
      "summary": "Light beam over Fort Worth, TX.",
      "city": "fortworth",
      "shape": "light",
      "date": "2015-05-13T00:00:00",
      "story": "Light Beam over Fort Worth, TX. On May 12, 2015, at approximately 12:00 a.m., I went out on my 3rd floor apartment balcony located in Fort Worth, Texas.  The night was overcast and through the clouds, I noticed a light move across the sky and assumed it was an airplane.  After a few minutes, I noticed the same light.  As I continued to observe it, I noticed it was moving in a circular pattern – clockwise – over the same area.  It was one white light beam that was not clearly visible until it moved out of the clouds.   Using my compass, I noted the lights were coming from 326 degrees NW.  I watched the lights for over 40 minutes before returning inside.  The beam continued the same circular pattern and moved at the same speed.",
      "link": "http://www.nuforc.org/webreports/118/S118930.html",
      "state": "TX",
      "duration": "40 minutes+"
    },
    {
      "_id": "64d005f478aba2ec5a3c421c",
      "summary": "100 orbs over Jacksboro golf course.",
      "city": "fortworth",
      "shape": "changing",
      "date": "2015-04-23T00:00:00",
      "story": "100 orbs over Jacksboro golf course I was staying at valley motel room 24 on the end, went out side to smoke a cigarette so a blinking light floating towards the road got phone camera, started first video on on side of Jacksboro high to film the one when I noticed as it went across the street there were a lot more, one man walking across street, asked him what those were, he said satellites and he didn't know and walked off, filmed the on it stayed hovered above street light, half way there 12 min video I got a chance to run across street film other half.  I only filmed there that long because I was being yelled at by manager asking what I was doing, I said you don't see them.  Poor old man couldn't.  He made me go in.   I tried to upload video but it was to big by mobile so I went back out and saw took small couple second video and 3 stills. the manager said the police were called because I was in the street, I went in side.  It was about 20 mins before the police came and the video is not the best!  I was worried I was going to jail and looked over the officers there were 2 shoulders and saw one, and said look see it. and they did. the put in report I was looking at night sky. They left and I watched in the door for about 10 more mins manager made me go back in. https://www.youtube.com/watch?v=JmRJi7faBQk",
      "link": "http://www.nuforc.org/webreports/118/S118567.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c42ea",
      "summary": "I saw what I thought to be a cloud, but it was moving a steady pace across the sky. When i realized it was not a cloud i quickly though",
      "city": "fortworth",
      "shape": "other",
      "date": "2015-04-17T00:00:00",
      "story": "I saw what i thought to be a cloud, but it was moving a steady pace across the sky.  When i realized it was not a cloud i quickly thought maybe a flow of birds.  But it was not birds it was a bunch of white looking shapes like clouds but spread apart but close enough to make a boomerang kind of shape and it past right above me then disappeared.   I still can't belive what saw",
      "link": "http://www.nuforc.org/webreports/118/S118310.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c610d",
      "summary": "Noticed something very bright reflecting the sun.",
      "city": "fortworth",
      "shape": "cigar",
      "date": "2016-10-27T00:00:00",
      "story": "My husband and I were driving back to the hotel we are staying in here in Fort Worth Texas.  We just finished dinner.  It was approximately 5:30 pm and we were on hwy 170.  I was in the passenger seat and we were driving into the very bright afternoon sun.  I looked at my husband while we were talking and noticed something very bright reflecting the sun in the sky out his window past his head.  It was reflecting just like a mirror, it made me want to squint.  It seemed to me it was reflecting the bright sunlight.  It was hovering above a field- completely still in the sky.  I said \"What is that?\" but he couldn't take his eyes off the road to look because of heavy traffic.  I leaned towards him trying to see around him.  I saw it go to plain grey metal color and I could tell it was shaped like a bar.  It was completely still in the sky.  No movement at all.  I kept leaning around him and trying to re-adjust myself to keep it in view and then suddenly, it was gone, as if it had just disappeared.",
      "link": "http://www.nuforc.org/webreports/130/S130854.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c69bd",
      "summary": "4 lights at a perfect angle slowly moving south.possible triangle formation.",
      "city": "fortworth",
      "shape": "light",
      "date": "2017-03-10T00:00:00",
      "story": "4 lights at a perfect angle slowly moving south.possible triangle formation.",
      "link": "http://www.nuforc.org/webreports/133/S133017.html",
      "state": "TX",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b65",
      "summary": "Camping in a back yard with a friend, a creature looked into the tent at us, at which point hours were lost.",
      "city": "fortworth",
      "shape": "unknown",
      "date": "2017-01-26T00:00:00",
      "story": "Camping in a back yard with a friend, a creature looked into the tent at us, at which point hours were lost. I was approximately 11 years old, staying overnight at a friend's house, \"camping out\" in his back yard.  My friend had fallen asleep quite suddenly, and I heard what sounded like an animal shuffling around in the grass outside of the tent.  Normally this would not have scared me, but for whatever reason, it did, just then.  I turned and looked at the screen in the tent flap and saw a head, shaped roughly like a football on its side, looking in at us in the darkness.  It realized I was looking and quickly dropped out of sight.   At this point I did what any normal person would do - I covered my head.  I looked out a couple of minutes later (so I thought) to find it was mid-morning.  My friend was still asleep, and I was thoroughly confused.   I have no idea what I saw that night, and no idea what happened in the time from covering my head to the next morning.  Again, it seemed like a couple of minutes, but was actually hours. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132295.html",
      "state": "TX",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c724d",
      "summary": "Bright object in early morning sky.  ((NUFORC Note:  Possible sighting of Venus??  PD))  ((anonymous report))",
      "city": "fortworth",
      "shape": "sphere",
      "date": "2017-06-22T00:00:00",
      "story": "Bright object in early morning sky I woke up at 4:30 am, not sure why, and walked outside and immediately noticed a bright object in the sky.  Super bright, brighter than the moon.  It was stationary.  I filmed it with my phone, and then copied it to my pc, so i could zoom in on it.  Round glowing object.  Have not seen it there since then. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134612.html",
      "state": "TX",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8066",
      "summary": "I observed and filmed a brilliant bright blue sphere moving in the night sky as I stood outside my house in Ft. Worth, TX.",
      "city": "fortworth",
      "shape": "sphere",
      "date": "2018-03-23T00:00:00",
      "story": "I observed and filmed a brilliant bright blue sphere moving in the night sky, as I stood outside my house in Ft. Worth, TX Location:  Fort Worth, TX, 76114   On Friday March 2, 2018 at 21:10, while standing in front of my house in Ft. Worth, Texas, I observed a bright blue sphere in the night sky.  As I looked up at the brightly lit full moon, my eye was immediately drawn to the brilliant blue sphere.  I immediately pulled out my phone and captured a picture, time stamps on phone show the first picture taken at 20:11. At one point I ran inside to retrieve my digital camera.  I was inside for about 3 minutes.  I rushed back outside to continue taking more pictures and video.  I continued to observe the object for approximately 20 minutes.  During this time, I observed the blue sphere moving around in the night sky (screen shot of pics on my phone shows various locations).  My attention was still focused on the round blue object. I went inside and downloaded the images on to my computer to review. After spending time on my computer, I went out to the backyard to take one last look.  To my surprise, the object was still visible in the night sky.  I took another photo at 22:27 of the blue sphere. When I later viewed my pictures and video I saw other objects, what appears to be flying metallic objects. Even though I was standing in the middle of the street taking pictures, as far as I know none of my neighbors saw anything. ((NUFORC Note:  We have looked at the still photos that have been forwarded to our Center by the witness.  The small, blue-green object in those photos seems to us to be strongly reminiscent of lens flares, caused by pointing a camera at a bright source of light.  However, if the witness did, in fact, see the object with her normal vision, the objects are not lens flares, which are caused by reflections off the surfaces of the lens elements in the objective lens of a camera.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139213.html",
      "state": "TX",
      "duration": "76 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8225",
      "summary": "White rectangle object crossed over moon, visible through telescope.",
      "city": "fortworth",
      "shape": "rectangle",
      "date": "2018-01-25T00:00:00",
      "story": "White rectangle object crossed over moon, visible through telescope. At 16:05 local time, viewing moon through 130mm reflector telescope, 25mm wide angle eye piece being used.  A white rectangle object crossed my field of view for roughly 4 seconds, travelling on east to west trajectory.  Appeared, cut right across the moon, then disappeared from sight.  Checked satellite database, nothing on that path in area, no aircraft in area, white rectangle object wasn't visible at all to naked eye.  Have researched, but no satellites compare to what this object was.",
      "link": "http://www.nuforc.org/webreports/138/S138576.html",
      "state": "TX",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c88e9",
      "summary": "Bright white object moved across binocular field of view.  No collision lights.  ((anonymous report))",
      "city": "fortworth",
      "shape": "unknown",
      "date": "2018-06-15T00:00:00",
      "story": "Bright white object moved across binocular field of view.  No collision lights. At approximately 9:45pm CDT, I was observing Jupiter with a pair of Celestron Astronomy binoculars.  An extremely bright object passed rapidly across my field of vision.  I lowered the binoculars and saw it was not visible to the naked eye. The object did not display any ant-collision lights used by aircraft.  The direction of travel was north to south. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141781.html",
      "state": "TX",
      "duration": "14 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c91d5",
      "summary": "Strange orb flying over Westside of Fort Worth.",
      "city": "fortworth",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Strange orb flying over Westside of Fort Worth. While taking my trash out, a bright orb caught my eye.  As I watched it started moving side to side.  Then started moving straight forward at a higher rate of speed.  As it got further in distance it turned red for a few seconds then disappeared.  Movements unlike any aircraft I have ever seen.",
      "link": "http://www.nuforc.org/webreports/149/S149634.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c923f",
      "summary": "I stepped outside on the patio and saw this saucer shape object in the sky over the pasture across the street from me. I quickly grabbe",
      "city": "fortworth",
      "shape": "disk",
      "date": "2019-12-01T00:00:00",
      "story": "I stepped outside on the patio and saw this saucer shape object in the sky over the pasture across the street from me. I quickly grabbed my phone and took a picture.  It was only in the sky for a couple of minutes.  It did not fly off it just became invisible and when it did the space it occupied was filled in with clouds.",
      "link": "http://www.nuforc.org/webreports/150/S150260.html",
      "state": "TX",
      "duration": "3 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3c9385",
      "summary": "3 lights in a v formation flying and disssapearing",
      "city": "fortworth",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "3 lights in a v formation flying and disssapearing 3 flying lights in a v formation in the sky that we’re moving very fast north, north east and turning at an instant that could not have been possible by normal aircraft. This was over the sky towards the southwest part of Fort Worth. Once the 3 lights turned, they went out of my sight and took off very fast north.",
      "link": "http://www.nuforc.org/webreports/150/S150289.html",
      "state": "TX",
      "duration": "10 seconds"
    }
  ]
}