{
  "city": "fremont",
  "fetch_timestamp": "2025-07-12T14:36:14.111483",
  "record_count": 50,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4eae",
      "summary": "Very large floating aircraft with nav-lights. Possibly a military test craft.  ((anonymous report))",
      "city": "fremont",
      "shape": "other",
      "date": "2019-05-09T00:00:00",
      "story": "Very large floating aircraft with nav-lights. Possibly a military test craft. I saw a large aircraft hovering mid air over Freemont, New Hampshire.  It had green and red nav-lights, so it probably is legit and not some \"alien\" craft.  It was larger than any airplanes I've ever seen.  Because it was night time, I couldn't quite make out what the craft was.  The only thing I am sure of is that it is a large, wide, object.  I don't think there is anything to worry about.  It is probably a test aircraft that military produced.  It had nav-lights.  What \"alien\" would put human-made nav-lights on his craft? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146036.html",
      "state": "NH",
      "duration": "Continuing up till right "
    },
    {
      "_id": "64d005f478aba2ec5a3b54a7",
      "summary": "UFO Spotted in Fremont Hills",
      "city": "fremont",
      "shape": "oval",
      "date": "2008-06-12T00:00:00",
      "story": "UFO Spotted in Fremont Hills Hello,  I just witnessed a rather strange event in Fremont. I'm located in the Mission Hills, and noticed a very loud noise, assuming it to be an aircraft. However, it did not fly over as usual, and considering we have no airport I was perplexed. I looked out the window and assumed that it was a helicopter of some sort. However, the flight pattern and speed was unlike any helicopter, and I fail to understand why a helicopter would be in near barren hills. The aircraft made several rounds, rather than concentrating a search if it was for a search, and upon closer direct inspection it had no helicopter blades and thus was not a helicopter. However, it did have the ability to levitate. The craft was in sight for around 20 minutes, circling around a few times and eventually leaving. I do have some video off of my camera phone that I can provide. If you could provide an explanation, it would be appreciated, but as far as I am concerned, I cannot explain what I saw. This occurred at about 12:30am tonight in Fremont. There was two bright lights, one on front and back, and a bluish light. Thanks.",
      "link": "http://www.nuforc.org/webreports/063/S63307.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b57",
      "summary": "strange shiny silver object flew fast over the hill, stops, then disappears",
      "city": "fremont",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "strange shiny silver object flew fast over the hill, stops, then disappears OK. I don't know how to explain this. I just saw something fly over the hills behind my house. I usually sit on the back porch in the afternoons, leaning against the screen door, looking at the cows on the hill. 10 minutes earlier as usual I was quietly observing them. Then from over the hill this silver thing flies in a fast, straight line, just over the hill. It kept moving forward a little, but seemed to have stopped and turned around. It stayed in place until it found a direction. It started moving to the right slowly. I was standing up by this time and moving closer to the fence. By the time I got to the fence the thing disappeared. It was gone. It didn't fly over the hills again, it had already moved a good way out from them. Unless it moved faster than I could see... I saw it and then it disappeared.  I was thinking, maybe it was a balloon? But the wind was going over the hills in the other direction. When it came over the hills in my direction it was coming fast, then it stopped. It still moved upward and north the last time I saw it. I distinctly saw the shape of it and it wasn't round, nor was it oblong, it was not the shape of a balloon. It looked like a \"flying saucer\" with a lid on it. It was flat and shiny on the bottom, and the top looked like an oval cut in half and attached to it. It was definately bigger than at least eight big black cows put together. I saw its dimensions after it flew over the hill and turned around abruptly. It moved to the left, then back to the right, slowly moving toward the Bay and shifting direction, until it disappeared. It was silver and shiny and distinctive in the clear blue sky. There was nothing else up in the sky at that time. Nothing flies that low over the hill in the direction toward my house. I can't think of anything that would move so erraticly. It sure wasn't a bird or a plane.",
      "link": "http://www.nuforc.org/webreports/051/S51593.html",
      "state": "CA",
      "duration": "25 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b67b1",
      "summary": "2 figures and craft seen on ground near San Francisco Bay.",
      "city": "fremont",
      "shape": "disk",
      "date": "2007-06-12T00:00:00",
      "story": "2 figures and craft seen on ground near San Francisco Bay. I was riding my bike on Thursday (4/26/07) morning around 6:45am on the Alameda Creek trail in Fremont, CA. As I came to the end od the trial about 300 yards to where it meets the San Francisco bay, I saw 2 figures and a large object out of the corner of my eye to my right about 200 yards away.  Occasionally I am looking down at the gravel road as I am riding and as I began to look up I saw the figures. This startled me, causing me to veer into thick gravel and look away from the figures as I tried to regain control. I quickly came to a stop and looked to my right just as the figures which appeared to be looking at me turned away and began walking away as they suddenly became translucent and faded away. Immediately afterwards the large object that was about 50 feet in length which I had not focused on also became translucent and faded away.  All of this occurred in 5 seconds or less.  I do wear prescription glasses, I am near sighted, I did not have them on and I am not required to wear them while driving.  I tried to focus to see if I could still see them again but I did not. I then began to look around me as I sensed a presence near me. This spooked me and I quickly got back on my bike and began to peddle away towards the bay. I stopped about half way and began looking around again, but saw and sensed nothing. I then went to the end of the trail and waited there probably 15 minutes and was spooked again by what sounded like foots steps on the gravel. I then got back on my bike and I took the longer more difficult route along the dikes towards the Dumbarton Bridge instead of going back in the same direction that I had originally came.  I believe I had seen 3 UFOs in my life, 1 of which occurred on the Menlo Park side of the Dumbarton Bridge around the time and before the lights sighted by many in Phoenix Arizona in 1997. These lights were very similar, were south west of Menlo Park/Palo Alto. There where 5 lights all in a row and they did not move. A passenger plane also passed behind them. I did not stay long maybe a couple of minutes as I called my brother on my cell phone and left him a message telling him what I was seeing. I was very excited when I saw the original news footage covering the \"Phoenix Lights\" as it was very much what I had witnessed just a short while before. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56484.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a59",
      "summary": "Formation of circular lights traveling across the sky.",
      "city": "fremont",
      "shape": "formation",
      "date": "2008-01-21T00:00:00",
      "story": "Formation of circular lights traveling across the sky a string of 5 lights in formation travelling slowly across the sky, no lights were seen as part of a helicopter/plane. It looked like christmas lights floating across the sky heading from the east bay to pacific ocean.  We watched it and thought at first it was fireworks, but it just kept traveling and heading west.  It was definitely NOTHING we have ever seen before.  It just kept on on going, 5 balls of light bright and looked like a string of christmas lights.  It just dissapeared.  The sky was clear and we saw all the stars and saw this thing pass across the sky.",
      "link": "http://www.nuforc.org/webreports/060/S60599.html",
      "state": "CA",
      "duration": "4 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ac6",
      "summary": "UFOs shape like a glowing flame crafts viewed by many, I  video taped 3 of them on July 7, 2007 at Clear Lake, Indiana at night",
      "city": "fremont",
      "shape": "fireball",
      "date": "2007-08-07T00:00:00",
      "story": "UFOs shape like a glowing flame crafts viewed by many, I  video taped 3 of them on July 7, 2007 at Clear Lake, Indiana at night I shot video of UFOs flying over our lake, here are the details of my sighting over Clear Lake in Fremont, Indiana on July 7, 2007 at approximately 10:30 pm.  Clear Lake was celebrating the forth of July with fireworks on July 7th, 2007 at about 9:50pm. The fireworks lasted until around 10:30 pm. My family, including my son-in-law and his wife and kids, were standing on our pier just as the fireworks ended. It was a crystal clear evening and you could easily see the left-over smoke from the fireworks against the darkening starlit night. The left-over firework smoke was drifting about 2-300 feet high and 500 yards out from me moving left to right as we stood on the pier looking to the north.  My 36 year old son-in-Law pointed out this moving object to our left above the firework smoke moving left to right seemingly glowing like a flame. It was circular and it appeared to look like the fire and glow of the tail pipe of a fighter jet without noise or sound. The object was the size of a medium aircraft but perfectly round. The object was moving much faster then the firework smoke still drifting across the northern sky. I look even further back to my left and it looked like several of these fiery objects were line up in single file like you would see at an airport with airplanes lined up to land. The fiery objects past over head right in front of us in single file and moved rapidly east and upwards until they when out of sight. I counted eight of them which flu west to east almost horizon to horizon.  As a 15 year veteran NBC affiliate director/producer in television, I frequently carry a video camera for chasing storms and news stories and decided to run to grab my video camera in our cottage during the sighting. It only took me seconds to grab my video gear but before I could get it started recording I was only able to video tape one single object flying left to right climbing out of sight like the other seven objects. Then two more of the objects with the same look, flying perfectly parallel to each other flu to the center of the lake and follow the exact same course until the two glow flame objects perfectly turn together in unison and instead of following the rest of the glow-flame objects to the east, they headed directly straight to the north where I facing during the time I was video taping. The other eight objects all flew to the east and climbed out of sight, but the last two that flew side-by-side did not climb like the others but kept the same altitude of about one thousand feet until they drop from sight in the northern horizon. The whole event lasted about 20-30 minutes with the objects seemingly spaced evenly apart.  The firework smoke was still slowly drifting east about 5 miles and hour after the incendent. These objects maneuvered about and were traveling much faster then the firework smoke. I stood there on the pier looking at one last glowing light that did not move in the west and I was not sure that it was another glow-flame object. I gave it about 5 minutes and wrote it off to being a water tower beacon off in the distance.  I went inside the cottage for a bit and returned in about 20 minutes later to find that the object I waiting on, that I thought was a water tower beacon we not in the west  and in fact, there were no lights at all. So then I assume it was one of the objects I had been witnessing and did not stick around long enough to see where that UFO headed.    There were many people on the lake that night and witnessed these objects. I work with a man who was at the yacht club on the lake that night with approximately 100 guests for a graduation party who all witnessed the fireworks and the same objects.  I called 911 and to my surprise no one had reported what I had seen. There have not been any reports in newspapers or media since then. I have talked to a few people who live at the lake who claim they either saw the objects that night or heard about it. ((NUFORC Note:  We spoke with this witness via telephone for an extended amount of time.  He is a serior executive for a major company, and we deem him to be an excellent witness.  We would welcome other reports from the many other individuals who, we understand, were witness to the same event.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57843.html",
      "state": "IN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f6f",
      "summary": "Formation of gold lights hovering over open space",
      "city": "fremont",
      "shape": "formation",
      "date": "2008-03-31T00:00:00",
      "story": "Formation of gold lights hovering over open space I was driving south down 680 towards San Jose heading near Fremont area at around 9:20 when I noticed what appeared to be a string of lights in the sky ahead of me to the east. I noticed that objects were close as they were to my direct left after I drove about half a mile. I then could see that they were stationary in the sky and appeared to be \"lantern/disc-like\" structures that glowed gold. I pulled to the side of the highway and put on my emergency lights. They were in a formation that appeared to be like a scoop. They were silent and hovered over an open field maybe the equivalent of five or six city blocks away from where I was parked. I was able to snap a few photographs what I had seen and when I was manipulating my digital camera to change settings to get a clearer picture, I looked up and noticed that the lights were quickly hovering and moving in unison southbound. I pulled my car back into traffic and continued driving south and noticed other vehicles pulled over to the side of the highway.The lights then seemed to disappear behind hills. I then noticed 2 fast aircraft with red lights flying toward the general vicinity of where I had seen the formation of lights.  I drove 10 miles further south and switched over to 880 south via Mission and looked east and noticed an intensely bright gold light with a smaller light above it hovering over a distant town.",
      "link": "http://www.nuforc.org/webreports/062/S62279.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8320",
      "summary": "Two bright stars faded simultaneously in approx. 4 seconds.",
      "city": "fremont",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Two bright stars faded simultaneously in approx. 4 seconds. I came back from my morning run in Fremont CA. at about 5:30 in the morning on the morning of Nov. 11th 2005.  I was facing W-SW when I finished my run, and turned to my right to end up facing NW.  I immediately noticed two stars in the constellation Cassiopeia that were very bright.  The stars were separated by a distance equal to the width of my thumb at arms length.  They were as bright as Venus, and equal to each other in magnitude.  I knew the stars were out of place, and thought I was witnessing some strange double supernova.  The sky was crystal clear without a hint of clouds. I was thinking about looking them up and finding out what was going on when, as I was looking at them, they both faded simultaneously to the point of invisibility in about 4 seconds. I never took my eyes off of them through the whole event. I would say that I had been looking at them for about 30 seconds. They didn't belong there in the first place. I could not make sense of what I was seeing, and still can't. The stars were stationary the whole time. At first I thought I might be looking at a couple of geosynchronous satellites that were rotating through a position of reflecting to non-reflecting, but the position was too far north of the Celestial Equator. I don't think we can place geosynchronous satellites in orbits that far off of the Celestial Equator. I don't know what I saw, but I definitely saw it. I have asked several astronomy buffs, and some of my friends that work with satellites. No answer. This seems to count as a UFO however high it was flying, and I just needed to let someone know other than my circle of friends. ((NUFORC Note:  Source indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67867.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b893f",
      "summary": "Fireball in the sky falling near Mission Hills in background.  Seemed to disappear.",
      "city": "fremont",
      "shape": "fireball",
      "date": "2009-03-19T00:00:00",
      "story": "Fireball in the sky falling near Mission Hills in background.  Seemed to disappear. Don't know if it was a shooting star ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68115.html",
      "state": "CA",
      "duration": "3 secpnds"
    },
    {
      "_id": "64d005f478aba2ec5a3b93dd",
      "summary": "GHOST-LIKE BLOB W/ 4 ROUND GHOST-LIKE BALLS INSIDE&IT WAS CHANGING SHAPES SLOWLY",
      "city": "fremont",
      "shape": "changing",
      "date": "2008-10-31T00:00:00",
      "story": "GHOST-LIKE BLOB W/ 4 ROUND GHOST-LIKE BALLS INSIDE & IT WAS CHANGING SHAPES SLOWLY IT WAS APPROX. 9:45 PM,I WENT OUTSIDE TO SMOKE AS USUAL.  I THOUGHT I SAW LIKE 4 WHITE BALLOONS.  IT WAS FLOATING LIKE A GHOST LIKE BLOB WITH 4 ROUND TRANSPARENT BALLS INSIDE MOVING AND CHANGING SHAPES.  IT DIDN'T GO UP.  IT JUST FLOATED GOING STRAIGHT .NOT UP OR DOWN.  IT LOOKED JUST LIKE A GHOSTLY IMAGE YOU'D SEE PORTRAYED ON T.V.   SO I CALLED THE NON EMERGENCY POLICE #.THEY CAME TO MY HOUSE IN 5 MIN.  THEY LOOKED IN MY FRIDGE AND ASKED ME IF I WANTED TO HURT MYSELF OR SOMEONE ELSE.  I DIDN'T OF COARSE, BUT THEY THOUGHT I WAS A NUT JOB!!  I KNOW WHAT I (AND 3 OTHER PEOPLE) SAW!  NOBODY CAN TAKE THAT AWAY!!!",
      "link": "http://www.nuforc.org/webreports/065/S65889.html",
      "state": "CA",
      "duration": "3 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b9c33",
      "summary": "A star like object that hovered and appeared to change color.",
      "city": "fremont",
      "shape": "light",
      "date": "2009-05-12T00:00:00",
      "story": "A star like object that hovered and appeared to change color. It is about 10pm and i was contacted by my brother to look into the southwest sky. When i did i saw a bright star like object that appeared to stay in one plac and changed colors seemingly. I watched for about an hour and it was pretty much in the same spot and would get brighter every so often.",
      "link": "http://www.nuforc.org/webreports/069/S69670.html",
      "state": "IN",
      "duration": "1 hour plus"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c96",
      "summary": "A black cylinder floated in the sky.",
      "city": "fremont",
      "shape": "cylinder",
      "date": "2008-08-12T00:00:00",
      "story": "A black cylinder floated in the sky I saw a black cylinder floating in the sky. I got my binoculars out for a closer look. The object was black with a polished gold dome on the top. I could see hardware or plumbing on the black surface. It was silent and floated and rotated slowly much like a balloon. It remained vertical with the gold dome facing up. ((NUFORC Note:  We spoke via telephone with this witness.  He sounded quite sincer to us.  We have corrected the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64745.html",
      "state": "CA",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d33",
      "summary": "Red glowing flame that climbed up.",
      "city": "fremont",
      "shape": "fireball",
      "date": "2008-08-12T00:00:00",
      "story": "Red glowing flame that climbed up. The object appearred as a  red glow in the sky with a flame that was going up and  started brighter and got dimmer and dimmer as it climbed then as it started to come down it blacked out and you could continue to see the shadow of the  as the object appeared to burn out and appeared to fall.  The event lasted approx 2 minutes.",
      "link": "http://www.nuforc.org/webreports/064/S64679.html",
      "state": "MI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ecf",
      "summary": "Slow rotating triangle with three lights, one on each corner.",
      "city": "fremont",
      "shape": "triangle",
      "date": "2009-12-12T00:00:00",
      "story": "Slow rotating triangle with three lights, one on each corner. There was a triangle shaped object heading Southeast towards the hills from Fremont Blvd and Mowry Ave. It was only seen for approximately five minutes, because buildings blocked further sight of it. The object had three lights on it, one on each corner. Two of the lights were red, and the third light was white. The white light was pulsing while the two red lights were constant. The object appeared to be rotating while floating through the sky. It was a slow rotation, so it was obvious it was not a plane, and that the lights were not alternating colors. It wasn't a jerky rotation either. It was very smooth, and it even seemed like it moved through the sky with ease. As if it was effortless for it. The object was grayish in color...more like metallic silver... which was only noticed when the object came closer to our direction. (We were stopped at a red light.) If it's lights weren't on, it would have probably blended in with the sky more. There were three observers. The driver being a female 30 years of age. Front passenger female 25 years of age. Backseat passenger male 10 years of age. Our car was headed West on Mowry. There were planes in the sky at different altitudes. The sky had light clouds with a full moon, so some stars were visible.",
      "link": "http://www.nuforc.org/webreports/073/S73556.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ef9",
      "summary": "I saw a brightly lightes v shaped ufo while driving through fremont,ca.",
      "city": "fremont",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "I saw a brightly lightes v shaped ufo while driving through fremont,ca.",
      "link": "http://www.nuforc.org/webreports/066/S66180.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba432",
      "summary": "Four flashes of light",
      "city": "fremont",
      "shape": "flash",
      "date": "2009-05-12T00:00:00",
      "story": "Four flashes of light We where on the front porch when we heard a loud noise comming from the sky.  It didnt sound like a plane or anything I have heard before.  We saw for flashes of light moving side by side.  They moved faster then anything I have ever seen but we could see them flying off in to the distance.",
      "link": "http://www.nuforc.org/webreports/069/S69872.html",
      "state": "CA",
      "duration": "30sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba544",
      "summary": "Fast Moving",
      "city": "fremont",
      "shape": "other",
      "date": "2008-07-05T00:00:00",
      "story": "Fast Moving I point and shoot the digital in the blank sky and when I come home to see the pictures in my computer, I can see many UFO in the pictures. I don't know how to make it in slow motion mode. If anyone can do that you will see the shape of UFOs. I just use pause button to see the shape of them. There are many shapes such as rod and also disk. They are moving so fast that my naked eyes cannot see it at all without the help of the digotal camera.",
      "link": "http://www.nuforc.org/webreports/063/S63998.html",
      "state": "CA",
      "duration": "1 to 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba845",
      "summary": "Saw four spheres in the sky, paired up, and moving oddly.",
      "city": "fremont",
      "shape": "sphere",
      "date": "2008-08-12T00:00:00",
      "story": "Saw four spheres in the sky, paired up, and moving oddly. statement 1: I was looking up at a plane flying by, the sky was clear blue, no clouds. The plane was flying in a north-west direction and then I saw four spheres flying the opposite direction, in a v-formation. When they crossed paths with the plane, they stayed and hovered in that spot. It looked like they were “dancing” around. Then they paired up, and kept “dancing,” but in pairs of two (side by side). They were overhead and then began to fly away from us, in pairs, in a northbound direction. It took about 30 seconds to be out of sight. statement 2: When my cousin saw the four objects in the sky, I looked for them. They were barely visible but once you found them they were very obvious. At first they looked liked balloons but then they stayed in one spot and moved into pairs. They were moving very oddly and then moved away from us, into the distance. ((NUFORC Note:  We spoke with one of the witnesses, and she sounded to us to be sincere, in making her sighting report.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65127.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baa6f",
      "summary": "Two large bright lights in midnight sky.",
      "city": "fremont",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Two large bright lights in midnight sky. My sister and I were outside of our house when all the sudden, a white light appeared in the clouds, it then seemed to split into to two lights, that or there was a light behind it that moved.   It then stopped moving and stayed there for 2 minutes,there also was an unexplanable sound in the distance. After that we both went inside for a minute, but when we came back out it was gone.",
      "link": "http://www.nuforc.org/webreports/077/S77673.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb54b",
      "summary": "UFO was observed as a triangle shaped object with a glowing green light below,  Craft lowered to 1000 feet, hovered  w/ no sound .",
      "city": "fremont",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "UFO was observed as a triangle shaped object with a glowing green light below,  Craft lowered to 1000 feet, hovered  w/ no sound . Object observed was at first thought to be the North Star. The star began moving slowly towards the south east.  As the object moved closer its color was more defined and observed as a large flouresant green light with a light colored haze shadow above the green light.  Object at this time was estimated at least 100,000 feet above the earth.  The object lowered more than X5 in size and hovered slightly north east of our location. At this time my wife and I could see there was some type of \"object\" light gray in color like a shadow that was shaped like a triangle above the green light.  This triangle object was directly over the top of the green light ( same color green as that of a green light used in green for traffic signals) and moved as if it was part of the structure attached to the Object. The Object hovered for approximately four minutes at this position.  The Object then began to lower elevation and proceed directly towards our residence.  At first as the Object was lowering it was hard to tell if the Object was a Craft or some type of balloon because the green light was well below the gray fuzzy Object.  I say fuzzy because the Objects perimiter lines were not clearly defined until the object lowered to approximately 30,000 ft.  The Object which I will now call a Craft continued to lower at an angle in which we could only see the bottom of the Craft and the lower green light which was well beneath the craft.  The Craft slowly came down directly at us taking about three minutes then made some sort of a maneuver at approximately 10,000-15,000 feet tipping forward the \"body structure of the Craft\" and turning towards the westerly direction (San Francisco and Oakland) and stopped. At this time the craft approximately one third mile away and was seen to have a series! of window like structures with clearly defined pilliars.  These solid same as Craft composition pilliars made this front of Craft area look like it had windows only in front and not all around the Craft.  Also, it was hard to tell if this green area was not some type of power source and not windows at all BUT they sure looked like windows to us...  These structures were clearly defined as they were flourescent green in color same as the single green light below the Craft. This Object/Craft only had the solid permanent \"on\" round green light as described above and no type of the required red, green or white flashing navigation type airplane lights. The Craft straighten up again and stopped. The Craft positioned itself so we could only see the bottom again for about 30 seconds.  I tried to take three photos of the Craft and the green light with my camera but the Pic's even though they were in the view area when Pic was taken did not show up on photo.  The Object/Craft was now close enough to see that it appeared to be emitting enough light from the large lower green light to illuminate the bottom of the craft and make it visible to the eye.  The Craft appeared as a semi-flat gray colored triangle shaped object. At ALL times during the observation of the Object/Craft.  There was NO SOUND at all from the Craft and there was some type of energy either emitting from or surrounding the Craft.  This energy would slightly distort the Crafts perimiter lines.  I can only describe this energy or what I am calling energy as someting that would look like heat waves in the desert on a very hot summer day. The Craft after hovering another 30 seconds began to slowly move forward and descend in altitude moving to the west on the approximate approach path in between Oakland International and SFO Airports.  The Craft at this time was approximately 5,000 feet lowering to 2,000 feet and about one quarter mile from our location.  The Craft appeared to be about twice the size of a 747 aircraft. As the Craft slowly moved off in the distance.  One could see as the Craft moved through some thin low clouds (that added more additional light reflecting from the city lights)that the Craft clearly had less distortion from the energy waves.  The extra light gave us a glimps that the Craft's surface was non reflective flat gray to egg shell gray in color and had slighly rounded corners in the triangluar shape. Now at a lower altitude and closer proximity it was much clearer to see the craft. We could see that the green light that emitted light was well below the craft and at least approximately 300! feet lower than the Craft.  At this point, I could not tell if the green light illuminated the bottom of the Craft or the Craft actually had a faint green glow emitting from the Craft. This was because no attaching structure could be visibally seen inbetween the Craft and the lower green light at any time..Especially when the Craft passed through the lighted clouds and became more visible and we could not see any ataching structure to the green light.   The lower green light appeared solid in color, round and seemed have been shaped like a sphere.  The overall size of this green light was approximately 5 percent the size of the Craft. This Craft was stealthy quiet. If we would not have been in our spa watching for satillites we never would have seen this Craft and Event. We watched this Craft slowly move towards San Francisco/Oakland at an estimated 100 mph same as a small private plane's speed almost stop then proceed and continue at an altitude of approximatel 1000 feet until it was out of view.  The Craft proceededThis heading over San Francisco Bay like it was going to pass right in between the two major airports SFO and OAK.",
      "link": "http://www.nuforc.org/webreports/079/S79400.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb550",
      "summary": "Around 5:30 a triangle shaped craft was moving south-south west. There wasn't a sound in the air.",
      "city": "fremont",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "Around 5:30 a triangle shaped craft was moving south-south west. There wasn't a sound in the air. Now I was sitting on my couch on the laptop and watching TV. I was sitting next to a window and noticed lights that made a triangle form. I then proceeded to go to my front porch and got a better look. The “craft” that I saw was triangle with a light on each point and one in the exact center blinking.  It was moving from north-north west to south-south east.  The air was rather still and a small breeze blew. The breeze wasn’t strong enough to make enough sound, but the air was very quiet.  The air was so quiet that this craft would’ve been heard.  It also was flying rather low. Way below commercial airliner height.  I would say 2,500-8,500 feet.  The color of the aircraft would probably be a darker color like a grey, naval blue, black or dark color but I couldn’t completely tell because of the minimal light.  The time of day it was dark. After the craft flying past the front part my house I had to run to the back porch. Once again I saw the same craft coming out of the trees next to my house.  I watched it until it started to shrink from the distance. Then it disappeared.  One of my family members also saw it but denied it was anything, not even an airplane. This was incredible different to an airplane for many reasons and we live near three major airports so I know what an airplane flies and that they make noise. After the craft diappeared the wind picked up right away and got cold. There was no noise what so ever. This craft had no traits of an airplane.",
      "link": "http://www.nuforc.org/webreports/079/S79403.html",
      "state": "NH",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb86",
      "summary": "First UFO sightings as a teenager in the 1960's: three events",
      "city": "fremont",
      "shape": "",
      "date": "",
      "story": "First UFO sightings as a teenager in the 1960's: three events  My early UFO  experiences:  I believe I was 15, and that this was during the school year, in 1966 or 1967, on a weekend. I was living in Fremont, California, and my friends and I heard reports of UFOs leaving craters in the hills surrounding Fremont.  We determined to go check them out, and took off for a drive. S had a license and a car, so D, N, and I, and perhaps one other who I can’t recall exactly, drove out to the boonies. D, my best guy friend, and N, my best girlfriend, have stayed in touch over the years, and have said to one another on several occasions, \"That really happened, didn’t it?\"   We climbed up into the open hills, broke through some trees, and came to a large open field, with no sign of houses or buildings anywhere. In those days we even had dark skies in Fremont.  There was a small hill about 20 acres away.  On top of it were 2 large, very bright white lights. S was kind of the freaky type, and immediately turned the car around to escape.  But we convinced him to stop, so we could check this out, and we all got out of the car to look, standing at the back of it.  We were pondering reasonable explanations, when one of the lights suddenly floated straight up a short distance and stopped.  Then the second light floated up next to it, and as it arrived at that level, the first light started coming rapidly straight at us, followed right away by the second. D and I were rather frozen. N actually raised her arms and said, \"I want to go with them.\"  starting to walk forward. S totally freaked and started running toward the driver’s seat. He was well known for erratic behavior and ditching people at the side of the road. I do think there was another person who ran to the car also. D and I had to grab N and drag her back to the revving car, S barely able to restrain himself. We zoomed back off the way we had come, towards the trees. N was angry and disappointed.  I recall looking out the back window and seeing them nearly on top of us as we entered the trees. The next thing I remember is all of us laughing wildly about how we had escaped them, especially S. I recall that we arrived home quite late, around 1:00 AM, and thinking that we must have gone farther out than we realized. The following summer I was camping with the B family, who I spent most all I spent all my time with. They are a second family to me. We were at the American River, sitting on the bank. I spied a large, orange glowing light hovering over a hillside, and pointed it out to them. We watched the light slowly settle and disappear behind the trees. I was excited, but the parents quickly downplayed it, not wanting to scare the kids.  We headed back up to bed shortly after. I was alone in a small tent, and I have a strong association of the color orange, likely the color of a pup tent back then.  I had just lay down, when I felt completely frozen, unable to move, like a great weight was upon me.  Then I felt, what I’d only been able to describe in the words of my time for downloading, that my brain was a tape, and everything about me was on it, and it was being reeled out of my head. I tried to resist the process and was \"“told\" rather sternly, \"Don’t try to resist, you know we can squash you like an ant.\"   So I submitted, scared to death. It seems that throughout this I was surrounded by orange, perhaps light shining through the tent. It took about as long as stripping a reel to reel tape at a quick steady speed.  Then it was over, the weight lifted, and I felt totally exhausted, drained. I explored my mind a great deal to be sure it was still intact. Then I fell asleep once reassured. Of course I told this story to others, but nobody really believe! d me, except perhaps D and N. By the time school started, I was spending nearly all my time at B’s, hanging out and babysitting the kids after school. I had a dysfunctional home.  They lived at the outskirts of suburbia, in the farmland down a long, straight, dark road that eventually got to the main highway and the shopping center. Beyond the shopping center was the entrance to the suburb I lived in. Every night I rode my bike home by the same route, leaving at a time that would get me home by 10:00, curfew.  I allowed a little extra time for distractions en route. I searched the sky a lot on the long, dark road. For about a week I started seeing odd vehicles resembling planes, but with a red, white, and bluish light that differed in color from the panes.  They were silent.  This was a well-traveled plane route, so there were many planes to compare with.  Each night I would see one pass one way or the other, each time a little lower in the sky. I began to be afraid, as it appeared they were coming for me. People started thinking I was crazy when I told them about these sightings, and I made them uncomfortable. One night I convinced D to make the trip with me. He saw one, and they were getting lower now. But he quickly and angrily dismissed it when I said I wanted him with me when they came, I didn’t want to be alone. Then he finally started treating me like I was crazy. One night, I made it past the dark road and through the shopping center, just entering the suburb, when I saw one again. The same lights, as low and as large as a 747 coming in for a landing, came gliding silently toward me, then stopped directly over my head.  I had stopped my bike with my foot on the ground, and looked up, studying this thing. It was black. I could clearly discern a kite type shape, with rounded edges, perhaps more like a Vick’s cough drop. The white light, positioned forward of the other two, seemed very bright. The next thing I knew, I was peddling as fast as I could, head down, not looking back, terrified. I was down the road a bit from where I’d stopped. I got home and immediately told my brother about it. He is a big autistic-genius-science geek who taught and teaches me all about the sky, as astronomy is his great obsession.  He and my oldest brother had taken a picture of a flying saucer in daylight years before, so I assumed he would hear me on this. He got angry, told me I was crazy and started treating me so. I just shut my mouth for good after that. I just had to live with this on my own. I was afraid to even look up at the sky for many years. The oddest thing was, even though I had zoomed home, I arrived 40 minutes late. I was never late. In fact, I should have been early if anything. I checked the time on our clock. It was correct. I thought there might be a problem with the B’s clock that I always used, but checked it the next day. It was fine. I have no idea what happened to me that night, only that it scared the wits out of me for a good long time.  When I finally got brave enough to search the skies again, I had many more strange sightings, and continue to do so to this day. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84440.html",
      "state": "CA",
      "duration": "Varies"
    },
    {
      "_id": "64d005f478aba2ec5a3bc10b",
      "summary": "Unbelivabe huge ufo seen above fremont,indiana",
      "city": "fremont",
      "shape": "cylinder",
      "date": "2011-12-12T00:00:00",
      "story": "unbelivabe huge ufo seen above fremont, indiana a big very bright indescribable light mostly red darted from out of nowhere then stopped on a dime hovered this object was at lest 10 mi high in the sky it hovered for a good 5 mins when moved right moved approx 5 mils to the right then 5 miles to the left call my 16 yr old son to see his jaw dropped it hoovered for a few more mins then flew over our house this thing was huge and had two smaller crafts trailing behind it this we no aircraft i really don't believe in UFOs i diffidently do now. it was amazing wow.",
      "link": "http://www.nuforc.org/webreports/085/S85261.html",
      "state": "IN",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc1eb",
      "summary": "I SEEN A FACE PRESSED UP TO MY BEDROOM WINDOW,IT WAS A GREY COLOR WITH BIG EYES",
      "city": "fremont",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "I SEEN A FACE PRESSED UP TO MY BEDROOM WINDOW, IT WAS A GREY COLOR WITH BIG EYES   i am only writting because now i am a little worried. earlier while i was out side walking my dog and i say this because i like looking at the stars at night i noticed what seemed to be a strange out line just above the trees.it was large and very black,blacker than the night while i was looking at it an unbelievable light immediatlely came on and filled the whole sky,it was like a ground level sun in the middle of the day,but at 11:oo at night i got a very strange feeling that came over me,like i was a fish in a bowl being watched by my owner. The light blinked back out but i could see that the craft was still just sitting there.I don't want to look crazy.but i can't sleep tonight and i swear that while i was just lying in my bed some thing made me turn and look out the window and i saw a face looking in at me,but it was not a human face,it was pressed right up to the glass and it was a grey-ish color with great big eyes. I thought that i was just seeing th! ings because i looked away not wanting to see it but when i looked back it was gone.I AM NOT A HOAX AND PLEASE DO NOT THINK THAT I AM CRAZY BUT I HAD TO TELL SOME BODY ABOUT THIS. PLEASE LET ME KNOW IF THERE ARE ANY OTHER STRANGE THINGS GOING ON IN FREMONT,OHIO SO THAT I DON'T THINK THAT I AM GOING NUTS.",
      "link": "http://www.nuforc.org/webreports/084/S84010.html",
      "state": "OH",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bce0a",
      "summary": "Lights that, at first glance looked like a plane that was going to crash.",
      "city": "fremont",
      "shape": "light",
      "date": "2011-06-03T00:00:00",
      "story": "Lights that, at first glance looked like a plane that was going to crash. My family and I we were coming off the freeway 880 south taking the Fremont/Alvarado exit in the East San Francisco Bay Area.  I was playing with my camera because I just got it 2 nights before and I had been trying to take a still picture of the traffic at night with the lights and stuff because the camera has all these features that I wanted to learn to use...  So coming off the freeway, I saw a \"plane\" or what I thought was a plane at first and it was flying in an angle like it was going to land on a runway but it was in the direction of the boulevard.  It was dark and 10:10pm and I saw only lights but I thought this \"plane\" was flying low and going to crash and as we came to the intersection off ramp off the freeway onto Fremont Blvd.  This is a busy boulevard, even at night.   We stopped at the light and I was just going to tell my husband, \"Don't go into the intersection I think that plane is going to crash\"...  But just when we stopped at the light, the \"plane, or lights\" suddenly stopped mid air and just hovered about a street light pole height above the street lights.  As I watched it while we were waiting for the light to turn left onto Fremont Blvd, the \"lights or plane\" hovered in the direction of Fremont Blvd South direction as if it were waiting for the light to change as well, almost like they stopped and said \"hey wait, she's got a camera\" and watching our car.   And as it was sitting there all of a sudden, while we were waiting for the light the one light on the right, swung behind the other light and came up on it on it's left and just sat there and when we moved in traffic, both lights started going..  It was weird like they were motorcycles driving in traffic but way up in the air.   Since I didn't know how to use my new camera very well, the camera had a delay on it and only took two pictures before the light changed and my husband drove off.  I kept telling my husband wait, wait, I see a UFO but he thought I was trying to be funny because I always make fun of him because he ! watches all the alien shows and on the most part, don’t believe in any aliens or anything.  He just didn’t believe me and kept driving.   When I got the pictures on the computer to blow it up, you can see a 3rd light behind the two I had seen and didn’t see when it happened.   I don’t know if there was any sound or not because we had the radio on in the car.",
      "link": "http://www.nuforc.org/webreports/081/S81589.html",
      "state": "CA",
      "duration": "30 - 60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5e7",
      "summary": "Bounding, glowing neon orbs of light over Fremont, MI. Neon green orb hovering over neighbor's home for several minutes.",
      "city": "fremont",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "Bounding, glowing neon orbs of light over Fremont, MI.  Neon green orb hovering over neighbor's home for several minutes. It was a late night, approximately 11:00pm-12:00am.  The details have become a bit fuzzy over the years as it was maybe around 1999.  Since then I haven’t really thought too much on it, except for when I see a show about UFOS or my mother and I reminiscence from time to time.  I want to say I was around 14.  I am now 26 years old with a master’s degree as a Physician Assistant Certified in a family practice center and I care for underserved and uninsured patients. We had just gotten back from a family event and it was a cool night, probably late summer but maybe early Fall.  There were four passengers in our truck, myself,  my mother, stepfather and my brother. When we got out of the car I had remarked what a starry night it was.  While looking up, we noticed at least five bright neon colored glowing “orbs”, literally bounding across the sky like a pinball machine would.  There were no trails of light.  These orbs of light had no specific shape but the central region was a more rich color and the outer ring a slight aura.  At first the lights were the size of stars.  I specifically remember a pink orb of light and a green orb of light, but there were other neon colors as well. My mother and I decided to stay outside.  My brother and stepfather entered the house as my little brother was scared and my stepfather didn’t seem very interested. The lights were over our horse pasture.  As we stayed outside to observe, the lights came down closer to the ground and were still bounding about in erratic patterns.  Soon the lights were over the horse pasture, probably about the height a small engine plane would fly. There was no noise.  There were no specific shapes other than the glowing orb. We observed for what seemed like a long time.  The lights started to move across the street.  We went into the woods across the street to observe further.  At the time, none of us had cell phones or a video camera to take any photos with.  We stood in the woods for a long while, maybe 20 minutes.  The woods were on the back side of our neighbor’s house, which also had a horse pasture.  We were on one side of the horse pasture, and their house on the other, no longer than half a football field’s length. The horses were not scared and were calm during all of these events.  After observing for a while, something miraculous happened.  One of the glowing orbs came down quite quickly and hovered above our neighbor’s house for several minutes.  It was a bright green orb with a slightly lighter aura with no discernible shape and no noise.  It was large, and seemed just a bit smaller than their roof, but hard to estimate exactly.  After simply hovering directly above the house, it took off straight into the sky as fast as it came down and all activity in the sky ceased thereafter.  We never had the sense of fear during the experience. After this incident, we never seen the lights again.  We did not report the incident at the time and kept the story within the family. We did not hear any reports from locals.   We did not tell the neighbors about what happened due to fear of them \"thinking we were crazy.\"  Everyone was accounted for and safe. I still wonder if we should have told them.  We did not live in a military region or an area frequented by aircraft.  Fremont has only a small private airport.  I would absolutely take a lie detector test and I know my mother would as well.  My brother still doesn’t like to talk about it, as it still scares him, even though he only seen the first half of the event (he is now 23) .  My mother and stepfather divorced, and we have since lost contact with him. In total, this event must have lasted at least 45 minutes-1 hour though I didn't time it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90310.html",
      "state": "MI",
      "duration": "45 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf47",
      "summary": "Two sightings in two days both different types.",
      "city": "fremont",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "Two sightings in two days both different types. My brother and I were in my backyard.  My brother saw the light first and pointed out a single bright white light flying extremely fast.  We watched it fly for almost 10 seconds then it disappeared in mid air. It was a solid bright white light and didn't have any flashing lights around it. There were commercial planes flying lower than the light at much slower speeds.   On June/23/2012, the night before, I was outside having a cigarette and I saw what I thought was a really bright star. As I was looking at it, a blue ball of light separate from the white light, circled the light clockwise until it met the point where it emerged then it disappeared. I will be out there tonight with a camera and video camera in case there's another.",
      "link": "http://www.nuforc.org/webreports/090/S90088.html",
      "state": "CA",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf63",
      "summary": "Silent, invisible craft, shoots blue beams of light on friend and I.",
      "city": "fremont",
      "shape": "light",
      "date": "2012-05-29T00:00:00",
      "story": "Silent, invisible craft, shoots blue beams of light on friend and I. In the autumn of between 1980 and 1982 my friend and I witnessed an event that still baffles me to this day.  We were both 12 to 14 at the time and were standing by an open lot next to his house located a hundred yards from my house.  This lot is located on top of a valley that downtown Fremont is located in.  Going from the lot to the bottom of the valley is approximately 40ft.  While standing there talking the trees lining to top of the lot starting moving violently, as though a hard wind was blowing down on them.  A light slowly came up from the valley and was shining through the tree line.  My first thought was that a helicopter was approaching and conveyed this to my friend.  But, there was no noise, the craft, or whatever it was, was completely silent.  As the light approached the top of the tree line it went out and the trees stopped moving.  A few seconds later a blue beam of light (I am getting goose bumps even to this day typing this) shown directl! y on my friend.  The beam of light was perfectly cylindrical in shape, as though a glass tube was directing the light down.  The light shown on him for maybe 2 to 3 seconds and then went out.  A second later the beam of blue light shown on myself but for only for a second, went out and once again shown on my friend for perhaps another second or two and again went out.  There was no indication of a craft.  We did not see the outline of one, hear any noise coming from one, and no indication of a craft leaving the area after the final beam of light.  We were both petrified as we stared at each other for a few seconds.  My friend ran to enter his house, and being dark I was absolutely terrified of the hundred yard run I had to perform to return home.  I immediately proceeded to sprint home faster than I ever have.  I told my mother of the incident but she seemed skeptical at best.  For most of the night I stood at the landing of the stairs looking out the window trying to make ! sense of what had happened.  My mother had to tell me a few ti! mes to g et to bed.  The next morning my mother noticed that I had a peculiar color to my skin, as though I had been sun burnt.  Every exposed area of my skin was visibly red with what appeared to be a light sun burn.  My mother stated that perhaps I did have something unusual happen that night.  My friend also had the same sun burn like pattern on him.   Two weeks later my mother showed me an article in the local newspaper of others seeing strange lights in the night sky although none exactly as the encounter my friend and I had.  My friend and I did not speak of the incident again until we were in our late 20’s.",
      "link": "http://www.nuforc.org/webreports/089/S89154.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be42d",
      "summary": "Golden UFO Sphere in the Sky",
      "city": "fremont",
      "shape": "circle",
      "date": "2012-06-20T00:00:00",
      "story": "Golden UFO Sphere in the Sky I was in my backyard having a cigarette between the hours of 430-515am on June 15th 2012.  Out of the corner of my eye I noticed a roundish bright golden light coming over the mountain by the radio antenna's.   I watched it flying then suddenly stop in mid air.  It proceeded to stay there for about a minute then took off towards the south and disappeared.  There was no sound coming from the object like you would hear if it was an airplane. I was so excited to see this phenomenon I got on my Facebook page and mentioned it and how bummed out I didn't get it on video.  I continued to watch that part of the sky and mountain area for a while longer.  Suddenly a rainbow colored light appeared on the mountain.  The rainbow colors reminded me of a prism. The object appeared out of nowhere.  It was like a light that was turned on except it illuminated a large part of the mountain with rainbow prism like colors.  The roundish rainbow colored object rose about 100-200 feet off the ground then proceeded at a slow pace northbound along the bottom of the mountain.  The object stopped turned bright golden color and rose quite rapidly straight up and hovered in the air glowing.   I grabbed my cell phone at this time as it hovered in the air to record a video.  I posted the video on YouTube at  http://youtu.be/9Oh_M32WdBw  In the video I tried to get some reference points like the moon and another plane that happened to be flying over at the time of filming.  Neither plane nor object interacted with each other.  I continued to film the object until it started flying southbound out of sight. I have lived in this area since childhood and fully aware that I live over the flight path of 3 major airports. I know the difference between a plane, helicopter, hang-glider, para-sailing, etc.  I was asked (was it a Chinese lantern)  Oh not even close. The size of the object on the ground was huge. Chinese lanterns don't come in sizes of mansions that I am aware of.  There isn't even a helicopter the size of this object I witnessed.",
      "link": "http://www.nuforc.org/webreports/089/S89704.html",
      "state": "CA",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be5c1",
      "summary": "2 bright orange fireballs seen 90 minutes apart, one with an apparent solid mass structure.",
      "city": "fremont",
      "shape": "fireball",
      "date": "2012-05-29T00:00:00",
      "story": "2 bright orange fireballs seen 90 minutes apart, one with an apparent solid mass structure. While sitting on the back deck of my house I frequently look into the night sky at the stars.  An orange, what can only be described as “fireball”, caught my attention.  I alerted the other 4 adults on the deck to what I was witnessing and they saw it clearly as well.  I’ve witnessed the ISS and Iridium flares many times and this fireball was neither.  What caught my attention as well was the trajectory it was taking, moving from the Southeast to Northwest, which is odd for most satellite movements I’ve witnessed over the years.  It moved at a much slower speed than the ISS would, giving me the impression that if this was a satellite it was at a very high altitude.  The fireball seemed to have a darker center than its surrounding orange haze and about 2 to 3 times the brightness of Venus over the past few months.  Over the course of about 20 seconds the fireball slowly faded to a single point of light, no brighter than a typical satellite seen traversing the! skies, and then finally disappeared toward the horizon. Then, 90 minutes later a second fireball appeared directly overhead and once again I alerted the event to the other 4 people on the deck.  This fireball was much brighter and you could definitely tell the center was darker with this one.  It had the same Southeast to Northwest trajectory.  Again, over the course of about 30 seconds it started to fade out.  But, unlike the first one, it did not fade out to a point of light but instead what appeared to be a black solid object with mass.  My girlfriend was very intrigued by this fact as was I.  I assumed both of these objects were space debris burning up in the atmosphere during a re-entry event.  It had even crossed my mind that perhaps I was seeing the same object given the 90 minute time-span, about the time an object such as the ISS would take to make a complete orbit.  But again, thinking about it the objects appeared to be moving too slow for that to be plausible. Normally I would have just dismissed these sightings as possibly the most intense Iridium flares I have witnessed, burning debris or some sort of satellites I have not seen before. But, after discovering this web site and posting a report of something I saw back in the early 80’s I started reading about the number of fireball sightings since 2010 and thought perhaps my report would be relevant.",
      "link": "http://www.nuforc.org/webreports/089/S89161.html",
      "state": "OH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bee62",
      "summary": "In the sky at 180 degrees south of my back yard, I saw what I thought was a shooting star. It then stopped in the sky and changed direc",
      "city": "fremont",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "In the sky at 180 degrees south of my back yard, I saw what I thought was a shooting star.  It then stopped in the sky and changed direction several times.  I called my boyfriend outside to see this and ask his thoughts. It floated around for at least a hr.   I then saw it in the Western part of the sky. It would flash a lighting like effect and also disappear.  It was as bright as the stars and the sky was very clear.",
      "link": "http://www.nuforc.org/webreports/100/S100939.html",
      "state": "OH",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c04b4",
      "summary": "3 orange balls in triangle formation then moving independent of each other.",
      "city": "fremont",
      "shape": "circle",
      "date": "2013-02-28T00:00:00",
      "story": "3 orange balls in triangle formation then moving independent of each other. On February 16th 2013 myself, my wife, and a friend were standing in my friend’s back yard when we looked eastward to see three hovering orange colored balls in a triangular formation.  As we watched for what seemed like several minutes the formation broke up. One of the objects moved rapidly up and to the right and disappeared.  While this was going on I pulled out my iPhone and started to take video of our observations.  The two remaining objects seemed to move up and away from our position and seemed to turn to a bright white color as they moved away. Oddly there was no sound as you would expect with a jet, light aircraft or helicopter.  Additionally the flight patterns were not consistent with any aircraft that usually transit this area.  The movement of these objects as we observed would move right or left, stop and hover then cross within what appeared to be very close proximity of each other.   I sent the video of this sighting to your organization which you can hear the reactions of the three witneses.",
      "link": "http://www.nuforc.org/webreports/096/S96378.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1440",
      "summary": "A low hovering star bright light that descends quickly but lingers in the sky.",
      "city": "fremont",
      "shape": "light",
      "date": "2013-12-12T00:00:00",
      "story": "A low hovering star bright light that descends quickly but lingers in the sky. There was a very bright, star bright light that hovered very low. T he light craft then descended very rapid towards the land.  I traveled twenty miles and seen the light travel distances of about 25 miles or so. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105215.html",
      "state": "CA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c162e",
      "summary": "Star-like shaped with a glowing red center,slow moving...at a helicopters height in the air.",
      "city": "fremont",
      "shape": "other",
      "date": "2013-10-23T00:00:00",
      "story": "The object was star-like shaped with a glowing red center, slow moving...at a helicopter's height in the air moving south to northwest past Peralta Blvd. in Fremont, Ca.  I observed it while I was sitting in my backyard alone.  Pretty intense because I've never seen something of its kind?",
      "link": "http://www.nuforc.org/webreports/103/S103278.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1df3",
      "summary": "Silver orb spotted near Fremont, CA.",
      "city": "fremont",
      "shape": "sphere",
      "date": "2014-06-04T00:00:00",
      "story": "Silver orb spotted near Fremont, CA. Craft was silver, orb-shaped and clearly visible towards the southern sky.   Craft was visible, at least as soon as I was aware of it, for about 10 secs, before traveling towards space and rapidly disappearing.",
      "link": "http://www.nuforc.org/webreports/109/S109750.html",
      "state": "CA",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c22",
      "summary": "Two reddish orbs that moved silently and quickly through the sky.",
      "city": "fremont",
      "shape": "sphere",
      "date": "2014-10-10T00:00:00",
      "story": "Two reddish orbs that moved silently and quickly through the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114364.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c34dc",
      "summary": "Huge cloaked craft with 6-sided color changing lights flies silently overhead in bay area.",
      "city": "fremont",
      "shape": "changing",
      "date": "2015-02-06T00:00:00",
      "story": "Huge cloaked craft with 6-sided color changing lights flies silently overhead in bay area. I always wanted to make this report and now I found a place to do this, thanks.  Please believe me, I know the following will sound crazy but I swear it this is the truth. I remember the date because it was my daughter's first birthday, our guests had left and my husband was on the balcony/patio of our 3rd floor apartment.  I had changed and was about to exit the bedroom onto the balcony to join him and I noticed as I looked in the direction of the bay (west) a huge dramatic cloud formation and suddenly before I knew what was happening, I heard myself saying, “Look at that cloud, there is a UFO inside it.”    We were both a little shocked to hear me say this, I do not know what possessed me, but sure enough no sooner had I said than the cloud parted and I just recall seeing it closer and there were I think like 6-sided lights all over it, in various colors, like green, red blue, blinking and changing colors.  I could not make out a shape to the “craft” as the oddest part was that it seemed to be cloaked or something, with different parts being exposed and concealed like a clocking cloud moving around it?!  Neither of us knew what to think – could not prcess what we were seeing other than it was extraordinary!   Then, we must have said something like the aliens are here and with that my husband jumped up on the railing and hung on the roof eaves as it passed over our heads (!!!) and he shouted, “Take me!  I immediately shouted “Over my dead body!”  -  (which we joked about for years after!)   As it moved overhead it seemed HUGE like a football field or something but we never saw anything but these cloaked lights and that it was huge.  And silent, completely noiseless!  I knew to check time, had heard stories about missing time, we we did not miss time, but I do not recall how it disappeared maybe disappeared over roof to other side of bldg. out of sight, but then almost simultaneously, we noticed there were federal agents suddenly swarming on the apartment complex, battering down a door on a ground floor apartment (they had ATF on their shirts) and they carried out boxes of stuff and disappeared after an hour, or so, maybe. I have no idea if this was connected but it seemed awfully coincidental these 2 extraordinary events happening at the same time. My husband died in a car crash 8 years ago, I wish we had told this earlier, but I wanted to record it in case anyone else has seen anything comparable.",
      "link": "http://www.nuforc.org/webreports/117/S117109.html",
      "state": "CA",
      "duration": "1/2 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c3821",
      "summary": "Three very bright lights in the morning sky.",
      "city": "fremont",
      "shape": "light",
      "date": "2015-01-30T00:00:00",
      "story": "Three very bright lights in the morning sky. This happened after I passed Stevenson Blvd. exit while in my vehicle, going South on 880.  I could see three very bright white lights in the sky from a distance.  These were three separate objects, but they were somewhat of the same altitude from where I was viewing. The object in the middle was very bright (the brightest), the light was pulsing, and it was moving downwards very slowly.  After about 30 seconds, it disappeared, then reappeared as a smaller light for another 10 seconds or so.  Then it completely vanished. To the right of the brightest object was a smaller one that was moving horizontally very slowly.  It didn’t blink at all. It looked like a bright star during a clear night. To the left of the brightest object was a smaller one that was moving downwards slowly, the light on it was also pulsing.  It went on for about 40 seconds. The distance between the objects from my viewpoint, was about 1 inch horizontally.",
      "link": "http://www.nuforc.org/webreports/117/S117039.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c41fa",
      "summary": "Ameoba-like UFO.",
      "city": "fremont",
      "shape": "changing",
      "date": "2015-04-30T00:00:00",
      "story": "Ameoba like UFO Was driving home and admiring the sky because it was clear and I could see alot of stars.  I observed what I initially thought was a bright star, but it was so bright that I thought maybe it was the moon.  So, I scanned the sky and the moon itself was obvious.  So I took my gaze back to the anomaly and first it looked like a bright sphere, and then it seemed to wiggle into two but closely held.   It continued to seem to wiggle, so I took my cellphone and captured the object.  When I got home, I cropped my photos and saw the strangest thing ever.  It looked like a cross between a cylinder and an ameoba.  I dont know what to make of it.",
      "link": "http://www.nuforc.org/webreports/118/S118656.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c434a",
      "summary": "Spotted bright light flying through sky.  Thought it was a plane but was leaving a bright turquoise haze behind it that lit up the sky.",
      "city": "fremont",
      "shape": "cigar",
      "date": "2015-11-19T00:00:00",
      "story": "Spotted bright light flying through sky.  Thought it was a plane but was leaving a bright turquoise haze behind it that lit up the sky.  Then started to fly straight up and disappear. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123742.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c439c",
      "summary": "Bright light projecting beams beneath and leaving cloud trails behind.  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "fremont",
      "shape": "changing",
      "date": "2015-11-19T00:00:00",
      "story": "Bright light projecting beams beneath and leaving cloud trails behind. ((NUFORC Note:  U. S. Navy missile launch.  PD)) I was outside just after sunset at approximately 6:05 PST when out of the South from the direction of San Jose I notice a bright pinpoint of light. At first it looked like an aircraft light in the sky, but as I watched it began projecting two searchlights from underneath, creating a V-shape of light, like two searchlights. Then I noticed the lights were creating a cloud or mist in the sky where the shone. The intensity of the searchlights grew in size and intensity as I watched. The searchlight-like beams below the light stretched down and grew brighter. Two distinct beams were being projected at about a 30 degree angle below and to the left of the light. The light appeared to be at a high altitude, and I thought at first it was a satellite reentering Earth’s atmosphere. It was moving at a rate of speed similar to an aircraft, and as it moved Northwest, the beams grew in intensity. The cloud beneath it remained luminescent for some time as the light progress! ed, and it left a separate, fainter blue-colored trail, behind it marking it’s direction of travel. As I watched the light went behind some tall trees, and I lost sight of it. It reappeared much dimmer when it emerged from the trees, with no lights projecting from beneath it. It slowed, and became an amorphous light (more like Haley’s comet the last time it came around) and seemed to change shape, from a point of light to a vertical shape. I watched for another couple of minutes as it grew dimmer, changing direction and heading Westward towards the ocean until I could no longer see it. Entire event lasted about 5-7 minutes?",
      "link": "http://www.nuforc.org/webreports/123/S123614.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c46cd",
      "summary": "Flying triangle made no sound.",
      "city": "fremont",
      "shape": "triangle",
      "date": "2015-11-26T00:00:00",
      "story": "Flying Triangle made no sound. November 23, 2015,  Approximately 6:44 pm.  Driving east towards Fremont, NE.  Noticed large bright light in sky.  Large light blinked twice and then went away.   As we drove closer we pulled over and it flew right over us.  A large triangle with one white light on each end of the triangle.  One red light in the middle of the triangle.  This flying object made no sound whatsoever.   The object quickly moved west and all lights were turned off.  Except for the red light which you could see in the distance.",
      "link": "http://www.nuforc.org/webreports/124/S124318.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ade",
      "summary": "Black hot air balloon shaped object that didn't appear to move. Stayed same shape, size and apparent direction of Toledo, OH/Lake Erie",
      "city": "fremont",
      "shape": "other",
      "date": "2015-09-29T00:00:00",
      "story": "Black hot air balloon shaped object that didn't appear to move. Stayed same shape, size and apparent direction of Toledo, OH/Lake Erie I saw what appeared to be a giant black hot air balloon hovering motionlessly in the distance. I'm not sure where I was en route to Toledo, OH, on I-90W, but I asked the toll guard at the Rte 75 exit -  where I could still see it straight ahead, \"What is that? Is that a BLACK hot air balloon?\"  She looked out of the toll booth, looking behind her to where I was pointing and said, \"I guess it could be.\" I drove off, mumbling to an uninterested, tired daughter.  On a stormy, scattered shower Sunday evening?  Pure black?  No flags, color? Never seeming to raise or lower at all, nor change direction? It had to be immense. It looked the same size and angle for miles.  I last saw it after I have exited and drove S of Perrysburg, OH on 475W/23N and it appeared to be due North, so either it moved West to North while appearing stationary, or it was over Lake Erie the whole time and I was watching it as I wrapped around from west of Fremont, towards Toledo.  My 6 y/o just assumed it was a hot air balloon - \"Can we go ride ojn one some day? but it was too huge, if it was...and seemingly stationary, and evenly pitch black. I have to think SOMEONE driving West on the busy Ohio Turnpike other than us may have seen it and wondered.  So unassuming unless you really think about the size, unchanging color, image and stationary position that made me think about stopping to take a picture, but not wanting to be alarmist or impede getting home. Just not right. Hoping someone else got a photo.",
      "link": "http://www.nuforc.org/webreports/122/S122328.html",
      "state": "OH",
      "duration": "15 minutes ?"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e58",
      "summary": "Red lights (clustered lighted objects) moving east to west in night sky in western Michigan.  Slowly disappeared into nowhere.",
      "city": "fremont",
      "shape": "unknown",
      "date": "2015-08-13T00:00:00",
      "story": "Red lights (clustered lighted objects) moving east to west in night sky in western Michigan.  Slowly disappeared into nowhere. Multiple lighted objects (red lights) in large group (15 to 20) moving east to west in night sky heading toward local airport.  All disappeared into 'nowhere' one at a time before they reached the airport or the beacon light at the airport.   Airport was empty with no incoming or outgoing planes.  Very rural area.   It was hard to judge the speed and determine the distance, but we believe they were within 5 miles from where we were standing.",
      "link": "http://www.nuforc.org/webreports/120/S120986.html",
      "state": "MI",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e97",
      "summary": "Star-like object moving strangely in the sky.",
      "city": "fremont",
      "shape": "light",
      "date": "2015-08-13T00:00:00",
      "story": "Star-like object moving strangely in the sky. Looked like a star moving slowly across the sky, it moved straight then moved in s series of small U shapes.  This was repeated randomly, it was very high and moved through the Big Dipper.  I thought perhaps a satellite but I could not understand what could be moving like that at that altitude. Not sure if it's related but soon after I lost sight of it a fast moving airplane crossed the sky in the same direction, it moved extremely quickly but at regular airplane altitude",
      "link": "http://www.nuforc.org/webreports/121/S121101.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d51",
      "summary": "3 orbs over central Wisconsin.",
      "city": "fremont",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "3 orbs over central Wisconsin 3 bright orbs at sunset looking west while driving HWY 10, east aprox. 5 miles from Fremont.  Appearing in one position in the sky to disappear and reappear as soon as it disappeared in a different location.  One orb disappearing at a time.  One by one all orbs were gone.   Duration of 6-9 seconds.   Once I arrived home in Stevens Point, I told my roommate of experience and he had same experience looking southward except he saw the lights at two different occasions in the same area of the sky around exactly the time I had.  Based on where we both saw the lights a triangulation to where we were and where we saw the lights puts them over the Plainfield/Almond area.",
      "link": "http://www.nuforc.org/webreports/131/S131305.html",
      "state": "WI",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6762",
      "summary": "Star like craft, appear stationary, very bright, pics.  ((NUFORC Note:  Probable sighting of Venus?  PD))",
      "city": "fremont",
      "shape": "light",
      "date": "2017-03-10T00:00:00",
      "story": "Star like craft, appear stationary, very bright , pics I was looking  in a western (west) position and I looked up to see what appeared to be a very bright star. There was no sound, and it appeared stationary.  I took photos of the object but I was moving  a lot.  Anyway, there were airplanes in the area (they had to see this), but I never seen any airplanes chasing it.  If I am allowed, I will attach a pic. ((NUFORC Note:  Probable sighting of Venus?  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132771.html",
      "state": "NJ",
      "duration": "2-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6bc5",
      "summary": "Red lights sling-shooting through the sky.",
      "city": "fremont",
      "shape": "unknown",
      "date": "2017-01-19T00:00:00",
      "story": "Red lights sling-shooting through the sky. As I was driving home on hwy 96 west I saw a red light appear in the sky about 20 degrees above the horizon.  The light was moving right to left, toward the south.  It brightened and began to slowly fade.  But before it faded out, another, separate red light appeared to the left(south) of the first along the same line the first light was moving towards.  The first light then faded. The second light brightened and began to fade, while moving along the same path as the first.  But again, before the second light faded completely, another red light appeared to the south. This sequence happened five or six times.  Then, the lights just disappeared. I asked the other person in the car if they were seeing this and they said yes.  They described it exactly as I had seen it. The sky was slight overcast with a full moon rising behind us.  Orion was visible through the the high overcast. The only other light I saw was five miles down the road when I saw a white light come on and go off, then a quick flash of a white light. This was in the same quadrant of sky.",
      "link": "http://www.nuforc.org/webreports/132/S132144.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a12",
      "summary": "White lights disappearing and reappearing",
      "city": "fremont",
      "shape": "unknown",
      "date": "2017-12-08T00:00:00",
      "story": "White Lights disappearing and reappearing Was driving west on US 10.  I saw 3 lights in the sky west of me.  I woke my wife up to see, as well.  They disappeared by vanishing from outside to inside, then reappeared to the north a short distance away by spreading out.  Now there were 5 lights.   This happened a few more times with the lights moving north each time.   The hair on my arms was standing up after; strangest thing I have ever seen.",
      "link": "http://www.nuforc.org/webreports/137/S137607.html",
      "state": "WI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8467",
      "summary": "This massive triangle shape wing, that was white beneath, which I thought was a jumbo jet for a second.  ((anonymous report))",
      "city": "fremont",
      "shape": "triangle",
      "date": "2018-10-06T00:00:00",
      "story": "I was outside grilling Burgers around 8:30pm while the wife was in the kitchen cutting up the condiments.  My resident has an expansive backyard that is paved, which we use to workout on sometimes.  I was standing on that looking up as usual at the planes heading to SFO or Oakland Airport.  There are five distinct paths these planes take and always have lights on possibly within 30 miles of landing.   So, I was looking up and there was no planes flying at this time.  It was cloudy, in fact quite cloudy, the type of low clouds you see alot.  There was a large open patch in the cloud about 70 degrees from where I was standing.   Then I saw it...  This massive triangle shape wing, that was white beneath, which I thought was a jumbo jet for a second.  No sound at all, it just flickered in appearance, like it just materialized. I saw no lights blinking or anything.  The undercarriage of this thing was really white, which was kind of shocking, cause I never seen underneath an airline that clear at night.  There was no head or tail like a plane, just a big white triangle that appeared then cloaked just as quick.  I couldn't see any movement in the clouds once it went into it.  Almost like this thing appeared briefly and then hid in the clouds or using the cloud to hide.  It all took about 6 seconds or so.   I don't know what I saw. I can't say what it really was, except very large and eerie. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143331.html",
      "state": "CA",
      "duration": "6 seconds"
    }
  ]
}