{
  "city": "fresno",
  "fetch_timestamp": "2025-07-12T14:31:58.188607",
  "record_count": 115,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4207",
      "summary": "The craft was high in the bright blue sw sky and the best way i can describe it is like a xanax bar it had a row of maybe 4 lights that",
      "city": "fresno",
      "shape": "cigar",
      "date": "2019-03-21T00:00:00",
      "story": "The craft was high in the bright blue sw sky and the best way i can describe it is like a xanax bar it had a row of maybe 4 lights that would shine each independently and then all at once very bright like a star and then turn off one guy was filming it my phone couldnt get a pic.  It was high up above the airplanes flying and it did not move it was there for at least 25 mins maybe longer i had to get back to work.",
      "link": "http://www.nuforc.org/webreports/145/S145224.html",
      "state": "CA",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4480",
      "summary": "Light projecting strong beam of light (like headlights) in sky slowly moving, then disappeared leaving cloud",
      "city": "fresno",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Light projecting strong beam of light (like headlights) in sky slowly moving, then disappeared leaving cloud I saw a light that started eminating a beam of light (looked like headlights in fog) that slowly moved from right to left.  The beam was very strong.  As it moved towards my direction I felt like I would have been in the headlights of an approaching vehicle, but it suddenly disappeared...no bang or explosion, no noise.  It left in it's place a kind of haze or foggy cloud.  This was in the southwest area of the sky and I'm sure it was not an airplane or helicopter...it didn't move in the same way.  Very freaky!",
      "link": "http://www.nuforc.org/webreports/050/S50009.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f9d",
      "summary": "Bright silver triangle hovering in southwest sky making the shape of Deneb, Vega, Altair, Venus. Vanished completely followed by two je",
      "city": "fresno",
      "shape": "triangle",
      "date": "2019-04-12T00:00:00",
      "story": "Bright silver triangle hovering in southwest sky making the shape of Deneb, Vega, Altair, Venus.  Vanished completely followed by two jets after two to three minutes.",
      "link": "http://www.nuforc.org/webreports/145/S145609.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5051",
      "summary": "I’m driving at the end of my block. There is a bright orange ball in the sky. About the size of a dime if I held it up to my eye. So I",
      "city": "fresno",
      "shape": "other",
      "date": "2019-12-22T00:00:00",
      "story": "I’m driving at the end of my block. There is a bright orange ball in the sky. About the size of a dime if I held it up to my eye. So I pull out my phone (while still looking at the object). The dot then breaks into 5 smaller balls and split up. One by one and just like somebody turned off a light switch, they’re gone.",
      "link": "http://www.nuforc.org/webreports/151/S151790.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b534a",
      "summary": "triangle shape object hideing  with strobe lite distraction almost invisable",
      "city": "fresno",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "triangle shape object hideing  with strobe lite distraction almost invisable i saw a strobe like lite comming towards me at about 3.10 am sat. morning. i was on my bike comming home from 7-11. it seem to follow me home. before it got to my house i ran and got my cam corder. then soon as i turned it on here came the strobe lite from behind the tree. it flashed many times. it seem to get lower until it went to low to see. i have a great video of this thing. i hope to share it. well on further examination os video. i saw the triangle shape object behind a different tree. it was seperate from strobe lite. i think it tried to hide behind tree while strobe lite distracted it. i have been looking for and studying ufos for a long time. I REALLY THINK YOU SHOULD SEE VIDEO. IT TAKES a trained eye to see this thing. it was almost invisable. this could be what alot of people want to see. THATS the truth. please respond A.S.A.P. very important. i dont know what to do with video. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51953.html",
      "state": "CA",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b56f0",
      "summary": "fresno early morning sighting",
      "city": "fresno",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "fresno early morning sighting whatching the syk green shooting star then cigar shaped object almost like a cloud or spo=tlight on cloud except there were no clouds in syk it went all the way across the sky dissapearing on next horizion bubble4 shape clouds came in behind it and from the direction it dissapeared in then another green shooting star thats it ((NUFORC Note:  Witness elects to remain semi-anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51772.html",
      "state": "CA",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b59e0",
      "summary": "ufo triangle transparrent !",
      "city": "fresno",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "ufo triangle transparrent ! hi, on the 4th of august i was rideing my bike home from 7-11 at about 3.15 am. i looked over my shoulder then saw this strobe like comming towards me. i motioned to it and said follow me. kind of jokeing about it. i got home ran in the house got my cam corder. went outside turned it on by the tree. then these strobe lites appeared from behind the tree. it must have followed me home. anyway , i have the video at home. i watched it several times. i finally deturmined this object was triange shape with these strobe lites in the front of ship. i could not see ship until i studied video several times. i could see triangle out line. the dam thing is tranparrent. i have studied ufos for years. this object was right over my house very low. and made no sound. please get back to me soon. i must show experts this clasified video. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51579.html",
      "state": "CA",
      "duration": "1minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5af6",
      "summary": "brite ufos forming triangle pattern.  ((NUFORC Note:  Possible advertising light??  PD))",
      "city": "fresno",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "brite ufos forming triangle pattern It or they were way to brite and far to see the shape. They all met at one point , after which they seemed to form this triangle pattern. I saw one at first , followed it around city. It stopped at a point were it met up with 2 more lites. The object i followed then put out a very brite lite. After which it faded. Then the next object put out a even brighter lite. Then a couple of blinking lites showed up. I think there were 6 in all. When they met they all seemed to form this triangle pattern. I think there were 2 triangle patterns from 6 crafts. I have alot of ufo filmed by me right here now. I started filming aug 2nd 06. My first ufo encounter was on that day. 3 am aug 2nd a flashing strobe lite followed me home. I ran in and got my camera. I started filming. Ever sence then ufos always come around. I have rods , ufos , and even aliens all taped by me , and all on film. ((NUFORC Note:  Possible advertising light??  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57089.html",
      "state": "CA",
      "duration": "6 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5af7",
      "summary": "brite ufos forming triangle pattern",
      "city": "fresno",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "brite ufos forming triangle pattern Description: It or they were way to brite and far to see the shape. They all met at one point , after which they seemed to form this triangle pattern. I saw one at first , followed it around city. It stopped at a point were it met up with 2 more lites. The object i followed then put out a very brite lite. After which it faded. Then the next object put out a even brighter lite. Then a couple of blinking lites showed up. I think there were 6 in all. When they met they all seemed to form this triangle pattern. I think there were 2 triangle patterns from 6 crafts. I have alot of ufo filmed by me right here now. I started filming aug 2nd 06. My first ufo encounter was on that day. 3 am aug 2nd a flashing strobe lite followed me home. I ran in and got my camera. I started filming. Ever sence then ufos always come around. I have rods , ufos , and even aliens all taped by me , and all on film. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57098.html",
      "state": "CA",
      "duration": "6 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c7d",
      "summary": "I saw a flash in the sky Fresno,Ca 8/23/07",
      "city": "fresno",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "I saw a flash in the sky Fresno, Ca  8/23/07 I just had taken a shower and thought I would water the plants in the backyard before I went and sat on the couch to start a movie. There is a tree in the neighbors yard that I can see from my backyard. I suddenly saw a glowing light come from behind the tree (no bigger than the north star) in a straight line heading west and then it stopped gave two flashes of light simultaneously and all of a sudden shot straight in the air at such a speed it was unbelieveable and as it went higher it gave one last flash and completely went black. The whole experience lasted 4 seconds. No longer. I know what I saw was real it was so silent and so fast there is no way it was anything human. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58362.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6074",
      "summary": "3 strange lights, hovering, flipping, and spinning like a top; very close to the I5freeway.",
      "city": "fresno",
      "shape": "egg",
      "date": "2007-08-07T00:00:00",
      "story": "3 strange lights, hovering, flipping, and spinning like a top; very close to the I5freeway. My boyfriend and I were driving home to San Bernardino from Ashland, OR when he woke me up to look at something. He woke me up and pointed out these two lights that were flashing in the sky. To him, he thought it was a plane that was flying so low it was going to crash. We watched these lights for a minute, and a third one lit up and the thing flipped over, and was doing all these crazy flips. Then, it flew over the freeway towards I5North and it went into this field and looked like it had landed, but you could still see the lights. Suddenly they came back up, hovering, and started spinning like a top. It flipped over and came back over the freeway to I5South, and by this time it was behind us. My boyfriend told me to get his digital video camera out, and as I was looking for it, the thing turned on it's side and flared up its lights and looked as if it was coming after his car. I decided to forget about the camera and just told him to drive.  I'm not saying anything about aliens or other life forms - there could have been a very logical explanation for what we saw....but as of right now, I don't know what that is. So I can only define it as an unidentified flying object,which is exactly what it was.",
      "link": "http://www.nuforc.org/webreports/057/S57433.html",
      "state": "CA",
      "duration": "approx 3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b614b",
      "summary": "i  seem to  be the only one of  my  siblings  to  recall this event.i  do not  understand  why  this  is.",
      "city": "fresno",
      "shape": "",
      "date": "",
      "story": "I  seem to  be the only one of  my  siblings  to  recall this event.  i  do not  understand  why  this  is. myself and some of my siblings were outside afterdark and i heard this exstremeley loud whirring,rotating sound closely over my head.i looked up,and the u.f.o.was hovering over myself and siblings.it was so close that i was able to see its shape.it was disc shaped. there was a white flourescent type light completely around the middle of it.it began to do movements,maneuvers higher in the sky above us.we lived near two irragation ditches and highpower lines.the maneuvers it was doing,were lightening fast.it was as if it was putting on a preformance for us.it was zig-zagging in a closed v formation.after that it slowed down,and i noticed as it did,its engine sound was at a lower sounding pitch. as it began to take off,slow,at first,as it picked speed the sound and pitch of the eng- ine became much higher and it just blinked out,as if turning off a light switch.i do not know why in the world it decided to pick abunch of kids to hover over.i was 8-9 yrs old. ((NUFORC Note:  Witness provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62355.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b677a",
      "summary": "I am not the witness of this event. Approximately 23:50 hours my girlfriend, her sister and her boyfriend were driving on Interstate 5",
      "city": "fresno",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "I am not the witness of this event. Approximately 23:50 hours my girlfriend, her sister and her boyfriend were driving on Interstate 5 from Los Angeles to the bay area when a object flew directly at there vehicle from the north. When the object passed the vehicle it flew at a 90 degree angle to the east at a high rate of speed. There were three large lights on the object.",
      "link": "http://www.nuforc.org/webreports/063/S63525.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6bac",
      "summary": "Bright light southbound over Fresno, Ca.",
      "city": "fresno",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Bright light southbound over Fresno, Ca. Bright light like a typical aircraft landing light out of the north, southbound. Went inside, got 15x Binocs, light dazzling, no position or collision lighting visible. Bright white light w/halo effect from intensity. NOT projecting in any direction like a landing light would when object directly overhead. Not pinpoint but BB at arms length with naked eye. Went inside to get wife, came out and no longer visible. Should have still been traversing sky at the original rate of travel. Unable to guess at altitude, no audible sound. Sky clear.",
      "link": "http://www.nuforc.org/webreports/063/S63721.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ffb",
      "summary": "Fast light zig zagging over Fresno",
      "city": "fresno",
      "shape": "light",
      "date": "2006-07-16T00:00:00",
      "story": "Fast light zig zagging over Fresno The time is not correct, but it was between 2200 and 2400 hrs. A light came from the southwest, moved toward the northeast at such a rate I was nervous. It then made a sudden 45 degree cut towards the west. This also alarmed me because it did not turn like any plane or animal could. It then made a 45 degree cut back to the north and then cut one last time back to the north and seemed to rise out of sight. I was stuned and happy to see such a thing. I only hope another person saw it, but I doubt it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50614.html",
      "state": "CA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b74dd",
      "summary": "three unknown objectsa over fresno",
      "city": "fresno",
      "shape": "oval",
      "date": "2007-08-14T00:00:00",
      "story": "three unknown objectsa over fresno me and my friend \"a\" were returning from a business trip to las vegas and we decided to also take a little r in r time in fresno where we stayed for two days and when we decided it was time to return to good old oregon it ment we have to travel north where we seen three ovahada video on are l shaped aircrafts in the air for a small amount of time we had a video on my cell phone but for some reason it disappeared and it freaked both of us out but we were two embarresed to say anything until now well thats my story  \"r\"",
      "link": "http://www.nuforc.org/webreports/058/S58089.html",
      "state": "CA",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b75ca",
      "summary": "Bright white sphere moving south over  Fresno",
      "city": "fresno",
      "shape": "sphere",
      "date": "2007-08-07T00:00:00",
      "story": "Bright white sphere moving south over  Fresno Wednesday @ approximately 10:20pm, July 25,2007  I saw a bright light moving from north to south, flying at a slow speed, not to high and not too low, but a couple hundred feet in the air. I saw no outline of an airplane, it made no noise, and slowly traveled in the southernly direction towards LA.  I even used my binoculars and saw, no flashing lights, no color lights(red or green)but a white sphere. Not sure what it was but I know it couldn't have been a helicopter or airplane!  I live by an airport and see airplanes and jets take off daily.  This was no airplane! ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57844.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d36",
      "summary": "BIG red blinking circle above Fresno,CA",
      "city": "fresno",
      "shape": "circle",
      "date": "2006-12-14T00:00:00",
      "story": "BIG red blinking circle above Fresno,CA I was going outside to get some change out of my truck to walk to the store an get a soda. Well when I walked outside I looked up at the sky (something I always do now ever science I watched another ufo fly around for about 2.5 hrs. in the mountains w/2 other people) and about 10:00 in the sky  Facing east I saw a small grouping of red blinking lights in about .5 inch space in the sky, Well this was way to close for it to be seperate planes but way to big to be a single aircraft, then as I stared more red lights began to show in a sync counterclockwise motion this is when I was like ((deleted))!  Thats #2 I thought in my head,well the lights went around in sync counterclockwise in 1 BIG Circle(Id have to say it was the size of a city!!I  mean miles!) and it was gone.  This is the same day of the launch, and I just heard on t.v. that it was cancelled.  I swear my lower jaw was glued to my chest. Well belive this or not its up to you but I know the truth.  There is nothing I could do or say to prove this unless you know me,but I am no ((deleted)) liar and I dont need to make  friends or attention-",
      "link": "http://www.nuforc.org/webreports/053/S53863.html",
      "state": "CA",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b7f4f",
      "summary": "Red and blue flashing lights in star like object ..IT MOVED",
      "city": "fresno",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Red and blue flashing lights in star like object ..IT MOVED I was telling my son in law about a star like object that I had seen for the last four nights, in the same  northwestern portion of the sky.  I had watched this light for approx 4 hours the first night. It looked like a star but through binoculars it was clearly pulsating blue and red lights with a white light in the center. It did not appear to move but though it looked as though it was very far away it shown very brightly. On this fourth night I shared the binoculars with several people who tried to come up with some explanation. We had just about concluded that as the internet suggested, it must be the refraction of light between us and a planet causing red and blue flashing appearance when the light within seconds moved to the horizon low to the earth but still probably hundreds or thousands of miles away. No planet or star would move in this manner and no aircraft could have covered the distance so quickly. Now I am really wondering what this is and if it will return!",
      "link": "http://www.nuforc.org/webreports/072/S72560.html",
      "state": "CA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8048",
      "summary": "An apparent star in the night sky which exhibited anomalous behavior",
      "city": "fresno",
      "shape": "other",
      "date": "",
      "story": "An apparent star in the night sky which exhibited anomalous behavior I had this experience as an 11 or 12 year old child, but I have always remembered it precisely.  I have long thought that I should submit a record of this to someone who would add it to the data on this topic, and I am finally doing it. Let me preface by saying that through the years, I have observed several objects that people who were with me at the time thought were UFO’s, but I knew they weren’t because I knew what they were.  One was a weather balloon, one a jetliner near the airport (when they have their landing light on at sunset, it is a striking sight), one a meteor close enough to hear the roar and light up the night sky and one a military missile in an inexplicable location.  However, the one sighting I can’t explain was the least visually striking.  I say all this to demonstrate that I have a decent amount of knowledge in explaining explainable sightings. One soft summer night which I believe was 1963, but may possibly have been 1962, my father, my three sisters and I went out on the patio to watch the Perseid meteor shower.  It was sometime in August.  We had a rollaway bed out there, and we all lay down on it sideways and side by side with each other.  We scanned the sky for shooting stars, which appeared at the rate of about one per minute. One of my sisters said, “look, two stars are colliding!”  We all looked where she indicated, and indeed, you could see two stars moving toward each other.  As we watched, they did, in fact, meet and merge into one, only to separate again after a few seconds.  After that, everyone else went back to looking for shooting stars, but I kept observing this phenomenon.  After a couple of minutes, I realized that only one of the two stars was in motion.  It kept moving on its steady path, and I kept watching. My first thought was that it was a satellite.  Some months earlier, forewarned by a news broadcast, we had gone out to watch one of the early manmade satellites pass overhead.  It looked just like a moving star.  I suppose it reflected light from the sun, which enabled us to see it.  It had a steady progression across the sky and kept a fairly steady level of brightness.  After ten minutes or so, I realized it couldn’t be an orbiting satellite.  I noticed its apparent path across the sky was noticeably slowing.  I kept watching, and the next thing I noticed was that it was dimming.  I kept watching for perhaps half an hour, and it gradually slowed until it was essentially motionless in the sky, and it gradually dimmed until finally, it slowly became impossible to make out.  At first sight, it had the appearance of a medium to medium bright star. It was clearly not a satellite or a meteor.  The only scenario I’ve ever been able to think of that matches my observation is that of a space ship in the process of leaving Earth’s orbit.  In 1963, we had no space ships which left Earth’s orbit.  What I saw was truly an unexplained flying object. I would be glad to answer any questions concerning this. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69247.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a9c",
      "summary": "4 unknown flying crafts were following our car and another one hovered over our neighborhood when we got home.",
      "city": "fresno",
      "shape": "rectangle",
      "date": "2009-03-19T00:00:00",
      "story": "4 unknown flying crafts were following our car and another one hovered over our neighborhood when we got home. My husband and I for the last 2 1/2 months have been seeing strange hovering objects in the sky beginning Nov. 3rd 2008. The last sighting was last night around 6:45 pm. We were driving west on McKinley ave in Fresno CA on our way to a meeting. We noticed 4 hovering objects at a stand still on each side of our car about 3 miles up in the sky when we were at a red light. Once our car started moving they moved along side us, every time we stopped they stopped. They all looked alike and did not look like helicopters and not planes. Later on in the evening on the way back home we spotted another craft similar to the ones earlier just hovering at a stand still above the houses in our neighborhood. the object even brightened its lights from red to super bright white. it was still for about 3 minutes then slowly started to move to the right, then left then it either vanished or we just did not catch it take off. This is not the first time we have seen these objects in the sky. we seen larger ones the size of two commercial planes before. We just find it strange that the sightings have not stopped. Our children, my parents friends and my mother in law have all witnessed them. For some strange reason these objects have not gone away and seem to be growing by the numbers each day and showing themselves pretty boldly. If anyone has seen them also please post a report, we hope we are not just going crazy over here by ourselves.",
      "link": "http://www.nuforc.org/webreports/068/S68180.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b02",
      "summary": "Fresno sighting",
      "city": "fresno",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "Fresno Ca sighting i was coming home late, my fiance was driving and i was just looking at the stars when i see these stange lights, it'll be a little hard to explain, 1st i seend this giant ball of elevctricity pulsating & throwing sparks everywhere, s we turned around because my finace said it was a transformer blowing. but not how they usually do, i mean it was huge! so we went back and all the chloride (i think thats what its called) was blown all over the road. so we just started heading back home, and we believe something else is out there but weve never seen anything, so we were just joking saying, wouldnt that be crazy if it was a UFO and it charged itself up off that electricity & thats what made it blow up like that. well not even 2 min later driving i seen 3 greyish lights, like picture two squareish diamond shaped lights, while it was slowly gliding straight ,one on the left and one on the right, spaced out then another in the middle but lower and then the left & r! ight ones (while the middle one stayed) would expand out and slowly contract back, then the whole thing would like glitch foward. so we were wondering if maybe it wasnt recharging it just got crossed with the electricity & messed the \"ufo\" up because it seemed like it was having difficulties or something. but this happened for about 1-2 min. but i live in the country so a bigrig came up behind us & had bright lights so by the time he passed i looked back up & he was gone! did anyone else around fresno see this? my fiances dad came in the next ming saying him & all his workers sw something that morning too. i couldnt get no pictues as my camera is only 1.3 on my phone. all the other posts read are way different but im 110% sure this was nothing tha couldve been mistaken. ((NUFORC Note:  Witness indicates that date is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73185.html",
      "state": "CA",
      "duration": "1 MIN"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b34",
      "summary": "UFO THAT STOPPED DEAD CENTER, HOVERED, AND BOLTED UP TO THE RIGHT AND CONTINUED TO HOVER ALONG  I-10 E NEAR FRESNO, HEADED TO TEXAS.",
      "city": "fresno",
      "shape": "cigar",
      "date": "2010-04-13T00:00:00",
      "story": "UFO THAT STOPPED DEAD CENTER, HOVERED, AND BOLTED UP TO THE RIGHT AND CONTINUED TO HOVER ALONG  I-10 E NEAR FRESNO, HEADED TO TEXAS. WHILE DRIVING FROM CALIFORNIA, SOMEWHERE NEAR FRESNO, TO TEXAS, LATE NIGHT, AROUND 11 PM OR SO, ON THE FREEWAY, I NOTICED WHAT I THOUGHT TO BE AN AIRPLANE TO THE RIGHT OF ME THAT WAS QUITE A DISTANCE AWAY, AND COMMENTED TO MY MOM, \"OH LOOK, AN AIRPLANE, AT WHICH MY MOM STATED \"OH YEAH\". NOT THINKING ANYTHING ELSE OF IT I GLANCED AWAY, BUT THEN GLANCED RIGHT BACK AT THE OBJECT AS I REALIZED THAT IT WAS FAST APPROACHING, AND HEADED OUR WAY. I KEPT MY EYE ON THE OBJECT AND SOONER THAN I COULD IMAGINE, IT WAS RIGHT UPON US, ONLY I CAME TO THE CONCLUSION RIGHT AWAY THAT THERE IS NO POSSIBLE WAY THIS COULD BE AN AIRCRAFT OF OUR WORLD! REASON: THE AIRCRAFT CAME WITHIN A FEW INCHES(12-18) OF HITTING MY VEHICLE ON THE RIGHT FRONT HOOD, SUDDENLY STOPPED AND STAYED THERE FOR A BRIEF FEW SECONDS, THEN BOLTED UP TO THE RIGHT AND LINGERED THRE. IT STARTLED MYSELF AND MY MOM, TO THE POINT THAT I ACTUALLY THOUGHT THIS AIRCRAFT WAS GOING TO HIT MY VEHICLE, THAT I HIT MY BRAK! ES AND MY MOM HAD A LOOK OF SHOCK ON HER FACE. MY SISTER, MY DAUGHTER AGED 9 AND NEPHEW AGED 11 WERE IN THE BACK SEATS ASLEEP AND WERE AWOKEN WHEN THE VEHICLE JOLTED, DUE TO THE APPLICATION OF THE BREAKS.MY SISTERS TWIN DAUGHTERS, ALSO IN THE BACK SEATS,REMAINED ASLEEP. I YELLED TO THEM TO LOOK AT THE AIRCRAFT, AND WE WERE ALL AMAZED. IT WAS HOVERING, BUT STATIONARY, AND DIFFERENT COLORED LIGHTS, LIKE STROBE LIGHTS, WERE BLINKING FROM THE AIRCRAFT. AS SOON AS MY SISTER SAW THIS, SHE REACHED FOR HER CAMCORDER, BUT AS YOU CAN GUESS, THE BATTERY WAS DEAD! BY THIS TIME WE NOTICED THAT OTHER VEHICLES WERE DRIVING SLOWLY AND HAD THEIR ATTENTION ON THE AREA WHERE THE AIRCRAFT WAS HOVERING. I NEVER FULLY STOPPED MY VEHICLE, BUT WAS DRIVING SLOW, AND WE WERE ALL WATCHING IN AMAZEMENT. NOT KNOWING WHETHER I SHOULD OR NOT, WE DECIDED THAT I SHOULD CONTACT THE POLICE. I EXPLAINED TO THE OPERATOR WHAT WE HAD SEEN, BUT WAS UNABLE TO TELL HER EXACTLY WHERE THIS TOOK PLACE, AS WE WERE UNAW! ARE OF THE AREA. STILL IN AMAZEMENT, ALL IN THE VEHICLE WERE S! TILL IN SHOCK AS TO WHAT WE HAD JUST SEEN, AND I EXPLAINED TO THOSE IN THE CAR WHAT HAPPENED BEFORE THEY WERE STARTLED AWAKE BY ME APPLYING MY BREAKS, THEN MY SISTER ENCOURAGED ME TO TURN AROUND AND SEE IF THE UFO WAS STILL THERE, WHICH I DID, BUT IT WAS GONE, SO WE KNEW IT WAS NOT JUST OUR IMAGINATION. IT WAS REAL. WE SAW A UFO! IT COULD NOT HAVE BEEN AN AIRPLANE, JET, HELICOPTER, OR WHATEVER ELSE, IT STOPPED DEAD CENTER, MOVED UP AND RIGHT, AND HOVERED. WHAT EARTHLY OBJECT DO YOU KNOW, CAN ACCOMPLISH THIS?",
      "link": "http://www.nuforc.org/webreports/074/S74794.html",
      "state": "CA",
      "duration": "3-5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c1d",
      "summary": "red glowing lights form triangle",
      "city": "fresno",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "red glowing lights form triangle I work Security at night, and I was just leaving some ones house that was a loud party call. My partner called me, he is about a mile away locking up a pool and dock area, he tells me to look up in the sky, I  do, and there is a big triangle,( the point is at the rear, ) with red glowing lights at each point. Now when I say lights, I don't mean like car or plane or copter lights. They looked like a glow from a fire or if a trash can was turned upside down and a huge road flare was put inside of it. I didn't see anything else to describe, no hull, nothing else. It was very cloudy that night due to an earlier rain, the clouds were low, and it moved right in them. It also moved very slow.  As it moved further away from me, the back      light trailed back and the front left light trailed to the left. And that is the last I seen of it. It was also big, hard to tell exactly, best guess, about 60 to 75 feet. It was some what close, about 100 to 150 yards in front of me, and about 3 light poles up, I am not great at guessing feet when it comes to altitude. There was no sound that I could hear. Juan, my partner said he seen some of the hull, and saw the lights crossing. I will try to get him to fill a report out.",
      "link": "http://www.nuforc.org/webreports/068/S68484.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d29",
      "summary": "Lights In fresno form Pentagon by woodward park",
      "city": "fresno",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "Lights In fresno form Pentagon by woodward park It was at night, i was walking my dog with my friend and we saw lights in the sky that formed a pentagon. They were traveling at normal airplane speed than two split up and took off at a much faster speed , then they all went they're separate ways. They were flying lower than i would expect a normal aircraft. Also, the direction they were headed leaded me to believe they came from behind my community of house, and behind my community of houses is not much of anything for miles and miles. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74752.html",
      "state": "CA",
      "duration": "About 3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d84",
      "summary": "I used to want to see a UFO so badly, but now I wish I never saw it.",
      "city": "fresno",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "I used to want to see a UFO so badly, but now I wish I never saw it. Me and my friend were outside. I was looking at the stars when I see a light in the sky. There were no other stars around it. It looked so weird, I didn't take my eyes off it. Then I see 4 lights flash off the side, in a straight line. I was amazed. I looked around to tell my friend. He came over and looked up. The look on his face went to confused, to scared. He walked inside saying it's too much for him. I didn't move at all. I wanted to see exactly what it would do. 5 minutes passed. The lights continued to flash. Then, it started to spin. I started walking a little closer, but then at the corner of my eye i see another light. I look closely at it. Then a craft came out of nowhere and slowly hovered almost above me. Almost as if they were watching me. Then it got to the end of our fence. This craft was floating above the house, it caused our lights to flicker. As soon as it got above our house, it went blurry and just disapeared above our house. It vanish! ed, it didnt move it just disapeared. My friend comes outside and he sits down on the chair. He was talking to his girlfriend acting as if nothing happened. He didn't see what I just saw. I turn to him and start walking toward him. All I said was Joey, then passed out on his porch. I woke up in his room in the chair. Every night since that night I hear things above my house. Around one to four. One night i actually saw lights flash through my window. I never sleep anymore. Im terrified of what i saw. Its been 2 months. I continue to hear hovering every night. I thought it was my fridge, but when i unplugged it and went upstairs, it got louder. I didn't want to see what i saw. And I know how most people want to see one so bad, but believe me, you don't want to encounter one. I never sleep, knowing I'm being watched and in fear that something might come in. I wish I never saw it. ((NUFORC NOTE:  Witness indicates that date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74705.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b922a",
      "summary": "Fresno cal. bright light hovers over head then vanished",
      "city": "fresno",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "Fresno cal. bright light hovers over head then vanished Shortly after midnight a group of about 10 adults and 5 kids observed a bright orange colored light appeared in the sky, we thought it was a airplane until we relised it was not moving.            Then it just vanished.",
      "link": "http://www.nuforc.org/webreports/073/S73928.html",
      "state": "CA",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b92f9",
      "summary": "Very bright light receding toward the East over the Sierras",
      "city": "fresno",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Very bright light receding toward the East over the Sierras Watering lawn facing east. Just getting dark, few stars out. Up and to my left was a bright light, just like an aircraft landing light but larger. About the size of a pea at arms length. Grabbed my 10x60mm binoculars to see better, but still a round light-bright white and steady, with an \"aura\" around it as if illuminating atmospheric moisture. Humidity here only about 20% though. Light travelling toward the north-north east steadily. Not fading as is typical with satellites. No deviation from straight line. Altitude unknown. No sound. High enough to disappear over the Sierra Nevada mountains to the east of Fresno. Anyone outside would have observed it. Well above the plane of the ecliptic. No flashing/rotating/nav lights",
      "link": "http://www.nuforc.org/webreports/071/S71022.html",
      "state": "CA",
      "duration": "3-5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b94ca",
      "summary": "Bright craft observed by two teenagers in fresno ca 1989",
      "city": "fresno",
      "shape": "fireball",
      "date": "2009-06-09T00:00:00",
      "story": "Bright craft observed by two teenagers in fresno ca 1989 Around the summer of 1989, a friend and I both about 13 years of age were on the roof of my moms’ house pretending to be ninjas and sword fighting.  It was about 9pm. We noticed a light in the sky. It was a very clear calm night; it looked like a ball of fire like a hot coal. The closer it got to us it looked more like a football or possibly saucer shaped thing, which was hot white/yellow in the center and got orangish gold toward the outside. This thing flew from a distance away toward us and above and beyond us across the sky. Approximately 500ft up?  It was totally silent. The size to our vision would be similar to if you held a children’s “nerf” football out at arms length. Being at the height that I assume it was, it was very big. Bigger than my moms house easily. I have seen the EXACT SAME style craft on a ufo show. the one where craft hits the desert then bounces back up then hits again and explodes into a million firey lights, its pretty popular i think. Here is the weird part, we had my moms camera up there to use like a scope (kids ya know) it was an old 80’s rectangular style one. Anyway with camera in hand I saw all this. Never once thought to take a picture at all. It was too strange for me to do anything but stare at this thing. It didn’t move super fast either. 100mph? Now that im almost 33 im a better judge of visual speed applied to something at a distance and 100mph for an air craft isn’t that much I think. We had our parents look through the news papers to see if a meteor had hit or other people reported seeing it. it was really big. There was nothing. Ok, years later, when I spoke to my friend about this again, he said something I didn’t remember and still barely remember. Within 5 min of the sighting, he said 3-5 military style helicopters flew across in the same direction. This could have been at the point that I jumped off the roof and frantically tried to explain to my mom what had just happened. Since those days, I have become a huge ufo enthusiast as well as other unexplained things. All stemming from personal experiences like this one.  I will post more sightings I have had over the years right after this one too because the form wouldn’t let me use “various” under times and dates. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70363.html",
      "state": "CA",
      "duration": "1-2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9637",
      "summary": "Glowing bluish- green ball of light  flying west to east at rapid rate of speed.  ((NUFORC Note:  Possible meteor??  PD))",
      "city": "fresno",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "Glowing bluish- green ball of light  flying west to east at rapid rate of speed I was driving due east on a dark street when a bluish-green ball of light flew directly over my car from behind me (west) at a very high rate of speed. It was a little smaller than the diameter of a traffic light across 4 lanes of road and had no tail or other lights, just a glowing ball of unearthly light.  The sky above me was clear but it's direction was toward the Sierra Nevada mountains which were shrouded in clouds. I couldn't tell if it simply disappeared or was obscured by the distant clouds. Nor could a tell if it was small and close or large and at high enough an altitude to fly into the clouds. No sound was heard. ((NUFORC Note:  Possible meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68692.html",
      "state": "CA",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c99",
      "summary": "I saw a black triangle shaped object about 300 ft in length with a dim red light at each point traveling slowly past over me.",
      "city": "fresno",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "I saw a black triangle shaped object about 300 ft in length with a dim red light at each point traveling slowly past over me. I saw a black triangle shaped object with 1 dim red flashing light at each point of the triangle. the size was 100 yards to 150 yards in lentgh hovering above me about 250-350 yards above me.the object was completely silent and was traveling south very slowly when it passed over me it turned slightly to travel southeast and continued on that path until it was no longer in my sight. I got a very good look of what the object look like from under it it was all solid black with uneven surface almost half dome shaped around were the lights were.",
      "link": "http://www.nuforc.org/webreports/067/S67506.html",
      "state": "CA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0fe",
      "summary": "Two Jets following or escorting an unknown white dot looking  craft.",
      "city": "fresno",
      "shape": "other",
      "date": "2009-08-27T00:00:00",
      "story": "Two Jets following or escorting an unknown white dot looking  craft. I was walking with my mother on the Dakota and Fruit ditch in Fresno, Ca. I heard two jets so I looked up and saw that they were really close, and then I looked back up and saw that they were following something. The UFO was a white dot it kind of looked like the international space station does when it goes over. It had no blinking lights like the jets. It looked peaceful, moved slowly it looked to me as if the jets were escorting it somewhere. We live close to the airport and it has an air defense base, I heard jets take off about ten minutes before, they were heading north then turned east, when I saw the two jets following this craft side by side they were head south west. I remember the time being 9:03am because that is when I twittered about it.",
      "link": "http://www.nuforc.org/webreports/071/S71741.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb1de",
      "summary": "We were looking SouthEast when in the sky we saw around oval shape object that was changing color",
      "city": "fresno",
      "shape": "oval",
      "date": "2011-03-10T00:00:00",
      "story": "We were looking SouthEast when in the sky we saw around oval shape object that was changing color I was in my bedroom when my brother called out to me to come over into the living room and into the backyard to check out this oval round object in the night sky   Southeast of us changing colors,but standing very still for about 10 minutes.  Then it started moving and i saw luminous colors coming from the craft ranging from yellow,red,green,white,and blue.  It went towards the sierra mountains and left.",
      "link": "http://www.nuforc.org/webreports/080/S80264.html",
      "state": "CA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4a1",
      "summary": "10-12 lights - Swarm/Formation",
      "city": "fresno",
      "shape": "light",
      "date": "2011-02-18T00:00:00",
      "story": "10-12 lights - Swarm/Formation I saw 10-12 lights in the sky.  They seemed to by very far away and flying in a swarm around a central point.  Then the lights simultaneously spread out into a specific formation.  Two rows, offset by one.   At this point, I ran to grab my camera, but there were no lights when I returned.",
      "link": "http://www.nuforc.org/webreports/080/S80017.html",
      "state": "CA",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb504",
      "summary": "Myself and three others viewed a blue orb like sphere stream across the sky.",
      "city": "fresno",
      "shape": "sphere",
      "date": "2011-01-05T00:00:00",
      "story": "Myself and three others viewed a blue orb like sphere stream across the sky. UFO Sighting  \tI believe at 5:02 PM Pacific Time Monday; December 27, 2010 in Northeast Fresno, California three individuals and myself viewed what appeared to be an UFO.  I have no paranoia towards UFO or extraterrestrial life forms.  Although I believe their existence highly possible, I believe that this fact has no effect on what I saw.  All three individuals including myself acknowledged the scene that occurred.  All four of us pointed and followed the bright blue object that can only be described as an orb, as it streaked across the sky at a much lower altitude of any airplane.  The orb went south to northeast and was only visible for more than 15 seconds before it vanished very abruptly.  As I alerted the other individuals that it could be a possible UFO, they all dismissed the orb and didn’t mention it all day.  We viewed this in the northern sky in our car near the San Joaquin River.  The orb seemed to be above the water and going in the direction of the river to the north.  I believe I saw something that was not an airplane, and much faster than any remote light or flare. This is not a fake account.",
      "link": "http://www.nuforc.org/webreports/079/S79384.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb68e",
      "summary": "No objects seen only 5 or more lights moving in a rapid circles. Heavy clouds but lights visible. Unusual and scary.",
      "city": "fresno",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "No objects seen only 5 or more lights moving in a rapid circles. Heavy clouds but lights visible. Unusual and scary. Fresno California zip 93710 November 20, 2010  11:00 PM Weather is heavy clouds  Outside my home is very light similar to what it would look like at the beginning of dusk. On my patio, I first noticed how light is it outside and quite abnormal for this time of night. I glanced up and noticed many lights above the clouds moving fast in wide circles. At first I thought it might be a spotlight on the ground but soon realized there were too many of the lights to be one spotlight circling. They move fast and in a very wide circle but not a perfect circle and the heavy clouds would prevent me seeing any beams of light but only the lights themselves. No objects outside the beams of light were present. ((name and telephone number deleted))",
      "link": "http://www.nuforc.org/webreports/078/S78994.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb9ae",
      "summary": "i was ridind to work. i seen a grate sun rise so took a photo. when got to work and look at the photo i seen a blue dot in the photo to",
      "city": "fresno",
      "shape": "unknown",
      "date": "2010-07-06T00:00:00",
      "story": "i was ridind to work. i seen a grate sun rise so took a photo. when got to work and look at the photo i seen a blue dot in the photo top left hand corner",
      "link": "http://www.nuforc.org/webreports/075/S75999.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bbd30",
      "summary": "Large cheese shape triangle flying over fresno",
      "city": "fresno",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Large cheese shape triangle flying over fresno This object was a very large thick triangle shape it was about 150 -200 ft long and about 75-100 feet thick.  On each point it had a white light and each side had 3 to 5 red lights and the back side had 5 to 10  red lights that moved in a clockwise pattern.   The craft seemed to be in a dark gray or black shade of color.  The flight path of travel was very quite and was heading in a direction of south west movement and a speed was fast but not to fast almost the same speed of a airliner crossing the sky at there cursing speed.I believe it was between 1000 &#8722;1500 feet in alt.",
      "link": "http://www.nuforc.org/webreports/083/S83451.html",
      "state": "CA",
      "duration": "2min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf91",
      "summary": "Orange bright lights appeared in the sky",
      "city": "fresno",
      "shape": "triangle",
      "date": "2012-01-12T00:00:00",
      "story": "Orange bright lights appeared in the sky Fresno, California - Dec. 16, 2011 at 9:29 pm.   I was driving home when my family and I noticed three bright orange lights shaped in a triangle.  And they were moving slowly (north). As we continued to drive we got closer and we spotted another bright orange light a head of the triangular set of lights.  But the strange thing about it they were all moving at the same time and pace.  It was clear that it wasn't a plane because it looked so close like as if a house near by had a very large antenna on the top of the roof.   But as we got closer we realized it was above us!!  It was above the intersection of all the traffic!!   Traffic had pulled over and started taking pictures of the sighting with their cellphones.  And then it just vanished. It was pretty cool!!   I'm still stoked about it, my kids have so many questions... ",
      "link": "http://www.nuforc.org/webreports/085/S85908.html",
      "state": "CA",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2bc",
      "summary": "Strange stationary red light  in the northwest sky in Fresno",
      "city": "fresno",
      "shape": "sphere",
      "date": "2011-12-12T00:00:00",
      "story": "Strange stationary red light  in the northwest sky in Fresno I was driving west on Shaw Ave on observed a redish light in the northwest sky. It appeared to be stationary and was a constant light.  I drove a approximately one mile and turned off on a side street to stop and observe.  Within a few seconds after parking I observed the light move as if it were dropping, blink one or two times, vanish and then two bright much smaller white lights flashed in a line.  After this there was nothing in that area of the sky",
      "link": "http://www.nuforc.org/webreports/085/S85450.html",
      "state": "CA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc56d",
      "summary": "Four oval objects 15\"x20\" emitting beams with bright orange read glow suspended 100 ft. overhead for 15secs. took off N-east",
      "city": "fresno",
      "shape": "oval",
      "date": "2011-10-25T00:00:00",
      "story": "Four oval objects 15\" x 20\" emitting beams with bright orange read glow suspended 100 ft. overhead for 15 secs. took off N-east my wife and i were liesurely walking in the dark. It was a clear october night- 10/15/11@19:30 hr.  We saw  four oval bright objects 15\"x20\" emitting beams with a bright orange read glow passed overhead about 100 ft. high.   My wife shouted at this object- \" who are you\". It got suspeended for about 15 secs. then they all took off soundlessly together going northeast in the same direction towards the stars. Duration of events 3 minutes.            No fireworks,no celebrations , no aircrafts nearby during the sighting",
      "link": "http://www.nuforc.org/webreports/084/S84648.html",
      "state": "CA",
      "duration": "3 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bc54e",
      "summary": "Circle of bright lights hovering slowly and than disappearing.",
      "city": "fresno",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "Circle of bright lights hovering slowly and than disappearing. At aprox 4 am I heard my dogs barking frantically so i rushed to the window facing the south end of my house and immediately saw a round shape with numerous bright lights immersing from the object,   it was hovering slowly east in the empty field and was not stopping or making any noise.    I watched it as it floated 100 more feet or so and than vanished.   It was about 5 feet around.",
      "link": "http://www.nuforc.org/webreports/084/S84333.html",
      "state": "CA",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc698",
      "summary": "My first sighting of a UFO",
      "city": "fresno",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "My first sighting of a UFO On the night of December 6, 2011, as I am traveling North of Chestnut Ave. coming from Alluvial in Fresno, CA heading to Sonic to buy food for my son, I seen an unidentified aircraft coming at me.  It was around 8:30ish.  There were hardly any stars in the sky, it was dark.  There were no cars in front of me or behind me, but cars coming from my opposite direction.  As I was driving up North towards Nees Ave on Chestnut, I saw a light coming somewhat straight at me.  At first, the thought came to my mind that it is an airplane crashing down, I felt somewhat scared.  I did not want to witness anything extreme at that moment.  The flying object as it descended from the sky, started slowing down and got bigger.  As it was getting bigger and getting close to me (feelings: very scared), I began praying for it to stop or just be close enough that I could see it, but not close to me as to like being in front of me.  I really did not want to get abducted, that was the next thought in my mind.  The UFO aircraft stopped and hovered for a few seconds.  As I was staring at it, my thoughts were “Am I really seeing this?” the feelings of being shocked was trembling in my body.  My eyes were stuck at this unidentified aircraft, trying to figure out what this thing could look like, but all I seen was 3 circular lights, somewhat close together, shaped like a triangle, the lights looked as if it was spinning at a rapid rate, from red and blue, with traces of yellow light as it was glittering and spinning at a rapid rate.  The bottom of the craft looked like it had some rigid form structure around the lights. The UFO aircraft did not look large; it seemed somewhat medium/small size.  That was all that I seen from that... After a couple of seconds, maybe 15-20 seconds, it gradually started to move, to the right of my view, and curved up towards the sky.  It was lighting speed, it made traces of white light (like a tail of a star falling from the ! sky, except it was going up) as it ascended to the heavens.  I! never s een anything like it, or have I seen an aircraft as fast as that UFO craft traveled.  I’m still in shocked.  Today is December 8, 2011, 10:31AM.  I’m trying to recall my story of my first encounter of the flying object.",
      "link": "http://www.nuforc.org/webreports/085/S85763.html",
      "state": "CA",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bca81",
      "summary": "Strange lights/UFO's over Fresno,Ca near the airport.",
      "city": "fresno",
      "shape": "triangle",
      "date": "2011-07-17T00:00:00",
      "story": "Strange lights/UFO's over Fresno,Ca near the airport. On July 5th, 2011, at 12.:38 am my son and I were in our backyard talking. we live about 4 miles from the Fresno airport and were watching airplanes and police helicopters in the shy that night.  People have been lighting off illegal firworks and we were watching the show.   As we were looking up, I saw a large triangle craft moving slowly to the south-west towords the airport.  I was standing facing the same direction, when my son spoted another set of lights that looked like bright orbs.  There was 3 of them and moving south-east of our home.   The large triangeled changed colors form white to red to blue then back to white, then started to fly way faster than anything else that was in the shy that night and was out of sight in about 4 seconds.  The orbs also changed color.  Red,white and then back to red.  We could see other airplanes flying into the Fresno airport and taking off, but nothing could fly without making a sound.   We waited to see if the Air National Guard would send jets to the area of these objects, but nothing. We have seen other unexplained lights over the greater Fresno/Clovis area for the last couple of months, but nothing like this.  The orbs stayed on the same course, but came together as one light and disapeared straight up.   There were at least 3 helicopters and multiple airplanes that night, but nothing moved or looked like those lights we saw that night.",
      "link": "http://www.nuforc.org/webreports/082/S82484.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbf2",
      "summary": "A linear object with 3 bright lights, flew about 10 feet over our truck while traveling N on I 5.",
      "city": "fresno",
      "shape": "formation",
      "date": "2011-07-17T00:00:00",
      "story": "A linear object with 3 bright lights, flew about 10 feet over our truck while traveling N on I 5. While traveling north bound on Interstate 5, approximately 30 miles SE of Fresno, a linear object with three bright lights (Two on the end and one in the middle) approached our truck, containing six passengers.  When we first saw it, the linear object was around 500 yards away.   Five of the passengers, including me, saw the formation of lights continuing to fly towards our truck. During this time, the object rotated similar to a plane that has stalled.  We were confused and somewhat scared as to what this object is.  It headed straight towards our truck where it flew about 10-20 feet above us.  It was close enough to where the driver, and the two front passengers, one of which was me, ducked and screamed.   While continuing to drive, we watched behind us as the three bright lights lifted up and dove into the ground and then back up again.  The bright lights spun and rotated until it finally disappeared.   The object was about 30 feet long.   Keep in mind that it wasnt until afterwards we realized that it made absulutely no sound when it passed over our truck.   And the compass on our truck didnt work after the sighting. ((NUFORC Note:  This report arrived just before our posting of newly received reports, which will occur on the afternoon of Sunday, July 17, 2011.  We spoke via telephone with this witness, and we found him to be exceptionally eloquent and objective, in his description of the event.  We have requested that he have at least one of the other witnesses submit reports, as well.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82535.html",
      "state": "CA",
      "duration": "1-2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc9b",
      "summary": "My boyfriend and I see these same ones a lot.  He came in, telling me to come and look. It was a bright light to the east, a little sou",
      "city": "fresno",
      "shape": "light",
      "date": "2011-07-04T00:00:00",
      "story": "My boyfriend and I see these same ones a lot.  He came in, telling me to come and look.   It was a bright light to the east, a little southeast.   We watch it for longer than they usually stick around.  It moved slightly up and down as it was moving across the sky at the speed slower than an airplane.  Then it dimmed. It was about dusk.  A lot of fireworks going off so I'm hoping someone else may report it, as well.  My first report although I've seen many.  I think we have something that makes us more aware.  Not sure how no one else sees these.   My little boy Has witness them with us as well although I'm not sure he understands why he saw.",
      "link": "http://www.nuforc.org/webreports/082/S82088.html",
      "state": "CA",
      "duration": "3-4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bcf7e",
      "summary": "I don't know what to do,I try to not think about it , but now,I don't know what to think about, US.",
      "city": "fresno",
      "shape": "disk",
      "date": "2012-09-24T00:00:00",
      "story": "I don't know what to do,I try to not think about it, but now,I don't know what to think about, US. It is difficult to explain what I saw. I was driving to work, not thinking about anything.  There were no vehicles around me.  A rain storm had been going through the area. It is five years almost ,after I saw it and I still have trouble talking about it.   Please help me, anything. I did not want to see what I saw. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92129.html",
      "state": "CA",
      "duration": "10 sec. approx"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfa0",
      "summary": "UFOs seen near the intersection of Hwy. 41 and Avenue 12 north of Fresno, CA",
      "city": "fresno",
      "shape": "formation",
      "date": "2012-09-24T00:00:00",
      "story": "UFOs seen near the intersection of Hwy. 41 and Avenue 12 north of Fresno, CA UFOs seen near Hwy 41 and Avenue 12 north of Fresno, CA  One mother and two teenage boys were driving north of Fresno, California on Highway 41 at approximately 10:30 PM on October 5, 2011.  One of the boys sighted a swarm of about ten (10) fuzzy white orbs zig-zagging through and about the clouds in the overcast sky just east of the intersection of Highway 41 and Avenue 12 north of Fresno, CA.  They watched these &quot;fuzzy&quot; white lights for about five-minutes as they turned west onto Avenue 12 toward Madera, CA.  As they drive west, the boys encouraged the mother to turn the car around, which she did, to return to the intersection.  The mother then turned north onto Highway 41 while  they all watch the lights swarm around through the clouds.  Just east of the same intersection is a barn and many ongoing acres of open farmland/ranchland.  According to the boys, some of these fuzzy white lights had a small star-like center to them.  Additionally, on the ground, to the viewing-right (e.g., south) of the reference barn (as see! n from the intersection of Highway 41 and Avenue 12) there was also seen a large triangle-shape (tip of triangle pointing upwards).  This object had blinking white lights at each tip of the large triangle.  The mother turned the vehicle around, from north to south, on Hwy 41 and drove home.  They do not have any explanation as to what they saw in the distance that night.  There is a creek that runs north to south near this area.",
      "link": "http://www.nuforc.org/webreports/092/S92742.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd196",
      "summary": "Formation of four lights traveling at an apparent fast rate of speed silently across the night sky.",
      "city": "fresno",
      "shape": "formation",
      "date": "2012-10-30T00:00:00",
      "story": "Formation of four lights traveling at an apparent fast rate of speed silently across the night sky. From Fresno California, on August 24 th, 2012, I woke up needing some water and I decided to go outside and check the clear star lit sky, I was hoping to see some falling stars but instead I saw a UFO (or four of them)!   It was almost straight up in the early morning sky (2:30 AM) a bit to the South sky, I saw a fast moving line four lights (about equal to the stars that were out) traveling from West to the East, from one side of the sky to the other ending in their disappearing behind the tree line.  They were spaced far apart but clearly together.  The line was side by side not in a follow the leader row, the line was perfectly straight, each light was constant, not blinking and without color of any kind, the speed was difficult to tell now knowing the distance but it was very fast and took about 4 seconds to go all across the sky.  There was sound at all. This is the first time I have seen such an event, I feel lucky to have seen it, but at a loss to identify it as something earthly.  I am 62 years old, and have observed many different type planes, having been raised near Castle Air Force Base and near both commercial and military air bases.  I would love to learn if there has been any similar sightings!  This report is not a hoax.",
      "link": "http://www.nuforc.org/webreports/093/S93150.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be0d3",
      "summary": "Object being chased by 2 fighter jets",
      "city": "fresno",
      "shape": "sphere",
      "date": "2012-07-04T00:00:00",
      "story": "June 26, 2012 – 23:30 pm (approx. time) Weather: Clear sky, no clouds, half moon to east (Not visible to me) Sky view (degrees) est: 120 – north/south, 90 – east/west Fresno, CA (Northeast)   Object being chased by 2 fighter jets  At approximately 11:30 pm on June 28, 2012, I let my dogs out to do their nightly business.  As usual, I went out with them to look at the stars.  I was just getting ready to go back inside when I heard a louder than usual jet engine.  I looked up to see two military fighters flying in a north to south direction at a high rate of speed.  They appeared to be at about 10 to 12 thousand feet (estimated).  I am not sure how fast they were going. Certainly not above mach I, but close, maybe.  They were in a slight climb as they passed almost directly overhead.  All of their navigational lights and strobes were on.  Just in front of the fighters (approximately one quarter of a mile), I saw a single, pale, greenish/white, spherical light that was about the size of a ballpoint pen tip.  It was pulling away, slightly, from the jets.  A few seconds later, the object executed a slight climbing right turn to the southwest, and accelerated, increasing the distance from the fighters as they turned to follow it. At that point, the object disappeared (winked out).  The jets continued to the southwest until I could no longer see them.  The whole sighting lasted no more than twenty seconds from the time I first saw the jets until the object winked out.  It is unusual to see any aircraft flying north to south at the altitude I observed, because of the proximity to Fresno Air Terminal, and the traffic patterns.  Though, at 11:30 pm, there is almost no air traffic at all.  Also, the Air National Guard is based at FAT, and they tend to keep noise levels at a minimum over the city.  I am a retired Information Technology Analyst, and a private pilot, and have lived in Fresno, CA for more than sixty years.",
      "link": "http://www.nuforc.org/webreports/090/S90215.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be0e8",
      "summary": "Fast moving small object. Appeared to change shapes at first.",
      "city": "fresno",
      "shape": "changing",
      "date": "2012-08-19T00:00:00",
      "story": "Fast moving small object. Appeared to change shapes at first. Fresno, Ca 8-13-12  I was standing on my porch when I noticed a white light that seemed to be changing shape in the sky.  I proceeded to take several pictures that turned out very clear.  After about 10 minutes of watching the object just sitting still in the sky, other than the apparent shape changing, I looked away and back, only to have the object gone. The object was almost directly west of my apartment complex. This is the second time there has been a strange light hovering above the same point in the sky in a month. In the enclosed picture, I cut the relevant portions out and set them side by side in time order.  I took the shots roughly 3 seconds apart.  The dark object in the bottom right corner is my neighbors AC unit and my point of reference when referencing where I saw the first light.",
      "link": "http://www.nuforc.org/webreports/091/S91867.html",
      "state": "CA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be6a5",
      "summary": "Two orange lights traveling west to east of Central California",
      "city": "fresno",
      "shape": "light",
      "date": "2012-05-29T00:00:00",
      "story": "Two orange lights traveling west to east of Central California Shortly after 8 p.m. a few of us were sitting in the backyard when I noticed coming from the west were two objects that were bright orange in color.  As we noticed them traveling through the air we noticed they were traveling what seemed to be about the same speed as a jet airliner if not just a little faster.  They appeared to be flying well under what a jet airliner would be cruising at. The second light was trailing the the first one by a little distance, perhaps a mile or two at the most.  As they passed over our area there were no jet sounds.  No propeller sounds.  It was complete silence.  The neighborhood was silent so if there were sounds from a jet we would have heard them. After they passed overhead we then ran to the front yard to continue watching them.  They were still bright orange at this time and still no jet sounds.  We watched them for another 30 seconds before one went to a dimmer orange and then a few seconds later the second one dimmed. At the time of this sitting the sun was well below the horizon, and the sky was just about black.  Stars and a passing by satellite could be seen at this time.",
      "link": "http://www.nuforc.org/webreports/089/S89099.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be833",
      "summary": "I was driving on the 180 going west when I saw a crazy light to the left over downtown.  Almost looked like an airplane but was flying",
      "city": "fresno",
      "shape": "unknown",
      "date": "2012-05-29T00:00:00",
      "story": "I was driving on the 180 going west when I saw a crazy light to the left over downtown.  Almost looked like an airplane but was flying slow and too low.  When I got closer this object started to change colors.  It was pulsating back n forth.  Nothing like I have ever seen before",
      "link": "http://www.nuforc.org/webreports/089/S89167.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bee1d",
      "summary": "The object had colors associated with no other aircraft to my knowledge and was silent; also identified by other witnesses.",
      "city": "fresno",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "The object had colors associated with no other aircraft to my knowledge and was silent; also identified by other witnesses. The ufo was silent and moved in a motion similar to a helicopter.  Nevertheless, this object changed colors which consisted of magenta, teal, and plum.  It descended to a point and disappeared.  When trying to identify the spot of sighting I came across 2 college students that were tracking what they saw as well.  They asked if it was me and I replied it was not me and I was doing the same thing; trying to find the spot where the ufo might have been.",
      "link": "http://www.nuforc.org/webreports/096/S96790.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3beeb3",
      "summary": "I was asleep while my step dad proceeded to go outside to have a cigarette around 11:00 pm. When out of no where he started to wake me",
      "city": "fresno",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "I was asleep while my step dad proceeded to go outside to have a cigarette around 11:00 pm.  When out of no where he started to wake me up saying come see this, come see this!  I hesitated and told him unless it was an emergency not to wake me up, but he proceeded to tell me that I had to come see what was in the Sky.   So I finally got up just to get him to stop bothering me, when I stepped out side i was instantly enamored It was a big blue light that moved effortlessly high in the sky almost like a bird, it flew for a little bit in a direction but would effortlessly turn back around to were it started.  It was beautiful and mysterious.  Too big and too bright to be a toy or something controlled by someone below,  It moved like an aircraft but much more elegantly and effortlessly.  Best way to explain it.  I don't really believe in Aliens but whatever it was, I have never seen anything quite like it.   After awhile it seemed like it was falling downwards like an air! plane out of control and then it dissipated.  Below were it has a choice of picking there were lights on the object, the object was a light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100793.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf038",
      "summary": "Slow moving pillar of orbs floating horizontally and passed by 4 people.",
      "city": "fresno",
      "shape": "sphere",
      "date": "2013-09-30T00:00:00",
      "story": "Slow moving pillar of orbs floating horizontally and passed by 4 people. Saturday night 4 of us were hanging out on our roof in the downtown area.  my friend spotted something in the sky and pointed it out.  It looked like a pillar of luminescent smoke from a distance.  As it got closer and I could see it better it looked almost like a chain of 4-6 plastic bags with a candle inside.  (Our brains were trying to comprehend what we were seeing more than remembering exactly what it looked like.  Unfortunately no one thought to grab a camera until it had gotten too far away)  It moved slowly and horizontally and we could actually see energy lines that it was riding on.  They stayed in line but would bobble back and forth sometimes.  The edges and body of the orb seemed to be made out of plasma or something and I observed a soft yellow glow while others saw more red.  It passed within about 20 feet of us just a dozen feet above the roof.  Since then I've talked to 2 friends who also saw this from the tower district.  My research has led me to believe they were inter-dimensional balls of plasma which had leaked through from another dimension and fully materialized in our own.  Many of us are into meditation and healing, this thing left us with a very wonderful feeling and has changed all of our lives for the better.  Another friend was also below us in her room playing bass, we wonder if that had something to do with it.",
      "link": "http://www.nuforc.org/webreports/102/S102255.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf015",
      "summary": "Fast moving 'star' travelling at fast speed, changed directions. When it disappeared so other stars disappeared in that area.",
      "city": "fresno",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Fast moving 'star' travelling at fast speed, changed directions. When it disappeared so other stars disappeared in that area. I was traveling from LA to Oakland via bus.  Halfway between these two locations the bus stopped at a rest/truck stop.  I found a secluded spot to do my stretching/deep breathing exercises.  To stretch my back I had my hands on my hips and looked up at the starry sky and gave thanks to the Creator.  I saw a fast moving ‘star’ travelling at speed through the sky, initially I thought it was a ‘shooting star’, it turned directions very quickly.  As I bent my neck down  to relieve the neck extension of that position and looked up  it had gone, as well as approx 4 other stars in the same vicinity.  It was a wonderful, clear and beautiful night, no clouds and no aircraft in the sky.",
      "link": "http://www.nuforc.org/webreports/099/S99552.html",
      "state": "CA",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf10e",
      "summary": "6 glowing white orbs and two military jets sighted, two orbs nearly collided",
      "city": "fresno",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "6 glowing white orbs and two military jets sighted, two orbs nearly collided saw 6 ufos they were glowing white orbs two flew straight at each other nearly colliding 2 military jets also flew into few at an unknown elevation the larger of the white orbs continued on in a north west direction while the smaller one went out of view going south west the larger one was then intersected by 4 different glowing white orbs while trans versing the sky they seemed very high up and made no noise   the military jets didn't seem to be chasing them but it was very interesting timing that they would show up to see the near collision",
      "link": "http://www.nuforc.org/webreports/098/S98429.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6a8",
      "summary": "Red triangle with four green circles seen by one person above Fresno, California.",
      "city": "fresno",
      "shape": "triangle",
      "date": "2013-06-02T00:00:00",
      "story": "Red triangle with four green circles seen by one person above Fresno, California. I was standing in my neighbor’s driveway talking to him and his neighbor from across the street. It was about 21:00 on April 30, 2012.  I was looking north when I saw a red triangle with four green circles (one in each corner, and one larger one in the center of the triangle) moving in an arc from my right to the left.  This object was a perfect geometric shape and was semi-transparent.   Before I could alert the other two people in our group, the object quickly and completely faded.  Also, the points of the triangle were beveled.  I have not seen this object again.",
      "link": "http://www.nuforc.org/webreports/098/S98051.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8ad",
      "summary": "MUCH TOO WINDY FOR PARACHUTE OR WEATHER BALLOON TO REMAIN STATIONARY.",
      "city": "fresno",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "MUCH TOO WINDY FOR PARACHUTE OR WEATHER BALLOON TO REMAIN STATIONARY. MAY 15TH, 2013 FRESNO CA  MOSTLY CIRCULAR, BRIGHT, SHINY OBJECT APPEARING ALMOST DIRECTLY OVERHEAD IN SKY….APPEARED TO BE MOTIONLESS, DESPITE VERY STRONG WINDS FROM SURFACE LEVEL TO 30,000 FEET.  OBJECT APPEARED AS A VERY SMALL, SHINY (WHITE LIGHT) TO NAKED EYE.   800 ZOOM CAMERA PHOTOS REVEAL OBJECT AS ALMOST A PERFECTLY ROUND BALL (SLIGHT DEFORMITY IN LOWER LEFT QUADRANT & DARK SHODOWY SPOT IN LOWER RIGHT)  LOCAL MEDIA REPORTED RECEIVING MANY CALLS ABOUT UFO…FAA, FRESNO AIR TERMINAL, AND LOCAL AIR NATIONAL GURAD FIGHTER WIND UNABLE TO IDENTIFY IT. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97914.html",
      "state": "CA",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc0f",
      "summary": "Two lights of differnt size and brightness traveled in differnt directions and faded out.",
      "city": "fresno",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Two lights of differnt size and brightness traveled in differnt directions and faded out. Low in the eastern sky I observed a bright light as bright as Jupiter would be.   Suddenly out of this light came a very small light traveling at a high rate of speed toward the north.   As the small light went away it slowly dimmed out.   At that time I noticed something strange about the big bright light.  It looked like it was falling straight down, then suddenly it began to dim and after about 10 seconds it was gone.",
      "link": "http://www.nuforc.org/webreports/101/S101510.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd01",
      "summary": "From the western horizon moving southeast what appeared to be traveling at a very high rate of speed.",
      "city": "fresno",
      "shape": "oval",
      "date": "2013-09-09T00:00:00",
      "story": "From the western horizon moving southeast what appeared to be traveling at a very high rate of speed.",
      "link": "http://www.nuforc.org/webreports/101/S101920.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c02fe",
      "summary": "Formation of 6 orange orbs flying over fresno ca may 31st 2013",
      "city": "fresno",
      "shape": "light",
      "date": "2013-06-02T00:00:00",
      "story": "formation of 6 orange orbs flying over fresno ca may 31st 2013 at 8 30 my son and i observed 2 brightly glowing orange orbs traveling from the northwest to the southeast over the fresno metropolitan area, they did not blink or have any anti collision or landing lights and made no discernible sound, about half way across the horizon nearly over head they faded and blinked out  then a few minutes later two more came in the same direction and blinked out nearly exactly where the first two disappeared  this was followed by a 5th object by itself and did the exact same thing by this time my son and i had got to a place where there wasn't as much light pollution just in time to see a sixth object, when this one blinked out it was nearly directly overhead and there was enough daylight left to observe a structured craft of some sort that was round on the bottom  these were not satellites since they don't travel in packs they were not conventional aircraft, since they made no sound or had any anti collision lights, i am wondering if maybe they were drones? i am not sure but this is the second time i have observed this same phenomenon, my son and i observed three traveling in the same direction about 6 months ago",
      "link": "http://www.nuforc.org/webreports/098/S98299.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04ed",
      "summary": "Blue orange red dots very bright.",
      "city": "fresno",
      "shape": "light",
      "date": "2013-04-12T00:00:00",
      "story": "Blue orange red dots very bright My friend and I were driving down a street towards a street light when we seen a colorful object changing color in the sky it seemed close yet far, it moved very odd back and forth.   When it seemed to get close it just moved to the side of the sky and disappeared very quickly or left very quickly.   When it left my friend and I looked at each other and said, \"Did you just see that?\"  We said, \"Yes\" at the same time and our eyes watered because the lights of the object were very bright!  We were in shock we seen this bright colorful object, we knew it was not an air plane or anything close to normal.  We knew it was something that was not from earth.   I'm still in shock I will never forget what I've seen.  I wish I could have took a picture but it happened so fast and we were in shock that we didn't have time to even turn to look at each other until the object disappeared.  It was very bright and had like 3 different colors.  Orange, red, blue and yellow colors.",
      "link": "http://www.nuforc.org/webreports/096/S96943.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0879",
      "summary": "Rectangle over Fresno, California.",
      "city": "fresno",
      "shape": "rectangle",
      "date": "2013-11-11T00:00:00",
      "story": "a rectangle over fresno california. i was walking back from my gym and a shooting star sparked my eye.  then when the star faded i noticed something blocking out the stars.  i was able to see a REALLY dim orange red light at each four corners and a much bigger one in the middle with the same color but it faded on and of.  i seen it was a rectangle and it was very very huge.  because i was crossing the street at the time a woman in a car was waiting for me to fully walk across.  when i seen her i pointed inda sky and when she seen the object she asked me what i was, and i replied i don't know, a UFO.  then she got on her phone and took off.  when the UFO flew overhead i heard what sounded like vibration.  it was moving slow and you wouldn't see it unless you actually are lookin for sumthin in th sky.",
      "link": "http://www.nuforc.org/webreports/104/S104322.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b8f",
      "summary": "Husband and I saw up to 8 spherical orange-ish high floating/flying objects go over our house at 6:30 PM (darkened sky).",
      "city": "fresno",
      "shape": "sphere",
      "date": "2014-02-27T00:00:00",
      "story": "Husband and I saw up to 8 spherical orange-ish high floating/flying objects go over our house at 6:30 PM (darkened sky). My husband had just gotten home from work and came into the house to call me outside.  He wanted me to see something in the sky that he'd noticed as he pulled into our driveway.  He said he'd seen multiple objects moving across the night sky; they appeared to be coming from the northwest.   By the time I got outside, I saw just three or four passing overhead.  They gave off a dim orange glow, and looked like they might be hot air balloons.  They appeared to float, but moved fairly quickly, eventually disappearing as if extinguished.   They definitely did not look or move like airplanes or other identifiable types of aircraft.   We both felt we had seen something strange and inexplicable.",
      "link": "http://www.nuforc.org/webreports/107/S107331.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c80",
      "summary": "UFO observed had no sound or detail to it, and floated across the sky.",
      "city": "fresno",
      "shape": "unknown",
      "date": "2014-02-27T00:00:00",
      "story": "UFO observed had no sound or detail to it, and floated across the sky. Object appeared to glide straight across the sky without sound.  It looked like a round cloudy ball.   But then i seen it was long, without any sharp detail to it.  It also had yellow-green dim light coming from it.   The object was brownish grey.",
      "link": "http://www.nuforc.org/webreports/107/S107398.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d7e",
      "summary": "Blackish odd shape over north Fresno, CA.",
      "city": "fresno",
      "shape": "other",
      "date": "2014-02-14T00:00:00",
      "story": "Blackish odd shape over north Fresno, CA. On Saturday February 1, 2014, at 3:43 pm north Fresno, CA, I saw what at first I thought was a large black bird coming from the west toward me and my wife, but as I looked it did not have flapping wings.  It did change shape somewhat, not much.   I went into my garage and retrieved my 50X binoculars to get a better look.  What I saw was a black object that seemed to be a jumble of mix of cubes and other shapes mostly black but not completely.  It looked as if it was mottled with black and no color.  The object was tumbling with the sun reflecting and this was why it appeared to be changing shape.  I came to the conclusion that it must be a bunch of balloons as the tumbling seemed to be effortless.   As I was breathing heavy from yard work it was hard to get a very stable look with the binocular.  I looked around to find something stable my shaking.  Not finding anything I looked up without the binoculars and could not find it.  I asked my wife where it was as she was watching it only with her eyes.  She said it just disappeared, was there and then gone.   The object was traveling west to east at about 25 mph and was about 500 feet above us.  The weather was clear and no wind at all.  The object appeared to have a flat path not going up or down.  It’s hard to say what size it was but I would guess it was 20 feet across.  It was not a uniform shape.  Also no sound.",
      "link": "http://www.nuforc.org/webreports/106/S106982.html",
      "state": "CA",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0da1",
      "summary": "Orange fireball moved across sky, hovered over my house, went high into the sky, then light disappeared as it went to a larger craft.",
      "city": "fresno",
      "shape": "fireball",
      "date": "2014-03-21T00:00:00",
      "story": "Orange fireball moved across sky, hovered over my house, went high into the sky, then light disappeared as it went to a larger craft I was outside and looked up and a burning light that looked like a large orange fireball was glowing (not blinking, and it appeared to be only one light).   At first, I thought maybe it was a plane but as it moved closer, I thought it might be some sort of meteor.  As it came closer I realized it wasn't anything that I've ever seen before.  It moved laterally through the sky at a fast pace at about a helicopter's height in the sky and then it hovered over my house, stopped, went back a bit, went forward a bit, then went up higher and higher and got darker and darker.  Then the light went out but I could still see something there, way up in the sky.   The larger darker object stayed stagnant for about 20 seconds, moved forward slowly at first and then it went toward the northwest at a much faster pace than before and traveled across the sky till I couldn't see it anymore because of the distance.   This thing was pretty huge for me to see it clearly fly across the sky with no illumination.  To me it looked black and long, maybe cylinder or rectangle-shaped but hard to tell since it was so dark in the sky.   My stupid phone is so cheap I couldn't get any good shots of it.  I have two pictures but they are very small and I need a usb cord to retrieve them.   I realized later that the fireball was flying in virtually the same path the military jets take when they fly over our house.  I'm in NW Fresno, CA, and they usually come from the east and fly northwest.   The sky was nice and bright and clear with an almost full moon.  It was really big, whatever it was.  It had no trail, it was silent, and appeared to be lower than an airplane until it stopped and went higher.  It definitely wasn't any kind of weather balloon or anything I've ever seen before.   The sky was clear with an almost full moon.  There appeared to be no other air traffic until a few minutes after it went away.   The entire sighting lasted about 4 minutes or less.",
      "link": "http://www.nuforc.org/webreports/107/S107996.html",
      "state": "CA",
      "duration": "<4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0eaf",
      "summary": "Close to an airport but so loud it sounded like right over the neighborhood .",
      "city": "fresno",
      "shape": "unknown",
      "date": "2014-02-21T00:00:00",
      "story": "Close to an airport but so loud it sounded like right over the neighborhood. Heard what sounded like a jet but was very close and lasted awhile.  Easily this was heard by hundreds of people.  A friend and I ran outside but could not see the object making the noise.",
      "link": "http://www.nuforc.org/webreports/107/S107230.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f28",
      "summary": "Large flying object in the dark sky appeared to be dark and had 4 or 5 red flashing lights.",
      "city": "fresno",
      "shape": "unknown",
      "date": "2014-02-27T00:00:00",
      "story": "Large flying object in the dark sky appeared to be dark and had 4 or 5 red flashing lights. Very big dark object over the Sky'w to the west of the city.  Was large low and big only saw about 4 or 5 red lights on it that blinked no other colors.  Moving fast and was quiet.",
      "link": "http://www.nuforc.org/webreports/107/S107454.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a13",
      "summary": "A blue-violet light falling and rising to the southeast skies of Fresno.",
      "city": "fresno",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "A blue-violet light falling and rising to the southeast skies of Fresno. I was taking a nap in my room.  When I woke it was dark out already and I decided to go outside to get some fresh air.  It was around 21:35 when I woke and saw my alarm clock before walking out.  As I was headed outside I heard our neighbor call out to my mom in spanish, \"hey, do you see that over there in the sky? what is that?\"  As I heard this I paced to get to my mother in our front lawn who was looking to the distance in the southeast direction from our home.  And I saw it. It was a bright blue-violet light, flamelike- like a flare. I watched carefully to try to figure out if it were a place or manmade craft by its signal lights but there were none.  It was just one big blue-violet light. It would slowly change color from blue to violet and back.  And it was falling towards the horizon and slowly out of sight before the houses in the distance.  But as it fell it would suddenly stop and start climbing again, and fall again, with each attept it would rise less until it fell out of sight. All of us were stunned, I knew it wasnt a plane.  What got to me was how it felt, from my perspective like an organic life form stuggling to stay afloat.  Like as if it were slowly passing out or giving up.  For when it rose it did so with almost a pull of spirit until it gave up again.  I have been searching online to see if anyone else could have seen it but I guess it was only us.",
      "link": "http://www.nuforc.org/webreports/109/S109648.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f0a",
      "summary": "When reported the tower control men said he saw it.",
      "city": "fresno",
      "shape": "disk",
      "date": "2014-06-04T00:00:00",
      "story": "When reported the tower control men said he saw it. On May 30, 2014, I happened to look out my window and saw a low flying object over my nneighborhood, at first I thought it was a plane but I said it's to low so I grabbed my binoculars a went outside and what I saw was no plane it was a flat round object that had multi colored lights all around it.  The object traveled N then turned E went up high then SE when it traveled SE another object followed it as to give chase  then stopped.  The main object still traveling finally stopped in the SE sky.   After about 30 minutes the main object started to travel back to my area traveling now NW coming low once again I then saw a small plane traveling N, it seem when the object came close to the plane it retracted back to the SE sky.  I then tried to call my local airport but no answer, I then called a local news room while I was speaking to the woman I saw other objects flying high in the eastern sky giving off bursts of light or flashes the woman thought I was nuts and hung up.   I then called Lemoore air base they told me to call my local 911 so I did so they in turn connected me to the fresno airport tower and after telling them what I was viewing and the location of the object in the SE sky changing color he then said hold on as he looked for it he told his co-workers what the report was and he said to them \"I'm dead serious\"  He the picked up the phone and said that he could see it as well he then told me to call 877 787 7444 Bigelow arrow space  ((sic.  Aerospace)) I said okay and hung up I then called the number but it was a bunk line.   There is something going on in the eastern sky of fresno and it must be looked into ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109848.html",
      "state": "CA",
      "duration": "All night"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ec7",
      "summary": "Blue orb.",
      "city": "fresno",
      "shape": "light",
      "date": "2014-05-02T00:00:00",
      "story": "1 blue orb silently moves across the nights sky over my house and then vanishes.  I managed to recored it on my Canon camera.",
      "link": "http://www.nuforc.org/webreports/108/S108990.html",
      "state": "CA",
      "duration": "72 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2282",
      "summary": "9-14 Scattered Orange Glowing Lights Hovering Across Fresno.",
      "city": "fresno",
      "shape": "fireball",
      "date": "2014-04-11T00:00:00",
      "story": "9-14 Scattered Orange Glowing Lights Hovering Across Fresno. I observed 9-14 orange-ish glowing objects hovering slowly in the sky around 9:40pm.  They appeared to be heading from West to North towards my direction at first, but then the objects started moving southward.   The glowing objects were scattered from each other, but they were all moving in the same direction in a synchronized motion.  I would guess the approximate altitude of the objects ranged from 3000 to 5000 feet in elevation.   The glowing objects started to disappear from the sky one after another even though they were at a distance that should’ve been observable if it were a plane.   I got out of my vehicle to try and record them, but my phone camera couldn’t really capture the glowing objects due to the poor lighting conditions outside.   There were no blinking signals (such as those seen on aircrafts), and I didn’t hear any type of aircraft sound.  The objects were dead silent, and hovering and a constant speed which seemed to be moving much slower than typical airplanes.  I pulled up to some police officers at a stop-light 10-15 minutes after the event, asked them if anyone had called in about “weird lights in the sky” and they said no.   Approximate duration of sighting was 4-5 minutes.   This is the first time I have ever witnessed anything like this.   A little background about me:  I’m a U.S. Navy veteran who has seen almost every type of aircraft there is to see during my time out at sea.  I’m 29 y/o male, and I’m a Healthcare Administration major at California State University, Fresno.   Just letting everyone know that I’m not a whacko.",
      "link": "http://www.nuforc.org/webreports/108/S108363.html",
      "state": "CA",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2354",
      "summary": "Bright orange oval over Fresno, CA",
      "city": "fresno",
      "shape": "oval",
      "date": "2014-04-04T00:00:00",
      "story": "Bright orange oval over Fresno, CA My fiance and I just got back from the store, and as we were walking up to our apartment, I noticed I very bright orange light in the sky.  I was watching it for a few minutes as it was slowly moving southwest.  We decided to head to our back patio to continue watching this bizarre, oval light. About 2 minutes after we first noticed it, it suddenly discharged a smaller orange light which quickly faded off into the distance. At this point, the large bright light was just hovering, not moving anywhere!   Another 2 minutes passed of this bright orange light hovering, somewhat fading, when it suddenly got brighter again and shot off yet another smaller orange light off into the distance!   Immediately after the second small orange light was discharged, the large orange light started to fade until it disappeared.  It was fading up into space.",
      "link": "http://www.nuforc.org/webreports/108/S108170.html",
      "state": "CA",
      "duration": "~15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c23c1",
      "summary": "Rectangle lights over N/E Fesno.",
      "city": "fresno",
      "shape": "light",
      "date": "2014-03-27T00:00:00",
      "story": "Rectange lights over N/E Fesno I heard a loud steady noise coming from outside.  The noise was a loud hum; like if you were close to some kind of giant electrical machine or generator of some sort. When I got outside the humming was all around.  I couldn’t tell which direction it was coming from.  I walked to the front of my house but didn’t see anything.  So I walked to the side of the house and from the corner of my eye I started seeing something what appeared to come out of nowhere. I believe I was looking in the direction of what would be the side of it.  At first it looked like a radio tower up in the air and horizontal.  I could not see the object until it was just going past me which revealed the rear of it.  As the object was passing by the “rear” was coming into view and what looked like little red lights at first turned out to be large rectangular red lights. My best guess with the dimensions is it was 200-300 feet wide x 20-30 feet tall but could not tell how deep it was.  It wasn’t until it stated passing me when I could really see it. There were 4 rectangular lights a least 20 feet high by 50 feet wide. It looked like there may have been other lights that were not on or were dimmed but the 4 bright red lights were in the middle.  The red did not look like fire or rocket blast but like GIANT screens showing just red in perfect rectangles.  Not fire engine red but I guess fire red without the fire. The whole experience lasted about 5 minutes.  No mention of it on the news and I cannot find similar events online.",
      "link": "http://www.nuforc.org/webreports/108/S108084.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24a7",
      "summary": "I was driving on the Highway 99 and it fell from the sky like a teardrop orangestraight line and attached a long fatter line of red col",
      "city": "fresno",
      "shape": "teardrop",
      "date": "2014-11-06T00:00:00",
      "story": "I was driving on the highway 99 and it fell from the sky like a teardrop orange straight line and attached a long fatter line of red col",
      "link": "http://www.nuforc.org/webreports/114/S114427.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c259e",
      "summary": "Stealthy object in night storm  clouds.",
      "city": "fresno",
      "shape": "oval",
      "date": "2014-11-06T00:00:00",
      "story": "Stealthy object in night storm  clouds The evening of 20 Oct. at approximately  20:10 (0010Z) there were possible storms moving into my area. Lightening was reported to the West North West over Delaware, Ohio.  I observed  cloud reflected lightening in that direction, as well as to the South.  Cloud deck was reported as 3,000 to 6,000 feet at 97%.   While feeding horses and looking to the West, I observed at about 280 degrees azimuth and 25 degrees altitude,  a small dull red spot,  which appeared unmoving.  It grew somewhat brighter for about 3 seconds, but still remained dull red, the color that  heated steel  just becoming red might appear. At this time, it began moving  very rapidly across the shy towards the East South East,  heading approximately 100 degrees. It disappeared  at approximately 170 degrees azimuth and 85 degrees altitude, the whole episode lasting about 7 seconds from first seeing it until loosing sight of it. There was no sound associated with it’s passing. When this object (yes, I am going to call it an object) was almost overhead,  I had the impression  it had a rounded  shape, possibly  oval or u- shaped, and that the dull red portion was the leading part of some airframe, glowing from air resistance heating. It’s body was totally black with no lights, appearing against the clouds as an empty spot with a dull red part. My  analysis of this event is that when I first observed it, the unchanging bearing means it was coming essentially directly at me. As it got to a lower altitude, it’s linear motion became apparent, and the fact that it traversed  70 degrees of sky in 4 seconds means to me that it was  below 5,000 feet altitude and hence subsonic, disappearing into a cloud bank.. That fits with the cloud deck height. No sound means it was gliding or silently propelled. The whole thing had the feeling of a re-entry event. Re-entry into a thunder storm seems a good way to cover the sonic booms, and thick clouds providing visual cover. So, either  someone has a really advanced  stealth aircraft, or we are not alone.",
      "link": "http://www.nuforc.org/webreports/114/S114933.html",
      "state": "OH",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2647",
      "summary": "Silent craft hovered 2 story's above me.",
      "city": "fresno",
      "shape": "unknown",
      "date": "2014-12-05T00:00:00",
      "story": "Silent craft hovered 2 story's above me. Approximately around December 13-18, 2012.  Trying to remember because it was a couple years ago Christmas time. early in the morning between 2-3 am. While I was working graveyard as security for a retirement place in Fresno, CA. I was sitting in my vehicle with the window open and stopped under a freeway lamp to do my report and I looked up on a clear night to see this HUGE silent black craft right above me.  I am not sure of the shape it started forming a misty cloud around it possibly vapors or condensation cloud which started to block it from my vision. I remember it had HUGE LED type of lights, more than one they were so bright they kinda had a blue color to them.  The craft was motionless and silent. I remember it being the same night as a very similar craft was seen in Colorado.  This, however, was located directly above the freeway at Temperence Ave exit and the 180 freeway, going towards the airport where NORAD is located in Fresno, CA. Within a couple of minutes after it slowly moved towards the airport, a helicopter flew over where I had seen it. I do know that the freeways here are blocked by local law enforcement whenever they have secretive flights from an unknown agency. My guess is NORAD.  It had to be governmental not alien operated. We are so advanced in technology. Me...I'm retired Law Enforcement. What a sight!  And, I wouldn't have known it was there if I hadn't just looked up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Source indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115753.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c266f",
      "summary": "Formation of colored lights hovering for 2 hours with swirling greenish orb lights/ FRESNO, CALIFORNIA",
      "city": "fresno",
      "shape": "formation",
      "date": "2014-11-06T00:00:00",
      "story": "Formation of colored lights hovering for 2 hours with swirling greenish orb lights/ FRESNO, CALIFORNIA On 10/25/14 around 11:00 p.m. my daughter, husband and I saw pale green lights swirling in a circular fashion around in an elliptical circle.  No lights were emanating from the bottom as a spotlight would have.  We watched them and then went inside to get a jacket. When we came back out they were still then but stopped.  We then saw above us a \"Y\" shaped grouping of colored lights (red,greeen,pink,white fading in and out).It was very cloudy; we would see this grouping of lights come in and out of the clouds as they moved; motionless, hovering; the lights stayed in formation.  We then saw at different times two triangular shaped formations with 3 lights. In the distance at one time we saw 3 lights in a straight line, which later disappeared.  As the clouds moved, we would see the Y shaped lights again and again.  They were hardly moving. Later in the distance the green swirling lights occurred again, first only one, then it seemed light 2 to 3 and they w! ere \"dancing\" in swirling formations.  There was a triangle of lights to the right of it.  As this triangle faded, so did the green swirling orb like lights disappear.  We watched this for 2 hours. We were in West Fresno; the lights were to the Eastern portion of the sky.",
      "link": "http://www.nuforc.org/webreports/114/S114769.html",
      "state": "CA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c273b",
      "summary": "Blue ball falling from high alt.  At 30 ft off the ground, it turned to a red ball and flew off to the E.  Definitely not a plane.",
      "city": "fresno",
      "shape": "circle",
      "date": "2014-11-14T00:00:00",
      "story": "Blue ball falling from high altitude at 30 feet off the ground it turned to a red ball and flew off to the east. definitely not a plane. While driving a tractor trailer north on I-5.  Between the Bakersfield turn off and the Fresno turnoff.  I don't know the county or the city area.  I saw a blue light and high altitude.  The blue light appeared to be falling like a rock.  I watched it falling for about 5 minutes.   As I came up on a closed warehouse next to the freeway.  It looked as if this blue ball was going to fall on the warehouse, but when it got about 30 feet off the ground, the blue ball turned red. and it started flying off at an angle away from the warehouse and away from the freeway.   I was approximately 200 feet away from the blue ball at that time.  The blue ball turned instantly red.  It flew off at an angle towards the east.  I was 200 feet away I know it wasn't a helicopter I know it wasn't an airplane it appeared to be about the size of a basketball.  Intense blue that change too intense red I'd like for someone to tell me what the heck that was.  Does that sound like something the military has?   I would estimated I first saw it falling at probably 20,000 feet.  It looked to be approximately the same height as a jetliner that was flying at about the same altitude but many miles away from the blue ball.  I'm sure the blue ball had nothing to do with the airplane.   There was only one other truck on the road going the opposite direction.  I don't think anyone else saw it I slowed my truck down to a crawl, but the other truck Kip gone.   Many of the words may be misspelled I'm using speech to text from my phone to send you this message.  Feel free to contact me. ((NUFORC Note:  We spoke via telephone with the witness, and he reports that the sighting occurred on a Sunday morning at about 02:30 hrs..  We have amended the date above, and assigned a time to the sighting.  PD",
      "link": "http://www.nuforc.org/webreports/115/S115226.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2872",
      "summary": "bright red and blue oval shape.",
      "city": "fresno",
      "shape": "oval",
      "date": "2014-10-10T00:00:00",
      "story": "bright red and blue oval shape Bright red and blue lights.  Start at moon , and shot a cross the sky  so fast  that it couldn't have been a plane awsome above fresno yosmite airport.",
      "link": "http://www.nuforc.org/webreports/114/S114234.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f05",
      "summary": "Me and cousin saw triangle shaped objects with three lights at each tip gliding through the sky at a quick speed, the craft was silent",
      "city": "fresno",
      "shape": "triangle",
      "date": "2014-08-15T00:00:00",
      "story": "Me and cousin saw triangle shaped objects with three lights at each tip gliding through the sky at a quick speed, the craft was silent Me and my cousin were going to pick up my brother from work when we seen a triangle shaped object with three lights at the tips gliding through the sky right above us in a diagonal direction. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112322.html",
      "state": "CA",
      "duration": "2:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c34ab",
      "summary": "I saw three orange redish glowing globes in the sky!",
      "city": "fresno",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "I saw three orange redish glowing globes in the sky! Yes I'm 46 yrs. old, my brother is 52, and my mother is 71.  We live in the same house.  This past Monday night.  I stepped out of the house to smoke a cigarette.  I noticed some plane or something with a bright orange light slowly coming towards us and steady climbing.  Then I realized that this didn't look or act like a plane.  In awe of this glowing orange globe it seemed to start climbing a little more rapidly.  Then I saw a second, then third one all following the first one it seemed  and at a substantial equal distances and in a perfect straight line.  I ran to get my brother and told him to hurry and come look at this and with the tone of my voice he turned and ran for the door to follow me.  I ran to the backyard which is the south side of the house and they were still in sight approximately 4-5 miles to the south.  All of a sudden the lead one who was climbing in altitude almost strait up but at a slight angle seemed to level out turning in a southerly directi! on then just vanished.  The second two were on the same path behind the lead one and 20-30 seconds later they also disappeared.  My mom ran and looked through the back window when she heard the commotion.  They made me not be a skeptic anymore.  You know I've always wished that I could see a UFO just once.  And now that I've seen one, I'm not so sure now.  It's kinda cool but also really scary!!!",
      "link": "http://www.nuforc.org/webreports/116/S116334.html",
      "state": "CA",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3594",
      "summary": "Numerous unknown objects flying in a cluster high over California.",
      "city": "fresno",
      "shape": "light",
      "date": "2015-02-06T00:00:00",
      "story": "Numerous unknown objects flying in a cluster high over California. It had just rained in the morning and now in the afternoon the sky was clear and without haze.  The time was between 1600 and 1630 about an hour before the sun sets.   I was in my backyard working in the garden when I happened to look up and see some seagulls circling above.  Then further up in the sky a bright spot caught my eye.  Then another one and another until there was a bunch of them.  They were traveling northwest to southwest from my location.   At first I thought they might have been airplanes but I could not make out any wings.  They were very high in the sky so I thought maybe that might be why I could not see any.  The light I saw from them appeared to be reflection of the sun from something metallic. Most were not blinking but rather shown steady as a reflection.  However, there were a few in the center of the cluster that had a red glow that increased and decreased in intensity.   They were not in any formation.  They were scattered in an elongated bunch, some apart, some were close together.   After a minute or so I decided to try and count them. I got to ten but started to lose the front ones flying into the southwest.  I estimate that there were maybe 18 to 25.   They looked like stars.  Some brighter than others, but flying as a group.",
      "link": "http://www.nuforc.org/webreports/117/S117094.html",
      "state": "CA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36f1",
      "summary": "Three bright lights forming a triangle staying stationary in sky then quickly flying off and disappearing.",
      "city": "fresno",
      "shape": "triangle",
      "date": "2015-02-12T00:00:00",
      "story": "Three bright lights forming a triangle staying stationary in sky then quickly flying off and disappearing. At about 10pm, my friend and I were on the way to my house and I noticed three bright lights in the sky making the shape of a triangle.  At first I thought it was lights for a tower like the ones you would see at a airport, but since I drive down that particular road at least 10-20 times a week it was not usually there and it was too far away from the town airport to be a tower for it.  As we drove south more, I noticed that it seemed we were getting closer to it so it was staying still and I also noticed that I couldn't see any metal connecting below it so it had to be floating/flying in the sky.  It was kind of low like when a airplane is going to land, but it stood still in the same spot not moving side to side or up and down.   After looking at it for a couple minutes my friend driving finally saw it and asked what it was, he was intrigued and pulled over so we could get a better look, by the time he pulled over and turned to look it was quickly fading away and! then was gone.   It took off very quick.",
      "link": "http://www.nuforc.org/webreports/117/S117247.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c436a",
      "summary": "1st it was coming from the south heading NW, there was 1 white light and 1 yellow light. ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "fresno",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "1st it was coming from the south heading northwest, there was 1 white light and 1 yellow light.  Suddenly the object looked like it stalled, a very bright light came on and the object headed due west with a very bright light on.  The light looked like it was about 90 degrees and appeared from the ground to be 100' in length and 50' in width at the widest point.  No sound from phenomenon heard.  No clouds in sky, no wind.  Craft was emitting a fog which turned bluish, green as it dissipated.  We sat in awe.  We looked at the bluish green cloud left behind which appeared above our barn roof.  I took a picture of that.  Then we got up and looked west and still could see a cone shaped light in the distance which eventually disappeared.  We smelled something strange.  This ages of the persons who witnessed this are varied.  6, 58, 64 and 83.  We all were setting out side enjoying a fire.  The smell mentioned above is doubtful that it came from the fire.  All that! was burning in fire was wood, ((NUFORC Note:  US Navy missile launch.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123638.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c440a",
      "summary": "object spraying a substance and had blue light.   ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "fresno",
      "shape": "disk",
      "date": "2015-11-19T00:00:00",
      "story": "object spraying a substance and had blue light Saw an object 50 degree's  south heading west.  The main object had 3 bright white lights  and it omitted a spray like white substance. It also had a very bright blue light beaming right in the middle of the spray. The spray vanished quickly but the blue stayed for a good two minutes.. ((NUFORC Note:  Probably a sighting of the missile launch from the USS Kentucky submarine, located west of California.  Launch occurred at approximately 17:55 hrs. (PST) on Saturday, November 11, 2015.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123799.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c46c9",
      "summary": "Square white lights stopped..went up..then down over the horizon.",
      "city": "fresno",
      "shape": "other",
      "date": "2015-11-26T00:00:00",
      "story": "Square white lights stopped..went up..then down over the horizon. Bright square lights in the western sky.  Went straight up then set down over the horizon.  I saw it and so did everybody on the jet airplane taking off from Fresno.  I suspect this will be on the nightly news as there was no way that I was the only one who saw this.",
      "link": "http://www.nuforc.org/webreports/124/S124322.html",
      "state": "CA",
      "duration": "2:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4af0",
      "summary": "20 to 30 black objects hovering in sky.",
      "city": "fresno",
      "shape": "teardrop",
      "date": "2015-10-09T00:00:00",
      "story": "20 to 30 black objects hoering in sky October 8, 2015, At approximately 10:05 AM my husband and myself were driving west on Hwy 180 and between Fowler Ave and Clovis Ave I noticed, I thought a flock of birds in the right hand sky above the tree line.  I said \"look at that flock of birds or maybe it's ducks.\"   My husband responded \"that can't be birds, they're too big for birds.\"  The formation was kind of round to the left and gradually & sparsely dwindling to the right, kind of like the tail.  The formation was made up of black shapes, some large, some larger and some smaller.  Their shapes were bigger on one rounded end than the other rounded end and the sides were straight lines.  Some of these shapes were moving and the smaller ones in the tail section were fading. So, right before Clovis Ave, the winery storage tanks cut off their view until you're almost under the overpass.  At that point the sky opened up again and the shapes converged into a larger mass (left) that still had the shapes, but they now were much darker and they were NOT moving, but kind of hovering in the air (the tail, for lack of a better word, had disappeared).  It is hard to describe in words, but easier to describe verbally.  I think it was kind of hard to look at, meaning hard to describe something that made \"no sense!\"   They disappeared again because of the freeway embankment, but my husband said we'll catch them at Hwy 41 where the road climbs and the embankment disappears.  Well, needless to say, the mysterious \"thing\" in the sky had disappeared!",
      "link": "http://www.nuforc.org/webreports/122/S122650.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4aef",
      "summary": "Mass sighting of 30-40 black objects over Fresno, CA.",
      "city": "fresno",
      "shape": "teardrop",
      "date": "2015-10-09T00:00:00",
      "story": "Mass sighting of 30 to 40 black objects over Fresno, CA. Thursday October 8, 2015.  At 10:05 am, my wife and I were traveling on Freeway 180, between Fowler and Clovis Avenues, about a mile south of Fresno-Yosemite airport in rural Fresno, CA.   In the clear sky about what we thought to be  a mile or two west of the airport, out of our front window we saw about thirty to forty black objects maybe more stretching across the sky. We viewed them for about ten seconds until our line of sight was blocked by huge winery tanks off the freeway.  As an estimate this fragmented formation could have been up to a mile in length moving across the sky in a slow hovering motion.  The largest body of the grouping was closest to us and narrowing down in size as it distanced away.   My first impression was a mass parachute dropping near the airport?  A few seconds later driving past the tanks the sky opened,  and again we saw them but now they were clumped together in a tighter formation.   After again losing sight as the freeway dropped behind the trees I rushed ahead for about a minute, to where the freeway was above the trees giving us a full view of the north west  sky.  To our amazement there was nothing, only helicopter circling above and a black SUV off the freeway with the two occupants looking up with one pointing to the western sky.  I assure you these were no parachutes or birds, but something I have never witnessed before.   If my judgment of distance was correct they had to be at least the size of a small airplane.  If they were actually farther away they were then much larger.  This formation was not like one you would normally see displayed by an air force flight but that of a semi-scattered group in closer proximity to each other but yet looking fragmented and not necessarily pointed in exactly the same direction.   Trying to determine their shape and size was a bit confusing as they first appeared to be more square on the left end and sloping down on the right.  Like a fat eyebrow to even perhaps a delta look, but their shapes, though seeming somewhat uniform, were not.  Trying to get my mind to focus on them was strange to say the least, as if they were trying to change bits of their shapes as I watched.   I called the airport tower spokesman asking if they had seen anything as such and he said he wasn’t on duty this morning and there was no report.  The Tower spokesman then gave me the number to the UFO center and encouraged me to call.   I am a 1967-69 Army veteran and retired fire captain and have never before witnessed such a sight.   Incredible …",
      "link": "http://www.nuforc.org/webreports/122/S122640.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ded",
      "summary": "Luminous objects over Fresno, CA.",
      "city": "fresno",
      "shape": "light",
      "date": "2015-08-13T00:00:00",
      "story": "luminous objects over Fresno, CA This is a sighting from a few months ago; I documented it in writing at the time so the details are correct. While riding as a passenger in a car in a residential area of the Tower District of Fresno, CA, I saw a strange light in the sky and asked the driver to pull over for us to get a better look at it. It was dusk, verging on night, so we got a good view of twenty or more luminous objects meandering across the sky from north to south, as if in a disorganized squadron.  The light from the objects was similar in effect to a candle or firefly; there was no sound at all. We watched this display for about 5 to 7 minutes, until each UFO was out of sight.",
      "link": "http://www.nuforc.org/webreports/121/S121077.html",
      "state": "CA",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e25",
      "summary": "Low flying object nearly misses car on I-5 near Fresno",
      "city": "fresno",
      "shape": "chevron",
      "date": "2015-08-13T00:00:00",
      "story": "Low flying object nearly misses car on I-5 near Fresno On Aug. 5, 2015, my partner and I were traveling from LA to San Francisco.  My partner was driving, and I was in the passanger seat.  When we were on 1-5, heading north, about 60 miles south of the exit for highway 152, we saw a strange aircraft to our left.   In this area, there were orchards to each side of I-5 with nothing else in sight, and it was pitch black except for the lights of other cars, and the lights of this aircraft. When we first spotted it, it was north west of us, flying south.  It seemed quite far away.  We watched it for a few minutes, and it looked like two bright white lights.  When it was just about parallel with our car, it turned towards I-5, and started flying directly toward our car.   Once turned, we saw three lights that got bigger as they got closer.  It took about a minute or two to reach I-5. At that point it was close enough to see that it was very low, flying just feet above the trees in the orchard. It flew across the freeway, just feet above, and in front of, our car.   Once it got to the other side of I-5, it flew about 20 yards into the orchard to our right, and turned again.  It flew north along side our car for about 30 seconds before it turned again, flying back over I-5, this time just above and behind our car.  At this time we lost sight of it.",
      "link": "http://www.nuforc.org/webreports/120/S120933.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c503c",
      "summary": "White lights in Fresno sky.",
      "city": "fresno",
      "shape": "light",
      "date": "2016-03-04T00:00:00",
      "story": "White lights in Fresno sky. I was looking south, and noticed what I thought was a bright star or planet in my peripheral vision above a large tree.  Turning to look south-southwest, I noticed that the light was not one but two lights, and they were traveling parallel to the horizon, in an apparent western direction.  The lights were bright white, similar in intensity to an aircraft landing light at a distance, but no sound was noted.  I called to my wife, who was standing inside the house, and turned back just in time to see the lights blink out, one by one.   My wife did not see them.",
      "link": "http://www.nuforc.org/webreports/126/S126140.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5871",
      "summary": "OK it's been some years since I experiment this sighting.. but I remember it like it was yesterday. This is what happens that night it",
      "city": "fresno",
      "shape": "triangle",
      "date": "2016-06-01T00:00:00",
      "story": "OK it's been some years since I experiment this sighting..  but I remember it like it was yesterday.  This is what happens that night it was my brother 13 the birthday.  So he invited couple of his friends over and cousin's. and he wanted to camp out in the backyard for his birthday so we set up couple tents..and crashed out…  I was in a tent with my cousin.  the tent had a sky view window so you had the view to look into the stars..  so that night it was partly cloudy and.  I rember  waking up in the middle of the night looking thru the sky view window and I saw a triangle shape object hovering right above us  Turing in circle motions with different color lights on the outside of object.  Blue green white lights..  something I never ever seen before...it was just hovering in and out of the clouds..my cousin was laying next to me as I woke him up to look at this strange object it was gone..like it knew I was watching ever since that day I've been a believer...",
      "link": "http://www.nuforc.org/webreports/127/S127601.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c59e4",
      "summary": "02/04/2016, Fresno, CA, Doughnut, 4-5 min, hovered, then landed super quick in front of vehicle, huge round craft, brown/gold, vanished",
      "city": "fresno",
      "shape": "other",
      "date": "2016-05-06T00:00:00",
      "story": "02/04/2016, Fresno, CA, Doughnut, 4-5 min, hovered, then landed super quick in front of vehicle, huge round craft, brown/gold, vanished Mr. X Documentary File # 00701  THE CRAFT This is to document the factual events that occurred on or about 02Apr16, at or about 1:40am, in Southern California in the city of Fresno.  The occurrence was witnessed by, and is conveyed by sworn testimony equivalent to, and with all judicial authority, as stated under oath by the signed witness, Mr. X.  There are several items preceding File #00701, including and limited to; one drawing of Object ABC articulated by Mr. X in the presence of a close kin.  After explanation to kin about Object ABC, Mr. X was asked by kin if he could draw, or recite details of Object ABC.  Mr. X did articulate the main features of Object ABC on an old small paper bag.  That image was then destroyed.  There is a second document articulated by Mr. X detailing the occurrence encountering Object ABC. As Mr. X was exiting the freeway into Fresno, California, using GPS from his phone as he navigated to his destination.  The GPS on the phone he was using began giving false readings, and performing out of its normal functional character.  Mr. X attempted to adjust the GPS as he drove on the off-ramp from Freeway 99 into Modesto, CA.  About 50 to 100 feet from completing the exit ramp, Mr. X saw a strange thing seemingly hovering off to the left of the exit over-pass.  As he began to focus on the object, the object seemed to flip, or slip, or shape-shift, landing in the middle of the road, on top of the over pass, directly in front of Mr. X’s vehicle.  He stopped the vehicle before running into the object. Mr. X stopped the vehicle, and tried to comprehend the sight of the huge craft, and make sense of what he was seeing.  He tried to wake his children, and co-passenger.  One 16-year old son sitting in the front passenger seat, one 14-year old son sitting in the rear passenger seat on the left side, and one female 18-year old female passenger sitting behind the driver’s seat.  All passengers were asleep at the time of the sighting.  Mr. X tried to wake everyone up, and even shook his son sitting next to him.  Mr. X began to speak aloud thinking that someone may be awake and listening, “what is it?  Look at this you guys.  What do I do?  I don’t understand.  What am I supposed to do?”  He asked.  When no one responded, he tried once again to wake his son, then decided to do something he thought might be stupid.  He thought that he couldn’t leave this moment without being absolutely sure that what he was seeing was real, and with no obstruction between his own eyes and the stran! ge object.  (He didn’t want to wonder in the future, because he knew he was seeing something that he never had seen before.)  He stepped out the vehicle with one leg, and stared at the huge object, with one hand on the door as he stood straight up.  He looked at the object for about what seemed to be 7 to 11 seconds, only looking into the vehicle for a split second at his passengers, and asking if they could wake up, then looking back at the object.  Just then a vehicle horn honked and when he looked back, he noticed there were two vehicles stopped behind him, and a third pulled off to the right.  The Third car was the vehicle that was honking.  At first, Mr. X thought that they were honking at him to get back in his vehicle before the strange craft did something to hurt him. (like he was crazy for standing out in front of the craft like that, so close.) Mr. X looked again at the craft as he got back into his vehicle, and as he clasped his seat belt, the huge craft just vanished in the plume of faint smoke or gasses, which quickly dissipated.  The Thing that Mr. X is calling smoke, or gassed, can a! lso be called a mist, and even visible fumes, or a cloud of something.  This action of the gasses had a visual effect something akin to a visible fume, without a smell, and was all around the craft. Mr. X then began to proceed the remaining 15 yards, or less on the off-ramp to the light.  He continued to look for the object, and look at his GPS to find his way.  The GPS still did not give correct magnetic north, flipping and changing routes sporadically.  He drove from memory, until calling his friend that he was going to visit, and having the friend guide him to his friend’s home. Mr. X pulled into his friend’s driveway in about 8 minutes after that.  As soon as Mr. X passengers began to awake, he began talking about the Strange Craft.  The first thing he said to his friend after saying a brief “Hi.” Was “I just saw an Alien Space Craft”.  The friend just thought he was joking, but he wasn’t joking at all, and as Mr. X began to walk, he lost control of his legs, and became weak.  The friend had to hold Mr. X up and assist him in regaining balance.  The passengers, Mr. X, and the friend all entered the home, and went out back to sit in a rest area of the home for a moment. The Craft was huge, Brownish-Gold, with tints of Green, Red, and Lots of Black.  The texture was Hexed, or X / cross hatched, with some kind of braces running vertical along either side curving with the surface of the craft from top to bottom.  The braces were of the same color, and were about three and a half lanes apart, on either side from the center where I was.  The craft was about 50 to 60 feet high, and obscured at the top and sides with the strange black cloud, or fumes.  At the bottom of the craft, about a foot and a half off the ground was pitch black, where the outline of the craft could be seen as it hovered close to the road.  The craft did block the view of anything behind it, and the street under it.  The craft made no sound, and had no smell.  Just an eerie silence.  Mr. X did get out of the vehicle, and look at the craft with his own eyes, and he did have glasses on so he could see the craft very clearly. The craft did appear from hovering off to the left of the freeway, and did move very quickly (impossibly quick), and stopped on a dead stop in the center of the roadway.  The craft did vanish, with the gas or smoke leaving a few seconds after the craft vanished.  The roadway became clear and lit, and the yellow center, and white lane lines became visible all the way across the overpass, where Mr. X was to drive. This is the sworn testimony, and statement of Mr. X, who is identified yet requests to remain anonymous for as long as possible.  The events described within this report are true and accurate to the best of my recollection, and in in no way fabricated, or made-up.  I swear to what I saw, and I am MR. X.  I have no understanding for what I saw, and I know that the nature, and actions of this strange craft was not of anything that I have seen on Earth. I hope this report helps, as I was asked to document the events of the evening on which I saw this Strange Unidentified Craft.  Signed:  Mr. X",
      "link": "http://www.nuforc.org/webreports/127/S127122.html",
      "state": "CA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d31",
      "summary": "Saw an unidentified seemingly intelligent white orb or object moving along the surface and under water while camping at Pine Flat Lake.",
      "city": "fresno",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "Saw an unidentified seemingly intelligent white orb or object moving along the surface and under water while camping at Pine Flat Lake. I was camping by myself at Trimmer campground on Pine Flat Lake in the Sierra Nevadas.  I woke up at 1 A.M after falling asleep in my car to warm up.  When I woke up I looked down at the lake and saw a very bright white light shining bright sitting right on top of the water on the edge closest to me.  I reached for my phone which showed it was at 6% and I brought it up to take a video and it died immediately.  I didn't want to scare it away by starting the car to charge my phone, so I watched without taking my eyes off of the object for about an hour.  It was very bright, white when I first saw it and over some time it dimmed down at times going underwater and moving around.  When it went underwater I could still see the light smaller and less bright underwater moving.  Eventually, I thought it had disappeared and I had to get out to use the restroom.   As I opened the door, I kept my eyes on the lake.  It reappeared very bright, right when I opened the door. Then it! dimmed and shot under water and further away.  I used the restroom got back in the car and continued to watch the seemingly intelligent orb or unidentified object reacting to the noise I had made.  On the right side of the lake, there were two blinking lights signaling boaters to avoid something floating in the water.  The unidentified light lined up next to the flashing lights and started flashing, as though mimicking the flashing lights.  It then traveled mostly underwater, at times peaking up further away until I could not see it anymore.",
      "link": "http://www.nuforc.org/webreports/131/S131240.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ef1",
      "summary": "Large dark craft, chevron-shaped, no lights, no sound, no windows, geometrically sharp edges.",
      "city": "fresno",
      "shape": "chevron",
      "date": "2016-10-27T00:00:00",
      "story": "large dark craft, chevron-shaped, no lights, no sound, no windows, geometrically sharp edges. Large chevron shaped craft, no lights and completely silent   I was outside on my balcony at around 6:40PM on a cold evening in December looking at objects in the sky through my telescope.  There was a moon above and wispy clouds, and the night was exceptionally clear.  I was late for a dinner date, but I wanted to get as much observing as I could before I left, so I was just about to go inside and I stood up and walked backwards to my balcony door, still looking at the clear night and stars.  My balcony door was propped open to my living room and the lights were dim, I was at the door threshold when I saw a distinct shape, like a chevron, or delta-winged shape, it looked like a hang-glider.  I said to myself, “cool, a hang-glider”, and I went inside.  I stopped and said to myself, “why is there a hang-glider flying? Where did he jump from?” it is flat in Fresno until the foothills about 11 miles away. I went back on the balcony and the craft was right in the middle of the square of Pegasus constellation and the wingspan was almost as wide ! as the diagonal stars across the square. I estimate that the craft was about 800 to 1200 feet in altitude, completely silent, no lights and was moving at a slow pace. It looked as though it was moving back and forth, or left and right as if it were scanning the area, it was low enough to see that there were no windows, the color of it looked as though it was changing from black, charcoal grey and the color shapes were not clear and seemed to be matte, no reflections of any sort. I tried to make out an insignia, a logo, an American military branch, an identifiable anything, there was nothing. The craft seemed to have an underbelly of some sort, like a rounded belly with no other shapes or cutouts that looked like landing gear. The edges of the craft were geometrical and sharp, like a wedge cut around at 45 degrees, it moved right over my head and from west to east towards the foothills and slightly north. The craft flew over me and it was in my view for approximately 30 seco! nds to a minute. I kept repeating to myself, “what the F*** is! that? w hat the f**k is that? What the f*** is that?!”, over and over again. I knew that my camera was just inside and it had been charging all night and I wanted to grab it, but I didn’t want to blink and I wanted to ‘see’ this thing as long as I could. I grabbed a notepad and pen that I use when observing and immediately started to draw what I was seeing. There were two people outside, one walking their dog and another throwing trash, but I didn’t alert them, I just noticed that they had no idea that a large craft was flying just over head. I estimate that the wingspan was about the size of a football field in width at the height that it was flying. It seemed to glide in the air, perfectly and parallel to the ground and never tilted so much as a degree, it flew in a straight line at a slow steady pace. Slower than an airplane would fly and faster than a hang-glider would, but it seemed to float or glide through the air. High enough to push little wispy clouds out of its path, if the moon was not out, I don’t think I would have been able to see the craft as it reflected hardly any light and seemed to absorb light. It flew over a baseball field about a half mile away and the high-voltage lights were on and I could then see that the craft’s underbelly was lower than I thought and that the craft’s shape was just a thin line. I then ran to retrieve my camera and I thought to myself, “I bet this thing won’t work”, like every UFO reenactment that I have seen on television. I turned it on, and the camera was dead in th! e water, no lights, no sounds, no nothing, dead battery. So I continued to observe it as it disappeared in the horizon. I was shocked by my reaction of seeing an unidentified craft, my first and very up-close and personal, I was excited, but at the same time, I was in total fear of what I was witnessing. It brought tears to my eyes that something this ubiquitous could fly directly over Fresno, at rush hour during Christmas season and shopping, fairly low and whomever is piloting this craft, was so blatant and not worried if anyone could see that this craft was something like no other. To me the craft looked as though it was unpiloted, maybe remotely piloted like a drone, it seemed to be scanning the area and moved in such a way that seemed to be autonomous or artificially controlled with GPS or machine logic. After it was gone and out of sight, I was frightened and shocked, concerned and worried that it could be ours, or one of theirs, perhaps an invasion, or reconnaissance before the military strike. I held back tears, and I thought of turning the camera on again to see if it worked, I flipp! ed the ‘on’ switch and the camera lit up ready to shoot, that is when I started to cry realizing that there are things in this world that are kept from us, and I believed in all the conspiracies and every UFO sighting. I was enraged and sad that we are kept from knowing this technology, what else is out there that we don’t know that could possibly harm us? Whatever this thing was, it was magnificent and huge, black, silent, had no lights and stealthy enough to fly over Fresno, CA in the bustle of Christmas season and only one person, myself actually saw it flying overhead. I am hoping that this craft was one of our own military’s and that it is online to protect our urban areas from threats from any enemies. I have the drawings that I made and detailed maps of its trajectory. As a crow flies, it was headed directly towards Area 51 in Nevada, which is very close to Fresno, CA if you look on a map, any crafts that fly out of there, would fly right over Fresno to get to the ocean to do any maneuvers, over Fresno is the shortest route. I hesitated writing this report because I thought I was delusional, but after seeing all of the reports of a similar craft in this area, I thought I would add my event sighting to the database so that everyone can read and maybe someone else thinks they are seeing things, but I saw what I saw, and I can’t explain what it was.",
      "link": "http://www.nuforc.org/webreports/130/S130865.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c62a0",
      "summary": "Bright neutral white light seen travelling several miles across Fresno until fading out.  ((anonymous report))",
      "city": "fresno",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "Bright neutral white light seen travelling several miles across Fresno until fading out. I was outside and casually looked up at the sky.  I immediately noticed a very bright light moving from West to North East over North West Fresno.  I was immediately in awe because the speed and brightness of the (neutral) white light.  It was roughly 3-4 times larger than any star in the night sky and was much bigger than any other plane in the area, even at a distance.   I kept my gaze on the light until I noticed the light start to dim and fade.  It was bright, yet not blindingly, until it slowly faded into complete darkness.  I lost track of it after that.   Less than 10 seconds after it disappears, I noticed what appears to be military or authority planes all over the area around where the light had traveled, and they continued to do so for 20+ minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130334.html",
      "state": "CA",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c62c6",
      "summary": "3 to 6 white flashing lights.  ((anonymous report))",
      "city": "fresno",
      "shape": "flash",
      "date": "2016-09-15T00:00:00",
      "story": "3 to 6 white flashing lights Strange bright flashing white lights 3 to 6 then changes to 7 all white very bright, it's flying in  circles over Fresno for presidency will get me for the last hour  And keeps going back and forth at very fast speeds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129872.html",
      "state": "CA",
      "duration": "On going"
    },
    {
      "_id": "64d005f478aba2ec5a3c65cb",
      "summary": "Big fire ball that broke in two smaller more dominant balls of fire with a more defined shape.",
      "city": "fresno",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "Big fire ball that broke in two smaller more dominant balls of fire with a more defined shape then the fire around them started to die out while traveling east then heading out of sight all together . ((NUFORC Note:  Witness corrected the date.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128866.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c65dc",
      "summary": "Approx. 9:30 I was walking at Woodward Pk in Fresno, in the SE.  ((NUFORC Note:  Re-entering space debris.  PD))",
      "city": "fresno",
      "shape": "rectangle",
      "date": "2016-08-02T00:00:00",
      "story": "July 27th aproximitly 9:30.  I was walking at Woodward park in Fresno, California, on the road, I would be on the South East end of the park parallel to Friant road. coming from the west were a set of lights that did not look like an aircraft, it caught my attention, its path was headed straight over my location as it got closer I realized that it was making absolutely no noise, there was no sound what so ever. There were three to four lights on or near the front of it that projected forward off its rectangular shape, they were slightly Amber in color, as it went over head the underside reminded me of what a car would look like if it was up in the air and I was looking up at it.  There were a few more lights sparatically positioned in the underside and there was clearly white vapor or&nbsp; propulsion trails, aproximitly 4 or 5 shooting behind it but they weren&apos;t very large. It was flat and rectangular with definitions of design underneath but in size it&nbs! p; appeard to be about the size of a large commercial buildings foundation. It was moving at a steady spread and was not racing towards earth and did not apear to be something burning up in earth atmosphere, as it passed over head I noticed the brightest White light facing backwards from the rear of it, it looked like a giant cone shaped flood light and it was pure white. It crossed Friant road and headed towards Clovis and the hills and appeared to me to be loosing altitude the lights in the front seemed to redden as it got further away from me and it was definitely arching downward a little. I thought it might be heading towards the ground i wasn&apos;t sure, this did not look like space debre nor any man made aircraft. My view of it lasted aproximitly 20-30 seconds. ((NUFORC Note:  Re-entering space debris.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128788.html",
      "state": "CA",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6916",
      "summary": "I was outside waiting for pizza man, started lookin at the ring around the moon. Then noticed a bright red star flicker at the bottom r",
      "city": "fresno",
      "shape": "triangle",
      "date": "2017-04-07T00:00:00",
      "story": "I was outside, waiting for pizza man, started lookin at the ring around the moon.  Then noticed a bright red star flicker at the bottom right side. I was lookin at this star for a good second then I seen this triangular silhouette through my peripheral's, now picture gas fumes, in the shape of a huge V, that's how this flying object appeared to me.  There were no lights what so ever on this craft, nor did it have sound to it.  It was silent.   At first I thought it was a pigeon, gliding, but it didn't flap its wing, plus it was goin way to fast.   Finally, I realized what I was looking at and chills were sent up my spine at that moment.  I tried keeping my eyes on it but it disappeared as soon as it was over downtown Fresno.",
      "link": "http://www.nuforc.org/webreports/133/S133437.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ccb",
      "summary": "Oval shaped bright orange/yellow light stationary in the sky not moving for approximately 3 mins then just disapeared apeared to be big",
      "city": "fresno",
      "shape": "oval",
      "date": "2016-12-30T00:00:00",
      "story": "Oval shaped bright orange/yellow light stationary in the sky not moving for approximately 3 mins then just disappeared apeared to be big light even from a far distance",
      "link": "http://www.nuforc.org/webreports/131/S131905.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d4d",
      "summary": "Twelve orange globes in formation over Fresno",
      "city": "fresno",
      "shape": "circle",
      "date": "2016-12-21T00:00:00",
      "story": "Twelve orange globes in formation over Fresno I saw approximately twelve orange globes hanging in the sky.  I was in the NW part of Fresno looking East at 7 pm.  At first I thought it was Christmas lights but quickly realized they were not attached to a house.  When I pulled back around to get a good look, I saw that they were hanging in the sky hundreds of feet in the air.  They were in formation.  They made no sound.  When I pulled over, another truck had already been parked and was looking at the lights.  They said before I got there, the globes were in a straight vertical line, one on top of the other.  When I first saw them they were not exactly vertical, but the whole group was more or less up and down, hundreds of feet top to bottom.  Then they started to move very slowly into groups of three and four in what appeared to be triangles and the group became more horizontal.  The spacing between the globes was nearly exact.  We watched them for five minutes then they started to fade away one after the other. ((NUFORC Note:  We spoke via telephone with the source of the report, and he sounded to us to be quite serious-minded.  We suspect that he is an excellent witness.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131822.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f5e",
      "summary": "A short accounting of this even written for a memoirs class.",
      "city": "fresno",
      "shape": "cigar",
      "date": "2017-07-23T00:00:00",
      "story": "A short accounting of this even written for a memoirs class. UFO Sightings The sky was black—one of those moonless nights with crisp air and unending visibility.  If memory serves me it was early in the winter of 1974. I had just concluded a late-evening insurance appointment on Grantland Avenue west of highway 99 in Fresno, CA. Between 9:30 and 10:00 o’clock, I headed for my home in Rolling Hills on the Madera County side of the San Joaquin River.  The most direct route from Grantland Avenue was to take Herndon Avenue east to Blackstone and then north on Highway 41 to Avenue 10. A mile or so west of the Sierra Sky Park I noticed what looked like an airplane, roughly 500 feet above the ground preparing to land at the tiny airstrip.  Small planes landing here were not uncommon so I paid little attention to it.  But I did notice that its rate of descent was considerably slower than an airplane.  Maybe it’s traveling toward me, I reasoned.  The closer I got to the airport the more attention I paid to the object’s flight pattern. After seeing how slowly it was moving I ruled out the possibility of it being an airplane, and thought it was a glider.  The only other logical possibilities were a hot-air balloon or a helicopter. When I clearly saw its oblong shape I ruled out these possibilities too. Curious, I pulled off the road onto the soft shoulder, came to a stop, and turned my engine off. I got out of the car and listened carefully for any audible sound. Nothing. Not a whir, not a click, not a sound! The windowless gray object wasn’t hovering. Instead it slowly drifted in a northwesterly direction across Herndon Avenue toward the airstrip about a hundred feet above my head, still continuing its descent. I felt sure it would land but instead it drifted west and began following Herndon Avenue back toward highway 99. I got back in my car, turned around, and followed its white light. As I picked up speed it picked up speed. The faster I accelerated the faster it went. Then in the blink of an eye it pulled away from me, its intense white taillight receding into the black starry night. What was that? I thought. The traffic on Herndon that night was non-existent. In 1974, Herndon Avenue was little more than a two-lane country road. I’m calling the airport when I get home. Maybe they’ll have some information. Someone surely saw that. Once home I called the Fresno Air Terminal control tower directly, which you could do in the early 70s. “Has anything odd shown up on your radar screen the past thirty minutes?” I asked. “No sir,” the air traffic controller answered. “Why, what’s up?” “How could you have missed it?” “Missed what?” After explaining my encounter he said, “Well, for one thing it would depend on its altitude and location relative to our radar equipment,” and then continued with some additional mumbo-jumbo about how radar works. As I slowly calmed down from my excitement I explained to him in detail what I had seen. “You know, that’s really odd. Someone else called me from near the Sanger River bottom earlier tonight relating almost exactly what you’ve described.” And the following week I was northbound on highway 41 south of the San Joaquin River Bridge, when I noticed a bright-white light in the sky similar to the one I’d seen earlier. I felt sure it was an airplane and continued observing it as I crossed the bridge. As soon as the object reached Avenue 10 it took a laser-like ninety-degree turn to the left and accelerated out of sight at an unbelievable speed. Many people have experienced sightings of UFOs. Many scientists and the military downplay their existence because nine out of ten sightings can be explained by other phenomena. Some people claim they were abducted, with a small percentage of these asserting that medical experiments and who knows what else were performed on them. Since that time I have listened to stories and accounts of UFOs with interest on one hand, and with reservation on the other. Most of these sightings involve objects shaped like discs or triangularpatterned groups of objects. Nearly all first-hand accounts have not described what I saw—an oblong-shaped craft. With the advent of the Internet I have revisited the subject hoping to find photos or stories that more closely mirrored my experiences. My search uncovered only one sighting that described something similar to what I saw. This incident happened near Mansfield, Ohio, on October 18, 1973, and was widely recognized as one of the most notable UFO sightings that year. I was amazed to find how many similarities my encounters shared with this documented UFO sighting. Here are a few samples: “Cigar-shaped metallic object with dome, body lights, light beam, apparent lifting force…” “hovering relationship” “The object appeared solid…red light at the nose, a white light at the tail…” “No turbulence was felt and…heard no sound…” “…the object accelerated and moved off to the west, showing only the white “tail” light as it receded, and made a distinct 45 degree course change to the right, heading toward Lake Erie.” “On the ground, the driver and passengers of a car saw two lights, one red and one green… At first they thought it was a small plane flying low…heard no sound…its unusual qualities caused the driver to pull over and stop.” There is no doubt that what I saw was real. It was just out of my realm of understanding. I haven’t witnessed another sighting since, but will continue to search the skies for unusual events ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135295.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e36",
      "summary": "There was this orb of light flying over my house and it was slowly gliding over my house until it went down somewhere into my neighborh",
      "city": "fresno",
      "shape": "circle",
      "date": "2018-05-31T00:00:00",
      "story": "There was this orb of light flying over my house and it was slowly gliding over my house until it went down somewhere into my neighborhood and I was the only one who saw it in my backyard and it was bright.   It came out of thin air it like formed into a light right in the middle of the night. It didn’t come across the sky it just started right in the middle by getting brighter then slowly gliding across",
      "link": "http://www.nuforc.org/webreports/141/S141627.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c803b",
      "summary": "Moving object with various light intensities",
      "city": "fresno",
      "shape": "circle",
      "date": "2018-04-05T00:00:00",
      "story": "Moving object with various light intensities Looking up at the sky, we were watching planes fly in different directions.  Looking out into the northeast we saw a bright light that we thought to be a bright star.  It kept on shining with different intensities of light and randomly.  It didn’t have any sort of pattern like a plane or satellite have.  It would shine a white light softly then a couple seconds later the light would intensify, brighter than any of the stars or planes in the night sky.  It continued this cycle of lights traveling east across the sky for about 20 minutes until it disappeared.  It maintained the same color of light the whole time, but the amount of light seemed to be different every time.",
      "link": "http://www.nuforc.org/webreports/139/S139336.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8318",
      "summary": "High altitude white object in the sky for a few hours.  ((NUFORC Note:  Possible high-altitude balloon??  PD))",
      "city": "fresno",
      "shape": "cylinder",
      "date": "2018-10-12T00:00:00",
      "story": "High altitude white object in the sky for a few hours. May 15, 2018.  Walking my dogs in a nearby school around 1 p.m. I noticed a white orb sitting high in the sky.  The object was stationary.  The temperature was mild with a nice breeze blowing.  I realized that it was probably not a man made object.  The elevation appeared as high a commercial jet in a regular high elevation flight.  If there was a good wind on the ground then there would be high wind at that altitude.  A balloon of any type could not stay that stationary and any tethering impossible.  After around fifteen minutes the object had slowly drifted towards the West.  I knew my sister had a good high resolution camera with a telescopic lens.  I gave her a call and she saw and photographed it.  The object this whole time was pretty much stationary with a little noticeable drift.  I got home and tried to photograph it with my wife's camera but was not too successful.  I got out my high powered binoculars and could see it fairly good.  The object appeared oval. Insi! de the oval were too round ovals.  In between the two interior ovals was dark dot.  Everything except the black dot was a milky translucent and appeared to be illuminated.  I bring this matter too your attention now because I did not knew that it was reported to a local news station.  KMPH channel 26 Fox news.  There report can be seen on You Tube under the heading of: 2 UFOS OVER FRESNO  KMPH 26 NEWS MAY 15TH VIDEO SEE DESCRIPTION! I have my sister's photo if you are interested.  Thanks ((NUFORC Note:  Possible high-altitude balloon??  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143466.html",
      "state": "CA",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c8560",
      "summary": "Craft in clouds in Fresno, CA.",
      "city": "fresno",
      "shape": "chevron",
      "date": "2018-08-31T00:00:00",
      "story": "Craft in clouds in Fresno, CA. On May 19, 2018, i went outside and noticed the clouds looked different.  The day was clear with some clouds but these clouds looked like solar flares so i took a few photo's.  I forgot about the pictures I took then a few weeks ago I showed my friend the photo's he said, \"what's that?\" I never saw a craft in the sky but it sure is in the photo, I submitted to MUFON Case#93848.",
      "link": "http://www.nuforc.org/webreports/142/S142842.html",
      "state": "CA",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8c86",
      "summary": "2 lights flying close to each other & disappeared 5 seconds from each other.  ((anonymous report))",
      "city": "fresno",
      "shape": "unknown",
      "date": "2019-02-07T00:00:00",
      "story": "2 lights flying close to each other & disappeared 5 seconds from each other. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144782.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8cc8",
      "summary": "Whooshing sphere with red lights and a white search light at the bottom.",
      "city": "fresno",
      "shape": "sphere",
      "date": "2019-01-24T00:00:00",
      "story": "Whooshing Sphere with red lights and a white search light at the bottom. I was in bed about to fall asleep when I heard a whooshing sound, I jumped from bed moved the blinds in the window aside and saw a somewhat clear sphere that had red lights at the bottom.  The sphere was zipping around really fast back and forth like it was looking for something then it stopped at my window as it knew I was looking at it, a bright white light like a spot light that was inside at the bottom of the sphere spun around and shone in my eye.  It felt like the light only shone in my left eye which felt uncomfortable by the brightnest of the light, and evey time I think about it I feel the uncomfort in my left eye.  I immediately closed my eyes, yelled and fell to the floor I peeped threw the blinds and saw that the object was gone.  I remember it made a humming sound the whooshing sound came from it zipping back and forth as in a hurry.  I wish I could have got a picture or video of it because no one believe me do to prior encounters.",
      "link": "http://www.nuforc.org/webreports/144/S144573.html",
      "state": "CA",
      "duration": "~3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d97",
      "summary": "I woke up at approximately 4:00am after having a very weird dream and went downstairs to get water. As I was getting water i looked out",
      "city": "fresno",
      "shape": "light",
      "date": "2019-01-11T00:00:00",
      "story": "I woke up at approximately 4:00am after having a very weird dream and went downstairs to get water.  As I was getting water, I looked out my window and saw a very bright light that seemed like it was a star at first but was much bigger than a star.  I went back to bed but decided to go back downstairs and outside to record this light.  As I recorded the light, it seemed to be shape shifting or moving somehow but staying relatively in the same position. I am aware that there were several reports of a comet being seen on this same day, but those sightings were seen in the evening of 12/19/2018 and my sighting was in the early morning on this day.",
      "link": "http://www.nuforc.org/webreports/144/S144372.html",
      "state": "CA",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9309",
      "summary": "It appeared to be a white tissue floating downward kind of waving and a shine to it then in sudden flew straight up then took a rt turn",
      "city": "fresno",
      "shape": "other",
      "date": "2019-12-01T00:00:00",
      "story": "It appeared to be a white tissue floating downward kind of waving and a shine to it then in sudden flew straight up then took a rt turn and took off gone.  As it left the next witness yelled out look there is another one and it did the same maneuver.  Clear sky’s.",
      "link": "http://www.nuforc.org/webreports/150/S150116.html",
      "state": "CA",
      "duration": "1-2 minutes"
    }
  ]
}