{
  "city": "garland",
  "fetch_timestamp": "2025-07-12T14:35:58.530052",
  "record_count": 31,
  "pages_fetched": 1,
  "api_calls": 2,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b685f",
      "summary": "I saw a strange bright light in the sky at  a fireworks show and decided to take some pictures.",
      "city": "garland",
      "shape": "changing",
      "date": "2007-08-07T00:00:00",
      "story": "I saw a strange bright light in the sky at  a fireworks show and decided to take some pictures. Usually at night in the area I live in I notice a bright light in the sky and think it is a star or satellite or the space station.  From a distance it looks like the light is brighting and fading and turning around, or changing shape so then I think that can't be a star.  I went to the newely built Firewheel Town Center to watch fireworks and noticed one of these similar lights in the sky and thought I would take pictures since the fireworks had not started.  When I took the pictures I had the zoom on my digital camera on all the way.   I was kind of amazed at what I saw when I zoomed into the pictures on word like it was changing shapes.  The sky was pitch black and there was a smaller star looking thing close by.  The fireworks would have been going off infront of where I was and this light was on my right.  A couple of the pictures look like rockets with no light and smoke trail that accidentally maybe a couple of fireworks, but I don't remember.  My background is Navy vet and college student. I know the object could probably be anything, but I thought I would send the pictures.",
      "link": "http://www.nuforc.org/webreports/057/S57464.html",
      "state": "TX",
      "duration": "10:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b681e",
      "summary": "Large, red rectangle hovers over parking lot in Garland TX.",
      "city": "garland",
      "shape": "rectangle",
      "date": "2008-06-12T00:00:00",
      "story": "Large, red rectangle hovers over parking lot in Garland TX. At 7:am on May 27th 2008, I was standing in my back bed room in Garland TX. which faces west.  I was looking out the window of my apartment which faces a huge parking lot in a shopping center.  A large bright red rectangular object suddenly appeared over the parking lot and hovered a few seconds and then took off flying over our apartment building going east at an incredible (what seemed like super sonic) speed and quickly disappeared. It was very close and appeared to be about 150' long and maybe 50' in width and 50' in height. I was very shaken by this experience and I feel sure that at 7am in the morning there must have been other people who saw this object.",
      "link": "http://www.nuforc.org/webreports/063/S63561.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b688d",
      "summary": "Dark Gray smokey shaped saucer above the highway",
      "city": "garland",
      "shape": "disk",
      "date": "2008-01-21T00:00:00",
      "story": "Dark Gray smokey shaped saucer above the highway I reported this before on the website, and was happy to know someone in Stephenville also saw it. Driving into Dallas on Dec 27th, I saw a plate up in the sky and then it turned horizontal and looked exactly like a UFO. It was about 1 mile wide and was very fluid and blurry looking. It was diagonally going down, like it was going to land. It was a VERY overcast day. The craft was dark gray, no lights. I was embarrassed to tell anyone but this website. (see previous entry) I heard no noise, but definitely saw a fluid-like metal object up in the sky for several minutes. It was not a reflection because it kept going down to the left and I was traveling straight ahead down the highway. Please let me know if anyone else has seen this in Garland, between Mesquite and Dallas, Texas, 2 hours East of Stephenville. Thank you so much.",
      "link": "http://www.nuforc.org/webreports/060/S60882.html",
      "state": "TX",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d46",
      "summary": "twinkling multicolored light in NE sky viewed from Dallas Area 9-13-06",
      "city": "garland",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "twinkling multicolored light in NE sky viewed from Dallas Area 9-13-06 NE sky about 45 degrees, to the left of the moon near the horizon, spotted what appeared to be a star twinkling rapidly and changing colors ver rapidly.  Object began to move northerly and away from the horizon at a slight diagonal slowly.  Object then stopped moving northerly and continued to rise up from the horizon.  The speed at which it flashed different colors was very fast, faster than 2 or 3 flashes of color per second.  Object appeared to remain pretty much stationary for a number of minutes, it was still in the same place when i decided to quit observing.  I tried to take photos and video.",
      "link": "http://www.nuforc.org/webreports/052/S52483.html",
      "state": "TX",
      "duration": "30 + minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a63",
      "summary": "Hazy light circling eradically overhead at 3:00 a.m. in an ever-changing mostly eliptical course, above the clouds.",
      "city": "garland",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Hazy light circling eradically overhead at 3:00 a.m. in an ever-changing mostly eliptical course, above the clouds. My friend and I went outside to smoke a cigarette around 11:00 PM 11/26 and witnessed a light circling around in the sky above my backyard. I also woke my mother up to see it, as well.   At first we thought it may be a spotlight (a new club opening up or something), but the center of the activity was in a strictly residential suburbian area and the light changed its course, moving eradically slow then fast and not in a perfect circle, sometimes a square or triangular course, and small then bigger ellipses, but always clockwise.  We could see no beams coming from the ground either, and the light seemed to be radiating parallel to the ground from an invisible object.  (It seems to beam out some at the right and left sides of the circumference, the course being mostly elliptical.)  It is now after 4:00 am 11/27, and the light is still there circling.   Last I checked I saw other light trailing it.  It was breaking in two at the middle of the course (bottom of ellipse) and then the smaller light followed it to the left and upward.  Kind of like the Atari game \"Breakout\" where it is guided.  Does that make sense?  It moved slow then fast like that.  And, the main light surged, too.  Like I said, it seemed to radiate from a center point above the clouds.   I also saw the light skip and appear further along the circumference immediately several times!  The light is not circular, but hazy (even inbetween the clouds where it is clear sky) and shapeless.  Not like any spotlight I’ve ever seen, and it’s in the middle of the night and has been going on for five hours.  Also, it held it’s position when we went to the front of the house, seemed to be circling over us at the same place as in the backyard.  So, it must have been pretty far away and high up over the clouds.   I hope this makes sense; I’ve tried to give as accurate of a description as possible.  I tried to capture it on camera, but it was too dark to pick anything up (maybe I just don't know how to use the thing!)",
      "link": "http://www.nuforc.org/webreports/054/S54973.html",
      "state": "TX",
      "duration": "three hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b8600",
      "summary": "On Sunday, June 7, 2009 at 8:20 PM CT; I saw an unknown object in the sky. I was located in Garland, Texas zip code 75044",
      "city": "garland",
      "shape": "triangle",
      "date": "2009-08-05T00:00:00",
      "story": "On Sunday, June 7, 2009 at 8:20 PM CT; I saw an unknown object in the sky. I was located in Garland, Texas zip code 75044 and was facing north. The object appeared like a black triangle shape flying object that came from out the sky heading east and headed west; yet, it began to drop towards the earth at a high speed. While dropping, the UFO had a line of white smoke behind it and began to fall down with more smoke around it. Suddendly, around 8:24 PM CT it looks as if burned away and disappeared in the sky.",
      "link": "http://www.nuforc.org/webreports/070/S70434.html",
      "state": "TX",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bb1",
      "summary": "Triangle UFO in Garland, TX in 1992",
      "city": "garland",
      "shape": "triangle",
      "date": "2008-08-12T00:00:00",
      "story": "Triangle UFO in Garland, TX in 1992 I’m a college student living in Germany who recently separated as a staff sergeant from the U.S. Army a few months ago.  I am 34 years old.  I hold an associate’s degree.  I am also an expert in long-haul transmissions technology with six years of military experience in the communications field.  Prior to my military service, was in project management for five years with a large telecommunications company.  I lived in and around Garland, Texas, from age 5 until I enlisted at age 28. I apologize, as the date and time of my account is only a guess, as it took place over 15 years ago.  However, I estimated the date based on a few facts: I had recently graduated high school in May 1992; it was summer; I was driving an '87 Honda Civic during the incident, a car which I owned at that time.  The time was late evening, an hour or so after sunset. A childhood friend of mine and I were driving SE down what is today President George Bush Toll Way (TX 190) at around 2200.  Today, the area is very built up with shopping malls and restaurants.  But back in 1992, the only building in the area was a high school (my high school).  It was dark and, at the time, there were no street lamps.  As I'm driving, my friend points to the sky through the windshield and tells me to look.  He's pointing straight up through the windshield to a point directly over my car.  And, while it was difficult for me to lean forward over the steering wheel to see what it was he was pointing at, I caught several glimpses of it.  This is what I saw: three reddish hued lights in a triangle configuration, with one brighter light in the very center of the formation.  And, while the sky was dark, the space between the lights was even darker, giving the shape a distinct triangular outline.  Because I was driving, I could only glance at the object for a few seconds at a time before I had to put my eyes back on the road.  It was difficult to tell whether or not the object was moving along with us, or if it was at such an elevation that it appeared motionless from our perspective.  When I would glimpse it, I could tell the object was rotating slowly in a counter-clockwise direction, at an estimated rate of one rotation every 30 seconds.  We were now approaching a stop sign, and I brought the car to a stop. Without speaking, immediately after I stopped, I shut the engine and lights off; we exited the car and stood up in the road to get an unobstructed view.  To our delight, the object was still there, hovering silently.  Now that we were no longer moving, we could tell the object wasn't moving, either.  It was completely stationary (though it continued to rotate in place) and produced absolutely no noise.  As far as the size of the object, it was difficult to estimate.  But I recall that, from my perspective on the ground, the triangle appeared to be about the same size as the shape one can make by touching the thumbs and index fingers of both hands and holding them at arm's length directly overhead (approximately 4\" x 4\" x 4\"). We continued to watch the object for another thirty seconds or so when another car began to approach us from the rear.  We quickly hopped back in my car, started it up, and pulled it to the side of the road to make way. As soon as the other car pulled away, we got back out.  But when we looked up at the sky, there was nothing there.  Nothing at all.  No noise, no lights.  Whatever we had been observing only seconds earlier had vanished.  I don't recall ever telling anyone about it, and I don't believe my friend or I ever discussed the incident with each other again after that night.  Of course, we haven't spoken to or seen one another in over ten years. I realize it's been many years since this took place.  In fact, I rarely even think about it.  However, it was several years ago that I first read an article or saw a news report about someone witnessing an object matching the exact description of what I'd seen so long ago.  Since then, I've seen or read many other separate but similar accounts.  And, since I've always been somewhat of a skeptic with regards to UFO sightings, I tried my best to pretend what I'd seen must've been something else...maybe something I would've recognized had it been daylight.  However, ever since that day, when I'm outside at night, I still find myself staring up at the sky, semi-hoping that I might see the same thing again, if for no other reason than to prove to myself that whatever I saw actually does exist. Though I still remain skeptical, I felt I should at least contribute my experience so as to at least add my account to the collection of other similar sightings.  Skeptic or not, I saw what I saw. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64856.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c6b",
      "summary": "Setting:  At home, inside my house, all windows and doors closed.  Temp outside in 50s.  Low this morning about 45 deg F.  Predicted hi",
      "city": "garland",
      "shape": "unknown",
      "date": "2009-01-10T00:00:00",
      "story": "Setting:  At home, inside my house, all windows and doors closed.   Temp outside in 50s.  Low this morning about 45 deg F.  Predicted high about 75 deg F.  House is well insulated; normally cannot hear aircraft unless they are low and close.   Time about 10:25 am CST. Heard steady sound of aircraft; listened to determine if it was radial piston engines because I like to see and hear warbirds.  Wasn’t a radial; it was a jet, rocket or re-entry sound-a steady roar.  Went outside to back patio and yard.  Sound was from southwest; looked ahead of sound and spotted a reflection just SW of overhead moving rapidly to SE. It had the appearance of previous sightings of shuttle passing overhead on landing approach toward Canaveral.  Lost sight after it passed overhead and moved toward SE.  Sound continued for several seconds after sight was lost. Went inside and checked major TV network channels for news--no results.  Checked internet for shuttle Endeavor news--it is supposed to be still in orbit attached to space station.",
      "link": "http://www.nuforc.org/webreports/066/S66949.html",
      "state": "TX",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba92f",
      "summary": "red and greenish lights seen over Dallas, Texas viewed from Garland, Texas.",
      "city": "garland",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "red and greenish lights seen over Dallas, Texas viewed from Garland, Texas. I live in Garland, Texas only about two miles north of the Dallas city limits and just two blocks east of Garland Road. On the 4th of November just 20 minutes after midnight I was on the deck in back of my house looking south. I saw two objects moving at a fairly slow rate of speed. I would estimate their speed was less than one hundred miles per hour. One of the objects was trailing the other. I could not make out what shape they had. All I could see was two very bright lights on each object. The color of the lights was red in front and a greenish looking light in the rear of each object. They caught my attention because the lights were very large and very bright. I am very familiar with the size of safety navigational lights on aircraft. These lights were very large and much brighter than safety lights on aircraft. Also the lights did not blink, they stayed on all the time and were very bright. The lights were just above the horizon and they were a good di! stance away. (I would estimate between five and ten miles away) At first I saw them traveling in a north-eastern direction and then they turned left and were traveling in a north-western direction when I lost sight of them as they disappeared behind the trees. I only saw them for a short while, approximately ten to fifteen seconds.  I was in the Air Force for twelve years and am very familiar with aircraft lights. These lights were definitely not normal in that they were very large, very bright and they stayed on all the time.",
      "link": "http://www.nuforc.org/webreports/078/S78772.html",
      "state": "TX",
      "duration": "10 to 15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd508",
      "summary": "1978 Red Saucer Garland texas",
      "city": "garland",
      "shape": "disk",
      "date": "2012-07-04T00:00:00",
      "story": "1978 Red Saucer Garland texas  500 Lights On Object0: Yes I was 7 years old about to go to sleep. the above location data is just a guess I don't remember where I lived exactly. this was the first of many UFO sightings through my life. this is the only one that was without a doubt I knew what I was looking at. the others were just anomalous lights.  ok, the sighting: I was going to sleep, staring out my window and I saw a glowing orange/red saucer it must have been less than 100 yards away. it was zig zagging in a weird arc and went behind a building. I got all freaked out and ran downstairs and told my mom I saw a flying saucer and she told me to go to bed and stop fibbing. the craft was pretty big.. at least 30ft across. I remember this like it was yesterday. my first thought (mind of a 7 year old) is I thought it was the lost saucer from sid and marty craft... then my mom told me there was no such thing .. that freaked me out and I could not sleep for weeks. I have had a very crazy childhood involving stuff like this. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90055.html",
      "state": "TX",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5fb",
      "summary": "I saw a dark v cloud fly over my head at 2000 mph",
      "city": "garland",
      "shape": "chevron",
      "date": "2012-10-30T00:00:00",
      "story": "I saw a dark v cloud fly over my head at 2000 mph I was out back of my aunts house smoking it was chilly and a little breezy.  Then all of a sudden I hear a whoosh of air heading my way with some speed it reminded me of the mlrs rockets I have witnessed before but with no engine sound.  I look up to try and locate the air rushes source and I see a large boomerang shaped cloud moving very low and very very very fast but the only sound that was heard was the wind rushing over it looked like a flock of geese flying in a v shape over head moving at 2000+ mph I kid you not. It was so incredible I never knew such a thing existed however I know now that this is real.  I could not believe when I typed into google search UFO sightings in Dallas that the first description I read matched my sighting to the t, that really reinforced exactly what I just saw 20 min ago.  I believe we have a new technology out there gentleman. One that is not &quot;out of this world&quot;. I don't believe in &quot;ufos&quot; thats why.  I'm a ! vet. Infantryman.",
      "link": "http://www.nuforc.org/webreports/093/S93345.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdfd7",
      "summary": "Flashing red blue green light hovering in sky.",
      "city": "garland",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "flashing red blue green light hovering in sky. Shiny bright looking distant light. It looked like a star at first but it couldn't be.  It was flashing multiple colors, green, red, blue, maybe others.  Definitely not a star I've ever seen.  It looked like it was hovering in place but over long periods of time it slowly changed location.  But very little to almost none.",
      "link": "http://www.nuforc.org/webreports/092/S92910.html",
      "state": "TX",
      "duration": "Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3be3e8",
      "summary": "Teardrop shape, hazy aura, like an LED light from my view about the size of a human fist.",
      "city": "garland",
      "shape": "teardrop",
      "date": "2012-08-05T00:00:00",
      "story": "teardrop shape, hazy aura, like an LED light from my view about the size of a human fist. I was driving home from work coming southbound on Arapaho Rd to the intersection of Beltline Rd. I made a left headed East and once I pasted Brand Rd. to my left there was a bright light that came out of nowhere.  I lit up the sky in a blue,white light and it had an haze around it.  I thought is was a flare or left over firework but it went down and then came up and I saw a small tail behind it.  I was waiting on a sonic boom or engine or rotor sound as it past over my car but there was no sound.  It flew over my car and headed in a southeast direction.  I looked behind me and didn't' see it again.",
      "link": "http://www.nuforc.org/webreports/091/S91399.html",
      "state": "TX",
      "duration": "4-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf42b",
      "summary": "Two lines of 5 to 6 ornage flickering craft moved in tandem non formation across sky.",
      "city": "garland",
      "shape": "oval",
      "date": "2013-05-15T00:00:00",
      "story": "Two lines of 5 to 6 ornage flickering craft moved in tandem non formation across sky. On April 13th at as close as I can determine at 9:45 pm traveling on George Bush Fwy in the Garland city limits near the intersection of Garland Ave. I saw a line of lights traveling in a semi formation. There were 5 to 6 objects traveling together in a random line at different distances from each other. They were not traveling in a close organized formation but were all traveling together in the same direction coming across in front of my westerly driving direction moving in a line on a North by Northwesterly direction. I pulled the car over and attempted to get my Galaxy S3 out and trained on them to begin videoing. Unfortunately the last setting on my camera had the camera facing me. By the time I adjusted the camera to face away and set to video the objects they had turned a more Westerly direction and moving away from me. The caught my attention as unusual because they appeared to be orange and flickering as a constant light source. They did not have the red and white normal aircraft lights blinking at a consistent way. The light they emitted gave the appearance of a flickering flame. This is barely distinguishable in the video I did get but it is discernible if you know that's what I saw. Unfortunately also my lack of use of the video application on my phone also affected what I got, because it was on when I thought was off, and off when I thought it was on. I did not successfully capture any video on the first line of objects as they moved away. I had been sail racing the whole day so I was well aware the wind was still about 8 to 10 miles per hour coming from the South maybe slightly Southeasterly. The objects seemed to by flying similar to the height and speed of helicopters. So they were very low seeming for aircraft but higher than a typical traffic or police copter, and fairly fast similar to the speed of a fast moving helicopter such as care flight as it would pass over. As I watched the line move away over the city of Plano I turned to get in the car and amazingly another line of objects of the speed, height and constant orange flickering nature were heading directly in my direction. Again there were 5 to 6 or maybe more in the group. They were traveling Southwesterly. This is when I struggled to get my video going again and thought it was on when it was off and off when it was on. As one passed directly over me the underside of one of the objects appeared oval as if the light was refracted as a lens would do. The distinct sound of helicopters was not present as they are obviously very loud and discernible but again this is exactly the height and speed it seemed fast moving high flying helicopters would be moving. It is possible that they could have been larger and higher and just gave the feeling this is the altitude they were flying but I'm pretty certain of my perception. It did seem there was engine noise above the traffic noise but sub! tle and not so obvious. The video I did capture was by accident and you can see the orange flickering effect somewhat out of focus and a couple times focus in and appear white and turn two distinct dots. Visually they never appeared white to me but the video does. The other interesting thing about the colors is that two distinct separate flying objects change color in synchronization. Therefore the color change could be attributed to the low quality camera phone video.. The video I did get was the last one I attempted so it was of the second line moving away from me and probably about already 4 to 5 miles away. I am a Real Estate Broker business Owner in Dallas, Texas",
      "link": "http://www.nuforc.org/webreports/097/S97172.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c00a9",
      "summary": "Possible fireballs in the sky that burned out over our house.",
      "city": "garland",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Possible fireballs in the sky that burned out over our house. We were looking out side as we walked our dog and saw 10 or more orange lights in the sky.  They seemed almost like air planes but there was no sound and no other lights.  I did get a couple of pictures.   As we were watching them they went over our house and began to burn out.  They were all on fire.  I have never seen anything like this before.   I looked it up on line to see if anyone else had seen or reported this but no one had so I thought that I would. Thanks. ((NUFORC Note:  We suspect an evening sighting, and have changed the time above to reflect that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101627.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0685",
      "summary": "Two of us saw large round light - donut shaped, I saw it as white/light blue, my friend saw it as being green. It was in the north sky,",
      "city": "garland",
      "shape": "circle",
      "date": "2012-12-20T00:00:00",
      "story": "Two of us saw large round light - donut shaped, I saw it as white/light blue, my friend saw it as being green.  It was in the north sky, moving downward then suddenly disappeared, it was a clear night.  No sound was heard, it did not appear as a machine but an unusual glow of emitting light was from it.  It only shown for a few seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95227.html",
      "state": "TX",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c09cb",
      "summary": "6-8 orange/yellow circles hovering in a zigzag formation.",
      "city": "garland",
      "shape": "circle",
      "date": "2013-11-11T00:00:00",
      "story": "6-8 orange/yellow circles hovering in a zigzag formation. Me and 3 witnesses were driving by, we are all down to earth intelligent people and all saw the same thing, we arnt crazy!  And we were sober!  And saw 6-8 orange/yellow circle lights hovering In a zigzag formation.  We saw it for 10 min.  Before we drove by.  They weren't moving  at all and out minds were blown!",
      "link": "http://www.nuforc.org/webreports/103/S103674.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b94",
      "summary": "Glowing orange lights in sky.",
      "city": "garland",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "Glowing orange lights in sky. Strange lights in the sky glowing orange flying around each other.  Clouds where in the sky, it us unknown if they disappeared or flew into the clouds.",
      "link": "http://www.nuforc.org/webreports/103/S103641.html",
      "state": "TX",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17dc",
      "summary": "UFO sighting near Laprada and 635 Garland Texas 7-13-2014 around 9 pm.",
      "city": "garland",
      "shape": "triangle",
      "date": "2014-07-20T00:00:00",
      "story": "UfO sighting near Laprada and 635 Garland, Texas 7-13-2014 around 9 pm My dad and I were taking a walk.  Our location was near 635 and Laprada.  It was west of us. It had 3 white lights on each corner of the triangle and a green light in the middle.  We watched it for about 15 minutes and than it took off North very fast it like turned itself invisible as it accelerated.  I am only 12 years old and now I believe in UFO's.  My neighbors were driving down the street and saw it also.   My mom and my other brother saw it to.   They exist, people.",
      "link": "http://www.nuforc.org/webreports/111/S111500.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c18bd",
      "summary": "Garland Texas 7-13-2014 Ufo spotted near laprada and 635.",
      "city": "garland",
      "shape": "rectangle",
      "date": "2014-07-20T00:00:00",
      "story": "Garland Texas 7-13-2014 Ufo spotted near laprada and 635 At 8:30, my son and I were walking near Laprada and 635 this craft was only a 100 feet off the ground.  It was triangular shaped with 3 white lights, and a green light in the middle.  It cloaked itself and took off at a very high speed and disappeared.  A neighbor that was near saw it also.   So we were not losing our minds at what we saw.  My name ((male's name deleted))  I don't care if you know my name.   I did not believe they existed, but oh yeah they are here people.   And my question is why they hide like that.  Anyone  else seen the same thing contact me at ((address deleted)).   Thanx",
      "link": "http://www.nuforc.org/webreports/111/S111485.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c18ea",
      "summary": "Intense bright white light.",
      "city": "garland",
      "shape": "diamond",
      "date": "2014-07-20T00:00:00",
      "story": "Intense bright white light. A bright light like HD flighing at a very high speed from south to north for about 30 seconds and suddenly disappear in front of my eyes at a high speed.",
      "link": "http://www.nuforc.org/webreports/111/S111512.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a20",
      "summary": "UFO spotted near Laprada and 635 7-13-2014.",
      "city": "garland",
      "shape": "triangle",
      "date": "2014-07-20T00:00:00",
      "story": "UFO spotted near Laprada and 635 7-13-2014 My son and I were sitting in the front of our house near Laprada and 635.  When we looked up and saw a triangular shaped object with 3 white lights and a green light in the middle. Flying west to north very slowly for awhile.   Than it took off at very high speeds, disappearing.   It was amazing.",
      "link": "http://www.nuforc.org/webreports/111/S111499.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c27e8",
      "summary": "3 pulsating lights in a triangle formation, moving fast with a fourth, identical light to the bottom-right of the three.",
      "city": "garland",
      "shape": "formation",
      "date": "2014-10-10T00:00:00",
      "story": "3 pulsating lights in a triangle formation, moving fast with a fourth, identical light to the bottom-right of the three. I stopped at a stop sign and recorded them, they were moving quickly in my direction.  They began changing formation, but someone was coming up behind me, so I had to start driving, and lost sight of them before I could pull over again. They seemed to be heading North, from where I could see them, they'd have been over South Garland or Mesquite before losing sight of them.   By now, they're probably in Oklahoma from how fast they were going. I got poor cell phone video of it: http://goo.gl/up7nHx",
      "link": "http://www.nuforc.org/webreports/114/S114216.html",
      "state": "TX",
      "duration": "1+ minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c281c",
      "summary": "Multiple reddish colored objects moving in a single-file path from southeast to northwest while gaining altitude.",
      "city": "garland",
      "shape": "unknown",
      "date": "2014-11-06T00:00:00",
      "story": "Multiple reddish colored objects moving in a single-file path from southeast to northwest while gaining altitude. At approximately 7:20 p.m. on October 29, 2014, I was at the intersection of North Garland Road and Beltline Road in Garland, Texas.  I was in a parking lot, looking south.  I observed multiple objects emitting a red colored light.  The objects would originate from low on the horizon, and travel from the southeast to the northwest while gaining altitude.  So, from my vantage point, the objects were moving from left to right and upward.  Note that, if these were conventional aircraft, they would have shown a green light, as I was observing the starboard (right) side of the craft.  The objects appeared one or two at a time, and followed the same path as the previous.  I observed several of these red light objects originate low in the horizon and move upward and to the right along the same path in the sky, over the course of approximately 1 minute.  The objects were consistent in size and velocity with conventional aircraft, which were also visible in the sky f! rom my location (urban area) however, as previously mentioned, the coloration of the light was not consistent with conventional aircraft.  The light was reddish in color and had a pulse at a relatively low frequency, also some white light was visible within the red light emitted.  The objects were at a distance such that I was not able to observe their exact shape.  I was unable to detect any sounds from the objects, as the urban area was noisy at that time in the evening.  Also, each of the objects would apparently gain altitude until it appeared as a small pinpoint of light in the sky (star).  Two other witnesses observed the objects after I pointed them out in the sky.",
      "link": "http://www.nuforc.org/webreports/115/S115147.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c41a3",
      "summary": "Triangle UFO Lake Ray Hubbard.",
      "city": "garland",
      "shape": "triangle",
      "date": "2015-04-17T00:00:00",
      "story": "Triangle UFO lake ray hubbard. So this was on a cool evening right before fall.  Me and my GF at the time went swimming..  In the evenings, when it's a little cooler, we would wait for the outside AC units to turn on before getting out of the pool..  The AC units would blow warm air out and keep us warm as we hopped from one another till we got home.   Anyway, we are in the pool and I hear what sounds like an AC unit cut on.  I look around and don't see any of the fan's moving..  I don't remember why but I looked up to see 3 bright lights in a triangle formation hovering above us..   We both seen it than looked at each other, before I bolted out of the pool area leaving her behind (I know, I know...I was only 13 at the time).   Last time I spoke to her was probably 15 years ago and she remembers the story exactly as I do.   Lots of weird things out by Lake Ray Hubbard. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118464.html",
      "state": "TX",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4aed",
      "summary": "Shooting Star?",
      "city": "garland",
      "shape": "unknown",
      "date": "2015-10-02T00:00:00",
      "story": "Shooting Star? I live in Garland, TX, a Northeastern suburb of Dallas County.  I was sitting in my patio, facing North. I sit out there and enjoy a cigar a couple of times a month. It was approximately 8:00 P.M. and I had just taken a puff of my smoke and tilted my head back to exhale.  As I did, I saw what I thought was a \"shooting star\", going North.  I have seen meteors/shooting stars on many occasions and thought no different.  I could distinctly make out \"flames\" on this and thought I had a great view of a meteorite streaking across the evening sky. The \"flames\" diminished and I could see something that looked like a star, moving across the sky. From my vantage point it looked like a star, except that it was moving.  I then saw another \"star\" coming from the other direction, heading South.  This object was perhaps a little brighter than the North-bound \"shooting star\". The two star-looking objects came together and slowly faded out. I do not believe they were stars. I called The National UFO Reporting Center immediately. End of Report.",
      "link": "http://www.nuforc.org/webreports/122/S122417.html",
      "state": "TX",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5585",
      "summary": "Vibrant White Flashing Sphere Moving Erratically.",
      "city": "garland",
      "shape": "sphere",
      "date": "2016-07-08T00:00:00",
      "story": "Vibrant White Flashing Sphere Moving Erratically ((NUFORC Note:  We are unconvinced that this is a serious-minded report.  Possible hoax, we believe.  PD)) Observing the stars with one of my friends when we looked into the Northeastern sky at about 45 degrees.  We both see a large spherical light moving erratically through the sky about a quarter mile from us.  It was flashing but with no pattern or timer just random flashes at different delays.  It flashed with some intensity almost like a high power strobe flash or led.  It stuck around for close to 2 minutes before the light faded out and then with a larger flash disappeared.  There was no sound, no wind, no visual cause of the light it just seemed to appear with a quite literal flash.  I attempted to film the Phenomena but was un able to get decent footage of the sighting.  Animals acted very strange in the are having a large flock of birds take flight during the ordeal and then landing after the object was gone.",
      "link": "http://www.nuforc.org/webreports/128/S128074.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6cc6",
      "summary": "Bright light larger and brighter than anything in sky.  stationary google christmas star..thats it  ((NUFORC Note:  Venus?  Anon.  PD))",
      "city": "garland",
      "shape": "light",
      "date": "2016-12-30T00:00:00",
      "story": "bright light larger and brighter than anything in the sky. stationary google christmas star..thats it i went out at 1840 pm to have a smoke and noticed a big bright light in the southwest sky.  I first thought it was a aircraft of sometime but it wasnt moving. i watched it for 7-10 minutes and it was stationary in the sky.  This light was huge compared to stars and other lights in the sky. I put my little finger on my right hand over the light to try and gauge its size.  The lights size was that about halve the size of a pencil eraser.  It was very bright and to be honest the closest thing I could compare it too and i know this sound hokey but it's shape reminded me of \"the star of Bethlehem\"...just a big bright light with a four point star look.  I came inside house to grab camcorder and it's battery was dead so i started charging my camera.  I then went to google and googled astronomy events and all i could find was that Jupiter was near waning crescent moon at 1am this morning.  I could find nothing about what I was seeing.  I went back out and watched some more and it was just a big stationary light. At no time did i think this was a Helicopter as I see those all the time with there spot lights on.  Since it was dark I couldnt tell if this was a celestial or terrestrial light...i believe it was celestial.  I came back outside at 1950 and the light is completely gone!! it is just gone...we do have some clouds but I can still see the stars that are much dimmer than this light in the southwest sky.  I have no idea what I saw. I wanted to submit this report in case someone else witnessed the same thing.  I just googled star drawings and the image that fits what I saw is the \"christmas star\"...that's the closest i can describe for you.",
      "link": "http://www.nuforc.org/webreports/131/S131913.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c767b",
      "summary": "After a few minutes of standing outside with them, both of them and I looked up and saw it as it flew off.  ((anonymous report))",
      "city": "garland",
      "shape": "oval",
      "date": "2018-01-12T00:00:00",
      "story": "Was letting my dogs outside and after a few minutes of standing outside with them, both of them and I looked up and saw it as it flew across the sky and out if sight behind some trees.",
      "link": "http://www.nuforc.org/webreports/138/S138110.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8381",
      "summary": "Two V-shaped patterns of discs in broad daylight.",
      "city": "garland",
      "shape": "disk",
      "date": "2018-09-27T00:00:00",
      "story": "Two V-shaped patterns of discs in broad daylight. Day time sighting – Garland, UT.  I was sitting outside in my lawn chair and noticed a “V” formation of white objects coming slowly from the North West.  At first I thought they were birds until they were in a direct North position.   I went in the house and grabbed my 10-30X60 Zoom binoculars and went back out to take a look.  Observation:  A “V” shaped pattern of 20 craft moving slowly to the South East.  Through the binoculars I could see that they were Disc shaped and very reflective, I observed them until they crossed the East Mountains and went out of sight.   I turned back North and observed a Very Large jet moving slowly in the same direction, once again, with binoculars, I could see that there were no markings at all, it was pure white, had no windows and made no sound.  While observing the jet, another formation of 20 craft was coming from the north.  I watch as they slowly turned South East in the same direction as the first group and the jet and watched until they too went behind the East Mountains.   The entire event lasted between 5 and 10 minutes.  Unfortunately, no video or camera was available.   Others must have seen this, most of the event was visible to the naked eye.",
      "link": "http://www.nuforc.org/webreports/143/S143163.html",
      "state": "UT",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9713",
      "summary": "Fleet of bright lights.   ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "garland",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Fleet of bright lights I was taking my son to work this morning at 5:30 and as i was walking to car i looked up and saw at first what i thought was just stars as i watched i realized they were moving i went in and got my son a just to make sure i wasn't seeing things and he saw it also they were in a straight line just guessing there were 20 and then 2 side by side then some more in a straight line and 2 side by side and a few stragglers but they were all headed the same way i am still at a loss for words i am sorry i have no pics be i will be ready if it happends again",
      "link": "http://www.nuforc.org/webreports/151/S151011.html",
      "state": "TX",
      "duration": "5 minutes"
    }
  ]
}