{
  "city": "gilbert",
  "fetch_timestamp": "2025-07-12T14:36:10.171300",
  "record_count": 81,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4b1a",
      "summary": "Cluster of blue lights heading east from south Chandler area to past south Gilbert area towards and beyond Queen Creek.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2019-06-20T00:00:00",
      "story": "Cluster of blue lights heading east from south Chandler area to past south Gilbert area towards and beyond Queen Creek. Cluster of 6 very bright blue lights heading from west to southeast, followed shortly by one more.  Camera only picked up the bright blue lights, but visually I saw what looked like a balloon or some other object with the blue light hanging below it, maybe 20-50 from a cable feet.   Could be a school or festival event, but the object were traveling far faster than cars on a freeway.  Light breeze, but objects were traveling at least 60 Mph if not faster.  No sound from the lights.  Passed overhead maybe at least 200 feet.",
      "link": "http://www.nuforc.org/webreports/146/S146690.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f3e",
      "summary": "On the night of April 13th or very early April 14th at about 2 am some unexplainable events began to unfold.",
      "city": "gilbert",
      "shape": "triangle",
      "date": "2019-04-18T00:00:00",
      "story": "On the night of April 13th or very early April 14th at about 2 am some unexplainable events began to unfold. First, my wife woke me up because while out on a drive she noticed a bright light in the sky, similar to a star, but slightly brighter...this thing was moving back and forth, up and down, a figure 8, just erratic.  Not super fast usually, fairly subtle mostly to the point thay when I first looked I didn't notice. So, I blow it off and start talking and looked away and she insists I look again.  When I looked back it truly WAS moving erratically!  I could not think of any possible thing that would move like that.  As I stare in awe I begin to adjust my eyes and notice at least 6 other lights but these ones were slighter dimmer than the stars.  They were darting back and forth it seemed!  I pulled my phone out hoping I could use the zoom to see better what was going on.  My phone camera wouldn't pick up the stars or the dimmer lights I mentioned but clear as day you can see the larger light in the sky on the camera.  I have video.  Through the phone camera zoomed at 8x(max) it looked like it was spinning, like looking through glass, and pulsed every once in awhile which in the video seemed to make it disappear for a couple seconds every 15 seconds or so. It stayed in the sky for hours drifting slightly to a different spot of the sky over time and continually moving in unexplainable ways. If I had only seen this, as weird as it was, I would not report it.  However, while this was happening and we're staring at the sky at about a 45° angle, we witnessed something completely unexplainable and in my mind worth reporting. The sky seemed to have gotten darker out of nowhere...we both felt \"weird\" and hard to explain but it felt like a void, and a temporary breathlessness.  I had the urge to look up because it looked like something was going to fall on us. It appeared of nowhere and I almost wanted to move out of the way.  Then it just floated there for a second like a blimp flying.  It looked like 5 engines or cylinders all attached and white or silver in the shape of a V.  It didn't make a sound and was either car sized or jet sized. It was hard to tell how far up it was because it was so fast and scary.  It honestly was more like an absence of sound and then it took off at unprecedented speed after gliding or hovering for 5 seconds or so. Our best guess as crazy as I know it sounds...is that a portal opened up and a ship came through.  I had chills.  I would have never heard it if I hadn't seen it and wouldn't have been looking without seeing the star looking ufo's so I feel like it must be connected but idk.  I just don't want to feel like i'm crazy so I need to report it.  My wife saw all the same stuff and felt the same way at the moment that this ufo appeared.  We wont ever forget what we witnessed.",
      "link": "http://www.nuforc.org/webreports/145/S145708.html",
      "state": "AZ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b51fb",
      "summary": "Bright red lights dropping smaller lights",
      "city": "gilbert",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "Bright red lights dropping smaller lights Unfortunatly I don't remember the exact date, however I know it happened right after I had moved in to my apartment late March/early April 2000.  My younger brother was standing on the balcony of our apartment located on Country Club just south of Baseline Rd in Gilbert, AZ and he yelled to us that there was something going on in the sky to the southeast.  Upon going outside, there appeared to be 3-4 red lights in the sky, and it looked like they were dropping other smaller lights. We only witnessed this going on for approx 10 minutes before the lights disappeared. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51929.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b88",
      "summary": "Qualified witness observes three lights maneuvering strangely in the western sky.",
      "city": "gilbert",
      "shape": "",
      "date": "2007-04-27T00:00:00",
      "story": "Sept. 19, 1982 at approximately 7:00pm EST Gilbert, WV 25621 (on Browning Fork Road near Katy Fork)   Background information on the observer: I am a private airplane and helicopter pilot.  I am a self-educated software engineer, and I now own a software development company based in Austin, Texas, developing high-speed machine vision systems for clients all over the U.S.. Description:  A formation of 3 lights, appearing in the sky above a ridgeline, with mechanical and precise motion. I was in my backyard after carrying several buckets of coal to the basement for our fireplace.  I was looking westward along a mostly flat ridgeline approximately 7 miles away.  From the north end of the ridgeline, noticeably well above the ridgeline itself (i.e. in the sky), a single light emerged, moving at a relatively slow speed.  Once it had moved along for a few seconds, a 2nd light appeared in trail behind it, emerging from the same location the first one had. The lights continued to move southward, in lock-sync, above the ridge until approximately halfway across.  At that point the lights stopped, in a very odd, mechanical fashion (i.e. there was no deceleration, just instantaneous cessation of movement) and immediately a 3rd light appeared from \"behind\" the southern-most light and stopped at a symmetrical point with the other 2, forming 3 lights in a straight line and spaced equidistant from each other. The lights sat there motionless for approximately 10 seconds.  At that point, the new light continued southward, and the original 2 lights retraced their original path northward, and all disappeared behind neighboring hills.  The motion again was completely mechanical; instant acceleration and completely synchronized. The lights themselves were single-point white lights, with no other observable characteristics. ((personal data deleted)) ((NUFORC Note:  We spoke with this witness via telephone, and he seemed quite sober-minded to us.  That fact, combined with his technical background, suggests to us that he probably is an excellent witness.  He provides a diagram, which shows the motion of the objects he witnesses.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56425.html",
      "state": "WV",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b62d4",
      "summary": "1995 Phoenix SE Valley \"shooting star\" turns 90° and crosses sky in couple of seconds.",
      "city": "gilbert",
      "shape": "unknown",
      "date": "2008-02-14T00:00:00",
      "story": "1995 Phoenix SE Valley \"shooting star\" turns 90° and crosses sky in couple of seconds. I stepped out onto my patio around 10 pm because I'd heard there was to be a bit of a meteor shower and I wondered if I could see any of it from my somewhat rural location.  The sky was full of stars but I wasn't seeing much in the way of shooting stars, so after a few minutes I was ready to give up and go inside. That's when I noticed a star moving very fast from east to west across the sky. By my estimation it could have crossed the entire sky in 5 or 10 seconds. At first I thought maybe it was a satellite.  I've never seen one before but it just popped into my head that must be what this is, and I remember feeling a bit proud of myself for figuring it out.  At least that seemed like a pretty good guess until it got about 75% across the sky moving due west when it suddenly turned north and just took off so fast it was across the sky in a couple of seconds and gone. I don't know much about space but I don't think satellites can turn or move like that, so for me - this was a UFO.  It was flying and I couldn't identify it, put it that way.  Like probably millions of people, I never told anyone about it.  It's not dramatic or exciting but sometimes I wonder how different the world view would be if everyone who's seen a UFO would submit a report and I couldn't keep refusing to report my sighting with that thought in my mind.  Date and time are approximate, sorry but it was over 10 years ago now. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61254.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b63d0",
      "summary": "huge blue comet like light falling to earth",
      "city": "gilbert",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "huge blue comet like light falling to earth I was driving home from work.  I saw a huge blue light fall to the earth.  It was very large, looked like comet with a tail.  It scared me, because I was sure it would cause damage and I waited for the impact, but it never came.  ???   Did anyone else see it? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information. PD))",
      "link": "http://www.nuforc.org/webreports/060/S60443.html",
      "state": "AZ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b785a",
      "summary": "Strange objects traveling through sky",
      "city": "gilbert",
      "shape": "unknown",
      "date": "2007-02-24T00:00:00",
      "story": "Strange objects traveling through sky I was driving to work on a sunny clear skied day when I noticed 2 objects in the SE sky at a very high altitude and seemed to be very far away compared to the commercial aircraft I could also see flying quite high in the same general vicinity but much closer. The objects were paralell to one another but yet one seemed to be traveling in a downward path and the other one up. Both had a wide short tail following them. I say wide in comparison to the comercial aircraft that were also flying the skies that day, it made them look very small. After about 5 minutes or so the obect on the left made a fast hook-like motion leaving a trail and they both disappeared.",
      "link": "http://www.nuforc.org/webreports/055/S55195.html",
      "state": "AZ",
      "duration": "7 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b81e6",
      "summary": "Gilbert, Az. 09/13/09  11:30pm",
      "city": "gilbert",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "Gilbert, Az. 09/13/09  11:30pm September 13, 2009 we arrived at home about 11:05pm due to recent burglaries to the home we have surveillance recording during the times we are gone.  Somewhere between 11:20-11:40pm as we sat down in front of the television suddenly seen a flash of light move very fast across the screen thinking it was a car, we were shocked as to how fast it was moving.  At this point, we stopped recording and started to back track, in order to see what kind of car it was. As we watched and slowed down the footage we had seen a speeding light.  It clearly looked to be two ships swooping down our street. I have never seen anything like this before. This sighting was amazing in a scary sort of way.  We have saved the footage if needed please contact for release this is no hoax.",
      "link": "http://www.nuforc.org/webreports/072/S72276.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8591",
      "summary": "Observed nine circles, NW of Queen Creek, over Chandler. They went from a box formation to triangle formation.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "Observed nine circles, NW of Queen Creek, over Chandler. They went from a box formation to triangle formation. This is for cross reference purposes to note more than one witness to this visual:  Description: My daughter called me stating that the local radio, 97.8 FM (website has audio recording of it) is talking about 11 to 16 disks in the sky above Chandler (she was driving to work and couldn't see). I went out my front door talking to her and initially looked in the direction of Chandler, NW, to try and see what she was talking about. Didn't see anything and joked with her about needing to drive into Chandler to try and observe what the radio was talking about. Said good byes. I then went back out and leaned on my Honda roof and slowly started to scan the sky in the direction of Chandler. I then came across 2 white/shiny disks/orbs at about a 35degree angle. They were side by side with about a pinky width between them. I then continued scanning the skyline, due to the reported 11 to 16, and ended up observing 7 more white/shiny orbs/disks at about a 45 degree angle that stuck out against the clear blue sky. This second set of obrs/disks were in 2 groups. One group of three were in a triangle pattern while the other was in a box formation (one orb/disk in each corner of a \"box\" and a \"triangle\" formation. Ran in and told my wife (which she just laid there) and then grabbed the camera and proceeded to take 40 pictures with my Vivitar, vivicam 5386, 3x zoom f=5.4-16.2mm. By this time my wife walked out to see what I was talking about (her eyes were still adjusting to waking up, and didn't see anything). She advised I should wake up my 8yr old to have her come look. During the whole time of observing, I was quit elated that I FINALLY got to see things in the sky. My eyes kept feeling wierd, trying to adjust on such small objects. (photo attached, zoom into the bottom center of the picture, right of the date). Case Number: 17222 MUFON Log Number: US-05282009-0025 Status: Assigned Longitude: -111.851 Latitude: 33.2901",
      "link": "http://www.nuforc.org/webreports/070/S70488.html",
      "state": "AZ",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b89bb",
      "summary": "HOVERING  LIGHT IN THE SKY.",
      "city": "gilbert",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "HOVERING  LIGHT IN THE SKY. I WAS LOOKING OUT THE WINDOW SOUTH I SAW A BRIGHT SHINING LIGHT SITTING STILL A LITTLE BEYOND SAFEWAY IN THE MIDDLE OF THE EVENING SKY.  IT WAT STAYING STILL FOR FIVE SECONDS IT LEFT HEADING SOWTHWEST. WHEN IT LEFT IT LEFT A SHINING SILVERY STRIPE BEHIND IT.  IT LEFT IN A INSTANT.",
      "link": "http://www.nuforc.org/webreports/070/S70675.html",
      "state": "AZ",
      "duration": "6-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ad8",
      "summary": "UFO seen dancing in the Eastern Arizona sky on 5/15/09.",
      "city": "gilbert",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "UFO seen dancing in the Eastern Arizona sky on 5/15/09. I arrived home and stepped out of my car and instantly noticed a bright light off in the far East.  It was moving from right to left in downward slant and disappeared out of view behind a neighbor’s house.  I initially thought it to be a falling/shooting star, but then it rose again above the house.  The light was far brighter than the planet/star that was also present in my view.  The light almost had a blue/white hue to it.  The light then continued to drop and rise in an extremely fast motion, followed by left to right motion, loopy motion, and more up and down motions, constantly appearing and disappearing out of my view because of the house. I ran in to get a camera; unable to find one, ran back out to find it still making the motions in the sky.  After calling a family member to find the camera I ran back in to get the camera, came back out and it was out of sight.  I stayed waiting outside when it appeared again, but staying still.  The light then grew in brightness/intensity.  While trying to find it in my camera screen, it disappeared.",
      "link": "http://www.nuforc.org/webreports/070/S70055.html",
      "state": "AZ",
      "duration": "3 min."
    },
    {
      "_id": "64d005f478aba2ec5a3ba1cf",
      "summary": "Gliding silent set of lights over Gilbert, AZ.",
      "city": "gilbert",
      "shape": "unknown",
      "date": "2010-02-14T00:00:00",
      "story": "Gliding silent set of lights over Gilbert, AZ. 2/08/10 I took a break from work and walked outside the building at approx 8:22pm.  Building is located at 459 n Gilbert Rd in Gilbert, Az.  I saw in the north area of the sky, over the apartment building across the street a set of lights. There were two steady white lights with blinking red light equidistance in between them.  The red light was smaller than the two white lights and appeared to flash off something metallic or silvery in color when it was blinking.  The object was about the size of my thumb to the second joint held horizontally at arm’s length, that was the width of the object.  There was absolutely no sound.  The object moved in a slow and gliding motion towards the west and slightly northwest.  At first I thought it might be a plane, but it had no flashing red and green wingtip lights and no sound.  Also the lights didn’t look like a helicopter and again there was no sound and it had that gliding motion.  I lost it behind the trees, it was that low and then caught a glimpse of it again further away and more to the west and slightly northwest but then lost it again behind the buildings. I did not see it emerge from behind the buildings so it may have turned more northerly or it may have descended even further.  I went back into my workplace.  The entire sighting took no more than 2 minutes I would guess…maybe 3 tops.",
      "link": "http://www.nuforc.org/webreports/074/S74324.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba35c",
      "summary": "my son called me @ 0545 he said woman on radio 104.7 reported 17 ufos over gilbert and just hovering and changing positions. I work in",
      "city": "gilbert",
      "shape": "oval",
      "date": "2009-06-09T00:00:00",
      "story": "my son called me @ 0545 he said woman on radio 104.7 reported 17 ufos over gilbert and just hovering and changing positions.  I work in the area and i observed 11 craft for appox, 2hrs. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  No photos taken, to the best of our knowledge.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70237.html",
      "state": "AZ",
      "duration": "2 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3ba759",
      "summary": "a white glowing covering my entire street in gilbert arizona",
      "city": "gilbert",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "a white glowing covering my entire street in gilbert arizona I went to the store around the corner as i came back on my street from the store i realized my street was lit up as i looked up it went away and could see clear as night i called the ufo center asi was talking to them it came back but you could see a red glowing flashing light and a blue glowing flashing light in the middle and then it completely vanished i also contacted the Gilbert Arizona Police department and they claimed there were two other sightings in my city near my home",
      "link": "http://www.nuforc.org/webreports/066/S66456.html",
      "state": "AZ",
      "duration": "3-4 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bac57",
      "summary": "An alternating red and blue lighted object, bobbling rapidly and erratically in the sky and then descending  in a controlled fashion.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "An alternating red and blue lighted object, bobbling rapidly and erratically in the sky and then descending  in a controlled fashion. We saw a red object in the sky, that started as a smooth arc to the east.  Then the object began to bobble, shifting positions quickly and erratically, left to right, up and down.  At one point the light turned to blue and then changed back to red.   Colors changed intermittently from red to blue several times.  Then it displayed both red and blue and slowly and controllably descended out of the field of view in a straight line.  The lighted object was much larger than traditional airplane lights, approximately 1/8th the size of the moon last night.",
      "link": "http://www.nuforc.org/webreports/078/S78373.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bac14",
      "summary": "My father and I witnessed 4 stationary disc shaped objects in the sky for around 6 minutes until they vanished.",
      "city": "gilbert",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "My father and I witnessed 4 stationary disc shaped objects in the sky for around 6 minutes until they vanished. On Saturday October 9, 2010 in Gilbert AZ I was outside playing with my five year old nephew when I looked up in the sky to see what appeared to be a star in the sky. It was around 5:38 PM and I thought that this was odd because the sun wasn’t to set till about another 20 minutes at 6:01 and the sky was clear blue with plenty of sunlight.  I thought it might be a planet so I ran inside to get the binoculars. I came back and located it again as it was the only odd light in the sky. When looking through the scope it appeared to be a circular disc-like object that had a weird reddish light mixed with white light around it that appeared to be changing color. It was stationary and did not have the blinking lights of a plane. I then ran inside to get my father and we got another set of binoculars. I couldn’t find the first object that I saw as it had moved. We then saw four distinct lights in the south southeast sky that had the same appearance as the first.  All four of them were stationary without blinking lights of a plane or movement of a satellite. With the naked eye they looked like faint stars in the sky but once again this was very odd as it was blue sky and before the sunset.  When they were magnified with the binoculars we both were able to see circular disc-like objects. I saw the same red and white lights that were around the first one almost like an orb or aura and appeared to change colors. My father only saw white lights when he looked but clearly saw the circular disc shape of the objects as I did. Three of the objects were in a line and the fourth was up and to the right of the other three. The objects stayed in the sky for around five to six minutes and then they were just gone! . I checked my cell and it was 5:45 PM still 16 minutes before sunset. If they were stars or planets they would have gotten brighter as the sunset occurred but this was not the case as they vanished after observing them for six minutes. They were not a plane or satellite because they did not move or have the blinking lights.",
      "link": "http://www.nuforc.org/webreports/078/S78271.html",
      "state": "AZ",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb157",
      "summary": "object moved in circles and had green and red lights that created star burst or arrow looking signs moving slowly",
      "city": "gilbert",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "object moved in circles and had green and red lights that created star burst or arrow looking signs moving slowly never saw anything like this before. Less than a few hundred few from ground sounded like a helicopter but move oddly and had star burst light of green & red making very different types of signs from arrows to star burst. it circled my over my home a couple of time and then headed north east. It lasted at least two to three minutes.",
      "link": "http://www.nuforc.org/webreports/078/S78728.html",
      "state": "AZ",
      "duration": "couple of minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb459",
      "summary": "Four orange objects move across the sky in Gilbert, Arizona, before disappearing one by one.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2011-01-31T00:00:00",
      "story": "Four orange objects move across the sky in Gilbert, Arizona before disappearing one by one. Me and my kids were driving and four round bright orange/red lights swiftly moving across the sky caught my eye.  I was amazed and my kids looked up to see what I was looking at and they were also amazed.  There were four bright lights, which seemed to be round.  They traveled across they sky in a group and then they came to a stop.  They stayed in the sky for about a minute or less then gradually, one by one, they started to dim until each one disappeared.   I have a picture but it was much clearer in person.  When I zoom in on the picture, they look like orange upside down question marks without the dot.  One of them looks white because it is disappearing but it is the same shape as the other three.  It was night time and they seemed to be as high up in the sky as stars but they were bigger than stars. ((NUFORC Note:  We spoke via telephone with this witness, and she seemed to us to be a quite sober-minded person.  Please see other reports from Illinois and Minnesota, for the same date.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79693.html",
      "state": "AZ",
      "duration": "2 - 3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb614",
      "summary": "2/3/2011 Gilbert AZ  shaped disc with glowing dim redish light  few seconds",
      "city": "gilbert",
      "shape": "disk",
      "date": "2011-02-08T00:00:00",
      "story": "2/3/2011 Gilbert AZ  shaped disc with glowing dim redish light  few seconds I was driving in my car and I noticed a hazy redish light glowing but dim that is what caught my eye. (Not like a helicopter red light)  The shape reminded me of a womens large rimmed hat the craft must have been tipped because I saw the top that is where the light came from.  I did a u-turn I wanted to get a better look or follow it.  It was gone?    Then when I got on the 205 freeway I noticed large glowing orbs of light that dissapeared.  I thought maybe its foggy out?   But its it a clear night and this is Arizona we are not known for fog.   This totally looked like what I'v seen in drawings.   I don't know if anyone else saw this but its not the phoenix light thing at all. This was a ufo and it was fast it vanished! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79926.html",
      "state": "AZ",
      "duration": "second"
    },
    {
      "_id": "64d005f478aba2ec5a3bbde6",
      "summary": "Star-like spheres for past few weeks consistant every night.",
      "city": "gilbert",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Star-like spheres for past few weeks consistant every night. For the past 3 weeks between the hours of 8:30 pm to 10:30, we have been witnessing an object which is very bright and within our atmosphere appears \"star like\" or \"sun like\" with a round white bright center and rays protruding from it. It makes no noise at all and travels not as fast as a satellite much higher in the sky.  They have been moving West to East and you can view them for about 5 minutes when they start losing their brightness and then gently disappear from view.  We had watched 2 in one night, one moving West to East and then another moving North to South within a half an hour apart.  They've been consistent every night though the time of their arrival changes.",
      "link": "http://www.nuforc.org/webreports/083/S83550.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc517",
      "summary": "A strange bright sphere was moving in all directions but in short bursts, a beam of light came out of the object and it dissapeared.",
      "city": "gilbert",
      "shape": "sphere",
      "date": "2012-01-24T00:00:00",
      "story": "A strange bright sphere was moving in all directions but in short bursts, a beam of light came out of the object and it dissapeared. I saw a bright ball in the north east night sky.  It moved back and forth and up and down in quick short bursts. then what looked to be a beam of light comeing from the strange object, every thing wierd stopped happening to it and it started heading up and east.  after a few hours of watching it vannished. this was no airplane or heli.  if you guys recognize this type back if you can, and tell me what is going on. thank you for your time.",
      "link": "http://www.nuforc.org/webreports/086/S86651.html",
      "state": "AZ",
      "duration": "around 4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7bf",
      "summary": "Red orb seen over the east valley (Phoenix)",
      "city": "gilbert",
      "shape": "sphere",
      "date": "2012-09-24T00:00:00",
      "story": "Red orb seen over the east valley (Phoenix) Just let to dog out and was looking east.  I saw what I thought was an incoming airplane (they approach from the east headed west to Phoenix).  I then realized that this red light did not have any anti-collison flashers, wing tip lights, or landing lights. The object was slowly moving toward my location, then turned and headed northeast.  It disappeared behing my neighbors house. I repositioned myself but the object was gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92548.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd8d",
      "summary": "Saw fireball traveling very fast back and forth at about 100 feet up, then disappeared, with no sound at all.",
      "city": "gilbert",
      "shape": "fireball",
      "date": "2012-08-19T00:00:00",
      "story": "Saw fireball traveling very fast back and forth at about 100 feet up, then disappeared, with no sound at all. Sitting on my patio, I saw what looked like a ball of fire traveling from just over my house at about 100 feet high, towards  the west then it came back half of what it traveled then went west again and just disappeared.  There was no sound at all.",
      "link": "http://www.nuforc.org/webreports/091/S91690.html",
      "state": "AZ",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bdde5",
      "summary": "12 red lights over gateway airport.  1 light merged with anouther light  and became 1 light.",
      "city": "gilbert",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "12 red lights over gateway airport .  1 light merged with anouther light  and became 1 light. At around 9:15 on 10/20/2012 I went outside to pull my car in the garage.  5 to 7 red lights were above the rooftops looking south towards gateway airport.  I am in Gilbert Arizona and my crossroads are Recker and Guadualupe.   I thought that this was military aircraft doing something but it looked a little unusual.  The lights appeared as if they were moving north  (towards my house) and climbing to higher elevation.  4 more lights apeared and looked to be following the other group.  One lights in the first group moved toward anouther in a strait line and merged with anouther (the two becoming one light). anouther 2 groups of 2 appeared as the others hit the edge of the clouds.   I called out my wife after a few started disapearing.  there were about 10 in the sky when she came out.  the lights slowly moved up until all of the lights disapeared in the clouds.  This all happenend in about 2 to 4 minutes.  Also, I was waiting for the usual noise of a fighter on! ce they passed.  There was no noise from these objects and they moved as if they were controlled.",
      "link": "http://www.nuforc.org/webreports/093/S93729.html",
      "state": "AZ",
      "duration": "2-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdde4",
      "summary": "6-8 Orange lights in formation over Gilbert",
      "city": "gilbert",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "6-8 Orange lights in formation over Gilbert 6-8 lights appeared in formation.  Formation was like a star constellation, and the lights were orange.   The formation was moving across the sky (no noise at all) and than the lights began to flicker out from left to right in order and disappeared.",
      "link": "http://www.nuforc.org/webreports/093/S93878.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be726",
      "summary": "Fuzzy dim cloud moveing South to East, it passed in front of moon then could see a physical triangle shape",
      "city": "gilbert",
      "shape": "triangle",
      "date": "2012-05-13T00:00:00",
      "story": "Fuzzy dim cloud moveing South to East, it passed in front of moon then could see a physical triangle shape On the night of 5, May 2012 about 20:50 hours MST, I and two other people saw a “UFO” from our location in Gilbert, Arizona. We first noticed a dim white fuzzy looking cloud overhead and slightly to the East of me traveling South then Southeast into the path of the moon.  As it crossed the face of the moon the object we could see that it's that there was a shape to the object, it turned into a black delta, (arrow head) shape object.  After it passed the moon it returned to the feature that we first saw and continued on an eastward path until it was out of sight. During the entirety of this “UFO” fly-by no sound was heard, no visible aircraft lights were seen, and the craft seemed very high and fast as it flew a curved path from South to East in a matter of about 5 seconds.",
      "link": "http://www.nuforc.org/webreports/088/S88819.html",
      "state": "AZ",
      "duration": "5 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3be7a3",
      "summary": "((HOAX??))  It was big.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2012-06-14T00:00:00",
      "story": "It was big. I saw this huge orange dot traveling up toward the moon and it stopped for a few seconds started sparkling then shot right past the moon. ((NUFORC Note:  We suspect this is a hoaxed report.  Date is flawed, and time may be incorrect, as well.  Contact information is flawed.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89562.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bead5",
      "summary": "Amber in color Very bright at times Spark like objects falling from the object Moved smoothly and slowly",
      "city": "gilbert",
      "shape": "rectangle",
      "date": "2012-02-03T00:00:00",
      "story": "amber in color  Very bright at times Spark like objects falling from the object  Moved smoothly and slowly Initial sighting object apeared to be e very bright amber color With binolculars it seemd to be multicolored Object was seen to the left of Jupiter but lower and more south   Moved west after comming east towared the house   At one time it was about 1 mile from out House    Both my daughter and I saw this as well as spark like particles comming off the object just after that it got very dim and lower to the horizon   It was no traveling very fast seemed very slowing going west",
      "link": "http://www.nuforc.org/webreports/086/S86849.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bef86",
      "summary": "Orange light heads South over smallest town in Arkansas.",
      "city": "gilbert",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Orange light heads South over smallest town in Arkansas I was outside my cabin grilling. I then looked up to see if the stars were visible.  As I did I saw a bright orange light directly overhead, moving south toward Marshall, AR.  The object made no sound and emitted no other lights.  It moved at a medium pace while making lists to the left and right every 15 seconds or so. After about three minutes it gave a few flickers and disappeared.  However, it did not disappear over the horizon or mountains, instead it disappeared out the sky over the horizon.  The orange glow was most likely caused by the smoke of nearby wildfires, that had been burning the previous days. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96636.html",
      "state": "AR",
      "duration": "3:00"
    },
    {
      "_id": "64d005f478aba2ec5a3bf86a",
      "summary": "Stealth Aircraft flying street light high gilbert arizona.",
      "city": "gilbert",
      "shape": "chevron",
      "date": "2013-08-30T00:00:00",
      "story": "Stealth Aircraft flying street light high gilbert arizona Aircraft flying just higher than street light in a residential area. Aircraft executed a roll between houses then flew at tree level south.  The aircraft appears to have manuverability of a helicopter, but uses jet engine thrusters to manuever. Also employing stealth technology as it is viewed as a thick bee storm. I have had multiple sightings of this aircraft, which could be military, or police.",
      "link": "http://www.nuforc.org/webreports/101/S101347.html",
      "state": "AZ",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8f0",
      "summary": "Round illuminated object in sky over Gilbert, Queen Creek area this afternoon.",
      "city": "gilbert",
      "shape": "oval",
      "date": "2013-09-09T00:00:00",
      "story": "Round illuminated object in sky over Gilbert, Queen Creek area this afternoon. Wife and I were out back in our pool.  A round object that was stationary in the sky was just sitting in mid air.  I went and got our binoculars.  When I returned (less than a minute) my wife was still watching it.  Suddenly it vanished but then it quickly appeared overhead. I looked at it with the biniculars and saw a round object that was strongly illuminated with something spining underneath.  It again suddenly disappeared.  The altitude appeared higher than the local air traffic flight path. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101766.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc3e",
      "summary": "Three orange fireball like objects over Gilbert, AZ.  ((NUFORC Note:  Report submitted by aerospace engineer.  PD))",
      "city": "gilbert",
      "shape": "fireball",
      "date": "2013-07-14T00:00:00",
      "story": "Three orange fireball like objects over Gilbert AZ One orange what appeared to be a fireball moving East to West quickly but under cloud level.  Object was large as compared to Jet on final approach to Sky Harbor.   !0 min later two more appeared in a staggered formation.   The first went sharply from East west direction to SW while the second continued West.   Orange light dimmed then brightened then faded out. I could barely make out a shape but would say triangular and totally silent.   I have never witnessed anything like this before so it was the weirdest thing to see.   I didn't have time to video it unfortunately.   I am an aeronautical engineer and was out locking my truck at the time.   I thought it could be an F-35 but no exhaust plume seen or sound heard.",
      "link": "http://www.nuforc.org/webreports/099/S99872.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe15",
      "summary": "Tiny cluster of white orbs one by one quickly appearing a disappearing. So close together it may have looked like one object.",
      "city": "gilbert",
      "shape": "unknown",
      "date": "2013-09-09T00:00:00",
      "story": "Tiny cluster of white orbs one by one quickly appearing a disappearing. So close together it may have looked like one object at a glanc I was looking out my office window towards four peaks as something caught my eye, I thought it was a firework at first but upon a closer look it was not.  A small cluster of white orbs appearred rapidly one by one.  There was probably about 10-15 of them but they were so close together it may have looked like one object at a glace.  They stayed lit for about 4 seconds and just as quick as they appeared, one by one they disappeared.  The whole thing lasted probably 7-8 seconds. I quickly told my collegues (who thought I was crazy)  We watched the same area and about 2 minutes later the same thing appeared in the sky about 20-30 miles North of four peaks this time and much higher.  They were just as baffled as me. None of us had ever seen anything like that in the sky before",
      "link": "http://www.nuforc.org/webreports/101/S101948.html",
      "state": "AZ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0239",
      "summary": "Went swimming and looked up at a airliner head east to west out of no were came a round silver object heading west to east past over th",
      "city": "gilbert",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "Went swimming and looked up at a airliner head east to west out of no were came a round silver object heading west to east past over the airliner and stoped hover and shot strait up and was gone.  Came to look.  At the stars at 9:30 pm saw two more silver light one would hide be hind the then shot  a few times then head strait up and the othet light went south. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98246.html",
      "state": "AZ",
      "duration": "5 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c03e3",
      "summary": "10 objects, pulsating red flame and yellow over Gilbert, Az. March 9, 2013",
      "city": "gilbert",
      "shape": "triangle",
      "date": "2013-04-12T00:00:00",
      "story": "10 objects, pulsating red flame and yellow over Gilbert, Az, March 9, 2013 We were visiting friends, as we were leaving a fireball caught my eye in the sky and I began video on my phone.  It was very intense and exciting but scary !!",
      "link": "http://www.nuforc.org/webreports/096/S96789.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ea7",
      "summary": "Yellow lights over south Phoenix fade quickly out of sight 2-7-14 apx 21:00",
      "city": "gilbert",
      "shape": "other",
      "date": "2014-02-14T00:00:00",
      "story": "Yellow lights over south Phoenix fade quickly out of sight 2-7-14 apx 21:00 My father and i were sitting on my back porch.  I went out to the back yard. as I walked around the pool, I looked in the sky to the west of gilbert arizona, towards south phoenix.  I noticed strange lights. approximately 5 large dark yellow lights in a v shape seem to move towards the east.  There was one light, with the same description, far above and slightly to the north.  It remained stationary.  The lights on the south or left side of the formation moved slightly farther south/left.  Then one by one the lights in the formation seemed to either fade away or move back west until all were not visible.  At that time the light far up above the formation disappeared in the same way.  They each faded in about 5 seconds.  This event happened over approximately 2 minutes.",
      "link": "http://www.nuforc.org/webreports/106/S106991.html",
      "state": "AZ",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1399",
      "summary": "Object streaking across sky similar to falling star, It stopped and dropped 4 other objects that moved in formation.",
      "city": "gilbert",
      "shape": "light",
      "date": "2013-12-12T00:00:00",
      "story": "Object streaking across sky similar to falling star, It stopped and dropped 4 other objects that moved in formation. My wife ((name deleted)), my son ((name deleted)), and I saw a mysterious phenomenon last night at approximately 8:30 pm. The attached pics and vids are taken from our front yard looking directly south. The property is located just northeast of Elliot and Val Vista Roads in Gilbert.  Initially, we saw an object streaking in the southeast sky heading west and descending in a diagonal trajectory.  It had a bright white light with a trailing tail and looked like a falling star, which is what I at first thought it was. It also appeared to be emitting sparks.  The object came to a stop at a position due south of our property and 45 degrees above the horizon.  The object held its position while emitting a significantly dimmer light. I originally thought that it was the spot where the falling star (meteor) had burnt out, but the light remained in the sky at the stopped position.  We continued to watch for several seconds, after which an object began to fall to the ground (perpendicular to the earth) . It seemed to emit a dim spot of light.  It traveled approximately 1/3 the distance to the ground and stopped. It then began heading east (horizontal to the earth).  At that point, the object was intensely bright and appeared to be emitting sparks very much like a fireworks display rocket.  Three additional objects did the same thing, creating a formation about 30 degrees above the horizon at a significant distance below and east of the original object.  They remained visible for several minutes, descending along looping trajectories until they disappeared below the horizon.  The attached pics and vids are of the descending formation only.  We did not have the camera working in time to capture the activity that had happened before.",
      "link": "http://www.nuforc.org/webreports/105/S105175.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ce9",
      "summary": "Flaming UFO.",
      "city": "gilbert",
      "shape": "fireball",
      "date": "2014-06-13T00:00:00",
      "story": "Flaming UFO On June 1, 2014, I was leaving my job near the southwest side of Gilbert, Arizona, heading toward the southeast side.  I was on the telephone and was looking for traffic behind me in the side mirror of my vehicle and noticed a red light that looked as if it could have been from a hot air balloon (which are popular around these parts) to the north.   After staring for some time I realized there wasn't a hot air balloon.  The craft appeared like a triangle with a round top and looked to have flames coming off it.  But, after watching a few moments, the craft looked to be moving upward and so were the flames.   I told the person on the phone what I was seeing in detail as I continued to look back and forth at the object as I proceeded to drive eastward down the road.   As I continued on looking back and forth at the object (unable to stop due to traffic around me), it continued upward until it looked like a small dot next to the moon.   I did not see it go through the atmosphere.  It moved at a slower pace until it got further upward.   I believe this to be a UFO because this is not my first visual encounter.",
      "link": "http://www.nuforc.org/webreports/110/S110010.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c2050",
      "summary": "Sitting outside on my back porch I observed the object fly over my house flew over at a slow speed disappeared in about a minute. It wa",
      "city": "gilbert",
      "shape": "triangle",
      "date": "2014-05-02T00:00:00",
      "story": "Sitting outside on my back porch I observed the object fly over my house flew over at a slow speed disappeared in about a minute.  It was very large way to be an aircraft.  The object was about 1000 feet off the ground made no noise we have airports in Mesa and Chandler, Arizona, see and hear airplanes all the time this was not an airplane",
      "link": "http://www.nuforc.org/webreports/108/S108980.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c25be",
      "summary": "8 silver objects over San Tan mountains",
      "city": "gilbert",
      "shape": "triangle",
      "date": "2014-11-06T00:00:00",
      "story": "8 silver objects over San Tan mountains On the drive home, was seen heading south on Greenfield and Germann. Location approximate over SanTan mountains.   A hovering triangle of 8 silver objects, that slowly looked like it shrank and vanished as soon as I drove another block away heading East.",
      "link": "http://www.nuforc.org/webreports/114/S114888.html",
      "state": "AZ",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2769",
      "summary": "Teardrop object falling through sky on fire (could've been asteroid).  ((NUFORC Note:  Possible meteor??  PD))",
      "city": "gilbert",
      "shape": "teardrop",
      "date": "2014-10-10T00:00:00",
      "story": "Teardrop object falling through sky on fire (could've been asteroid) My dad and I were driving, and we saw a teardrop shaped object falling from the sky clearly on fire. Could've been an asteroid. It lasted for a few seconds (from what we saw) then we lost sight of it as we turned. ((NUFORC Note:  Possible meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114206.html",
      "state": "AZ",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a41",
      "summary": "Changing lights in sky, from red/blue light to flare like light.",
      "city": "gilbert",
      "shape": "changing",
      "date": "2014-09-25T00:00:00",
      "story": "changing lights in sky, from red/blue light to flare like light. We were walking our dog and saw 4 lights in sky, 3 were like flares, one was a bluish-redish light.  All four changed numerous times, from the blue/red light to a flare-like light that fell downward.  It lasted about 5 minutes until we couldn't see it anymore because of the trees.  We thought it was odd, that if they were flares, why did they change back to the blue/red light many times?",
      "link": "http://www.nuforc.org/webreports/113/S113752.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a8e",
      "summary": "Dancing fireballs over Gilbert, AZ.",
      "city": "gilbert",
      "shape": "fireball",
      "date": "2014-09-25T00:00:00",
      "story": "Dancing fireballs over Gilbert, AZ Four lights in the sky over Gilbert, AZ.  Trails like comets, but with a sparkly appearance, going all sorts of directions (up, down, left, right, loops, all over the place).  Fading out to a tiny blue light, then flaring back to previous brightness.  Going gradually lower, until out of sight behind buildings and trees.",
      "link": "http://www.nuforc.org/webreports/113/S113753.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a90",
      "summary": "Unidentified balls of light with flaming tails that floated down out of the sky like feathers.",
      "city": "gilbert",
      "shape": "fireball",
      "date": "2014-09-25T00:00:00",
      "story": "Unidentified balls of light with flaming tails that floated down out of the sky like feathers. While driving east on the 202 near Val Vista rd Exit we saw 2 red balls floating down from the Sky like feathers that broke off into 4 balls. They had a random pattern.  They would blink on and off and vary in brightness.  At times the ball was white/blue with a red flaming tail.  Then they disappeared.  They did not streak down like a meteor but again floated down bouncing like feathers.",
      "link": "http://www.nuforc.org/webreports/113/S113767.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bca",
      "summary": "Strange lights in Arizona.",
      "city": "gilbert",
      "shape": "light",
      "date": "2014-10-03T00:00:00",
      "story": "Strange lights in Arizona Saw lights while talking to friend on phone. Finally realized my tablet was in the truck. I turned on tablet and started recording it.  After it disappeared, I played the video back and noticed that you can see the lights move upward at a fast rate of speed.  Sorry for quality, my tablet is 4 years old.",
      "link": "http://www.nuforc.org/webreports/114/S114088.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e77",
      "summary": "Small ultra-light sized UNDO over Gilbert,  Az.",
      "city": "gilbert",
      "shape": "other",
      "date": "2014-09-05T00:00:00",
      "story": "small ultra-light sized UNDO over Gilbert,  Az At around 11pm,  (Power rd & Guadalupe) myself & 3 other adults witnessed this strange object humming above about 200ft in sky.  It had row of 6 green lights & row of 6 red lights above the them.   The craft zipped across sky (west along Guadalupe Rd then cut hard left & hovered in place then dropped down 100ft then zipped vertical to about 200 ft then disasters.   The lights flashed.   It sounded like an ultra light plane but it wasn't. it was so close to us if it had been at dusk we might gave caught a photo.   Either way it freaked me out.",
      "link": "http://www.nuforc.org/webreports/113/S113202.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c327d",
      "summary": "Fireballs in the sky.",
      "city": "gilbert",
      "shape": "other",
      "date": "2015-04-03T00:00:00",
      "story": "There were about 8 fireballs in the sky tonight they were just big balls of fire.  They started off low and went higher. It looked just like fire that was traveling in the sky like the back of a rocket ship.  But it wasn't going very fast.  They flew for a few minutes and then disappeared.",
      "link": "http://www.nuforc.org/webreports/118/S118077.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c32d1",
      "summary": "Three orange lights moving across the horizon in Gilbert",
      "city": "gilbert",
      "shape": "triangle",
      "date": "2015-04-03T00:00:00",
      "story": "Three orange lights moving across the horizon in Gilbert Was sitting out in the pool visiting my parents in Gilbert for the weekend.  Saw what appeared to be three orange lights in the sky moving in unison.  Two lead lights followed by a seemingly equidistant third light traveling north on the horizon.   We all watched these lights move in seemingly perfect locked formation.  The only thing that changed was the distance between the two front lights, as if a large craft made all three lights and its visible profile or angle was changing.   We watched for a good 2 min until the objects vanished from the sky.   Another couple was out walking in the neighborhood and we chatted over the fence to them on the street, nobody able to explain what we had seen.",
      "link": "http://www.nuforc.org/webreports/118/S118132.html",
      "state": "AZ",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3526",
      "summary": "3 Amber/Orange Lights over South Gilbert Arizona",
      "city": "gilbert",
      "shape": "light",
      "date": "2015-01-07T00:00:00",
      "story": "",
      "link": "http://www.nuforc.org/webreports/116/S116346.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3796",
      "summary": "Saw what look like meteor come down bright left a big streak and come trail then other fast come trails around the mane one..it was clo",
      "city": "gilbert",
      "shape": "",
      "date": "2015-02-06T00:00:00",
      "story": "Saw what look like meteor come down bright left a big streak and come trail then other fast come trails around the mane one..it was cloudy first then after that it clear up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117150.html",
      "state": "AZ",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3849",
      "summary": "Red and orange flying objects seem in the south sky moving in clusters and disappeared",
      "city": "gilbert",
      "shape": "flash",
      "date": "2015-01-16T00:00:00",
      "story": "Red and orange flying objects seem in the south sky, moving in clusters, and disappeared There were 25-30 red orange objects flying in the southwest sky, flying toward Gila River area.  They flew in clusters, and disappeared quickly.",
      "link": "http://www.nuforc.org/webreports/116/S116671.html",
      "state": "AZ",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c39f2",
      "summary": "Bright glitter/shimmering, long-tailed UFO's in Gilbert!",
      "city": "gilbert",
      "shape": "changing",
      "date": "2014-12-12T00:00:00",
      "story": "Bright glitter/shimmering, long-tailed UFO's in Gilbert! While in my car between Higley and Ray and Higley and Williamsfield Road saw three bright shimmering objects moving in circular and u shaped motions.  I thought they were fireworks at first because of the shimmer light tail that followed their movement.   They were the color of a white gold shimmer and very bright.  They also resembled shooting stars, but I would say more like a firework display.  They would disappear and return again with their shimmering light display.  It was beautiful.",
      "link": "http://www.nuforc.org/webreports/115/S115855.html",
      "state": "AZ",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c430f",
      "summary": "About the size of 6 houses. Hovering extremely low to the ground over a housing development making no movement. As soon as I got off of",
      "city": "gilbert",
      "shape": "other",
      "date": "2015-10-29T00:00:00",
      "story": "About the size of 6 houses.  Hovering extremely low to the ground over a housing development making no movement.   As soon as I got off of the phone and turned my car towards the craft it started to move fairly slow away from me.   It resembled a drone but was way too large to be one.  About 6 white lights around craft and made no noise.",
      "link": "http://www.nuforc.org/webreports/122/S122961.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c43f3",
      "summary": "Cloud of light moving slowly across the sky then vanished..  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "gilbert",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "cloud of light moving slowly across the sky then vanished.. We witnessed a very large object high in the sky moving slowly that had a round glowing vapor cloud around it with no other clouds in the sky and a bright light in the center. It moved slowly across the sky and then vanished leaving a glowing bubble of vapor that lingered in the sky for about 10 minutes. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123886.html",
      "state": "AZ",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4584",
      "summary": "Large triangle shape UFO over Gilbert, AZ.",
      "city": "gilbert",
      "shape": "triangle",
      "date": "2015-11-26T00:00:00",
      "story": "Large triangle shape UFO over Gilbert, AZ. At 8:25 PM, my three kids and myself witnessed what appeared as three yellowish lights in the southeastern sky.  We were driving on the Loop 202 freeway heading eastbound.  I thought maybe it was three helicopters as we have an increase of military activity on the weekend.   I pointed the lights out to the kids as they approached us.  What flew over us was on black triangle with three lights that had the brightness of streetlights or a tad brighter.  I had the windows down in the car and slowed down to try and identify the craft.  This triangle made no noise at all and was about 1000 feet above us.   The children wanted to know what aircraft is that huge and shaped that way.  I had no answer.  I've seen stealth aircraft fly over at NFL games and this wasn't even close to the size of a stealth.  This was about four street lights long as I stand outside hoping to see this again!   A reference note....I have worked in the airline industry for over 20 years and have never witnessed anything flying like this.",
      "link": "http://www.nuforc.org/webreports/124/S124261.html",
      "state": "AZ",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4747",
      "summary": "Strange lights in the sky in Phoenix, Arizona 2015 very big ship.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2015-11-26T00:00:00",
      "story": "Strange lights in the sky in Phoenix, Arizona, 2015 very big ship. There were four lights in a half moon shape.  About 100 yards in length hovering in one spot the lights went from white to orange.  There was no movement.   After about five minutes all the lights shot away and disappear in the sky. ((NUFORC Note:  Time may be flawed.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124351.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a07",
      "summary": "DIRECTION CHANGING COMET-LIKE OBJECTS IN EASTERN SKY",
      "city": "gilbert",
      "shape": "fireball",
      "date": "2015-09-25T00:00:00",
      "story": "DIRECTION CHANGING COMET-LIKE OBJECTS IN EASTERN SKY. SAW FOUR DIFFERENT COMET-LIKE OBJECTS IN THE EASTERN SKY.  YOU COULD SEE THE \"FRAGMENTS\" FALLING OFF  OF IT.  THE OBJECTS WOULD CHANGE DIRECTIONS. EVENTUALLY THEY ALL FIZZLED OUT. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122146.html",
      "state": "AZ",
      "duration": "Few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5381",
      "summary": "Driving in Gilbert.  Looking to the west towards south mountain there was three lights equally spaced forming a triangle shape.  It was",
      "city": "gilbert",
      "shape": "triangle",
      "date": "2016-01-14T00:00:00",
      "story": "Driving in Gilbert.  Looking to the west towards south mountain there was three lights equally spaced forming a triangle shape.  It was quite large.  It seemed to fade in and out, but kept shaped.",
      "link": "http://www.nuforc.org/webreports/125/S125228.html",
      "state": "AZ",
      "duration": "On going"
    },
    {
      "_id": "64d005f478aba2ec5a3c53b2",
      "summary": "Military jet accelerates toward an object above Gilbert, AZ.",
      "city": "gilbert",
      "shape": "unknown",
      "date": "2016-01-08T00:00:00",
      "story": "Military jet accelerates toward an object above Gilbert, AZ. Looked up due to the distinct sound of a military aircraft accelerating.  Saw a fighter jet quickly closing on an object with three lights (no blinking lights)  The military jet throttled down as it approached the object and closely shadowed it.   The object size was about the same size as the military jet and appeared to be either circular or triangular...can't say for sure, it was dark.  Two red lights in the back and one light green or orange light going forward.   I was surprised at how closely the military jet shadowed the object.  I'm estimating the elevation of the two aircraft at +- 1000 to 1500 ft. above surface level. ((NUFORC Note:  We are uncertain as to whether this is a servious report.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125164.html",
      "state": "AZ",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c54ac",
      "summary": "Lights floated in the sky over Eastern Maricopa County.",
      "city": "gilbert",
      "shape": "light",
      "date": "2015-12-17T00:00:00",
      "story": "Lights floated in the sky over Eastern Maricopa county There were lights floating in the sky near Williams Gateway Airport in Queen Creek.  Individual lights would move in from the South East and float into formation with the others.  They would float like a lava lamp, until one faded off into the distance while a new one flew into view from the SE.   This was viewed by me and my two sons.  The lights were orangy-umber.  Video did not come out as the street lights seemed to blind out the lights in the distance.",
      "link": "http://www.nuforc.org/webreports/124/S124700.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c599f",
      "summary": "Formation of lights.",
      "city": "gilbert",
      "shape": "sphere",
      "date": "2016-05-26T00:00:00",
      "story": "Formation of lights. We witnessed lights, in formation, very close together moving from west to east.  They were very high in the sky.  As they moved to the east they either moved they disappeared from our sight.",
      "link": "http://www.nuforc.org/webreports/127/S127468.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c60c1",
      "summary": "Four red lights.  Appeared, went into formation and then disappeared.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2016-10-27T00:00:00",
      "story": "Four red lights. Appeared, went into formation and then disappeared. Four red lights.  Dots.  No glare / halo around them. Came from the south and moved north. One by one they appeared.  Eventually all four lined up, equidistant apart.  I thought they were helicopters or something.  No sound.  As soon as they lined up, they disappeared. Very linear in their motion and precise in their line-up.",
      "link": "http://www.nuforc.org/webreports/130/S130835.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6531",
      "summary": "Constant bright star-like white light, heading away with no nav or landing lights.  ((NUFORC Note:  Sighting of ISS.  PD))",
      "city": "gilbert",
      "shape": "light",
      "date": "2016-08-19T00:00:00",
      "story": "Constant bright star-like white light, heading away with no nav or landing lights. While watching normal air traffic on approach to phx sky harbor, we observed a bright, star-like white light heading away from us in a south east direction with no nav or landing lights whatsoever.   My husband, who is a pilot and builds aircraft for Boeing, knew it was no commercial aircraft and only saw one single bright constant white light when looking at it through binoculars.   Our son and his girlfriend also witnessed it and it just disappeared before our eyes with no clouds in area.  It was traveling in the oposite direction of any normal air traffic into or out of sky harbor airport, gilbert chandler regional, or falcon field nor was it high altitude.  It seemed to be at similar altitude as traffic landing at Sky harbor,but traveling in opposite direction. ((NUFORC Note:  Overflight of ISS at the time of the sighting.  We strongly suspect that the object was the ISS.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129335.html",
      "state": "AZ",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c65d7",
      "summary": "Round shaped object with no blinking lights, just white, first high in air, then lower instantly, moving across the sky, disappears.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2016-08-16T00:00:00",
      "story": "Round shaped object with no blinking lights, just white, first high in air, then lower instantly, moving across the sky, disappears. Walking dogs in Gilbert, AZ, neighborhood a little south of Ray Rd, east of Higley Rd.   Was walking East and looked up to sky and saw what looked like a satellite way up high going south.  I even mentioned it to my husband.   Then as we walked further south, turning the corner going East, I kept looking for the satellite, all the sudden, halfway lower to the distance of the satellite, we both saw a light the shape of a circle that looked like a bright star, but it was moving fast and was now going Southeast.  We both were watching it talking about it because it had no lights, just a circle of light moving across the sky.  Then all the sudden, as we were watching it, the light just disappeared right before our eyes.  There were no clouds in the sky.  We both said that no way it was any type of airplane. It was very weird and strange.  I would have never thought I would ever see anything like this.   Last night I was even going to call the 911 or airport, but I decided to! wait for today to check in the Internet to see if it was mentioned by anybody else.  While I was searching, I found this website so I can report it.  Thank you. ((NUFORC Note:  We spoke with the witness who submitted this report, and we found her to be quite eloquent in her description of the sighting, and quite sober-minded.  We suspect that she is an excellent witness.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129298.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c67cb",
      "summary": "Red/orbs San Tan peak/jet engine facility.",
      "city": "gilbert",
      "shape": "cigar",
      "date": "2017-04-20T00:00:00",
      "story": "Red/orbs San Tan peak/jet engine facility. Flying together, spread apart in a arc formation, towards jet engine testing facility or San Tan peak; glowing bright red/orange; 4 together and then they pulsated on and off and disappeared as they approached the mountains/facility; then a 5th cigar orb also glowing red/orange   followed the same route after the other 4 disappeared,  it was the brightest and flashed the longest, then also disappears at the same spot above near the jet engine testing facility.   Aircraft seemed to be approaching these things and they all disappeared as the airplanes neared.",
      "link": "http://www.nuforc.org/webreports/133/S133658.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b86",
      "summary": "I went for ice cream with my son who is 12. We were in the car heading back home about 1 minute away from the house. I was facing w at",
      "city": "gilbert",
      "shape": "light",
      "date": "2017-01-26T00:00:00",
      "story": "I went for ice cream with my son, who is 12.  We were in the car heading back home, about 1 minute away from the house.  I was facing west at a traffic light, waiting to turn south, or left, when a light caught the corner of my eye.  We have lots of air traffic so I thought at first it was just another plane.  It looked like a star or planet like Venus, but very low...just above treeline.  There was no sound.  It moved across the entire sky at a very high speed...the fastest thing I've ever seen go across the sky.  I'm an amateur astronomer and have seen satellites and meteors.  There was no tail or glow or sonic boom or explosion.  My first thought was it was a missile but again no tail.  Then I thought maybe it was a fireball but no tail and no reports anywhere.  I really can't say what it was that I saw but I've never seen anything like that in my life.  It was very very fast.   I teach alternative education high school science, and I don't believe in aliens or UFOs...I'm a total sk!eptic.  But I can't explain what I saw.",
      "link": "http://www.nuforc.org/webreports/132/S132274.html",
      "state": "AZ",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d4a",
      "summary": "Undulating swarm cloud of thousands of multi-colored blinking lights in the sky for 10-15 minutes.  ((NUFORC Note:  LED balloons.  PD))",
      "city": "gilbert",
      "shape": "light",
      "date": "2016-12-21T00:00:00",
      "story": "Undulating swarm cloud of thousands of multi-colored blinking lights in the sky for 10-15 minutes. It was not craft, but a swarm of undulating blinking lights in a ribbon like formation, almost straight overhead, heading in a east to west direction.  They were multi colored, blinking on and off, thousands of them.  There were three of us in my backyard, and 7 neighbors reported the phenomena on our neighborhood Facebook page.  I was able to get some grainy video on my smartphone.  It was an incredible site, I thought I must be dreaming, so I slapped my own face, but it was real.  They looked to be about 25,000 feet up, as that was the lowest cloud cover at the time, and they were above that.  Please tell me where to submit video.  Thank you. ((NUFORC Note:  Witness followed up to state that the objects were helium-filled balloons with flashing LED lights, which had been released at a church celebration.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131813.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b01",
      "summary": "Clusters of yellow  lights flying across the sky.",
      "city": "gilbert",
      "shape": "formation",
      "date": "2017-11-09T00:00:00",
      "story": "Clusters of yellow  lights flying across the sky I saw about 10 lights flighing close together across the sky.  I was facing East and they were traveling North.  About three of the lights were flying pretty close together almost like a diagonal line and the others were flying together as well, but it almost looked like they were forming a triangular shape.  I took videos and a picture. I live not too far from an airport and I also saw and heard air planes flying around that time but these didn’t look or sound like planes.  In the video I took you can see the lights flying across and a plane passing so you can tell the difference.  It appears no one else has reported the sighting.  I have emailed my video to ABC news and posted it on their Facebook, but didn’t seem like a big deal.",
      "link": "http://www.nuforc.org/webreports/137/S137141.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8045",
      "summary": "Orbs in the sky.",
      "city": "gilbert",
      "shape": "formation",
      "date": "2018-03-23T00:00:00",
      "story": "Orbs in the sky I am former USAF.  I observed what I can only described as orbs going across the sky from 9 to 3 oclock direction wise.  There were quite a few I can not even guess on the number of them.   They were moving at a good pace, but they also would disappear and reappear.  These were not Chinese lanterns because they would not turn off and then back on.   Nor where these aircraft because they were not blinking simply would shutoff for a few seconds then turn back on.   I personally had not seen anything like it.  My wife was also with me and so everything and she was very frightened from it. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139208.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c880c",
      "summary": "As many as 7 Orbs seen ascending and descending, changing colors and flight paths for 30 minutes.",
      "city": "gilbert",
      "shape": "changing",
      "date": "2018-07-05T00:00:00",
      "story": "As many as 7 Orbs seen ascending and descending, changing colors and flight paths for 30 minutes My wife was on the balcony, saw something in the sky and called me outside. When I saw these orbs (4 to 7 at one time) hoverig, then ascending, then descending etc.  I immediately got my phone and asked my wife to get hers.  I knew these were orbs because of the way they moved.  They almost danced in the night sky, one ot two changed from white to reddish, then green, yellow or gold and back to bright white like a star, at first in unison then some faded away, the others then continued to change their position until at the end there were three left which lined up vertically one over the other at which point they merged into one.  When it appeared to be just one it changed into many colors off and on, changed shape and fizzled out and drifted away towards the east and down from our view point.  I have seen other sightings in my life but none his impressive.  We have over 40 pictures. we have viewed these on my PC using zoom of course and have discovered some things ! we had not noticed that night.  These images shoe shape and structure, also lights and dark angles that were at first unseen.",
      "link": "http://www.nuforc.org/webreports/141/S141995.html",
      "state": "AZ",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8901",
      "summary": "Two blinking tiny flashes, red, white, blue, green. Really far away to the NE when first seen. Lost one heading SW.((anonymous report))",
      "city": "gilbert",
      "shape": "flash",
      "date": "2018-06-15T00:00:00",
      "story": "Two blinking tiny flashes, red, white, blue, green.  Really far away to the north east when first seen.  Lost one heading southwest, other moved steady, but seemed to skip forward northeast then was to far to see or disappeared.  Moved as if you were trying to draw a straight line, not in a perfect line.  Seemed to skip forward vanishing then reappearing a distance ahead. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141800.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a4d",
      "summary": "Stagnant Red Dot over Gilbert, AZ.",
      "city": "gilbert",
      "shape": "circle",
      "date": "2019-09-06T00:00:00",
      "story": "Stagnant Red Dot over Gilbert, AZ I was calling for my dogs to come inside and noticed a solid red dot stagnant in the sky.  It last for approximately 10 seconds and then shot straight down out of sight.",
      "link": "http://www.nuforc.org/webreports/148/S148560.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b98",
      "summary": "Loud roaring sound and lights",
      "city": "gilbert",
      "shape": "light",
      "date": "2019-02-27T00:00:00",
      "story": "Loud roaring sound and lights February 6, 2019. Gilbert, Ar 18:30 pm  Heard a loud roaring sound, like a jet engine over the top of our house.  It went on and on for approximately 30 minutes.  We did not see anything when we looked out due to the porch roof blocking the sky.  Neighbor said they saw 5 lights hovering over our house.  In Clinton, Ar, someone saw 6 lights, in Marshall, Ar, someone saw 3 lights.",
      "link": "http://www.nuforc.org/webreports/144/S144970.html",
      "state": "AR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bd7",
      "summary": "Loud roaring sound and lights.  ((anonymous report))",
      "city": "gilbert",
      "shape": "light",
      "date": "2019-02-22T00:00:00",
      "story": "Loud roaring sound and lights. February 6, 2019.  Gilbert, AR.  18:30.  Heard a loud roaring sound like a jet engine over the top of our house.  It went on and on for approximately 30 minutes.  We did not see anything when we looked out due to the porch roof blocking the sky.   Neighbor said they saw 5 lights hovering over our house.   In Clinton, AR, someone saw 6 lights, in Marshall, AR, someone saw 3 lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144959.html",
      "state": "AR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d36",
      "summary": "Spouse immediately noticed bright lights above us as we were driving.  ((anonymous report))",
      "city": "gilbert",
      "shape": "cigar",
      "date": "2019-01-17T00:00:00",
      "story": "While sitting in the passenger seat of my spouses vehicle, she immediately noticed bright lights above us as we were driving.  She noticed them first as she was driving and focusing on the road, but I quickly attempted to focus in on the lights as well as take out my phone to record it (which I qas lucky enough to do so). Above us were lights moving straight through the sky, it seemed to he somewhat of a cigar shape and made bo noise.  From the looks of the bright blue and red lights, it looked very close, but with the windows rolled down it didn't make a sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144506.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ff3",
      "summary": "Orange glowing ball at around 85 degrees in the sky.  Glowing as of it were in cloud.  ((anonymous report))",
      "city": "gilbert",
      "shape": "circle",
      "date": "2018-11-24T00:00:00",
      "story": "I was traveling north at about Val Vista and Warner.  Orange glowing ball at aroun 85 degrees in the sky.  Glowing as of it were in clouds or fog.  Distinct aura.  Twice as bright as in more vibrant color than Mars is to the naked eye.  No clouds in immediate area.  Object was moving north at slow rate.  As object hit clouds it faded in color was was visible as a gray circle.   Object maintained course moving north and at about 45 degrees, it faded away.  Didn’t not follow any flight paths in the area.  No blinking or pulsing lights.  No sounds were distinct.  And for reference a helicopter and plane flew over within 60 seconds of occurrence and were very audible.  This thing was orange and glowing.  Brightest thing in the sky besides the full moon.  Like the orange of a traffic controller. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143870.html",
      "state": "AZ",
      "duration": "8-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ff2",
      "summary": "Three Red Glowing Lights Seen Over Gilbert, AZ - Moving and flashing making a triangular formation before vanishing.",
      "city": "gilbert",
      "shape": "light",
      "date": "2018-11-24T00:00:00",
      "story": "Three Red Glowing Lights Seen Over Gilbert, AZ - Moving and flashing making a triangular formation before vanishing. 3 of my teenage children and myself were getting into the car to go to the store when we witnessed 2 red lights that seemed to be intermittently twinkling.  We continued to watch the red lights and a third smaller one appeared, at which point all three lights became steadily lit and stopped twinkling.  They were in a half circle formation initially, but as the began to glow steady, they moved into a triangular formation.  Then one of the lights that was the smallest, located at the bottom left corner of the formation began to dim, and continued to dim until it completely vanished.  The red light on the bottom right of the formation became brighter, then moved more to the right and began to flash and grow dim as well, until it too, vanished completely.  The red light at the top of the triangular formation- the only light left, became brighter and continued to glow red and steady as it moved higher and higher into the sky until it was gone, just like the other two red lights.",
      "link": "http://www.nuforc.org/webreports/143/S143869.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c918e",
      "summary": "Seen what at first appeared to be the brightest star in the night sky, but the white orb was moving fast and at a higher altitude and f",
      "city": "gilbert",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Seen what at first appeared to be the brightest star in the night sky, but the white orb was moving fast and at a higher altitude and faster rate of speed compared to an aircraft that was also visible in the sky.  The white orb, however, did not have any blinking lights as do most commercial aircraft.  The flight of the orb white light was South-East and after observing it fly across the sky for a few minutes the light faded and didn't come back on.",
      "link": "http://www.nuforc.org/webreports/149/S149606.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9322",
      "summary": "Fire orbs orbit eachother in the sky",
      "city": "gilbert",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "Fire orbs orbit eachother in the sky It looked as though there were two bright circular orange orbs with long tapered spark/fire trails following them that were orbiting eachother untill they met in the middle and then were gone, seemed to be high in the sky but decent in size",
      "link": "http://www.nuforc.org/webreports/150/S150077.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9323",
      "summary": "",
      "city": "gilbert",
      "shape": "",
      "date": "2019-12-01T00:00:00",
      "story": "",
      "link": "http://www.nuforc.org/webreports/150/S150078.html",
      "state": "AZ",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c94aa",
      "summary": "Dark saucer with very bright multicolored lights that was flying close to a commercial plane shot across the sky in a half circular pat",
      "city": "gilbert",
      "shape": "changing",
      "date": "2019-12-19T00:00:00",
      "story": "Dark saucer with very bright multicolored lights that was flying close to a commercial plane shot across the sky in a half circular path, leaving a trail of ultraviolet light or some sort of plasma behind it and then completely disappeared, was totally silent.",
      "link": "http://www.nuforc.org/webreports/151/S151690.html",
      "state": "AZ",
      "duration": "3 seconds or less"
    }
  ]
}