{
  "city": "glendale",
  "fetch_timestamp": "2025-07-12T14:36:01.206752",
  "record_count": 108,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4326",
      "summary": "two whites that split into 5 form a line up and down grew bright and sparkling and disappear",
      "city": "glendale",
      "shape": "unknown",
      "date": "2006-05-15T00:00:00",
      "story": "two whites that split into 5 form a line up and down grew bright and sparkling and disappear it first started with two white light i though were planes but then they grew very bright and split into 5 or 6 bright lights that form a straight line up and down and remain for about 1 min.They look almost sparkly in a way white lights. They got very bright then disapper. They almost look like white fireworks the way they disappear but fireworks dont stand still and split and form a line and the lights were silent no sound at all. They were probably a good 20 miles or so. I was looking towards the north. my sister was with me and a homeless man was there in the street bare witness also. It was still black outside 4:12 am. clear skies.",
      "link": "http://www.nuforc.org/webreports/049/S49535.html",
      "state": "AZ",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b463b",
      "summary": "Bright metallic sphere that I can't explain.",
      "city": "glendale",
      "shape": "sphere",
      "date": "2006-05-15T00:00:00",
      "story": "Bright metallic sphere that I can't explain. When I went to get tools out of my truck at a house I was doing landscaping at I noticed a round very shiny ball in the sky that was moving up at first then started a steady path up and to the east.  At first it reminded me of one of those gas balloons that are shiney silver, but this was perfectly round and not moving as a floating object would.  It was also bigger in size, but it was hard to tell exactly how big it really was or the exact distance away because of how it reflected the light.  There was no noticable sound coming from it or any means of propulsion. I just stood and watched it for a little while and then walked back to the backyard of the house I was working at and pointed it out to a guy I work with.  He acknowledged seeing it and asked me what it was, I told him I didn't know and we both just watched it continue on the same course for a couple of minutes until it was out of sight.  Because it took so long to get out of sight, I think it was bigger than what I initially thought.  Initially I thought it was very close and about the size of a basketball. I was a Crew Chief in the Airforce and have seen many different types of aircraft.  I also have a pretty good knowledge of physics and the principles that would be involved to move an object like that, and admit that it had to be something that I can't explain.",
      "link": "http://www.nuforc.org/webreports/050/S50447.html",
      "state": "AZ",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cad",
      "summary": "Three silver circular object flying in a perfect triangle formation.",
      "city": "glendale",
      "shape": "circle",
      "date": "2019-07-05T00:00:00",
      "story": "Three silver circular object flying in a perfect triangle formation. Seen three silver circular objects in a perfect triangle formation fly over our house observed for about a minute and then they just disappeared.  Much higher than any commercial or military jet than we have ever seen.",
      "link": "http://www.nuforc.org/webreports/147/S147301.html",
      "state": "NY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b553d",
      "summary": "Three red solid parallel lines of light moving from East to West.",
      "city": "glendale",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "Three red solid parallel lines of light moving from East to West. Moving at a high rate of speed I witnessed 3 red lines of light parallel to each other, but the center line was offset.  The lights moved with each other which means it was either one craft or 3 crafts.  The lights did not blink.  They were solid.  Below is the best drawing I can do with the keyboard.  --------- ----------- ---------   The lights were travelling from East to West from my vantage point crossing through the Big Dipper.  The lines moved perpendicular to their shape.",
      "link": "http://www.nuforc.org/webreports/062/S62784.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b56e5",
      "summary": "In response to this story: http://www.nuforc.org/CB970313.html  Yes, there are F-15s stationed at Luke AFB.  My father works for Boeing",
      "city": "glendale",
      "shape": "",
      "date": "2007-08-07T00:00:00",
      "story": "In response to this story: http://www.nuforc.org/CB970313.html   Yes, there are F-15s stationed at Luke AFB.  My father works for Boeing in St. Louis, MO (which at that time was McDonnell Douglas) on the F-15 program.  He visited Arizona several times to work with the Air Force at that base.  We even have photographs (which weren't technically supposed to take) of the jets sitting on the base. ((NUFORC Note:  We are grateful to the source of this information.  We agree with the report, although we have known since March 14, 1997, that Luke AFB was exclusively an F-16 training base.  However, the two F-15 \"C\" fighters (carrying \"LANTIRN II\" pods)) that intercepted an object above the intersection of 7th Avenue and Indian School Road, at an altitude of approximately 11,500 ft altitude, we attached to the U. S. Air Force Protection Group, which flies \"cover\" for any aircraft carrying either the President, Vice-President, or other dignitaries.  We would very much like to speak with the USAF Lieutenant Colonel, who led the flight, and who had to be helped from his cockpit, upon returning to Luke AFB that night.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57626.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b6b3a",
      "summary": "Hoovering red light in the north sky near Phoenix, AZ",
      "city": "glendale",
      "shape": "oval",
      "date": "2008-02-14T00:00:00",
      "story": "Hoovering red light in the north sky near Phoenix, AZ I walked out to my backyard around 20:30 and saw a red colored light in the north sky.  The light appeared unusual as it bounced up and down slightly a few times then stayed stationary.  The light proceeded to move up and down and then sideways.  I ran inside to get my camera and came back out to get some photos and the light continued to hover in the sky.  There was no sound associated with the light.  As I took several shots with my camera changing the settings and going in and out with the wide angle the red light proceeded to move towards the north getting higher and moving farther away.  The light eventually disappeared from vision high in the north by northwest sky.",
      "link": "http://www.nuforc.org/webreports/061/S61223.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b6e",
      "summary": "Three white circular objects in a triangular formation hover above the hills between Glendale and Los Angeles, California.",
      "city": "glendale",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "Three white circular objects in a triangular formation hover above the hills between Glendale and Los Angeles, California. I had just gotten of work and was walking out of the Glendale Galleria; it was about 7:25. A work associate and I were standing outside on the 3rd and top level of the Glendale Galleria North west parking structure talking. It was around dusk and I happen to be facing South-west when something in the distance caught my attention. I asked my friend to look at what seem to be 3 white circular objects in a triangular formation hovering above the hills/mountains.  My first thought was it was a UFO, but for fear of being thought crazy, I asked him what he thought the 3 objects were. We continued to watch them hover when he said he thought they were some type of birds, but then all 3 started to move at the same time and speed upwards.  I remember telling him, those were not birds. That, birds did not fly that fast nor that high.  We continued to watch as these three white (not sure what to call these objects) UFO's as it flew further toward us yet higher. I remembered my camera in my purse and told my friend not to take his eyes off the UFO's so I would know where they were as it had grown dark. Yet, you could still see the white circle's that formed a triangle. I was able to take 2 pictures each time my friend having to point them out, so I would know where I had to aim my camera. When I tried to take a third, my camera wouldn't work. I was and am still excited that I have 2 photos.   The photo's clearly show the stars in the sky as well as a bright red circle.  We watched for a few more seconds and then all of a sudden they were gone!",
      "link": "http://www.nuforc.org/webreports/058/S58839.html",
      "state": "CA",
      "duration": "15 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b6e31",
      "summary": "strange light above Glendale, CA",
      "city": "glendale",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "strange light above Glendale, CA I was talking to my friend in his front yard and noticed a bright yellow light in the sky. It was bigger than the surrounding stars. First I thought it was a plane, but there where more planes in the sky, however this \"light\" didn't have a flashing light like the other planes. It was traveling at a very high speed and simple disappeared. Like someone had turned of the light. It wasn't a searching light.",
      "link": "http://www.nuforc.org/webreports/063/S63781.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e53",
      "summary": "we saw these lights many years ago never thought there was a ufo website.my friend told me about this one started looking on the site c",
      "city": "glendale",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "we saw these lights many years ago never thought there was a ufo website.my friend told me about this one started looking on the site could not believe what i saw was that some other people in northridge california saw the same lights we did on this date.we saw 5-6 lghts flying fast in a straight line flying around each other not to high and was no noise at all never saw what i saw in my life it made my hair stand up i wrote these dates and time when we saw these lights and now im reporting them.",
      "link": "http://www.nuforc.org/webreports/073/S73221.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8773",
      "summary": "Solid white lights in the shape of a boomerang that started to flash in a revolving sequencing pattern 1 mile above the ground.",
      "city": "glendale",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Solid white lights in the shape of a boomerang that started to flash in a revolving sequencing pattern 1 mile above the ground. Solid white lights in the shape of a boomerang that started to flash in a revolving sequencing pattern. object appeared to be about 1 mile above the ground and hovering then took off towards the southeast, total duration was about 3 to 4 min.  Saw lights 2 nights in a row with witnesses both times at around 8pm. Called non emergency police department the first night and operator said there was other calls about the same thing but no officers witnessed seeing anything when in the area.",
      "link": "http://www.nuforc.org/webreports/072/S72643.html",
      "state": "AZ",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b88eb",
      "summary": "four or five dots moving in wierd directions, then they all suddenly disipeared.",
      "city": "glendale",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "four or five dots moving in wierd directions, then they all suddenly disipeared. ok, me and my friend we're swimming in our pool, we looked up to the sky, and there was a small dot. it moved at what seemed like normal speed. we knew it wasnt a plane, because it would go in one direction then suddenly start going in the other direction. it wasnt a balloon because, it wouldnt suddenly start going in another direction. first there was only one then more joined in.  after about 15-20 minutes, they all suddenly disipeared.  no wear to be seen  now, we thought of the possabilities.   it couldnt have been a plane, a weather baloon, a normal balloon, or any thing. a ufo was the only thing we could think of that would do thoes things. this has happened to me twice.   once on that day, and once at school.  (im an 8th grader)  please dont think this as a joke or anything!  first it was only me and a friend at school.  then its with me and some other friends. It seemed to happen around the same time. It was to high up to be able to identify the shape. it was really wierd. i would say it was just all in my head, but there were other witnesses.  i know i'm a kid, but i dont care what we saw was real ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70766.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8a56",
      "summary": "2 eggshaped objects over Glendale Az. near stadium.",
      "city": "glendale",
      "shape": "egg",
      "date": "2009-12-12T00:00:00",
      "story": "2 eggshaped objects over Glendale Az. near stadium. \tI was in my front yard with my girlfriends 2 grandchildren Vanessa and Stephanie. We were setting up a Halloween display in the yard. Above us circling around the area was a blimp. Not an uncommon sight, we live close to the stadium where the Cardinals play. It was there filming for the Cardinals football game. Which reminded me we must finish up so I don’t miss any of the game. I told the girls “wave” to the blimp. It was at that point I noticed a white object above the blimp. Vanessa saw it too. It was just sitting there not moving. I asked Stephanie to get my binoculars. We watched this white egg shaped object for maybe 5 minutes when all of a sudden as I have the object in view, a dark object fly’s up right next to the white one. They are just sitting there together for about 2 minutes then the dark one speeds off to the south. They were both the same size ,same shape just different color. We turned our attention back to the white one which had moved to another area in the sky. At one point it looked as though it was close to the flight path of planes. I remember thinking to myself “The guys driving that blimp could have seen this object, or the pilots of the planes”. Altogether we watched this for about 20 minutes total till the object vanished.",
      "link": "http://www.nuforc.org/webreports/072/S72934.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f53",
      "summary": "7 lights about, flashing on and off, in a straight line, horizontally, white",
      "city": "glendale",
      "shape": "formation",
      "date": "2009-12-12T00:00:00",
      "story": "7 lights about, flashing on and off, in a straight line, horizontally, white THERE were 7 lights, flashing on and off. one after another. They were towards the White Tanks Mountains, in Glendale Arizona. They were white lights, in a straight row. It was kind of weird, just seeing these lights go on and off. It happend from 7:50-7:53. Ilive on Luke AFB,and it was very cool, a once in a lifetime sighting!!!",
      "link": "http://www.nuforc.org/webreports/073/S73077.html",
      "state": "AZ",
      "duration": "10 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b9987",
      "summary": "large clear ball shaped orb  in Glendale..  day time sighting",
      "city": "glendale",
      "shape": "circle",
      "date": "2009-05-12T00:00:00",
      "story": "large clear ball shaped orb  in Glendale..  day time sighting In my back yard facing West at 11 am..  I saw out of the corner of my eye a large , white, clear ball shaped unknown object. It moved VERY fast from the South behind me and stopped in the North East sky and hovard for about 30 seconds. I have never seen anything like it.. It was almost clear. Like looking at a mirage or a jellyfish, but in a perfect ball.  It then sped up going East for a few miles then turned West and shot off  ..  It was not a balloon..  I saw another report  from Queen Creek Az.. 25 mins before this I did see a strange flat , black  helicopter going Northwest- Right where the orb shot off to.. I took photos but they were to fuzzy. I found it interesting that two people from across the valley see the same weird object. I felt like it was observing me.. It moved almost like a hummingbird does.",
      "link": "http://www.nuforc.org/webreports/069/S69809.html",
      "state": "AZ",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d0d",
      "summary": "Floating silver object over Utah.",
      "city": "glendale",
      "shape": "circle",
      "date": "2008-07-05T00:00:00",
      "story": "Floating silver object over Utah. While driving on my way back from Bryce, Utah, the sky was unusually blue and cloudless and needing to take my eyes off the monotonous road for a few moments, I looked up at about a 30 degree angle so I could still keep an eye on my driving. I spotted a silver object hovering in the sky. Taking it for a plane, I returned my focus to the road. But within a few seconds, I glanced up again to see where the plane had moved to and it was still in the same spot. I watched it with full concentration, thinking perhaps it was a plane flying toward me, so it would soon get bigger as it approached. But it didn't. It stayed in the same exact spot. As I observed it longer, I noticed it was round in shape, not long and thin like an airplane and bright silver against the sky. I had to return my attention to driving again but when I returned my gaze, thinking the unidentified object was probably gone, it was still there. This charade lasted about five minutes. I literally blinked and it had vanished. I searched around the sky as thoroughly I could but it was nowhere to be seen.",
      "link": "http://www.nuforc.org/webreports/064/S64325.html",
      "state": "UT",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f66",
      "summary": "Metallic cone shaped disc flying near 2 freeway in Glendale, CA",
      "city": "glendale",
      "shape": "cone",
      "date": "2010-06-23T00:00:00",
      "story": "Metallic cone shaped disc flying near 2 freeway in Glendale, CA I was driving south on the 2 freeway in Los Angeles, California, approximately about 1 mile before coming up to the Mountain St exit in Glendale.   At my 1 o’clock, on the horizon I noticed a very bright object in the sky.  I thought it was a plane banking and reflecting the sun light.  The object was moving towards me, heading north parallel to the west side of the freeway.  As it approached I could see that it looked like a sphere flying in the air, clearly not an airplane shape.  The object kept coming, as it got closer and the glare went away I was able to get a good view of it from the passenger’s front window. It was a metallic disc, with conical shape at the bottom and top, rhombus shaped profile.  It had no windows, lights or moving parts.  I was a metallic color, resembling what an unpainted aluminum aircraft body would look like and it had no markings on it.  It was moving in a straight line with no signs of leaving any trail behind it.  To the best of my a! bility I’d estimate the object was about the size of  a helicopter maybe bigger, flying some 350 meters off the ground at a speed similar to a plane.  The object flew with the edge of the disc pointing to the ground at a steep angle, the face of the disc pointing forward.  The closest it came to me was about 400-500 meters.  The whole sighting lasted about 15 seconds.",
      "link": "http://www.nuforc.org/webreports/075/S75882.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba168",
      "summary": "Rather large UFO falls to earth in a ball of fire over Southwest US",
      "city": "glendale",
      "shape": "fireball",
      "date": "2009-06-09T00:00:00",
      "story": "Rather large UFO falls to earth in a ball of fire over Southwest US While sitting on porch witnessed a fireball, enter our atmosphere and fall.  Must have been quite large metior or whatever, because the fireball was quite bright and large.  It burned bright green and orange and then dimmed for a brief second. and then got really bright again.  About half way down object stopped buring as it fell to earth.  Now I have seen shooting stars, but this item was so large and bright I was concerned it was a missle at first.",
      "link": "http://www.nuforc.org/webreports/070/S70184.html",
      "state": "AZ",
      "duration": "3 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba298",
      "summary": "silent triangle craft in North Phoenix",
      "city": "glendale",
      "shape": "triangle",
      "date": "2009-05-12T00:00:00",
      "story": "silent triangle craft in North Phoenix While looking thru binoculars at stars, planes,etc. I noticed a large triangle moving slowly from the Northwest. It is slightly overcast and thought at first it was the clouds making the stars look like they were moving. I noticed the craft was moving with a cloud , or what looked like a faint cloud.  So I placed the binoculars on top of my childs swing set and sat on the slide, as not to touch them and cause a false sighting. To my surprise the craft was moving and I had to keep turning to follow the it. It flew directly under the big dipper and blocked out many stars as it passed in front of  them. I eventually lost sight of it in the Northeast sky. each tip of the ship had a faint white light on it. The lights were not of a normal plane of any kind that I have seen, they looked like a very faint stars. Could not be seen with naked eye...",
      "link": "http://www.nuforc.org/webreports/069/S69807.html",
      "state": "AZ",
      "duration": "10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba39e",
      "summary": "we dont know if they where space crafts or not. htye where to high up. two of them would head strait for eachother then suddenly break",
      "city": "glendale",
      "shape": "unknown",
      "date": "2009-04-14T00:00:00",
      "story": "we dont know if they where space crafts or not. htye where to high up. two of them would head strait for eachother then suddenly break off. they where to high up so we couldnt see the shape. they could have been stunt plains for all we know.it wasnt just me who saw them so i know they where there. like i said they where to high up so we dont know if they where space crafts or people in stunt plains. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69406.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba54e",
      "summary": "I went out to throw out the trash and looked up at the sky to look at the moon and noticed a glowing object still. The object was south",
      "city": "glendale",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "I went out to throw out the trash and looked up at the sky to look at the moon and noticed a glowing object still. The object was south-west from the moon, it seemed to shift form slowly but it stood still. I went inside to tell my girlfriend to come outside to see if she saw the object as well, she did. The object was right above the Griffith Observatory so it seemed from my perspective, the object still non moving glowing somewhat light-red and orange and gradually shifting form to somewhat triangula shape. Pointed towards the direction of the moon. Slowly it began to move after 5 minutes. The moon was south-east from my perspective. The object slowly moved paralled towards the moon, gradually increasing speed still glowing but throughout it made no sound. It crossed through and left without a trace until it was unseen to the eye.",
      "link": "http://www.nuforc.org/webreports/071/S71465.html",
      "state": "CA",
      "duration": "12 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba7bb",
      "summary": "Strange lights over Glendale, Arizona.",
      "city": "glendale",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Strange lights over Glendale, Arizona. Three bright lights were heading North when they suddenly changed direction and turned back South in a matter of a second.  The lights continued to move at an increasing pace, now heading West.   We had tried to keep up in an automobile for as long as we could, but the lights had shot out and extended far West at an incredible rate until they could no longer be seen. P.S.--I tried to call the telephone line and I was only welcomed with a rude response that I was creating a hoax.  I feel as though I was discriminated against for being so open about my experience. ((NUFORC Note:  We apologize to the source of the report, if, in fact, it is a serious report.  However, we received his telephone call amidst a number of other calls from the same area code at about the same time our Hotline received a number of other calls from rude, impudent, foul-mouthed youth, who apparently placed calls to hoax and pester our Center.  We are uncertain as to whether this is a serious report, but the source of the report claims that it is.  Again, we apologize is our assumption that the call was a prank was wrong.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67949.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8bf",
      "summary": "Two lights moving in multiple directions with a sparkling trail behind them that disappeared when they'd stop and then reappear.",
      "city": "glendale",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Two lights moving in multiple directions with a sparkling trail behind them that disappeared when they'd stop and then reappear. My girlfriend and I were leaving a local store in Glendale, AZ  just before 7:30 PM on 10/23/10, and while we were walking to the car we both noticed a single light that resembled a very close meteor. The first light had a tail behind it that disappeared when the light remained still. Within seconds another light was visible directly next to the first.\t \tThe two lights began to move in the same direction at about a 55 degree angle to the N/NW of where we were standing, and both had tails behind them at that point. They were moving up and to my right,  immediately changing to separate directions, and began to move downward, then continued to move in multiple directions. (one would spiral down while the other would zip in the opposite direction and vice versa) \tMultiple times both lights would look as if they had burned out or moved behind clouds and then reappear just as brightly as before. This lasted for about 5 minutes, then it seemed they were too low to see from where we were. The lights were very bright (almost white) and the tails were similar to sparks. The shape was round or possibly oval. There were also two other women in the parking lot that observed the entire occurrence, but I didn’t get their names.",
      "link": "http://www.nuforc.org/webreports/078/S78541.html",
      "state": "AZ",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba974",
      "summary": "A V-shaped object in the night sky, no noise, could only be seen with binoculars",
      "city": "glendale",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "A V-shaped object in the night sky, no noise, could only be seen with binoculars I was visiting friends in Glendale, California just after the wildfires had begun to subside.  We thought we might be able to see them at night, I believe we heard there’d been another flare-up even though it’d been about a week or more since the really intense ones. So we were outside about 11p.m., standing on their quiet residential street when the 3 of us, me (57 years old), my friend (about 54), and his mother (about 86) saw a jewel-like thing shining in the northern sky, somewhere above Montrose.  It didn’t move, it was very small, didn’t glow or change colors (kind of clear, actually) but very noticeable. My friend went in to get binoculars to see if we could get a better look at it, and when he did, his mom and I looked away at stars and lost sight of it.  When he came out we could not find it, so they eventually went back in the house, but I decided to stay outside and just look at the beautiful California night sky. I’d occasionally put the binoculars up to my eyes, and since I wear glasses I had to keep adjusting them, not knowing whether to adjust them to my regular eyes without glasses or with my glasses on. I finally just left my glasses off and began looking up, straight up. Suddenly I saw a V-shaped object moving slowly southward. It did have smaller V shaped designs or window or something greenish colored, but not lighted, more of a glowing, I just followed it for a few seconds, maybe 5-10, then tried to look without binoculars.  But I saw nothing, even with my glasses on. When I put the binoculars back up to my eyes, I saw the same type of object except it wasn’t green, it was an ORANGE colored V-shaped object, also moving slowly southward.  I have no idea if it was the original object, or a second one, or what.  Again, no lights, more of a glowing of smaller V-shaped designs within the larger V-shaped object.  The point of the V led the object.  I could near nothing, nor see anything without the binoculars and have no idea how far up, or how big it was. I just guessed that it was some kind of military plane or something, I didn’t know UFO’s were ever reported to be V-shaped, until I saw something on TV last night (Oct 20, 2010) so I decided to report what I saw.",
      "link": "http://www.nuforc.org/webreports/078/S78509.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baf0b",
      "summary": "Mid-morning 11:30, clear skies, I watched three lights with erratic movement for 30 minutes before disappearing.",
      "city": "glendale",
      "shape": "light",
      "date": "2011-03-10T00:00:00",
      "story": "Mid-morning 11:30, clear skies, I watched three lights with erratic movement for 30 minutes before disappearing. It is extremely too late to report this sighting, but I just had to.  I do not remember the day; but, it was in 2002 mid-summer Glendale Arizona.  I finished shopping at the Fry’s Grocery store at 51st. Ave/ Olive.  I lived at 51st. Ave. and Bell Ave. which is a straight shot north to home.  I owned a black jeep wrangler at the time which I had the top off.  A beautiful day, I noticed lights through the upper part of my windshield.  There were three, round lights. I watched them as I continued home.  They moved in all directions and at times disappeared and reappeared.  Up/ down, come together and separate. I must of watched them for 20-30 minutes.  When I pulled in my driveway I rushed in to get my binoculars and was unable to find them.  I ran out to see if they were still there and they were. I ran to the neighbors to have them look too; but, no one was home.  I am really sad to this day that I was unable to share/ witness this.  The lights retreated up as far as I could tell and vanished by light or by distance it was hard to tell. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80407.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baf67",
      "summary": "Saucer seen in Glendale, AZ.",
      "city": "glendale",
      "shape": "disk",
      "date": "2011-01-31T00:00:00",
      "story": "Saucer seen in Glendale, AZ. Me and my husband were standing in my sister in laws backyard.  The sky was blue and clear, and there were no clouds at all.  My husband said look I think it's UFO. I looked and I saw it too. It had a tall chrome domed shaped top.  The bottom kind of looked like a cooking wok but it was solid shiny lacquer black.  When we first saw it there was a type of loud noise like a jet engine, and then it was quiet. It stayed in the same spot in the sky without moving. Then my husband said to go get the binoculars so that we could get a closer look at it.  So I went to get them in our car that was parked out front. When I came back, I went through the house and back to the backyard.  My husband came under the awning and got the binoculars from me. When we stepped back out onto the lawn the UFO had vanished.  The loud jet engine noise was heard again but we saw nothing.   Seeing the UFO didn't scare us though, and we both said it made us feel at peace in the moment like it was not there to harm us.  Neither of us were under the influence of drugs.",
      "link": "http://www.nuforc.org/webreports/079/S79668.html",
      "state": "AZ",
      "duration": "10-15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb325",
      "summary": "3/18/11 7:35 P.M Glendale, AZ Fireball falling from sky turns into 6 large glowing lights.",
      "city": "glendale",
      "shape": "fireball",
      "date": "2011-03-23T00:00:00",
      "story": "3/18/11 7:35 P.M Glendale, AZ Fireball falling from sky turns into 6 large glowing lights. March 18, 2011 Glendale, AZ 7:35 P.M  I was driving home from work and saw a light falling from the sky.  I turned onto Frier DR and 67th Ave in Glendale, AZ at 7:35 P.M when I noticed a light falling from the sky.  I stopped and got out of the car.  It looked like a single Firework falling from the sky instead of going up in the sky.  It was falling from the sky at a fast pace.  It then split into 2 falling “Fireworks” and continued to fall from the sky at a fast pace.  From the speed it was falling from the sky, I figured it was a meteorite.  All of a sudden both falling lights ran into each other and formed 1 falling “Firework”.  It then stopped and formed 5-6 steady lights that just stopped and stayed in one place.  The lights were not in a straight line.  I then started driving towards the objects in the sky.  It felt like I was getting closer to the objects and I thought I was about to see one of the lights up close but some trees got in the way.  By the time I got by the trees it was gone. I have no idea how far away I was from the initial sighting and how high in the sky it was.  From what I saw it lasted about 4 minutes.  There is an Air force base around the area of where the lights where coming from.  From where I was at, at the time of the sighting, I'd say I was about 10 miles from the Air force base.  The steady lights that I saw were big.  It was not an airplane. I was so curious and so quick to pick up the phone that I don’t remember if I saw 5-6 or 7 lights.  Like I said I thought it was a meteorite at first and didn’t think I needed to video tape it.  And I thought that my mind was playing tricks on me after seeing that horrible movie Battle Los Angles.  But I know what I saw and it was defiantly strange looking.  The speed that these lights were falling at and then to just stop and turn into steady glowing lights and sit in the sky was amazing.",
      "link": "http://www.nuforc.org/webreports/080/S80523.html",
      "state": "AZ",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb32c",
      "summary": "A very fast moving object that leaves a trail of white light then bursted brightly then dissappeared in a clear night sky",
      "city": "glendale",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "A very fast moving object that leaves a trail of white light then bursted brightly then dissappeared in a clear night sky It was a horizontal parallel light moving fast traveling about a half a block A-B, like someone drew two white lines in the sky, then stopped flashed a bright light then dissappeared. no noise and for sure someone not only me has seen it as i was walking on the sidewalk as cars pass by, its windy no clouds and clear skys ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78803.html",
      "state": "CA",
      "duration": "very fast"
    },
    {
      "_id": "64d005f478aba2ec5a3bb502",
      "summary": "Green light streaked across the sky at a low level and then disappeared",
      "city": "glendale",
      "shape": "light",
      "date": "2011-01-31T00:00:00",
      "story": "Green light streaked across the sky at a low level and then disappeared My daugther and I were sitting at my older daughters soccer game, when I looked up and saw a light streak across the sky and then disappear. I started to make a wish thinking it was just a falling star, but then realized it was much to low for that and it went in more of a vertical direction and was green in color. The light appeared to be just above the school gymnasium rather then high in the sky like you would see with a falling star.  I then said something to my daughter sitting next to me and she said \"wow, you saw that too!  I wasn't going to say anything because I just thought that was my imagination\".   Once we were home from the game and we were eating dinner my younger daughter and I started talking about it and that's when my older daughter spoke up and said \"You saw that too?! I just happened to look up in the sky when I was out on the soccer field and saw this green light fly across the sky above the gymnasium and then disappear.\"   I find that inte! resting because we had not said anything about it being green or right above the gymnasium, so it appears that she saw the same thing that we did.",
      "link": "http://www.nuforc.org/webreports/079/S79733.html",
      "state": "AZ",
      "duration": "4 to 5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5bd",
      "summary": "Flashing object in the sky disappears within seconds",
      "city": "glendale",
      "shape": "flash",
      "date": "2010-08-24T00:00:00",
      "story": "Flashing object in the sky disappears within seconds I was getting out of my car and a bright light in the sky caught my eye. The light would dim then become very bright again. It didn't appear to be very far away. It was moving at a moderate speed. There was a small trail following the object.  I couldn't keep my eyes off of it! Within about 10 seconds after i noticed the object, it completely disappeared.  I told this to my fiance, and he looked at me like a had two heads. We went over to a friends house which was about 10 miles away from mine.  I decided not to say anything in case i had the same reaction i got from my fiance.   As we we're getting out of the car, my friend says, \"You will never believe what i just saw.\" Our stories were way to similar to be a coincidence. I'm glad my fiance no longer thinks I'm crazy!",
      "link": "http://www.nuforc.org/webreports/077/S77151.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb714",
      "summary": "An oval ship that  disappeared and appeared at diffent spots.",
      "city": "glendale",
      "shape": "oval",
      "date": "2010-08-30T00:00:00",
      "story": "An oval ship that  disappeared and appeared at diffent spots. They appeared on the corner of San Fernando Rd. and Elk Ave at 16:30.  The ship was oval and small.  It would disappear and appear in different location and stand still.  There was absolutely no noise or lights coming out of the ship. It disappeared and appeared three times.  On the third time it made a really fast zig zap motion and disappeared.  I have a couple of pictures taken on the phone",
      "link": "http://www.nuforc.org/webreports/077/S77407.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb79b",
      "summary": "Big green light fall out of the sky.  ((NUFORC Note:  Meteor??  PD))",
      "city": "glendale",
      "shape": "circle",
      "date": "2010-08-24T00:00:00",
      "story": "Big green light fall out of the sky We drove home through the canyon. Before we drove up to our home, a big green circle fireball \"fell\" from the sky.  It was to big for a flyer.  Because we live in a mountain area, it's hard to estimate how far or where it landed.  ((NUFORC Note:  Meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77262.html",
      "state": "CA",
      "duration": "3 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bba94",
      "summary": "A light seen traveling through the sky at high altitue at a very high speed before dissappearing",
      "city": "glendale",
      "shape": "unknown",
      "date": "2010-07-06T00:00:00",
      "story": "A light seen traveling through the sky at high altitue at a very high speed before dissappearing I am a member of the U.S. Air Force and the sighting occured on Luke AFB.  Shortly after exiting a building, a motion in the sky in front of me caught my attention.  I looked up to see a light which appeared to be very high moving very fast.  I was facing south and the the object was visible above a building in front of me, moving south as well.   Because of the distance the object appeared very small, and was indiscernable as anything other than a single bright blue light.  The best discription i can give is that it looked excactly like a meteor, and in fact at first i thought that was what i had seen.  The difference was that this object had no tail associated with meteors i have seen in the past, and it zig-zagged, darting both to the right and left before dissappearing.  It was only visible for just over a second.   I work with aircraft every day and am used to seeing them at night both civilian and military, this was not like anything i have seen before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75990.html",
      "state": "AZ",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bc33a",
      "summary": "UFO over Luke AFB Glendale,AZ",
      "city": "glendale",
      "shape": "sphere",
      "date": "2011-10-10T00:00:00",
      "story": "UFO over Luke AFB Glendale,AZ We were staying in a housing unit on Luke AFB in Glendale,AZ which is a suburb of Phoenix, I would also like to add that we live in the Eastern time zone so we were waking up quite early being that Arizona is 3 time zones ahead of us and we enjoyed having our morning coffee on the back patio which gave us an unobstructed view of the Northern and Eastern Arizona sky and the beautiful sunrises. It was on the morning of the 26 of September 2011 which was a Monday that we noticed a bright white object in the Northern sky heading due South directly over the Base at a high rate of speed,  it then came to a sudden stop and stayed suspended in the sky directly overhead, then from a complete stand still it reversed course and flew back over the base in a Northerly direction at a very high rate of speed and then came to a complete stop once again about 3 miles north of the base, the object then started to glow and become very bright just like a light bulb does rite before it blows out and within 10 seconds it shot straight up into space and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84291.html",
      "state": "AZ",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3e1",
      "summary": "UFO`S with B2 Bomber.  ((NUFORC Note:  Two unidentifiable objects in photo, but possibly birds, we believe.  PD))",
      "city": "glendale",
      "shape": "circle",
      "date": "2012-01-12T00:00:00",
      "story": "UFO`S with B2 Bomber On January 2nd 2012 at 08:04 AM I took this picture of the B2 stealth bomber with my camera flying over my house and this is what appeared it seems to be two UFO`s flying with the B2... what do think? ....This photo is untouched! ((NUFORC Note:  Two unidentifiable objects in photo, but possibly birds, we believe.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86352.html",
      "state": "CA",
      "duration": "picture"
    },
    {
      "_id": "64d005f478aba2ec5a3bc528",
      "summary": "UFO over Luke AFB Glendale,AZ",
      "city": "glendale",
      "shape": "sphere",
      "date": "2011-10-25T00:00:00",
      "story": "UFO over Luke AFB Glendale,AZ We were on a 2 week vacation in Arizona and were staying in one of the housing units on Luke Air Force Base which sets about 15 miles West of Phoenix.  It was on the morning of the 26 which was a Sunday when we had awoken early as usual and were setting on the back patio having our cup of coffee waiting for the sun to rise.  It was about 30 minutes before sunup when I happened to look into the Northern sky and noticed a bright white round object flying directly towards us at a very high rate of speed heading directly over the base in a Southerly direction, I then stood up so I could could see over the roof and noticed that the object came to a sudden dead stop and hovered in the sky almost directly over the base,  it then reversed course and flew back North at a high rate of speed and it came to another dead stop in the Northern sky about 4 miles North of the base, it hovered there for about 20 seconds and then it started to glow very bright just like a ligh! t bulb does when it is ready to burn out, it then shot straight up and disappeared in the blink of an eye. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84751.html",
      "state": "AZ",
      "duration": "7 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc5f6",
      "summary": "whoosh sound doppler the sound of plane propeller, prompted turn to north, object uncloaked, traveled east cloaked to dissapear",
      "city": "glendale",
      "shape": "triangle",
      "date": "2011-10-25T00:00:00",
      "story": "whoosh sound doppler the sound of plane propeller, prompted turn to north, object uncloaked, traveled east cloaked to dissapear walking south in neighborhood heard a propeller plane and after spotting the plane i heard a whoosh, and the sound of the propeller Doppler off of the whoosh sound which prompted me to turn around to my northwest and the object uncloaked to let me see it and then traveled east in a beautiful motion traveled a little faster then cloaked to disappear.",
      "link": "http://www.nuforc.org/webreports/084/S84634.html",
      "state": "AZ",
      "duration": "15sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc653",
      "summary": "I'm walking to work and there was a white ball flashing and falling down as if it was a New Years Eve ball from the countdown.",
      "city": "glendale",
      "shape": "flash",
      "date": "2011-12-12T00:00:00",
      "story": "Im walking to work and there was a white ball flashing and falling down as if it was a New Years Eve ball from the countdown. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85711.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd70",
      "summary": "Fireball on the top of  mountain behind Luke Air Force Base, AZ.",
      "city": "glendale",
      "shape": "fireball",
      "date": "2011-05-29T00:00:00",
      "story": "Fireball on the top of  mountain behind Luke Air Force Base, AZ It was around 10pm and my husband ran through the front door almost paralyzed w/ fear.  He ran down the hallway and I followed asking him to please tell me what was wrong.  He initially said, \"I can't tell you and I'll never tell anyone\".    I kept at him and he suddenly grabbed me by the arm took me out the front door pointed up to the top of the tall hills on the back side of Luke Airforce base and said, \"That's whats wrong.\"   He then ran back into the house.   I stood there focused on what appeared to be a glowing fireball on the very top of the mountain.  I watched it for a while then yelled to my husband that I was going to take the truck and go up there, as it looked like a crashed craft of some sort.  He became hysterical and said, no way.   I then saw jets being scrambled from Luke AFB and a few minutes later I could see headlights from vehicles climbing the mountain trying to get to the fireball.  The road back there is part of the Base, so I assumed they were Base security climbing the mountain.  They only got about half way up the mountain and either stopped or shut off their headlights.   I went back in the house and tried to call local news (perhaps channel 10?).  There was a busy signal, which I thought was odd for a news station.  I managed to calm my husband down enough to tell me exactly what had happened to him while he was on his way home from his meeting and he put his hands on his head and said, that he was on his way home and came to a stop because the man in front of him had stopped suddenly.   You have to understand this is out in a very sparse desert area where it is pitch black w/ no street lights.  He had his window down and then a \"huge\" object floated over his car and the man in front of him.  The man in front of him also had his head out of the window.   My husband said there was no sound at all, but it blacked out the stars above seeming like it took an eternity to pass directly over the two idling vehicles.  My husband said, he yelled at the man in front of him a! fter the object finally passed over and said, \"You saw that right?\"  He said, the man said \"yes, but would never tell anyone that he did\".   My husband said, the huge object floated rising slowly and went to the top of the mountain just on the back side of the base and that's when he had run into the house and into the back bedroom, completely ridden w/ fear. So, I can only report the fireball that I witnessed that I thought looked like a crashed craft as it completely lit the top of the mountain. But the whole story needed to be told, as my husband has NEVER been the same.  It shook him to his very core and would refuse to talk about it as it brought back the intense fear. After a while the fireball on top of the mountain slowly began to fade, but remained glowing for about two hours.  I get angry at myself for not taking the truck up there to see for myself, but it's very rugged terrain to get up there even w/ a dirt road or a fire road on which to travel.   It has taken me this long to tell this eye witness account, but now it is told.  By the way, I went to the front of the Air Force Base (about 3 blocks away)  the next day and it was locked down tight.",
      "link": "http://www.nuforc.org/webreports/081/S81234.html",
      "state": "AZ",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3e8",
      "summary": "Four bright orange lights. Not at all like airplane.",
      "city": "glendale",
      "shape": "",
      "date": "2012-08-05T00:00:00",
      "story": "Four bright orange lights. Not at all like airplane. Four bright orange lights.  Moving slowly.  One higher than others.  They then in a matter of seconds disapeared ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90588.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd90a",
      "summary": "2 objects with flame trails  making manuevers spirals lights",
      "city": "glendale",
      "shape": "",
      "date": "2012-10-30T00:00:00",
      "story": "2 objects with flame trails  making manuevers spirals lights seen 2 objects white in color might have been disk shaped in the sky 2 miles out and around 1/2 miles high with flame trails they did some manuevers or dancing for about 45 seconds light went off once or twice then came back on then did some spirals then were gone..   When it was over there were at least 20 or so fighter jets making a perimeter aroud the valley",
      "link": "http://www.nuforc.org/webreports/093/S93507.html",
      "state": "AZ",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd92f",
      "summary": "Two of the red fireballs chasing police helicopter also have a photo",
      "city": "glendale",
      "shape": "fireball",
      "date": "2012-07-04T00:00:00",
      "story": "two of the red fireballs chasing police helicopter also have a photo seen three red fireballs of lights coming from east to west moving very slow and a police helicopter was in the vincinity allso seening  the lights or fireballs flew under the fireballs that are in v shape the far right fireball chased the police helicopter to minutes after the left fireball chased the other fireball and police helicopter the center red fireball came right over us vanish about two minutes the back of the object was oval shape white ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89868.html",
      "state": "CA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd96c",
      "summary": "Three fireballs chased after police helicopter",
      "city": "glendale",
      "shape": "fireball",
      "date": "2012-07-04T00:00:00",
      "story": "three fireballs chased after police helicopter Seen three red fireballs of lights coming from the east to west moving very slow and  a police helicopter flew under the v shape red fireballs going north the right fireball chased after the police helicopter 2 mins later left fireball  also chased the police helicopter the center red fireball flew right over us and VANISH about 2 or 5 mins later it was a white oval shape ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90114.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb7d",
      "summary": "Rod/Stick Shaped UFO over Los Angeles",
      "city": "glendale",
      "shape": "other",
      "date": "2012-08-05T00:00:00",
      "story": "Rod/Stick Shaped UFO over Los Angeles Just saw a UFO over Los Angeles. I'm in Glendale, CA and it was flying South West of where the 5 and the 135 freeways meet.  Maybe 1,500 feet above the ground.  It looked like A vertical stick, red on the ends, metallic in the middle.  On the middle chrome part it had white and blue lights.   It floated in the air for a few mins, then slowly started to travel South West until it was out of sight.  I know it's too perfect, and creepy, but a black unmarked helicopter flew above us right after the sighting.  This was my first UFO sighting.",
      "link": "http://www.nuforc.org/webreports/091/S91031.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd25",
      "summary": "UFO Sighting at Scholl Canyon, Glendale, CA",
      "city": "glendale",
      "shape": "disk",
      "date": "2012-09-24T00:00:00",
      "story": "UFO Sighting at Scholl Canyon, Glendale, CA I was up at Scholl Canyon in Gledale California with a friend of mine. Parked all the way at the top we were having some cigarettes and just talking about life. From the get go we noticed that there were many animals out even though it wasn't a full moon.  At about 6:20 we noticed someone in a motorcycle drive up. He looked very mysterious and went past the point of no entrance. Like 10 minutes later he came back down and my friend and I both thought it was very suspicious. At about 6:30u friend said he was hearing something,  I had no idea what he was talking about. After a couple of cigarettes we decides it was time to leave since it was getting dark. When we got in the car we noticed a huge object in the sky on top of the hill in the direction of where the person in the motorcycle had gone. I couldn't believe what I was lookig at.  It wasn't far at all and it looked like a saucer. There were windows around it and it had really bright lights. After about 3 mi! nute it dissappeared as if it somehow knew that we saw it ( maybe because I turned my car on). I proceeded to driving towards it where the guy in theotorcy me had gone and the skies were clear.  There is no way something that big could have disappeared do fast. Without a doubt it wasn't any craft like the ones I've seen before.",
      "link": "http://www.nuforc.org/webreports/092/S92835.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd5b",
      "summary": "Starlike colorful, red, blue, green, purple UFO that emerged from the other side of the hill.((NUFORC Note:  Sighting of Capella?  PD))",
      "city": "glendale",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Starlike colorful, red, blue, green, purple UFO that emerged from the other side of the hill Me and a friend were outside my home up in the hills near Glendale community college in Glendale, California, this has been happening all week starting on 10/13/12, when it gets dark and the stars come out, there is this bizzare starlike object, looks so different from all other stars in many ways: 1) its lower (closer to horizon) than all other stars, 2) its brighter and constantly changing colors randomly, red, green, blue, purple, 3) me and my friend were staring at it for a while, ten fifteen minutes straight and both came to the conclusion that it is not stationary, moving so slightly that u had to stare at it a while to notice the movement, goes left, stops, right, stops, towards us, stops, back, stops, all so slowly, always changing color. It basically moves but stays in the same general area, right where the star Sirius is supposed to be.  We pointed it out to a visitor arriving and he noticed movement as well. Just so bizzare, what is this please te! ll me? It has been eight nights in a row now. The most recent sighting was yesterday at 11:58PM we were looking at it to no avail when we finally see it emerge from behind the nearest hills visible from my balcony.  It moves slowly and to the right (we always see it when we are facing E/NE).  If u draw a line down towards the horizon starting from orions belt, its right along that line.  This had been going on all week, but last night, we saw it again, and this time, we saw it emerge from behind the hills, this eliminates any possibility that this starlike bright object is a planet or star.  I would go so far as to say that this object is in the Earth's atmosphere.  When we saw it last night, and recorded video, ended up moving from just above the mountain range far upwards and to the right, unlike any of the six previous (of seven) nights I stayed awake to spot it.  I suspect since it didn't stay in the same general area as it usually did, that it is leaving, and I will no! t see it again tonight.  I will try to keep everyone updated. ! We were suspicious at first, thinking this was the star Capella, or more likely the star Sirius, b/c it is in that same position every night, but seeing it come UP from BEHIND the hillside shows that it is not a star nor a planet/asteroid, anything from space.  It is within the Earth's atmosphere.  I have posted the recordings we have made on my youtube channel billdaburgereater, these are the links to the second and most recent sighting videos.  Though I cannot say for sure what it is, having seen it emerge from behind the hills, I can conclusively say what it is not.  The video does not capture the UFO emerging from behind the hill b/c when it did at 11:58PM, my roommate who has the camera was not home.  The second she got home, she set up the camera on a stand and I have included the following links to this description:  http://www.youtube.com/watch?v=29452Yl4kU4&feature=channel&list=UL (second sighting, not using camera stand 10/17/12)  http://www.youtube.com/watch?v=iyb8lce5qn0&list=PLFE3F8777B0C557FD&index=8&feature=plpp_video (most recent sighting 10/19/12)  http://www.youtube.com/watch?v=gabacCVbx1A&feature=bf_next&list=PLFE3F8777B0C557FD (better edited video w/commentary of the witnesses 10/19/12) ((NUFORC Note:  Sighting of Capella?  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93700.html",
      "state": "CA",
      "duration": ">2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bdde7",
      "summary": "12 - 20 lights flying in formation in phoenix sky video's linked in full description",
      "city": "glendale",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "12 - 20 lights flying in formation in phoenix sky video's linked in full description Lights in a formation traveling through sky.  Witnessed by wife and friend. They saw what was described as 12 - 15 lights that moved slowly until disappearing behind cloud cover. Found videos from two separate locations in the phoenix area. https://www.youtube.com/watch?feature=player_embedded&v=aKHf5dbJGYM https://www.youtube.com/watch?feature=player_embedded&v=0VYWkdReVk0 ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93776.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be995",
      "summary": "One  bright object , silent, no flashing lights, moving constant speed  several minutes until out of sight.",
      "city": "glendale",
      "shape": "sphere",
      "date": "2012-04-18T00:00:00",
      "story": "One  bright object , silent, no flashing lights, moving constant speed  several minutes until out of sight. Clesr night, walking dog, happened to look up in the southwest sky, a single bright light was moving about the same speed as a passenger airline.  There wasn't any noise at all coming from the object and no wing strobe lights (typical) with airplanes.  It was spherical and approximately 2 to 2 1/2 miles overhead.  The crafts speed was constant for the duration of the sighting and traveling Northeast towards Scottsdale / Carefree Arizona.  Holding a regular aspirin at arms length would match the size of the object.  A passenger airline was about 20 seconds behind the object,and of course the engine noise and strobe lights of the plane could easily be seen and heard.  The light of the object was the same brightness coming toward my direction, as well as leaving and moving away and past where i was standing.",
      "link": "http://www.nuforc.org/webreports/088/S88323.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beebc",
      "summary": "My husband I were in balcony and suddenly noticed this lights, orangish round and moving. They were very up there so immediatley I knew",
      "city": "glendale",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "My husband I were in balcony and suddenly noticed this lights, orangish round and moving.  They were very up there so immediatley I knew it was not aircrafts.  We noticed they were moving and spreaded all over but getting close to each other.I called channel 7 to ask if they could investigate, but we are very certain that they were forigen objects.  It was really cool specially they were sometimes flashing lights and there was no smoke or anything.",
      "link": "http://www.nuforc.org/webreports/096/S96735.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3befe9",
      "summary": "Observed two objects in night sky changing shapes and color,amazing detail when enlarged",
      "city": "glendale",
      "shape": "changing",
      "date": "2013-09-30T00:00:00",
      "story": "observed two objects in night sky changing shapes and color,amazing detail when enlarged On the night of 08/31/2013 the weather was still and night sky clear, my eyes were drawn to a very bright spot in the western sky.  The object seemed to be moving, like jittering about but still stationary.  It kept changing colors not flashing but pulsating from red to blue to yellow to green.  Not in that exact order.  So I took out my cell phone and started taking a series of pictures.  Now with the naked eye they just look like pretty lights in the sky, but when enlarged the most amazing details stand out showing what looks to me as a UFO constantly morphing or changing shapes and then cloaking itself and coming back. I would watch the object disappear but kept shooting pictures.  When I enlarged the photos you can actually see a spot in the sky where the object is and it seems to be covering itself with some sort of shield or as said a “cloak”   During this 15mins. I watched and photographed a 2nd object slowly rise from the ground til it was level with the 1st object with perhaps a hundred yards distance between them.  Now object # 2 behaved like object # 1..but with one difference.  Object # 2 mimicked # 1’s movements but shows like a mirror image beside it. Like object # 2 was casting a double image of itself  while # 1 remained a singular image. I would like to submit my photos of this event for investigation.   This event was witnessed by my wife and myself. Please respond if more detailed information is needed.",
      "link": "http://www.nuforc.org/webreports/102/S102646.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6da",
      "summary": "This object was awesome yet very creepy and spooky. It shined like the shiniest chrome ever. It was completely quiet.",
      "city": "glendale",
      "shape": "sphere",
      "date": "2012-12-20T00:00:00",
      "story": "On October 7th 2012, 12:15 in the afternoon. I was on the tennis court, practicing my serve.  When I tossed the ball in the air I saw a flash almost directly above me. My first thought was that it was a plane but quickly realized that it wasn’t. The object appeared as a long rectangle, like a steel beam used to build sky scrapers. It’s hard to know the exact length but I would guess 25 to 35 feet.  It was shiny silver in color. When I first noticed the object it was around 1000 feet and by the time the object had descended to 200/300 feet it had moved much closer in my direction.  Then the object stopped moving and just hung there.  I began back stepping and briefly looked to the ground and by the time I looked up again to the object it had changed form to a machine looking object made of silver balls. I drew a diagram of the flight pattern from when I spotted the object and I drew two different angles of the object.  The drawings are drawn from the best of my memory and resemble the object very well.....but not exactly. I had binoculars in my car and was able to see the object up close. I did take 3 pictures with my close to useless camera on my cell phone.  The pictures don’t show the object very well. I was awe struck viewing through the binoculars and by the time I had thought of taking pictures the object had traveled a good distance from me.  There are other reasons why I couldn’t take pictures earlier but it doesn’t matter. It is what it is. You have to zoom in on the photos and the object will come into view.  This object was awesome yet very creepy and spooky. It shined like the shiniest chrome ever. It was completely quiet. There was a black mist or haze surrounding the object that was not highly visible. I’m guessing that the haze served as camouflage, blocking some of the shine from the object. Traveling speed was 10 to 15 mph. The object would move a few hundred feet to the north and stop for a few minutes. Then move west a few hundred feet then stop. Then north, then south and so on. Until it disappeared in the western sky. Total viewing time of sighting was 15 to 20 minutes.",
      "link": "http://www.nuforc.org/webreports/094/S94680.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf92a",
      "summary": "Changing color UFO, sighted 4/24/13 near Glendale, AZ. Recording at 9pm Arizona time.",
      "city": "glendale",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "Changing color UFO, sited 4/24/13 near Glendale, AZ. Recording at 9pm Arizona time My sister and I were sitting outside around 9pm Arizona time when we noticed an light in the sky changing colors.  As we peered closely it started changing colors from red, blue, to green.  As we started recording it, it started moving across the rooftops adjacent to us. But im sure it was about a mile or two away from us.  The object would do massive U-turs, spinning as it was in zero gravity then instantly shift direction.  It was about 2 miles south/southwest of Univeristy of Phoenix Stadium and as i started recording it for about 3 mins it would hover over then change altitude and direction at the same time. It looked like a Diamond main body with two small triangles attched at the left and right bases making one big triangle. but there were seperation between the 3 objects.  As it passed by a jetliner off in the distance you could see the jetliners flashing lights thru the dark parts seperating the objects.",
      "link": "http://www.nuforc.org/webreports/097/S97354.html",
      "state": "AZ",
      "duration": "15+ minutess"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa68",
      "summary": "Bright orange sphere that turned into a star in less than a second.",
      "city": "glendale",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "bright orange sphere that turned into a star in less than a second On New Years Eve around 9pm I and 3 friends were having dinner outside. I was seated facing west and looked up to the sky and noticed a bright orange/red circle of light.  Immediately I stood up and said, \"Hey, what is that?\" There were no navigation lights visible, no strobe flashing and was very close to Luke air force base which is about 6 miles west of our location. It appeared to cut to the south briefly then north all while moving east directly towards us.  No sound could be heard and it stayed a constant glow.   Just short of being directly overhead of us it stopped and hovered for about 5 seconds then turned into an incredibly bright white light, and shot straight up and appeared to be a star in a matter of a split second then faded out of sight.   It was too high to begin with to be any type of fireworks not to mention traveling horizontally for too great a distance. this was not any type of Aircraft that we are familiar with.   Later that same evening, it was witnessed again by 2 other friends and was described exactly the same, as turning into a star.",
      "link": "http://www.nuforc.org/webreports/095/S95777.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfcb2",
      "summary": "UFO sighting over Glendale, AZ, on 9/28/2013 (150 orange objects).  ((NUFORC Note:  Report from ret. AZ Hwy. Patrol officer.  PD))",
      "city": "glendale",
      "shape": "unknown",
      "date": "2013-09-30T00:00:00",
      "story": "UFO sighting over Glendale, AZ, on 9/28/2013 (150 Orange objects) I am a retired state police officer from the state of Arizona after nearly 35 years of service.  I live in north Glendale, north of the Loop 101 highway in the area of  67th avenue. At approximately 7:15 pm, I happened to glance out my kitchen window that faces north, and I observed some bright orange lights traveling from the west to east.  It seemed unusual, so I went out into my back yard to investigate further.   At that time I observed multiple bright orange objects coming from what appeared to be the Lake Pleasant area which is approximately 15-20 miles northwest of my home.  They were traveling from the west to the east.   In my mind, I immediately thought these appeared to be Unidentified Flying Objects (UFO’s).  I immediately thought to myself, “If I don’t get pictures, nobody is going to believe me.”  I re-entered my home and got my I phone and started to take pictures.   The objects were being partially blocked by some trees on the golf course so I decided to go out on the golf course where I could obtain non-obstructed pictures.   I have a great interest in UFO’s and have done a fair amount of reading up on them and was convinced the probability was high that these were in fact UFO’s. I filmed these objects for probably over 5 minutes.  At one point my video stopped and I had to restart it again.  I was in awe because they just keep coming.  I would estimate as many as 150 of these orange objects.   It’s hard to estimate their speed.  They were not going as fast as a military jet and they were not stopped.  They seemed to maintain a constant speed that I would have to estimate at 150-200 mph.  I did not see any particular formation.  There would be 5-7 of them traveling together and others following behind in a line.   It appeared to me that when I first saw them coming from the Lake Pleasant area, that as they came higher they were trying to catch up to those ahead.  They maintained a constant orange glow with no flickering.  I observed no other lights on them, just the orange glow. I know that the Phoenix area had reports of a meteor last night.  This was not a meteor.  A meteor travels so fast that if you blink, you may well miss it.  Meteors are generally a white flash of light or fire looking and these objects were bright orange in color and had a controlled speed far less than a meteor.   This was not a weather balloon as the government might claim.  There were approximately 150 of them and they were rising at a speed inconsistent with a weather balloon.  These were not Chinese candles (candle lit objects that rise from the heat of the candle).  The objects were much too fast to be Chinese candles.   These were not military flares as some might think.  They were rising, not falling, as flares do after being shot into the air or falling after being dropped. Once again these objects were traveling from west to east at approximately 150-200 mph and as they passed just slightly east of my home they seemed to just disappear.   This parade continued for over 5 minutes.  As some would disappear, others would appear from the lake area. When all were gone, I went back into my house to call family to tell them what I had seen. Like most people out there some were believers and others had their doubts.  I thought “but I have video proof”, and when I went to view the pictures, nothing was visible, just a black screen.   I know what I saw and unless someone has a better explanation, I feel that I was fortunate enough to see what many of us hope to see someday and will not.   I have absolutely no reason to make false claims or file false reports. ((NUFORC Note:  We spoke via telephone with the witness, and we found him to be exceptionally objective and sober-minded, in describing his sighting.  We suspect that he is an exceptionally reliable and capable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102803.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe0e",
      "summary": "4 luminous objects flying low, slow and silent.  Glendale, MO",
      "city": "glendale",
      "shape": "unknown",
      "date": "2012-12-20T00:00:00",
      "story": "4 luminous objects flying low, slow and silent.  Glendale, MO On 24 November 2012, at 21:00 hours CST approx, while driving south on North Sappington Rd in Glendale, MO, I saw 4 luminous objects of unknown shape flying low, slow and absolutely silent.  Each of the objects had 2 amber colored lights at front and one red light at the rear.   The objects then turned to the East. These objects flew single file with unevenly spaced distances between them.   The last object in line seemed to cut off its lights as it was turning east.   The duration of this sighting was 5 minutes approx.  I inquired with several news media in St. Louis if anyone had made a UFO report for the same time and date, all said no. ((ADDENDUM FROM WITNESS)) I had a chance to review the latest sightings posted on NUFORC.  I reported a sighting of 4 luminous objects for November 24, 2012 in Glendale, MO.  I happened to note that someone in Kirkwood, MO at approximately the same time and location made a very similar sighting.  Glendale is situated between Kirkwood, MO and Webster Groves, MO. I believe the other witness in Kirkwood, MO saw the same objects I did.  This is highly interesting. God bless,((NAME DELETED))",
      "link": "http://www.nuforc.org/webreports/094/S94849.html",
      "state": "MO",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c056d",
      "summary": "Red bright orbs flying in formation then three flew past us climbing up into the night!",
      "city": "glendale",
      "shape": "light",
      "date": "2013-02-28T00:00:00",
      "story": "Red bright orbs flying in formation then three flew past us climbing up into the night! while driving down the 101 west just before 51st ave in Glendale we initially saw 10-12 bright red orbs hovering in a formation of the big dipper.   We wanted to get closer so we exited 51st and drove back towards the lights on the frontage road.  The lights began to disappear higher into the sky till there were none left.   We turned on 35th ave and saw another one moving past us at a high altitude.   We then pulled into a driveway that went into a open desert area and one came from the tree line heading towards us.  As it got closer it began climbing higher and was straight ahead of us and stopped.   From the same tree line a second ball of red light that had a cone of light shining from the top of the ball began to follow the first.   Once the second ball got closer to the first the first one began to take off again heading away from us and climbing higher into the night.   As the second ball followed the first ones path turning away from us a THIRD one began to fly towards us from the same tree line.  This one seemed closer and even bigger.  It turned away in a large turn and quickly sped behind the other two.   All three got to such an altitude that they disappeared.    Someone else had to see these flying they were right next to the highway! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96411.html",
      "state": "AZ",
      "duration": "10  minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c07e8",
      "summary": "Red lights in formation.",
      "city": "glendale",
      "shape": "formation",
      "date": "2014-01-10T00:00:00",
      "story": "red lights in formation 8-9 red lights were sighted flying in a 2-1-2 formation traveling from west to east.  The leading crafts faded out one by one until they were gone.  About 10 seconds after the last one disappeared a helicopter flew directly overhead.",
      "link": "http://www.nuforc.org/webreports/105/S105659.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d00",
      "summary": "Fireball-like objects above ASU West.",
      "city": "glendale",
      "shape": "fireball",
      "date": "2013-12-23T00:00:00",
      "story": "Fireball-like objects above ASU West. On 10/26/13, my mom and I were just leaving the Starbucks on 43rd Ave and Thunderbird.   While waiting to turn on the main street, hovering directly above ASU West campus, we noticed 5 flame orange/ red orbs horizontally aligned not moving at all.   We proceeded across the street to the campus for a better look and these orbs started changing colors between red and orange.   These objects were flying too close together to be any kind of commercial or military craft.   They began to ascend and fly toward the east, eventually we lost sight of those five.  Then, we saw another orange orb that seemed to be catching up with the others.   As I took a picture of it from my truck, it was as if the flash from my phone caught its attention and it stopped in mid-flight for about 5 seconds, then began flying again toward the eastern sky.",
      "link": "http://www.nuforc.org/webreports/105/S105476.html",
      "state": "AZ",
      "duration": "10 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0faf",
      "summary": "Triangular ufo.",
      "city": "glendale",
      "shape": "triangle",
      "date": "2013-12-02T00:00:00",
      "story": "triangular ufo My partner and i decided to have dinner out, so we went to glendale, new south wales, australia.   Whilst we were eating in our car i noticed lights in the sky from a distance.  I told my partner as we both were watching i took note of the time 20:45. We continued to watch as it got closer we came to realization it was triangular.   There was no sound coming from the object which was no more than 200 metres above us not even we could not see any sort of colour it blended with the night  we saw 3 headlights at the front and 2 red pulsing lights in the middle at the front of the aircraft than 2 pulsating red lights at the back it definitely was not human aircraft due to how low the thing was and how slow it was moving this is not a hoax this is legit myself and my partner saw it the event lasted for 5-7 minutes.",
      "link": "http://www.nuforc.org/webreports/104/S104710.html",
      "state": "",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f7e",
      "summary": "3 Orange lights.",
      "city": "glendale",
      "shape": "light",
      "date": "2014-02-14T00:00:00",
      "story": "3 Orange lights in the evening on 2-8-14 i was walking east bound home from the store, when i noticed an orange light in the sky, as i watched it walking  forward it appeared  to the NE and seemed to be getting closer, so i paused, took out my ear buds to see if i could hear anything indicating a helicopter, nothing, as i stood and watched it got smaller and higher then disappeared. so i continued on, after a few steps behind a tree i spotted a second strange orange light, a little further than the last, it went higher and got smaller till it too disappeared, the third i noticed as i got home, i sat and watched this one, it seemed a bit closer, flickering/pulsating orange light, it like the other two, went up, and got smaller and smaller until it disappeared.",
      "link": "http://www.nuforc.org/webreports/107/S107028.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c22af",
      "summary": "Silver object, daytime sighting, Glendale, AZ.",
      "city": "glendale",
      "shape": "circle",
      "date": "2014-04-18T00:00:00",
      "story": "Silver object, daytime sighting, Glendale, AZ. Mid day sighting.  A friend saw the craft and video recorded it . Two people saw an orb like silver object, high in the clouds, making fast zig zag motions and appearing to fade from view and re-appearing.  The video was enhanced digitally with 3x zoom and you can clearly see a white/silver circular object. https://www.youtube.com/watch?v=AbPjXOaMJjQ",
      "link": "http://www.nuforc.org/webreports/108/S108688.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2379",
      "summary": "10+ more orange orbs.",
      "city": "glendale",
      "shape": "sphere",
      "date": "2014-04-04T00:00:00",
      "story": "10+ more orange orbs. at around 9ish pm, my 5 yr old went out back, exclaimed \"wow pretty lights\"   i went out and littered through the sky there were 10-15 orange glowing lights,  i called my 12 yr old son out, he went and grabbed my stepdad and mom,  while i got my telephoto lens my son grabbed my camera and my stepdad grabbed the ladder, by the time i set up there were only 3-4 they were heading eastward, a few disappeared over the mountain, (south mountain i believe) the others continued up.  i have 28 photos but because of being telephoto leaving the shutter open left them looking like worms, one you can see the shape/",
      "link": "http://www.nuforc.org/webreports/108/S108191.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c26e1",
      "summary": "UFO seen by USAF Air Traffic Controller and the entire 4 man crew at Luke AFB in August 1974.",
      "city": "glendale",
      "shape": "light",
      "date": "2014-11-14T00:00:00",
      "story": "UFO seen by USAF Air Traffic Controller and the entire 4 man crew at Luke AFB in August 1974.  While on duty as the Tower Chief at Luke Air Force Base in 1974 we in the tower received a call from Command Post over the \"Hot Line\" at which time the Col. on the other end said that a resident of a nearby community called Sun City believes she see a UFO and ask us to speak with her.  I a Staff Sargent and the senior NCO in the tower took the call.  Immediately the lady started directing us to look West just above the White Tank Mountain range at which time she pointed out a rather bright glowing object located approximately 15-20 degrees above the peak of the White Tanks.  At first glance it looked somewhat like a star.  She kept asking us over and over \"do you see it, do you see it?\" to which we answered, \"no\".  I wish to point out at this time that we lied to the lady.  We saw the object all too well.  But, due to the extremely heavy amount of paperwork we would have to undergo not to mention a psychological assessment we answered her, no and that was a lie.  To this day I regret lying to this lady.  The actual incident was as follows.  The UFO was real and clearly visible.  It glowed orange to red and seem to move all about at approx 2-10 degrees each time it moved.  We observed this object for over a 45 minute period and suddenly, and literally in the blink of an eye it shot up and off to the right (North)at about a 15 degree angle off vertical and suddenly it was gone.  The object departed in what I call \"the speed of thought\".  To this day my greatest regret is not validating the ladies comments who called us as she asked them and let her know her eyes were not lying to her but were real.  I at 66 years old that the UFO was as real as I am.  I record this incident at this time to support the truth movement in UFOs and promise to support the movement from this time forward as I have for the past 20+ years.  As a former Staff Sargent in the USAF, and a Tower Crew Chief at the Luke AFB Control Tower, a Former Phoenix Firefighter/Engineer, Business Owner, a Jet Aircraft Mechanic for Lockheed Martin and NASA, a Husband, Father and an American Patriot I promise you these comments are true and honest.",
      "link": "http://www.nuforc.org/webreports/115/S115307.html",
      "state": "AZ",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c274a",
      "summary": "TWO \"RED FLAME WITH YELLOW CENTER\" TEAR-DROP SHAPED CRAFTS -BURBANK, CA.",
      "city": "glendale",
      "shape": "teardrop",
      "date": "2014-12-05T00:00:00",
      "story": "TWO \"RED FLAME WITH YELLOW CENTER\" TEARDROP SHAPED CRAFTS -BURBANK, CA Location of sighting: 700 block of E. Cedar Ave., Burbank, CA, looking south.  Both witnesses, male and female, in their early 60s, rational, well educated, and with good vision.  Both saw the event in the exact same manner.  The female is a former single engine pilot and wrote this report. Weather, per weather service, at time of sighting:  Clear, visibility 10 mi.; Temp 68F; Wind, calm; Barometer, 30.03in. I was saying goodbye to my friend out in my patio when he said, \"What's the hell is that?\"  I turned and looked at where he was pointing and at about 1500 ft. altitude over Glendale, about two miles to the south of where we were standing, we saw two teardrop shaped craft.  They looked like red flames with dark yellow center.  They were hovering for approximately two to three minutes then one of them started to move upward and south. The red light started to change intensity as it traveled, then it suddenly picked up speed, still heading south on an upward trajectory and within 30 seconds of acceleration, suddenly disappeared. The second craft had remained in its original position, and continued to hover and was bright red with yellow center. After the other craft disappeared, it started to head north towards us maintaining the same altitude. Movement caused its lights to vary in intensity just as it had the other. It continued north for about a minute, then rapidly reversed direction, increasing speed, then started an upward trajectory as the lights became more dim then suddenly, at an altitude where it would still have been easily visible, it disappeared; like someone turned a light switch off. There were no other aircraft in the vicinity during or within an hour before this event. There have been none since, and it is now 45 min. past the event. I have all manner of aircraft flying over, around, and nearby my location. I am well acquainted with the different sounds and know how far away they can be heard. I am also a former pilot.  At a distance where any known aircraft would have been easily and loudly recognizable, THESE OBJECTS WERE SOUNDLESS.  They were shaped distinctly like a teardrop, with the pointed end facing earth.  They looked like traveling \"red candle flames\", with a yellow center. This sighting is remarkable for, 1) soundless craft, 2) rapid in-line change of direction, 3) rapid acceleration from hovering, 4) complete disappearance in an instant, 5) shape of craft inconsistent with known aircraft, 6) colored light completely surrounding the craft, 7) variation in intensity of lights between hover and movement (light grew brighter when it hovered or slowed). This report was also phoned in. (near end of conversation, call became disrupted then suddenly dropped) ((NUFORC Note:  We spoke via telephone with the witness, and she seemed to us to be quite sober-minded and eloquent.  We suspect she is an excellent, and reliable, witness.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115659.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2ab8",
      "summary": "Orange lights spotted in the northwestern sky either on a large aircraft or five small aircrafts in formation.",
      "city": "glendale",
      "shape": "formation",
      "date": "2014-11-21T00:00:00",
      "story": "Orange lights spotted in the northwestern sky either on a large aircraft or five small aircrafts in formation. I was turning out of my college parking lot headed west onto Happy Valley road and in the sky approximately 2000-4000 feet in the sky I could see five orange lights fairly close together.  The orange is a very unique orange and is similar to single lights I've seen hovering in the sky in the past.   I was driving so my view was constantly being obstructed but i got three very good looks at this object.  It would fade out of view like a light bulb being turned off and was only lit or visible for a few seconds at a time.   It was either five lights in a line or 5 lights fixed onto a round craft.   I could not quite make out the shape.",
      "link": "http://www.nuforc.org/webreports/115/S115453.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f3e",
      "summary": "Cluster of 20-30 round silver looking objects flying through sky in the early evening.",
      "city": "glendale",
      "shape": "cylinder",
      "date": "2014-09-05T00:00:00",
      "story": "Cluster of 20-30 round silver looking objects flying through sky in the early evening A cluster of approximately 20-30 round, silver looking objects that appeared to have halos moving north east through the sky in a consistent formation, moving slowly at an even speed until out of sight.   I tried to capture them on video but they were too distant to capture on my camera, but they looked exactly like the objects in this video I came across on youtube while searching the internet to see if anyone else had seen the same thing I had seen.  I am very curious as to what they might have been. https://www.youtube.com/watch?v=1qVs0xx1PbQ",
      "link": "http://www.nuforc.org/webreports/113/S113253.html",
      "state": "CA",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c31f3",
      "summary": "I was outside taking care of my truck something to you I look up to the east and there was a brown big look son looking shape it looks",
      "city": "glendale",
      "shape": "circle",
      "date": "2015-04-03T00:00:00",
      "story": "I was outside taking care of my truck something to you I look up to the east and there was a brown big look son looking shape it looks like the SUN coming straight from the sky down to earth and it made a left 45 degree angle then it turned into two big shake and then it disappeared this happened in the the midst of 2000 and the summer of 2000 and no one else has seen it I like to know if anyone else out there in",
      "link": "http://www.nuforc.org/webreports/118/S118106.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c3334",
      "summary": "Five bright lights moving sporadically to the southwest.",
      "city": "glendale",
      "shape": "cigar",
      "date": "2015-03-13T00:00:00",
      "story": "Five bright lights moving sporadically to the southwest. Bright, Amber, cigar shaped formations to the southwest.  Appeared to be trailing heat behind them.  Moved sporadically and faded in and out.  Movements were not similar to flares or any other aircraft.",
      "link": "http://www.nuforc.org/webreports/117/S117645.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c33e9",
      "summary": "1 object sighted, 9 pm 4/6/2015 Glendale, Arizona",
      "city": "glendale",
      "shape": "oval",
      "date": "2015-04-08T00:00:00",
      "story": "1 object sighted, 9 pm 4/6/2015 Glendale, Arizona Just after 9 pm, I took the dog out in the backyard to go potty before bedtime, I looked up and there it was, at first I thought it was a plane crashing down, then it zoomed up, side to side, then up and down again..    I called out for my roommate , he came out and saw it too!!  It was purplish pink, and white on bottom,   with it moving so fast, it was hard to see the actual shape.. but it was round or oval.   Now we live near an airport and we see planes and helicopters constantly, day and night..  this was NOT an airplane or helicopter..    now you could see this thing as clear as you see a stop sign, and there's lots of traffic here , ground and air, now I KNOW other people had of seen it..    I saw a report of people seeing globes hovering in 1 spot for about 20 minutes, this is not what we saw.. we saw 1 object.. and from the back n forth movements..  It looked as if it was searching for something..  it was moving quickly and almost erratically.( it almost! looked like a object being held from a string..  like kids do.. but clearly this was not the case.. it was large.. but at some distance and that made it hard to gauge the actual size).  but did slow down during this duration and hovered still at one point before moving again..  then it was going away from us.. and we lost sight of it past the horizon.  I will have the camera ready tonight in case we see it again..  People rarely believe these stories until you see it with your own eyes..  I know what we saw.. and it was no plane!! or any other aircraft I've ever seen.  and while we saw this.. there were planes in the distance!!  There are always planes in the sky here, 24 hours a day..  So they had to of seen it too!!",
      "link": "http://www.nuforc.org/webreports/118/S118269.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3476",
      "summary": "Orange glowing light over Glendale",
      "city": "glendale",
      "shape": "circle",
      "date": "2015-01-07T00:00:00",
      "story": "Orange glowing light over Glendale I live on an elevated mountain so I have a clear view from Northern Glendale all the way to the Cardinals Stadium to the right and Downtown Phoenix to the left.  At around 12:40 a.m. on Wednesday, December 24, 2014, I looked out my window and noticed an unusually bright orangeish light hovering in the sky.  At first I thought it was just an airplane but then I noticed that it was stationary which was very disturbing to me.  Then suddenly the light dimmed drastically until it was completely vanished from my sight.",
      "link": "http://www.nuforc.org/webreports/116/S116166.html",
      "state": "AZ",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c38ed",
      "summary": "5 white dots flashing in the sky in a \"Y\" formation at 9:45 pm..",
      "city": "glendale",
      "shape": "oval",
      "date": "2015-01-07T00:00:00",
      "story": "5 white dots flashing in the sky in a \"Y\" formation at 9:45 pm.. Saturday night my boyfriend and I were planning on going to a mini car show on 51 Bell Rd. by freddys burger shop and we arrived around 9:45 pm at the parking lot.   Right when we parked, another fellow friend came up to our vehicle and pointed out something in the sky!   So we both watched the circular shaped flashing balls pulsing in the sky there were about 5 of them in a Y shaped formation orbiting in the sky it was about 10 minutes.   But I remember 3 mins in I did notice that 2 disappeared from the bottom of the Y. and so there were 3 on top like a V-shape balls lighting up.  It goes on for awhile.   But after ten minutes we left that area and drove off to another location.  I've heard of people seeing this object in the sky before but this is the first time I've caught it with my own eyes.",
      "link": "http://www.nuforc.org/webreports/116/S116523.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c3c86",
      "summary": "Possible UFO caught on security camera.",
      "city": "glendale",
      "shape": "fireball",
      "date": "2015-07-10T00:00:00",
      "story": "Possible UFO caught on security camera. https://www.youtube.com/watch?v=8swPEMZ8ob8",
      "link": "http://www.nuforc.org/webreports/120/S120240.html",
      "state": "CA",
      "duration": "Few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d7a",
      "summary": "UFO observed hovering from the local mall parking structure.",
      "city": "glendale",
      "shape": "disk",
      "date": "2015-06-24T00:00:00",
      "story": "UFO observed hovering from the local mall parking structure. Please see youtube video at:  https://youtu.be/O66e9clQ9Bk ((NUFORC Note:  We have amended temporarily the date above, and requested a correction of the date from the witness.  PD)) ((ADDENDUM FROM WITNESS)) Hi Peter, It was not very easy to see. I had to use zoom. The date was 05-26-2015 I am attaching pictures which are much more clearer. Thank you. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/119/S119716.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3eaa",
      "summary": "Cluster of approximately  20 bright white blinking lights traveled slowly in a westerly direction  over glendale AZ 1:30 am",
      "city": "glendale",
      "shape": "formation",
      "date": "2015-06-15T00:00:00",
      "story": "Cluster of approximately  20 bright white blinking lights traveled slowly in a westerly direction  over Glendale, AZ, 1:30 am. At approximately 1:30 am, my boyfriend was out back with the pups and asked me to come outside to see what he had been watching for a couple minutes in the West sky.  There was this cluster of 20 bright crisp silvery metallic white lights in a loose grouping.  The angle we were looking up into the sky was 30 degrees.   The lights appeared to have a pattern they were blinking off and on through but neither of us could tell you specifically what it was.  This grouping of lights, for lack of a better description, moved in a westerly direction as if attached to a drunken butterfly.  Slowly, left, right, forward, stationary, rinse, repeat.    Although the lights were moving farther west and away from us, they were still very bright white.....not soft or amber but clear bright white. ((NUFORC Note:  We spoke with both witnesses, and both appeared on a radio program.  They were both very objective, and sober-minded, in describing the event, and we suspect that both of them are quite reliable, and capable, witnesses.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119478.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4063",
      "summary": "Black Helicopter",
      "city": "glendale",
      "shape": "unknown",
      "date": "2015-05-08T00:00:00",
      "story": "Black Helicopter As I was sitting in my living room, enjoying my free time - my wife was across the street at her girlfriends house - a very low flying helicopter flew over the house.  It was so low that the house shook.   I rushed out side to try to catch a glimpse of this helicopter and to report it to the FAA. I was in for a huge surprise.  It sounded to me as if it flew a short distance away and then came racing back towards me as if it was a bat out of hell!!   This happened more than a few times.  At one time it seemed to stop over the house and hover there trying to intimidate me.  As crazy as this sounds, I could not see it.  There seemed to be some roter wash, but the noise that the copter was making was almost deafening and the house seemed to be shaking so hard that it was going to fall apart.  And yet I still could not see any nav lights or it.   It finally left after a few moments and has not been back since then.   No neighbors came out to investigate the racket and my wife did not hear it across the street. A interesting side note is this:  I happened to look straight up and saw at about 10,000- 15,000 ft a red orb circling directly in what appeared to be over my house. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118797.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c43d5",
      "summary": "Bright white light with small green streak in the middle.  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "glendale",
      "shape": "unknown",
      "date": "2015-11-19T00:00:00",
      "story": "Bright white light with small green streak in the middle It was around 6:30 when we saw it.  We were at the Glendale airport for a boys scouts event.  It was dark out no clouds in the sky.  The even was going on when I look up into the sky and there was this really bright light in the sky.  At first I thought it was just a plain because we were at an airport but the light wasn't moving.  I also noticed there was a smaller green light in the middle of the white light.  I saw it for a few seconds and turned my head to look at the person speaking and when I looked back about 3 seconds later it was gone. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123819.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c4576",
      "summary": "6 orbs flying in a linear pattern over the Glendale/Phoenix area.",
      "city": "glendale",
      "shape": "light",
      "date": "2015-11-06T00:00:00",
      "story": "6 orbs flying in a linear pattern over the Glendale/Phoenix area. I live in the west valley and drive to Phoenix for work in the evenings.  I left my house at 7 pm and to the east I could see 6 orbs of light in a linear pattern. They were moving fairly slowly to the southwest, as they appeared to be getting closer. They were also flying low compared to the airplanes that are nearby landing at Sky Harbor. T he lights were very bright, compared to airplanes and stars, but would fade in and out slowly.  And there were what looked like maybe 2 helicopters nearby???   After about 45 minutes the orbs were gone and the helicopters had flown away. It’s nothing like I’ve ever seen before.",
      "link": "http://www.nuforc.org/webreports/123/S123248.html",
      "state": "AZ",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c460b",
      "summary": "Glendale California where the shape shipes come for one guy.",
      "city": "glendale",
      "shape": "changing",
      "date": "2015-11-12T00:00:00",
      "story": "Glendale California where the shape ships come for one guy On the nite of 3-18-2015 I saw two lights moving from right to left and a circle motion on the top of the mountain at forest lawn in glendale from my window facing my back yard where my bedroom is located in da adress  XXXXX oakridge dr glendale ca 91205.  About 45 min later I saw the shining light on the right side of the two that where there two located in the sky I got a chance to take some pictures befor the ufo became a image that looked like a quarter moon blue in color the took off in to the sky by becoming a blue lighting linage and diapering in to the dark sky I still have the pictures in my phone that I can show you I also called 211 the next day and was connected to a company named KFI in Los angeles where they gave me a confemation # 2931472 I need someone in Los Angeles to investigate this sighting that I had I think I might of been abducted to please give me a call back at 818-XXX-XXXX thank you for your time and effort",
      "link": "http://www.nuforc.org/webreports/123/S123903.html",
      "state": "CA",
      "duration": "Took off in da sky"
    },
    {
      "_id": "64d005f478aba2ec5a3c4964",
      "summary": "Bright star like object dancing in night sky for hours above North Glendale/Peoria Arizona.  ((NUFORC Note:  Star?  PD))",
      "city": "glendale",
      "shape": "other",
      "date": "2015-09-17T00:00:00",
      "story": "Bright star like object dancing in night sky for hours above North Glendale/Peoria Arizona. We live in North Glendale, Arizona, on the border of Peoria.  Directly above us, we started watching what we \"thought\" was a common satellite until we saw it move in many directions, almost like dancing.  It would move east, many short bursts of speed, then slow down, sometimes hover/pause, then back slowly to the west, sometimes fast, U turns, circles, pause, then south then north, every which way.  (We agreed it was brighter and larger than a satellite.  Like a very bright star, but not as bright as a planet.)   We phoned a friend a few miles SE of us and they said  from their vantage point, it appeared to bounce up and down.  They told their next door neighbor who said they watched it the night before, Sept. 5. Unable to see it via camera.  We observed it until approx 23:30 then went to bed.  Will contact Lowell Observatory scientist on Sept. 8 upon their return from Labor Day.",
      "link": "http://www.nuforc.org/webreports/122/S122008.html",
      "state": "AZ",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c22",
      "summary": "2 Rapid moving lights over Glendale",
      "city": "glendale",
      "shape": "unknown",
      "date": "2015-09-17T00:00:00",
      "story": "2 Rapid moving lights over Glendale In the north east sky 2 friends and I spotted 2 erratic flying craft changing colors in the night sky, one changed from purple to red and then bright white while hovering high in the sky then darted swiftly across the sky then zoomed back at an incredible speed strieght to the same spot it had been in then hovered, the second craft darted rapidly up, down, side to side and in almost dive patterns but at incredible speed.",
      "link": "http://www.nuforc.org/webreports/122/S122016.html",
      "state": "AZ",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c9a",
      "summary": "Bright star like object dancing in night sky for hours above North Glendale/Peoria Arizona.",
      "city": "glendale",
      "shape": "other",
      "date": "2015-09-11T00:00:00",
      "story": "Bright star like object dancing in night sky for hours above North Glendale/Peoria Arizona. We live in North Glendale, Arizona, on the border of Peoria.  Directly above us, we started watching what we \"thought\" was a common satellite until we saw it move in many directions, almost like dancing.  It would move east, many short bursts of speed, then slow down, sometimes hover/pause, then back slowly to the west, sometimes fast, U turns, circles, pause, then south then north, every which way.  (We agreed it was brighter and larger than a satellite.  Like a very bright star, but not as bright as a planet.)   We phoned a friend a few miles SE of us and they said  from their vantage point, it appeared to bounce up and down.  They told their next door neighbor who said they watched it the night before, Sept. 5. Unable to see it via camera. We observed it until approx 23:30 then went to bed. Will contact Lowell Observatory scientist on Sept. 8 upon their return from Labor Day. ((NUFORC Note:  We suspect that the possibility of a star would have to be ruled out, before we could conclude that the witnesses had seen a genuine UFO.  We suspect that the stars, Vega and Deneb, are possible candidates.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121786.html",
      "state": "AZ",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4def",
      "summary": "Huge space craft like something out of a movie.",
      "city": "glendale",
      "shape": "other",
      "date": "2015-08-13T00:00:00",
      "story": "Huge space craft like something out of a movie. Me and a friend we're hanging out, watching tv at my house.  It was pretty late.  We went out side to smoke a cigarette.  We we're talking for a bit, then I suppose I felt something in the sky move and when I looked up, I couldn't believe what bin was seeing.  It was an enormous space craft silently hovering over my neighbor's house, across the street from mine.   I told him to look asking him if he saw whatn i saw.  We both agreed that it was very real and amazing.  We stared at it.  It was unlike anything I've ever seen or heard reported.  It was a dark grey color.  And it shape was like a triangle with the pointed side facing south, then another two triangle shaped protrusions on each side of the ship pointing up towards the sky.  It appeared like it had alot of space inside like there was multiple floors inside.  There was a very large amount of window like squares with what looked like shiny redish, greenish, blueish and purpleish pearlescent squares all over the surface.  Also, many white lights next to the squares  that we're randomly lighting up. It looked like a large futuristic panel of buttons and lights. There was this wing like triangle coming out the bottom that had red lights on it. Idk what that was but maybe it was to not hit anything while that close to the ground or to enter a house . that's kinda what it seemed like.  We watched it go south bound very slowly and completely silent. We we're in awe and watched as slowly left our sight. It was so unbelievable that I didn't tell anyone for a month or two  and then when I did tell Ppl they didn't really believe me.  But I think I  found a story that was similar to mine but they couldn't explain it since they were not any where near as close as we were. I know I need to report this to see if anyone could tell me anything on what I saw. I wish I wouldve have gotten a picture. But I didn't have my phone and didn't want to risk going to get it and it being gone.",
      "link": "http://www.nuforc.org/webreports/121/S121059.html",
      "state": "AZ",
      "duration": "7-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5041",
      "summary": "3 White lights over Glendale, Arizona.",
      "city": "glendale",
      "shape": "triangle",
      "date": "2016-03-04T00:00:00",
      "story": "3 White lights over Glendale, Arizona. A large object with a flashing light in middle with 2 lights on the sides.  Flying lower to the ground than a typical aircraft or helicopter.  The distance between the lights would indicate a large size craft.  We listened for engine noise and heard none.  It appeared and moved in a fast side to side motion, and turned.  It then disappeared, but there were no clouds or buildings.",
      "link": "http://www.nuforc.org/webreports/126/S126145.html",
      "state": "AZ",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c54cc",
      "summary": "Driving home, about 300 or 400 ft up I noticed a flying (hovering) object like a box kite. Watched it 4 the 10 min or so.",
      "city": "glendale",
      "shape": "rectangle",
      "date": "2015-12-10T00:00:00",
      "story": "Driving home with meal from DQ.  About 3 or 400 ft up, I noticed a flying (hovering) object like a box kite.  Watched it 4 the 10 minutes or so drive home.   Then went to back porch and watched it 4 a few more mins, then, amazingly, it turned into 3 small airplanes and soundless dispersed.   I figured I would hear on tv news or radio.  But nothing. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124518.html",
      "state": "",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5903",
      "summary": "There was a bright light, multiple bass booms and then crazy trails left in the sky.  ((NUFORC Note:  Reported as meteor.  PD))",
      "city": "glendale",
      "shape": "other",
      "date": "2016-06-03T00:00:00",
      "story": "There was a bright light, multiple bass booms and then crazy trails left in the sky. At about 3:55 am, me and a friend were standing outside when the sky suddenly lit up light lightning struck.  Illuminating the whole sky, but lasted for 3-5 seconds compared to 1 with lightning.  There was no sound it was absolutely silent until about five minutes later we heard 4-6 loud cannon like booms, that were powerful enough to feel slight vibrations. We also saw a slight illuminated trail in the sky in the north east.  Now that it i 5 there are two clear trails that are a swirl of paths.  Also there has been a car horn going all night (probably unrelated) ((NUFORC Note:  Object reported by the news as a probable meteor.  We agree.  See photos of smoky trail left high in the sky above Arizona.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127647.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a1d",
      "summary": "Lights and flash in the sky",
      "city": "glendale",
      "shape": "light",
      "date": "2016-04-29T00:00:00",
      "story": "Lights and flash in the sky On new years eve I was out with my daughter looking at fire works then all of a sudden we saw a large flash of light that light up the whole sky, it was not a firework.  Then I notice 3 lights in a triangular shape moving across the sky from North to South across the western horizon.  Then some lights would just go out, disappear and others would show up behind them and then do the same as they got to a certain point in the sky.  Then there was large flash again that light up the whole sky and my daughter got so freaked out, she was really upset, she thought aliens were going to abduct us.    I have a video if anyone is interested. ((NUFORC Note:  We have attempted to contact the witness via telephone, but unsuccessfully, to date.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127035.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d14",
      "summary": "Ospreys USMC trainings.",
      "city": "glendale",
      "shape": "circle",
      "date": "2016-12-05T00:00:00",
      "story": "Ospreys USMC trainings. Bright orange circular lights with flashing green and red light markers left and right of orb.  Proceeded north to south over 67 avenue, then proceeded west towards Luke Air Force base.  Could have been ospreys on training mission??  Twice, there we're rotary (helicopter) moving perpendicular to the formation of lights once when north of 101 freeway again when lights were well westward of my position at 67 avenue and union hills in Glendale.",
      "link": "http://www.nuforc.org/webreports/131/S131210.html",
      "state": "AZ",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d30",
      "summary": "I walked out of my friends house toward my car looking west and spotted two orange lights coasting downward  toward earth, the lights s",
      "city": "glendale",
      "shape": "circle",
      "date": "2016-12-05T00:00:00",
      "story": "I walked out of my friends house toward my car looking west and spotted two orange lights coasting downward  toward earth, the lights seemed to reach a certain point and fade.   Then one more appeared and basically followed the same path as the previous two.   I tried to get video but could not capture the lights on my phone, what were they? ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131252.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d43",
      "summary": "((HOAX??))  Mother ship released four lights.",
      "city": "glendale",
      "shape": "changing",
      "date": "2016-12-05T00:00:00",
      "story": "Mother ship released four lights. Mother ship released 4 small lights.  Then they disappeared.  The color of the was like red orange.  Well this is happening four helicopters fly over us like if there were distracting us from the ufos. ((NUFORC Note:  We attempted to telephone the source of the report, but were unsuccessful in reaching him.  Possible hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131316.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e7b",
      "summary": "Fastest light I've ever seen move in the sky with no trail behind it.",
      "city": "glendale",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "Fastest light i've ever seen move in the sky with no trail behind it. Direction; South west to North east I'd say crossing the I17 between Dunlap (SW) and cactus(NE).  A slight swaying motion was observed as well as one solid blue/white light.  I was going to the patio, opened the door, looked up and before my foot touched concrete, i watched it fly over top and disappear in a fraction of a second.  just like lord helmet in Space Balls said, ludicrous speed.",
      "link": "http://www.nuforc.org/webreports/131/S131562.html",
      "state": "AZ",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f95",
      "summary": "Three lights in a line a cross the sky.  ((anonymous report))",
      "city": "glendale",
      "shape": "other",
      "date": "2016-11-11T00:00:00",
      "story": "three lights in a line a cross the sky. I saw three light in a line cross sky from north east to north west. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131168.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fca",
      "summary": "3 lights.",
      "city": "glendale",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "3 lights. 3 in-line light at high altitude going at a very slow speed.",
      "link": "http://www.nuforc.org/webreports/131/S131148.html",
      "state": "AZ",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fc9",
      "summary": "3 lights over Phoenix, AZ.",
      "city": "glendale",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "3 lights over Phoenix AZ 3 very high altitude lights moving at very slow speed.  The middle one would flash brighter periodically",
      "link": "http://www.nuforc.org/webreports/131/S131145.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fc7",
      "summary": "3 lights spotted in line over Phoenix.",
      "city": "glendale",
      "shape": "formation",
      "date": "2016-11-11T00:00:00",
      "story": "3 lights spotted in line over phoenix We noticed three lights in an imperfect line moving nortwest.  The lights seem to be blinking independently of each other.  No apparent pattern in blinking either.  It appeared that every couple of minutes to drop something but it could have been the way the light on the bottom blinked.",
      "link": "http://www.nuforc.org/webreports/131/S131150.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c63be",
      "summary": "Huge black triangular UFO seen over Los Angeles, CA, at 11:30 AM, August 06, 2016.",
      "city": "glendale",
      "shape": "triangle",
      "date": "2016-08-16T00:00:00",
      "story": "Huge black triangular UFO seen over Los Angeles, CA, at 11:30 AM, August 06, 2016. While taking a taxi to work today around 11:30 AM, I saw a huge, black triangular shape in the distance south of where I was traveling in the Atwater area of Los Angeles near Glendale.  I first saw the object while the car was driving on Glendale Blvd and continued to watch it off and on as we drove onto Hyperion.   The object was solid black, triangular shaped, and seemed to fade into what looked like a grainy smoke, and then became very solid and metallic looking again.  It was low in the horizon just above the tree tops in the distance.   I told the taxi driver about it, but because he was driving in traffic, he could not stop to take a look at it.   I am not a crackpot.  I am a registered nurse and I know what I saw.   I have lived in the Los Angeles area for many years and I know what the Goodyear Blimp looks like.  It was not the blimp!",
      "link": "http://www.nuforc.org/webreports/129/S129112.html",
      "state": "CA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c697b",
      "summary": "((NUFORC Note:  Source of report provides no information; elects to remain totally anonymous.  PD))",
      "city": "glendale",
      "shape": "light",
      "date": "2017-03-17T00:00:00",
      "story": "((NUFORC Note:  Source of report provides no information; elects to remain totally anonymous.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133111.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ec3",
      "summary": "Intermittent flashing light. 3 flashes in one spot, 4th flash was brighter than brightest star in the night sky. Flashed fainter flashe",
      "city": "glendale",
      "shape": "flash",
      "date": "2017-08-24T00:00:00",
      "story": "Intermittent flashing light.  3 flashes in one spot, 4th flash was brighter than brightest star in the night sky.  Flashed fainter flashes after that shows it moving from West to East.  Another faint flash below original light, disappears.  Another light flashed next to original light once and disappears.",
      "link": "http://www.nuforc.org/webreports/135/S135787.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c702b",
      "summary": "The silver disk moved from right  to left and stopped fror a moment and disappeared.",
      "city": "glendale",
      "shape": "disk",
      "date": "2017-08-11T00:00:00",
      "story": "The silver disk moved from right  to left and stopped fror a moment and disappeared. While driving for my doctors appointment in Glendale, California, I decided to exit on Harvey in Glendale and take the side streets.  As I was passing 1 or 2 blocks going east of Verdugo Blvd. on Wilson, I happened to look up on the right hand side of my windshield.  I was asking myself and wondering why the \"lightpost\" was very high up in the sky without the post.   Not a moment too soon, I saw a silver disk just hovering in front of my sight up in the sky.  It was like at a stand still.  I gasped and muttered \"Oh, my God!\" and for all I know, in the blink of an eye, the thing disappeared.  It was a UFO.   I glanced at my cellphone wanting to take a picture, but couln't because I was driving and the UFO was so fast in disappearing.  The time was 13:18. It was exciting to realize this was not the only instance I saw a UFO several years ago while driving on the Glendale freeway.  But it was a little far and this time it was bigger since it was more close.",
      "link": "http://www.nuforc.org/webreports/135/S135613.html",
      "state": "CA",
      "duration": "2-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c725e",
      "summary": "Bright star like light (during daytime), fades while moving and disappears.",
      "city": "glendale",
      "shape": "light",
      "date": "2017-07-14T00:00:00",
      "story": "Bright star like light (during daytime), fades while moving and disappears. This evening my mother and I were on the front patio talking, when very high in the sky I noticed a small, far away, bright light.  It looked like a star but extremely bright, yet the sun had not set yet.  I was shocked it was so bright.   Then it started to move down, to us it seemed as though it was moving slowly, but it appeared to be quite far away so it could've been quickly.  As it moved downward it faded slowly until it completely disappeared.   There were no clouds in the area for it to disappear into.  We watched it until it got so dim we could no longer see it.   I yelled for my husband and by the time he came outside it was too dim for him to see.  We stayed out there about another 10 minutes.  All of a sudden, my husband was yelling, \"Holy crap there it is!!!\"  I looked up in the same spot and sure enough there it was.  So extremely bright and fading as it slowly moved downward.  It appeared to be very very high in the sky.   I am not sure if this was a UFO or something else, but I came upon this site when searching for other possible similar sightings.  I thought I would share my experience in case others had or will have the same!  Thanks much!",
      "link": "http://www.nuforc.org/webreports/135/S135119.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c75ae",
      "summary": "11/11/17 UFO Sighting Glendale/Pasadena CA, Along 134/210 Freeway and up Lake Blvd.",
      "city": "glendale",
      "shape": "other",
      "date": "2017-11-17T00:00:00",
      "story": "11/11/17 UFO Sighting Glendale/Pasadena CA, Along 134/210 Freeway and up Lake Blvd. I was driving around 8 pm or so east on the 134 freeway toward Pasadena, CA, on Saturday 11/11/17.  Around Glendale area before heading into Eagle Rock or so, I noticed on the left hand side up above the horizon above hills an object in the air that struck me as strange.  At first it was going in and out behind things.  The lights were strange, and movement strange.   Nothing like that has ever caught my attention before.  I watched it intently as best I could while driving on the freeway.  It then began following along the freeway the entire way I was going in a basically straight line, perhaps 10 miles?  At times I thought maybe it could be a blimp.  But it moved very unusually, not at all like a blimp moves -- gliding easily at high speed.  It kept pace in a straight firm line gliding along the freeway way too fast for a blimp, and somewhat farther down (lower) than you would expect on the horizon, for several miles.  It seemed almost like it was partially sh! rouded or camaflouged, like it was intentionally trying to be non-descript in its appearance/color, deflecting light. For some reason I had an instinct or sense like the object usually has camaflouge not expecting to be seen, but that wasn't fully working at that moment for some reason. It struck me that if I was a UFO, I would not want to be seen and would want to be camaflouged rather than flashy and conspicuous, so the non-descript quality seemed reasonable to me. I wanted to take a picture or video, but I could not safely do so while driving on the freeway. I kept watching it as a drove the whole way.  I then exited LAKE avenue off the 134/210 freeway into Pasadena, turning left and heading north. The object appeared to change directions almost like it was following me.  It too turned left and started heading north parallel to the direction of my car, just as it had been heading in a straight line along the freeway east before I exited and turned.  I know this sounds od! d and strange, but it almost felt like it could somehow sense ! that it knew I saw it and was intent and curious about that.  It caught my attention because it definitely did not seem normal or quite like anything I had seen before, and I could not explain what it was.  It did not move like any aircraft I know about.  Too smooth and fast, not a typical flight path, speed or positioning vis-a-vis the horizon. It seemed almost casual, like it was observing and didn't think it could be seen, and then somehow noticed I noticed it (though I don't know how that could be the case). I'm thinking possible Jacques Vallée resonant, a subjective, different order component to it.  I then pulled over on the road on Lake Blvd. in Pasadena so I could try to photograph it, and took the pictures attached here with my phone.  The first pic is a ZOOM IN on the second pic so you can see it better/closer up.  You can see where it is in the sky in the second because the perspective is stepped/angled back.  In the first zoomed in pic, the object looks like a shaded circle/orb shape titled partly 3/4 back with 3 round glowing lights on the bottom.  It continued to \"follow\" along side on the horizon up Lake Blvd. parallel to my car for a couple of miles.  I then turned off right to a side street going toward a residence and lost sight of it.  It held my attention as something strange I observed for around 15 minutes in total, a pretty long duration.  This is the first time I have ever felt like I might have seen a UFO.  It did feel instinctively like it was something unusual, and was something I could not explain or recognize.  I would like to know if there were other sightings reported at this same time and area. This is reported anonymously, to add discovery and investigation.  You can feel free to freely contact me with questions, information, or follow up, however.",
      "link": "http://www.nuforc.org/webreports/137/S137240.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ae5",
      "summary": "White lights in a formation traveling slowly/silently over NW Glendale, AZ, then disappeared after sighting.  ((anonymous report))",
      "city": "glendale",
      "shape": "formation",
      "date": "2017-11-09T00:00:00",
      "story": "White lights in a formation traveling slowly/silently over NW Glendale, AZ then disappeared after sighting Witnessed seven large circular lights moving eastward very slowly over the sky at Utopia & 68th Ave in Glendale, AZ, approximately 9:20 PM (AZ time zone) on the night of Saturday, November 4th, 2017.  We the lights them for approximately a 45-second duration before they disappeared.  Could easily tell they were not airplanes- there was no noise and they did not look like airplanes that flew by in same spot after they disappeared.  We live under a flight path, so definitely would know if lights were from airplanes.  These were not airplanes!  They seemed to make somewhat of a V formation.   We took two photos and one short video that caught they tail end of the sighting.  Only 3 to 4 lights appear in the photos but visible to our eyes there were approximately seven.  The light pattern moved slowly, silently, and lights were all in unison with each other as if belonging to one large flying or several that were somehow traveling in a geometric formation at the same speed and altitude.  The formation appeared similar to a V, but was not a perfect V showing all the points.",
      "link": "http://www.nuforc.org/webreports/137/S137127.html",
      "state": "AZ",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f98",
      "summary": "Orange/red ball floating in the sky over Glendale, AZ",
      "city": "glendale",
      "shape": "oval",
      "date": "2018-04-19T00:00:00",
      "story": "Orange/red ball floating in the sky over Glendale, AZ. Orange/red ball floating across the sky from west south west to north north east.  Was not a fireball, but rather a fairly bright object.  At very end of sight, appeared to have a long tail from the end of the light.  Began seeing when directly above.   Never have seen anything like this.  Too slow for a comet.  But moving faster than a small plane.  Elevation seemed somewhat higher than a small plane.  Moved at same speed.  Did not ascend or descend.  Very small haze around the ball.  Did not leave trail while moving.",
      "link": "http://www.nuforc.org/webreports/139/S139472.html",
      "state": "AZ",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8209",
      "summary": "A bolt of white light flashed from left to right along the street, just above vehicle level.",
      "city": "glendale",
      "shape": "light",
      "date": "2018-01-25T00:00:00",
      "story": "A bolt of white light flashed from left to right along the street, just above vehicle level in a way that caught everyone's attention and could not be explained. ((ADDENDUM FROM WITNESS)) It was a football-sized ball of light with a tail, as best we could say, since it happened so quickly, and was so bright. I was in a beauty salon at the time and we all just looked at each other in disbelief, agreeing that we had indeed seen a UFO of some description.  The time was 12.15 pm,  yes, 15 minutes past noon. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/138/S138557.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c83ca",
      "summary": "Saucer shaped aircraft with 6-8 white circular lights on its bottom side spotted near the dead of night by a cousin and me.",
      "city": "glendale",
      "shape": "disk",
      "date": "2018-10-06T00:00:00",
      "story": "Saucer shaped aircraft with 6-8 white circular lights on its bottom side spotted near the dead of night by a cousin and me. I want to clarify before anything else, the incident could have taken place either 3 months prior or 3 months after the date entered.  All I can guarantee, is that using information such as my work history, housing history, and the travel history of my cousin; what we saw occurred within the first 6 months of 2015. No sooner and definitely not later.  The time and location however are relatively accurate, slightly before midnight and seen from 71st Ave and Bethany Home Rd and facing South. *All the information gathered here was obtained with the help of the other witness mentioned, all matching*   During a routine weekend at my father's house, my cousin spent the night over like he’d done a number of times before.  After arriving and spending some time playing video games I decided a snack was in order.  After realizing we were low on food, and starving, we decided to make a quick run to our local Frys/Kroger store down the street.  It was around 11:15 PM when we decided on this. Prior to leaving, and against my cousins wishes I decided to smoke a bit of marijuana to help with the pain of being an athlete.  As a long time smoker I knew this would not drastically impair my ability to walk and/or think and that it’d help me deal with the soreness in my ankles from constant soccer.  My cousin did not ingest any marijuana, alcohol, or anything of the sort prior to either arriving at my then home or leaving with me to walk to the store. 15 minutes of prepping and smoking, and 20 minutes of walking later we were nearly there. My cousin, slightly nervous about being out so late and being caught by his father, decided to call my uncle to check in and let him know we’d be in bed soon enough (a lie).  It was during this call that I, while gazing around the familiar neighborhood noticed something above me and not at all far away in the night sky. Only after taking 5-7 seconds to repeatedly blink and rub my eyes did I gather the sense to immediately alert my cousin as to what I was experiencing.  Above us were 6-8 near white lights, forming a perfect circle and a moderately bright one at that.  Past the lights, once hyper focused you could make out the dark saucer shape the lights were obviously a part of. There wasn’t any rotation of said lights, no pulsing, and no odd details.  The object sat stationary while being viewed and emitted ZERO fumes, projectiles, and strangely enough, sound whatsoever.  It was so quiet in fact that I recall the embarrassment of being able to hear my cousin explaining to his father/my uncle what we were seeing and practically revealing that we were outside and not in my home as he’d previously described.  I could hear cars driving by us and in the distance, I could have heard crickets if there were any, just not the craft. After about 60 or so seconds of staring, the craft proceeded to accelerate like no aircraft I’d seen in my 20+ years of living.  The object went from being the sole focus of my vision, to zooming straight upwards and decreasing in size within an instant; vanishing almost cartoonishly. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143337.html",
      "state": "AZ",
      "duration": "60-90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8cb5",
      "summary": "Many Orange Lights Over North Glendale, AZ.",
      "city": "glendale",
      "shape": "light",
      "date": "2019-01-24T00:00:00",
      "story": "Many Orange Lights Over North Glendale, AZ. Two of us witnessed at least two dozen orange lights traveling from N to SW at a 40 degree angle to the horizon. The first bunch came in then some trailed behind then a few more in a bunch then more trailed in in a snake like pattern.  They were not floating like lanterns and were not drones. No blinking.  All of them disappeared at the same western spot.  We couldn't tell if they flew into a cloud because it wasn't a totally clear night. There was no noise.  They flew slowly like a helicopter would fly. We live north of LUKE AFB and are familiar with the F16's, -18's and -35's.  We also see and hear passenger jets approach Sky Harbor and smaller craft that use two smaller airports. I phoned LUKE AFB and they did not have any helicopter squadron maneuver.  The way the bunches of these were traveling it looked dangerous because there wasn't any pattern.",
      "link": "http://www.nuforc.org/webreports/144/S144631.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ded",
      "summary": "Many Orange Lights Over North Glendale, AZ.",
      "city": "glendale",
      "shape": "light",
      "date": "2019-01-04T00:00:00",
      "story": "Many Orange Lights Over North Glendale, AZ. Two of us witnessed at least two dozen orange lights traveling from N to SW at a 40 degree angle to the horizon. The first bunch came in then some trailed behind then a few more in a bunch then more trailed in in a snake like pattern.  They were not floating like lanterns and were not drones. No blinking.  All of them disappeared at the same western spot.  We couldn't tell if they flew into a cloud because it wasn't a totally clear night. There was no noise.  They flew slowly like a helicopter would fly. We live north of LUKE AFB and are familiar with the F16's, 18's and 35's.  We also see and hear passenger jets approach Sky Harbor and smaller craft that use two smaller airports. I phoned LUKE AFB and they did not have any helicopter squadron maneuver.  The way the bunches of these were traveling it looked dangerous because there wasn't any pattern.",
      "link": "http://www.nuforc.org/webreports/144/S144111.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c92e4",
      "summary": "Star like shapes moving and then forming a conveyor like line in sky. ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "glendale",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "Star like shapes moving and then forming a conveyor like line in sky. Leaving for work early on Saturday I left my front door and immediately noticed there were much more stars out than normal (maybe 25-40 more) which drew my attention to the sky. I realized not only were there more stars but they were moving erratically back and forth for 2-3 seconds. They drew in closer and then almost instantaneously they formed into a straight line and started moving from the southwest sky towards the Big Dipper (northwest) like a conveyer belt. It reminded me how traffic would look on a freeway in a single lane. They were not equal distance Sparta and moved each at different speedsI tried to keep count but there was more appearing from what looked like nowhere. At least 70-100 total continuously headed toward the Big Dipper and then disappeared into the sky. It took up the entire span of the sky and lasted for 5 minutes. I could tell this was fat and not in our atmosphere. I woke my wife up to see the event as well. After roughly 8-10 min! utes the event ended and I could no longer see anything.",
      "link": "http://www.nuforc.org/webreports/150/S150981.html",
      "state": "",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3c95bd",
      "summary": "My sister and I were in our backyard watching the stars and also waiting for the meteor shower. I was telling her a story when all of a",
      "city": "glendale",
      "shape": "other",
      "date": "2019-12-01T00:00:00",
      "story": "My sister and I were in our backyard watching the stars and also waiting for the meteor shower.  I was telling her a story when all of a sudden we seen 3 lights appearing and I was looked I think I see some but then more lights appeared forming a “V” shape object.  It began moving fast and then disappeared, I've never seen anything like it and I am shocked.",
      "link": "http://www.nuforc.org/webreports/150/S150841.html",
      "state": "AZ",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c972c",
      "summary": "There were a line of lights floating not very fast, some closer together than others from southwest heading northeast.",
      "city": "glendale",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "There were a line of lights floating not very fast, some closer together than others from southwest heading northeast.",
      "link": "http://www.nuforc.org/webreports/151/S151029.html",
      "state": "AZ",
      "duration": "5 minutes"
    }
  ]
}