{
  "city": "grandrapids",
  "fetch_timestamp": "2025-07-12T14:36:36.340038",
  "record_count": 93,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b465c",
      "summary": "steam ship in the sky",
      "city": "grandrapids",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "steam ship in the sky it was in two seperate sections an upside down stainless steel looking trapazoid on top with round port holes. the bottom section was a white longer trapazoid right side up. it left no vapor trail and was going to fast to be a prop plane. by the time i ran to get my binoculars it was gone.",
      "link": "http://www.nuforc.org/webreports/050/S50442.html",
      "state": "MI",
      "duration": ".30"
    },
    {
      "_id": "64d005f478aba2ec5a3b4663",
      "summary": "1977 my siblings and I saw a huge disc shaped UFO with revolving lights and lots of windows hovering in front of us.",
      "city": "grandrapids",
      "shape": "disk",
      "date": "2019-06-07T00:00:00",
      "story": "1977 my siblings and I saw a huge disc shaped UFO with revolving lights and lots of windows hovering in front of us. My, sister, brother, and I were walking home one evening from a church meeting and we looked up and saw a spacecraft hovering in front of us.  It was huge and was grayish in color, disk shaped, and had lots of windows going across it.  It also had revolving lights in the middle of it.  I don’t remember any noise coming from it.  It stayed in front of us as we walked a couple blocks and then it moved away very fast and was gone.  We told our parents but didn’t think to report it.  As time went on I thought people would think we were crazy if we talked about it.  I was 17 years old at that time, and now I’ll be 60 this year. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146572.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b52a3",
      "summary": "Loud noise of an extremely low flying plane in Grand Rapids, MI, 4/25/08, from  E or SE, sounded like it was going to crash.",
      "city": "grandrapids",
      "shape": "",
      "date": "2008-06-12T00:00:00",
      "story": "Loud noise of an extremely low flying plane in Grand Rapids, MI, 4/25/08, from  E or SE, sounded like it was going to crash. I heard a very loud sound over my house.  My first thought was that it was a plane that was going to crash, however the sound lasted longer than an airplane just flying over the house.  I didn't go outside to look, however.",
      "link": "http://www.nuforc.org/webreports/062/S62766.html",
      "state": "MI",
      "duration": "1-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5304",
      "summary": "glowing v-pattern lights about 3.5 miles away",
      "city": "grandrapids",
      "shape": "formation",
      "date": "2006-10-30T00:00:00",
      "story": "glowing v-pattern lights about 3.5 miles away 22:35 march/ me and my father were driving home from grand rapids. I was looking out of my window, and out of nowhere, a v-pattern shape of glowing lights were flying northeast. I rubbed my eyes to see if they were fooling me. They weren't. I got my father to see if he was seeing it too. He replied that he was driving and couldn't look at it. I was looking at it and he said what were you looking at now? He was too late and it was gone. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  We don't know the year of the alleged sighting.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52111.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5697",
      "summary": "I saw bright  object that  huvered and then flew off with very high speed!",
      "city": "grandrapids",
      "shape": "disk",
      "date": "2007-08-07T00:00:00",
      "story": "I saw bright  object that  huvered and then flew off with very high speed! I was traveling down leonard street in my town and had to stop for a traffic light,something caught me and my wifes attention in the sky,I said to my wife do you see that and she said yes,what is it she asked?I said I dont know as it hovered high in the sky above us but at an angle that we could see it from my side window.It was shiny and bright and seemed to be standing still,we stared at it while waiting for the light to turn green and then it sped off with a speed never seen before.It appeared to have sensed we saw it and took off.It was a clear day and was no falling star,Ive seen falling stars and this was no falling star!My father in law was following us in his car behind me abaot 4 or 5 cars and when we got home he said he saw it to,we called the local radio station to report this and they said there were no reports that day but A current Afair was in town doing a story on sightings that week over lake Michigan that a air traffic controller saw and reported early that week that we were not aware of,I know this was something out of this world and my father in law is very conservitive and catholic and would not admit to seeing this for fear of being thought of as a idiot but still to this day admits to the sighting when our family gets toghether.I have seen this twice,after a aboat 8 years I saw it near Lake Michigan and it was the same appearance.Im the kind of person that did not belive this stuff(ufo's)but now I am convinced that there our things from other parts of space that are watching us.Me my wife and father in law will testify to this until the day we die. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57491.html",
      "state": "MI",
      "duration": "45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b57c7",
      "summary": "Bright Light Over Grand Rapids Michigan",
      "city": "grandrapids",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Bright Light Over Grand Rapids Michigan I looked out of my window and, to the southwest, I noticed a bright-white light.  At first, I thought it was a plane (since we have an airport in the general vicinity),  but after a second or two, I realized that it had no blinking lights on the wings. I then listened for a sound... There was none.  The speed at which it was moving was also in question: it was slow and methodical...about 5-10mph at best.  As it climbed overhead, it began to fade, until there was nothing left to be seen… ((NUFORC Note:  We assume that the source implies a nighttime sighting.  We have changed the time above, to reflect that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62608.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d8d",
      "summary": "Saw three white objects in clear blue sky flying against the wind in triangular formation.",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "Saw three white objects in clear blue sky flying against the wind in triangular formation. I was sitting in the back yard at my Girlfriend's house at 5:15 CDST in Grand Rapids, Minnesota.  We had just returned from Hibbing, Minnesota where we were shopping.  We were about to relax and have a drink. I was leaning back in my chair looking up at the sky which was almost totally clear and blue, except for clouds near the horizon.  Basically , it wa a totally clear sky, bright with sunlight.  Windy. My girlfriend was checking on her flowers.  I saw 3 white spots in the sky slightly southwest of vertical (toward Duluth).  I thought they might be fighter airplanes which do pass over at times.  And I thought they could be white birds.  However these objects were very, very high or at least appeared to be and I could not see any definition in the shape as you might with a bird or plane.  My girlfriend thought they appeared triangular. At first sight these spots were in a straight line and proceeding to the Northwest  by West.  I thought I might have seen a tether, but I may have simply interpreted the regular in line motion as tethered.  I was thinking of baloons.  But the fact was I knew that the objects did not appear as baloons or aircraft or birds.  The three spots were not shiny.  They were dead white.  They proceeded in a straight line as though on the wind.  I think the wind was in the opposite direction.  Very soon after first sight the objects moved in relation to each other, first appearing in the shape of an \"L\" with two fairly close together, almost touching.  But as the movement went on the three objects took positions at the vertices of a perfect equalateral triangle.  The triangle did not rotate.  There was no sound.  The motion was very steady as you see in a flight of birds.  As the white spots moved more to the Northwest, they stopped.  Abruptly.  The motion seemed kind of chaotic at that point, but reorginized and then began moving more or less straight south. It was then that the spots disappeared.  On first sight, with the objects in line, the appearance was quite different, but I would say the distance between the two outer objects or spots and the center was about the same as the distance between the points of the triangel shape later assumed.   If the points were tied together, the changing shape might have been that of triangle being rotated so that I just saw it from a different angle.  In the middle of this incident I got a cell phone call from my daughter about band practice.  That distracted me as I tried to get her to go and look. I called the Duluth Air National Guard security service at 5:45, a half hour after the sighting because maybe they had it on radar.  Of course, I didn't get any information and really, I was happy just to report what I saw. I am certain that the thing I saw was white.  Dead white. Not shiny.  It didn't change direction quickly although it may have been going very fast.  It must have disappeared instantly.  I don't know how high it was.  Certainly higher than birds flying.  And. . . I have never seen any thing like it and I have never made a report before.  I am 67 years old.",
      "link": "http://www.nuforc.org/webreports/057/S57153.html",
      "state": "MN",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5eed",
      "summary": "Pulsing light over Grand Rapids",
      "city": "grandrapids",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Pulsing light over Grand Rapids I couldn't sleep, so I went outside to watch some stars.  I wasn't out there long before I noticed a light slipping down from the sky in the North East quandrant.  It suddenly stopped amidst the background of stars and began to pulse a white light.  It remained stationary there for several minutes before moving on, very slowly, to the north...  I was told that the International Space Station crossed over West Michigan that same night, but does the space station have the capability to stop on a dime?  Pulse white light?  Change direction?",
      "link": "http://www.nuforc.org/webreports/057/S57190.html",
      "state": "MI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6053",
      "summary": "We saw what looked like a bright star with 6 beams of light coming from it , then changed red and was gone",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "We saw what looked like a bright star with 6 beams of light coming from it, then changed red and was gone My son (26 yrs old ) was on our deck when he noticed this object and called me to look at it!It looked like a bright star at first and it was gliding across from west to east.( never blinking )  After about 30 seconds it became a little more oblong in shape and 6 beams of light extended from it. Two on each side and one from both ends! After a few more seconds it turned from being a bright light with beams to a solid red color and grew small very fast and then it was gone. I have never been a big believer in UFO's but this was something really odd to us (enough for me to report it)I am a male 52 years old.",
      "link": "http://www.nuforc.org/webreports/059/S59355.html",
      "state": "MI",
      "duration": "1min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6420",
      "summary": "Pulsing lights",
      "city": "grandrapids",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Pulsing lights I couldn't sleep, so I went out into the backyard to stargaze.   After about 45 minutes, I noticed a slowly pulsing light directly overhead moving North.    A second later, I saw another one following right behind it.  They would pulse every 3 seconds, then fade out.   At arms length, they were roughly 7 inches apart from one another.   It was similar to the craft that I saw earlier this month.",
      "link": "http://www.nuforc.org/webreports/057/S57378.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b698e",
      "summary": "Pulsing white light seen again",
      "city": "grandrapids",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Pulsing white light seen again Early this morning I was sitting outside in the backyard watching the stars (as I am so wont to do nowadays) when I noticed, to the North, a pulsing white light moving in an Easterly direction.  It passed behind some trees, stopped, dimmed, then changed direction and began heading south, (right towards me).  I watched it as it slowly drifted over my head.  Every 3 seconds it would glow white-hot, then fade out.  At arms length, it was about the size of a pea.  This isn't the first time I've seen this craft.  It always seems to show up between midnight and 2:30am.",
      "link": "http://www.nuforc.org/webreports/057/S57477.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6962",
      "summary": "Small white and blue rectangular object scares dog and boy.",
      "city": "grandrapids",
      "shape": "rectangle",
      "date": "2007-11-28T00:00:00",
      "story": "Small white and blue rectangular object scares dog and boy. My 11 year old son came running into the house with a frightened dog telling me he had just seen something strange in the yard.  He said he was walking the dog and she suddenly saw something and got scared.  He looked up and saw a rectangular object with rounded sides in the air (I found out later he meant the sides were convex).  It was white with a wide blue stripe and was partially hidden by trees in our yard, but was in front of trees further away in our yard.  He described it as waving back and forth, then moving off to the right of his view further behind the trees where he could not see it anymore.  He said it seemed to be about 4 to 6 inches wide and about 18 inches long.  It was at an angle, not perfectly vertical.  He said it made no sound.  It did not give off light.  He insisted it was not a balloon, nor a piece of windblown trash or a kite.  There was a very light breeze, but that area of the yard is shielded from wind by trees.  I inspected the area a few minutes later.  There was no sign of any debris or trash (which would have likely been snagged in some pines trees, based upon the direction of the breeze).  He is a very grounded person and does not make up stories.  I have no idea what he saw, and I am at a loss to explain it.  We live in a rural area on a fairly busy highway, but trees isolate our house from the road.  Our dog is timid, but the fact she was the first to see something and reacted before my son saw it, makes me think he absolutely saw something real.",
      "link": "http://www.nuforc.org/webreports/059/S59638.html",
      "state": "OH",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b744f",
      "summary": "Pulsing Light Back Again",
      "city": "grandrapids",
      "shape": "other",
      "date": "2007-08-14T00:00:00",
      "story": "Pulsing Light Back Again After witnessing two lights fly over head just a 1/2 hour earlier, I looked to the East and saw an oval light heading in a southerly direction.  The object was about the size of a pea at arms length and slowly pulsed bright white, then faded out, pulsed once more, then disappeared.",
      "link": "http://www.nuforc.org/webreports/058/S58094.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b753c",
      "summary": "Michigan Fireball  500 Lights On Object0: Yes",
      "city": "grandrapids",
      "shape": "fireball",
      "date": "2007-02-24T00:00:00",
      "story": "Michigan Fireball  500 Lights On Object0: Yes I was driving to my aunts house, it was a saturday morning about 11:15am. Clear blue skys with few thin hazy clouds, when I finally arrived to the hous and park the car on the driveway for some reason (maybe because of the awsome weather rare in west michigan) i looked slighly up  and there it was, a \"small burnt orange ball in the blue sky it was stationary, I imediatlly called my aunt to come out and see \"the thing\" and with her came out my uncle and cousin, we all streared with disbelieve, the object did moved a bit side to side but that was only perceivable when looked at for seconds straights. It is very hard to come up with a approximate size or distance since the sky was so nice, but for one second I thought it might be a hot air balloon  so I asked my aunt  if she had binoculars or something like it, she went inside and handed me a set of bird watching monocular ( it looks like only one side of a binoculars. It took me a while to sight the object with the monocular but finaly I did and TADA! it was not a baloon, The best description of the object is a big red sphere with three smaller orange smi-spheres toghether, one thing that was very interesting was that we were able to see  some sort of \"vapor\" around it (like when the asfalt is very hot) The object started moving slowly  north, almost like drifting, then it stop completly and started moving south east this time a bit faster and longer to the point that we almost losted in between houses but all of the sudden the thin just rocketted  north west to the oposite side, the speed was not super super fast but but it was faster than anything that I have ever seen flying including fighter planes specially considering how hight it was. just a second after the thing blasted across the sky what it look like a business \"lear\" jet cross the sky with the same trajectory almost as if it was fallowing IT.",
      "link": "http://www.nuforc.org/webreports/055/S55383.html",
      "state": "MI",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b76ca",
      "summary": "Cylinder or Cigar over Grand Rapids",
      "city": "grandrapids",
      "shape": "cylinder",
      "date": "2006-07-16T00:00:00",
      "story": "Cylinder or Cigar over Grand Rapids I was taking a walk downtown when I happened to look up and to the west noticed a silver cylinder in the sky traveling about 5 or 10 miles per hour.  At first I thought it was a plane, because it was made out of shiny metal and seemed rather large and only about a few hundred feet away from me.  I didn't see any wings on it and I didn't hear any sound.  At arms length it was approximately 3 inches in length.  There were some cumulus clouds in the sky, so when it passed behind the clouds instead of in front of them, I was shocked.  It was enormous!  Possibly 400 to 500 feet in length.",
      "link": "http://www.nuforc.org/webreports/050/S50832.html",
      "state": "MI",
      "duration": "3 minues"
    },
    {
      "_id": "64d005f478aba2ec5a3b779d",
      "summary": "Pulsing Light Back Again",
      "city": "grandrapids",
      "shape": "other",
      "date": "2007-08-14T00:00:00",
      "story": "Pulsing Light Back Again After witnessing two lights fly over head just a 1/2 hour earlier, I looked to the East and saw an oval light heading in a southerly direction.  The object was about the size of a pea at arms length and slowly pulsed bright white, then faded out, pulsed once more, then disappeared. (P.D. - I mistakenly put the wrong date on the report form I sent just seconds ago.  It should read 08/11/07.  Thank you.)",
      "link": "http://www.nuforc.org/webreports/058/S58095.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b779c",
      "summary": "Two Lights Moving In Unison",
      "city": "grandrapids",
      "shape": "light",
      "date": "2007-08-14T00:00:00",
      "story": "Two Lights Moving In Unison I was outside in my backyard looking up at the sky when I noticed directly over head two lights approximately 4 inches apart at arms length slowly heading in a northerly direction.  They would inch forward together in unison, then stop, inch forward once more, then stop.  They proceeded to do this until they were out of sight.  I saw another object, but different, a 1/2 hour later...",
      "link": "http://www.nuforc.org/webreports/058/S58093.html",
      "state": "MI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b78d0",
      "summary": "Saw bright blue ball travel across sky.",
      "city": "grandrapids",
      "shape": "fireball",
      "date": "2007-02-24T00:00:00",
      "story": "Saw bright blue ball travel across sky. Saw Bright blue ball travel across the sky. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55157.html",
      "state": "MN",
      "duration": "3 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b79b4",
      "summary": "Standing in the front yard, 4 of us watched a silver cigar shaped craft move slowly across the sky and suddenly pick up speed andvanish",
      "city": "grandrapids",
      "shape": "cigar",
      "date": "2006-10-30T00:00:00",
      "story": "Standing in the front yard, 4 of us watched a silver cigar shaped craft move slowly across the sky and suddenly pick up speed andvanish 2 of my children, myself and my neighbor were looking north at the sky and noticed a cigar-shaped, shiny object that appeared to be very high up (about where an airplane would fly).  It seemed to move very slowly and left no smoke trail behind it.  I also seemed to be moving sideways.  Then it suddenly picked up speed and disappeared in a flash.  I have never seen anything like this before and I have no background having anything to do with UFOs.",
      "link": "http://www.nuforc.org/webreports/052/S52814.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8135",
      "summary": "I submitted this report back in 2005.  I have been reviewing my report from that time. There are a couple of things that are incorrect.",
      "city": "grandrapids",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "I submitted this report back in 2005.   I have been reviewing my report from that time.  There are a couple of things that are incorrect.  The sighting was South of Lake Michigan Drive and West of Covell Road.    A few more things I would like to point out.  The craft may have been 3 to 4 times the size that I stated (200-300 ft.)  As we were driving up Cenntenial Drive (steep incline) the lights caught my eye.  It was about 20-30 miles away, it was coming at us at a very high rate of speed.  It had multiple lights rotating around the middle of the saucer.  As in other reports that I read, the middle of the craft did not come to a point, it had was a verticle surface (5-10 feet or more)  The strangest thing was that as soon as the spot lights under the object focused on us (my friend who was driving killed the lights and coasted to the end of the road, so I felt it did not know we were there) it rose and speed off at an unbelievable rate of speed (thousands of miles an hour or more)  I was in the passenger seat and never took my eyes off of it.  It traveled 30 miles in two or three seconds.  We jumped on 196 East and followed it for about ten minutes.  It looked like a moving star off in the distance. The strangest thing of all is that after we headed back home, none of us spoke about it to each other or anyone that night (family members, etc.).  It wasn't until weeks later that we were all hanging out together, and I mentioned it as a dream.  Instantly both of my friends who were with me had the wierdest looks on thier faces.  I could tell they were freaked out.  We had one or two other friends present at this time.  They thought we were joking.  Each of us took turns telling exactly the same thing that happened. If anyone would like to talk to me about this, I would like to talk to someone if possible.",
      "link": "http://www.nuforc.org/webreports/066/S66724.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8531",
      "summary": "A bright spherical object with windows around the middle of the craft.  It just hovered silently for 30 minutes.",
      "city": "grandrapids",
      "shape": "sphere",
      "date": "2009-08-05T00:00:00",
      "story": "A bright spherical object with windows around the middle of the craft.  It just hovered silently for 30 minutes. I came home after visiting with my parents and doing some grocery shopping.  When I turned into the street where I lived, I saw something bright in the sky that was just hovering.  At first, I thought it was a helicopter. Then, I realized that it wasn’t making any noise, and it was much brighter than a helicopter. I have lived on an army base that had a helicopter unit so I knew what helicopters looked like in the night sky. I had noticed that there was a row of windows about the center of the sphere.  I did go into my home to put away my groceries, but something compelled me to go back outside.  I stared at the object for at least 30 minutes. There was no movement.  It just hovered. After awhile, I started to feel frightened and I had a strange feeling of being watched. I decided to get my digital camera, and despite my fear decided to go back outside. I went back outside to take pictures, but the craft was gone.  It was a white bright light, but it is was obvious that it was a sphere.  You could see the outline of the sphere.  I will never forget it for as long as I live.  I was never so scared in my life!",
      "link": "http://www.nuforc.org/webreports/070/S70506.html",
      "state": "MI",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b932c",
      "summary": "Silent triangle craft flies in straight line east to west quicly.",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Silent triangle craft flies in straight line east to west quicly. Today I was taking Christmas lights down out of my oak tree in my yard when out of nowhere I noticed a triangle craft moving quickly though the sky.  Looking up at it, it was silver/white in color and silent.   I am not sure how high it could have been, only that I figure to measure about 1 half inch in width across  the sky.  It moved in a very straight line from east to west.  By the time I could get my wife to see what I was seeing, it was already gone.  \tThe thing that makes this so unusual to me is the fact it made no noise.  If it was high enough to be  inaudible to the human hear I figure I would have seen a contrail from its engine or engines.  However there was none.  Also, this object was triangular and resembled nothing like an ordinary airplane I am very used to seeing in the skies flying over the mid-west region. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68524.html",
      "state": "MI",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9351",
      "summary": "I know what I saw....I don't care if you don't believe me....",
      "city": "grandrapids",
      "shape": "cone",
      "date": "2010-06-03T00:00:00",
      "story": "I know what I saw....I don't care if you don't believe me.... At dusk, and daylight was waining, I sat at my bedroom window on the second floor of our townhome complex.  I noticed a white light coming over the visual horizon and heading in my direction.  It took approximately 1 or 2 minutes for the craft to come into closer view and stopped over our complex.  It was shaped like a \"top\" and had spot lights around the entire circumference of the craft.  The lights were like spot-lights and fanned the ground.  It sounded like a turbine engine and rumbled the building.  My brother was next to me but not at the window.  He heard the sound, but when prompted to come look, he refused and waiting to long before attempting to look and missed it.  I went down to my mom and told her what I seen.  She said she heard it but it was a jet.  She didn't believe me and neither did my brother. The following morning, I discussed the event with a neighbor friend who also verified him and his parents seen the same thing.  Humoring me, my mom called the airforce and asked if anyone else had reported anything.  They said no. Granted, I was young and only in 3rd grade.  But as a boy, I know what a jet looks like.  I know what a helicopter looks like.  This vehicle had no wings and no props. and yet it sounded like a jet.  Besides the only jet that could hover that we were aware of was the harrier. ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75448.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b94a6",
      "summary": "Triangle in sky hovered for several minutes, moved overhead and flew away within seconds",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Triangle in sky hovered for several minutes, moved overhead and flew away within seconds Was driving home on a residential street in a suburban neighborhood. My 16-year old daughter was in the car with me. She noticed a bright light in the sky ahead of us and asked if it was the North Star. I looked for a few moments, then told her that no star was that bright. I then racked my brain to see if any planets were visible this time of year. The light was approximately 250-300 feet above ground. As we neared closer, we could see that rather than one bright light, it was actually two white lights and two red lights that were blinking intermittently. I said to her, \"Must be an airplane.\" As we neared even closer, I wondered out loud to her, \"But airplanes don't hover.\" The lights were remaining still in one spot directly in front of us. We could see, too, as we neared, that the lights were lower than first appeared, or perhaps had moved closer to the ground. The lights were not moving at all, other than blinking. It seemed odd and also apparent to me, that at my snail pace of 30mph, I was actually \"catching up\" with whatever it was. I told my daughter that we would find out what it was in a few seconds, because we're going to pass right under it. The object was still hovering in one spot. What happened next is unimaginable and outlandish. We passed under the object, which took 2-3 seconds at my drive of 30mph.  As we passed underneath, we could see that the object was triangular with round corners, the body was metallic, and corner of the triangle had a brightly colored light.  One light was green.  One light was red. I believe, but can't be positive, that the third light was white.  Directly connecting the large corner lights were smaller red and white lights that blinked in a row. The front of the triangle (the longer side) had an amazing glow from it, as if from interior lights.  We passed under in absolute shock. As we passed it, we both turned to each other and shouted. \"That was a UFO!\" My daughter said. I quickly pulled into a side street and turned my car around, in an attempt to catch back up to the object.  By the time I had pulled in, backed up and turned around the object was almost gone from sight. It was now moving at a ridiculous speed away from us.  I sped up, but within seconds the lights were completely gone from sight. Had my daughter not been in the car with me and witnessed what I had seen, I would have thought I had lost my mind.",
      "link": "http://www.nuforc.org/webreports/067/S67316.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e51",
      "summary": "Intense fiery, orange light that appeared to move slowly towards us in the night sky, changed course, then disappeared",
      "city": "grandrapids",
      "shape": "fireball",
      "date": "2009-08-27T00:00:00",
      "story": "Intense fiery, orange light that appeared to move slowly towards us in the night sky, changed course, then disappeared At first I thought it was a satellite, then I thought it was a meteor.  The altitude and the speed were too consistent to be either.  It should have gone over our heads in the direction it appeared to be heading, but then it turned and went around us.  It was a bright fiery orange light that gave off a very soft humming noise.  It was visible for what felt like two minutes before it faded away and disappeared. After the light in the sky vanished, I saw what looked like lightning in the distance around all of the trees on the lake.   As we were coming in to dock the boat, I looked around the lake one last time and saw some flashing lights on the ground and they were orange also.  It was like fire that flashed 5 times, and then disappeared and moved to another spot then flashed again and disappeared.   It was amazingly terrifying! ((NUFORC Note:  Please see other reports from Grand Rapids, MI, for the same time and date.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71673.html",
      "state": "MI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1da",
      "summary": "Four fireball spheres drift across horizon",
      "city": "grandrapids",
      "shape": "fireball",
      "date": "2008-08-12T00:00:00",
      "story": "Four fireball spheres drift across horizon Four fireball colored/shaped spheres drifted across the immediate horizon.  moving north to east, the spheres were in a semi-geometrical pattern shaped like a check mark.  The farthest fireball to the east appeared smaller than the nearest sphere towards the north--the pattern repeats    in respect to the other two fireballs to the north.  As the drifted away into the darkness, the first and second northern most fireballs arranged themselves so that if a  straight line was draw up, both fireballs would have landed on this line.  After a few more seconds all of the fireballs were out of eye site. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64800.html",
      "state": "MN",
      "duration": "1 min 40 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba550",
      "summary": "Uniform circular pattern of lights moving very fast across the sky several thousand feet high.",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "Uniform circular pattern of lights moving very fast across the sky several thousand feet high. My son and I were camping in the back yard in a tent. It was after dusk but not very dark yet. I saw a pattern of lights move across the sky from high up left to a downward direction to the lower right. The object was a circular pattern of about 5 bright yellow lights with one light in the center. It was not very high in the sky, about 2,000 feet. It was about the size of a dime from 20 feet away. It moved very fast. It may have changed direction but I am not certain. I first thought it was a shooting star but the uniform pattern of lights is not consistent with that.",
      "link": "http://www.nuforc.org/webreports/071/S71478.html",
      "state": "MI",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba51f",
      "summary": "3 objects one flared up. GR MI",
      "city": "grandrapids",
      "shape": "unknown",
      "date": "2009-05-12T00:00:00",
      "story": "3 objects one flared up. GR MI Myself, my girlfriend, sister in law, and her friend, were standing in our back yard chattin. I was lookin skyward wen i saw a object comparable with the stars. It was headin N-NE. Since it moved so fast i said look at that, everyon looked and found the object, we chatted bout satellites for a few seconds, when the whole thing flared up. It was so bright that it looked like it grew bout ten sizes larger for 3-5 seconds, then it went back to the normal tone. It never varied its heading this whole time. We could see it for prolly another three to four minutes before it covered the other half of our horizon an went outve view. As you could expect everyone was excited an watching the sky. Prolly 5 minutes later someone pointed out two more objects flyin close together from the east. We watched one object turn from headin NW (mostly west) along with the other an switch to N-NE. It seemed to follow the first object we seen, there direction mostly N by a lil NE. They both followed the restve of there headings true  till they crossed the horizons an disapeared. One that switched seemed to increase speed an dissapeared a few minutes faster then the one headed NW. Both outve site in round 5 minutes.",
      "link": "http://www.nuforc.org/webreports/069/S69918.html",
      "state": "MI",
      "duration": "30-40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba719",
      "summary": "circular discs in a formation speeded through the sky. 3 discs first, then 5, then 3 again, extremely fast.",
      "city": "grandrapids",
      "shape": "disk",
      "date": "2009-03-19T00:00:00",
      "story": "circular discs in a formation speeded through the sky. 3 discs first, then 5, then 3 again, extremely fast. At approx 12:00ish am, I was sitting on my computer listening to opera. My fiance was getting ready to go to the the store when I heard him say \"holy sh*t\" and then he pounded on my window and I ran outside, immediately seeing discs in formation with a reddish goldish soft glow over head heading west . Their were 3 at first in formation, then 5 in formation, then I saw 3 again, then I saw 3 more in formation approx 12:35(I went outside again during typing this). They moved extremely fast. I said we need to report this to someone and I looked  online for you guys. The discs were about the quarter of the size of the moon approx. They moved so fast, you had to keep your eyes on them and it seemed like they were only their for a matter of seconds.  They sped up after a few seconds whizzing through the sky.  During the writing of this email (as mentioned above), I went back outside again and talked to my fiance. At that moment again, I saw 3 more heading north.  I called my friend to see if she had a camera to go outside. She did not. My fiance saw alot more than me as he has been outside for over 45 minutes now. He will be making his report after my email.",
      "link": "http://www.nuforc.org/webreports/069/S69234.html",
      "state": "MI",
      "duration": "approx 30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba718",
      "summary": "Multiple flying objects over Grand Rapids Michigan.",
      "city": "grandrapids",
      "shape": "disk",
      "date": "2009-03-19T00:00:00",
      "story": "Multiple flying objects over Grand Rapids Michigan. I went outside just before midnight, to smoke a cigarette and looked up at the stars and saw a formation of 5 golden lights speeding across the sky West/northwest.  I stared in disbelief, then I saw two more reddish golden disks flying (one slightly behind the other) much lower and extremely fast.  I started backpedaling and tapped on the window to the room where my fiance was and before she came out I saw five more heading northwest.  By the time she came outside they were gone, but I just said, look at the stars...then bam, 3 more just flew West right then.  We witnessed a few more flying west and then I called my parents (looking at my phone I believe it was 12:07 when I called my mom and I talked to her for 11 minutes about what I was seeing)  My phone wasn't working first, but just as it finally started ringing and she answers, (she lives in Kalamazoo Michigan) two more flew over heading due west completely silent and extremely fast.  I witnessed 3 more formations as I talked to her, but I started seeing so many, I lost count of how many were in which formation.  Every formation was heading west or northwest, except one lone formation of 3 that traveled southeast.  The whole time I was seeing them, I only saw one airplane with blinking lights and one helicopter which was extremely huge and loud (it was flying very low, so I could see it was like a Huey and had only red lights)...my fiance had went into the house to file a report and I stayed outside and kept seeing these things.  At about 12:30am she came out and we called a number to report what we had seen, and two flew over very low and fast heading northwest.  I talked to someone on the phone for 4 minutes, and the helicopter flew over during the call. then we tried to call the airport, but only got automated answers.  I also was shocked when I witnessed a small flash and shower of sparks in the sky to the north.  It looked as though something may have exploded.  These things were a goldish somewhat red color and traveled in formations of 2, 3, or 5.  I lost count, but I saw at least 2 dozen.  They were silent, extremely swift, and mostly stayed in very tight rigid formations, that were shaped like triangles, or an upside down check mark.  Two or 3 of the formations were loose on one side, with the things weaving back and forth, while the other side of the formation stayed in a tight line.  The lights DID NOT blink ever.  The ones that were flying lower looked as though they had a ring of light golden light around them.  They moved easily 10X faster than the airplane I saw to the north (which had blinking lights that were greenish)  There wasn't a cloud in the sky, and I saw no moon.  If I had to guess, I'd saw they were heading towards Muskegeon and Lake Michigan.  I have NEVER seen anything like what I saw tonight.  I have seen meteor showers, shooting stars, satellites, airplanes, helicopters, planets, and the MOON of course.  I can't say what to use for a background, but the formations with 5 all had objects the size of stars and were flying much higher I believe.  The lower flying formations which only had 2 or 3 objects were much larger than stars.  Probably 4x the size of a star.  These larger objects were moving incredibly fast.  Even the smaller objects moved easily 10 times faster than the airplane to the north. We do not have any camera to take pictures.  And these things were so fast and some of them were so high, I highly doubt anyone could capture them on film.  It would just be a blurry mess I think.  I hope someone has at least tried to capture them though.  It was unlike anything I've ever witnessed in my life.  When I witnessed the shower of sparks, I did not see any objects around it and it was to the north.  It was around 12:30 when I saw it and my fiance just missed seeing it too as she was dialing a number for me and our house blocked her view.  This is all I have to say.  I would suggest following up in Muskegeon and around Lake Michigan and the Gerald Ford airport here in Grand Rapids....  I hope someone else saw this besides us.  It was so unique.",
      "link": "http://www.nuforc.org/webreports/069/S69237.html",
      "state": "MI",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baf04",
      "summary": "Triangle Flotation",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2011-03-10T00:00:00",
      "story": "Triangle Floatation While standing on the corner of Market and Goodrich waiting for the bus, I began looking around in all directions.  Looking towards the downtown area, in the Northeast sky, I saw an object the had a triangle shape border with an amber light in the lower right corner. The body was transparent.   It slowly drifted eastward in the sky a little more than the pace of a hot air balloon.  It then stopped and began turning counter-clockwise and then disappeared.",
      "link": "http://www.nuforc.org/webreports/080/S80398.html",
      "state": "MI",
      "duration": "5 mns"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb6d",
      "summary": "Light - Oval",
      "city": "grandrapids",
      "shape": "oval",
      "date": "2011-10-10T00:00:00",
      "story": "Light - Oval Around 11:30 PM last night I was gazing out the south facing window. All of a sudden, something (a UFO) flew West to East at great speed, in my summation I'd say over 500 MPH. I have very large double Windows.  At least 3 feet wide, maybe a little larger. I have seen planes and Aero-Med fly by the window before, when they do I can track them for several seconds as they pass by. Also I can hear them. This thing traversed the span of my window in less than 2 seconds. There was a Blue Light on the top a Red one below and there was a diminished White light in the middle (in a sort of Oval shape). It made absolutely NO SOUND. I got up to look out the window to see if I could make out where it was going and it was gone.  No, it didn't fly over the house or anywhere in the direction of the hospital, it was on a straight line East like toward ADA. And, again, It Made No Sound. ((NUFORC Note:  We have corrected the date above to reflect a sighting in September 2011.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84087.html",
      "state": "MI",
      "duration": "< 2 sec's"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb98",
      "summary": "Dark, Black Triangle Craft",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Dark, Black Triangle Craft It was a clear night, a friend and I were standing in my backyard when I looked up into the sky and saw a large floating dark triangle moving slowly across the sky from west to east.  Object made no sound and no lights were present.  We could make out the shape as it blotted out the stars behind it.  We both just stood there and watched in disbelief as it floated off and was obscured by trees.",
      "link": "http://www.nuforc.org/webreports/084/S84088.html",
      "state": "MI",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbdfd",
      "summary": "Bright non-blinking lights in a v shape that suddenly dropped from the sky",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Bright non-blinking lights in a v shape that suddenly dropped from the sky I was very suspicious of those who claimed ufo sightings before I experienced this tonight. What my fiance and I saw I still cannot get a full grasp on. What we saw seemed to be rounded with a group of three bright, non-blinking lights in a v shape at the view we had.  It was moving very fast for about 10 minutes and stayed steadily in front of us as we were driving down M-6.  After about a span of watching the craft trying to figure out what kind of airplane it was I pointed it out to my fiance. He was just as confused as I was.  After I had been watching it for about 10 minutes we seemed to be getting closer to it so I assume that it had slowed down.  At the point in which we were almost horizontal from it, it suddenly dropped from the sky. I don't know if it suddenly landed being that it was not that far off the ground to begin with or just went invisible.  That is what I am entirely confused about. My fiance thinks that it was a ufo and to us it most definitely was because it was unidentifiable to anything we had ever seen.  I, myself believe that it might possibly have been a military aircraft being that the stealth fighter jets are coming out this year.",
      "link": "http://www.nuforc.org/webreports/083/S83587.html",
      "state": "MI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc27b",
      "summary": "7 Diamond-shaped objects over Grand Rapids",
      "city": "grandrapids",
      "shape": "diamond",
      "date": "2011-10-10T00:00:00",
      "story": "7 Diamond-shaped objects over Grand Rapids I was outside in the backyard with my dog when I happened to look up and see three diamond shaped craft moving about 5mph coming in from the northeast.  Each shape had one dark side and one mirrored side and were rotating slowly in the sky, flickering like crystals in the sun.  They were almost directly overhead when I noticed four more diamond shapes approaching from the direction the three had previously come.  These four shapes caught up with the other three, and together they all moved in unison in a south-westerly direction.  It was really something to see.  I'm sure I wasn't the only one to notice them.  They were so close: 500-1,000 ft.",
      "link": "http://www.nuforc.org/webreports/084/S84091.html",
      "state": "MI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc26",
      "summary": "((HOAX??))  ((NUFORC Note:  Date is flawed.  PD))  Bright shiny object changed shape as it took off!",
      "city": "grandrapids",
      "shape": "teardrop",
      "date": "2011-07-04T00:00:00",
      "story": "Bright shiny object changed shape as it took off! We see ufo' quite often up here and have several videos.  One time lately a round orangish fire came onto our lake from the west.....stopped for a few seconds as we video taped it and then went north! ((NUFORC Note:  Date indicated by witness is flawed.  June has only 30 days.  Possible hoax.  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82023.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bce8a",
      "summary": "((HOAX??))  At 3am I let my Boxer, Buster, out.  I was standing in the doorway waiting for him when I saw a little “ET” run.",
      "city": "grandrapids",
      "shape": "",
      "date": "2011-05-12T00:00:00",
      "story": "At 3am I let my Boxer, Buster, out.  I was standing in the doorway waiting for him when I saw a little \"ET\" run across my neighbors’ back yard. It was 3 ½ feet tall with green skin.  It had big eyes with a prominent head with proportioned arms and legs. The street lights allowed me to see it clearly with few shadows.  From about 64 feet away it stopped and stared at my dog and me.  We stared back.  My attention was diverted briefly to let my dog in but when I turned back again it had vanished. To my knowledge it wasn't wearing clothing.  It was just moving along.  I did not look around for a ship. I'll be submitting this to Michigan MUFON ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81153.html",
      "state": "MI",
      "duration": "1.5minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1e3",
      "summary": "Not sure what i seen but it wasnt man made 1",
      "city": "grandrapids",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "not sure what i seen but it wasnt man made 1 I walked out side at 10pm to let my dogs out and i noticed a white  light in the sky as brite as a star moving and i told my girl friend it looks like that star is moving, she said it was the clouds so me and her was stilll iooking and watching this light as it looked like it was hovering for a second then fly across the sky and disappear . it was not a plane it didnt have the blinking lights like a helicopter .. i repeat it looked like a giant star  in the sky but lower then the rest of stars !",
      "link": "http://www.nuforc.org/webreports/092/S92105.html",
      "state": "MI",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd30d",
      "summary": "Four Orange Spheres Appered Like Fire in the Sky",
      "city": "grandrapids",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Four Orange Spheres Appered Like Fire in the Sky I walked outside on the way to the grocery store and looked up as I was heading towards my car.  I saw four flying object that looked liked fire all moving quickly across the sky with no sound or noise that you would expect from a plane.   They were heading from West to East at the same speed and after several minutes they appeared to get smaller as if gaining altitude and then they disappeared one at a time.  The first two disappeared withing 5 seconds of one another and then about 30 seconds later the third vanished followed by the fourth only 10 seconds after that.",
      "link": "http://www.nuforc.org/webreports/093/S93144.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3ab",
      "summary": "Bright star shape move and drop suddenly down from the sky, lost visibility because of trees.",
      "city": "grandrapids",
      "shape": "other",
      "date": "2012-10-30T00:00:00",
      "story": "Bright star shape move and drop suddenly down from the sky, lost visibility because of trees. Driving down Lake Michigan Drive and saw what looked like a very large bright star drop down suddenly, lost visibility after it dropped.",
      "link": "http://www.nuforc.org/webreports/093/S93182.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd705",
      "summary": "Bright multi colored fast moving circliar object  that responded to tactical led strobe light.",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "bright multi colored fast moving circliar object  that responded to tactical led strobe light. we observed an object that was first hovering lower than commercial airlines what seemed to be just above the tree line. when i pointed the object to my friend it was very bright, the color of iron ore. that's what caught my attention.  we were comparing to an air plane that was flying near by. when the object started to change to a blueish green color we decided to shine an led strobe light at the object. as soon as the strobe light turned on the object disappeared, but as soon as we turned the light off it would reappear. this went on about four or five times when finally the object rose straight into the sky very fast it reminded me of a falling star but going straight up. we lost sight of the object for about 30 seconds. we noticed it was directly behind us but as soon as we turned around it shot over our heads very high in the sky an then disappeared. it could have possibly been a second object. i have no logical explanation for the event i witnessed, b! ut what i do know it was no airplane or satelite if it is from our planet it is tecnology that would be highly advanced",
      "link": "http://www.nuforc.org/webreports/087/S87797.html",
      "state": "MN",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bdfc6",
      "summary": "Grand Rapids, Michigan  11:15 pm July 27... 2012  think I saw some ufo's or something..",
      "city": "grandrapids",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Grand Rapids, Michigan  11:15 pm July 27... 2012  think I saw some ufo's or something.. North of east Leonard & 96 area. maybe 20 - 30 lighted objects. traveling in a south word direction.traveling close to each other. I took video but it didn't turn out well.  They were scattered together like a swarm of bees. There were 5 others traveling in equal distances apart maybe a mile or so apart.  These were trailing the swarm of lights… ((NUFORC Note:  We spoke via telephone with this witness, and he seemed to us to be unusually serious-minded.  We suspect that he is a highly reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91238.html",
      "state": "MI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be2cb",
      "summary": "Orange lights in staggered formation over grand rapids michigan.",
      "city": "grandrapids",
      "shape": "formation",
      "date": "2012-11-04T00:00:00",
      "story": "Orange lights in staggered formation over grand rapids michigan. staggered red orange orbs numbering 12-15 in formation. no sound, they would rotate and swap positions but maintain direction of travel until they collected in a misty cloud that was spreading towards the city.   My brothers and i all took pictures with cell phones but not good images. same with video.",
      "link": "http://www.nuforc.org/webreports/094/S94088.html",
      "state": "MI",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be9fc",
      "summary": "2 sets of  8-10 yellow/orange orbs in triangle shape appeared in south and headed west",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2012-04-18T00:00:00",
      "story": "2 sets of  8-10 yellow/orange orbs in triangle shape appeared in south and headed west is this for real? while taking my dog out i saw a v formation come out of the southern sky and head west towards orion's constellation. the v was pointed towards the west and was a perfect gathering of about 8-10 orbs unblinking, unmoving, slowly crossing the sky and disappear.  i thought my eyes were playing tricks on me when in the south again another set just appeared and did the same thing. as the second set moved i ran back up to my apt to grab my girlfriend came back and they were gone. i have never seen anything like this before. does this happen to alot of people?",
      "link": "http://www.nuforc.org/webreports/088/S88470.html",
      "state": "MI",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bec79",
      "summary": "Red orbs over grand rapids",
      "city": "grandrapids",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "Red orbs over grand rapids A friend and I were outside our house smoking a cigarette. Neither of us are into ufo lore. A bright red light, looked spherical from our view, flew silently over top of us.  Hard to say how high up but it was a ways, maybe a few miles.  It was moving pretty fast, disappeared over horizon.  A few minutes later we spotted the same or another one, same exact shape.  This one was at a bit lower altitude than the first.  It stopped and stayed in one place for a while and then got back up to speed.  It disappeared over the horizon.   Later that night, my other room mate got home and we smoked a cigarette.  Like clockwork, as I told him about what I saw earlier another one appeared, this one much closer than the others.  Much lower altitude.  This one didn't have any light emitting from it though. Looked like a black ball.  By this time it was getting dark so we couldn't make out any details on it.  It eventually disappeared into the horizon too. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100593.html",
      "state": "MI",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7d5",
      "summary": "A beautiful night, clear skies and a wonderful light show.  I hope to see more in the future",
      "city": "grandrapids",
      "shape": "oval",
      "date": "2013-08-30T00:00:00",
      "story": "A beautiful night, clear skies and a wonderful light show.  I hope to see more in the future I was at work Friday night and I happened to see a red orb in the sky, it stayed in one spot for 30 sec it blinked out for 1 sec, then appeared in a spot (a little to the east).   It stayed in the spot for 30 sec then went to another spot.   5 min later I noticed 3 red orbs in a diagonal row, it looked like orions belt.  Within 2 min the orbs were gone. The place where they appeared are over an airport (the Gerald R. Ford airport). The orbs were red in color and they appeared to blink out then appear in other spots within seconds.",
      "link": "http://www.nuforc.org/webreports/101/S101345.html",
      "state": "MI",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf88a",
      "summary": "Multiple orange lights",
      "city": "grandrapids",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "Multiple orange lights Orange glowing lights, first just 6 hovering, then they moved into a line and went out of sight. Around 5 minutes later another wave of around flew by,silently. Witness 1 saw them first, when witnesses 2 and 3 came out they did not appear.  Then they appeared with more frequency and numbers.  They seemed to swoop in, (going from East to West)in arcs or vees, and glide overhead, disappearing from sight just a little behind us. The largest wave was over 40, they came in strong waves 5 times, and smaller waves at least 9 times. The intervals lengthened to roughly 9 minutes between sightings, they seemed to be flying higher, except for the last sighting. It was 2 lights, they were first spotted directly over head, where they hovered for a moment, then flew lower and out over the street then headed Southwest and disappeared. They had wings, but no other features were distinguishable other then the orange light.",
      "link": "http://www.nuforc.org/webreports/097/S97312.html",
      "state": "MI",
      "duration": "1-1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb70",
      "summary": "The way they traveled together with no sound was eerie!!",
      "city": "grandrapids",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "The way they traveled together with no sound was eerie!! I seen twelve round bright white objects all following same path going faster than a plane would travel it was calm wind conditions.   They made no sound at all 8 in perfect order then 3 together then the last one seemed to be traveling at least three times faster then the rest I watched from my balcony.  It was eerie the hair was standing up on my neck gave me the chills don't know why!!! ((NUFORC Note:  Witness corrected the time of the sighting to reflect a nighttime sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98965.html",
      "state": "MI",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0129",
      "summary": "While I was driving south on the Beltline, there were a large cluster of 30 or so bright  yellow-orangish lights glowing brightly. At f",
      "city": "grandrapids",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "While I was driving south on the Beltline, there were a large cluster of 30 or so bright  yellow-orangish lights glowing brightly.  At first they appeared to be stars but I very quickly realized they weren't as they were very low and were moving swiftly... As I continued to drive south, they continued moving east moving out of my sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97553.html",
      "state": "MI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d66",
      "summary": "Circle craft captured in 2 of 3 pictures, near Grand Rapids, MI.",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2013-12-23T00:00:00",
      "story": "Circle craft captured in 2 of 3 pictures, near Grand Rapids MI. Southeast of Grand Rapids sky.  One circle craft.  Starseed",
      "link": "http://www.nuforc.org/webreports/105/S105421.html",
      "state": "MI",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ed7",
      "summary": "Two lights, three lights, four lights, gone!",
      "city": "grandrapids",
      "shape": "diamond",
      "date": "2013-12-02T00:00:00",
      "story": "Two lights, three lights, four lights, gone! I was driving behind my wife on Butterworth.  We turned onto O’Brien St and I was instantly drawn to two lights in front of me in the distance.  At first I thought they were car lights but soon realized they were up in the sky. The next thing that came to mind was a plane with its landing gear down and lights on. There just seemed to be something odd about them though.  There was no red and they weren’t blinking at all.  Just two bright white, almost blue lights.  As big as the lights were, if it were a plane I think I would have seen it moving. Now I’m thinking a brand new cell tower.  As I got to where they were almost to my side up in the sky, I slowed the vehicle way down almost to a stop and looked for the tower itself.  Realizing it was way too dark to see a tower at night, I focused back up on the lights again. Now there were three lights, all the same, in a triangular pattern. I am now at a complete stop in the middle of the road intrigued by these lights.  I decide to pull up off the road and am trying to do so without taking my eyes of the lights but have to look away to pull over.  When I look back there are now four lights in a nonsymmetrical diamond pattern.  Kind of like one end was stretched way out. I am at a complete stop with my window down.  The lights are at a stand still too when all of a sudden they move a long distance in a second and stop again and then start slowly moving.  Now I know this is not a plane and I am thinking it’s not a helicopter.  I think if a helicopter were to move  like that the lights would have had to tilt.  They didn’t.  They always stayed in the same plain.   My wife’s phone call wondering if everything was OK broke my gaze on the lights.  When I looked up for them again I couldn’t find them.  They were gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104684.html",
      "state": "MI",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1463",
      "summary": "Bright Green Fireball.",
      "city": "grandrapids",
      "shape": "fireball",
      "date": "2013-11-20T00:00:00",
      "story": "Bright Green Fireball It was a giant, brilliant, emerald green fireball!  It fell super fast and looked like somekind of a Comet.  It had a huge tail and was very bright. It was absolutely incredible and mysterious. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104474.html",
      "state": "MI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c19df",
      "summary": "Day lift, bright bar became triangle, then faded away.",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2014-06-04T00:00:00",
      "story": "Day lift, bright bar became triangle, then faded away. I was driving PM commute northbound 131, stopped for slow traffic north of 28th St. Looked out driver's window and saw a horizontal, stationary bar of light at 10:00-position, tipped to north, and in tipping became an elongated triangle or wedge-shape, very bright. clear sky & sun behind me off to left.   Traffic was then nudging forward, I looked again at the triangle and it slowly faded then disappeared.  Never changed position.   Size was about thumb-nail at arms length.  Object was flat triangle and had no depth or details.",
      "link": "http://www.nuforc.org/webreports/109/S109657.html",
      "state": "MI",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a04",
      "summary": "I went to sit on my front porch in Grand Rapids, MI, and saw two orange orbs approaching from the southwest.",
      "city": "grandrapids",
      "shape": "",
      "date": "2014-07-26T00:00:00",
      "story": "On Saturday, I went to sit on my front porch in Grand Rapids Mi at about 10:30 p.m.  I was only out for a little while, when I spotted two distinct orange orbs coming from the southwest and traveling north at a quite a high rate of speed.  The one nearest, which was still at a high altitude, was brighter.  The other one appeared smaller, and was some distance back from the first one.  I observed them for about 30 seconds, and then they were gone. July 25, (2014) (sic.  Corrected by witness to July 23rd, 2014) I was about five minutes from home, when again, I saw some of the same type of lights.  I pulled into a parking lot, and counted 7 of them.  They were at a fairly low altitude, coming out of the northwest heading southeast.  I almost couldn’t believe what I was seeing.  But there they were.  So, I came home, went out in my backyard with my Brother, and they were still there, moving fairly slow. We counted about 9 this time.  The last one that appeared was bright red, then changed to orange.  About that time, we  saw an aircraft coming from North to South.  It was probably at about 35,000 feet.  It looked quite distant relative to the strange lights.  After that I did a little research online, and saw similar accounts of the same type of lights.  I would not make something like this up.  I  have nothing to gain from it.  I just wanted to report it, and would like to know if there were any other accounts on the objects I saw. ((ADDENDUM FROM SAME ANONYMOUS SOURCE)) My second sighting occurred on the Wednesday the 24,  Sorry for the error.  (sic.  July 23rd)  Wednesday of this week was July 23rd, 2014.  We are totally confused by the report, and by the \"correction\" by the witness.  PD ((END ADDENDUM)) ((NUFORC Note:  Wednesday of this week was July 23rd, 2014, not the 24th.  We are totally confused by the report, and by the \"correction\" by the witness.  However, the witness has elected to remain totally anonymous, and provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111875.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c1a85",
      "summary": "Five to seven yellow/orange round objects appearing to hover in the sky.",
      "city": "grandrapids",
      "shape": "oval",
      "date": "2014-06-04T00:00:00",
      "story": "Five to seven yellow/orange round objects appearing to hover in the sky. At approximately the elevation a helicopter or small aircraft would travel, I observed five to seven smallish orange/yellow round objects appearing to hover west of the location I was in.  I was riding a bike doing laps so I observed these objects numerous times as I would come around again.   These objects did not flash or appear to be moving however on two occasions (laps) I observed one of the objects move towards another in the group then back to its starting location.   After approximately 15 minutes I observed them appearing to move towards the west as they grew fainter and before I made the curve in my lap I could see they were gone.  I continued for another 30 minutes and they did not appear again. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109374.html",
      "state": "MI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b63",
      "summary": "UFO flying around, and then stopping in mid-air- bright flashing lights.",
      "city": "grandrapids",
      "shape": "disk",
      "date": "2014-07-26T00:00:00",
      "story": "UFO flying around, and then stopping in mid-air- bright flashing lights. The sighting happened on 7/22/2014, ((sic.  07/23/2014)) at around 1:30 am.  I walked out a bar and to a car. When I sat in the car, I noticed something was gliding in the air.  I assumed it was a plane, so I didn't stare at it too long.   About 5 or 10 minutes went by, and then I saw my friends coming out from the bar and in front of the car I was in.  I looked up, and the craft was still up in the air, just sitting there.  It wasn't moving at all, and at that moment I realized what its shape was and how close it was.  No noises came from it, even though it was fairly large.   I got out of the car, and walked to where my friends were.  I still didn't hear anything.  It was flashing these bright lights, mostly red.  It was in a big long strip around the hemisphere of the craft, and it seemed like it was a lot of smaller lights making it look like a red strip. Inside the red strip were little bright red dots, so I assume that means those were individual lights.  Sometimes it flashed green on one side, and sometimes blue on the other side.  The red was almost always on.  I think i might have seen another color, but all I can remember is red, green, and blue.  The craft flashed the lights in weird patterns, sometimes it was just still, sometimes the lights flashed.  It was dark out, so they were very bright and intense.  It was hard to see what color the craft was, because of the light, but I think it was metallic.  I know for sure it was shaped like a UFO.  It was a flying saucer, more round than flat.  We were quite close to this craft too, close enough to get a good look at it.   My friends and I watched this craft move and glide around in the air, taking sharp turns in weird directions.  It would stop, then lower itself straight down in a perfect fast motion, then stop.  Then it would rise up, perfectly straight, and stop mid-air.  It went even higher and higher, in the same vertical way, and then it stopped and lowered itself again. Then it would start flying around back and forth, like it was watching something.  It did this for q! uite a w hile, moving around then going up and down fast then slow. I felt like I could see something around it, but I'm not sure what that was.  I might have been seeing something as a result of those lights, but it seemed like the craft was inside of something else.   When the craft left, it just lowered itself down below the treeline, and never came back up.   I waited in the car for about 25 minutes, but it did not come back.",
      "link": "http://www.nuforc.org/webreports/111/S111799.html",
      "state": "MI",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b47",
      "summary": "White smoke leaving a flying object, in which the object then disappears.",
      "city": "grandrapids",
      "shape": "oval",
      "date": "2014-07-20T00:00:00",
      "story": "White smoke leaving a flying object, in which the object then disappears. It is July 16, 2014, 9:25 pm, the reason I know what time it was because my father and law stated to my sister in-laws that he timed them out of the yard chore that had been done at 9:25 pm July 16, 2014. During this initial conversation, I looked up into the sky saw a plane coming from the south and the plane was clear enough for me to have stated sitting in front of the wing and the rear of the wing a few times in my life.   While looking up at the air plane, reminiscing about old times, I noticed a oval shaped faintly lit orange object in the sky heading west moving about the same speed as the airplane I spoke of earlier.  I watched this object about the size of a head of a 5/32 drill bit down to a 1/8 drill bit, then all of sudden I seen about 3/4 of an inch of white smoke behind the 1/8 inch drill bit size object disappeared.  (Shapes and sizes are my point of view of the flying object from where I was standing in Grand Rapids, Michigan, while looking up into a clear blue sky the plane was about an 1 inch long in the sky. )  Keep in mind the plane was heading northeast, and the object was heading west.",
      "link": "http://www.nuforc.org/webreports/111/S111608.html",
      "state": "MI",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1be3",
      "summary": "White ball of light",
      "city": "grandrapids",
      "shape": "other",
      "date": "2014-07-04T00:00:00",
      "story": "White ball of light 4 Stars in a square formation with a large white circular object that was much bigger than a planet.  The circular object seemed to move south, then it changed direction.  It apparently started to stop and then started to gain altitude.  It quickly receded from view. It would be important to note that the stars are noted for refrence.  This object moved faster than any sattelite and was very abrupt in direction changes.",
      "link": "http://www.nuforc.org/webreports/110/S110808.html",
      "state": "MI",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1eb0",
      "summary": "Sighting as I was leaving work.",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2014-06-20T00:00:00",
      "story": "Sighting as I was leaving work. I got out of work at 3:45 am at the sametime everyone go's on break for fifteen minutes I saw this weird red light as I stood by my car smokin a cigarette.  Then I notice it wasn't moving so I told a coworker to check it out as I was leaving but I had a plan to get close to it so I drove to get right under it I took a pic of it and later.  Found out my coworker got video of it he also can't figure out what it is wish I could show u my pic it's really weird.  My picture it's weird u just have too see it.",
      "link": "http://www.nuforc.org/webreports/110/S110360.html",
      "state": "MI",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2143",
      "summary": "Triangular craft with three dim orange lights.",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2014-05-08T00:00:00",
      "story": "Triangular craft with three dim orange lights. \tShortly after 10:45 pm I was walking down the sidewalk in front of my house and looked up to admire the brightness of mars.  While looking at the sky I saw what fist appeared to be a single cloud in an otherwise clear night sky. \tI noticed that the object was moving too fast to be a cloud and had a distinctive triangle shape with rounded corners. It appeared to be about 300 feet off the ground and flew directly over me.  When it was directly overhead I could see three semi-spheres on the bottom that were emitting a very dull orange light.  As it flew farther away I lost sight of it when it flew over a street light.",
      "link": "http://www.nuforc.org/webreports/109/S109232.html",
      "state": "MI",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c16",
      "summary": "Bright white orb.",
      "city": "grandrapids",
      "shape": "light",
      "date": "2014-09-10T00:00:00",
      "story": "Bright white orb My mom saw a white glowing orb floating by the neighbors yard.  The orb then flew to the top of a tree.  I was awaken by my neighbors dogs barking.  Then a flash of intense white light came trough my window. It was bright like a camera flash but constant, not flickering.  I assumed it was someone playing a prank.  My nephew did not see anything but oddly enough he was dreaming of a bright white light from an airplane.",
      "link": "http://www.nuforc.org/webreports/113/S113353.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d66",
      "summary": "I saw 2 red lights moving silently  through the night sky.  The lights appeared to be on the same horizontal line and flew directly abo",
      "city": "grandrapids",
      "shape": "unknown",
      "date": "2014-08-29T00:00:00",
      "story": "I saw 2 red lights moving silently through the night sky.  The lights appeared to be on the same horizontal line and flew directly above my house in a west to east direction disappearing into the clouds. The sighting of the lights occurred at 12.48am Sunday morning.   I can't seen to get my computer to accept military time notation.",
      "link": "http://www.nuforc.org/webreports/112/S112826.html",
      "state": "MI",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e22",
      "summary": "During the night of June 28, 2014 during the twilight hours right before in got dark me and two friends were sitting out on the deck of",
      "city": "grandrapids",
      "shape": "light",
      "date": "2014-08-15T00:00:00",
      "story": "During the night of June 28, 2014, during the twilight hours right before in got dark, me and two friends were sitting out on the deck of his house and saw a bright light that was peach color zooming across the sky that had to be going at least a couple of thousands miles an hour and this is what caught our attention and it stopped and hovered and we noticed that it left no contrails or sonic boom, it then started to move again in the north west direction about approximately two miles high and then disappeared. After this, being totally amazed by what we saw two more bright lights the same color e going in the same direction came zooming by doing the same thing and after about a minute after that one more zoomed by going in the same direction. A week later during the 4th of July, we were watching the fire works at the same time of night and saw the same thing but this time there was only two and it seemed that people were trying to set off fire works to blow them off close to them. I talked to other people that said that saw the exact same thing at or around the same region. About ten days later me and a different person saw the same peach colored light zoom across the sky but going in a north eastern direction. A total of about ten witnesses.",
      "link": "http://www.nuforc.org/webreports/112/S112410.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3119",
      "summary": "On Saturday, July 5, 2014 I went to sit on my front porch in Grand Rapids Mi at about 10:30p.m. I was only out for a little while, when",
      "city": "grandrapids",
      "shape": "",
      "date": "2014-08-01T00:00:00",
      "story": "On Saturday, July 5, 2014, I went to sit on my front porch in Grand Rapids, MI, at about 10:30 p.m.   I was only out for a little while, when I spotted two distinct orange orbs coming from the southwest and traveling north at a quite a high rate of speed.  The one nearest, which was still at a high altitude, was brighter.  The other one appeared smaller, and was some distance back from the first one.  I observed them for about 30 seconds, and then they were gone. July 25, (2014), I was about five minutes from home, when again, I saw some the same type of lights.  I pulled into a parking lot, and counted 7 of them.  They were at a fairly low altitude, coming out of the northwest heading southeast.  I almost couldn’t believe what I was seeing.  But there they were.  So, I came home, went out in my backyard with my Brother, and they were still there, moving fairly slow. We counted about the 9 this time.  The last one that appeared was bright red, then was orange.  About that time, we an aircraft coming from North to South.  It was probably at about 35,000 feet.  It looked quite distant relative to the strange lights.  After that I did a little research online, and saw similar accounts of the same type of lights.  I would not make something like this up.  I have nothing to gain from it.  I just wanted to report it, and would like to know if there were any other accounts on the objects I saw. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111899.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c30de",
      "summary": "Quick Flash of Light in the Sky.",
      "city": "grandrapids",
      "shape": "unknown",
      "date": "2014-08-15T00:00:00",
      "story": "Quick Flash of Light in the Sky. At 19:30 to 20:00, my partner and I went outdoors to smoke.  After the session, at about 20:00, we began to marvel at the stars' beauty that night, and lay back on the driveway to enjoy the night sky.  Near Orion's belt, for no more than a second, we both see a flash of white/blue light similar to a camera flash.   We observe for 10 more minutes as to find any more, and see 2 yellow/orange lights (non blinking) accompanied by a red light at the center.   At first we believe it to be a plane, but can not confirm due to a lack of noise and the apparent low altitude.  After this we go inside.   No pictures were taken due to the quickness of the event.",
      "link": "http://www.nuforc.org/webreports/112/S112481.html",
      "state": "MI",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c34b6",
      "summary": "The ufo looked like a star.  The responding sheriff deputy and I possibly saw the ufo at 90k feet leaving Earth.",
      "city": "grandrapids",
      "shape": "light",
      "date": "2015-01-26T00:00:00",
      "story": "The ufo looked like a star.  The responding sheriff deputy and I possibly saw the ufo at 90k feet leaving Earth. On the horizon, in the south west, was a bright light; looking like Venus or a star.  This ufo was approaching at about 30 mph.  About 1-2 miles out.  About 3 football fields up from the ground or a 1,000 feet up from the ground.  It almost collided with an outbound jet traveling from the south east and going north west at about the same height.  Paths of the jet and ufo crossed, just about overhead, about a 1/4 mile to the north by northwest.  The jet can be heard in the video I took.   The ufo would not show up on my smart phone screen as a videoed.  Only the blink, blink of the jet showed up on my phone screen as I recorded.   The ufo was recorded when I aimed the camera eye at the peak of a 30 foot building with a mercury light on the side of the building.  The mercury light is the size of a beach ball and is seen in the lower left of the video.  The mercury light is about 3 feet down from the peak.  As the ufo passed in the background of the peak I recorded it.  mike Michigan ufo (you! tube) 24 seconds of video taken.   It was silent as can be.  It never altered its shine.   No FAA (Federal Aviation Administration)  lights on the ufo.  No strobes.  It never so much as flickered.  It continued in a straight path going, again, north east at 30 mph.  The jet continued on. ((NUFORC Note:  We have looked at the photos, provided by the witness, and we do not see anything that seems to us to be unambiguously related to the presence of a UFO.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116851.html",
      "state": "MI",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c38ef",
      "summary": "Unusual craft flying and wobbling fast, and a big red trapezoid-like light.",
      "city": "grandrapids",
      "shape": "unknown",
      "date": "2015-01-09T00:00:00",
      "story": "Unusual craft flying and wobbling fast, and a big red trapezoid-like light. I was taking my dog outside to go to the bathroom, and was watching the night sky.   Seconds after I looked up, I saw this large craft hovering across the sky very quickly.  It wobbled slightly, and had red and white lights.  One of the red ones was large and had a sort of trapezoid shape.   Within seconds, the craft traveled from the east side of the sky to the west, and lowered itself very quicky.   Because there were homes and trees in the way, it vanished from my sight.  Seconds later, a plane flew over.   I do not know if the plane had anything thing to do with the ufo.",
      "link": "http://www.nuforc.org/webreports/116/S116547.html",
      "state": "MI",
      "duration": "13-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c37",
      "summary": "Four white triangular objects with green lights underneath, closely followed by a smaller, circular, white object, looked like a star.",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2015-07-03T00:00:00",
      "story": "Four white triangular objects with green lights underneath, closely followed by a smaller, circular, white object, looked like a star. At first I thought they were birds but then I saw each one of them had a green light underneath.  They were 4 white objects flying at low speed  in a formation like a plane wing, not 2 wings but one.  At times, they broke the formation to touch between them, but always kept  moving ahead. What impressed me more was a round, circular, smaller and not too shiny object fliying right behind them, pretty much similar to a star. In the past couple of months I've seen  other objects a couple of times, circular and like orange color.  First one alone and later like 4 more flying in wing formation,  What I guessed was they might be drones or something, but what I saw last night is definitely out of this world.  I don't know why I don't hear more people talking obout this sights, they seem to be common around here.",
      "link": "http://www.nuforc.org/webreports/119/S119772.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4197",
      "summary": "Shooting green light moving very fast from east to west.",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2015-04-30T00:00:00",
      "story": "Shooting green light moving very fast from east to west.",
      "link": "http://www.nuforc.org/webreports/118/S118610.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4878",
      "summary": "3 bright white lights in the shape of a triangle - same distance and same size - then formed a straight line and moved east.",
      "city": "grandrapids",
      "shape": "triangle",
      "date": "2015-11-06T00:00:00",
      "story": "3 bright white lights in the shape of a triangle - same distance and same size - then formed a straight line and moved east. It was 3:35 am on 11-4-2015 - I walked outside to let my dogs out.  Looking East, I’ve noticed that lately I can see Jupiter, Mars & Venus to left of the moon in an “L” shape.  I didn’t see the planets this night, they would have been above my house and out of sight at the time I was outside (I can usually see them about 5:30 – 6:00 am).   I saw 3 bright white round lights in the shape of a triangle, but larger than a normal star all the same size and brightness...  There was no solidity to it, just the 3 lights formed into a perfect triangle, no noise.   I usually stand inside waiting for the dogs but this time I walked outside to get a better look, rubbed my eyes, thinking that I just woke up, or that I was seeing stars in a constellation that I didn’t recognize, etc…    I stared at the lights for about 10 seconds, then the 2 lower lights of the triangle came around each side to form a straight line with the middle light and they slowly started moving East and up getting farther and farther away but maintaining equal distance between each other, until I could no longer see them, for about another 20 seconds.  I watched them just disappear… almost like you’d see a satellite in the sky, but these 3 stayed together.    I tried to “de-bunk” what I saw by looking at the placement of the planets and stars at this particular time that night and there was nothing that would have been in my view at that particular time that would have formed this triangle, let alone the movement.   The feeling I had was something other than looking at the stars too, I knew immediately that it wasn’t something ordinary, that it wasn’t a plane or 3 satellites…   It was cold outside and I had no slippers or socks on and was in my pajamas, I never go outside while waiting for my dogs to come in, not even in the summer, I wouldn’t have walked outside if I didn’t think this was something worthwhile to look at…",
      "link": "http://www.nuforc.org/webreports/123/S123371.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b02",
      "summary": "Silent bright round light in sky.",
      "city": "grandrapids",
      "shape": "light",
      "date": "2015-09-17T00:00:00",
      "story": "Silent bright round light in sky. Sitting on porch with husband.  We both saw a bright round white light fly quickly through the sky and low.  The light was very bright and did not flash at all.  There was no sound at all and close enough where if it was a helicopter or plane, we would have heard the noise. Very little cloud coverage, mild temperature, and very little wind.  Because it was at night, we were unable to see if there was a trail left behind.  No meteor showers at this time.",
      "link": "http://www.nuforc.org/webreports/121/S121899.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c4f00",
      "summary": "Bright Red Objects Move in Unison.",
      "city": "grandrapids",
      "shape": "light",
      "date": "2016-03-18T00:00:00",
      "story": "Bright Red Objects Move in Unison. I was standing out in the middle of Coit Park this morning, looking up at the stars, when I happened to notice a large red light (about the size of a pea at arm’s length) slowly pulsing (3 seconds to full brightness then another 3 seconds to dim completely).  It was coming from the south very slowly and as it approached overhead it came to a full stop and dimmed out of sight.   Then I noticed another object of the same description slowly following in its path.  As soon as that object reached the position of the first one, they “greeted” each other with a simultaneous bright red flash then moved in unison slowly to the north - dimming and brightening as one unit until they were out of sight.  This lasted for about five minutes.",
      "link": "http://www.nuforc.org/webreports/126/S126332.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c559e",
      "summary": "Driving south on 131 near Leonard Street exit in Grand Rapids.  Blueish/green teardrop shaped craft suddenly appeared at a high rate of",
      "city": "grandrapids",
      "shape": "teardrop",
      "date": "2016-07-08T00:00:00",
      "story": "Driving south on 131 near Leonard Street exit in Grand Rapids.  Blueish/green teardrop shaped craft suddenly appeared at a high rate of speed just below cloud level.  Ran across sky and disappeared after a few seconds.  It was like a window opened up in the sky and this object flew through it.",
      "link": "http://www.nuforc.org/webreports/128/S128099.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c55ad",
      "summary": "Flashing red object seen in West Michigan sky, June 28, 2016, @ 22:25 hrs..",
      "city": "grandrapids",
      "shape": "light",
      "date": "2016-07-08T00:00:00",
      "story": "Flashing Red Object seen in West Michigan Sky June 28, 2016 22:25 Completely clear night sky,  Red flashing light seen in the east.  object caught my attention because of the extremely high speed movement.  object rapidly approached my position, stopped 'on a dime' so to speak, and headed north at at the same extraordinary speed.   Object stopped again, headed southeast, stopped again, headed west, stopped, and then south out of my view.  when object was stopped, it remained in place for around 30 seconds. although the object was red and very bright in the sky,  my iPhone 6 was unable to photograph or record video of the incident.  no sound was noticed.  difficult to estimate the distance from my position.",
      "link": "http://www.nuforc.org/webreports/128/S128129.html",
      "state": "MI",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5892",
      "summary": "Multiple craft seem to witness black meteor approach over Grand Rapids, MI.",
      "city": "grandrapids",
      "shape": "other",
      "date": "2016-06-01T00:00:00",
      "story": "Multiple craft seem to witness black meteor approach over Grand Rapids, MI. Event started with two white starlike/satellite-like craft traversing the sky from North to South and \"parking\" in the sky above SE Grand Rapids area.  Then two multi-colored light, triangular vehicles moved from West to East and parked it in the Eastern Sky, estimating 10-20 miles east of GR at around 2,000ft alt.   Then a black meteor looking thing traversed the sky from the North, where the two satellites came from, to the South (near over the GRRFord airport) and the black object vanished on the Southern Horizon (I've got buildings around so I can't see the real Horizon).   A few seconds after the black object traversed the sky, a triangle of stars in the Southern sky, which I had previously not noticed except that they were there for at least 15 minutes while I was talking on the phone to my fiancee, suddenly moved in unison as if they were falling out of the sky down and to the left (as if in the direction of the black object's trajectory terminus).   I opened the porch door to tell my night nurse to come see the UFOs and she came out and saw another \"star\" fall out of the sky toward the same spot.  She freaked out and ran back inside afraid. I watched for awhile to see if anymore activity, but only saw a few of the \"blinkies\" (stars that blink on and off and move around a little - which I usually only see in thunderclouds).  The \"parked\" stars vanished while I was watching the triangle drop.   Whole thing seemed like either a greeting party or an interference party for whatever that black thing was.",
      "link": "http://www.nuforc.org/webreports/127/S127532.html",
      "state": "MI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ad1",
      "summary": "5-6 orbs in the form of a line in 4 and 2 behind it with gaps in between. Yellow/orange colored over antenna in the city",
      "city": "grandrapids",
      "shape": "sphere",
      "date": "2016-04-22T00:00:00",
      "story": "5-6 orbs in the form of a line in 4 and 2 behind it with gaps in between.  Yellow/orange colored over antenna in the city 5-6 sphere orbs floating over a cellular antenna as we were driving threw the city on the express way.  When passenger noticed the yellow/orange orbs floating, I glanced and witness them floating.  I would describe it as looking at Christmas lights in the form of 3-4 in a line and 2 behind them in a line with a gap between them.   After looking away then glancing back it disappeared as we drove in a direction out of sight.  We turned around to see if we saw it in the sky and it wasn't visable.  It was pretty noticeable and I am really hoping there are other witnesses to this sighting.  I've seen this once before over two years ago in the same city.",
      "link": "http://www.nuforc.org/webreports/126/S126959.html",
      "state": "MI",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b43",
      "summary": "Bright ball of light heading towards airport...then the light suddenly disappears as lowers in altitude.  Not a airplane.",
      "city": "grandrapids",
      "shape": "light",
      "date": "2016-04-22T00:00:00",
      "story": "bright ball of light heading towards airport...then the light suddenly dissapears as lowers in altitude.not a airplane saw1 a min later i saw a bright ball of light headed toward the GR airport.  i thought it was a plane but i didnt see the normal flashing lights that a plane has...it was moving at at least the same speed as an airplane.. but it was like a bright start, a fairly big one like the north star.  it moved downwards in direction &lt;sort of on an angle&gt; almost like it was gonna land in the area of theairport but then the light just went out..i moved to see if maybe  it was because it went behind a tree but no, the light just cut out and it was gone..moments later form a different direction i see an airplane going across the sky..this was nice b/c it gave me something to compare this bright star-like object to..1st. the airplane was much smaller and less bright 2nd. the airplane  had the usual flashing lights  3rd.  it seemed further away but i just think it was smaller with smaller lights and thats why it seemed further away or maybe it was..i dont know for sure..the bright object de! finitely seemed like it was at a lower altitude though.. very neat..my 2nd sighting ever!",
      "link": "http://www.nuforc.org/webreports/126/S126908.html",
      "state": "MI",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d1e",
      "summary": "Flashing light moving eractically in south east sky.  ((NUFORC Note:  Possibly a star??  PD))",
      "city": "grandrapids",
      "shape": "fireball",
      "date": "2016-12-05T00:00:00",
      "story": "flashing light moving eractically in south east sky Object seen in south east sky moving in an erratic motion up and down left and right in no order, flickering, almost looking like a fire from a Chinese lantern but the movement and duration is not consistent with one.  Slowly drifting south and gaining altitude as time goes on. ((NUFORC Note:  Possibly a star??  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131207.html",
      "state": "MI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fc0",
      "summary": "Orange ball of light -- possibly triangle shaped -- high in altitude, changes course, two witnesses.",
      "city": "grandrapids",
      "shape": "unknown",
      "date": "2016-10-27T00:00:00",
      "story": "Orange ball of light -- possibly triangle shaped -- high in altitude, changes course, two witnesses. At my residence, I noticed an orang-ish -- what appeared to be triangle shaped, but couldn't tell for certain because of how high it was -- ball of light track at very high altitude, it was above an airliner (looking up the flight history, I believe it was ETD150, 777 from Chicago to Abu Dhabi).  This organ-ish ball was tracking north to south at a moderate clip -- there was no con-trail observed.  When I went to grab a witness the anomalous object was overhead, still tracking north to south.  Several minutes later, with the witness in hand, we observed that the object was now way off to the east and was tracking to the southwest.   It made quite a course correction in a short amount of time!   Eventually the object got too far out of range for us to see.  Neither the witness, nor myself have seen anything like it before.  It could not have been a satellite because of the course change -- maybe it was a weather balloon.",
      "link": "http://www.nuforc.org/webreports/130/S130764.html",
      "state": "MI",
      "duration": "5 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3c61ed",
      "summary": "white light streaking across sky west to south/east,  No sound, Fast, viewable for almost a minute",
      "city": "grandrapids",
      "shape": "light",
      "date": "2016-09-22T00:00:00",
      "story": "white light streaking across sky west to south/east,  No sound, Fast, viewable for almost a minute Sunday night, 10pm, saw a white light streak across the sky from west to south/east was a bit brighter than the moon which was just coming up as a large creamy dark color, light made no noise and no debree behind it also within 5 minutes I and my wife also saw a helicopter lift up off the ground in the east sky and it hovered in the sky for a few minutes before it turned and went due east.",
      "link": "http://www.nuforc.org/webreports/130/S130095.html",
      "state": "MI",
      "duration": "35-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6261",
      "summary": "Metallic sphere sitting motionless with sudden disappearance.",
      "city": "grandrapids",
      "shape": "sphere",
      "date": "2016-09-30T00:00:00",
      "story": "Metallic sphere sitting motionless with sudden disappearance. Was driving north on a road running parallel to the Grand River and noticed a metallic looking sphere in the sky.  Seemed to reflect light from all around, only there were dark clouds and only partly sunny.  The sun was more to the west, but it still seemed to reflect light from the east, or possibly emitting it it’s self.  It did not move, and was also windy so I ruled out a balloon.   I was about to pull over to the side and get my phone out to try and get some video or picture, but when I drove under some trees and came back out into an open area (lost sight of it for about 1–2 seconds) it was gone.  There was nothing in the sky for as far as I could see.",
      "link": "http://www.nuforc.org/webreports/130/S130303.html",
      "state": "MI",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c65ac",
      "summary": "Yellow bright orbs in vertical line formation SE Grand Rapids  about 11:30 pm",
      "city": "grandrapids",
      "shape": "",
      "date": "2016-08-02T00:00:00",
      "story": "Yellow bright orbs in vertical line formation SE Grand Rapids about 11:30 pm. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128745.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c687d",
      "summary": "One white light.",
      "city": "grandrapids",
      "shape": "light",
      "date": "2017-04-07T00:00:00",
      "story": "I was standing on my back deck facing south.  When out out of the corner of my eye I noticed a very bright white light.  My first thought was, \"Wow, Venus is really bright tonight!\"  Then, I noticed it was in front of the clouds, moving with them at the same speed.  I watched this for about 10 seconds, then it just vanished.  No sound, no Noise.  And only the one bright light.  It was constant and steady, there were no other flashing, blinking lights with it.  Just the solitary one white light.  It was going from East to West.",
      "link": "http://www.nuforc.org/webreports/133/S133371.html",
      "state": "MI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6bde",
      "summary": "Very bright white light, appeared stationary, later moved farther away and changed to orange.  ((NUFORC Note:  Venus?  PD))",
      "city": "grandrapids",
      "shape": "light",
      "date": "2017-01-19T00:00:00",
      "story": "Very bright white light, appeared stationary, later moved farther away and changed to orange. Strange object in the night sky around 7:30 p.m. here in Grand Rapids on 1.14.17. It looked like a white light that was stationary just above the tree line of our condo on East Paris between Burton and Sparks, the object was very strange as it appeared much brighter and bigger than an airplane headlight. It did not approach and get bigger but rather just kind of hung in the sky. An hour later the object appeared that it had traveled farther away but was relatively in the same part of the sky, (South west direction).  The odd thing was that the object now appeared orange and not as bright. ((NUFORC Note:  We suspect a sighting of Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132204.html",
      "state": "MI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f27",
      "summary": "ISS type object traveling west to east apexing at 90 degrees. Brighter and faster than the ISS sightings I have seen before.",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2017-07-07T00:00:00",
      "story": "ISS type object traveling west to east apexing at 90 degrees.  Brighter and faster than the ISS sightings I have seen before. I was outside having a cigarette and watching the skies as I always do.  I noticed a fast moving craft in the western sky moving towards me and it went directly over my head, pretty much 90 degrees,toward the east.  It came and went in about 2 mins.  Although traveling what I thought was faster than the ISS, I initially thought it to be the ISS.   I then went inside to check ISS and other satellite fly-bys, and could not find any scheduled until a Chinese satellite at 23:00.  What I saw was very bright and very fast.  On first sight I called my wife out to see it.",
      "link": "http://www.nuforc.org/webreports/134/S134791.html",
      "state": "MI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f87",
      "summary": "Very strange slow motion mechanic noise that lasted about 30 seconds.",
      "city": "grandrapids",
      "shape": "unknown",
      "date": "2017-07-07T00:00:00",
      "story": "Very strange slow motion mechanic noise that lasted about 30 seconds. Did not see anything but heard a super creepy mechanic noise/echo for about 30 seconds, before it faded away.  We have the windows open, could hear the noise over the TV.  We turned off the TV and listened to it before it faded away.  Did NOT sound like a plane or helicopter.  Very slow motion mechanic sound.",
      "link": "http://www.nuforc.org/webreports/134/S134743.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7495",
      "summary": "color and shape changing, ball/cigar. spotted above st.mary's hospital for 45 minutes hovering still then floating around.",
      "city": "grandrapids",
      "shape": "changing",
      "date": "2017-05-06T00:00:00",
      "story": "color and shape changing, ball/cigar. spotted above st.mary's hospital for 45 minutes hovering still then floating around. Seen a color changing, light fading ball and then transformed into a cigar then back to a ball. it was hovering above the area of st.mary's hospital.  My girlfriend was the first to witness the ufo thinking it was a star.  Until we started seeing it move in every direction. There's no way a plane wouldve stayed in our sight that long.  There's no way a helicopter would have hovered that long or probably be allowed to over the hospital air space.  It was not a drone because it had very bright color changing lights.  It was not ball lightning because at most that lasts less than 30 seconds, and this went on for 45 minutes.  At some points, we thought we seen some lights fly off of it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133906.html",
      "state": "MI",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8187",
      "summary": "Egg-shaped light shot from clouds to ground.",
      "city": "grandrapids",
      "shape": "oval",
      "date": "2018-03-02T00:00:00",
      "story": "Egg shaped light shot from clouds to ground. I saw a large oval or egg shape that streaked from the clouds toward the ground.  It was very fast.  The oval was very bright white and had an orange halo around it.  I wouldn't have seen it if I hadn't been looking in that direction.  There was no sound. ((NUFORC Note:  Witness changed date to February 28, 2018.  Date is corrected above.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138989.html",
      "state": "MI",
      "duration": "Instant"
    },
    {
      "_id": "64d005f478aba2ec5a3c821e",
      "summary": "Saw 5 reddish/orange objects to the east. 2 danced with each other, too close to each other to be planes. ((anonymous report))",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2018-01-18T00:00:00",
      "story": "Saw 5 reddish/orange objects to the east.  2 danced with each other, too close to each other to be planes.   They all followed the same path and then disappeared one by one in the same place. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138417.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c87ee",
      "summary": "Large manta-ray shaped UFO frozen on a 45 degree angle with 7 large white pyramid patterned circles on the bottom of the aircraft",
      "city": "grandrapids",
      "shape": "other",
      "date": "2018-07-13T00:00:00",
      "story": "Large Manta-Ray shaped UFO frozen on a 45 degree angle with 7 large white pyramid patterned circles on the bottom of the aircraft It was around 2:00 AM- 2:30 AM on July 11, 2018 in Grand Rapids, we were driving home from a get together in the Rockford area, we got lost and took a common road home called 52nd Street and as we were driving in the countryside, I look to my right in the passenger seat and I see about 100 feet to 150 feet away from me a large Manta-Ray shaped object frozen in the air on a 45 degree slant, the front of the object was white colored and had a ring surrounding the aircraft that had a green light circling through the ring, I began to naturally freak out as we drive past this large aircraft.  As we continued driving, the bottom of the aircraft was exposed with these bright white lights formed in this symmetrical pyramid pattern with about 7 large lights, instantly I tried to debunk the situation using the laws of physics but the object appeared frozen in time over this grassy area, an by that time I knew that this object is way too technologically advanced to be developed by the government, it was like it was using a Anti-Gravity mechanism that allowed to sit perfectly frozen in mid air on this 45 degree slant,  I thought I was possibly hallucinating the whole situation but after calming down and rubbing my eyes and reopening them, the object was still in the same perfect 45 degree slant in midair, I wouldn’t be reporting this if I didn’t see this object so close, I’ve seen videos and documentaries about these sightings but there was never one photo or video showing a object this close to human activity.",
      "link": "http://www.nuforc.org/webreports/142/S142204.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c89c2",
      "summary": "Square Shaped Object seen in broad daylight.  ((NUFORC Note:  Witness provides no contact information.  PD))",
      "city": "grandrapids",
      "shape": "other",
      "date": "2019-09-06T00:00:00",
      "story": "Square Shaped Object seen in broad daylight Massive square shaped object views from stationary car on 28th street westbound near Beltline.  Perfect square shape, blue black an silver with square indentations throughout Descended slowly at a 45 degree angle and disappeared below tree line. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148453.html",
      "state": "MI",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a96",
      "summary": "Red Circular Object Seen over Grand Rapids.",
      "city": "grandrapids",
      "shape": "circle",
      "date": "2019-09-12T00:00:00",
      "story": "Red Circular Object Seen over Grand Rapids. I was walking my dog this morning (heading northbound on Fairview Avenue).  We stopped in front of Lookout Park in order for my dog to((walk)) when I happened to look up into the sky and notice a bright red circle come into view from the west, heading east. It was approximately pea-sized at arms length and was traveling slowly.  And as it neared the midway point of my view, a bright flash of white light occurred just above it.  (Strangely, the flash of light was slow as well.  It wasn't like turning on and off a light and took a good two seconds to finish.)  After the flash of light, the red circular object proceeded on its way to the east and disappeared out of view.",
      "link": "http://www.nuforc.org/webreports/148/S148698.html",
      "state": "MI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c941c",
      "summary": "I believe that I had an alien visitation while in the crib about 65 years ago.",
      "city": "grandrapids",
      "shape": "",
      "date": "",
      "story": "I believe that I had an alien visitation while in the crib about 65 years ago. My twin brother and I were in our cribs in the same bedroom.  I am guessing I was about 3 years old so possibly about 1955.  There was just a hint of light over the hill seen from the window, just enough to see 2 creatures come in through the window, which now makes no sense being the bedroom was on the second floor.  One of the creatures came to my crib, it was about head high to where I was lying.  The other creature went to the other crib but I did not see what was done to my brother if anything.  I do not know why I did not scream?  The creature stuck a needle into my hand near the thumb, but I felt nothing.  They left.  I woke up in the morning and immediately told my parents who said that I was dreaming. I knew nothing about aliens at that age and doubt there was anything on the TV in 1955. There was a red mark on my hand where the needle went in and it remained for about 18 years as a red like mole.  My hand was burned in an accident in my teens so th! e mark is gone, just the burn scar remains. Years later when i read reports on the small human like creatures it occurred to me what could have happened.  I am now almost 68 and still remember the incident vividly. I cannot remember my dreams from last night so am still convinced that something unexplained happened to me. I am not aware of any other incidents in my life like this.",
      "link": "http://www.nuforc.org/webreports/151/S151534.html",
      "state": "MI",
      "duration": "30 minutes"
    }
  ]
}