{
  "city": "henderson",
  "fetch_timestamp": "2025-07-12T14:35:20.059565",
  "record_count": 97,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4a12",
      "summary": "Driving down interstate 80 and in distance ahead saw what appeared at first as a crashing plane with blue red and white lights then it",
      "city": "henderson",
      "shape": "triangle",
      "date": "2019-07-25T00:00:00",
      "story": "Driving down interstate 80 and in distance ahead saw what appeared at first as a crashing plane with blue red and white lights then it started flipping in circles and moving in zig zags picking itself back up, came past our car and was behind us, came next to our car window and we saw it closely then the lights turned white and it went off quickly behind us",
      "link": "http://www.nuforc.org/webreports/147/S147705.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d20",
      "summary": "Pure white flashes as if it was pure energy flying in many different directions",
      "city": "henderson",
      "shape": "flash",
      "date": "2019-06-07T00:00:00",
      "story": "Pure white flashes as if it was pure energy flying in many different directions I was hiking with a buddy of mine, searching for these objects I’ve been seeing them for the passed year now.  So him and I went out to a dark side of the mountain where there was little light pollution.  We walked for maybe an hour in a half and we saw it by NAFB with these really bright flashes some went quick and some stayed for about thirty seconds we had lost it when it was above NAFB then it had re apesrd in front of us heading toward lake mead area.  Mind you these are all different objects some flash many different colors and some just sit there then disappear after a while, if you weren’t to pay attention to the sky you wouldn’t even realize how many you could see.",
      "link": "http://www.nuforc.org/webreports/146/S146645.html",
      "state": "NV",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e33",
      "summary": "They were all in a row and hovering over Henderson 1 had red lights flashing the other two had 1 red light and white lights. They staye",
      "city": "henderson",
      "shape": "rectangle",
      "date": "2019-05-09T00:00:00",
      "story": "They were all in a row and hovering over Henderson 1 had red lights flashing the other two had 1 red light and white lights.  They stayed in the same spot and now they are back in that spot tonight.",
      "link": "http://www.nuforc.org/webreports/145/S145912.html",
      "state": "NV",
      "duration": "3.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b52b2",
      "summary": "I have no doubt of what I saw.",
      "city": "henderson",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "I have no doubt of what I saw. It was around April, 2001 in Henderson, Nevada that I was standing in the parking lot of a commercial center.  Around 5:30 P.M., in daylight, I noticed in the sky over my right shoulder a craft hovering in the sky.  I was in the area of Pecos and Sunset Road facing east.  I looked at the craft, and it was in the distance, perhaps hovering somewhere between me and Hoover Dam at 2:30 O’Clock position.  I saw it for maybe 2 or 3 seconds and then the winds made a huge howling sound (like a whoosh)  and the craft moved at lightning speed and disappeared straight on to the horizon, first bearing right then left.  (At first I thought it was a Stealth from Nellis Airfore Base on exercise, but this craft was much larger than a Stealth, perhaps the size of maybe 100 feet wide and maybe 15 feet high.)  I dismissed it as something crazy as it was near the approach of McCarran Airport in Las Vegas, but I never forgot it, and no one will ever convince me that I had not seen an alien craft.  It wasn’t a saucer shape though… it was different….it was square, perhaps on a curved edge, as it is hazy in my recollection.  However,  it was definitely not a “round” or “oval” vehicle.  There was a certain squareness to it, perhaps with angular edges.  I remember lights too, from the interior.  Anyhow, saw your piece on CNN and decided to submit this.  It’s what I experienced.  What else can I say? ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63166.html",
      "state": "NV",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5422",
      "summary": "White, round light with white tail moving quickly, but sporadically.",
      "city": "henderson",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "White, round light with white tail moving quickly, but sporadically. Approximately 4:20 AM, I was in front of my house having a non-sleeping smoke.  A light caught my eye in the sky and it was much closer than a star.  More like an airplane traveling over the city at highest altitude.  Upon observing it, I noticed that this solid, white light was moving forward quickly, but in jerking motions forward, then one side to the other, then every now and then it would move backward, only to go forward again.  At times, it would stop completely, then move in tiny circular motions.  It was stationary for approximately 5 minutes, then moved forward and then backward.  My house faces due west and it was traveling from the west to the east.  As it came more overhead, at this time about a 90 degree angle, I began noticing a straight line extending from the white, round base that was also a solid white.  I called Nellis Air Force Base and they gave me your phone number.  I have left a message for you on the phone number that the Air Force Base gave me.  Before signing off, I just went out to check it again.  It is still in one place, but bouncing around in an almost jerky, circular pattern.  I can still see the line of white protruding from the circular base.",
      "link": "http://www.nuforc.org/webreports/062/S62923.html",
      "state": "NV",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3b55bd",
      "summary": "One lighted object that was tracked by aircraft at two different times, th aircraft altered their prior flight pattern.",
      "city": "henderson",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "One lighted object that was tracked by aircraft at two different times, th aircraft altered their prior flight pattern. On the morning of November 10,1999, I witnessed lighted object approximated to be north of my location. It was stationery about 40,000 feet as observed for several minutes. I observed one airliner jet manuveur in direct course with said object to a point that, from a point of my visibility, no more than 10 miles. The object disappeared before the airliner could get close enough. A second appearance occured after the airliner was out of my sight. It appeared to be in the same place. At this time, it was very odd that the airliner had altered it's course to intercept the object. On the second appearance, there where two Air Force Jets that were enroute( one from the east and one from the west).The object only remained stationary for about thirty seconds. The two jets came close to the object, but did not intercept it. Before the jets had reached the object, it(the light object)made a quick flash to the left and diappeared again. The two Air Force jets turned opposite of their own path. I remained outside for any other appearance for several minutes. After the jets were out of site, I returned inside my home.",
      "link": "http://www.nuforc.org/webreports/060/S60221.html",
      "state": "KY",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5757",
      "summary": "Three stationary saucer shaped objects over Sunrise Mountain, east side of Las Vegas, NV, August 2005.",
      "city": "henderson",
      "shape": "disk",
      "date": "2008-03-04T00:00:00",
      "story": "Three stationary saucer shaped objects over Sunrise Mountain, east side of Las Vegas, NV, August 2005. Towards the end of August, 2005, I went out in my backyard to look at the thunder clouds about 5PM.  My backyard was high, faced east and had an unobstructed 180 degree view being forty feet higher than the rooftops to the east.  Thunder storms were developing and cumulous clouds were building.  As I enjoyed the view, I noticed a dark spot in the sky over the south end of \"Sunrise\" Mountain to the NE of Henderson.  Facing east, the object appeared to be at 11 o’clock.  It was against blue sky in a large break between the clouds and it was stationary.  It was roughly above the flight path along Charleston Street that helicopters use for McCarran Airport.  They travel a a couple thousand feet.  This was much higher than that.  To the naked eye it appeared to be large and round.  My first thought was that it might be a helium balloon, but logic told me it was in the wrong place for that, the wrong time of day, and the wrong sort of weather.  The south end of Sunrise Mountain is about five or six miles from my house.  I estimated the altitude of the thing to about 10,000 feet more or less.  I stepped into the house and retrieved binoculars.  The object had not moved.  When I focused on the object I saw it was actually three round shapes fairly close together.  A large round plate was partially hiding another slightly smaller plate behind it at about one o’clock to the first, and a third round plate, appearing smaller yet, at about 2 o’clock to the biggest one.  The relative sizes gave the impression of three objects each at a slightly increasing distances and slightly different altitudes.  They appeared to be dull metallic silver. There were no lights on the objects.  I watched for about a minute, maybe less, and then, through the binoculars I saw all three objects “keel over” in unison by about 90 degrees at which point they appeared thin and flat.  I called my wife and son and, with a second pair of binoculars, tried to help them spot the objects.  However, they wear glasses, are not used to spotting small objects, etc and they never saw them.  In between trying to help my family to see them too, I watched for another couple of minutes.  Finally, the clouds intervened and hid whatever they were from further view.  My house was about as half mile South of the flight path into McCarran Airport. Commercial aircraft continued to land during this time, basically following Sunset Rd into the airport with landing lights on below about three thousand feet.  They and are a common sight.  This was not a helicopter or an airplane or a harrier jump jet, etc.  All three objects were clearly visible and I have no explanation for what they could have been. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61327.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5891",
      "summary": "Roaring and erratic-moving lights over Henderson, KY",
      "city": "henderson",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Roaring and erratic-moving lights over Henderson, KY Over the period of about 30-40 minutes, a jet-like roaring sound was witnessed by several people including the dispatch officer on duty at our 911 number.  The sound was similar to a jet engine, but pervasive, louder, and seemed to almost vibrate the house.  (It was loud enough to be heard/felt inside a well-insulated house with TV on, for example).  The roaring sound(s) persisted over most of the 30-40 minute period, but may have been multiple (up to six?) discrete events.  On about the fourth event, I personally witnessed a light moving from directly above me to the SE.  the roaring sound came directly from the direction of the light.  For the first few seconds the light appeared to be a fast-moving aircraft (I thought it was a fighter).  The problem is, it was so high that I should never have been able to hear the sound of its engines.  If a commercial or military jet had been low enough to hear, I should have been able to distinguish separate lights (wing lights, etc.)  I couldn't.  This object was just a white-to-maybe-orangish point of light accompanied by a loud roaring sound.  Before it passed out of view over my house, it veered dramatically left, then right, then left again.  I don't want to suggest it was spiraling, but that is what I thought at the time.  It maneuvered much faster than any commercial jet vehicle could have moved (in my field of view at the percieved altitude).  There may have been more than one UFO, as the roaring continued over about 30 minutes, either rising and falling, or multiple events in sequence.  I called the 911 dispatecher and reported the event at approximately 10:15 PM and she confirmed the sound, but at this time, neither of us could find a light in the direction the sound was coing from.  The night sky was absolutely clear.  I first became aware of the roaring when my girlfriend's son called me from across town to report both the sound and that he had drawn a picture of the moon because it had a funny shadow.  (That may not be related to what I witnessed.  I just note it, in case anyone else corroborates it.)",
      "link": "http://www.nuforc.org/webreports/051/S51809.html",
      "state": "KY",
      "duration": "30-40 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a6a",
      "summary": "Red light over Lake Mead viewed from Henderson, Nevada.",
      "city": "henderson",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Red light over Lake Mead viewed from Henderson, Nevada. My father in-law and I were outside in the backyard watching several planes coming in from the east to land at McCarran Int. Airport.   As we follow the airplanes into the distance counting how many coming in, there was a red light standing still at the end of the traffic.  It seemed to be like the next airplane to come in but too far to be in the flight plan to land.  My father in-law said \"Hey, that's not a plane.\" I said \"That looks like it's over the lake or maybe past the lake.\" (Lake Mead)  We watched it for about a minute and then saw it start to travel straight up.  As it started to move, it seemed to slightly shimmy side to side while moving upwards in altitude.  It was hard to judge distance of travel but it lasted about 20 to 25 second before the light turned to a 45 degree angle and continue to ascend at a slower rate.   At the 45 degree angle, the light gradually faded as if it was ascending and traveling away from us. This lasted about 30 seconds before completely fading away.  Unfortunately, I did not have a camera and besides my camera would not have the resolution to pick up the light clearly.  There is no doubt, on my life, that this light was not something an ordinary aircraft could do. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54845.html",
      "state": "NV",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b5b",
      "summary": "strange orange lights over Henderson AR",
      "city": "henderson",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "strange orange lights over Henderson AR AT 5:30am I saw an out of place orange light to the east of me, traveling north. It didn't blink and it was unusualy bright, it also was traveling lower then most aircraft. Then that night at abought 9:30pm I saw It again this time directly over head traveling south. It was extremely bright orange and a solid light.It was flying at the normal speed of an aircraft but at abought half the height,and made no sound at all, it also apeared to be shakeing or wolbing left to right very rapidly. When I saw it this time I called me wife out to see it, she said \"what in the world is that\". After abought 60 seconds it changed from orange to red and faded out.I have never seen anything I couldn't explain. I'm often out doors because I smoke and my wife and son do not. I see aircraft all the time,and this was strange. ((NUFORC Note:  Source of report indicates that date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58886.html",
      "state": "AR",
      "duration": "35 SEC."
    },
    {
      "_id": "64d005f478aba2ec5a3b5bb7",
      "summary": "it was 9 15 in the morning snd i looked outside the window of my high school and 2 other students saw it. and then it quickly dissipear",
      "city": "henderson",
      "shape": "diamond",
      "date": "2007-10-08T00:00:00",
      "story": "it was 9 15 in the morning snd i looked outside the window of my high school and 2 other students saw it. and then it quickly dissipeard",
      "link": "http://www.nuforc.org/webreports/058/S58305.html",
      "state": "KY",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d7e",
      "summary": "UFOs over henderson, nv",
      "city": "henderson",
      "shape": "changing",
      "date": "2007-11-28T00:00:00",
      "story": "UFOs over henderson, nv On 8/13/07, I was walking out of my in-laws house in Henderson, NV to go to Long's Drug Store for a bottle of wine. Facing south, I look to the sky(as I always do) to look at the airplanes coming in for landing. I saw a light that looked like it could have been part of the flight path for LAS. The light was traveling from south to north-northeast changing shapes. Changing shapes like from diamond to oval to circle, at no pattern. At this point, I was transfixed. It took about 45 sec. to respond as I was not sure what I was looking at. Then two other lights, also flashing different colors and shapes, were lined up in the same area as I saw the first. All three were moving at the same speed and sames direction but at some distance apart. That was when I walked backwards to open the front door and ask someone to come out. My mother-in-law came out to see all three lights in the sky. It seemed to me that all three were going north-northeast on gaining altitude. We followed them for about 1:30 min. before it they were out of sight. The distance was about 30 miles in 2 minutes. That's about 900 mph. Unless it was military doing experiments or more than likely, UFOs.",
      "link": "http://www.nuforc.org/webreports/059/S59245.html",
      "state": "NV",
      "duration": "1.5"
    },
    {
      "_id": "64d005f478aba2ec5a3b601b",
      "summary": "I was leaving my job at the hospital in 1981. I had a newborn son and my husband was with him at my home in Henderson NC.I was driving",
      "city": "henderson",
      "shape": "rectangle",
      "date": "2008-01-21T00:00:00",
      "story": "I was leaving my job at the hospital in 1981. I had a newborn son and my husband was with him at my home in Henderson NC.I was driving up Creedmore Rd or Highway, and I put my brakes on at the top of the hill because I saw an object that I thought was a soapbox, like a soapbox derby. The moon was full that night, and I wondered why there were kids out on the street at 11pm. After I slowed down, I looked at this object, and it started to take off at an incredible speed down the hill. It was going at a fast speed, but it always maintained a low altitude, almost flying on the ground. I started to accelerate my car speed, until I looked at my spedometer, and realized that I was going 85 to 90 miles and hour trying to catch up with this object. The object left the highway, and I pulled over on the road and I was very shaken. If I were to drive that road again, I probably would remember the white house on the road that seemed to be a farm. The object was parked in front of that house. I got to my home that night, and told my  husband what I had seen that night. He laughed at me,and even when I drew him a picture, he didn't believe me. I am 55 years old now, and soon will be 56. If you were to give me sodium amytal, I would garantee you that I could create the same image that was given to me those many years ago. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61036.html",
      "state": "NC",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b636d",
      "summary": "(2) extremely large, dark craft, in formation operating  at a very slow speed in total silence, overhead.",
      "city": "henderson",
      "shape": "formation",
      "date": "2008-02-14T00:00:00",
      "story": "(2) extremely large, dark craft, in formation operating  at a very slow speed in total silence, overhead. at approximately 2100 hours, I was soaking in my backyard spa, looking up directly overhead, moving from east to west, I viewed what appeared to be two craft, in formation, similar to what aircraft fly during refueling operations.  The craft displayed no visible lights, but were lit by background light from the city of Las Vegas.  The speed at which they operated seemed extremely slow by comparison to \"normal\" aircraft that I am familiar with, being an airline pilot. And there was complete silence.  Thier size was larger than any aircraft I had ever seen, appeared to be flying wings or triangles.  I would judge the altitude to be approximately seven to ten thousand feet.  I was so struck by the sight of this experience, I remained motionless and made no attempt to obtain binoculars or cameras.  Again, thier size was incredible as was thier total silence and lack of speed as they \"flew\" overhead.  I first thought that it was some refueling operation, but they were within just several miles of McCarran airport, in the airports controlled airspace.  The craft appeared to be black in color, and reflected just enough light that I could make out thier outlines.  The two craft continued in the formation described, to the west and then blended into the night.  No lights were observed, no sound what so ever, however, not trying to be dramatic, I \"felt\" thier presence, that is the reason I loked up.  At the time I was employed by Continental Airlines, and elected not to mention this experience to  anyone.  I am now retired, and I saw a piece on cable that referred to the \"Phoenix\" lights. I thought I would share this with others.",
      "link": "http://www.nuforc.org/webreports/061/S61096.html",
      "state": "NV",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b67a1",
      "summary": "((HOAX??))  Fast moving UFO goes in the direction of Area 51.",
      "city": "henderson",
      "shape": "cone",
      "date": "2008-02-14T00:00:00",
      "story": "Fast moving UFO goes in the direction of Area 51. I had just gotten home from work when I saw a UFO about 40+ miles away.  Then all of a sudden it came faster then i've ever seen and flew right over me back towards the direction of Area 51.  I didn't know what to do.  It was just so cool seeing a UFO. ((NUFORC Note:  Hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61139.html",
      "state": "NV",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6810",
      "summary": "shiny spherical object accompanies jet leaving McCarran airport.",
      "city": "henderson",
      "shape": "sphere",
      "date": "2007-02-01T00:00:00",
      "story": "shiny spherical object accompanies jet leaving McCarran airport. I have been reluctant to report this, because my wife and I recently reported a sighting at our home in Arizona. (previous report, 12/04/06, apache junction, az).   I am 61, never saw anything like this before, now 2 in 3 weeks.  Anyway, my wife and I were at our son's house in Henderson with some other family members for Christmas, and about 8 am I stepped out in the back yard to smoke.  I was watching the planes going in and out of McCarran.   The east bound jets mostly went directly overhead.  I saw one of these jets, headed east, that was accompanied by another object, which was directly under the jet, travelling at exactly the same speed and direction.   It might have been about 100 feet under the jet.  It was very shiny, and did not have any wings.  It was simply a sphere.  It looked like it kept a constant distance from the jet.  I had a very clear view of the object and the plane, and comparing its size to that of the jet, I would guess it was maybe 20 ft in diameter.   My wife and 2 other people came outside, and they all 3 saw the same thing.",
      "link": "http://www.nuforc.org/webreports/054/S54286.html",
      "state": "NV",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b71f6",
      "summary": "Very fast half moon craft.",
      "city": "henderson",
      "shape": "other",
      "date": "2007-10-08T00:00:00",
      "story": "Very fast half moon craft. A rather large, almost half moon shape UFO came into sight from the east, past my entire horizon, and went out of view to the west in approximately 10 seconds.  There were no lights and no sound, the only way it was visible was from the city lights it reflected as it passed, and as it blocked out the stars.  I would guess the object was about 2500-5000 feet up, moved in a straight line, and as I have a full view of the mountains to the south of Las Vegas, and it passed so quickly, I would guess it had to have been going about 500-1000 miles per hour to pass east to west so quickly.      I am a corporate trainer, 29 male, homeowner, and this is the first UFO I have ever seen.",
      "link": "http://www.nuforc.org/webreports/058/S58939.html",
      "state": "NV",
      "duration": "10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b753b",
      "summary": "Recently retired airline pilot from Northwest Airlines. Saw the craft from my shower window and noticed it was not moving very fast. It",
      "city": "henderson",
      "shape": "cigar",
      "date": "2007-06-12T00:00:00",
      "story": "Recently retired airline pilot from Northwest Airlines. Saw the craft from my shower window and noticed it was not moving very fast. It was drifting westerly at no more than 20 knots. It appeared to be a cylinder but I thought it changed to have swept wings similar to a DC-9 for 5 or 10 seconds. However, it never gained any speed other than the 20 knots I mentioned. It was in the neighborhood of about 20 to 25,000 feet as it would be obscured by the cirrus deck directly above it for as much as 30 seconds at a time.  I watched a eastbound airliner go nearly over the top of it (separated by the cirrus deck) so I doubt that crew would see it. The east bound flight (I used to fly that airway a lot) should have been at FL 330 to 370 and moving at a normal speed and cutting a contrail behind it.  My wife verified what I was seeing though her eyes are not as good as mine.  I had her retrieve our digital camera, but the craft disappeared into the cirrus and never reappeared where I could photograph it. I have seen a number of craft over the years but have not previously reported them. This was definitely a UFO and no aircraft, balloon. To skeptics I would ask why it would drift against the prevailing wind if it was a balloon?",
      "link": "http://www.nuforc.org/webreports/056/S56791.html",
      "state": "NV",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b74e7",
      "summary": "I was sitting in my back yard talking to a friend on the phone.  The night was dark, the moon was just over the west mountains and was",
      "city": "henderson",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "I was sitting in my back yard talking to a friend on the phone.  The night was dark, the moon was just over the west mountains and was only giving off a little light because it was just a sliver.  I looked up and there was a black wing directly over head moving at what seemed to be maybe 50-60 miles per hour.  I could see the whole shape of the wing as it passed over.  It was headed west.  It seemed small, maybe the size of a small airplane and it seemed low maybe 200 or 300 feet above the homes.  My first impression was it was a hang glider.  The wing had no lights and made no sound.  I was only able to watch it for 3 or 4 seconds; as it moved away from me I saw the back of the craft and then it simply blended into the night.",
      "link": "http://www.nuforc.org/webreports/052/S52790.html",
      "state": "NV",
      "duration": "4 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d8b",
      "summary": "bright white light in S.W. sky over Henderson, Nv. oval in shape",
      "city": "henderson",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "bright white light in S.W. sky over Henderson, Nv. oval in shape Bright white light,in south west sky- then grew dim, then bright again, then gone.  Maybe meteor, but way to big.  We are in the flight pattern, but this was to far south in the sky and shortly after a plan flew over the light was diagnol from the path of the plane. No sound. The shape of the light was more oval than round.",
      "link": "http://www.nuforc.org/webreports/072/S72961.html",
      "state": "NV",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ef0",
      "summary": "flying object in the sky",
      "city": "henderson",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "flying object in the sky circular flashing object hovering in the same spot outside through my window for 10 minutes and i went outside to film it it vanished up into the sky in henderson",
      "link": "http://www.nuforc.org/webreports/073/S73032.html",
      "state": "NV",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9478",
      "summary": "Three bright lights above Seven Hills that are non moving.",
      "city": "henderson",
      "shape": "disk",
      "date": "2009-08-27T00:00:00",
      "story": "Three bright lights above Seven Hills that are non moving. When I went outside and looked up in the sky in a southern direction there was one really bright light and when I took out my telescope I carefully looked at it. It was not moving just hovering there. So when I went to film it with my camera in the video on the screen there was three big bright lights that were not moving. But without the camera there’s only one light. I photographed the sighting with a video camera.",
      "link": "http://www.nuforc.org/webreports/071/S71776.html",
      "state": "NV",
      "duration": "still continuing"
    },
    {
      "_id": "64d005f478aba2ec5a3b951e",
      "summary": "Object with pulsating red and white lights appears in the middle of the sky and travels to the horizon at extremely high velocity.",
      "city": "henderson",
      "shape": "unknown",
      "date": "2008-08-12T00:00:00",
      "story": "Object with pulsating red and white lights appears in the middle of the sky and travels to the horizon at extremely high velocity. I submitted this report to MUFON almost immediately after the event took place. I was not aware of the existence of NUFORC until just now, otherwise I would have submitted it here as well. I have edited it in a few areas where I might not have been as clear as I would have liked (I was understandably in a kind of fervor at the time), but my original report is still on MUFON.com if you’d like to view that as well. I've spent a lot of time observing satellites, stars, planets, meteors and aircraft, and nothing has baffled me like this. I was outside my house smoking a cigarette, and I decided to move a lawn chair out into the yard so I could look at the sky. It was the perfect summer night. All I could hear were crickets, and the skies were clear. I was looking about 40 degrees up to the east, and that's when I saw it appear. It was such a shock to me that I can't tell if it rapidly decelerated to a speed at which it was visible (Who knows?) or if it just \"turned on its lights\". I literally jumped in my seat!  We've all seen meteors, they reach a point at which the friction and pressure of the atmosphere builds up heat which produces incandescent light that we see for usually no more than a fraction of a second. If this was a meteor, then I'm Santa Claus. It was already moving when it appeared (like a meteor), but its brightness didn't fade (the lights did pulsate, however), there was no rapid descent, and I was able to follow it to the horizon. Fireballs have been visible over several states before they either impact the ground (or someone's unfortunate car), but this object wasn't as bright as Jupiter, it left no trail, and nothing was seen breaking off of it. I could be one of the lucky few who have witnessed an earth-grazing fireball, but I doubt it. Here's why: the object had red and white lights, but not lights as you'd expect to see on an aircraft. They weren't points of light; rather there was a center that was brighter than the periphery around it. That's the best I can explain it. The center part wasn't even that bright, but the smooth glow of the light around it really set it apart from anything I'd ever seen. This object definitely had some size to it. Let's assume this was something entering the atmosphere. From my point of view, the apparent size of the object was no smaller than a commercial airliner at cruising altitude, possibly larger. I'm no expert on which altitudes objects start to glow at as they enter the atmosphere, but it’s definitely more than 40,000 feet, making this thing at least as big as an aircraft, if indeed it is something entering the atmosphere. There are lots of variables involved, but that seems logical to me. As meteors have not developed stealth technology since they are essentially rocks, I would have to imagine that this object would appear on radar if it was nothing more than a very large meteor. The object was moving northward, possibly to the NNW. It made no sound whatsoever. If this was an aircraft, it would have to AT LEAST be going mach 1 at roughly 10,000 feet. That's as slow and as low as this thing could have been going. The higher up this thing actually was, the faster it was actually going. Common sense, right? I should have been able to hear something if this was an aircraft. B-2's and F-117's are pretty quiet, but they're also subsonic. All I know for sure is that I saw something extremely unusual travel from 40 degrees above the horizon in the eastern sky to the northern horizon in about five seconds or less. The time at which the event took place eliminates a satellite in low orbit being illuminated by the sun, so either this thing made its own light or was glowing from the heat of entering the atmosphere, possibly both.  Please call or email me if you have any questions, or if I'm flat-out wrong about something. Thank you for looking into it for me.",
      "link": "http://www.nuforc.org/webreports/064/S64783.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9597",
      "summary": "Large Red Balloon over Las Vegas",
      "city": "henderson",
      "shape": "other",
      "date": "2009-08-05T00:00:00",
      "story": "Large Red Balloon over Las Vegas Large Red Ballon with two smaller White Balloons attached on each side. Moved from north east toward south west. Crossed under the morning moon on its way southwest. Must have gone higher and changed direction back toward the North East. This was a large object and it got smaller as it went higher. It was larger than some of the planes in the sky at about the same altitude.",
      "link": "http://www.nuforc.org/webreports/071/S71086.html",
      "state": "NV",
      "duration": "20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b99f0",
      "summary": "small stealth bomber shaped object flew overhead silently",
      "city": "henderson",
      "shape": "chevron",
      "date": "2010-02-14T00:00:00",
      "story": "small stealth bomber shaped object flew overhead silently I was in the hot tub at my apartment complex and I was looking west up at the stars.  I saw what I thought was a toy stealth bomber appearing from behind some of the buildings in my complex.  I watched it because it was silent I didn’t have the jets on in the hot tub so I could hear a lot.  The craft had three circles on it that were a lighter color, they weren’t lit up or anything.  The craft itself was pitch black that’s how I could tell it apart from the sky which was a dark purple.  It was extremely low and small. It just barely cleared some palm trees in my complex, maybe 40 feet tall.  It didn’t look anything like a bird it looked more like a toy plane, and the only bird I have seen this big was a seagull.  And It wasn’t a bat because it looked like it was gliding.",
      "link": "http://www.nuforc.org/webreports/074/S74106.html",
      "state": "NV",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a68",
      "summary": "Bright blob over henderson NV",
      "city": "henderson",
      "shape": "other",
      "date": "2008-10-31T00:00:00",
      "story": "Bright blob over henderson NV My friend and I went for a short walk during a break at work. To the east we noticed a bright blob of light that was rapidly changing colors. Brighter then any airplane light I have seen. We continued to watch it for approx a minute or so, at one point the light went dim and had very rapidly blinking lights of all colors, it then got bright again and then simply vanished. Also during all this there were planes in the area lining up for McCarran airport, this was nowhere near the line. I also was able to get a short video of the object. It was not great quality.",
      "link": "http://www.nuforc.org/webreports/066/S66089.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba638",
      "summary": "Very tall and slim pyramid shape on it's side. The point was heading south. Black. silent",
      "city": "henderson",
      "shape": "triangle",
      "date": "2009-06-09T00:00:00",
      "story": "Very tall and slim pyramid shape on it's side. The point was heading south. Black. silent My family and I were out back swimming, we had the grill going, when we all saw some big black (silent) thing. The back was a triangle ,that tapered off to a point in the front. It seemed to be oscilating. Not even a second later we saw two army jets following this thing in formation. Going the same speed, and making alot of noise that the first didn't. Usually these sightings are considered to be either military or civilian aircraft. The best way that I can describe it is as a 150 yd long, silent, black, 3 sided, traffic cone. Without the ends and very stiff and sharp, oscilating.",
      "link": "http://www.nuforc.org/webreports/070/S70403.html",
      "state": "NV",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba674",
      "summary": "Photos I took of UFO changing shapes and making very abrupt movements",
      "city": "henderson",
      "shape": "changing",
      "date": "2008-08-12T00:00:00",
      "story": "Photos I took of UFO changing shapes and making very abrupt movements My husband was smoking outside and my daughter was ouside sitting next to him when they saw a bright light not twinkling and rapidly moving and changing shapes. My daughter immediately when in the house to get me to witness what they saw so I went out and looked up at the sky and at first I thought it was a plane but when it rapdly moved I quickly went inside to get my camera and zoom in until I couldn't  zoom any further and kept shooting the camera every 5 seconds until it quickly disappeared. Upon uploading the pictures to the computer and as I viewed each picture there was a dramatic change in some and I also was able to catch a picture with a plane going by when it quickly moved as the plane flew by. The camera was in one place and not moved as I took each shot. Please",
      "link": "http://www.nuforc.org/webreports/064/S64985.html",
      "state": "NV",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba706",
      "summary": "Rapid shape changing bright white light vanishing.",
      "city": "henderson",
      "shape": "changing",
      "date": "2008-08-12T00:00:00",
      "story": "Rapid shape changing bright white light vanishing. I went outside to smoke a cigarette as I was smoking looking up into the sky I noticed this real bright white object. Staring at it because it was so bright white it amazed me because it elongated itself. So I then I opened the door and stuck my head calling for my daughters to come and see the UFO. My daughter was just as amazed as I was and as we were watching, this big bright light went behind the house and just disappeared. My daughter said that it was a shooting star but as at the angle it was coming down bright white as it was, it would have hit the ground exploding but there was no crash no big booming sound, it just vanished. After that my daughter called for her mom and sister and that is where my wife noticed if & brought out her tri-pod and camera. This opjected moved from side to side very very fast and changing shapes.",
      "link": "http://www.nuforc.org/webreports/065/S65007.html",
      "state": "NV",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bab46",
      "summary": "Bright Green Fireball in night sky travelling west-east over Henderson NV  Food for Less parking lot 9-24-10",
      "city": "henderson",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "Bright Green Fireball in night sky travelling west-east over Henderson NV  Food for Less parking lot 9-24-10 I was exiting a food store at Warm Springs and Sunset Rd. on the south-west corner.  I looked up because something in the periphery of my vision appeared.  I saw an intense green fireball traveling west to east at a very high rate of speed.  I could not guess the altitude; it was about the size of my small fingernail.  It appeared like it came over some houses to the west and then into the vicinity of the parking lot, where it blinked out, just before it disappeared a bright orange spark came shooting off of it.  There appeared to be a hazy orange aura surrounding the fireball, which was in the shape of a square more than a ball. There was a small trail of the green material following it that disappeared when the object blinked out. There was no sound, no smoke given off, no evidence after it disappeared.  There were no aircraft in the area at all.  I could not guess at the speed, it travelled over the length of the parking lot in less than half a second.  It did not appear to change direction.",
      "link": "http://www.nuforc.org/webreports/077/S77978.html",
      "state": "NV",
      "duration": ".5 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0e5",
      "summary": "Blue light screaming across the Nevada skyline",
      "city": "henderson",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "Blue light screaming across the Nevada skyline I was pulling out of a fast food line up when my girlfriend and I looked up out of my windshield and saw a BRIGHT Blue object flying very fast across the skyline.  The Blue light gradually sped up and then disappeared.  Compared to surrounding aircraft (approx.400pmh) I can guess that it was around 200 times as fast as the aircrafts.  The craziest part is I have been searching for other posts regarding this sighting and I found a post on this site in Florida today/tonight that is the exact same description of what we saw. I think its very crazy that the same sighting was also seen in Florida. This also proves that it was either fast enough to travel across the country or seen 2 separate times to help prove my claim.  The crazy part for me and my GF is that as humans we have instinct and during this event my stomach dropped and I was really uncomfortable.  I love the outdoors, love looking at starts etc...and this was different, this was something I cannot explain! . INSANE!!!",
      "link": "http://www.nuforc.org/webreports/079/S79184.html",
      "state": "NV",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3ef",
      "summary": "Jet-black, oval, fast, shiny, made sharp turns, Over Mccarran Airport/ Henderson.",
      "city": "henderson",
      "shape": "oval",
      "date": "2011-04-03T00:00:00",
      "story": "Jet-black, oval, fast, shiny, made sharp turns, Over Mccarran Airport/ Henderson. It was a black oval-shaped aircraft.  Nothing like I ever have seen before.  I first saw it while I was leaving Mccarran Airport; the aircraft was directly south of the airport, I think it might have been in the restricted airspace area.  At first, it was flying normally, except it wasn't in the shape of any aircraft I had ever seen. But about 15 seconds after that, it made a sharp 165 degree turn, speed up, and dissappeard into the south over Henderson and Black Mountain.  At my view, it was very shiny and jet-black.  Also, it turned, from my view, from the size of a penny to the size of a pen dot.  This was while it was speeding up and dissappeared.",
      "link": "http://www.nuforc.org/webreports/080/S80744.html",
      "state": "NV",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf96",
      "summary": "White object with blue aurora around it located near Henderson Nevada Airport",
      "city": "henderson",
      "shape": "sphere",
      "date": "2012-01-12T00:00:00",
      "story": "White object with blue aurora around it located near Henderson Nevada Airport A white elongated Ball with blue outlines located just above Henderson Nevada Airport, left at incredible speed moving west towards california, height was maybe 5000 to 8000 ft and the size of your thumbnail when hand is extended. When I contacted the local newspaper at 1:00 a.m. just after the event as stated above, I received an email back 37 minutes later trying to explain this by sending me an article but the acticle was dated 3 months ago and the acticle stated the object was moving west to east and the e-mail was from myself but had the newspaper advertisements as such. The object I saw moved east to west, are the newspapers also are imbeded in the cover up or are they lazy and dont care?",
      "link": "http://www.nuforc.org/webreports/085/S85907.html",
      "state": "NV",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0fb",
      "summary": "Fireball with a long tail",
      "city": "henderson",
      "shape": "fireball",
      "date": "2011-10-10T00:00:00",
      "story": "Fireball with a long tail I SAW A BRIGHT OBJECT IN THE SKY WEDNESDAY NIGHT, SEPTEMBER 14, 2011. TO ME, IT LOOKED LIKE A METEOR FALLING TO EARTH. HAD I BEEN ATOP A MOUNTAIN, I PROBABLY COULD HAVE SEEN IT FOR A MUCH LONGER PERIOD BUT, SINCE I WAS ONLY SITTING IN MY GARAGE, I SAW IT FOR ABOUT 5 SECONDS ONLY.",
      "link": "http://www.nuforc.org/webreports/083/S83951.html",
      "state": "NV",
      "duration": "5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc112",
      "summary": "Saw the light in Las Vegas before it turned green and yellow",
      "city": "henderson",
      "shape": "unknown",
      "date": "2011-10-10T00:00:00",
      "story": "Saw the light in Las Vegas before it turned green and yellow On Wednesday evening September 14, 2011 at approximately 7:45 P.M. local time I was driving Southbound on Executive Airport Rd in Henderson, Nevada.  I was driving parallel to and about 1 mile West of the runway at Henderson Airport. Since I am a pilot I always tend to scan the sky for aircraft.  I observed what appeared to be a small aircraft landing light moving from West to East and descending at about a 10 degree angle.  This made perfect sense since it was consistent with a small aircraft on a left base to Runway 35.   At this time it was only a small bright white light.  I then noticed that it was traveling at a greater speed than a small aircraft normally would in the traffic pattern.  My thought was that it was a hotshot pilot in a high performance aircraft. Right after I had that thought the white light grew to about 5 times it’s original size and turned a beautiful shade of green and yellow with a long tail of light trailing behind it. It was still descending at a 10 degree angle.  It then disappeared behind some foothills that are located about 5 miles South of the airport.  It was then apparent to me that I was a much greater distance from the light than I had originally thought.",
      "link": "http://www.nuforc.org/webreports/083/S83957.html",
      "state": "NV",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc393",
      "summary": "I went out back to smoke a cigarette an noticed three lights the size of stars moving in sync from right above me traveling from south",
      "city": "henderson",
      "shape": "triangle",
      "date": "2012-01-12T00:00:00",
      "story": "I went out back to smoke a cigarette an noticed three lights the size of stars moving in sync from right above me traveling from south to north.  It covered so much space in such short time with no sonic boom or trail so I know it was not a shooting star or airplane.",
      "link": "http://www.nuforc.org/webreports/086/S86265.html",
      "state": "NV",
      "duration": "3 or 4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7b6",
      "summary": "UFO Report:  Date: October 11th, 2011 Location: Las Vegas, NV (near Henderson, NV) Time: 8:40 A.M.",
      "city": "henderson",
      "shape": "other",
      "date": "2011-10-19T00:00:00",
      "story": "UFO Report:   Date: October 11th, 2011  Location:  Las Vegas, NV (near Henderson, NV)  Time: 8:40 A.M. Near Las Vegas Nevada, I was outside on my patio talking on my cell phone.  As I was on my patio I witnessed what seemed to be a fairly large object at high altitude hovering for more than 3 minutes.   As I am a pilot, I do not take this lightly.  My best guess altitude would be 50,000’ then directly up to an unknown altitude out of sight.   The object appeared to be two small spheres or discs that were connected by a straight bridge.  I am convinced that this was not a weather balloon because it was too large, and not of the shape.  I am also convinced that this was not a satellite as there was no horizontal movement for the period, until the object moved out of sight.  I am writing this report now certain that ufo’s do exist.   The quick movement of the object was by no means made of current technology that we have at hand.",
      "link": "http://www.nuforc.org/webreports/084/S84470.html",
      "state": "NV",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb31",
      "summary": "SLOW MOVOING ORANGE REFLECTING TYPE LIGHT FLYING NORTH EAST",
      "city": "henderson",
      "shape": "light",
      "date": "2011-07-17T00:00:00",
      "story": "SLOW MOVOING ORANGE REFLECTING TYPE LIGHT FLYING NORTH EAST SLOW MOVING ORANGE RELFECTING LIGHT FLYING NORTH EAST.   HAD AN ALMOST FLOWING FIREY APPEARANCE, NO NOISE.  MOVED SLOWLY ENOUGH WE WATCHED FOR SEVERAL MINUTES",
      "link": "http://www.nuforc.org/webreports/082/S82416.html",
      "state": "KY",
      "duration": "2 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbaf",
      "summary": "Meteor?",
      "city": "henderson",
      "shape": "fireball",
      "date": "2011-07-04T00:00:00",
      "story": "Meteor? walked to jacuzzi at my apt around 3:50 am...  just as soon as I look up at the stars a really cool comet looking thing went through the sky… looked as close as a plane… anyone else see this in Henderson? ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81959.html",
      "state": "NV",
      "duration": "1.5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3beac0",
      "summary": "Red and White lights over Henderson, NV...very fast and quickly changing directions.",
      "city": "henderson",
      "shape": "triangle",
      "date": "2012-02-03T00:00:00",
      "story": "Red and White lights over Henderson, NV...very fast and quickly changing directions. I was watching the south western sky and noticed a bright set of steady red lights moving from the southwest to the northeast.  The speed was faster than anything moving in the sky and then the lights suddenly changed direction to move due east. I followed with binoculars for several minutes until it was out of view. About 5 minutes later I witnessed 2 more craft moving from the southwest to the northeast and they maintained the same path without changing direction. The last sighting was about 5 minutes later and this one was the most incredible.  Again a set of red lights that changed to white and back to red.  Approximately 2-4 lights.  This one moved from the southwest heading north east and after about a minute, completely turned around and went back the way it came from.  Then it turned again to the north and then turned due east going directly over my house.  I don't know what it was, but the speed and constant lights, not blinking was like nothing else in the sky.  This is the 3rd day this month that I have seen something that is not an airplane moving in the sky over Henderson and almost always moving from the south or southwest to the east or northeast.",
      "link": "http://www.nuforc.org/webreports/086/S86840.html",
      "state": "NV",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb7a",
      "summary": "Large bright orange colored light with 2-3 smaller lights surrounding it. ((NUFORC Note:  Sighting of Venus.  Timing is correct. PD))",
      "city": "henderson",
      "shape": "unknown",
      "date": "2012-02-03T00:00:00",
      "story": "A large bright orange colored light with 2 or 3 smaller lights surrounding it. saw a bright orangish light hovering over lake ontario. thought it might have been mars or venus because of the color but it was a lot bigger and brighter than i've ever seen either of them.  the object seemed to stay still in the sky for about 10 or 15 minutes. when i looked at it through a pair of binoculars i could see a red light and a white colored light and possibly a third light that looked like it may have been white.  it looked almost like the lights were in a triangular shape but it was hard to tell because there was a lot of glare from the brightness.   after a while it appeared to move to the right(north) a little bit and then after sitting still for a couple more minutes it slowly started moving in what appeared to be a southwestern direction (toward oswego ny) until i was no longer able to see it over the tree line. ((NUFORC Note:  Sighting of Venus.  Timing is correct for Venus, which currently is in the southwest sky, during the early evening.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86973.html",
      "state": "NY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb62",
      "summary": "Approximately 50 twinkling  lights moving east to west in a string near Las Vegas, NV",
      "city": "henderson",
      "shape": "formation",
      "date": "2012-02-10T00:00:00",
      "story": "Approxomately 50 twinkling  lights moving east to west in a string near Las Vegas, NV Moving from East to West, we witnessed a string of twinkling lights move across the sky, under the moon, and through the Little Dipper.    As the lights moved across the sky, they were grouped together, however there were some stragglers as they moved across the sky.   The event lasted approximately 15 minutes, and the lights faded as they moved westward. ((NUFORC Note:  We have corrected the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87104.html",
      "state": "NV",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed4b",
      "summary": "Flying smoke cloudy looking image flying around in henderson nv",
      "city": "henderson",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "flying smoke cloudy looking image flying around in henderson nv I was headed east on sunset road in the turning lane to head north on eastern.   When i was saw like a black smokey like figure come over the turn signal, (I thought the light had caught fire and smoke was coming out of the fixture)    But what i saw was a woman looking figure with long hair greyish looking figure with centipede type torso.  it flew around the area in a curious type fashion turning and looking as if excited several other people in vehicles and on foot were taking pictures and following the object,i managed to get like ten pictures of it . ((NUFORC Note:  Date of incident may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97593.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3befbb",
      "summary": "UFO emitted very bright white light, and moved erratically as you can see by watching the video.",
      "city": "henderson",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "UFO emitted very bright white light, and moved erratically as you can see by watching the video. This is a video of a UFO captured on a NASA AllSky Network camera, AKA, sky sentinel in Henderson, Colorado.  This is a motion activated camera used to track meteorites.  The video can be viewed by going to this link: http://youtu.be/hOhKZBY6VUE .",
      "link": "http://www.nuforc.org/webreports/097/S97190.html",
      "state": "CO",
      "duration": "23 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf64c",
      "summary": "Gave me chills.",
      "city": "henderson",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "Gave me chills I was walkin down my street and the corner of my eye caught two light orbs perfectly aligned with each other...they went from the sky down toward the mountain than disseapeared in a flashing matter ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95162.html",
      "state": "NV",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf85e",
      "summary": "Myriad of UFO’s captured; all seem to have the same form, except for three triangular shaped craft, orbs otherwise.",
      "city": "henderson",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "Myriad of UFO’s captured; all seem to have the same form, except for three triangular shaped craft, orbs otherwise. Please understand that these are videos captured by NASA All Sky Network Meteorite Cameras.  They are motion activated.  I have 29 videos on You Tube, and seem to be the only one doing this.  There are a couple of copycats, but what they have are not UFO’s.   After downloading these videos, they will be removed quickly from the source I acquire them from.  I have the internet location source for these daily updated videos if you would like to check my source.  Some are still available as they do not keep up with their feeds.  Please note: that I have reported these videos feeds to other National UFO Reporting Centers, some of which posted my videos as top sightings.  Here are some examples of orbs, and triangular craft captured over cities, and Top Secret facilities.  If you would like to view all videos, please visit http://www.youtube.com/user/ufoevaluator . Here are sample videos:  UFO chased by Jet. http://youtu.be/fpYJ40Wc8Ps  UFO over Sandia National Labs in New Mexico. http://youtu.be/x4h0e-zfVgA  UFO captured over Kennedy Space Center. Infrared All Sky Camera.  After this went viral, they disable this infrared cameras as they were inundated with phone calls. http://youtu.be/mdlr6Osp9mA  Amazing UFO captured over Henderson, Colorado in March.  This is amazing. http://youtu.be/hOhKZBY6VUE  This UFO takes off after landing just outside Sandia National Labs.  The landing portion would not allow me to download.  I only have it on the ground, than lifting off. http://youtu.be/44N5zaBsMe4  Amazing Triangular craft captured over NASA. http://youtu.be/gB0TlcTGM1g  Another Triangular craft captured over Kennedy Space Center. http://youtu.be/rk3-5OtZh40  Lastly, another UFO sighting.  Three of them side by side captued over Kennedy Space Center. http://youtu.be/VnMv0v_zsOs  If you would like to contact me, I would be more than happy to share the sourses. Regards,  ((name and telephone number deleted))",
      "link": "http://www.nuforc.org/webreports/097/S97889.html",
      "state": "CO",
      "duration": "01:20"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc2b",
      "summary": "Square cube on fire hovering above the horizon for about a minute very close and then disappeared.",
      "city": "henderson",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "Square cube on fire hovering above the horizon for about a minute very close and then disappeared. My family and i were standing on our third floor balcony ready to watch the fireworks.  Approximately at 11:58 pm we witnesses a strange bright cube shape slowly hovering with a centre of fire in the air.  We were facing east and the flaming cube with four points was approximately half the size of a full moon.   After just being there for about a minute it simply just faded to black.",
      "link": "http://www.nuforc.org/webreports/095/S95676.html",
      "state": "NV",
      "duration": "45-1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c02f7",
      "summary": "It was 9 pm on 5 / 31 /13 when this red circular probe went over us ( we were walking ) it was going side to side and the light stayed",
      "city": "henderson",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "It was 9 pm on 5 / 31 /13 when this red circular probe went over us ( we were walking ) it was going side to side and the light stayed solid red and then changed to orange back and forth it lasted for about 20 seconds then in a blink of an eye it blinked and then boom it was gone is left a red trail of light. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98300.html",
      "state": "NV",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c04ac",
      "summary": "Glowing red sphere that pulsated with light then dimmed, making it seem like it ascended to greater altitude.",
      "city": "henderson",
      "shape": "sphere",
      "date": "2012-12-20T00:00:00",
      "story": "Glowing red sphere that pulsated with light then dimmed, making it seem like it ascended to greater altitude. On Thursday, December 06, 2012 my husband and I were on our way home from work and stopped in the Whitney Ranch area to pick up my niece.  While we were waiting (at around 5:30 pm) my husband noticed something strange in the night sky almost directly above us.  The object had been travelling rather fast from South to North when it came to a stop and hovered. This was the Southeast area of the Las Vegas valley.  This area happens to lie directly in the flight path to McCarran airport so it’s not unusual to see aircraft.  The object appeared to be a round sphere, glowing with pulsating red light.  By the way it stopped and hovered we first thought it might be a helicopter at high altitude but it didn’t have the normal lights you’d expect to see on any known aircraft.  It simply pulsated a glowing red light.  At one point, the pulse was rather large and shortly after that there seemed to be a white halo above it for a brief moment.  Immediately following this t! he object seemed to fly straight up very quickly.  The light seemed to become more and more distant and turned a dim white color and we assumed it was heading straight up to a much higher altitude.  This assumption proved incorrect however as we began driving (watching it through the sunroof) my fist impression was that it was taking off at a high speed.  Then I realized it only seemed to be moving because we were moving.  As we made turns through the neighborhood this continued which confirmed that it could not possibly be at the high altitude we thought it had climbed to.  The light had become very faint and it was hardly discernible amid the stars, but as we traveled the stars seemed to stay stationary while this object was obviously very close to us in relation.  It was higher than the incoming airplanes but I cannot judge the altitude.",
      "link": "http://www.nuforc.org/webreports/095/S95028.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cb7",
      "summary": "2 round balls of fire floating west to east across the sky then up and out.",
      "city": "henderson",
      "shape": "sphere",
      "date": "2014-01-10T00:00:00",
      "story": "2 round balls of fire floating west to east across the sky then up and out On New Year Eve January 1st 2014 between 12:01 and 12:05 we were in our bedroom looking out the sky and taking in the fireworks over Las Vegas both on TV and out the window. We witnessed two bright orange balls of fire cross the sky.  The objects came from the direction of Primm towards Las Vegas.  I would estimate the speed at 300 to 400 mph and the altitude was 8000 feet.  One first crossed the sky and I watched it go up into the sky and disappear.  Approximately three minutes later a second fire ball following the identical flight path repeated. I would estimate the size of each object to have been 20 feet in diameter. The flames were clear to see.  The whole object was a glow.  The flames were going up, the flames were not training behind.  We were thinking that it was a new fireworks device in the form of a drone because it was flying.  It was not shooting across the sky; it was floating across the sky. It has been 36.5 hours since we have seen the objects and we are deeply concerned.",
      "link": "http://www.nuforc.org/webreports/105/S105954.html",
      "state": "NV",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d3f",
      "summary": "It looked like there were two suns, I saw this for a couple nights while the sun was going down.",
      "city": "henderson",
      "shape": "diamond",
      "date": "2014-03-21T00:00:00",
      "story": "It looked like there were two suns, I saw this for a couple nights while the sun was going down.  Then I took five pictures on the last day I saw it.  The last day it was visible, there was definitely something different about the object or phenomenon in the sky.   When I later looked at the pictures, I was stunned, there was a box shape in the sun and a huge diamond formation above it, then a bright light shining above that.  I couldn't believe what the picture looked like, versus what the naked eye saw. I took the pictures with my cell phone and I still have the phone with pics.  I have the pictures on my current phone as well because I'm still amazed at what I saw and why no neighbors or news organizations where reporting anything.  The diamond shaped one is perfect shaped of many diamonds put together, kind of like seeing an H bomb explode. The smaller square shape looked like something manned to me. I wonder if I have the only pictures? ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107951.html",
      "state": "NV",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d8c",
      "summary": "Lights above mountains south of Henderson.",
      "city": "henderson",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "Lights above mountains south of henderson. Mostly Stationary.  It appeared to hover.  Blinking yellow, red, and blue.   We looked at it with binoculars and couldn't see a shape but you could see it changing colors.   Above flight path to  airport. we could see planes flying underneath it so it was pretty high up.   It was above the mountains in between south of Henderson and around where Lake Mead would be if the mountains were not there.   Four of us watched it for about a half hour.",
      "link": "http://www.nuforc.org/webreports/107/S107858.html",
      "state": "NV",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e90",
      "summary": "Bright lights in triangle formation stationary in the sky",
      "city": "henderson",
      "shape": "sphere",
      "date": "2013-12-23T00:00:00",
      "story": "Bright lights in triangle formation stationary in the sky On the evening of December 12, 2013, at 6:24 pm as I was driving home with a friend after work (I was in the passenger seat and not the one driving and we were driving eastbound on the main highway), I looked out to the right side (southern direction) and noticed 4 military flares being dropped, and I observed them descend at a relatively steady rate until they went below tree line and disappeared.  I have seen military flares being dropped before and there was no question that these were military flares being dropped from an aircraft.  This was not the actual sighting, but I wanted to note that this was a little unusual as I don’t see flares being dropped often personally. At 6:35pm, literally about 9 minutes after seeing the flares being dropped, I observed to my left side (which was in a northerly direction) 3 bright, stationary lights in the sky in a semi triangular formation, which I estimate were at around 15,000 feet elevation.  They were very high in the sky.  At this time I had pulled into a gas station and was stationary and not moving while at the same time observing these lights.  The only reason it had caught my attention was that I had never seen a formation of lights in this manner shining so brightly, not moving, and completely stationary.  The brightness could be compared to the star Sirius, which is considered one of the brightest stars in the sky at night.  At first I thought that these 3 stars were stars/planets, and I was trying to figure out what constellation it was.  About 4 minutes later, the 3 bright lights completely dematerialized and were gone.  I was not able to track them moving at all, they just vanished without ! any trail whatsoever and  disappeared. That area of the city where I had observed the lights has no tall structures or communications towers that could have been the source of the lights, and I was not able to observe any FAA lights that are mandatory for all aircraft in US airspace.  That area is completely level, and the mountains are much further to the west.  The simply appeared as stars in the sky, and then they just vanished.    At this moment I am unable to attribute this sighting as any natural phenomena, as the formation and the brightness of the lights, and then observing them dematerialize was, to me, anything but natural. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105310.html",
      "state": "CO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c12a4",
      "summary": "These lights were not normal aircraft.",
      "city": "henderson",
      "shape": "fireball",
      "date": "2014-01-16T00:00:00",
      "story": "These lights were not normal aircraft. Cannot confirm these objects were of ET origin, could have been military.  What I am sure of is that it was not a normal aircraft.   My friend and I are driving back from the gym to see 3 bright lights in the sky.  Also in the sky at varied distances were a multitude of helicopters and aircraft, these 3 lights were much larger and brighter than any other light in the sky.  They were twinkling much as a star would.  But again much larger and brighter than any other star in sight.  They were equally spaced apart all at different altitudes, forming a slanted line if the dots were connected.   As we drove closer (still far in the distance) the lowest of the lights descended to the horizon line.  As we continued to drive and get a better view, the two lights that remained higher projected smaller lights from them.  The highest one projected a small light that hovered above it, while the second remaining light projected a light that seemed to shoot to the higher light much as a shooting star would.  It is fair to say that my view of the second projected light was obscured.  But I saw the first projection with no obscurity.",
      "link": "http://www.nuforc.org/webreports/106/S106294.html",
      "state": "CO",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c127c",
      "summary": "Blue halow apears and leaves at incredible speeds.",
      "city": "henderson",
      "shape": "oval",
      "date": "2014-02-07T00:00:00",
      "story": "blue halow apears and leaves at incredible speeds second time I have see in 16 months, same part of the sky, late at night as I have cig, I always just look at the stars, same as before, in like .75 seconds, the sky lights up in blue halow, then once the halow is very bright takes off at speeds to the north, from my math, zero to 30,000 mph in a 1/10 second maybe more, I seen twice now from same origin, all true ((NUFORC Note:  We have corrected the date.  We cannot certify that this is a serious report.  We attempted to contact the witness, but were unable to do so.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106975.html",
      "state": "NV",
      "duration": "1.5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1407",
      "summary": "Shadow like triangle, no lights or sound, larger and faster than a commercial jet.",
      "city": "henderson",
      "shape": "triangle",
      "date": "2013-12-12T00:00:00",
      "story": "Shadow like triangle, no lights or sound, larger and faster than a commercial jet. There was no sound and it passed my field of view from north to south. Looked larger than an airplane and was completely silent. There was no lights it was like a shadow but could make out it was triangular in shape it was larger and faster than a commercial airplane and cross the path the planes landing at McClain airport. It was triangular and looked to glow but no light, like a shadow. It was two toned the outer sides were lighter and the center was dark. It was large and low with no sound. I could here the commercial jets over it and they were higher in the sky than it was. It was also fast passing from the sight between roof tops. In a straight line almost perfect dew south.",
      "link": "http://www.nuforc.org/webreports/105/S105182.html",
      "state": "NV",
      "duration": "~45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1df4",
      "summary": "Round object, metallic, It reflected the sunlight.",
      "city": "henderson",
      "shape": "circle",
      "date": "2014-06-04T00:00:00",
      "story": "Round object, metallic, It reflected the sunlight Me and my wife were cloud watching when I noticed what looked to be a star.   We broke out the binoculars and could see round object, metallic, day time.  Thought it was a star,  at first it did not seam to be moving.   It appeared from a cloud and look to be still then move over to another cloud to the north.  It did not move fast at first but very slowly move north, stopping then instead of drifting west like a stare or planet would have it moved very fast east.  Stopping again by another cloud, then further east out of sight, taking between 45 min and an hour.   It was not a plane, no vapor trail and there was airplanes all over the place and it was not a bird could see the birds, and could make them out.   It reflected the sunlight, shiny when we looked threw  the binoculars.",
      "link": "http://www.nuforc.org/webreports/109/S109767.html",
      "state": "NV",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f6f",
      "summary": "I looked into the sky and saw two solid, white circular lights moving at the same speed, in the same direction.",
      "city": "henderson",
      "shape": "sphere",
      "date": "2014-05-02T00:00:00",
      "story": "I was sitting in my car, after coming home from a dinner, when I looked into the sky and saw two soild, white circular lights moving at the same speed, in the same direction.  The light in front of the other one was more faint, and both lights were consistent with their brightness.  These looked very high in the sky. I tried tracking these lights as far as I could, but eventually they faded into the night sky.   After observing more, I saw two blinking planes flying in the same pattern, in the same direction as the previous two lights! I was shocked!   After these planes were far in the distance, I looked directly up, and saw, YET ANOTHER faint orb travelling what seems to be very high in the sky, possibly above our atmosphere. It was moving in the opposite direction of the two previous sightings.  After this, I saw the last UFO, very similar to the previous one, and on the same path, except it was moving in the opposite direction. I have a video and picture of the first sighting.  I have lived in Las Vegas my entire life (22yo), and I know what planes (both commercial and military, we have bases near here) look like in the sky... the four orbs were NOT planes! I do believe the blinking objects were planes, but I found it quite curious they were in the same formation and flying in the same direction. :)  Maybe our military keeping an eye on things?",
      "link": "http://www.nuforc.org/webreports/108/S108899.html",
      "state": "NV",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c209a",
      "summary": "Very Strange Red Sphere Over Henderson, Nevada.",
      "city": "henderson",
      "shape": "fireball",
      "date": "2014-05-08T00:00:00",
      "story": "Very Strange Red Sphere Over Henderson, Nevada. While sitting in the backyard of my home on May 3, 2014 at 10:00 pm, I observed a bright red ball travel over the Las Vegas Valley area that was very odd.  I have been watching the sky's for some time hoping to see something unexplained like this. After watching aircraft come and go from this busy region, this object stood out because it was a solid red light that never blinked.  No other lights were on the craft.  This object flew a straight path from southwest to northwest, leaving sight after 10 to 15 seconds. I was prepared with a new pair of 7x35 binoculars and was able to view the craft well.  The object was bright red and had a halo effect around it, however this may have been an anomaly because it seemed to be ascending slightly as it traveled northeast out of the valley through a low thin cloud cover. The altitude of this craft appeared to be  2000 to 3000 feet.  It made no sound and appeared that the red glow was at the rear of the object and it would shift and from side to side.   Every craft I see here has solid lights and blinking lights.  I can see in great detail with binoculars even at night.  It left no exhaust trail and was certainly something very different than aircraft.  No wing outlines and it resembled a spherical shape of glowing bright red. Though the craft flew straight, suggesting a fast moving plane, it's behavior was not of any plane I have watched.  A rocket, weather balloon, meteor or helicopter would not act like this object. I was happy to finally see something unexplained in our sky's after months of trying.   We live near Area 51 and a large airforce base.  I suspect they had something to do with the object, which was very unusual. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109162.html",
      "state": "NV",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c226a",
      "summary": "2 red orb craft traveling horizontally south of Henderson, NV, in an east to southeast direction.",
      "city": "henderson",
      "shape": "fireball",
      "date": "2014-04-11T00:00:00",
      "story": "2 red orb craft traveling horizontally south of Henderson, NV, in an east to southeast direction 2 craft traveling south of the city from west to east and southeast at relatively slow speed.   Red in color and very bright.   They did not seem to be at a high altitude, maybe only 2000 to 3000 feet high. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108371.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2371",
      "summary": "Green light shoots across northern Henderson sky.",
      "city": "henderson",
      "shape": "flash",
      "date": "2014-04-11T00:00:00",
      "story": "Green light shoots across northern henderson sky. Fairly bright green light shot across the northern side of henderson",
      "link": "http://www.nuforc.org/webreports/108/S108526.html",
      "state": "NV",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3086",
      "summary": "Orb (white circle) Henderson, NV.",
      "city": "henderson",
      "shape": "other",
      "date": "2014-08-15T00:00:00",
      "story": "ORB (white circle) Henderson NV Our condos are on top of the hill of Bighorn Condos. My husband and I got home like 11pm at night, I stayed to look at the bright moon, while my husband went to our condo, it was beautiful moon, but then I noticed a soft white light circle orb flying in circular motion away from the moon, in and out of clouds, going up and down, and I know for a fact where we face away from the strip of Las Vegas, Nevada, and I know it wasn't a normal light, I have ever since. I Know for a fact it was an ORB,  I video record it a little caption maybe like 5 seconds or less video, of the ORB and took one decent picture of the ORB..",
      "link": "http://www.nuforc.org/webreports/112/S112419.html",
      "state": "NV",
      "duration": "20 minuts"
    },
    {
      "_id": "64d005f478aba2ec5a3c366d",
      "summary": "Black triangle with bright lights at the corners and the turbine sounds, but very very slow almost hovering.",
      "city": "henderson",
      "shape": "triangle",
      "date": "2015-02-06T00:00:00",
      "story": "Black triangle with bright lights at the corners and the turbine sounds but very very slow almost hovering Traveling north east at about 7:30 p.m.   From Henderson towards Owensboro on highway 60.  Noticed a very bright light to the east headed toward my direction which was very low in the sky and seem to be hovering.   Kept watching it as I was driving and pulled over a few minutes later because it seemed to be coming directly toward us. got out to watch it was going very very slow to be a plane.  It went right directly above us at that point you could see one light in the front two lights in the back in the form of a triangle and there was no tail behind the two lights at all.   It seemed to be black because I can see the outline and I could tell that it was trying to her shaved because there is no tail nothing hanging out behind the two lights in the back and there was nothing extending past the front light.   It continued southwest just had a very very slow speed I could tell it was not a helicopter because there was no sound of a helicopter there was the sound of a turbine, but like I said, it was very very slow",
      "link": "http://www.nuforc.org/webreports/117/S117127.html",
      "state": "KY",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c378a",
      "summary": "We heard loud humming.  Went outside and saw large, red, pulsating triangle in the sky.  It hovered, then disappeared",
      "city": "henderson",
      "shape": "triangle",
      "date": "2015-01-26T00:00:00",
      "story": "We heard loud humming.   Went outside and saw large, red pulsating triangle in the sky.   It hovered, then disappeared,",
      "link": "http://www.nuforc.org/webreports/116/S116868.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3da1",
      "summary": "I saw a huge triangluar shaped ship close up only about 600 ft above me for about 45 seconds and then it disappeared.",
      "city": "henderson",
      "shape": "triangle",
      "date": "2015-06-24T00:00:00",
      "story": "I saw a huge triangluar shaped ship close up only about 600 ft above me for about 45 seconds and then it disappeared. UFO Report   May 30, 2015.           On Saturday, May 30, 2015, at approximately 8:00 PM, over the Green Valley area of Henderson, NV, my wife and I got in the car to go out and eat, like we do every Saturday night.   We got in the car and turned around the corner just a 100 ft from our home and a bright light caught the corner of eye and I looked up and couldn't believe what I was seeing.  There was a huge triangular shaped black ship with seven large bright lights on the two sides of the V-shaped front.   I could see the ship up close, as I am sure it was below 1000 ft elevation and still daylight. It had been a rainy and overcast day in the Las Vegas area and it appeared that the ship had just popped out of a low cloud bank.    My wife couldn't see it, as she was sitting on the other side of the car, so I stopped and asked her to get out and look up, but just as she started get out, it disappeared.  It was like someone turned a switch and it disappeared before my eyes.  I had a clear visual look at the ship for about! 45 seconds.   The ship was large with a 300 to 500 ft long triangular sides and looked like a flat black wing which seemed very super sonic.  The unusual thing was the lights, they were not mounted on the superstructure.  There was a rigging made with black pipes attached to the fuselage that held the lights and protruded out from the ship about 10 feet.  I questioned how they could fly through the atmosphere at high speed with lights like that.   There were seven lights, one right on the point and 3 each down each side.  They were large,  rectangular, the longest length vertical.  They were 3 or 4 ft high and 2 or 3 ft wide.  The ship was moving very slow, less than 30 miles an hour and there was no noise of visible engines or intakes. I am very familiar with the B2 bomber, as a saw it fly over very low over us at at the Rose Parade, several years ago.  I also had the opportunity to stand under it at Nellis AFB during Air Force air show a few years ago.  The  ship I saw was bigger than the B2, possibly two or three times the size.  It is scary to even think about this huge thing was hovering only about five or six hundred above the roof tops of the homes in the Las Vegas area.",
      "link": "http://www.nuforc.org/webreports/119/S119671.html",
      "state": "NV",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3dc3",
      "summary": "I saw an orb-like object in the sky, with green and blue iridescent like trails.",
      "city": "henderson",
      "shape": "sphere",
      "date": "2015-07-17T00:00:00",
      "story": "I saw a orb-like object in the sky, with green and blue iridescent like trails.  It was so bright like a giant LED light.  It shot across the sky fast like a shooting star, and I thought that it was at first (I grew up in the country and have witnessed many).  It went from shooting across the sky, to almost a slow \"glide.\"   At that point it regained my curosity, I see airplanes and helicopters every single night here in Vegas.   I'm not a dummy,  I consider myself pretty street-smart.  I am 100% positive I saw what I described. After the glide, it went out of view behind a tree, and disappeared.",
      "link": "http://www.nuforc.org/webreports/120/S120442.html",
      "state": "NV",
      "duration": "4-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c401d",
      "summary": "Formation of lights over Black Mountain.",
      "city": "henderson",
      "shape": "unknown",
      "date": "2015-05-22T00:00:00",
      "story": "Formation of lights over Black Mountain. my wife was leaving with our 4 yr old niece and she came back in freaking out saying come look at this.I went out and over black mountain there was 10 to 12 lights all in a perfect  formation spread out totally equal spce between them.  She took a picture but it didn't come out good.  Then they went down behind black mountain.  These were no planes or jets or anything like that.  I've never seen anything like this before in my 52 yrs on this planet.  I THINK THEY were all red. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119076.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c406d",
      "summary": "Saw 2 dark orange circles in sky by mountain above the landsman gardens property one was above the other they looked like huge orange g",
      "city": "henderson",
      "shape": "circle",
      "date": "2015-05-22T00:00:00",
      "story": "Saw 2 dark orange circles in sky by mountain above the landsman gardens property one was above the other they looked like huge orange glowing circles one above the other but they stayed in the same place for 3 min then the one on top flew to the left diagonally then straight up and left and disappeared so fast to fast to be a air plane or helicopter and the one on the bottom stayed in the same spot while the one above dissappear then it started to fly to the right like it slung shot right so fast and disappeared they made no noises and we would have heard it if they were in fact helicopters or air planes as we are used to them where we live. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119028.html",
      "state": "NV",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4081",
      "summary": "Looked like two bright dark is orange orbs one above the other stayed in same place one above the other for like 3 minshen the one on",
      "city": "henderson",
      "shape": "circle",
      "date": "2015-05-22T00:00:00",
      "story": "Looked like two bright dark is orange orbs one above the other stayed in same place one above the other for like 3 mins then the one on the tops speeded left well the bottom one stayed on place then after about 4 more mins the bottom one sped right they were way to fast to be airplanes and they definitely were not helicopters we would have been able to hear them.",
      "link": "http://www.nuforc.org/webreports/119/S119029.html",
      "state": "NV",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4341",
      "summary": "Small, bright orb traveling swiftly from East to West, then straight up in to the clouds.",
      "city": "henderson",
      "shape": "sphere",
      "date": "2015-11-19T00:00:00",
      "story": "Small, bright orb traveling swiftly from East to West, then straight up in to the clouds. A small, luminous orb was witnessed to the North, slightly above rooftop level, traveling swiftly from West to East at an upward angle of approximately twenty degrees.     It traveled some distance at this angle, came to a quick, sudden stop in mid-air, then shot straight up and disappeared in to the clouds.",
      "link": "http://www.nuforc.org/webreports/123/S123535.html",
      "state": "NV",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4347",
      "summary": "Large, rectangular. Bright red, orange, and green oval lights flashed. Made no sound, and hovered about 20 feet above ground.",
      "city": "henderson",
      "shape": "rectangle",
      "date": "2015-11-19T00:00:00",
      "story": "Large, rectangular.  Bright red, orange, and green oval lights flashed.  Made no sound, and hovered about 20 feet above ground.",
      "link": "http://www.nuforc.org/webreports/123/S123531.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c437d",
      "summary": "Green Haze/light in Southwestern part of sky.  ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "henderson",
      "shape": "",
      "date": "2015-11-19T00:00:00",
      "story": "Green Haze/light in Southwestern part of sky. By the time I saw it... it was a light but bright Green Haze on the Southwestern part of the sky, I was told that before I finally was able to see it, it was a LOT more brighter and Acute... people had been pulling over on the streets and freeways to observe it.  Its unknown whether this is UFO  related or not....but definitely ODD!!! WHAT WAS IT???  ANYONE KNOW???? ((NUFORC Note:  US Navy missile launch.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123750.html",
      "state": "NV",
      "duration": "~30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c464a",
      "summary": "3 red orange shimmering spheres.  Vertical in sky, about 2000 ft altitude",
      "city": "henderson",
      "shape": "sphere",
      "date": "2015-11-19T00:00:00",
      "story": "3 red orange shimmering spheres. Vertical in sky, about 2000 ft altitude Walked outside to retrieve an item from vehicle.  Noticed three orange red shimmering sphere shaped objects in the western sky about 2000 ft.  These were in a vertical line.  No noise, and were not helicopters, weather balloons etc.  Upon observing the objects, they moved side to side in an almost synchronized pattern.  Realizing what this might be I  Rushed inside to get wife and phone camera, and when returned, the bottom two were gone and the top object was rising into the horizon at an angle to the west, leaving what appeared as a possible trail of light.  This is the object my wife was able to witness.  Never have I given much thought to ufo's etc, but this is something that given the entire event of circumstances, I am not quite sure what I have seen here.  Very Very unfortunately, I was not able to obtain any video.  This is the part that is most frustrating",
      "link": "http://www.nuforc.org/webreports/124/S124115.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4cf4",
      "summary": "Large flashes of lights behind mountains in Henderson, but no clouds.",
      "city": "henderson",
      "shape": "flash",
      "date": "2015-09-11T00:00:00",
      "story": "Large flashes of lights behind mountains in Henderson, but no clouds. We were driving on the freeway towards the green valley casino in Henderson, and to our right behind the mountains there were big flashes of lights.   I thought it lightning, at first, but there were no clouds. ((NUFORC Note:  Time and/or date may be flawed.  The correct date may be September 09.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121834.html",
      "state": "NV",
      "duration": "13 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4fcc",
      "summary": "My husband son and myself and a friend was walking  in dark home from parents house up road from us and in the southern sky heading  no",
      "city": "henderson",
      "shape": "other",
      "date": "2016-02-26T00:00:00",
      "story": "My husband, son, I and a friend was walking in dark, home from parents' house up road from us and in the southern sky, heading north was 7 lights, with a oval shape with the lights the head light first light was way brighter than the rest there was no sound what so ever they were all perfectly  spaced bright white lights no flashing of any kind.",
      "link": "http://www.nuforc.org/webreports/126/S126052.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5204",
      "summary": "Two orangish glowing orbs silent, extreme acceleration and speed.",
      "city": "henderson",
      "shape": "fireball",
      "date": "2016-01-29T00:00:00",
      "story": "Two orangish glowing orbs silent, extreme acceleration and speed. While out for an evening walk with my wife son and dog,  My son noticed a glowing orangish light in the sky in front of us and called it a glowing pumpkin, as we were watching it another u.f.o. approached at such velocity, if you blinked you might think it just appeared or turned the lights on.   They hovered a minute or so then the second to arrive sped off right towards Boulder City with acceleration and speed not capable by humans.  The crafts were silent and the first to arrive was last to go and this time I didn't see the tracer across the sky as it left.  It was either too fast or maybe it went a different direction like straight up.  Either way, this was the strangest thing I have ever seen in the night sky in my lifetime.  I truly feel like there is technology out there that must make ours look like childplay.",
      "link": "http://www.nuforc.org/webreports/125/S125479.html",
      "state": "NV",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5598",
      "summary": "The craft was moving from south to north hover over above continue north and then turn to the left small circle stop in Hoverd like it",
      "city": "henderson",
      "shape": "triangle",
      "date": "2016-07-08T00:00:00",
      "story": "The craft was moving from south to north hover over above continue north and then turn to the left small circle stop in Hoverd like it was looking right at me, it was like a red glare that caught my attention it was and not blinking when they came to a complete stop it had a glare off the craft like it was red I  showed him a peace sign and it disappeared",
      "link": "http://www.nuforc.org/webreports/128/S128100.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5768",
      "summary": "Red/white blinking object observed over Sloan Canyon area/West Henderson.",
      "city": "henderson",
      "shape": "teardrop",
      "date": "2016-07-15T00:00:00",
      "story": "Red/white blinking object observed over Sloan Canyon area/West Henderson My wife was driving south on I-15 near the St Rose Parkway interchange.  She observed a circular craft what appeared to be a single triangular wing flying overhead.  The object flashed a bright red light from the 'wing', and when this was off two dimmer white lights blinked from the 'disk' section. She called me and I went to the backyard (we live to the east of the M Resort) and I observed an object in the same area, with the distinctive bright red - white - white blinking pattern flying in the Sloan Canyon area, heading away from me to the southwest. After several minutes, the lights suddenly stopped blinking while the object was in mid-air, and we could not observe the object any further.",
      "link": "http://www.nuforc.org/webreports/128/S128462.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c57af",
      "summary": "Blue orb. The blue orb came forward and stayed stationary for about 10 sec until descended down for about 5 seconds. The orb then proce",
      "city": "henderson",
      "shape": "other",
      "date": "2016-07-08T00:00:00",
      "story": "Blue orb.  The blue orb came forward and stayed stationary for about 10 sec until descended down for about 5 seconds.  The orb then proceeded to disappear over the horizon.",
      "link": "http://www.nuforc.org/webreports/128/S128356.html",
      "state": "CO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a9d",
      "summary": "Bright phenomenon shaped like kid's spartle stick was just spotted outiside my home.",
      "city": "henderson",
      "shape": "other",
      "date": "2016-04-29T00:00:00",
      "story": "bright phenomenon shaped like kid's spartle stick was just spotted outiside my home. i looked outside my bedroom window and saw a very bright light,  i originally thought it was an automobile w/bright lights, but could never resolve lights of an automobile. it was a beautiful sphere of ever-changing bright and colorful, psychedelic lights. a multitude of colorful bright streamers emanated from the object.  it looked like a kid's sparkle mini-fireworks stick but was much larger by at least 3 orders of magnitude.  after very short period of time, the object began moving through trees adjacent to highway.  i could see it through the trees.  then, it just blinked out. i hope this report is satisfactory.",
      "link": "http://www.nuforc.org/webreports/127/S127012.html",
      "state": "NC",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6391",
      "summary": "The UFO/plane/missile was very high and traveling very fast. The direction of flight was from Area 51 towards the Edwards Air Force bas",
      "city": "henderson",
      "shape": "cylinder",
      "date": "2016-08-29T00:00:00",
      "story": "The UFO/plane/missile was very high and traveling very fast.  The direction of flight was from Area 51 towards the Edwards Air Force base area.   The photo was taken at a WSW trajectory from the Henderson/Las Vegas NV area.",
      "link": "http://www.nuforc.org/webreports/129/S129536.html",
      "state": "NV",
      "duration": "2 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c66b7",
      "summary": "Driving N on I-15 just passing the M Resort and Casino on our right and a mountain next to the freeway on our left, and we s",
      "city": "henderson",
      "shape": "oval",
      "date": "2017-04-20T00:00:00",
      "story": "We were driving North on I-15, just passing the M Resort and Casino on our right, and a mountain next to the freeway on our left, and we saw what appeared to be the side if the mountain moving in on itself, but quickly realized it was a giant oval shape just slightly different color moving into mountain and disappearing. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133644.html",
      "state": "NV",
      "duration": "1-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6eaf",
      "summary": "Two amber orbs observed in Henderson Nevada",
      "city": "henderson",
      "shape": "circle",
      "date": "2017-09-05T00:00:00",
      "story": "Two amber orbs observed in Henderson Nevada While leaving work and walking to my Jeep that was parked on the top level of a parking garage.  I observed two amber orbs (the color of fire) defending from rain clouds and disappear behind a mountain range.  The mountain range is directly south of Area 51.  I was looking straight north when I observed this event.   There were thunderstorms in the area at the time and it appeared that this object descended as one object and split into at least two objects.   I work as a Surveillance Supervisor at a Casino and was able to review video from a camera on another parking structure, and it confirmed what I saw, and the times.",
      "link": "http://www.nuforc.org/webreports/136/S136003.html",
      "state": "NV",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6fa3",
      "summary": "Satellite-size obj. made random white pulses of light.  Some were a bright flashes and others were slow dim pulses.((anonymous report))",
      "city": "henderson",
      "shape": "circle",
      "date": "2017-08-04T00:00:00",
      "story": "Satellite size object made random white pulses of light.  Some were a bright flashes and others were slow dim pulses.  Inconsistent timing.  Moved very slowly and changed directions 3 times over twenty minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135386.html",
      "state": "NV",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7034",
      "summary": "Flashes of light in the sky, brighter and higher then planes, a little larger, distance unknown.",
      "city": "henderson",
      "shape": "flash",
      "date": "2017-08-17T00:00:00",
      "story": "Flashes of light in the sky, brighter and higher then planes, a little larger, distance unknown. Saw a flash that faded out in about a second to North/North East every 10-30 seconds.  It was bright enough to catch my attention (I wasn't looking up, originally).  It was also higher than the planes flying by.  Every flash was dimmer than the last. Wondering if it could have been a dieing star?  I never seen one before and am not sure if you can with your naked eye.  Hoping someone else saw it when it was maybe brighter or knows of any astronomical events. Thanks",
      "link": "http://www.nuforc.org/webreports/135/S135737.html",
      "state": "NV",
      "duration": "2-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c76d3",
      "summary": "Large craft seen hovering between my house in the foothills of Henderson, and Nellis AFB. It was the size of a football field, 5 lights",
      "city": "henderson",
      "shape": "disk",
      "date": "2017-12-21T00:00:00",
      "story": "Large craft seen hovering between my house in the foothills of Henderson, and Nellis AFB. It was the size of a football field, 5 lights, silent. It disappeared by \"flyinG\" upwards.  It left a blank space in the sky.  It was around 10:pm.  There is video on youtube.",
      "link": "http://www.nuforc.org/webreports/137/S137886.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a4c",
      "summary": "White Streak over Henderson.  ((anonymous report))",
      "city": "henderson",
      "shape": "light",
      "date": "2017-11-22T00:00:00",
      "story": "White Streak over Henderson. Object was traveling on a east to west trajectory.  It seemed like a meteor in very low atmosphere entry, but object was perfectly round, with a very bright pure white streak as the orb appeared at the end of the streak on a very smooth and sharp motion.  As if generated by a CGI system, although this happened in our eyesight over the southern part of Henderson near Highway 15. Flights going into Mcarran (LAS) were seen on approach at a lower altitude, flights seemed to be headed towards Lake Mead for their final turn and approach before landing, at the vantage point, it seemed object was 5 times the size of a Boeing 737. Object had very sharp and defined edges within the white streak of light, no debris field behind or around its side.  Upon its final light emission a brilliant white orb could be seen at its end and light completely disappeared as if by a light switch, without any prior change is its coloration or brilliance. I have seen meteors showers, meteors, comets, and an avid astronomy amateur.  Most people would dismiss it as a lone meteor or space debris, this object showed no hallmarks of being either. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137308.html",
      "state": "NV",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7bbd",
      "summary": "3 stationary red lights over Lake Las Vegas",
      "city": "henderson",
      "shape": "light",
      "date": "2017-09-28T00:00:00",
      "story": "3 stationary red lights over Lake Las Vegas While outside at a concert at Lake Las Vegas, a solid red light appeared from the north.  There were no other lights on the craft.  It seemed stationary.   A minute or so later, 2 more red lights appeared and they all remained stationary in a triangular formation.  Many people looked up verifying this was an unusual occurrence.   One craft went to the west then seemed to just disappear, meaning you could not follow its direction.  The other two craft seemed to get smaller then they too just disappeared. In other words, it did not track across the sky.   I did take a picture.   The light comes out white, but when I enlarge it, the shape is a thick oval.",
      "link": "http://www.nuforc.org/webreports/136/S136277.html",
      "state": "NV",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f4c",
      "summary": "4 brilliant lights were at first in a diamond formation.the crafts were too large and bright to be helicopters or other. They were over",
      "city": "henderson",
      "shape": "light",
      "date": "2018-05-04T00:00:00",
      "story": "4 brilliant lights were at first in a diamond formation.  The crafts were too large and bright to be helicopters or other.  They were over Nellis.  They'd disappear and reappear a few minutes later.",
      "link": "http://www.nuforc.org/webreports/139/S139691.html",
      "state": "NV",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8647",
      "summary": "Brilliant white light, morphed to clearly defined rectangular black shape, emitted misty tail, all vanished w/ no trace.",
      "city": "henderson",
      "shape": "changing",
      "date": "2018-08-22T00:00:00",
      "story": "Brilliant white light, morphed to clearly defined rectangular black shape, emitted misty tail, all vanished w/ no trace. I was returning home from Arizona the evening of August 17, 2018, about 7:40PM PDT.  I was driving north on I-11 (US93-95) and had just passed the Boulder City interchange when I noticed a brilliant light, WNW of my position about 35 degrees above the horizon.  The light appeared to be approaching Black Mountain but was off in the distance, seemingly 10-20 miles away.   I immediately assumed that it was simply a jet on final into McCarran airport, since the jet traffic routinely make their final turns at Black Mountain.  I glanced at it again about 30 seconds later and noticed that it hadn’t moved in any closer.  Right then the light started to shimmer to a dull orange and went completely black and became a rectangular shaped black object, silhouetted against the dusk sky.  Though the overall object appeared quite small (maybe 1/6 of a full moon) the corners of the rectangle were sharply defined.   I glanced back at it again periodically every few seconds while ! driving and noticed after another 30 seconds a milky tail start to come out of the black rectangular object and cover it in mist.  Five seconds after that it had completely disappeared between my glances at it.  No mist just gone.  I would have assumed it was a meteor viewed face on, had it not been visible for almost 2 minutes in total.",
      "link": "http://www.nuforc.org/webreports/142/S142829.html",
      "state": "NV",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c874a",
      "summary": "Jellyfish shaped objects that are holographic disappear out of thin air.",
      "city": "henderson",
      "shape": "other",
      "date": "2018-07-13T00:00:00",
      "story": "Jellyfish shaped objects that are holographic disappear out of thin air. The object was above a mountain and was holographic mostly clear purple and blue it was the shape of a jelly fish and there were three of these objects lined up vertically then once they came closer they disappeared out of thin air. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142206.html",
      "state": "NV",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8a67",
      "summary": "I saw 4 firey objects moving in a circular motion, and then started to move  ((anonymous report))",
      "city": "henderson",
      "shape": "fireball",
      "date": "2019-09-19T00:00:00",
      "story": "I was going to my car and my wife was standing about 40 feet in front of me looking in the opposite direction telling me to turn around.  When I did I saw 4 firey objects moving in a circular motion, and then started to move in very peculiar motions as if it was a fly.",
      "link": "http://www.nuforc.org/webreports/148/S148967.html",
      "state": "NV",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a69",
      "summary": "Looked comets falling straight down from a plane then they stopped before hitting ground hovered,  ((anonymous report))",
      "city": "henderson",
      "shape": "teardrop",
      "date": "2019-09-19T00:00:00",
      "story": "Looked comets  falling straight down from a plane then they stopped before hitting ground hovered, and looked like plane lights.  All fell straight down one after the other.  Then the lights of the plane disappeared.",
      "link": "http://www.nuforc.org/webreports/148/S148949.html",
      "state": "NV",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bbd",
      "summary": "Large white and green synchronized wheel in the sky.",
      "city": "henderson",
      "shape": "circle",
      "date": "2019-02-22T00:00:00",
      "story": "Large white and green synchronized wheel in the sky. This happened at the end of August, I think the year was maybe 2008.  We just had a severe summer storm so there was moving clouds in the sky.  My sister couldn’t sleep so she was out looking outside the window and she woke me up to look at something weird in the sky.  Looking out from our den window we saw a large moving wheel in the sky with spokes that turned counter clock-wise.  I think it was green and white colors.  Flashes of light would emanate from the wheel every few seconds.  This lasted from about 2:30 am to 4:00 am. We have tried many on-line searches to find out if anyone else saw this but no one seems to.  Considering the size of the object and just the fact that it was so incredible to see, I cannot image no one else seeing it that night.  There was no mention of it in our local newspaper, TV news and our co-workers didn’t see it either.  Last June we attended a Coast To Coast radio event and were fortunate to ask George Noory and George Knapp about this, but the were unsure also. At the risk of sounding foolish, the image of the wheel and its movement almost appeared to resemble a synchronized dance routine.",
      "link": "http://www.nuforc.org/webreports/144/S144906.html",
      "state": "NV",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c93df",
      "summary": "At around 2130 on 11/05 I noticed bright lights in the sky that did not resemble any stars I’ve seen.",
      "city": "henderson",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "At around 2130 on 11/05 I noticed bright lights in the sky that did not resemble any stars I’ve seen.  I decided to take a look at the lights with a high powered military rifle scope and noticed that there is a massive ship and or ships hovering above Las Vegas.  It spanned across the entire sky.  It had to be just outside the stratosphere but it was so large that it could be seen with great detail with a high powered scope.  Myself and 5 others saw the craft.   As of 22:54 on 11/08/19, the craft can still be seen in the sky but is at a much higher elevation and is a bit harder to notice the sharp detail from the other night.  I highly advise anyone in the Las Vegas area to take a look at the sky with a telescope or high powered scope and you will be amazed.",
      "link": "http://www.nuforc.org/webreports/150/S150478.html",
      "state": "NV",
      "duration": "Ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c93aa",
      "summary": "Very large silver flying aircraft teardrop in shape appeared overhead while pulling into driveway at approximately 6:40p.",
      "city": "henderson",
      "shape": "teardrop",
      "date": "2019-12-01T00:00:00",
      "story": "Very large silver flying aircraft teardrop in shape appeared overhead while pulling into driveway at approximately 6:40p. UFO Sighting November 2, 2019 Location:  Henderson, NV 18:40  Description: I saw very clearly something very very bright shoot over my head while I was turning into my driveway.  It was moving very fast compared to several other airplanes I also saw coming in or taking off from McCarran Airport.  It was almost teardrop in shape and left a vapor trail of some sort.  In 5 seconds or so the light was gone.  My first thought on this was:  That almost looks like a shooting star but way too big.  Here in Las Vegas the stars are hard to see at night because of the “light pollution”.  I have seen actual shooting stars and of course they look very small but flash only briefly before they vanish.  I jumped on the computer and this site to see if anyone has reported it yet or seen anything here in Henderson, NV.  So far nothing has been reported.  As far as the description of the aircraft I saw, it was almost teardrop in shape, almost shiny and very bright.  In comparison to the other aircraft in the air at the time it had no lights of any kind.  Our airplanes of course have red, white, and green landing lights.  This aircraft did not. I only saw it for approximately 5 seconds kind of like the duration of a shooting star.  Then the whole thing vanished.",
      "link": "http://www.nuforc.org/webreports/150/S150331.html",
      "state": "NV",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c970b",
      "summary": "Saw about 15 what look to be stars grouped in 4's moving in a straight line.  ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "henderson",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "Saw about 15 what look to be stars grouped in 4's moving in a straight line. They came out of nowhere moving East and then disappeared.",
      "link": "http://www.nuforc.org/webreports/151/S151034.html",
      "state": "NV",
      "duration": "5 minutes"
    }
  ]
}