{
  "city": "hialeah",
  "fetch_timestamp": "2025-07-12T14:35:59.237449",
  "record_count": 14,
  "pages_fetched": 0,
  "api_calls": 1,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b6c06",
      "summary": "a big like like a diamond coming donw fast from the sky",
      "city": "hialeah",
      "shape": "diamond",
      "date": "2006-07-16T00:00:00",
      "story": "a big like like a diamond coming donw fast from the sky My friend in my saw kind of plane coming donw fast for the sky and it look like at first like a light diamond but was so fast that we didn't get it on tape but someone else must be seen it because was a big light but the thing is that was coming donw fast but I really thing that you must investigate in hialeah florida because strange thing happen rigth here",
      "link": "http://www.nuforc.org/webreports/050/S50917.html",
      "state": "FL",
      "duration": "walking"
    },
    {
      "_id": "64d005f478aba2ec5a3b868e",
      "summary": "((HOAX??))  An air plain flying on top of the ufo.",
      "city": "hialeah",
      "shape": "changing",
      "date": "2009-01-10T00:00:00",
      "story": "It was traveling from east to west at a moderate speed then an air plain flying on top of the ufo seemed to get its attention and at an amazing speed we have never seen before it travel up and over the air plain . It was so crazy that we could hear the plain but not the ufo.It was super bright red @ first and it was always changing colors from red to blue ,super strong lights.The last thing we saw was it started to flash n it when @ a speed that we lost it . It whent east . We saw it n till now we still can believe IT! ((NUFORC Note:  Witness elects to remain totally anonymous;  provides little contact information.  Possible hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66614.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba9d2",
      "summary": "Light flying in the sky like an insect.",
      "city": "hialeah",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Light flying in the sky like an insect. I was on vacation in Florida, taking a nap. My aunt's house sits on a lake line with houses all around the edge of it.  I was just waking up for dinner as my girlfriend was coming in. She stopped and shouted an expletive to which point I jumped up to see what she was looking at. All the way on the other side of the lake above the houses and maybe half a mile behind them (3/4 of a mile from my location), was a light that looked to be the same color as a star but brighter jumping around and basically moving like a bee or a fly all over the sky.  I didn't believe what I was seeing.  We went to grab my dad and went out to the back porch, but it was gone. We watched all night for it again.  There is a lot of air traffic in the area to compare it too and it's movements and distances traveled were just not humanly possible.  I don't know what I saw and I'm not going to say it's an extraterrestrial, but it was definitely unidentified. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77692.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bb20d",
      "summary": "A green fireball fell from the sky in the distance, with no trail or tail.",
      "city": "hialeah",
      "shape": "fireball",
      "date": "2011-05-02T00:00:00",
      "story": "A green fireball fell from the sky in the distance, with no trail or tail. I saw a green fireball falling from the sky last Thursday evening, very early Friday at 3 in the morning.   I was sitting outside of a Starbucks with my friends talking like we regularly do.  I was sitting with a clear view of the eastern sky, and a view of the northern sky that was blocked off by the building. It was very cloudy and humid, but otherwise a nice tolerable night.   I was looking at one friend explaining a documentary, when over his right shoulder in the sky, I saw a green fireball with no trail or tail fall toward the ground from the sky.  It appeared from behind a cloud, disappeared behind another cloud as it descended, reappeared, and finally disappeared for the final time amongst the clouds. It travelled at the speed of like a spark that falls from fireworks, or a descending flare.  All in all, after doing research I am positive this wasn't a meteor or anything of the sort.  None of it seems to fit the bill of what I saw. For informational purposes, I am a 21 year old college student. ((NUFORC Note:  We spoke via telephone with this witness, and she sounded to us to be quite reliable, and credible.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81085.html",
      "state": "FL",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2e7",
      "summary": "Huge flash diamond in the sky.",
      "city": "hialeah",
      "shape": "diamond",
      "date": "2011-12-12T00:00:00",
      "story": "Huge flash diamond in the sky. I was in the street with 3 other people when I was looking to the sky I saw a diamond like star unusually close to the sky then a huge flash and then It left extremely fast as if it had shot something and when I came back inside my feet had been bleeding. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  We do not understand why.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85463.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bca9c",
      "summary": "Three black, oblong objects in the vicinity of Hialeah east of the Palmetto Expressway",
      "city": "hialeah",
      "shape": "teardrop",
      "date": "2011-08-21T00:00:00",
      "story": "I saw while driving on the Palmetto Expressway on way to work while traveling South three black, oblong objects in the vicinity of Hialeah east of the Palmetto Expressway.  Objects appeared stationary for 5-10 seconds then moved erratically over the Palmetto Expressway from East to West, then back to East before vanishing.  The objects changed in color from black to a reflective almost chrome color as it moved back and forth over the highway.  I could not get my cell phone camera open in time to photograph. \tThis was located between Opa Locka airport and Miami International but objects moved far to rapidly to be commercial or military aircraft.",
      "link": "http://www.nuforc.org/webreports/083/S83290.html",
      "state": "FL",
      "duration": "20-25 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb11",
      "summary": "Fireball UFO zooms away at warp speed making no sound.",
      "city": "hialeah",
      "shape": "fireball",
      "date": "2011-08-07T00:00:00",
      "story": "Fireball UFO zooms away at warp speed making no sound. As I stepped out of the car in a parking lot late one night with 2 friends, I looked up to the sky. I saw what a appeared to be a glowing ball of light.  It was pretty dim, I described it as a fireball because it looks a lot like the fireball UFO pictures posted on this site.  The second I saw it, I said \"Holy S**t\" and pointed my finger in the direction for my friends to see.  While they are turning around, the light got a little brighter and it zoomed away. It dissapeared out of my site in less than a second.  And IT MADE ABSOLUTELY NO NOISE.  So they turn around, see nothing, and think I am playing around.  They tell me to swear to \"God\", \"My Mother\" and several other things.  And then they said they beleived that I really thought I saw it, but that it was probably my imagination. But I know what I saw.  And it definitely was not my imagination.  I am 3rd year college student with a 4.0 gpa.  Tomorrow I will go back to my regular life and not really care much about this ever happening. It was an awesome experience though.  Too bad nobody ever beleives stories like these.",
      "link": "http://www.nuforc.org/webreports/082/S82942.html",
      "state": "FL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bec69",
      "summary": "Anomalies in the Sky",
      "city": "hialeah",
      "shape": "triangle",
      "date": "2013-08-30T00:00:00",
      "story": "Anomalies in the Sky 07/11/203 - Driven on the Palmetto Expressway going North about 2 miles from Hialeah was flying the Good Year Zeppelin, I took my cell and take about 6 pictures, once at home going thru the pictures I discover two very tiny bright dots just on the right side,in the blue sky. Once focus on the dots I start bringing then to close up the max available zoom in my cell, this shows two triangle objects expelling gases almost on vertical position.  Other scenario capture,by another picture, just on the right side, I noticed other dots, doing the same trick with the zoom this time I found ten triangle objects in the sky displaying a formation 3-2-2-2.  On another picture I discover another object; this means that out of the 6 pictures taken in 3 of them showing anomalies impossible to be seen by the naked eye.  The pictures still on my cell awaiting for a logical explanation. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100447.html",
      "state": "FL",
      "duration": "1/667"
    },
    {
      "_id": "64d005f478aba2ec5a3bed84",
      "summary": "Was walking dog down the street and looked at the distance and saw 3 Amber looking objects in the distance,  they were in a triangular",
      "city": "hialeah",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Was walking dog down the street and looked at the distance and saw 3 Amber looking objects in the distance, they were in a triangular shape..   They disappear then re appeared and hovered.",
      "link": "http://www.nuforc.org/webreports/100/S100555.html",
      "state": "FL",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf35e",
      "summary": "Fireball inside a circle viewing over Hialeah on 12/22/12 at approx 2200 hrs. !!!!",
      "city": "hialeah",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "Fireball inside a circle viewing over Hialeah on 12/22/12 at approx 2200 hrs. !!!! We had had a Christmas get-together at my parents home, I had not had anything to drink as I am usually assigned driver duties to take someone home who had too much to drink that evening.   As I accompanied a family of 7 to their car we noticed that the entire block across the street from my parents home (a school) had police on either end cordoning off the area all of a sudden I we all see this fireball inside a circle slowly move towards us from north to south at a speed of about 5 mph.   As soon as this object passes us the entire police contingent drives off in a southern direction and that was it.  I did not and have not read any accounts of this online, in face book nor in you tube so far I hope we were not the only ones to see this spectacle.",
      "link": "http://www.nuforc.org/webreports/095/S95447.html",
      "state": "FL",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c12f5",
      "summary": "Red light in NW sky appeared to be star but moving Southward and vanished.  Not a Shooting star.",
      "city": "hialeah",
      "shape": "light",
      "date": "2014-01-24T00:00:00",
      "story": "Red light in NW sky appeared to be star but moving Southward and vanished. Not a Shooting star. Tonight 01-22-2014 around 9:15 pm I was facing North on my way back into the house with my dog, I looked up into the sky around the area of Cassiopeia, I noticed a red light (about as big as the stars around it) which at first I thought was a high altitude jet.  It was moving southward and as it passed between the upper portion of this star constellation, it kind of dimmed, came back and went out.  Not really a fade but in between a fade and being turned off. I would say it was a meteor but I have seen hundreds of those and this thing was not going at meteor speed like a shooting star (meteor).  It was moving smoothly though. It reminded me of when I was a kid and we could see the space station making its orbit. However, that didn't disappear, it went over the horizon. I know jets etc, and there were actually two other high altitude jets in the sky as well. Different areas of the sky but were obviously jets because of the other lights blinking on the them, white and green as well as red. This thing was not blinking. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106565.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c206b",
      "summary": "My wife stepped outside to get some laundry and she noticed a bright orange light hovering in the sky and called me to come out and see",
      "city": "hialeah",
      "shape": "light",
      "date": "2014-05-08T00:00:00",
      "story": "My wife stepped outside to get some laundry and she noticed a bright orange light hovering in the sky and called me to come out and see it, what I saw was something I've never seen before,  it continued to hover for about 2 mins and then it simply vanished.",
      "link": "http://www.nuforc.org/webreports/109/S109161.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c35d3",
      "summary": "WHO IS UP THERE?",
      "city": "hialeah",
      "shape": "triangle",
      "date": "2015-01-07T00:00:00",
      "story": "WHO IS UP THERE? December 26, 2014, around 8:30pm.  2 witness myself included, looked up to sky was cloudy and kind of reddish in color almost like a winter sky right before it snows; flying from NE to SW  first saw one triangular object and immediately behind it another,  orange and white lights,  very quiet and the lights were very bright especially at each point this lasted a little more than 2 minutes and then they just disappeared.   I know what we saw and am glad someone else was with me. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116215.html",
      "state": "FL",
      "duration": "2 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e93",
      "summary": "Freelance writer that called you and hung up. 2nd sighting today, thus the other sighting was on Saturday evening as well.",
      "city": "hialeah",
      "shape": "unknown",
      "date": "2018-05-15T00:00:00",
      "story": "Freelance writer that called you and hung up.  2nd sighting today, thus the other sighting was on Saturday evening as well.  On that day it was at around 8pm. Saturday sighting was me by myself and have footage of the sighting, which was below level for about 3-4 minutes. It looked like a longated sperm if you will, which was shapeshifting quite rapidly in growth and size.  Appeared pretty high in the sky & them suddenly dropped unbelievably pretty low! It flew away rapidly and as it disappeared in an upward motion... Tonight, to my utter shock and disbelief I saw it again along iwith someone else this time... same object, like a longated, that of teardrop.. like a giant sperm..  color was white/ that of grayish white.  This time it was shapeshifting from a longated sperm to a triangular shape...& again rose up rather quickly but before doing so, it spun around slowly.  7 minutes it lasted...  Back when I was 5 years old me and my sister saw a ufo outside of our kitchen window.  We yelled to our parents, my dad came running w/his new camera in tow (1981) my father’s camera was brand new w/the 4 flash cubes you would attach to it.  Once he saw what we saw he quickly attempted to take a snap of the ship (large ship object we all witnessed that night including my mother... the camera broke! Now in the sighting just now i am convinced that it was 7 minutes, although they are claiming I stood motionless and in shock for an hour or so by the window!  Claiming that I looked spellbound. It felt like 7 m! inutes but they claim I stood still and in shock in front of my window for an hr! My ears rang the entire time tonight, as I saw this ufo... what is puzzling to me is that my ears were ringing pretty bad & had it been an hour I would’ve been aware of that notion due to the fact that the noise was unbearable to say the least!",
      "link": "http://www.nuforc.org/webreports/141/S141493.html",
      "state": "FL",
      "duration": "7 minutes"
    }
  ]
}