{
  "city": "honolulu",
  "fetch_timestamp": "2025-07-12T14:33:21.247757",
  "record_count": 83,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4c84",
      "summary": "On 4th of July driving home toward Hawaii Kai at 2am (I did not have any drinks since I can’t drink) from town as was coming up on Niu",
      "city": "honolulu",
      "shape": "fireball",
      "date": "2019-07-05T00:00:00",
      "story": "On 4th of July driving home toward Hawaii Kai at 2am (I did not have any drinks since I can’t drink) from town as was coming up on Niu Valley, noticed this slow moving object in the sky going from East to West so the opposite direction of what I was driving.  This slow moving object looked like a fireball moving slowly.  The size of it was like looking at an airplane or helicopter with lights flashing in the night sky except there were no lights flashing, just looked like something burning moving slowly like maybe fireball?  Took a video from my phone however as I zoomed in with my phone the picture got grainy. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147346.html",
      "state": "HI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e5f",
      "summary": "Several of rectangles connected in different LED like colors.  Such as red, green, blue, etc. ;above Waikiki. ((anonymous report))",
      "city": "honolulu",
      "shape": "rectangle",
      "date": "2019-05-09T00:00:00",
      "story": "It looked like several of rectangles connected in different LED like colors.  Such as red, green, blue etc.   Was floating above Waikiki area for like 3 seconds then vanished.  When it vanished I saw a a Star were it was. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145964.html",
      "state": "HI",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b50a3",
      "summary": "strange fireball with tracers lasting 1+hrs. changing directions",
      "city": "honolulu",
      "shape": "fireball",
      "date": "2007-02-01T00:00:00",
      "story": "strange fireball with tracers lasting 1+ hrs. changing directions As if jet afterburners on fireball moving south and falling--stopped light went out-turned direction towards east Stayed in sky over 1 + hrs  then seem to lower into the ocean.",
      "link": "http://www.nuforc.org/webreports/054/S54956.html",
      "state": "HI",
      "duration": "1+ hr"
    },
    {
      "_id": "64d005f478aba2ec5a3b5846",
      "summary": "If a picture is worth 1000 words than this one is worth $1,000,000!",
      "city": "honolulu",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "If a picture is worth 1000 words than this one is worth $1,000,000! DISCLAMER: I don't believe in UFO's or aliens from another world!  So posting this is not easy for me, but this is too unexplainable to keep all to myself. This entire event happened within a five minute period and I had 4 other eyewitnesses.  I noticed this object in the sky while helping my son fly a kite in the park. It took me about thirty seconds to realize it was not a kite as it was about 300 feet higher than the kite I was flying. The object seemed to be stationary, but I soon realized that it was slowly moving higher and vertical.  As I ran to another friend also flying a kite and asked him \"what's that in the sky\" he was baffled as well. I then grabbed my camera and start taking pictures. My camera is expensive and takes great shots but I'm an amateur photographer and could not lock the focus on an object that was moving away, getting smaller and had nothing but blue sky's and clouds as a backdrop.  I took a total of 10 pictures and to my amazement, one out of ten came out perfectly clear (by luck) to reveal something that is very hard to explain. I cannot describe the object other than it looks like a very large white camera with a large lens looking downward with four booster rockets and two fuel pods all of which are perfectly symmetrical in shape!  Yeah, I know; crazy huh?  As I tried to rationalize what it might be, I dismissed that it was a weather balloon, US aircraft, satellite and defiantly not a kite. What ever it was, it wasn't moving with the wind and it was still visible far beyond the cloud layer meaning that the sunlight was reflecting off of this object.  I dare not show or send this photo out to anyone unless they are willing to pay very well for it. If there really are aliens and spaceships from another world, I may have one of few real pictures as proof!  The most logical but still crazy explanation I can come up with other than it being from another world is that some foreign country has developed advance spying technology that can silently hover over American land and then return home at altitudes over 40,000 feet!",
      "link": "http://www.nuforc.org/webreports/051/S51867.html",
      "state": "HI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a05",
      "summary": "Green glowing UFOs and some that look like stars in the shape of circles with many encounters.",
      "city": "honolulu",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "Green glowing UFOs and some that look like stars in the shape of circles with many encounters. The first encounter was with two friends I no longer have contact with.  It was probably about 5-6 years ago around 10:00p.m.  We we're skateboarding behind the gym of an elementary school and decided to take a rest.  We lodged our skateboards into these vents against the gym wall and layed back on them.  We had a clear view of the sky that night and I noticed a green star in the sky.  It was bright and very distinguishable amongst all the other stars in the sky.  I pointed it out to my two friends and they noticed it right away.  We layed back and watched it for about 10 seconds when all of a sudden it came down right in front of our faces, all the way from high up in the sky right down in front of us in a split second.  The object was emitting a green glow that was very bright, but I didn't notice anything else light up around us.  It was completely silent making no sound at all, and this object was big.  My friends and I made no sound and just stared at it.  I just couldn't believe what I was seeing.  It probably hovered in front of us for around 10 seconds, as if it were staring back at us.  Afterwards it shot off back into space as fast as it had come down in front of us and we lost sight of it a second after it shot directly back up into the atmosphere.  Afterwards my friends stood up screaming their heads off and running.  I didn't know what to do or think so I just followed them.  Years and years later my friends and I were just discussing UFO encounters.  This wasn't my first either, but it is the most significant as it leads to a chain of sightings.  So anyways, I told them about this one and they realized that we could try and head to the school gym to try and see if we could spot them again.  I thought it was a great idea and got excited, so we left.  At the gym we waited for a while, and sure enough my friend spotted one out of the corner of his eye.  It looked like a star, but it was movinhg, and then a few more started popping up and moving around in the sky.  They looked ! like sta rs, however some would fly low and close to the mountain next to us and these were green leaving green trails behind them.  These would move fast and then slowly, and then all of a sudden they would jet accross the sky leaving trails behind them.  We could spot up to even 6 at a time easily.  Some were straight above us, some were off in the distance.  We watched these from around 12:00 midnight until 5:00-6:00a.m.  after the sun comes up we could no longer see them.  I gathered more friends over time and we would make routine visits to the gym to spot more UFOs.  Sometimes we would see a lot, sometimes none at all.  One time one flew close to us, we could just tell it was close, especially by lining it up with the mountain next to us.  This one flew slow and was about the size of a quarter if you were to hold one at an arm's length in front of your face.  It flew from above our heads, all the way to the other side of the field and eventually passed the mountains and dissapeared behind some clouds.  There is no way these objects could be aircraft, it's impossible.  Nothing can move that slowly and then speed up that fast and maneuver they way they did.  Sometimes they would fly directly at each other as if they were going to collide and move away right before they would touch, and move at extreme speeds.  These were still flying around, the last time I checked about a year ago.  Sometimes I could see them from my apartment balcony, like one would just jet down really fast and dissapear.  I mainly only saw them at the school gym though.  I would love to have people investigate this.  I want this to go places and I was watching the National Geographic channel and heard about this place on a UFO show that they had on.  Please, check this out!  Oh yeah I forgot to mention that we brought video cameras afterwards to try and videotape some of these UFOs.  We were unable to capture any of them with our camera because the sky was just black and the video camera was horrible at picking anything up in that type of! setting Another thing is that the video cameras shut off at the same time while we were trying to record.  The batteries weren't drained or anything, but for some reason the cameras just shut off completely. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54230.html",
      "state": "HI",
      "duration": "Years"
    },
    {
      "_id": "64d005f478aba2ec5a3b5da4",
      "summary": "Stationary star-like object shrinks to a pinpoint and vanishes.  ((NUFORC Note:  Possible sighting of Iridium satellite??  PD))",
      "city": "honolulu",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "Stationary star-like object shrinks to a pinpoint and vanishes. Approximately 1915 hours, Hawaii Standard Time, while facing S/SE, I observed a stationary star-like object almost as bright as Jupiter. Pondering whether this object was a star or planet, the object shrunk to a pinpoint of light and vanished within a few minutes after I first sighted it.  The object was about 70 degrees above the horizon.  There were no clouds in the sky and it was dusk.  Observation position was latitude 21° 16' 11.28\" and longitude -157° 49' 5.16\". ((NUFORC Note:  Possible sighting of Iridium satellite??  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58402.html",
      "state": "HI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5f8b",
      "summary": "UFO at Kam Drive-In Honolulu Hawaii",
      "city": "honolulu",
      "shape": "disk",
      "date": "2008-01-21T00:00:00",
      "story": "UFO at Kam Drive-In Honolulu Hawaii Was at the Kam Drive-In (Honolulu Hawaii) one night watching some cheesy movie. Something caught my eye and I’d thought someone threw a Frisbee or pizza box over our car. I took a direct look at it and it was something entirely else! It was a large UFO, and it was headed towards the sea. But, it was only about 200’ above and it was about 75-90’ wide. My wife saw it too. It went right over the movie screen and then below the line of sight, hidden by the movie screen itself. You could see the shape due to the reflection of the city lights on the bottom of it. It had a curve to it. No sound whatsoever. Then, other people at the drive-in who saw it started honking their car horns! ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60951.html",
      "state": "HI",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6268",
      "summary": "saw a blue sphere moving over the of of a house in front of me--hovered 5 feet above the ground for an instant, 15 feet in front of me",
      "city": "honolulu",
      "shape": "sphere",
      "date": "2006-07-16T00:00:00",
      "story": "saw a blue sphere moving over the of of a house in front of me--hovered 5 feet above the ground for an instant, 15 feet in front of me As I was doing my paper route at 3:30-4:00 am HST, I had to walk to a porch on Laukahi St. as the streetlight was burned out and I couldn't see the porch from the street for a good, 100 ft. toss----I placed the paper on the porch and, as I was returning to my car, the surrounding area became illuminated in such a bright blue light that I could easily see everything around me as though it were daylight. I turned 180 degrees around and saw an object moving at a uniform distance above the roof of the house in front of me, about 2 ft. above the roof, coming towards me from the backside of the structure, and it occurred to me that it was maintaining a uniform distance above the roof as opposed to an arc over the house from the other side or a path that would lead it way past the house---it was 'hugging' the roof as if on purpose. The object was a sphere, maybe 1 1/2X the size of a basketball, emitting a VERY bright blue light but a light that didn't hurt my eyes as I watched it come over the roof to stop about 5 feet above the ground maybe 15 feet in front of me, between the house and where I was standing. It emitted NO NOISE, NO ODOR, and no noticable spinning or other movement---it just hovered there---I then began to think---I believe that all of my mental processes had ceased as I watched it, from complete amazement and captivation, with no fear or any emotion. However, as soon as I began to \"think\" about it, this object went from right in front of me to over the horizon, perhaps 1/2 mile away up the hill I was on, and disappeared. Again, NO NOISE ans NO anything---it just \"left\".  As I ponder what I have seen, the most powerful part of my memory concerns the following: I believe that it would have stayed there in front of me until I began to \"think\" about it, and as soon as my brain kicked into gear, it took off at light-speed+ to get away from me, protect itself or whatever. It could differentiate between observation and analysis---these are just my feelings---no proof of anything, nor any harm done.  I have decided to call it a \"probe\", something sent to gather inormation as I saw how it was hugging the roof-line as though it had a useful \"range\", and I would go farther to guess that what it \"records\" is brain wave activity or something like that---based on it's reaction to my \"discerning\" that it was there.  I'd like to know the answer someday----you never can know for sure!!  Aloha,  ((name and address deleted))  Malulani St. Kaneohe, HI 96744 ((personal data deleted))",
      "link": "http://www.nuforc.org/webreports/050/S50922.html",
      "state": "IL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6461",
      "summary": "On the evening of December 21, 2007, I was driving on Interstate H-1 on the island of Oahu.  The incident occurred at approximately 7:1",
      "city": "honolulu",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "On the evening of December 21, 2007, I was driving on Interstate H-1 on the island of Oahu.  The incident occurred at approximately 7:13 pm Hawaii Standard Time (UTC-10) and I was on my way home after attending a Christmas party at the Pearl Ultralounge.   The night was black, no stars, with light, intermittent rain falling.  As I drove down H-1, there were numerous other cars present when the incident occurred.   I observed in the sky an unusual aircraft flying overhead from the mountains towards the Pacific Ocean with two extremely bright lights (a small white light, and an extremely bright pink light) far too bright to be normal anti-collision lights.  My estimation is that the distance of the object from myself was probably less than five miles.  The object appeared to be operating at an altitude of approximately 1,000 feet above ground level and maintained steady altitude as it headed towards the ocean, flying above what appeared to be the Kalihi area.  During that time, green fireworks were being fired over the city at that time, but the object I observed was by no means the explosion of a firework or a signal flare because it did not suddenly ascend or slowly descend as one might expect of a parachute-retarded flare; rather, the object moved slowly on a level flight path from the mountains to the ocean.   I could not see any distinguishing features on the object, because its lights were so bright.  As I drove down the road, I continued to visually track the object for a period of approximately two minutes, when suddenly the object disappeared completely.  I must emphasize strongly that the object did not \"fade away\" or fly behind a building or mountain causing it to be obscured from view, but rather completely vanished as if one minute it was there, the next minute it was gone. That evening I was completely alert, not fatigued in any way, and I had not consumed any alcoholic beverages.  I am not currently taking any form of medication and I am in good health.   My estimation is at that time of night and level of traffic, many people must have seen the object from H-1.  I was extremely disturbed by what I saw and felt compelled to report it.",
      "link": "http://www.nuforc.org/webreports/060/S60454.html",
      "state": "HI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6573",
      "summary": "My family and I were driving home from the North Shore of Oahu where we spent the day on the beach, I had gotten a new digital camera 7",
      "city": "honolulu",
      "shape": "light",
      "date": "2008-03-31T00:00:00",
      "story": "My family and I were driving home from the North Shore of Oahu where we spent the day on the beach, I had gotten a new digital camera 7.2 mega pixel and I have been using it a lot.   Just to let you guys know this is not the only flying craft I have captured on this camera; I have 3 or 4 other fascinating images taken here on Oahu.  I was born and raised here in Hawaii lived on 3 different Islands etc.  So I think I’m qualified.   Ok nuff of the BS, here is my story, on the way home I started to shoot images out of my passenger side window which was all the way down.  The mountain you see in the background is the tallest mountain on this island elevation around 4,500 ft.  It is on the boarder on the biggest military base on this island. Schofield Barracks.  I believe there is a base inside of that mountain on that base.  I know I’m not crazy, I’m 46 years old been married for 24 years! 3 beautiful children.  I don’t want any fame or money for this. Just dig, dig until you find the reason behind it. I know it is not of this earth.   Aloha, F. Enclosed you will have pics. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  Photos is tiny black speck in the distance.  We do not know what it is, but we cannot certify that it is a genuine UFO.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62204.html",
      "state": "HI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b677b",
      "summary": "Orange light over Hawaii Kai, Honolulu",
      "city": "honolulu",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Orange light over Hawaii Kai, Honolulu Driving east on Lunalilo Home Rd. in Hawaii Kai, Honolulu, I noticed a bright orange light in the sky over Kamehame ridge and Koko Head Crater. It was the same hue of orange as the sodium vapor street lights used in Honolulu, but larger, and much brighter. I thought maybe it was a reflection of the street lights, but after changing my viewing angle in the car several times I confirmed it was not a reflection. It was much higher than the ridge, so it was not a street light. My girlfriend was in the passenger seat, and asked what I was looking at. I said, \"that orange light in the sky.\" And she replied, \"oh the one that just split into two?\"  Indeed, it had split into two. They seemed to be hovering. I couldn't judge the size of the lights, since I couldn't determine how close or far they were. They then merged back into one. The light blinked on and off several times, then disappeared altogether. There were no clouds in the sky at the time, and winds were calm.",
      "link": "http://www.nuforc.org/webreports/063/S63624.html",
      "state": "HI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7954",
      "summary": "One minute sighting of massive football sized sphere about 2000 ft up",
      "city": "honolulu",
      "shape": "sphere",
      "date": "2006-10-30T00:00:00",
      "story": "One minute sighting of massive football sized sphere about 2000 ft up Thursday October 5th at approximately 7:45pm I was out on the back lanai (porch) of the 26th floor of my building putting my dinner dishes to dry in the hot outside air. The cloud formation next to the full moon that night was very unusual so I kept staring at it. It became more solid white and then something lowered through it. The shape of the object was spherical and very massive, about 2000 ft. up.  The sides of the sphere were tall, it was not a flat sphere.  My son was present with me and he became frightened and ran inside. Then as the sphere lowered more over the Ala Wai canal, just a little west of Diamond Head Crater, a green channel of light was extended down from the craft and that channel of light did not touch any of the apartment buildings or the street below. I called son back to see the channel of light and he described the same thing that I saw, that the green channel of light did not touch all the way down.  The object we saw lasted only one minute in the sky above us.",
      "link": "http://www.nuforc.org/webreports/052/S52842.html",
      "state": "HI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a5d",
      "summary": "Strange light over Hawaii doing zig zag. ((News article by Andrew Pereira.))  ((NUFORC Note:  Probably a photo of a contrail.  PD))",
      "city": "honolulu",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Strange light ofer hawaii doing zig zag UFO’s seen over South Shore sky By Andrew Pereira It's hard to draw a surfer's attention away from the next wave, but whatever was in the northwest sky Friday evening around 6:20 p.m. drew a crowd along Kewalo Basin and Ala Moana Beach Park. Honolulu resident Peter Hollingworth described as two lights circling in the sky, about 45 degrees above the horizon. Video of one of the lights was recorded from the Channel 2 SkyCam. \"These two little fireballs with a stream behind it,\" said Hollingworth.  \"Looked kind of like a shooting star, but it just kept going. They changed directions a few times, at first it was coming in then it turned, Then it went out then it came back in again\"  Hollingworth was surfing with his 12 year old son when the unexpected show began. \"I was a little concerned. I told him come over and sit with me - this might be the last surf session we ever have together because this thing's coming straight for Honolulu.  It looked deadly to me it was kind of spooky.\"   So what was it?  The National Weather Service says nothing showed up on their radar at the time of the sighting and the Federal Aviation Administration didn't report anything unusual. The U.S. military conducted a missile defense test off of Kauai Friday evening but the test didn't begin until 7:20 p.m. \"This in a sense is an unidentified flying object,\" said University of Hawaii astronomy professor Gareth Wynn-Williams.  \"It's something in the sky that's moving that we haven't identified.\"  Wynn-Williams believes there's a simple explanation behind the UFO’s. \"It's probably a contrail of some kind,\" he said while watching video of one of the lights at his Kailua home. The professor says contrails are caused by high flying airplanes burning hydrogen based fuels. One of the byproducts of the fuel exhaust is water. \"The air is very cold so the water condenses and forms like drops very quickly and then these drops stay behind the plane until eventually they warm up and they evaporate.\"  Wynn-Williams doubts little green men from Mars are behind the UFO’s. \"Some people just think differently than scientists and they like to look for the fanciest most exciting explanation. Those people would like to think it's little green men, I think that's very unlikely.\"  According to published reports this is not the first time a UFO has grabbed the attention of Hawaii residents. In December of 2004 an unexplained streak of light was captured by a camera on Haleakala moving southwest to northeast. No official explanation has been given for that UFO either. Video on www.khon.com ((NUFORC Note:  We have looked at a still image, taken from the video, and the object appears to us to be a typical contrail.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55065.html",
      "state": "HI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b805e",
      "summary": "I was standing on the shore looking out towards the water when I saw a blue sphere coming toward the shore . It was at about a 45 degr",
      "city": "honolulu",
      "shape": "sphere",
      "date": "2008-10-31T00:00:00",
      "story": "I was standing on the shore looking out towards the water when I saw a blue sphere coming toward the shore . It was at about a 45 degree angle and out around 5 miles or so.  Then it stopped. At this point it was still quite a ways out. Then it moved upward at lightning speed, then stopped. Then it came down at the same speed to its original position. Then it moved downward,paused, then moved back to the same spot. Then  it moved to the left. then back to same spot. Then it moved right. then back to same spot. then it slowly moved away from the shore going back where it came from until I couldn't see it any more.  This is the first time I have ever publicly disclosed this sighting. I knew then  as I know now, It wasn't from this earth. I was 19 yrs old when that happened. I am now 54. I will never forget that night. I even rubbed my eyes in dis-belief a wew times, but it was real. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65515.html",
      "state": "HI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b82e7",
      "summary": "In Hawaii Kai late 80's to early 90's over Kamehame Ridge one flash turns into hundreds and other multiples.",
      "city": "honolulu",
      "shape": "flash",
      "date": "2009-08-05T00:00:00",
      "story": "In Hawaii Kai late 80's to early 90's over Kamehame Ridge one flash turns into hundreds and other multiples. I have seen many things throughout my life, I am shocked no one else mentioned this, it makes me wonder how many people don't say anything.  One thing I remember seeing in my childhood was over the Kamehame Ridge durring the late eighties or very early nineties, I was out side with my mother and our 50 something year old neighbor aound twilight and I remember seeing one light flashing above the ridge then more and more after quite a few showed up the general consensus was that it wasn't anything we have ever seen these lights seemed to be moving everywhere and much to close to be together and they kept multiplying (and Im speaking in the hundreds) and then disappearing into a few they'd flash a different times in almost planned symmetrical shapes in the sky for at least an hour.  Everyone on was out of there houses and on the street heads gazing North at the lights.  It was even mentioned on the news, and when my parents had called the authorities they said nothing unplanned was in the sky in East Honolulu. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71072.html",
      "state": "HI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b8327",
      "summary": "Strange pulsating bright colored lights.",
      "city": "honolulu",
      "shape": "",
      "date": "2009-01-10T00:00:00",
      "story": "Strange pulsating bright colored lights. I was woken up by the brightest light I'd ever seen, yellow, beaming in my bedroom window.  I looked out the window, saw nothing, but everything was lit up like noon, even brighter, and directly overhead, with no sound.  Suddenly the light turned red, then started pulsing different colors, very evenly and rhythmically.   My grand daughter saw it, and my freind (10 miles away also saw it, and said it was directly overhead her, at the same time).   The next morning we all had a hard time remembering it at all, when I think about it, I realize I had NEVER seen lights as bright as this, they were reds, yellows, green, orange, blue. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67096.html",
      "state": "HI",
      "duration": "20 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b38",
      "summary": "Unusually bright, very colorful; pulsating light in the sky,",
      "city": "honolulu",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Unusually bright, very colorful; pulsating light in the sky, We live on the 27th floor of a highrise condominium building.  From my lanai (balcony), I saw an unusually bright, very colorful; pulsating light (noticeably brighter than the brightest star or planet in the normal night sky) above the horizon and between two buildings.  I rushed for my Sanyo Xacti Full HD camera and started handheld filming the object.  I noticed the object had moved to the west (right) slowly but rapidly enough to notice.  Then the object slowed down again and continued on a westerly (right) path. I filmed until the object went behind the building.  I proceeded to get on my motorbike and drove to the park where I knew I would be able to have an unobstructed view of the sky but I could not find the object again.  I checked my  astronomy program and determined that the light could not have been Jupiter as it was already below the horizon at the time I was recording.",
      "link": "http://www.nuforc.org/webreports/072/S72857.html",
      "state": "HI",
      "duration": "5 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b90da",
      "summary": "This happened at the end of Dec. 2009. I am from Honolulu, HI and I live near Diamond Head. It was around 8pm at night when my sister a",
      "city": "honolulu",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "This happened at the end of Dec. 2009. I am from Honolulu, HI and I live near Diamond Head.  It was around 8pm at night when my sister and I decided to go to the grocery store to buy a few things.  As I was about to get into the car, I saw a bright reddish-orange light in the sky moving slowly.  It was a shape of a circle.  My boyfriend was going to go home at that time and was about to leave.  I told him to stop the car and to look at the sky.  I asked him if that was a plane and he told me it was a small airplane.  But, I was thinking that it could not be a plane at all because it was moving too slowly and usually when you see airplanes at night you would see that it would have a blinking light and a sound passing thru.  This bright light I saw didn't have any sound and it was moving too slowly to even be an airplane. It was moving silently in the sky.  Plus, it was a bit cloudy at that time and this thing was flying low underneath the clouds.  My uncle was also out! side and it caught his eye.  We all were looking at it the whole time.  All of a sudden, that reddish-orange light I saw in the sky stopped moving.  Then, I told my boyfriend,\"is it just me because now that light just stopped in the sky and now it looks like a star, but it doesn't even look like a star.\"  Then, my boyfriend told me it wasn't just me, he also saw that thing move earlier and now it just stopped.  My uncle was also amazed. At that time, my sister was loosing her patience and was calling me to get into the car. I continued to look at it for another good five minutes.  It could not be a meteor or a comet.  It could not be a star because it wasn't twinkling at all. My mother also wanted to come to the grocery store and I looked at her and told her about what we were looking at in the sky.  As I was talking to my mother, my uncle yelled, \"wow, it just dissapeared that's really weird.\"  Then, I looked back in the sky and it was really gone. WEIRD! I dunno if it was a UFO an! d maybe it was something else.  Everytime I would tell somebody! about m y experience they would say maybe it was a star, satellite, or a comet. Who knows... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74160.html",
      "state": "HI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b91e9",
      "summary": "Yellow or gold aerodynamic looking object near Hickman AFB at an unknown distance from camera.",
      "city": "honolulu",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "Yellow or gold aerodynamic looking object near Hickman AFB at an unknown distance from camera. While looking south from the USS Arizona Memorial, I noticed occasional military aircraft landing at Hickman AFB.  I decided to take a couple of photos of the aircraft, despite having only a 24-70mm zoom.  Of the three photos I took, one includes an unknown yellow or gold object at an unknown distance.  I didn't see this object until I viewed my photographs one week later.  At the time of the photo, the aircraft did not interact with or chase the object.  Probably didn't see it.  I know I didn't see it at the time.  My first guess is an airborne hat, much close to me than the aircraft.  But, since I can't tell, I thought I would sent along this report. Photo settings: Nikon D700, Nikon 24-70mm 2.8 lens at 70 mm.  F11, 1/1000, ISO 800, 0ev bias.",
      "link": "http://www.nuforc.org/webreports/073/S73428.html",
      "state": "HI",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b971f",
      "summary": "Honolulu Hawaii - Strange Triangle aircraft  preforming maneuvers with short contrails Intersecting each other",
      "city": "honolulu",
      "shape": "triangle",
      "date": "2010-05-12T00:00:00",
      "story": "Honolulu Hawaii - Strange Triangle aircraft  preforming maneuvers with short contrails Intersecting each other 04/19/2010 Location: Honolulu Hawaii - South Shore off of Diamond Head Time: 1500-1530 Craft - Triangles (3)  I watched contrails go up high into sky in unusual flight pattern. This is what caught my attention. I continued to watch at each stoplight as I drove home down Nimitz drive towards Waikiki. I did noticed two contrails following each other in rocket like arc. Then they would cross each other. I got home and looked at object with a pair of binoculars. There were three at this time. Only one came close enough for me to get a good look (about 8 seconds) I could clearly see that the closest object was a very bright silver triangle (could be from the bright sun reflection) the objects left short contrails that were shaped like a snakes tongue. These objects would perform criss cross maneuvers and sudden upward and downward arcs. I watched as a third object began to sort of dogfight with the two others. This was very high in the sky. Way above normal air traffic. After about another 5 minutes they disappeared out of site heading towards Molokai. I took about 10 photos. None are ve! ry good I only can see the contrails. The maneuvers did not seem out of this world. I was watching because they looked to be possibly, my first thought, cloud seeding because of the patterns. I don’t think that was the case because the contrails were so short. I will attach some pictures. Did anyone else notice these strange aircraft?",
      "link": "http://www.nuforc.org/webreports/075/S75128.html",
      "state": "HI",
      "duration": "30 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9878",
      "summary": "we saw a steaking white light flying over the water then it stopped. it looked like a jet was following it, when the jet caught up the",
      "city": "honolulu",
      "shape": "other",
      "date": "2009-08-05T00:00:00",
      "story": "we saw a steaking white light flying over the water then it stopped. it looked like a jet was following it, when the jet caught up the whole craft lit up very bright and the jet took off the other way really fast. the craft hovered there in place for a few more seconds then it took off moving very fast to our right.",
      "link": "http://www.nuforc.org/webreports/071/S71172.html",
      "state": "HI",
      "duration": "about 10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b99e7",
      "summary": "Grey disk flying over Hickam AFB.",
      "city": "honolulu",
      "shape": "disk",
      "date": "2009-04-14T00:00:00",
      "story": "Grey disk flying over Hickam AFB. I was walking from my car to my dorm room on Hickam AFB.  It was a sunny day not a cloud was in the sky.   I happened to look up at an airplane that was maybe 20000 to 30000 feet in the air traveling west to east.  A few moments later while still looking at the airplane, I noticed a disk shaped object traveling perpendicular to the airplane, but at a much lower altitude, perhaps 800 to 1500 feet.   This object passed almost directly overhead and moved in a straight line and level altitude.  My guess is this object was 10 to 20 feet in diameter and grey in color.   I observed this object for maybe 20 seconds before walking inside the dormitory.   I must admit becoming a little scared.   When I returned from lunch I told my supervisor what I saw, he speculated the object was a low altitude satellite. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  We doubt that a \"low altitude satellite\" would be visible during daylight.  We disagree with the assessment apparently made by the supervisor.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69456.html",
      "state": "HI",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b05",
      "summary": "looked like a intensly bright star,brighter than serious the star. Moving very very fast! SCARY!",
      "city": "honolulu",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "Llooked like a intensly bright star,brighter than serious the star. Moving very very fast! SCARY! 4/28/2010  Pauoa Valley Honolulu Hawaii  saw a bright object at about 7:25pm over aloha tower area. it was very high in the sky like a star. But when i google sky mapped it serious was right next to it, but it was twice the brightness of serious and moving waaay faster than any airplane. It also looked like it dropped little stars. It was moving towards diamond head then turned towards the pali. it took 3 to 4 minutes to get from diamond head to disapear behind the pali. very scared.",
      "link": "http://www.nuforc.org/webreports/075/S75232.html",
      "state": "HI",
      "duration": "3 to 4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c48",
      "summary": "I was on the Sandy beach at 0745 and had noticed something flying over me and as I looked I saw that there were 7 sliver spheres half s",
      "city": "honolulu",
      "shape": "sphere",
      "date": "2010-06-03T00:00:00",
      "story": "I was on the Sandy beach at 0745 and had noticed something flying over me and as I looked I saw that there were 7 sliver spheres half seemed small and the other half of the spheres were large,they were vertical to each other.  I couldn't get the size of them but they seemed to be traveling fast I'd say something around 400 hundred miles an hour.but the clouds were going fast from east to west from Molokai to Oahu and the spheres were traveling from north to south.  But then all at the same time and when no clouds were near them they just disappeared then after a few seconds they reappeared and then again gone then very clearly reappeared .  I'd guess altitude was 4to5 k ft,I was 82nd and jumped for years sport jumping as well so I think I know altitudes.then 5 min.1 more came into view and this one was small same direction.then I saw a friend who I told and he didn't say much,then again this time 3 more ,same direction all small then gone into the clouds. I tol! d my friend \"look there 3 of them right there\" but he said he had bad eyes.  just like turning the off switch of there cloaking device twice and then left it on.cool.I can't stop watching the sky.",
      "link": "http://www.nuforc.org/webreports/075/S75589.html",
      "state": "HI",
      "duration": "60 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b9da9",
      "summary": "Colorful U.F.O. spotted near Hawaii International Airport",
      "city": "honolulu",
      "shape": "circle",
      "date": "2009-08-27T00:00:00",
      "story": "Colorful U.F.O. spotted near Hawaii International Airport I work as a Security Officer and have never seen a U.F.O. before.   What I saw was a circular object in the sky approximately 200-250 feet above me.  There were strobe lights on the object.  The colors changed from red, green, yellow, purple, orange, blue.  There was a reddish colored ball hanging from the object.  It was traveling roughly 80-90 miles per hour heading west near Honolulu International Airport, and as you can tell from my description of the colors that were shown in the U.F.O.  This was not an aircraft.",
      "link": "http://www.nuforc.org/webreports/071/S71680.html",
      "state": "HI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba17c",
      "summary": "Bright green light with extreme speed flight pattern over ocean beyond Waikiki, Island of Oahu, 12/06/09",
      "city": "honolulu",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Bright green light with extreme speed flight pattern over ocean beyond Waikiki, Island of Oahu, 12/06/09 From a vantage point on a hillside facing the ocean beyond Waikiki on a clear starry night, I spotted a bright flash of green light at about the same altitude as my line of sight. The location was over the ocean, some distance offshore of what would be considered as the Diamondhead or Waikiki/Honolulu area of Oahu. The green light flashed once, then streaked several miles to the left in a split second, flashed brightly once more, then went dark momentarily and flashed dimly once more before disappearing. I watched the area for 5 more minutes but didn't see another occurrence. Commercial aircraft are always passing through the same airspace as this sighting, and as I watched the area after this sighting there were a number of commercial flights moving slowly across the sky with their characteristic small flashing white lights. The speed, color and movement pattern of man-made craft and UFOs are entirely different and as a former flight student, I would never possibly confuse the two. I have seen the same thing before, from the other side of the island of Oahu, over Kaneohe Bay about 10 years ago. On that occasion there were two of us watching, and we saw the same thing and still talk about it. The green light and flight pattern for that older sighting were much the same as this sighting on 12/06/09, further validating these experiences for me. I checked the local news the next day and found no reports of sightings, but I find it hard to believe that I was the only witness.",
      "link": "http://www.nuforc.org/webreports/073/S73608.html",
      "state": "HI",
      "duration": ".05"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1b3",
      "summary": "A florescent green light moving very rapidly from North to South.  Moving at approximately the speed of a meterite but much larger.",
      "city": "honolulu",
      "shape": "light",
      "date": "2008-07-05T00:00:00",
      "story": "A florescent green light moving very rapidly from North to South.   Moving at approximately the speed of a meteorite but much larger. ((NUFORC Note:  A meteor can be virtually any size.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63880.html",
      "state": "HI",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba2de",
      "summary": "Sightings I will write down everything I remember from that day. It was a Monday, 28th of July.  My daughter & I had errans to run that",
      "city": "honolulu",
      "shape": "cigar",
      "date": "2008-08-12T00:00:00",
      "story": "Sightings I will write down everything I remember from that day.  It was a Monday, 28th of July.  My daughter & I had errans to run that day so we jumped into our Jeep (I had the roof off fully open) as we got to the traffic light a mile from our home, I looked left out to the ocean and noticed the craziest thing, I saw what I call contrails in this instance, not chemtrails.  The trail were in the weireds shapes in the sky, I estimate the 2 craft making the contrails were traveling over mach 3 or faster.  Whe I zoomed in on my compter you cant see the “Jets” in front of the contrail, explain that one? The when I was analyzing one of the photographs I noticed a black cylindracal craft hovering very high above a cumulus cloud that craft could move at the speed of light, in the blink of an eye it would be 10 miles away! I seemed to be observing what was going on, then I spot a domed disc very high above what was happening.  Here is thekicker, before I bought this expensive slr digital nikon 10.75 megapixel, I have b een getting photos of crafts in myneighborhood almost weekly. I was  writing to try to get in touch with the lady from Kaneohe, Hi, who had been going through the same thing for some time. I would like to meet wit h her or talk on the phone first. She reported out of Hawaii on 3/4/08 she left no email or phone and she is looking for partners who are experiencing the same things.   Sincerely, ((name and e-address deleted))  give this to her!   Aloha,  F ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64873.html",
      "state": "HI",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba585",
      "summary": "blueish greenish ball of light",
      "city": "honolulu",
      "shape": "sphere",
      "date": "2009-05-12T00:00:00",
      "story": "blueish greenish ball of light It was a blueish greenish ball with a light yellowish tail.  It was falling from the sky and then disappeared.  I was in my mom's apartment on Alexander St. in Honolulu looking out the sliding glass door towards Kaimuki and it suddenly appeared.  No one else saw it because it was too quick when I told my son to look it disappeared.  She lives right next to the freeway and I'm wondering if anyone else saw it.  It was awesome!!",
      "link": "http://www.nuforc.org/webreports/069/S69935.html",
      "state": "HI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba69c",
      "summary": "Army  Blackhawk chases UFO over honolulu 10/23/08 9:15 pm",
      "city": "honolulu",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Army  Blackhawk chases UFO over honolulu 10/23/08 9:15 pm I was driving my wife home on my moped and we stopped at a stop light, i heard a black hawk helicopter flying over head so i looked up to the sky, i am a 10 year veteran of the U.S. Army and am Air Assault qualified so i know what i am looking at. What i saw was a U.S Army Blackhawk chasing a ball of light that flew in a pattern that no aircraft i know of could fly in at speeds that no other craft i know of could match. sometimes it would go fast, then it would slow down so the copter could get closer, then it would shoot out again. Later that night i heard jet engines flying over Honolulu for about 2 hours, they have a distinct sound to them.",
      "link": "http://www.nuforc.org/webreports/066/S66446.html",
      "state": "HI",
      "duration": "60 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3bb183",
      "summary": "Vertical Falling Object disappears in a flash 100 ft above ground near Boat Harbor in Honolulu Hawaii.",
      "city": "honolulu",
      "shape": "flash",
      "date": "2011-01-05T00:00:00",
      "story": "Vertical Falling Object disappears in a flash 100 ft above ground near Boat Harbor in Honolulu Hawaii. ALA WAI HARBOR xxxx Ala Moana Blvd. Honolulu Hawaii  Sitting on the bed of my truck with my friend at his boat slip. Two other neighboring men were hanging out on their boat.  We all looked up and saw something falling vertically fast, but no flames or fire like a meteor.  Object had a com trail.  Object fell right behind one of the major hotel buildings on Ala Moana Blvd when it flashed twice about 100 ft above ground.  This flash seemed to be a double flash and very bright blue/white lit up the sky.  No sound of impact or crowd craziness occurred. We all looked at one another and asked if we all saw the same thing.  There were no sounds when the object flashed. The object was grey metallic like naval ships.  Must of been 20'w x 40'h x 40'l approx. in size.  I saw com trail was more vapor-like than smoke; almost like moisture or steam. It disappeared quick in 10 seconds. The flash was amazing.  Haven't seen colors of blue like that in lightning. The object had structure but not like an airplane falling downward.  It was more squared with a noticeable corner extending off to one side.  The travel distance downward was five times that of the height of the Hotel next to the Harbor. I know people may have sen it who were near the street but who looks directly upward that fast.  Three seconds from trail to flash and 5-10 seconds of vapor trail evaporating.  Cars below would have missed it since it was directly above.  Cars in traffic must have seen it flash. I think our position at the harbor was the best vantage point to see the object falling vertically.  It was hard not to notice something that big on a vertical fall. My initial response was a falling star burning up, but the grey shape of the object didn't fit in my mind as a non-burning falling star.  So I googled this site to write it all down and let it go. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  We have assigned an arbitrary date, until we hear back from the source.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79219.html",
      "state": "HI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5d8",
      "summary": "Fast Moving Object Circles Diamond Head Crater Honolulu Hawaii",
      "city": "honolulu",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "Fast Moving Object Circles Diamond Head Crater Honolulu Hawaii I just witnessed a large object flying circles around Diamond Head Crater.  White and blue color. Pulsating light was white. Lasted for five minutes.  I saw it do two fly by circles around the crater hill where we walk up.  Fast moving, I could hear the air turbulence but not an engine sound.  Low level, not airplane.  Heliocopter like size with no rotors, no jet engine.  Moved really fast and low 300 ft. above sea level.  Didn't come around again after 2nd turn.  Early surfers saw it too. Military? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79434.html",
      "state": "HI",
      "duration": "five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfb2",
      "summary": "Over the last two nights there has beena strange light over Diamonhead that will appear again tomorrow December 19 2011.",
      "city": "honolulu",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "Over the last two nights there has beena strange light over Diamonhead that will appear again tomorrow December 19 2011. On December 17&18 several of us here in Hawaii watched a strange light hovering above diamondhead just to the East at about 50 degreesffthe ocean. This light has appeared for the last 2 nights at 6:30 and ending around 7:48 pm.Last night the light was first noticed around 6:30 pm. The light grew brighter as the sky darkened and eventually started pulsating to every color inthe rainbow every  2 seconds then turning dark yellow with this red stuff seemingly dripping from the bottom.Then it began to fade and abruptly disappeared at 7:48pm. That was nothing compared to what happened tonight. The light promptly appeared at 6:30 pm slightly higher than where it was last night.As the sun  went down the light began to grow very bright with these pointed rays coming out of it looking like a star that goes on top of a christmas tree.  This light was lighting up the night sky.  The light began moving west toward ala  Moana then disappearing far out to sea off Barber's Point a! t again 7:48 pm.I am absolutely sure the same phenomena wil occur again tomorrow at 6:30 pm ending at precisely 6:30 pm ending at 7:48 pm.Watch the sky-It WILL happen tomorrow.",
      "link": "http://www.nuforc.org/webreports/085/S85943.html",
      "state": "HI",
      "duration": "78 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfb3",
      "summary": "Strange light off Diamondhead",
      "city": "honolulu",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "Strange light off Diamondhead On December17th I noticed a strange light high high above Diamondhead out to sea about 10 miles.I live directly behind Diamondhead on Oahu Hawaii on a ridge called Waialae Iki.I noticed the light  about 6:15 pm while the sky was still very bright.As it grew darker the light began to pulsate turning every color in the rainbow  evrey 2 seconds, red, green,blue,yellow,-red,green,blue,yellow.We then watched this pulsating lightslowly turn to a dark yellow with this red stuff seemingly dripping from it.We watched this through my telescope as well as the naked eye.Then abruptly at 7:48 pm it disappeared.-That was nothing compared to what happened the following night,Dec.18.The light again appeared very early about 6:12 very light out with no other stars in sight.As we watched the light we noticed that tonight it was very yellow in color-different from the previous night. as it grew darker the light became more and more intense with these spear-like projections com! ing off of it geometrically or 1 or 2 at a time up to 14 or 18 \"spears\" It was beautiful!It resmbled the star you put on top of your Christmas tree.My wife could see it from Ala Moana about 5 miles awy from me.she said \"It looksnlike a spider.\"The beautiful light then began to turn a dark yellow then red eventually drifting low over the ocean and disappearing off Baraber's Pointat 8:05 pm.December 19-The light again appeared at 6:15 pm.Using a Sony videocam with 42x lense I the beautiful pulsating lights with all the colors and rays as the past few nights sometimes resembling a snowflakeuntil 8:15 when it evntually turned into a red dot and disappeared far out to sea off Barber's Point.December 21-The solstice?Tonight, while waiting for the light it appeared out of nowhere about 60 degrees in the sky stright off of Diamondhead.It then did much of the same beautiful things in the sky that it has done in the last few days.I do not know if this is a U.F.O. a star, sattelite or! what? Can anyone explain what we are seeing?",
      "link": "http://www.nuforc.org/webreports/085/S85990.html",
      "state": "HI",
      "duration": "78 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc804",
      "summary": "Extremely fast green light seen zooming over Honolulu in a south to north direction.  ((NUFORC Note:  Possible meteor??  PD))",
      "city": "honolulu",
      "shape": "unknown",
      "date": "2011-08-21T00:00:00",
      "story": "Extremely fast green light seen zooming over Honolulu in a south to north direction Around ~2100 while at Point Panic after a dive, this green light which seemed to also have a glow around it shot across the sky extremely fast, going roughly in the direction of south to north.   This would be right around the Ward Centre in Honolulu. ((NUFORC Note:  Possible meteor??  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83049.html",
      "state": "HI",
      "duration": "5 Seconds?"
    },
    {
      "_id": "64d005f478aba2ec5a3bc832",
      "summary": "Orange lights above kaimuki hawaii.",
      "city": "honolulu",
      "shape": "light",
      "date": "2011-10-25T00:00:00",
      "story": "Orange lights above kaimuki, hawaii. The first one we saw two orange/reddish lights above kaimuki.  the vantage point was on 11th ave, on the side of the hill that is on the road going up the mountain.  it was looking over my apartment building face south towards Diamond head and waikiki.  The light was trailing east towards diamond head. It looked like it was heading towards us and I called out to my friend to look at what i was looking at.   Once we both were looking at it, it came to a stop and just hovered.  it would jump from moving east to hover to moving east again.   When it started to move east we noticed another light of the same color but dimmer.  That second light never moved and just hovered.  The second light dimmed out to nothing and the first light eventually started to dim out too.  The light of the first one was very intense and strong enough to produce strong rays to my eyes! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84773.html",
      "state": "HI",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc88b",
      "summary": "Two silver triangular craft performing extreme nautical maneuvers in unison high in the air in a blue cloudless sky.",
      "city": "honolulu",
      "shape": "triangle",
      "date": "2011-10-19T00:00:00",
      "story": "Two silver triangular craft performing extreme nautical maneuvers in unison high in the air in a blue cloudless sky. I left my house at about 10:00 a.m., on my way to pick up a friend. Recently there have been (more than usual) very loud military aircraft flying overhead, and I heard one.  I stopped on the walkway to see what kind of plane it was, and saw a jet, a military F-15 or something (small 1 or 2 man plane), flying loudly from right to left.  It had probably just taken off from Hickam AFB.  It flew out of sight, and I looked at the sky to see if there were any more, though I didn’t hear any. Then I saw something kind of sparkling and thought it was another one, only this time much higher in the sky. I watched it and could see that there were two seemingly identical but separate objects, flying together in exact and tight formation, both bright shiny silvery and thin triangular/arrowhead shaped, and flying very fast and very high in tight, eccentric circular movements. I first thought they might be two birds flying together, but they were so high up and so large that they would have had to be giant pterodactyls or some other mythical giant silver birds. No, they were definitely not birds. I watched them for about two minutes and they could not have been military jets, as no aircraft I had ever seen or heard of could perform such maneuvers at those heights and speeds. I kind of waved my hands in front of my eyes to make sure I wasn't seeing things and was sure that I wasn't hallucinating or delusional. I  was, however, a bit startled. I had not been drinking or taking drugs. I went back into the house, as I had forgotten to take an item with me. When I returned to the walkway, they were gone or out of sight. I am currently retired after working the past 26 years as a medical transcriptionist. I had never previously seen a UFO.",
      "link": "http://www.nuforc.org/webreports/084/S84547.html",
      "state": "HI",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8c4",
      "summary": "Cylinder hovering over honolulu zoo/waikiki",
      "city": "honolulu",
      "shape": "cylinder",
      "date": "2011-10-25T00:00:00",
      "story": "Cylinder hovering over honolulu zoo/waikiki I saw with a friend i was driving with. it was funny cause I saw this right after another ufo incident i saw the night before.  The one we saw was a black pod like ufo that was cylindrical in shape and it was black. It just hovered over the honolulu zoo. This was also seen by another friend on kapahulu that was around the same area.  He said that he saw it as a black cylinder/circle once it got over his head and it was right above him.  he also said he saw a type of antenna on it.  It is odd that these sightings are happening right when they are preparing for APEC here. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84772.html",
      "state": "HI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8d2",
      "summary": "bright, fast moving orb over ala moana beach park.  ((NUFORC Note:  Overflight of ISS at 05:55 hrs., on this date.  PD))",
      "city": "honolulu",
      "shape": "sphere",
      "date": "2011-08-21T00:00:00",
      "story": "Bright, fast moving orb over ala moana beach park At approximately 5:55 am HST, right before i went out surfing in the morning, i looked up and witnessed somewhat of an orb moving fast over me. It was really high in altitude, much higher than any plane yet at that high above, it must have been really HUGE and it was moving fast.  I called over 2 of my friends and yelled out to look above just to see what i was witnessing. What we saw didnt make any noise, it was moving really fast; faster than any plane or satellite, and the kicker was that it traveled horizontally like a plane and THEN it went diagonally up to the stars to the point were it looked like a far and distant star/planet.   We watched this thing for about a couple of minutes till it disappeared not over the horizon like any man made machine but high above us at a 45 degree angle.  There were no blinking lights like a plane and wasnt shaped like one either. ((NUFORC Note:  Overflight of ISS at 05:55 hrs., on this date.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83126.html",
      "state": "HI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc18",
      "summary": "Orange/white light appears in sky over Waikiki moving erratically at very high altitude, stationary stars in background.",
      "city": "honolulu",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Orange/white light appears in sky over Waikiki moving erratically at very high altitude, stationary stars in background. Sitting on balcony 26 floors up at Rainbow Tower, Hilton Hawaiian Village, gazing at the last few planes departing Hawaii, and looking up at stars.  Saw object that seemed very high up moving across sky.  Immediately assumed it was a satelite due to its seemingly unusually high altitude.  Then it started to jump around sporadically in all directions.  I watched for about a minute or two, then quickly went in hotel room to grab my camera.   After fully zooming, it took me about 20 seconds to get object in field of view, and when i did I recorded this movement for about 2 1/2 minjutes or so.  I yelled at my wife who was sleeping and told her to get up as I beleive I was seeing a UFO.  Just after she got to balcony significant cloud cover interfered with real time viewing.   I proceeded to download video onto my computer, and after several viewings I started to look for anything else in background that might be stationary, and fortunately located three stars that are much further away, of course, and they remain relatively stationary in video whikle thius object moves all over the screen, proving that the movement was not the resuklt of cmaera shake.",
      "link": "http://www.nuforc.org/webreports/092/S92729.html",
      "state": "HI",
      "duration": "5 minutes til cloud cover"
    },
    {
      "_id": "64d005f478aba2ec5a3bddc9",
      "summary": "A light appeared within a stationary cloud, finally going out and the cloud dissipated rapidly.",
      "city": "honolulu",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "A light appeared within a stationary cloud, finally going out and the cloud dissipated rapidly. I have two floor-to-ceiling windows in the bedroom that I keep the curtains pulled backto enjoy the city-scape lights a night. Looking out the window while sitting in the bed about 11PM, I saw a little cloud about 1/2 - 1 mile away.  It appeared to be shaped like the state of Virginia.... With the Spring winds blowing from the Northeast, oddly it was completly still about 100 - 200 ft higher than I am on the 30th floor. It was located just South of Punchbowl crater, out over the city.  After I noticed it wasn't moving in the winds, I began to study its shape from the reflected light of the city streets below......then a light appeared in the cloud, like you see when an airplane is letting down thru clouds at night with the landing light on.  First the light was fuzzy inside the cloud then, the light became a bright peachy-orange color... like it broke out of the cloud... I was trying to adjust my eyes to make sure it really wasn't a plane…  The light became! clear and brighter, in a full circle/ball shape, about center of the cloud. It was a stable light, not flickering like a burning flare appears.  Then the round light went back into the cloud with about half the round shape visible/hanging out of bottom of the cloud, bright on the bottom and diffused in the cloud.  Suddenly the light just went out.  From the lights of the city, the little cloud was still visible with a black, perfectly round hole in it.  The little cloud didn't just drift off, it quickly faded away without moving.... odd, considering the strong, gusty wind that night. I wish I had taken a picture/video, but I was fixed on the activity!!!",
      "link": "http://www.nuforc.org/webreports/088/S88533.html",
      "state": "HI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be5d3",
      "summary": "Flying Cylinder moving in broad daylight from West to East.",
      "city": "honolulu",
      "shape": "cylinder",
      "date": "2012-04-18T00:00:00",
      "story": "Flying Cylinder moving in broad daylight from West to East. Standing on Waikiki beach midafternoon on a Sunday.  A moderatly moving cylinder-shaped object moved from West to East at about 1000 ft. up and about 1/2 mile away over the ocean.  That altitude and distance makes it difficult to approximate a size, but my guess is about 5ft in diameter and 30ft long.  The wind was very strong that day at about 15-20 knts, from the Northeast.  At first I thought it was a balloon on its side, but it was not bouncing vertically in the gusty wind.  It was quiet.  It was moving smoothly due West, against a quartering headwind that was gusty and strong.  With the West sun shining directly on it, it reminded me of a white hotwater heater flying horizontally, on its longside, with the end of it pointing toward the beach. It continued till it came about even with Diamond Head crater, in the distance.  It appeared to stop, against the strong winds.  Then, it moved toward Diamondhead without turning.  It moved Northward with the narrow end of the cylinder leading the way.  It stopped close to Diamondhead for less than a minute, then continued West, flying broadside again.  Finally, Diamond head blocked my view of it. The flight path normally used was clear of airliners that day.  Due to the strong Northerly winds, the airliners were much farther South, landing to the North.",
      "link": "http://www.nuforc.org/webreports/087/S87872.html",
      "state": "HI",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beed2",
      "summary": "Bright  fireball steaking over Waikiki.",
      "city": "honolulu",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "Bright  fireball steaking over Waikiki Just saw a fireball streak low over Waikiki. Was white with a yellow firey long tail. I lost sight of it due to the tall hotels, it was heading out over the ocean.  It was super bright!",
      "link": "http://www.nuforc.org/webreports/096/S96739.html",
      "state": "HI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7ca",
      "summary": "Jellyfish-like objects sighted above Honolulu sky.",
      "city": "honolulu",
      "shape": "other",
      "date": "2013-06-02T00:00:00",
      "story": "Jellyfish-like objects sighted above Honolulu sky. Jellyfish like objects were observed just above the Honolulu skyline.  There were about 10 of them ranging from blue, green, and red in color.  They propelled themselves in the same manner as a jellyfish would swimming through the water.",
      "link": "http://www.nuforc.org/webreports/097/S97809.html",
      "state": "HI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf902",
      "summary": "Grey roundish object illuminating in the sky near diamond head, honolulu",
      "city": "honolulu",
      "shape": "egg",
      "date": "2013-06-02T00:00:00",
      "story": "Grey roundish object illuminating in the sky near diamond head, honolulu I have seen rounded object, kind of shiny in the sky.  I was standing on the street of East Oahu, looking towards diamond head.  Object was right side of diamond head.  First I thought it was helicopter or plane, but WHOLE object got illuminated with white light.  It was moving away from me.  At first, slowly with  no sound, and all of sudden  it just vanished.  This is second time I have seen this kind of illuminating/ sometimes beams curved grey object around same area at same time.  ( My first siting was last year in this area. )",
      "link": "http://www.nuforc.org/webreports/098/S98048.html",
      "state": "HI",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfda8",
      "summary": "REALLY FAST GREEN CIRCULAR LIGHT IN THE SKY.",
      "city": "honolulu",
      "shape": "circle",
      "date": "2012-12-20T00:00:00",
      "story": "REALLY FAST GREEN CIRCULAR LIGHT IN THE SKY   Green orb moving really fast in the sky east to southwest Saw it from the Ala Moana parking lot as I was getting into my car. Disappeared behind a building, so I only saw it really quick. But, I saw it long enough to know that it was too big and too fast to be a plane. Looked pretty high up but still, it was huge.  It was BRIGHT green and moving in a straight line.  No flashes, just one steady light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94778.html",
      "state": "HI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bff26",
      "summary": "Fireball object in downtown Honolulu that changed direction and hovered.",
      "city": "honolulu",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "Fireball object in downtown Honolulu that changed direction and hovered. It moved from north to south, then stopped.  Held position for a number of seconds (I didn't count but long enough for me to walk across the street and up the sidewalk).  I really thought it was something on fire and coming down until it stopped.   I kept staring at it and then it went in reverse and raised up.  It stopped again before going higher and I lost sight of it behind the clouds. I live in downtown Honolulu, the Ala Moana hotel is directly across the road from my apartment, the object was hovering at the level 3/4 from the top of the hotel.   I don't know a floor level or anything. But it was quite odd.",
      "link": "http://www.nuforc.org/webreports/095/S95741.html",
      "state": "HI",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0589",
      "summary": "Coned shaped with 3 lights above Koko Head Goes directly over our car.",
      "city": "honolulu",
      "shape": "cone",
      "date": "2012-12-20T00:00:00",
      "story": "Coned shaped with 3 lights above Koko Head Goes directly over our car. On the night of 12-08-12 at 6:45 pm just after dark. My son and I we’re taking a drive in my girlfriends new car.  We had the sunroof open and the windows down.  We we’re headed toward Hawaii Kai from Waimanalo.  We had just passed the entrance to Sandy Beach and almost to the first turn when 3 lights came over Koko Head.  I was already driving slower than usual approximately 25mph. We both saw it at the same time and my 10 year old son said, Dad What is that?  I said I have no clue. At first you could only see 3 lights.  The one on top was orange/red and flicking rapidly.  The 2 on the bottom we’re light color with a hint of blue and constant.  The whole thing was moving really slow and looked to be just above the hill but under the cloud cover.  It went directly over our car and we could see it through the sunroof.  As it passed over it was completely silent.  At that time My son said, Dad it looks coned shaped.  I tried to keep watching it and drive at the same time through the review mirror.  I told my son to keep watching it, so he turned around and was watching it through the back window when he said WOW!  It just disappeared.  This is my first time seeing any kind of UFO.  I spoke to one of my close friends who frequent the area at night for his job and he said 3 of them saw the same thing 1 month ago from the time we saw it ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95121.html",
      "state": "HI",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0962",
      "summary": "Two circular lights seen in a clear sky around 18:15pm when driving Hawaii Kai bound on Kalanainanaole Highway in Honolulu tonight",
      "city": "honolulu",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "Two circular lights seen in a clear sky around 18:15pm when driving Hawaii Kai bound on Kalanainanaole Highway in Honolulu tonight Driving Hawaii Kai bound onto the Kalanianaole Highway merge on ramp from Kahala, I saw two circular lights in the sky.   I initially thought were lights of an airplane, but then quickly realized they were too big to be lights for an airplane.  The trees of the Waialae Golf course blocked my view while I was stuck in traffic and when I finally got a clear view of the sky, the lights were no where to be seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107625.html",
      "state": "HI",
      "duration": "<2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a6c",
      "summary": "Lightning without thunder and flickering that lightens the black sky to blue.",
      "city": "honolulu",
      "shape": "flash",
      "date": "2013-11-11T00:00:00",
      "story": "Lightning wtihout thunder and flickering that lightens the black sky to blue. This morning I woke up about an hour before sunrise, to see what appeared to be something similar to lightning without thunder.  Looking Southwest from Waikiki, at about 19.5 degrees above the horizon, in hazy clouds, an extremely bright light would flash, and light up everything as if a full Moon were out.  This was briefly preceded by some dimmer, flickering that lightened the entire black sky to blue. Honolulu International Airport began service and the first airliner took off Southward along the shoreline then headed East as the lights continued their routine.  The next jet took off following the same flight path, but stopped short just before arriving to the cloud with the light, then circled back to the airport.  Then another jet took off, went to the cloud, and circled back to land, as well.  The lights continued, and finally three more planes took off, one of them a commercial airliner, the other two smaller, propeller planes, all headed on the same path East as the first plane.  The lights continued until the morning sky just turned from black to blue.",
      "link": "http://www.nuforc.org/webreports/103/S103654.html",
      "state": "HI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e8b",
      "summary": "Small red light, first stationery then in fast motion over Waikiki observed from Ala Wai harbor.",
      "city": "honolulu",
      "shape": "light",
      "date": "2014-01-30T00:00:00",
      "story": "Small red light, first stationery then in fast motion over Waikiki observed from Ala Wai harbor A very small object with a red, green and white light was observed southwest from the Ala Wai harbor.  It remained stationery for 3-4 minutes, then suddenly moved to the east at a very high speed.  The object moved must faster than a helicopter, airplane or drone at the distance it was observed.",
      "link": "http://www.nuforc.org/webreports/106/S106633.html",
      "state": "HI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1076",
      "summary": "See above.  ((NUFORC Note:  The photos of interest show tiny, blurry objects.  We suspect they are birds in flight.  PD))",
      "city": "honolulu",
      "shape": "cigar",
      "date": "2014-01-24T00:00:00",
      "story": "See above. The object was caught on my camera while taking pictures of a rainbow off the eastern end of Oahu, Hawaii at exactly 17:05:54 on Sunday, 1/19/14.  The camera used is a Sony NEX6 16mp with a 50mm lens that has a crop factor of 1.5X.  Thus the lens is really 75mm. I shot the picture with an apeture of f8. Below are highlights of my observation:   1.  A previous shot taken at 17:05:50 does not have the object; neither does a shot right after at 17:06:01...so it appears the object covered almost 3/4 through the view in 4 seconds or less and disappeared from the view in 7 seconds or less. 2.  The object in sight seems to be much larger than the boat shown in the picture to bottom left of the rainbow. 3.  I did not hear any loud jet/helicopter sound, noise nor see it while taking pictures. I only noticed afterward while reviewing the pictures that night (last night). 4.  I took the shots on the ridge above the famous Hanauma Bay, Oahu Hawaii. The area on Google Map is Portlock Hawaii. 5.  Distance from where I took the shot to the rainbow my guess is perhaps around 2-4 miles away. Pictures to follow... ((NUFORC Note:  The photos of interest show tiny, blurry objects.  We suspect they are birds in flight.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106504.html",
      "state": "HI",
      "duration": "10 seconds or less"
    },
    {
      "_id": "64d005f478aba2ec5a3c1457",
      "summary": "Orbs dropping larger orbs into the ocean.",
      "city": "honolulu",
      "shape": "sphere",
      "date": "2013-12-05T00:00:00",
      "story": "Orbs dropping larger orbs into the ocean. Thursday, November 21st, 2013 Sandy Beach, Oahu, Hawaii   Sometime between 11am and noon local time, my son and I were walking along Sandy Beach watching the bodysurfers when my son yelled, “Whoa, did you see that?”  I did not see anything while we were on the beach but my son, who is 13, was quite impressed with what he witnessed.  Below is his story in his own words:  “We were watching the bodysurfers surfing the waves.  I was standing near this big rock right by the ocean, looking out over the horizon when I saw an orb that was bright white, almost like a florescent light bulb but sphere shaped.  The orb was about as big as a grapefruit.  It had come from thin air, going very fast but slowed to a halted hover in a very small space.   As soon as it slowed, it dropped an orb that looked the same as the other one but just bigger, like a soccer ball.  The bigger orb dropped in the water and made a small splash.  The small orb hovering in the air flew off and disappeared in a flash, literally.   I looked down at the water where the orb had fallen but there was nothing there even though I saw a little splash.   I looked in the sky again to see if there were more orbs.  I scanned the horizon and saw more of these occurrences but they were further away.  The first sighting was very fast, probably two and a half to three seconds long.  The other sightings lasted longer because the orbs traveled further than my first sighting.   Then, after the last orb (the fifth or sixth one) dropped its load of a larger orb, the orbs all vanished. “",
      "link": "http://www.nuforc.org/webreports/105/S105067.html",
      "state": "HI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c175f",
      "summary": "Thought it was a shooting star until it zig-zagged before disappearing",
      "city": "honolulu",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "Thought it was a shooting star until it zig-zagged before disappearing on the 7th of May, 2014, i was sleeping on the back lanai looking up at the sky searching got shooting stars.  I noticed one start flying from out of nowhere, it began flying in a straight line which is what made me think it was a shooting star, but then it started zig-zagging from left to right before it disappeared.  It was only a small orange dot in the sky but it was flying faster than any plane I've ever seen.   A few nights later I downloaded the sky map app from the android app store to see which way they were going, if the planets don't change position a lot over a few days then that means they were headed to neptune.",
      "link": "http://www.nuforc.org/webreports/109/S109312.html",
      "state": "HI",
      "duration": "2-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c183a",
      "summary": "Two craft seen by diamond head/kahala honolulu",
      "city": "honolulu",
      "shape": "unknown",
      "date": "2014-06-04T00:00:00",
      "story": "Two craft seen by diamond head/kahala honolulu On Friday night of May 16, 2014, I was looking out my bedroom window over diamond head.  I noticed two objects in the sky that appeared to be moving closer.  However, one craft moved in line with the first one and stayed stationary for a over a minute.  I ran outside to call my dad who also witnessed the event.  As we went to reach for our cameras to document the evidence.   The two craft moved backwards very slowly until they could not be seen anymore.  It was weird because they were not planes and the craft seemed to have no directionality in their movement, except when they retracted and moved off.   The shape of the crafts, as I assume they were, appeared to be a in a triangular almost dome shape.  The top and sides where clearly illuminated in a bright red, almost the color of a red stop light.  The bottom of the crafts, had no illumination.   There were no sounds emitted, nor where there any sudden fast movements.  It almost was as if, they appeared out of nowhere and then moved away.",
      "link": "http://www.nuforc.org/webreports/109/S109516.html",
      "state": "HI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ecc",
      "summary": "Multiple flying pictures found in graduation photos.",
      "city": "honolulu",
      "shape": "cone",
      "date": "2014-06-04T00:00:00",
      "story": "Multiple flying pictures found in graduation photos. My wife took some graduation pictures today and we were looking at the snap shot and we found a craft in the second photo.   I'm writing this only because we have been seeing too much ufos and it's tripping my family out.",
      "link": "http://www.nuforc.org/webreports/109/S109810.html",
      "state": "HI",
      "duration": "found on picture"
    },
    {
      "_id": "64d005f478aba2ec5a3c205a",
      "summary": "Smart Phone captures strange circular object in the sky.  ((NUFORC Note:  Possible decal on windshield??  PD))",
      "city": "honolulu",
      "shape": "disk",
      "date": "2014-06-13T00:00:00",
      "story": "Smart Phone captures strange circular object in the sky Yesterday morning around 5:50 am on my to work at Kahala Mall In Honolulu Hawaii, I took a picture of the sun rise and what was in my picture has left me just about speechless.   I did not even notice the object while driving however when looking through the photos this morning I noticed what you will see here. Thank for your time let me know if you have any questions or have any idea what that may be. ((NUFORC Note:  Possible decal on windshield, we believe.  We have invited the source of the photo to check for an emblem or decal on the glass.  Printing seems to be evident in the middle of the decal, we observe.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110186.html",
      "state": "HI",
      "duration": "split second"
    },
    {
      "_id": "64d005f478aba2ec5a3c2116",
      "summary": "Red light with bluish green light around it. Moving unlike any aircraft we have. Changed colors. No sound and hovered very low in kalih",
      "city": "honolulu",
      "shape": "changing",
      "date": "2014-05-08T00:00:00",
      "story": "Red light with bluish green light around it.  Moving unlike any aircraft we have.   Changed colors.  No sound and hovered very low in kalihi valley. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109214.html",
      "state": "HI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c21df",
      "summary": "My First UFO Sighting?",
      "city": "honolulu",
      "shape": "other",
      "date": "2014-05-02T00:00:00",
      "story": "My First UFO Sighting ? I was driving along Sand Island Parkway this late afternoon when I heard and saw 2 fighter aircraft took off from Honolulu International Airport.  The timing was a little unusual for USAF daily training take-off.   After a gradual ascent, the first fighter aircraft took a steep climb.  The second fighter aircraft came along and did the same thing and I follow the direction of their path.   It was then when I saw two white crescent UFOs flying one after another into a group of cotton clouds.   I stood and waited for 15 minutes for the UFO to exit from the other side of the clouds but it never did.",
      "link": "http://www.nuforc.org/webreports/109/S109083.html",
      "state": "HI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2871",
      "summary": "Blue and Red lights flying erratically in the air over Tantalus.",
      "city": "honolulu",
      "shape": "light",
      "date": "2014-10-10T00:00:00",
      "story": "Blue and Red lights flying erratically in the air over Tantalus I'm a Security Officer, and have been working Security for 6 years now. It happened while I was on duty and preparing to do my last patrol of the shift before ending. At approximately 0025hrs(12:25am), I observed a blue and red light flying over the Ko'olau Mountains near Tantalus/roundtop drive.  My first thought was that it was a plane coming over the mountain, but I quickly ruled that out when it changed course, moving slightly to my left.  It was much to sudden to be a plane, so the next thing I thought was a helicopter, which was quickly ruled out soon after when I observed the lights make a sudden change and begun to fly in a zig zagging kind of path in the sky, and not to mention that there was no sound of helicopter blades chopping through the air at all. Upon that sudden course of action it conducted I was most certainly interested now.  I continued to monitor the lights and even repositioned myself on the property to try to get a better view and continue to observe it's strange and erratic movements.  It then proceeded to appear to descend towards the ground where I could no longer observe as my vision was obstructed by trees and structures.  It's movements were like someone pointing a laser pointer and moving it all over the place except much more controlled and not as fast, but faster and able to do things that a plane or helicopter could do. Shortly there after it's descent out of my view, my Supervisor shows up at my site to check up on me as usual during my shift, and almost soon after he arrived the thing shot back into the air and proceeded to fly erratically as before, I quickly pointed it out and even he was baffled by it and we both continued to watch it until it descended again to the ground where we couldn't see.  My Supervisor is a former U.S. Marine and he said he had never seen any aircraft do things like that, not even a remote controlled device. I know what I was thinking when we watched it, but I waited to hear him say it first. \"I think we just observed an Unidentified Flying Object\".  We ruled out cars that might have been on the road on the mountain as we both saw the object fly high enough that we could see there was space between the outline of the mountain and the lights, so it was definitely in the air. We saw it shoot straight up suddenly and we thought it was gonna zip away, but it hovered for about 5 seconds before shooting back down towards the ground where we couldn't see it.  And that was the last we saw it. Immediately after my shift at 0100hrs I got in my car and drove up to the Military Cemetary at Punch bowl to try to get a better view. Once up there I saw a group of 4 young people hanging out overlooking the area where my workplace is and so I asked them if they saw it, if they saw the lights. One of them, a girl, admitted to seeing a red light shoot up from the corner of her eye not long before I arrived.  And that was the last time I saw it, I waited for about 15 minutes more to see if it would return, but it didn't.",
      "link": "http://www.nuforc.org/webreports/114/S114231.html",
      "state": "HI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c28de",
      "summary": "In Waikiki, two separate bright green lights 100 feet off ground, moving at great speed toward ground.",
      "city": "honolulu",
      "shape": "light",
      "date": "2014-11-14T00:00:00",
      "story": "In Waikiki, two separate bright green lights 100 feet off ground, moving at great speed toward ground. Walking toward Waikiki Beach from Kuhio on Seaside, a friend and I observed two bright green lights moving sharply toward the ground.  Their movement made it evident that they were unconnected.  The lights looked to be individual craft, moving at a decreasing angle 100 feet over the ground, with great speed.  They were about 200 yards from us, and disappeared behind a building.",
      "link": "http://www.nuforc.org/webreports/115/S115210.html",
      "state": "HI",
      "duration": "6-8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2946",
      "summary": "Bright blue triangular outline, oscillating yellow/orange/green lights along the outline over NE skies of honolulu",
      "city": "honolulu",
      "shape": "triangle",
      "date": "2014-11-06T00:00:00",
      "story": "Bright blue triangular outline, oscillating yellow/orange/green lights along the outline over NE skies of honolulu At above time I looked out a window into the N.E. sky from Alewa Heights area. Naked eye observed what appeared to be a very bright star not see in that sky before. It appeared to \"sparkle and flash\".  Thought it was an incoming plane or military helo. After ten minutes it hadn't moved. I got a small pair of binoculars 8x23 (365 ft. at 1000 yds). Zero'd the light which appeared as a straight blue line, with flashing yellow light oscillating from one end to the other.  As I focused it became an elongated triangle, constant clear bright blue outline with multi color flash bursts of yellow, light orange and greens all along it's outer outline. It was very brilliant, stationary, and clearly outlined in shape. We \"spotted\" for an hour and a half, until clouds obscured it.",
      "link": "http://www.nuforc.org/webreports/115/S115068.html",
      "state": "HI",
      "duration": "1.5 hours +"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b9f",
      "summary": "There is a bright white lighted object flying erratically above the Koko head shooting range. I filmed over an hour of footage. The lig",
      "city": "honolulu",
      "shape": "light",
      "date": "2014-11-21T00:00:00",
      "story": "There is a bright white lighted object flying erratically above the Koko head shooting range. I filmed over an hour of footage.  The light dims and brightens and moves horizontally and vertically. It's still there doing the same thing as of 21:00.  It appears to dive toward the ground, then it shoots up in the sky, stalls and moves left to right and in a circular motion.  As if someone is drawing a circle with a flashlight.  I also filmed at least 7 airplanes flying past it within an hours time.  Note that the video does not give good details of the craft, however, you can clearly see the erratic pattern it is flying in.  And you can see the airplanes flying past it (you can tell the planes apart from the craft because of their flight path and strobing light, the object is just flying in all directions).  It almost appears as if someone is flying a kite with a set of lights on it.  The only problem is that flies way to high to be a kit.  It is higher than the airpl! anes flying past it, and it dives down a rockets back to high altitude way too quickly to be a kite.",
      "link": "http://www.nuforc.org/webreports/115/S115512.html",
      "state": "HI",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c87",
      "summary": "Two fire balls flying parallel to one another leaving a long streak of light.",
      "city": "honolulu",
      "shape": "fireball",
      "date": "2014-11-14T00:00:00",
      "story": "Two fire balls flying parallel to one another leaving a long streak of light.",
      "link": "http://www.nuforc.org/webreports/115/S115344.html",
      "state": "HI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a41",
      "summary": "Mass sighting in Honolulu during early '60's.",
      "city": "honolulu",
      "shape": "disk",
      "date": "",
      "story": "Mass sighting in Honolulu during early '60's. This was in Honolulu.  Our whole street was outside watching and when we called the radio station, the DJ swore at us because so many people were reporting this and it was clogging the lines.  The radio station was K-POI.   We watched the craft do a ballet for us.  They were showing off.  They went slowly chugging across the sky then one shot out to space in a blink of the eye.  As in straight out!   We watched the other two wait patiently, just hanging there in front of us.  Then suddenly, the third one reappeared from the right and slowly meandered back to his companions. This display went on for some time. My father was a Yale graduate and a first mate on a vessel in WW2.  I asked him what he thought and a man who knew everything refused to commit on this. The discs were tri colored with lights along the rim.  I believe they were orange blue and yellow or red.  I remember thinking the colors were rather unattractive and clashed a bit. I was about 11 or thirteen.  Very young but I do remember thinking they were so close we could count the lights. I'm afraid I cant tell you an approximation of how big but they weren't small. Hawaii is a huge military outpost.  I think the Honolulu Advertiser had a small blurb the next day about venus reflecting swamp gas. etc.. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120664.html",
      "state": "NC",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3c4419",
      "summary": "Solid unidentified Light streaking across the skies, high-speed, leaving a trail before disappearing.",
      "city": "honolulu",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "Solid unidentified Light streaking across the skies, high-speed, leaving a trail before disappearing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Possible meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123536.html",
      "state": "HI",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4730",
      "summary": "Light disappeared.",
      "city": "honolulu",
      "shape": "unknown",
      "date": "2015-10-29T00:00:00",
      "story": "Light disappeared. Single white and red light traveling east to west, no sound, high in sky, no tail.  Light suddenly disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123076.html",
      "state": "HI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c49ee",
      "summary": "Breaking the sound barrier in line formation for individual cylinder flashing light objects",
      "city": "honolulu",
      "shape": "formation",
      "date": "2015-10-29T00:00:00",
      "story": "Breaking the sound barrier in line formation for individual cylinder flashing light objects",
      "link": "http://www.nuforc.org/webreports/123/S123187.html",
      "state": "HI",
      "duration": "1:28"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b8d",
      "summary": "Ball of light.",
      "city": "honolulu",
      "shape": "light",
      "date": "2015-10-02T00:00:00",
      "story": "A white/orange ball of light seen from Nuuanu Valley, shining toward the West side.  Then proceeded to slowly descend behind mountain. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122461.html",
      "state": "HI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4cc9",
      "summary": "Moving yellow-orange orb seen by myself for about 20 seconds before passing behind cloud, have tech background to r/o normal objects",
      "city": "honolulu",
      "shape": "other",
      "date": "2015-09-02T00:00:00",
      "story": "Moving yellow-orange orb seen by myself for about 20 seconds before passing behind cloud, have tech background to r/o normal objects On 7-29-15 at approximately 2020, I was returning to my apartment on the 16th floor walkway of our high rise condo building and noted that the sky was partly cloudy with cumulus clouds, the almost full moon was out, and a few stars visible.  I then noted in my peripheral vision another bright object in the northern sky, at about 70 degrees elevation.  Initially, I assumed it was Jupiter, being yellow-white in color and bright, but this object’s magnitude (brightness) was actually somewhere between Jupiter and Venus when I looked directly at it.  Then I realized that Jupiter/Venus had been in conjunction in the western sky lately and could not be the object.  I am also familiar with the appearance of stars, other planets, and the time of year they are visible. This was different, in that the object appeared as a steady orb and to my surprise was moving downward in a northerly linear/ballistic direction with relation to the building overhang.  There might have been some slight wobble side to side, but being familiar with auto- kinesis, I could not rule this out as the cause.   I looked to see if the object had any lesser peripheral lighting such as aircraft position/navigation or anti-collision lights, but none were apparent.  I thought it strange if this was a landing light of an airplane that it is usually not totally and consistently visible at that angle when moving away (plus it tends to waiver due to aircraft movement and atmospherics).  I could not tell the exact altitude of the object, but it seemed as high as an aircraft might traverse or maybe even higher.  It was visible while moving for perhaps 20 seconds before disappearing behind a cloud and not re-emerging on either side.  Frankly, for lack of a better description, it! reminded of the scenes from the movie “Close Encounters of a Third Kind”, which depict the spacecraft crisscrossing the sky at altitude, albeit in this case at a little slower speed.  A friend suggested that it might have been a commercially available drone flown by an individual, but it seems unlikely as it was at least at about 2-3 thousand feet in altitude in order to pass behind the prevailing cumulus clouds (which were forming about 1-2 thousand feet at the time), and they would have probably lost track and control of it.  Additionally, the lighting was not pinpoint, diode, or laser like. Strangely, no noise was noted, which would usually be heard from an aircraft/airliner, as the back side of the building is normally quiet. Furthermore, the closely adjacent low mountain ridge (only a couple of hundred feet away) and our building form sort of a bowl for collecting sound.  Surface winds were light and would not have distracted much from any sound. I also thought maybe it could be a weather balloon being illuminated at high altitude where the sun was still striking it, since it was only 2020 and the sun sets later in summer, so I cannot totally rule this out.  I do not know what the prevailing high altitude winds were at the time.  However, I do recall when I previously observed such balloons and even satellites in the past, that they tend to oscillate in brightness due to the changing sun reflection off the envelope or shifting hard surfaces. This is the first time I have experienced something like this in all my 58 years and believe that if others in the east Oahu area of Hawaii Kai (City & County of Honolulu) were looking in the same direction at the same time, they would have easily seen it.  I am contemplating contacting the Honolulu Star Advertiser local newspaper on this matter to see if any others reported this.  I now have a greater appreciation for those who say they didn’t have time to take a photo or get other witnesses, as I was just outside my apartment and briefly contemplated rushing to get my wife and son to come out, but now realize that if I had done so, it would not have been in time and I would have missed part of the event. With respect to my background, I have a past that includes aviation (private pilot single engine land & sea rating, licensed FAA aircraft mechanic with ratings for airframe & powerplant, former FAA air traffic controller Tower trainee, including National Weather Service observer training, did some aviation accident investigation for worldwide aircraft insurers through AirClaims in Hawaii & Alaska, and have a bachelor’s degree in Aviation Administration from Embry Riddle Aeronautical University-which included coursework in flight physiology).  I have also been an avid amateur astronomer since childhood, having built and owned various telescopes and taken several formal college level courses in the subject (including astrophotography). I most recently worked the last 23 years as an acute inpatient psychiatric RN at a major hospital in Honolulu after getting my nursing degree.  I also completed some graduate level education in nursing. Given the aforementioned, I believe that I am somewhat familiar with aerial and astronomy phenomena and have been able to be clinically objective in my appraisal of anything I have seen, but this episode was unusual and unexplained. Sincerely,  ((name deleted))",
      "link": "http://www.nuforc.org/webreports/121/S121588.html",
      "state": "HI",
      "duration": "~20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c51c5",
      "summary": "Green-blue streak over nightime ocean.",
      "city": "honolulu",
      "shape": "",
      "date": "2016-01-29T00:00:00",
      "story": "Green-blue streak over nightime ocean Unusually wide, green-blue streak spotted going down over horizon, seen in night-sky looking west from diamond head in the direction of Barber’s Point, although possibly still over the sea.  Too fast to be a plane, seemed unusually wide and green a streak to be a meteor.  Also, from my viewpoint, seemed to take a perfectly sharp turn at an approximate 90° angle in flight before disappearing.  If this was a meteor bouncing off the stratosphere it really bounced.  Glowing steadily, however, and there seemed to be no visual flare-up that which one might expect of the higher atmospheric density that would cause a deflection. Am I wrong?",
      "link": "http://www.nuforc.org/webreports/125/S125420.html",
      "state": "HI",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c53f2",
      "summary": "((HOAX??)) Objects looked like low descending meteors, until they started dramatically changing paths in various zig-zag formations.",
      "city": "honolulu",
      "shape": "light",
      "date": "2016-01-08T00:00:00",
      "story": "The objects looked like low descending meteors, until they started dramatically changing paths in various zig-zag formations.  They were flying faster than standard aeroplanes and did not have the typical flashing lights. ((NUFORC Note:  We suspect that the report is a hoax.",
      "link": "http://www.nuforc.org/webreports/125/S125169.html",
      "state": "HI",
      "duration": "20"
    },
    {
      "_id": "64d005f478aba2ec5a3c561f",
      "summary": "White light moving very fast makes right angle turn.",
      "city": "honolulu",
      "shape": "light",
      "date": "2016-07-15T00:00:00",
      "story": "White light moving very fast makes right angle turn. My wife and I were on the beach at the Disney Aulani resort.  I was looking at the stars via Google star maps, when I saw a white light moving very fast from south to west, just below Jupiter.   There was no tail or trail and after a few seconds it made a 90 degree turn at very high speed and then disappeared.",
      "link": "http://www.nuforc.org/webreports/128/S128392.html",
      "state": "HI",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ede",
      "summary": "While walking at Ala Moana Beach park,  other evening. We observed A bright reddish object floating and drifting in the skies,  out ove",
      "city": "honolulu",
      "shape": "rectangle",
      "date": "2016-10-11T00:00:00",
      "story": "While walking at Ala Moana Beach Park, other evening, we observed a bright reddish object floating and drifting in the skies, out over The ocean.  About 1/2 mile away.  And elevation about the same.  Bright object perhaps 60 feet in diameter  This object floated and slowly drifted offshore, sighting lasted 3-4 minutes.  A subsequent, second identicalobject appeared a few minutes later.  It too remained suspended in sky over ocean, then slowly drifted SW and out of sight!  We returned to same location last night with camera; however Objects never reappeared!",
      "link": "http://www.nuforc.org/webreports/130/S130367.html",
      "state": "HI",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6033",
      "summary": "Red lights, flying away, stopping, hovering and flying backwards",
      "city": "honolulu",
      "shape": "light",
      "date": "2016-10-27T00:00:00",
      "story": "red lights, flying away, stopping, hovering and flying backwards Series of red lights, flying towards the ocean at a high speed.  They then stop and hover for a few seconds. start to fly backwards slowly, then in a circle, then hover and the ascend, stop and fly back behind a tree that blocks my vision.   After a few seconds, the lights appear again.  Fly forward a little, stop and hover, fly around and then fly behind the tree that blocks my vision.   No sound and movement too quick to be a helicopter.  Definitely not a plane.",
      "link": "http://www.nuforc.org/webreports/130/S130799.html",
      "state": "HI",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6784",
      "summary": "Saw a bright red light that looked like a helicopter at first but as it got closer it was flying too low.  ((anonymous report))",
      "city": "honolulu",
      "shape": "circle",
      "date": "2017-04-20T00:00:00",
      "story": "Walking home from work at 12:38 AM saw a bright red light that looked like a helicopter at first, but as it got closer, it was flying too low to the ground and the light illuminated a circle aircraft moving at a high speed. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133625.html",
      "state": "HI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d53",
      "summary": "I observed red-orange orb lights floating on my back lanai at 3:30 am.",
      "city": "honolulu",
      "shape": "other",
      "date": "2016-12-15T00:00:00",
      "story": "I observed red-orange orb lights floating on my back lanai at 3:30 am. I was awakened around 3:30 am and I was lying in my bed wondering why I had woke up.   Then something outside on my back lanai caught my eye.  My louver windows were closed but I saw a reddish-orange floating light outside the window.  It was about 5 ft. in the air.   Then 2-3 more of the same kind of lights appeared, making the total number of lights outside the window to being 4.  They seemed to be interested in the string of pinkish- red colored lights that I had on my lanai that were on at the time.  Then one of the lights left the others and flew close to my bathroom window that is located towards the back of the lanai behind the washer and dryer.   When the light came close to the bathroom window, which was also closed it illuminated the bathroom with a reddish -orange light.  It then floated back to join the other lights that were still floating in the air.  They remained there for awhile, about 15-20 minutes.  Then they just disappeared.   I was frozen sitting in my bed. I was frightened by it and didn't get a friendly feeling from these lights. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131716.html",
      "state": "HI",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d39",
      "summary": "I observed what appeared to be 7-10 red lights in the shape of an egg moving West to East over Honolulu and Waikiki. It paused twice an",
      "city": "honolulu",
      "shape": "light",
      "date": "2016-12-21T00:00:00",
      "story": "I observed what appeared to be 7-10 red lights in the shape of an egg moving West to East over Honolulu and Waikiki.  It paused twice and hovered silently for about half a min each then floated slowly off away over diamond head and kept on going out to sea.",
      "link": "http://www.nuforc.org/webreports/131/S131807.html",
      "state": "HI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c853a",
      "summary": "I woke up at 3:00 am. I went on my balcony to have a cigarette with my girlfriend. I was enjoying the half moon and the round glow arou",
      "city": "honolulu",
      "shape": "unknown",
      "date": "2018-09-13T00:00:00",
      "story": "I woke up at 3:00 am. I went on my balcony to have a cigarette with my girlfriend.  I was enjoying the half moon and the round glow around it. I then noticed 2 red lights flashing and every once in a while they would flash gold.  One was following the other.  Then the one behind went higher and it seemed like they were beginning to descend.  The angle was slightly diagonally.  It or they were super low and flying slow over the valley and towards the mountain.  The event lasted 3 minutes or so, before losing sight behind a building.  I live in Honolulu close to Makiki and Punchbowl Cemetary.  I got the chills when we saw this.   Would love to know if anyone else saw this and of course, what it was.   Thank you kindly!",
      "link": "http://www.nuforc.org/webreports/142/S142979.html",
      "state": "HI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d78",
      "summary": "Hyper-Flight",
      "city": "honolulu",
      "shape": "other",
      "date": "2019-01-11T00:00:00",
      "story": "Hyper-Flight It was about 9 am or a few minutes earlier when three of us were gathering into a rented suv to go to a ceremony in Waikiki (St. Augustine Church) for a presentation from Portugal regarding a statue being presented (Our Lady of Fatima). Before boarding I noticed a mult-colored helicoptor approaching from the west to east (sunrise).  It caught my eye whereupon I noticed way above it an extremely bright jet shaped object (no wings or tail fins and brilliant white) streaming across the sky.  The tail had an inverted thruster as compared to an extended or protruding one such as many jet fighters enjoy.  It had an extreme altitude (higher than civil flights), was about the size of a battle ship, no sound whatsoever, and crossed the entire clear sky in less than 4 seconds.  Before I could call attention to it...... it disappeared into the sunrise.  I couldn't believe the speed of this object!  No missle on earth could possibly approach this speed.  Second time in my life I've ever seen something like this.  The 1st time was when I was 13.  I'm 70 years old, as of sighting.",
      "link": "http://www.nuforc.org/webreports/144/S144334.html",
      "state": "HI",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e23",
      "summary": "A bright light seemed to appear out of nowhere off the coast of Hawaii Kai on Oahu.  ((anonymous report))",
      "city": "honolulu",
      "shape": "light",
      "date": "2019-01-11T00:00:00",
      "story": "A bright light seemed to appear out of nowhere off the coast of Hawaii Kai on Oahu while I was running around Diamond Head Crater.  The object appeared to be round and fluctuated in brightness and color. It turned from white to a pink-ish color just before it moved horizontally across the sky and disappeared from view. In the video I took, it also appears to fluctuate in size and at one point, there appears to be two objects right next to each other or touching.  It’s hard to tell if that is just because of the poor video quality on my phone or not. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144357.html",
      "state": "HI",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e22",
      "summary": "Light fluctuating in brightness and color off the coast of Hawaii Kai before it moved horizontally across sky.  ((anonymous report))",
      "city": "honolulu",
      "shape": "light",
      "date": "2019-01-11T00:00:00",
      "story": "Light fluctuating in brightness and color off the coast of Hawaii Kai before it moved horizontally across sky. A bright light seemed to appear out of nowhere off the coast of Hawaii Kai on Oahu, while I was running around Diamond Head Crater.  The object appeared to be round and fluctuated in brightness and color.   It turned from white to a pink-ish color just before it moved horizontally across the sky and disappeared from view. In the video I took, it also appears to fluctuate in size and at one point, there appears to be two objects right next to each other or touching.  It’s hard to tell if that is just because of the poor video quality on my phone or not. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144356.html",
      "state": "HI",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9821",
      "summary": "40+ UFOs flying at a very high altitude from the east to the west over Oahu, Hawaii",
      "city": "honolulu",
      "shape": "unknown",
      "date": "2019-12-19T00:00:00",
      "story": "40+ UFOs flying at a very high altitude from the east to the west over Oahu, Hawaii At approximately 0600 hours hawaii standard time, 40+ UFO’s were observed flying at a very high altitude in an equally spaced line from the east and heading to the west. The UFOs were not blinking, the sighting lasted approximately 8 minutes.",
      "link": "http://www.nuforc.org/webreports/151/S151656.html",
      "state": "HI",
      "duration": "10 minutes"
    }
  ]
}