{
  "city": "huntsville",
  "fetch_timestamp": "2025-07-12T14:36:39.265388",
  "record_count": 59,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4b02",
      "summary": "Two moving yellowish lights over Huntsville, AL at 10:30 pm on July 8, 2019.",
      "city": "huntsville",
      "shape": "light",
      "date": "2019-07-12T00:00:00",
      "story": "Two moving yellowish lights over Huntsville, AL at 10:30 pm on July 8, 2019. In the sky over Huntsville or Redstone Arsenal, I noticed 2 bright yellowish lights and one blinking red light and did not hear any airplane or helicopter noise.  The yellowish lights appeared to be moving slowly, very close but in different directions.  After about 30 seconds they disappeared (not simultaneously, but separately).   It might have been some kind of a firework trail the way they faded from view, but it took a full 30 seconds for them to disappear and neither light moved downward.   After they were gone, I watched the blinking red light move toward the southwest over Redstone Arsenal toward the Huntsville Airport for an additional 30 seconds until it was obstructed from my view by a large tree.  I continued watching for 10 minutes but never saw the bright yellowish lights or the red blinking light again.  If I were to guess, I would suspect either some satellite-related event or two helicopters that turned on and off their lights too far away for me to hear them.  I suspect the red blinking light was a satellight",
      "link": "http://www.nuforc.org/webreports/147/S147433.html",
      "state": "AL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4be6",
      "summary": "Large ball of light!",
      "city": "huntsville",
      "shape": "",
      "date": "2019-06-20T00:00:00",
      "story": "Large ball of light! Ball of light about the size of a basketball that darted down from the sky at an angle into the woods as I sat on my back porch.  Weird thing...  I know I wasn’t going crazy because my dogs saw it too!  They immediately stood at attention on guard facing in that direction and wouldn’t move (almost like they were waiting for whatever they saw to make the first move). ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146713.html",
      "state": "AL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e0d",
      "summary": "Pulsating ball of white light.  ((anonymous report))",
      "city": "huntsville",
      "shape": "circle",
      "date": "2019-05-09T00:00:00",
      "story": "Pulsating ball of white light. Occurred: 04/04/19 @ 05:55A.M. CST Reported: 04/27/19 Location: Huntsville, AL Shape: Ball of white light Duration: 3.0 seconds  Sighting description:  I was looking directly East at the sunrise, there is a building behind ours that blocks the horizon, so all I was seeing were the colors of the sunrise with no glare from the sun.  Out of nowhere, a ball of white light descended, and then leveled off moving East, going away from me.  From my vantage point, I would say the object was about the size of a “BB” held at arm's length to the eye, for lack of a better term it was pulsating and becoming brighter, making it look somewhat larger then back to smaller.   I cannot estimate its speed or altitude, but from where it first appeared, to where it finally went out of my sight behind the other building, I would say it came from an extremely high altitude.  I've never seen anything like it before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145886.html",
      "state": "AL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5078",
      "summary": "String of white lights that disappeared into a triangle shaped object ((NUFORC Note:  Starlink satellites?  PD))",
      "city": "huntsville",
      "shape": "light",
      "date": "2019-12-22T00:00:00",
      "story": "String of white lights that disappeared into a triangle shaped object and a flashing light appeared and the light flew off quickly Long string of 15-20 lights staying in a straight line until they reached a triangle of lights about the same size and brightness and all disappeared at the same point and more lights came from other directions and all disappeared in that area once again, also there were clouds in the sky, about 20 minutes later a few more emerged and disappeared at the same triangle of stars although they came from different directions, shortly after they disappeared a light started flashing in that area and shortly after jetted off in a bright white streak of light . The witnesses were myself, my dad who was in the military for many years, and my mom",
      "link": "http://www.nuforc.org/webreports/151/S151853.html",
      "state": "MO",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b55af",
      "summary": "Three brilliantly colored purple lights streaked beyond the eastern horizon at a fantastic rate of speed.",
      "city": "huntsville",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "Three brilliantly colored purple lights streaked beyond the eastern horizon at a fantastic rate of speed. I was a mile away from the mountains in the south when three brilliantly colored purple lights appeared over top of the mountains. The lights seemed to be connected as if they were on the tips of a craft. The lights sat stationary for several seconds, and then moved slowly over the mountain ridge. It then streaked beyond the eastern horizon at a fantastic rate of speed. The UFO was out of site in only a second or two. ((NUFORC Note:  Date of the event may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58850.html",
      "state": "AL",
      "duration": "15 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b59d5",
      "summary": "large triangular object near UAH in Huntsville, Al moving very slowly with no sound",
      "city": "huntsville",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "large triangular object near UAH in Huntsville, Al moving very slowly with no sound I was coming home from work going down University Dr. east toward UAH when I saw in the horizon just above me in the distance two large bright lights.  The lights did not appear to be moving or moving very slowly.  My first thought was oh a airplane. But then immediantaly I said no that is not an airplane because the two lights are way to far apart to be an airplaine and there was no blinking light on it like airplanes have.  The two lights were probablly 3 times the wing span of an airplane accross.  I kept watching the lights as I went down the road and the two lights were fixed to each other and not making hardly any movement.  Then I turned off university to go to sparkman and just as I was right near uah I looked up and ther was a huge traingle shaped craft above my head.  It was grey and black in color and I could see it very clearly.  It had a red light on the bottom.  I kept traveling and as I turned north onto sparkamn I saw the lights moving to the northeast I could no longer make out the triangle shape I just saw the two widespaced huge lights.  This event caused me to call the 3 local tv stations and ask if any one had reported seeing a triangle in the sky.  The respone I got from all 3 stations was no.  They did not seem to even want to know what I had seen.  At this point I started to doubt what I had seen bec there was a lot of traffic on the road and someone else had to have seen it.  The only thing that makes me think I did not just imagine it is that I watched it for about 5 min.  before I actually was underneighth it and saw the shape of it.  My impression is that it may be some kind of exp aircraft because we live right near redstone arsenal.  The object was not making any really unsual movement except that it did not appear to move at all but hover or move very slowly and I heard absolutely no sound coming from it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57978.html",
      "state": "AL",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5be9",
      "summary": "Bell or thimble shaped object rises out of Guntersville Lake and follows pair into Huntsville.",
      "city": "huntsville",
      "shape": "other",
      "date": "2007-04-27T00:00:00",
      "story": "Bell or thimble shaped object rises out of Guntersville Lake and follows pair into Huntsville. Late one evening (between 9 and 10 PM) in the winter of 1988 (possibly February), I (a high school student) was sitting on a boat dock at Guntersville Lake with one other person (a high school student) when a large bell or thimble shaped object rose from the water about  a quarter of a mile from us.  It rose straight up (higher than the tree line) and stopped. Too close for comfort, we got into our car and drove rapidly from the lake taking Hwy 72 through Scottsboro to Huntsville (a trip lasting approximately 35 minutes).  The object followed us just above the tree line rapidly moving from one side of the road to the other.  The object was bright enough to be seen through the street lights once we reached Huntsville and followed us on a twisting path through town. We stopped at my house near Redstone Arsenal and gathered up a pair of binoculars and a rifle scope to look more closely at the object that was now hovering over the neighbor’s house.  We were joined by my father (a restaurant manager) and a neighbor (profession unknown), and we all watched the object for approximately ten minutes.  It was bell or thimble shaped with varying colored lights around the outside of the object in a diagonal line from the bottom to the top.  It rotated counter clockwise and was light in color.  After ten minutes or so, the object rose rapidly and sped off to the southeast. I saw several strange luminous objects in the skies over Redstone Arsenal in the spring and summer that followed- often the same objects in the same general area several nights in a row--but none came close enough for me to distinguish their shapes. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55860.html",
      "state": "AL",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d99",
      "summary": "Large bright blue object moving in a box like pattern at an incredible rate of speed until it vanished my moving vertically.",
      "city": "huntsville",
      "shape": "oval",
      "date": "2006-10-30T00:00:00",
      "story": "Large bright blue object moving in a box like pattern at an incredible rate of speed until it vanished my moving vertically. Large bright blue object was seen hovering above the tree line north of my location shortly after 9PM central time. Object was moving in a box like pattern stopping at each corner for a few moments before moving to another position. Object vanished by dropping below the tree line then moving vertically at an incredible rate of speed until it was no longer visible. It was witnessed by two people. Within 10 minutes of the sighting four military craft were sight. They flew over head at a very low altitude and at a very low speed. These aircraft were interceptor/fighter type planes and were easily visible and very loud.",
      "link": "http://www.nuforc.org/webreports/052/S52016.html",
      "state": "AL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b628a",
      "summary": "this report you may put in file 13, but before you do. Please take the time to read it. All that is in it is correct.",
      "city": "huntsville",
      "shape": "disk",
      "date": "2008-01-21T00:00:00",
      "story": "this report you may put in file 13, but before you do. Please take the time to read it. All that is in it is correct, I DONOT believe it all.  But I must be honest and share it. I have detect a ufo in the ground and it has been here a very long time. I have found only (1) thing that is evidence that the ufo was there. Over time what I found was that one ufo was only one of a number of them. because the metal is detect in complete shape I have to say that the metal was a alloy that was like ours  becouse any other metal would be found in pieces not complete like what was found.  I do not know why I found it but I did. becouse it is complete it is like a blueprint and you can tell how it would work . It being the large one is so large you would think that it would hold a lot of there poeple, but when you look at the print , you see that only the core of it would hold life. the outer part it like ballast tank, this allows it to go to the bottom of water. It has in the core (7) riser that lets it rise without vacum damage it. This design shows that they use all of nature to do things. What I see of there design, If they have it they use it. In march 0f 06 I saw one that was flying . It was only a cicle of light very bright< but looking at it this llght must be very cold to be this bright. becuase they donot have anything that donot use , why have the light. We donot think that they need light to see so WHY HAVE IT. I now know more about ufo,s then I need to know. but am having the same problem that most people have that has see them, Is it because we are unwilling to say that they were here and still here, I donot know but I am happly  to know that I have the luck to studies them, there is a lot to know but I understand you are not going to read it all. But I did share with you this fact. That is all I can do for you ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  We are not certain what the report alludes to.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60083.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b67be",
      "summary": "A picture of a UFO in the sky in a picture a disk shape",
      "city": "huntsville",
      "shape": "disk",
      "date": "2007-08-07T00:00:00",
      "story": "A picture of a UFO in the sky in a picture a disk shape We were taking pictures of the kids in the afternoon as looking at the pictures on the computer we spotted a disk object in the picture. As we zoomed in we sshapeeen the disk  shaped object . It was going so fast only the camera caught it it wouldnt have been seen with the naked eye. You could see where it left marks in the cloud it was going so fast. There was no sound or anything 3 witnesses seen it in the picture.  It was leaving a trail behind it is how fast it was speeding of the object. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57448.html",
      "state": "AL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b70df",
      "summary": "Rapidly moving object looks like it might impact ground",
      "city": "huntsville",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Rapidly moving object looks like it might impact ground As I looked west and up, I saw a light moving rapidly through the sky.  My first impression was that it was a satellite, but it was moving much too rapidly.  I have observed the International Space Station and it moved very slowly, in comparison. The magnitude and color (white like that of a satellite) of the light of the object was constant, and there was no tail behind the object, nor trail left in the sky following the object.  The object, at first, appeared to travelling roughly parallel to the ground, but as it moved away from me, it looked as though it had changed trajectory toward the ground and that it might impact somewhere on the Redstone Arsenal.  No impact was observed.  No sound was heard.  A small aircraft was flying from north to south at the time of the sighting and the object would have been visible to the pilot through the right-hand window.  My vantage  point is high above the city (approximately 600 feet) and visibility was unlimited.  The sky was perfectly clear with good astronomical seeing conditions.  I would estimate the object to have had a constant brightness of approximately equivalent to a star magnitude of 3 to 3.4.  It is possible that the object was a meteor, but its characteristics did not convince me that it was.",
      "link": "http://www.nuforc.org/webreports/054/S54509.html",
      "state": "AL",
      "duration": "2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7380",
      "summary": "large white object at tree top level, slowly moves higher in sky as the sun comes up.  ((NUFORC Note:  Sighting of Venus.  PD))",
      "city": "huntsville",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "large white object at tree top level, slowly moves higher in sky as the sun comes up. I get up very early in the morning ,and have my coffee on the back porch. For the past month or more there has been this large white object at tree top level in my neighbors        backyard. It slowly start to move higher in the sky as the sun starts to come up. I have been watching this amazing event for some time now,and no one can tell me we don't have visitors from other worlds watching us. I wish the truth would finally come out, we have a right to know. ((NUFORC Note:  Sighting of Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59957.html",
      "state": "AL",
      "duration": "2 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b7630",
      "summary": "Two bright lights which appeared to be stars.  They slowly faded out of sight.",
      "city": "huntsville",
      "shape": "unknown",
      "date": "2006-12-07T00:00:00",
      "story": "Two bright lights which appeared to be stars.  They slowly faded out of sight. I observed what I thought were 2 bright stars at about 290 degrees and elevation of 35 degrees.  I wondered why the 2 stars were so bright and after about 30 seconds they began to fade moving straight out into the heavens.  within 20 seconds their size and luminance went completely dark.  There were no clouds in the sky and I heard no noise.  the distance between them was about 3 inches at arms length and on a horizontal plane.  This was observed by me when I went out on my driveway to get the morning paper.",
      "link": "http://www.nuforc.org/webreports/053/S53379.html",
      "state": "AL",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bf0",
      "summary": "Blue-green, round, hazy light moving rapidly from north to south",
      "city": "huntsville",
      "shape": "fireball",
      "date": "2006-12-07T00:00:00",
      "story": "I looked toward the west and witnessed a blue-green, round, hazy light moving rapidly from north to south.   There was a very thin cloud layer in the sky that did NOT obscure the stars.  The object was above this layer and I attribute its hazy appearance to that fact.   The light moved rapidly from a higher to lower altitude and seemed to follow a trajectory that made an angle of about 30 degrees with the ground.  From my vantage point at approximately 1250 feet in elevation, it appeared that the object was about 5 miles, or so, distant, and located over the Redstone Arsenal.  The object covered a large arc of sky in the very short time in which I viewed it.  The object gave the impression it would impact the ground somwhere south of my location.  I can see about 40 miles due to my mountain-top location.  I waited for several minutes for a sign of impact, but saw none.  The Alabama counties in which an impact could have taken place are Morgan and Marshall.  No sound from the object was audible.  I had attributed my sighting to a meteor, until a local newspaper ran an article about a similar sounding object that was seen a day later at a much earlier time (11/28/06 at 17:28).  Search lights, flares, rockets, missiles, and aitcraft are unlikely explanations for this object.  Humidity in the air would make search light beams visible and the shape of the spot on the clouds would have changed due to the angle of the light source.  The object maintained constant shape.  The apparent altitude and angle of sky covered would likely indicate supersonic velocity and probably a sonic boom, especially if the object had to avaoid collision with the ground.  The sudden appearance and disappearance of the object, and its constant luminance would also help rule out the other possibilities I mentioned.",
      "link": "http://www.nuforc.org/webreports/053/S53685.html",
      "state": "AL",
      "duration": "2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c22",
      "summary": "Bright green light(s) traveling east over Chapman Mountain.",
      "city": "huntsville",
      "shape": "light",
      "date": "2006-12-07T00:00:00",
      "story": "Bright green light(s) traveling east over Chapman Mountain. I was traveling east on I-565.  When I neared the top of Chapman Mountain, I saw one or two bright green lights in the sky.  The object moved very fast toward the east and looked like it might have also been descending.  I watched it move through the sky until it disappeared from my sight.  It kind of looked like one shot from a roman candle firework, so I almost dismissed it as such.  Then, my wife, who took a different route home, told me that saw the same object from a good distance north of me on Chase Road.  From her description, it seemed that she had an even better view of the object than I did, which makes me question whether it was a firework. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53670.html",
      "state": "AL",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8843",
      "summary": "Three Lights In A Vertical Formation Blinking To Another Light On Other Side Of The Sky With A White Light Blinking Red",
      "city": "huntsville",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Three Lights In A Vertical Formation Blinking To Another Light On Other Side Of The Sky With A White Light Blinking Red I was standing on my patio at 01:14AM smoking a cigerette and i looked up in the sky like every night and i saw what appered to be a star or so i thought than i looked to the left side of the sky and i saw a row of three water appered to be stars that were vertical and they stated to blink than i looked to my right and the other star lit up real bright and faded and i glanced back to my left and saw a white light start to move up in the sky and start to flash red and it freaked me out so i came in the house and im gonna go back out to see if its still there Its still there now theres another one and it was desending into the sky very slow ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72668.html",
      "state": "AL",
      "duration": "UNKNOWEN"
    },
    {
      "_id": "64d005f478aba2ec5a3b89ea",
      "summary": "woman figure in red bodysiut with large head",
      "city": "huntsville",
      "shape": "circle",
      "date": "2010-04-13T00:00:00",
      "story": "woman figure in red bodysiut with large head   Sometime during 1981 I had a dream that has not left my memory.  I now believe it was not a dream but an abduction experience.  This occurred in Huntsville, Alabama at night. I have three memories: I was placed in a seat that looked like plastic similar to fast food restaurants.  It was curved and had a high back that protruded above my head.  I was not belted in the seat but I was stuck there and could not move.  My eyes were open but unable to move so I could only see in front of me.  There was a man sitting across from me in a same type of seat, and he was not moving either.  I could see more seating behind him but with the design I could not see anyone sitting. The second memory I woke up and was on a table in the middle of a room.   I was laying with my head in the south and my feet in the north.  My eyes could not look around, but I could see part of the ceiling and part of the wall on my right.  It appeared to look rounded and somewhat reminded me of commercial office partitions, grey/silver and flat.  I did not know where I was, then my head rolled to the left and I saw a woman walking up a small ramp to a door that I heard open with a \"swish\" sound, like a hatchback car when you open it.  I could see a little of the hall way and it appeared to curve slightly. The woman was wearing a red bodysuit and seemed to be physically fit.  I saw her head was different, it was larger in the back like it was deformed and her hair was blonde and extremely thin like a chemo patient that is losing most of their hair.  She was on the west side of the room and to the left of me. She had to know I was looking at her from behind because after the door opened she quickly turned and looked at me.  I saw her in the front view before she knocked me back out apparently with her mind, she did not say anything.  Her body seemed human but I have never seen a face similar to her. She had a bigger forehead and bigger eyes than a human, her nose was extremely small, almost no cartilage and reminds me of Michael Jacksons small nose.  Her mouth was small too with very thin lips. The last memory I was in a different seat facing west looking at black windows.  I saw the seat I had been in and it was emply, I still could not look around but I saw a door to the north behind the seat I was in in the first memory.  I was next to the wall and remember the rectangle rounded windows. ((NUFORC Note:  Witness indicates that date during 1981 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74412.html",
      "state": "AL",
      "duration": "during sleep"
    },
    {
      "_id": "64d005f478aba2ec5a3b90f5",
      "summary": "Cigar shaped UFO's sighted and investigated as they traveled at a high rate of speed.",
      "city": "huntsville",
      "shape": "cigar",
      "date": "2009-01-10T00:00:00",
      "story": "Cigar shaped UFO's sighted and investigated as they traveled at a high rate of speed. I was driving my car home from an outing at the college observatory and saw 12 cigar shaped UFO's flying wildly through the sky.  They were moving from N to S and traveling at an extremely high rate of speed.  The cigars were glowing and some type of glitter seemed to be falling off them.  I could not obtain a photo or sample of any residues that may have been dispersed (widely).  The next day I went back to the location and was unable to obtain any additional evidence for this case study.  I intend to camp out in the area next week and observe the skys with my new digital camera system with tripod.",
      "link": "http://www.nuforc.org/webreports/067/S67153.html",
      "state": "TX",
      "duration": "7.30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d17",
      "summary": "2 large ash circles on the ground",
      "city": "huntsville",
      "shape": "",
      "date": "2009-08-05T00:00:00",
      "story": "2 large ash circles on the ground No actual UFO sighting. We discovered to 2 (two) large circles of an ash like substance in our back yard at 0700 on 07/23/09.  The circles are perfectly round with 5 piles of ash evenly spaced in the middle. these circles were not there on 7/22/09. I have obtained samples of the ash and the grass it was on.  The grass was undisturbed.  No affect to the grass.  The ash has a very fine texture and no odor at all.",
      "link": "http://www.nuforc.org/webreports/071/S71261.html",
      "state": "AL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba1f3",
      "summary": "An object that ommitted a very bright light, almost looked like it had three lights on it.  ((NUFORC Note:  We suspect Venus.  PD))",
      "city": "huntsville",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "An object that ommitted a very bright light, almost looked like it had three lights on it I was driving with my finance and son in the car towards property his grandparents owned.  He had a trailer on the property and we needed some stuff from.  On our way to the dirt road to get to the property I noticed a big bright object below the moon.  I didn’t want time seem weird but it stood out more so, but I thought it was just maybe Venus because it was normal to see Venus kind of big during this time of year.  It was brighter then Venus though and looked like it had three lights from it since it was giving off a very bright glow.  It still has my attention though and I keep my eyes on it, since it looked out of the ordinary and I was just trying to reason with myself. When we got up to the piece of property, my fiancé got out of the car to get to the trailer.  I was still watching this object trying to figure out why it was so bright. Then it started to move side to side, up and down, even looked like circles. I was alarmed since I was trying to figure out if I was out of my mind. I tried to debunk it too, but I was seeing planes in the distance flying and I could tell it was a plane too. But I could not tell this was a plane, it started to get closer then further away and it looked like it was flying at an angle to the left and tilted. It was weird. I told my fiancé when he came back to the car to sit in the driver passenger seat and look at this. He asked me, “Look at what?” and I replied, “Just come look.” He sits down and I point at the object and tell him to look. I asked him if I was the only one seeing this and he told me, “No, you are not. I can see it moving weirdly.” He left for a second trip and I told him to hurry since I was still alarmed. The object was still moving in a weird fashion and went out further in distance. It was still in the far distance and looked like it was searching for something. But we left at about 8:30pm and it was still in the far distance, when we hit the main canyon road we could not see it anymore. ((NUFORC Note:  We suspect Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69003.html",
      "state": "UT",
      "duration": "about a half hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba296",
      "summary": "((HOAX))  UFO Sighting :)",
      "city": "huntsville",
      "shape": "egg",
      "date": "2009-05-12T00:00:00",
      "story": "UFO Sighting :) I was sitting on my deck enjoying a snack with my boyfriend Alberto.  He was licking the chocolate sauce off my body when I looked up in suprise..  I didn't know what it was at first but then I figured it out.  I jumped up naked with the remaining chocolate sauce on my body and grabbed my camera and took a few pictures.  Someone needed to know right away, so I came on the internet as quick as I could (still naked) and searched UFO sighting and here I am.",
      "link": "http://www.nuforc.org/webreports/069/S69795.html",
      "state": "ON",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba789",
      "summary": "A \"parked\" 737 in the sky accompanied by an orb",
      "city": "huntsville",
      "shape": "other",
      "date": "2009-01-10T00:00:00",
      "story": "A \"parked\" 737 in the sky accompanied by an orb Yesterday morning at around 9 am when I was driving to Huntsville, I saw a stationary 747 or 737 passenger plane parked in the sky about 100 feet above a field just to the right side of the road.  I thought my eyes were playing tricks on me at first because the car was in motion and I was definitely driving towards the nose of the plane, but as I got closer I realized that it was truly just sitting there parked in the sky.  To its right (my left) was an orb dancing around in the sky.  It seemed to reflect the sky on all its \"sides\" and appeared perfectly round and solid.  It was no bigger than a person would be if they were curled up in a ball.  When I realized that it was indeed parked in the sky, I pulled over and snapped a photo with my digital cell phone camera.  It isn’t that great but I have it if anyone wants to see it, and I will try my best to get it to sharpen in photoshop, but the actual raw photo taken at 9 am on 1-9-09 is in an email I just sent to this site.   The exact location of the craft was approximately ½ mile north of the Toyota plant in Huntsville on Pulaski Pike Rd.  I don’t know why it chose this location because there is only a field full of llamas and alpacas, some donkeys, horses and cows.  There is also a stream near by with fish in it.  Maybe it was surveying the area or something I don’t know.  But after I took the picture I was beside myself.  Back in 2000 when we lived in Texas, the whole family (kids, me, hubby) saw the exact same thing.  A large passenger plane parked in the sky, about the size of a 737 or 747, and it too was parked so low you could see every detail of its wings, engines, windows, paint job.   This one yesterday was painted with a silver grey bottom and orange on the sides (like a Northwestern Airlines plane).  It had no \"underbelly\" rocket boosters or anything, there was no way in the physical world it could have been hovering because passenger planes that are made to stay in flight while moving at 600 miles an hour simply drop to the ground if they are! motionl ess. About 30 seconds after I parked the car, it started to go away (I guess the occupants saw me?)  It went slow for about 5 seconds then disappeared going in an upwards north easterly direction very fast.  Also, the sphere that was dancing around everywhere disappeared.  Oh and the weather for the sighting was perfect, 100% clear sky, no clouds anywhere.  9 am, broad daylight. ((NUFORC Note:  We spoke with this witness via telephone, and she sounded to us to be quite sincere, and quite credible.  We have looked at the photo, taken with a cell telephone, and the objects is reminiscent of a swept-wing airliner.  It is ambiguous, we believe, but the witness has volunteered to send NUFORC the same photo, after it has been \"processed\" by a photo lab.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67953.html",
      "state": "AL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baf35",
      "summary": "My sister and I saw a 747 hovering in the air not moving forward or backward, just sitting still in the air about 1 mile away from the",
      "city": "huntsville",
      "shape": "other",
      "date": "2011-01-05T00:00:00",
      "story": "My sister and I saw a 747 hovering in the air not moving forward or backward, just sitting still in the air about 1 mile away from the huntsville airport. It was a calm sunny morning.  There was no mistake that we both witnessed this, no possible way it was an illusion bc it was only about 100-200 feet off the ground and not far away at all.  I could not see what happened after we drove by bc there was a tree line along the road we were driving on.",
      "link": "http://www.nuforc.org/webreports/079/S79098.html",
      "state": "AL",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb885",
      "summary": "Hovering Glowing object for 2 hours near Huntsville Texas that moved around the western sky and appeard to shoot objects from it",
      "city": "huntsville",
      "shape": "light",
      "date": "2010-08-24T00:00:00",
      "story": "Hovering Glowing object for 2 hours near Huntsville Texas that moved around the western sky and appeard to shoot objects from it Tonight at approx 11pm my husband saw what looked initially like Mars in size and color.  He called me out after he had watched it fly quickly from one spot in the sky to another then stop, hover and go in circles.  he siad he saw it shoot something from it.  It was due west from our back porch.SO I came out to take a look.  It appeared to be over Huntsville Texas.   In a 2 hour period this thing hovered,went in circles horizontaly, pulsed in brightness and in size. It moved VERY quicly back and forth stood perfectly still and shot out something that shined very brightly at least twice, we both saw it happen the 2nd time.  Then the ejected object invisible, turned off its lights or burned up. As the time went on, it dropped lower than our trees.  We lost sight of itat approx 1AM.  I sat in my chair and anchored myself, because I thought maybe  My eyes were playing tricks on me.  But they were not!  This was definalty not a plane, not a helicopter, not a star, not a planet.  It appeared to have a glowing aura around it at times and I did see beams, now I dont know if that was coming from the craft or from a helicopter around it that might have been flying without its running lights.   The night was perfectly clear and it was in my sight for at least 2 hours. I hope others saw this and report it too!",
      "link": "http://www.nuforc.org/webreports/077/S77372.html",
      "state": "TX",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bb960",
      "summary": "Large orbs moving at a steady altitude and velocity",
      "city": "huntsville",
      "shape": "other",
      "date": "2010-07-10T00:00:00",
      "story": "Large orbs moving at a steady altitude and velocity We witnessed a total of four occurrences of visitor activity on the 4th of July 2010 in the Lake Forest Subdivision of Huntsville Alabama.   At 8:50 PM we saw a single large reddish orange glowing orb coming from the south moving slowing northward; it was very low, maybe 250 to 300' above the rooftops.  There was absolutely no sound being emitted from the illuminating sphere.  We watched it for about 5-10 minutes as it passed over our neighborhood and then got into our car and drove to the gas station at the corner of Martin and Zerdt roads.  We could see fireworks off in the distance so we sat in the car for about 15 minutes and watched.   As we drove home heading west on Martin Road, we saw a formation of 3 glowing orbs.  This time I really thought, hey these things are extraterrestrial and I want to make sure there not hot air balloons or helicopters.  So we slowed down to almost a complete stop, rolled down the windows to see if we could hear helicopter blades, but there was no sound at all.   And they were not hot air balloons.   We had traffic behind us, so we had to move on and we are not sure where they went, but assume they continued to move northward as did the first one.  We were sitting outside and then around 10 pm we saw one more solitary glowing orb, but at a higher altitude than the others and this one was either blinking, or something behind it was blinking and we watched it move northward as well, then the dog barked, we looked away and when we looked up again it had disappeared.   Then about 15 minutes later my boyfriend said, look at that satellite.  And I said, where?  Then I exclaimed, Wow, did you see that?   He said I sure did, wow!   We saw four distinct bright lights that looked like stars that were in a cluster which was kind of vibrating and then they formed into a line and just zip off into space on at a time very quickly.  It made warp speed seem slow, they just zipped up and off into space and where gone! in an instant.   Neither of us had ever witnessed anything like this before.  We believe that since the orbs were so slow moving and close to the ground there must have been a number of others who saw the same thing on that clear 4th of July night in Huntsville, Alabama. For the skeptics, I looked up sky lanterns and balloons on-line and just wanted to let you know that there was no way the first one or the second set of three that we saw were in any way sky lanterns. These illuminating things  were huge.  They moved steadily and with a purpose.  Not anything similar to a sky lantern and we were close enough to tell that they were not hot air balloons.   My boyfriend thinks they were as large as a VW bug and my estimate is a bit larger.  They did not flicker and produced an energy glow that was supernatural.   This is the first time I have ever looked at a ufo site and ever posted any such thing.   We are both of sound mind and we were not under the influence that night.   I'd like to know if anyone else has seen large orbs so closely?   Thanks.",
      "link": "http://www.nuforc.org/webreports/076/S76201.html",
      "state": "AL",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bc5bc",
      "summary": "Red moving dot above Alabama on July 4th",
      "city": "huntsville",
      "shape": "circle",
      "date": "2011-08-07T00:00:00",
      "story": "Red moving dot above Alabama on July 4th Me and my cousin were sitting outside watching and shooting fireworks when I noticed a red dot in the sky.   It appeared to be moving at first in a straight line, but then proceeding to go backwards then it stopped completely.   After watching it for a second I showed it to my cousin and watched it do the same. After turning my head for a brief second I looked back up and it was gone.  Ten minutes later it reappeared and made the same awkward movements before disappearing.   About an hour later I took her home on the other side of town, only to see the same object again, which my aunt also observed.",
      "link": "http://www.nuforc.org/webreports/082/S82616.html",
      "state": "AL",
      "duration": "1hr 15min"
    },
    {
      "_id": "64d005f478aba2ec5a3bcef7",
      "summary": "\"very aggressive''",
      "city": "huntsville",
      "shape": "triangle",
      "date": "2011-05-12T00:00:00",
      "story": "never done anything like this before...any how, may 6 around 10:10pm taken a short cut home on zierdt rd. in Huntsville AL., this road travels around 20 feet long side redstone arsenal for 3 or 4 miles, the object was coming at me from my driver side window very fast, i thought it was gonna crash into me, right when i thought that it took a very sharp turn behind the tree line, my wife told me to turn around, but i press the gas hard with my heart pumping...she didn't see it like i did...my guess is military object, it was blacker than black, no sound shaped like a perfect triangle, round white light close to each tip, and a bigger white round light in the center...crazy, my heart still races when i think about it...just seemed like it was trying to scare me?,\"very aggressive''...anyways that's my story...",
      "link": "http://www.nuforc.org/webreports/081/S81176.html",
      "state": "AL",
      "duration": "4-5 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bdd1f",
      "summary": "Amber light with circumference of light around it also. It moved fast,stopped, then bobbed before moving north.",
      "city": "huntsville",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Amber light with circumference of light around it also. It moved fast,stopped, then bobbed before moving north. My boyfriend and I were observing the sky when we noticed an amber light.  It caught our attention due to the speed, and nature of which it moved.  It traveled across the sky quickly before stopping and bobbing up and down before disappearing (or moving so fast we couldn't see) and reappearing much lower in the sky.  There was a dim circumference of light around the amber light also.  It stopped and bobbed for a few minutes more before receding to the north.",
      "link": "http://www.nuforc.org/webreports/092/S92780.html",
      "state": "AL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be6bf",
      "summary": "I saw an orange sphere move 30 miles in 5 seconds.",
      "city": "huntsville",
      "shape": "sphere",
      "date": "2012-04-18T00:00:00",
      "story": "I saw an orange sphere move 30 miles in 5 seconds. I was watching a jet liner moving N.E. at 30,000 ft.  plus when i saw a orange sphere moving at an incredible speed north to south.  My perception is it was at about 7000 ft.  It was not a meteore.  There was no firetrail or contrail.  There was no sound that came from it.  It covered 30 miles give or take in 5 seconds.  The sphere looked to be 100 ft across.  It was without a doubt in our atmosphere.",
      "link": "http://www.nuforc.org/webreports/088/S88096.html",
      "state": "AL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bed5e",
      "summary": "Orange fireball in South Huntsville in the eastern sky for about five minutes, no sound.",
      "city": "huntsville",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Orange fireball in South Huntsville in the eastern sky for about five minutes, no sound. Myself and two others watched a bright orange fireball in the eastern sky moving from south to north while sitting outside at night.  It looked to be very high in the night sky, at least as high as the planes fly around my house.I had gotten up from my seat and just happened to glance up in between two trees and saw the object. At first I thought it was a very large asteroid because of the size and brightness and yelled for my friends to come see.  After about 30 seconds the object was growing in brightness and starting to slow down.  Another minute or so passed and the object changed direction and started heading towards the east.  At this point I took out my iphone to record the object but had a hard time keeping it in frame or in focus. I did get about a minute of footage before I shut off the record function.  The object continued to move off to the east at a slow pace before blinking out after about another minute. Weather was calm, no ground level wind.  There was a scattering of clouds in the sky and they looked to be moving from the SW to the NE.",
      "link": "http://www.nuforc.org/webreports/100/S100565.html",
      "state": "AL",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf139",
      "summary": "Bright Light moved at a steady pace in a northeast direction. No sound. No blinking lights. Altitude appeared to be around 20,000 ft.",
      "city": "huntsville",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Bright Light moved at a steady pace in a northeast direction.  No sound.  No blinking lights.  Altitude appeared to be around 20,000 ft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98399.html",
      "state": "AL",
      "duration": "3:00"
    },
    {
      "_id": "64d005f478aba2ec5a3bf490",
      "summary": "Three orange orbs, not moving, in Huntsville, AL",
      "city": "huntsville",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "Three orange orbs, not moving, in Huntsville, AL I was letting my dog out in the backyard.  I looked directly south about 20-25 degrees over the horizon to see 3 orange orbs in mid-air.  I watched for approximately 15 seconds to see if they were moving then pulled out my iphone.  My phone's camera wasn't able to focus on the objects, they then disappeared.  The objects did not move, rise, or fall, they were stagnant, then were gone.",
      "link": "http://www.nuforc.org/webreports/098/S98567.html",
      "state": "AL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0321",
      "summary": "Three Orange lights appeared and than vanished.",
      "city": "huntsville",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Three Orange lights appeared and than vanished Three orange lights appeared and flew in triangle formation for about two minutes, after that they separated and vanished as if they turned the light off...",
      "link": "http://www.nuforc.org/webreports/097/S97687.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c08d3",
      "summary": "Small egg shaped with what looked like fire at the base.",
      "city": "huntsville",
      "shape": "",
      "date": "2014-03-18T00:00:00",
      "story": "small egg shaped with what looked like fire at the base of it flew very low (around 30 ft) went up and over trees then lost sight of it.",
      "link": "http://www.nuforc.org/webreports/107/S107536.html",
      "state": "AL",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b75",
      "summary": "Orange lights then triangle.",
      "city": "huntsville",
      "shape": "changing",
      "date": "2014-01-10T00:00:00",
      "story": "Orange lights then triangle Driving between New Market and Huntsville.  Noticed 3 orange lights and first thought that  we were viewing \"Orions Belt\" until the three lights moved into a semi-circle and then formed into a triangle.  Then two of the lights at the base of the triangle disappeared and the one in the point shot off very fast.  That was the end of the sighting.",
      "link": "http://www.nuforc.org/webreports/106/S106021.html",
      "state": "AL",
      "duration": "<4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e50",
      "summary": "I have been watching these lights... One was different colours that was straight down like 4 or 5 colours to it.",
      "city": "huntsville",
      "shape": "disk",
      "date": "2014-02-21T00:00:00",
      "story": "I have been watching these lights...  One was different colours that was straight down like 4 or 5 colours to it then all of sudden I seen a bright light going in behind my bf house down  behind the trees now it's like , it looks like it is searching for something,   I have been looking thou the binoculars n I see different types of colours , this is so freaky, I have been watching this since 4:30 am and this isn't the first time I seen it, we live on North Portage Rd, Huntsville, Ontario n it's south east of the house,  I don't have a camera only on my iPhone but it's too far away to take",
      "link": "http://www.nuforc.org/webreports/107/S107195.html",
      "state": "ON",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c118c",
      "summary": "Daylight-Saucer with cloud and two other lights.",
      "city": "huntsville",
      "shape": "disk",
      "date": "2014-01-16T00:00:00",
      "story": "Daylight-Saucer with cloud and two other lights p I was on my way to work when I noticed something flying in the sky in the distance. I watched  it, the sky was bright blue and sunny outside.  I watched the whole drive to work and saw it did not fly in a straight line, it was saucer shaped and not a helicopter or airplane.  It was highly reflective, I tried to take picture while on my way to work- I could still see it after I got to work way in the distance because the sun was bouncing off it so brightly. When I got home and reviewed the picture I took, I noticed a cloud i had only slightly paid attention to before because it was the only cloud in the sky looked peculiar to AND--Next to the cloud in my picture there are two super bright lights with trails behind them.  My picture of the saucer is so off in the distance you can't really see it bit upon examination the other two lights that I did not see while taking the picture are far more interesting. I took a picture immediately after and the cloud is dissipating and the two bright lights are gone",
      "link": "http://www.nuforc.org/webreports/106/S106276.html",
      "state": "AL",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1335",
      "summary": "Large Aircraft int he shape of a triangle, with each end having 1 red light.  Flying very low, and very fast.  Extremely loud.",
      "city": "huntsville",
      "shape": "triangle",
      "date": "2014-01-24T00:00:00",
      "story": "Large Aircraft int he shape of a triangle, with each end having 1 red light.  Flying very low, and very fast.  Extremely loud. About 2 am we heard a loud noise coming from outside, we had to see what it was so we got up and went outside, at first all we heard was the load noise sounding like an aircraft ya know the usual just was really loud more so then we normally hear.  Then it showed up in out sight,  It was big, and it look like an aircraft in the shape of a triangle and each point had 1 red light. so 3 red lights all together.  It was flying very low, and very fast.  It flew in a large circle about out house.  I have never seen something fly so fast in the sky.  Tonight is was very clear outside.  Lots of stars to the sky was pretty lite up.  It only lasted for maybe 3 mins the sound and when it flew in the circle. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106577.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1363",
      "summary": "Reddish orang light.",
      "city": "huntsville",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "Reddish orang light At approximately 20 to 40 degrees above the horizon, in the cloudless Southwestern night sky, I saw a reddish-orange non-blinking light with a brightness equivalent to Venus.  The light did not appear to be moving.  I turned to unlock my car and when I looked again it was not there.  I am a pilot.  The light was not typical for aviation.  There was no sound and the distance to the object was unknown. ((NUFORC Note:  The party who submitted the report elects to remain totally anonymous, and provides no contact information, so we are unable to contact the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104083.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17d7",
      "summary": "Three yellow lights surrounding a central red light were seen on a black, presumably triangular shape flying low and silently.",
      "city": "huntsville",
      "shape": "triangle",
      "date": "2014-07-11T00:00:00",
      "story": "Three yellow lights surrounding a central red light were seen on a black, presumably triangular shape flying low and silently. As I was driving home from a friend’s house just after 4:00 am during the month of March in 2013, I observed an event traveling extremely low (just above the trees) and silently above my car. I proceeded to stop my car to watch the event. The location was Huntsville, Alabama on Whitesburg Drive between Byrd Spring and Four Mile Post Road. I clearly observed three yellow-white lights in a triangular formation around a central red light. They were on an object (presumably triangular, though I did not have time to discern a clear outline) that I could observe because there were no stars visible between the lights. There was absolutely no sound associated with the event, and I presume it could not have been any sort of conventional aircraft due to this fact and the altitude of flight (again, just above the trees on the corner at which I stopped). The event passed slowly overhead until it passed out of view. I exited my car to look, but I could no longer see the event or any evidence of its passing. Although I cannot estimate the size of the event too accurately, it was well over twenty feet across by my best guess. As a note, I do not tend to acknowledge the existence of extraterrestrials here on Earth, and I know of no sort of powered flight that could run so low and silently. This is why I refer to this phenomenon as an “event” rather than a “craft” or “object.” I can provide no explanation as to the cause of this event, however. I am currently a student studying fields of natural sciences, so I tend to favor no explanation rather than one that is fantastical in my opinion. I am somewhat familiar with what I would categorize as “U.F.O. lore,” but I do not treat it as fact. I have never used illegal drugs, and I was neither on prescription medication nor was I intoxicated at the time of this event. This was my first and only encounter with an event of this type.",
      "link": "http://www.nuforc.org/webreports/111/S111270.html",
      "state": "AL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1fa0",
      "summary": "My husband and I had just returned from a memorial service for our pastor's father.we got home around 8:30 and my husband had taken our",
      "city": "huntsville",
      "shape": "other",
      "date": "2014-05-08T00:00:00",
      "story": "My husband and I had just returned from a memorial service for our pastor's father.  We got home around 8:30 and my husband had taken our dogs out.  He called for me to come outside and look at something and when I looked up toward the mountains behind our house (which is a deserted land trust and state park), I saw a straight line of 5-7 slowly blinking lights with vague colors of red and blue.  The line seemed at least 2 to 3 football fields long and moved at a constant steady speed.  We could not see any other shape but the perfect straight flashing line of lights.  It moved in a direct southern direction until it was out of sight. My husband and I have never seen anything like this before and are both fairly common sense people but we are very sure of what we saw.  My husband and I are well educated with him being a retired Army SFC and NASA engineer as well as an online missionary, and myself a retired successful interior designer. We were quite fascinated and of course perplexed, but very sure of what we saw.",
      "link": "http://www.nuforc.org/webreports/109/S109183.html",
      "state": "AL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2187",
      "summary": "Floating orbs that split into multiple orbs.",
      "city": "huntsville",
      "shape": "sphere",
      "date": "2014-04-11T00:00:00",
      "story": "Floating orbs that split into multiple orbs. On a clear day, myself and one other saw a strange white orb zigzagging and bobbing above us. The orb then split into two orbs, and the second orb split into a third. Now we see three orbs hovering and swirling, after a few seconds the orbs all return to the single orb we saw at first.  Very unsettling. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108479.html",
      "state": "AL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2246",
      "summary": "Orange orb seen.",
      "city": "huntsville",
      "shape": "light",
      "date": "2014-04-18T00:00:00",
      "story": "orange orb seen An orange orb, that made no noise ,was seen traveling parallel to whitesburg dr. heading towards governors dr.and huntsville hospital.  Myself and the witnesses saw the object from the back parking lot behind drakes (restaurant).   The object traveled completely straight and made a 90° turn left for approximately 100-200 feet and then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108630.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c22cf",
      "summary": "Drone or VTOL.  ((NUFORC Note:  Possible quad-copter??  PD))",
      "city": "huntsville",
      "shape": "cross",
      "date": "2014-04-18T00:00:00",
      "story": "Drone or VTOL Cross shaped flying object hovered anywhere from 20 ft off ground to 1000 ft off ground to where I could barely see it anymore.  Came back and just seemed to hover and then swoop back and forth.  Could be some sort of VTOL object.  It definitely was to precise and covered vast area to be remote control or civilian.  Perhaps not flying saucer but was some military drone. ((NUFORC Note:  Possible quad-copter??  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108707.html",
      "state": "AL",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2489",
      "summary": "Rectangle shaped UFO observed traveling at an extremely high rate of speed and sending out bright white propulsion as it traveled.",
      "city": "huntsville",
      "shape": "rectangle",
      "date": "2014-11-06T00:00:00",
      "story": "Rectangle shaped UFO observed traveling at an extremely high rate of speed and sending out bright white propulsion as it traveled. I observed a rectangle shaped UFO moving at a very high rate of speed and sending out bright white propulsion as it traveled.  The UFO seemed to be larger than an aircraft as I noticed that as it flew under a cloud.   My camera was aimed at 90 degrees upward..straight up in the sky when the UFO was recorded.  The UFO itself was dark in color.",
      "link": "http://www.nuforc.org/webreports/114/S114864.html",
      "state": "TX",
      "duration": "several seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c259a",
      "summary": "Flaming object I saw a bright blue and red flaming object in the sky over Huntsville , Al. It was going from East to West at about 2,00",
      "city": "huntsville",
      "shape": "changing",
      "date": "2014-11-06T00:00:00",
      "story": "Flaming object I saw a bright blue and red flaming object in the sky over Huntsville , Al.  It was going from East to West at about 2,000 feet and rapidly descending.  It made no sound and left no trail I could see.  I estimate speed at about 1500 to 2000 mph.",
      "link": "http://www.nuforc.org/webreports/114/S114946.html",
      "state": "AL",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d5c",
      "summary": "What WAS that?",
      "city": "huntsville",
      "shape": "cigar",
      "date": "2014-09-10T00:00:00",
      "story": "What WAS that? A saw a dark colored Cigar shaped UFO at approxiamently 7:30pm.  I noticed towards my right the clouds looked similar to a UFO so i glanced at it for a few seconds.  It was dark out; but, not quite dark yet and the clouds were darker than the sky.  As i began to seat myself, I noticed something moving across the sky in front of me.  My eyes were glued in wonder as it moved with glee across the atmosphere traveling left.  It didn't make a noise which is why i almost didn't see it.  It blended in with the sky like a 3D effect or maybe 4 or 5D.  Whatever that means.  I could not believe what i had seen.  It was like it defied gravity and that IS what it did.  It was amazing and wonderful to see.  It moved through the sky like that was what it was supposed to do.  Like nothing could tell it nothing.  As if it owned the sky!!  And there were no lights which made it even more unable to see.  It was so smooth.  IT DID NOT MAKE A SOUND!!!  I am truly amazed.  I thought I would never see this...  I always \"knew\" they were true!!  I now have my proof!!  Case is closed.  I was like, \"What is that?\"  It was moving so fast but not like super fast just gracefully fast.  I knew it couldn't be a plane or helicopter.  Birds are that that big and it did not flap.  I only saw it for maybe 5 or 6 seconds. I looked on for maybe 10 seconds more but i couldn't see it anymore though i tried. It vanished into the clouds and blended in so well.  It was gone!!  I did not want it to be. I knew it was gone.  It was there.  RIGHT THERE IN FRONT OF MY EYES and it was gone!!!  I cannot believe my eyes!!!  I can not identify what it was and so is I have actually saw an UFO!!   WOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOW!!!! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113295.html",
      "state": "AL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d1c",
      "summary": "Dark, quiet, large, slow moving, low flying object (about 2,000 ft. from the ground) seen N. bound into Huntsville, AL",
      "city": "huntsville",
      "shape": "chevron",
      "date": "2015-07-23T00:00:00",
      "story": "Dark, quiet, large, slow moving, low flying object (about 2,000 ft. from the ground) seen N. bound into Huntsville, AL Dark, quiet, large, slow moving, V-shaped and low flying object (about 2,000 ft. from the ground) seen North bound into Huntsville, AL.  Dim light, possibly reflected light, appeared to be on the top of the craft as it approached, but underside was very dark.  City ground lights helped to illuminate the object against the dark night sky.  Object moved at a constant low speed.  About 3 minutes prior to sighting, a low flying helicopter had flown South bound near about the same flight path, but of an altitude of only about 900 feet from the ground.  This is what brought attention to observing the night sky while smoking a cigarette.  It was too dark to take a photograph or video of the object.",
      "link": "http://www.nuforc.org/webreports/120/S120517.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d5b",
      "summary": "Object burning as it flew in a trajectory parallel to the ground, with flaming pieces.  ((NUFORC Note:  Satellite re-entry.  PD))",
      "city": "huntsville",
      "shape": "other",
      "date": "2015-07-03T00:00:00",
      "story": "Saw something burning as it flew in a trajectory parallel to the ground, with pieces flaming out behind it. My wife and I saw something burning and leaving burning parts behind it as it flew in a trajectory parallel to the ground.  We've seen meteors falling before, but this seemed to be flying much more slowly, closer to us, and very large.   We stopped the car near our home in Owens Cross Roads, AL.  The object or objects were in the sky to the east, moving right to left, south to north, at about 10 degrees up in the sky.   My wife got out with her i-Phone and tried to film it, but because it was so dark, the camera would not focus.   Towards the end of the trajectory, before the stream of fiery objects went behind trees in the distance, we saw one particularly big piece light up into a huge yellow flame.  We tried calling 911 but they were too focused on their script and were no help.   We called local police, but they just said they'd \"check into it.\"  It would be good if other people reported seeing the same thing, and if we could determine what it was.  We really hope it was not an airplane. ((ADDENDUM FROM WITNESS)) We're near Huntsville in Northern Alabama, not far from the Tennessee border. Not sure whether someone in NC or Georgia could have seen what we saw...it would depend on the time.  If they said 1:30 am, then it was probably the same thing (0030 Alabama (CST) time + 1 = 0130 EST). ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/119/S119816.html",
      "state": "AL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c605e",
      "summary": "Me and my friend saw to very bright space crafts pass by my house while we watching the stars.",
      "city": "huntsville",
      "shape": "cigar",
      "date": "2016-11-04T00:00:00",
      "story": "Me and my friend saw to very bright space crafts pass by my house while we watching the stars. We were staring at the stars and we noticed what we thought was a very bright star (it was also twinkling) and about 30 minutes later it started to move towards the tree line.  Then it was behind the tress completely and it would move in a random pattern until it came into the open sky and got brighter (it was changing colors from green, white, and red)  then it got almost blinding bright and seemed to get closer.  As it got closer it looked to be two space crafts, one big one shaped like a winged cigar shape and a second one trailing behind it that looked smaller and was shaped like a cylinder.  It sounded like an airplane that was shaky. When it passed by, nothing really happened after.  But before the space crafts came by, me and my friend were talking about a previous account of seeing a space craft in this area.  All in all, this was a very long experience and very stressful.",
      "link": "http://www.nuforc.org/webreports/130/S130973.html",
      "state": "AL",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c699d",
      "summary": "Above the skies in Huntsville.",
      "city": "huntsville",
      "shape": "disk",
      "date": "2017-03-17T00:00:00",
      "story": "Above the skies in Huntsville. I was on my way to work, coming off 565 West via exit 13 for Madison Blvd.  I happened to look in the sky and saw a bright, white or silver disc-shaped object in front of some clouds. From my perspective, the object was heading towards my right.  My first thought was that it was simply an airplane, although it appeared to be moving a bit fast for an airplane. However, its smooth appearance, lack of visible wings or propellers of any kind, and sheer brightness, made me think twice about that.  Having seen and watched many helicopters, I knew it wasn't a helicopter from its shape and the way it was moving through the sky. The object disappeared from my view, being blocked by some trees, and I didn't think anything of it, until I saw it heading from behind the trees going towards my left (again from my perspective)   At that point I had to make a turn, which led to the object being behind me and I lost sight of it.",
      "link": "http://www.nuforc.org/webreports/133/S133131.html",
      "state": "AL",
      "duration": "~6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c5b",
      "summary": "Two sets of tiny white objects flying in formation in bright blue sky",
      "city": "huntsville",
      "shape": "formation",
      "date": "2017-01-06T00:00:00",
      "story": "Two sets of tiny white objects flying in formation in bright blue sky I observed two apparently high flying objects on 12/30/16 from about 2:41 pm to 2:45 pm , moving west to east.  The objects, which were white, widely spaced, tiny pricks of light in an otherwise perfectly blue, clear sky moved in unison, with no visible difference in speed between them.  They were barely visible to the naked eye.  Polarized sun glasses helped make them much more visible due to their ability to darken the blue sky.   They moved out of sight to the east and moved in a very straight line the entire time of the observation.  Prevailing winds were light and westerly.  I photographed the objects with my full frame DSLR and was barely able to fit the objects in the same frame at 165mm focal length. I may have been content to believe they were balloons, but, approximately 8 or 10 minutes later, the same, or very similar objects were observed moving from north to south in very close formation, they were right next to each other.  They were observed for approximately a minute.  Their track appeared to be exactly perpendicular to that of the original two objects (I had a house dormer to compare them against), and they moved  in unison as the others did.  The wind  had not changed direction.",
      "link": "http://www.nuforc.org/webreports/132/S132048.html",
      "state": "AL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c705a",
      "summary": "Disc shape 3 green lights with odd movement.",
      "city": "huntsville",
      "shape": "disk",
      "date": "2017-08-11T00:00:00",
      "story": "Disc shape 3 green lights with odd movement. It was dark disc shaped craft, had 3 green lights on the bottom, and one really big white glowing light on the back.   It moved away from me, towards me, and straight up into the sky, all within a matter of a minute. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135608.html",
      "state": "AL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7684",
      "summary": "Green Light/Orb in Northwestern Sky in Huntsville, Alabama.  ((anonymous report))",
      "city": "huntsville",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "Green Light/Orb in Northwestern Sky in Huntsville, Alabama. My wife and I were driving west on I-565.  I glanced towards the northwest and saw a green light/orb studded then rapidly shoot toward the ground.  It wasn’t at a high elevation either so I didn’t think it was a shooting star.   There is a US government arsenal and a NASA branch here.  However, this happened over a populated civilian area.",
      "link": "http://www.nuforc.org/webreports/138/S138097.html",
      "state": "AL",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c791e",
      "summary": "During meteor shower, bright amber object, no blinking or other colored lights, entered field of view due west travelling east north ea",
      "city": "huntsville",
      "shape": "fireball",
      "date": "2017-12-14T00:00:00",
      "story": "During meteor shower, bright amber object, no blinking or other colored lights, entered field of view due west travelling east northeast directly overhead.  Silent, unseen on attempted video.  Domestic dog followed with eyes during instance, traversed full view of sky",
      "link": "http://www.nuforc.org/webreports/137/S137750.html",
      "state": "AL",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c79d8",
      "summary": "V-shaped Lights",
      "city": "huntsville",
      "shape": "chevron",
      "date": "2017-11-03T00:00:00",
      "story": "V-shaped Lights I was viewing the clear sky this morning, as I was walking across the parking lot in Research Park.  I was surprised to see a V-shaped pattern of lights going from North to South.  There was one lead light and maybe 3-4 lights equally distanced down each side.  It almost appeared that the body inside the object was translucent, it seemed that I could see through it.  I heard no sound and it appeared to be effortlessly gliding across the sky.  It passed over in five to ten seconds.",
      "link": "http://www.nuforc.org/webreports/136/S136959.html",
      "state": "AL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7bd2",
      "summary": "Saw ball of light move low to ground and back up.",
      "city": "huntsville",
      "shape": "circle",
      "date": "2017-10-19T00:00:00",
      "story": "Saw ball of light move low to ground and back up. Driving to work, I noticed what I thought to be a pretty, bright star.  As I was looking at it seemed to grow in size.  So I watched it more closely, it was definitely beginning to move. It first seemed to move towards me (west), growing brighter, but I turned north, and it continued moving in a west direction.  It got so low I could not see it through the trees any longer.  After about a minute it began to ascend and grew dimmer again until I lost visablity.",
      "link": "http://www.nuforc.org/webreports/136/S136770.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c81b7",
      "summary": "Cat and mouse with triangular ship on Hwy 36.  Whoa!  Really wierd.",
      "city": "huntsville",
      "shape": "triangle",
      "date": "2018-01-25T00:00:00",
      "story": "Cat and mouse with triangular ship on Hwy 36.  Whoa!  Really wierd. Going to Decatur on Hwy 36, beside First Christian Church, I saw a silvery triangular ship with green lights on each corner as it darted just 100 ft. over the tree line.  Wasn't shocked;  I saw a UFO in 1995, a large star-like one that came over our car.  Deadwood, Texas.  Huge and spherical with light from circular ports under the ship.   This triangular one I followed, like cat and mouse.  No lie!  It parked itself over the church and I got out to look.  The following week I was there again, same time, and saw a larger UFO sitting on the hill beside the junk yard as you approach Memorial Pkwy.  I thought it was a new tower with wide lights.  Upon approach I saw a disk ship, almost black, with lights fanning across the front.  Both UFOs sat motionless, hanging in the sky for at least five minutes before darting off to the south.",
      "link": "http://www.nuforc.org/webreports/138/S138480.html",
      "state": "AL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8640",
      "summary": "Thin, gray, wing-like object moving slowly south to north",
      "city": "huntsville",
      "shape": "chevron",
      "date": "2018-08-10T00:00:00",
      "story": "Thin, gray, wing-like object moving slowly south to north While mowing the grass, I took notice of an object moving in the partly cloudy sky.  The object reminded me of a glider with a very high aspect wing ratio (I would estimate about 25:1), and was a dull gray metallic color.  What I could not discern was any sign of engines, propellers, fuselage, or tail.  It was almost like a thick line, but slightly swept.  It was moving slowly from south to north.   I observed the object for approximately 10 seconds before it went out of view behind some trees.  It was only faintly visible due to its color, but my polarized sunglasses helped me see it better.  I could not tell its altitude, but it was below the high cirrus clouds, which I estimated to be 20,000 ft based on local air traffic, but above the lower, puffy cumulus clouds.  I tried and tried to see any other features, but there were none.  If it was a glider (I have seen plenty of those) or even a predator drone (we live near the Redstone Arsenal), its fuselage would have been visible, but was not.   Based on my observation, I would place the wing span somewhere around 300 ft, tip to tip. I have attached a rendering of the object I saw to a separate email. ((NUFORC Note:  Witness shares a high-quality computer-generated illustration of what he witnessed.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142500.html",
      "state": "AL",
      "duration": "10 seconds"
    }
  ]
}