{
  "city": "indianapolis",
  "fetch_timestamp": "2025-07-12T14:19:12.293144",
  "record_count": 170,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4953",
      "summary": "Sitting in my car seen 3 or 4 red and green flashes near Rockville rd and high school rd.",
      "city": "indianapolis",
      "shape": "flash",
      "date": "2019-08-23T00:00:00",
      "story": "Sitting in my car seen 3 or 4 red and green flashes near Rockville rd and high school rd.",
      "link": "http://www.nuforc.org/webreports/148/S148421.html",
      "state": "IN",
      "duration": "04:30"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a2b",
      "summary": "Fleet of oval ships moving east.  ((anonymous report))",
      "city": "indianapolis",
      "shape": "oval",
      "date": "2019-07-12T00:00:00",
      "story": "Fleet of oval ships moving east. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)",
      "link": "http://www.nuforc.org/webreports/147/S147434.html",
      "state": "IN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4bb8",
      "summary": "Small light moving erratically over shopping plaza high in sky",
      "city": "indianapolis",
      "shape": "light",
      "date": "2019-07-05T00:00:00",
      "story": "Small light moving erratically over shopping plaza high in sky. We were at a Laundry & Tan Connection, and my girlfriend said she saw something weird in the sky, from our car, far away, and couldn’t tell if it was a satellite or plane, and asked me.  I took a look, and noticed flashing lights so I said it was a plane.  I went back inside the laundromat and came back out about 25 minutes later, and my girlfriend pointed it out to me again, making a point of how erratic and quick its movements were.  I observed, and noticed the same.  It is moving too fast to be a conventional plane, and my girlfriend says that it’s too high up to be helicopter.   Her father is Air Force and has shown her various aircraft and she says it just isn’t moving right.  She says it’s almost moving like a fishing lure, jerking around a lot.",
      "link": "http://www.nuforc.org/webreports/147/S147184.html",
      "state": "IN",
      "duration": "~30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cd5",
      "summary": "Saw an electric blue light against the blue sky.  Clouds were out but minimal you could see thr",
      "city": "indianapolis",
      "shape": "light",
      "date": "2019-06-20T00:00:00",
      "story": "Walking my dog at dog park before noon.  Saw an electric blue light against the blue sky.   Clouds were out but minimal you could see through them.  It stood out but you had to really look to see it.  It went from one end of the park to the other.  I tried to video it w/ my IPhone 6S, but it didn’t show up on video until the last 2 sec.  It flew towards an industrial park 5 min from the dog park.   I stayed for about 10 min to see if it would come back, but I lost it.  On my way back home passing the industrial park on my right, there was a helicopter.  I was driving and couldn’t really tell, but to me it looked like it had no markings and it could have been a black helicopter.  There is a military base 10 min away from the park and industrial area.  I was driving and could not stop so I can't confirm it was a black helicopter.  I don’t think it a coincidence that I see a UFO and there’s a helicopter flying around the vicinity after.   I’m frustrated as the UFO only shows up o! n video the last 2 sec, when I clearly and visually saw it the whole time while recording.",
      "link": "http://www.nuforc.org/webreports/146/S146870.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e86",
      "summary": "Gravity-Defying Orbs in Triangle Shape.",
      "city": "indianapolis",
      "shape": "changing",
      "date": "2019-04-08T00:00:00",
      "story": "Gravity-Defying Orbs in Triangle Shape On the night of February 20th, my wife and I decided to step outside to take in the beautifully serene property of our recently purchased home.  Immediately upon stepping onto the back porch, we both looked up to see what we thought was a spotlight, even though where we live made that impossible.  I quickly stated that it must be the moon, while my wife directed my attention to the moon behind me, clearing up that mix up.   As we began to try and get a better look at the lights, a clear shape took form, there were 3 GIANT white orbs in a perfect triangular shape.  When I say GIANT, I truly mean that this craft (if one solid unit) must have been the size of a football field.  I work in an industry that allows me to make fairly accurate scale analysis in a moments notice and my brain simply could not process the shear scale of the craft(s).  I jumped up onto the bench on our back patio to peer over the roof top to see where it was moving and it appeared to be complet! ely silent and heading East towards Geist Reservoir.  Just as my wife joined me standing on the porch bench, it became very clear that this was not of earthly origin....the triangle shaped craft quickly split into three orbs that shot in all different directions, breaking the laws of physics that we live by.  And just like that, it was gone. I have lived with this unsettling event now for 2-1/2 months and still do not know how to process what I saw.  I steadfastly believe that this planet has been visited by ETs at some point in the history of mankind, but to see something with your own eyes, and know that there are millions others like me....it’s earth shattering.   I decided to share this information in the event it may help connect the dots to a bigger story, or at least preserve this event somewhere that it will not fall on deaf ears.   I pray almost nightly now, having never been a religious man...I pray that whatever that was will come back so I can try to rationalize what I saw.",
      "link": "http://www.nuforc.org/webreports/145/S145549.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5065",
      "summary": "Just west of Jupiter an orb shot up and to the left. It was floating. Another one popped up and floated the same direction. This happen",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2019-12-22T00:00:00",
      "story": "Just west of Jupiter an orb shot up and to the left. It was floating. Another one popped up and floated the same direction. This happen 6 times.They were never in the same location so it wasn't a repeat item. I ran in got my binoculars and spotted 12 more. I could follow the round orb across the sky with my binoculars. They were never in the same area nor the same angle of flight. I know what satelights are and these were not satelights. They were to big and to fast. They flew just above jupiter lower right to upper left. I ran in got my phone and tried to record a bunch more. I video taped for 20 minutes. I dont know if you can see them? The video isn't that good. It was amazing. Hair on my whole body stood up. Wow! Is all I can say",
      "link": "http://www.nuforc.org/webreports/151/S151821.html",
      "state": "IN",
      "duration": "1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b51e1",
      "summary": "Triangular object,got within 200 feet,stopped in mid air,took off like a rocket and dissapeared,never made any noise.",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "Triangular object,got within 200 feet,stopped in mid air,took off like a rocket and dissapeared,never made any noise. Seen but did not hear it aproaching from about half a mile away,it proceded to get within 200 feet at about 75 feet off the ground with no noise what soever.It was triangular in shape,dark grey or black in color,with a light on each of it's three tips.It was probably only going 20 mph.Once it got as close it was going to get,it stopped and just hung there in mid air and no noise was present.It stayed there for about 20 seconds or so,then with no noise it proceded to go in a strait line probably at a 45 degree angle towards the horizen,due south.And without slowing down,it shot out at a 90 degree angle at a super fast rate of speed and just plain dissapeared,no noise while this was going on.Me and my buddy were at the end of our street playing when we seen this sighting,we were 14 years old at the time. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63699.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b530c",
      "summary": "Ultra-fast fly-by of 2 ufo's with associated light, noise, energy, electrical interference, UV radiation",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "Ultra-fast fly-by of 2 ufo's with associated light, noise, energy, electrical interference, UV radiation I swear this account is entirely accurate and 100% honest based on my unforgettable recollection and account made immediately after the event. I would testify to this in a court of law before God. Myself, Philip Burke, and Wesley Jinks, all eagle scouts and college students, witnessed strikingly similar events. I won the poker game and we stepped outside so Phil could smoke a cigarette. Phil was smoking under the porch by the basement sliding door. Wesley was walking back from his car after getting his wallet so he could pay up for his poker loss and was turning the southeast corner of the house when this incident began. I was completely sober because the antibiotics I’m taking react violently with alcohol. It was between 2:55 and 3:00 AM, December 24th, 2006. I was centered on the east edge of my back patio off the basement. I was looking almost directly up at the northeast sky at maybe a 75 degree angle, attempting to look for the stars. It was evenly overcast that night with no rain and very little wind, about 40 degrees F and relatively calm outside. Very low level clouds in even formation meant that no stars could be seen. All three of us encountered two distinct identical waves of energy that streaked the sky with associated noise, light, and perceptible electric and magnetic energy unlike anything we had ever seen, heard or felt in our experience. I consider myself to have a sharp perceptional awareness and to be in touch with my senses. I was once missed by a lightning strike by 10 feet in a rainstorm and felt incredibly jolted, but this experience shocked or jolted me electrically ten times more than this previous lightning incident. I could tell the pulse was also very magnetic in nature, having had an MRI less than two months ago, and several in the past two years. I was mid sentence and went instantly silent when I was frozen by a sudden blast of energy coming from the sky. The blast originated in the west-northwest sky and moved east-southeast, crossing the entire sky from horizon to horizon in maybe two seconds, no idea as to altitude. There was initially no light associated with this blast, only pure energy. I could feel this energy. It coursed through my body. It felt like a concentrated pulse of electric and magnetic energy. This wave of energy that hit my body felt like the rush from jets doing a low altitude fly-by at an air show, only instead of wind, it was a burst of electric and magnetic energy that grew gradually, drastically spiked, then trailed off. As this pulse moved directly over my head it seemed to convey my entire body with it in the direction of its path. It was strongest at this point. I was frozen still in fear and my upper body wavered east-southeast as if I were getting pushed and pulled at the same time, only nothing physically touched me except energy. I moved my foot to keep myself from being pushed over, otherwise I feel as if I would have been knocked down. As this pulse approached, the associated noise quickly turned from a low drone or buzz to a tinny screech that was deafeningly loud for a fraction of a second then returned to a low drone. It was louder than anything I’ve ever heard for that brief fraction of a second when it seemed to pass overhead. I covered my ears but kept my eyes wide open. As this pulse approached and the drone got louder, the sky filled with an ambiance of alternating green and blue waves that seemed to radiate linearly and at short regular intervals out from the path of travel of this pulse. The waves lit the overcast sky more and more brightly during the pulse’s rapid approach, like they were being projected on the clouds from above the cloud ceiling. The brightness approached the brightness of day but everything around me had an eerie blue-green cast. An instant after the noise got unbearable, immediately as it began to subside, the entire sky filled with an array of every color in the visible spectrum for a brief instant, brighter than anything I have ever seen in the atmosphere, including the light of day at high noon. At this point I was facing east, looking up at a 45 degree angle. It seemed as if the pulse just passed. The sky was splotched with every color in the spectrum shining on the clouds in an instant dazzling array, predominately oranges and reds. It seemed as if a 3D electric matrix of visible fine lightning-like electricity filled the sky and approached from the east, went over my head. This matrix of many hundreds of tiny electric bolts, blue green in color, may have entered the lightning rods of my house. This is unclear because my eyes were still recovering from the brightness of the flash. The previous blue green waves mentioned may have lasted two seconds and grown in intensity, but this rainbow colored flash with the electrical matrix lasted maybe a quarter of a second. The power in the house then went off completely with no associated surge or fade. It just cut out then came back on about a second later. ! The neig hbor’s floodlight remained on. All was calm and quiet for a second or two and my fear caused me to begin to turn towards the house to seek cover as I still looked at the sky. I then remembered Wesley was out front and I stayed outside to see if he saw anything. As he was approaching from the southeast corner of the house, maybe 75 feet away, ALL OF WHAT I HAVE RECOLLECTED THUS FAR WAS REPEATED IDENTICALLY, only we were paying closer attention to the sky now, so it seemed more extreme. I’m uncertain whether it was or not. Both sets of pulses, flashes, buzzes, and power outages occurred in maybe ten or twelve seconds total. During the hour following this incident my ears hurt as if I had been at a rock concert that lasted for a week. My eyes hurt like I just walked out of a pitch black cave and stared at the sun. The cable TV and internet did not work until the next day. Once I regained my footing after the first blast, I felt like I was in instant shock, not from disbelief but from the actual energy inside me. I felt like I was filled to the brim with free electrons. My heart rate instantaneously spiked to its maximum and stayed there for quite some time. My body did sort of a hormonal dump, not quite like going into shock, but similar. It felt wonderful and terrible, as I imagine trying crack cocaine for the first time would be. These feelings gradually normalized over the course of two hours. Immediately after we came inside following the second pulse, we all confirmed something very, very weird just happened. I insisted no one speak of it and we all write separate personal accounts. Before we started writing, I ventured back outside and gazed at the sky for a couple minutes to find out if I could see anything else. The once thick cloud cover had opened to a strip of clear sky. This strip of clear sky was bordered by parallel lines of cloud cover on each side. The strip of clear sky appeared exactly where I sensed the two blasts had traveled horizontally through the sky from west northwest to east southeast. It looked as if the strip was opened by parting winds in opposite directions in the atmosphere. It stretched from horizon to horizon. I noticed Phil had dropped a lit cigarette on the ground. As I gathered paper I felt like I was on a mild dose of ten different drugs at once and my heart rate would not move from its peak. Wesley agreed to write an account, but Phil was ghost white and looked like he was about to have a heart attack. He noticed the cable TV signal had been lost (it worked fine before this incident) and opted for bed instead. Wesley and I did not speak to each other at all as we wrote, and only when we both finished did the results appear incredibly similar in every detail. While writing, I tried to relax and slow my racing pulse. As I did this, I experienced a euphoric pain free sensation originating in my spine and neck. I felt like I was five years old physically, except my heart ached like I was 80. As I wrote from maybe 3:10 AM to 4:30 AM this euphoric feeling gradually shifted from my spine to my muscles where I experienced major muscle relaxation. It seemed as if the electricity left me in waves starting at my core that rapidly moved to the surface. Each wave lasted about four seconds, and there must have been hundreds of them. As these hundreds of individual waves of electricity made it to the skin, I would get the strongest goosebumps I’ve ever had and my hair would stand on end, noticeably on my arms. The feeling of muscle relaxation progressed to the point where I collapsed with my arms and chest on the table for about ten minutes where I could not write. I was motionless, simply enjoying the feeling when I was suddenly overcome by a strange migraine centered immediately behind my right ear near the surface of the skin. It was intense and piercing, and caused me to pick myself up, no longer experiencing any positive feeling symptoms. This migraine was very short lived and disappeared completely after only a couple of minutes. I have no history of headaches and have been routinely staying awake until 2-4 AM for about a month straight, so I felt no undue fatigue during any of this whole experience. The headache was enough to convince me I should go to bed. I tried to think about other things and eventually fell asleep. I slept through the night and woke up the next day with a sunburn on my face and hands, with redness and mild pain. My medication makes me very sensitive to UV radiation and I have been avoiding the sun completely. I ate breakfast, but could not keep it down. The cable TV came back on suddenly at about noon. Let me know what you think. THIS WAS THE WEIRDEST OF THE WEIRD.",
      "link": "http://www.nuforc.org/webreports/063/S63647.html",
      "state": "IN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5339",
      "summary": "it was to far for me to get a good look at it,but fighter jets dont move like it did.",
      "city": "indianapolis",
      "shape": "flash",
      "date": "2006-10-30T00:00:00",
      "story": "it was to far for me to get a good look at it,but fighter jets dont move like it did. my girlfriend and i were sitting outside in our backyard when what we thought was a star start to move,but all at once it started to move in a zig zag motion,when out of no where it started to move in one direction at a fast speed enough to where it was hard to keep track of it.then about three nights later it happened in the same fashion.we have seen this 2 other times.im an army brat and i've been around alot of aircraft in my life and i can say i've never seen a jet or a chopper move like this did. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51872.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5578",
      "summary": "Large silver sphere/saucer-shaped object that hovered for several minutes. Emitted dots (in data-style format) from side.",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2007-02-01T00:00:00",
      "story": "Large silver sphere/saucer-shaped object that hovered for several minutes. Emitted dots (in data-style format) from side. I have never reported this, but if I could find some of my old neighbors, I'm sure someone else could confirm this, as many of us saw it.  It began very high in the sky as a bright light (apparently the setting sun reflecting from it). Many of us were outside because it was warm weather, didn't get dark until late...us kids playing back in the days when you had three channels on TV and all doors and windows open because no one had air conditioning.  The object descended very slowly, but was in a straight down descent...no shaking or moving otherwise. It eventually settled right over our street (Phillips Drive) and was huge. It sat there for several minutes. Strange how there were no airplanes going to Weir Cook Airport during the duration of this sighting...usually, we could expect a jet to fly over every 3-10 minutes...they would get low enough to rattle the windows because we were very close to the airport.  Many adults and children stood in their yards watching as word spread quickly.  This craft was directly over my front yard. It was silver in color. At one point, I distinctly saw what looked like six dots (we didn't have computers then, but now I know it looked like computer data) emitted from the left side of the vessel. They were in perfect order.  After the dots were emitted, the object began a very slow ascent, in the same pattern it had followed downward: straight up, gradually.  Eventually it ascended from our sight.  I think everyone on our street made phone calls trying to find out what it was. Dad called the airport and they said it was a weather balloon.  But it wasn't a weather balloon.  I'm now 45 years old and I have never forgotten this experience. I'm a lifelong community journalist and have seen a lot of things, but I have never seen anything to match this.  I wish I could find someone in the old neighborhood who remembers it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54117.html",
      "state": "IN",
      "duration": "20 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6072",
      "summary": "Very bright green light without sound moved over me and my car from a wooded area about a 1000 ft. up.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Very bright green light without sound moved over me and my car from a wooded area about a 1000 ft. up. I had just left my brothers house on new years eve late that night.  The new year had been in only about an hour.  As I got about a mile away from my brothers home, I noticed this \"very bright light\" in the distance, coming out of the sky and going down to the ground.   I didn't pay it any attention until I got closer to the source about two more miles towards home.  As I came up on this main street, this bright light came out of the sky again, and I thought it was a police hellicopter on some kind of patrol.  But then, \"I notice, there was NO noise coming from the light at all\" and the light was \"GREEN\", and it was glowing on me, my whole car, and around the area I and my car was in, about a 20 feet area.  I looked at my car, and it was green inside and out, and freen all over me.  It was so strange because no one else one on the mostly busy road but me.  The quite bright green light withdrew back up in the air to the source, and then vanished.  One of the strange things of it was there was a great \"silent\" during the whole thing, no noise of any motor, just silent. Later in that week, I noticed others on the t.v. news across the nation noticed the very same thing as I did, the bright light with a green glow that was too bright to look at.  I didn't tell my wife about it til about a month later.",
      "link": "http://www.nuforc.org/webreports/056/S56902.html",
      "state": "IN",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b60df",
      "summary": "I was casually observing stars in the clear night sky, when a somewhat brilliant white light high up in the northwestern sky caught my",
      "city": "indianapolis",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "I was casually observing stars in the clear night sky, when a somewhat brilliant white light high up in the northwestern sky caught my attention.  (It probably caught my attention because I had been outside about an hour earlier, it still being night, and I couldn’t recall seeing the light in that general part of the sky then.)  The light was about as bright as Jupiter, about 70 degrees above the horizon, and perfectly stationary in the constellation Cassiopeia.  The light was stationary for about 20 seconds, almost appearing as part of Cassiopeia.  Then, for a period of 2-3 seconds, it appeared to steadily ascend upwards into the sky across a very short distance (about 2 arc degrees), moving in a southerly direction, until diminishing in brightness and no longer visible.  I did not observe any lights, sounds, or movements from the light that would be commonly associated with common types of terrestrial aircraft. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55687.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6276",
      "summary": "Orange/red fireballs over Indianapolis.",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2007-10-08T00:00:00",
      "story": "Orange/red fireballs over Indianapolis. I walked outside to check the bbq grill around 9:15-9:20 as i checked the grill i looked up into the clear night and just north of the indianapolis airport and i saw 5 orange/red fireballs in a straight line coming from the east heading west and as they got just past the airport and it turned due south and went approx. 1 mile  and faded out. It also was totally silent as they floated through the dark sky and was very close to the ground.",
      "link": "http://www.nuforc.org/webreports/058/S58529.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b653d",
      "summary": "Bright red light over Indianapolis",
      "city": "indianapolis",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Bright red light over Indianapolis Witnessed bright red continous light coming from the east side of Indianapolis and proceeded to head in a southwest trajectory. Object appeared to be below cloud coverage when first sighted and then to appear to climb above the cloud coverage during the duration. Once the object started to move through cloud coverage the brightness of the light dimmed from bright red to a dull orange.",
      "link": "http://www.nuforc.org/webreports/057/S57381.html",
      "state": "IN",
      "duration": "2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6772",
      "summary": "Large Red Orb on Highway",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2007-02-01T00:00:00",
      "story": "Large Red Orb on Highway I was traveling southbound on I-465 sometime between 9 and 10 o'clock, there was a decent amount of traffic at the time.  Suddenly all the vehicles in front of me, most likely about 10 vehicles, came to panic stop as if there was an accident.  Then I saw a bright red orb, almost like the red dot from a laser pointer looks, but this orb was maybe a foot in diameter.  The red orb jumped up from in front of the cars ahead of me, then shifted to side of the highway in front of a sign. Everybody that had been stopped by this red orb speed away very quickly and most exited @the first exit which was Harding Ave.",
      "link": "http://www.nuforc.org/webreports/054/S54612.html",
      "state": "IN",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6801",
      "summary": "Multiple Triangle shaped UFO's in V formation, then slowly follow interstate in Indianapolis",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "Multiple Triangle shaped UFO's in V formation, then slowly follow interstate in Indianapolis On the morning of January 4th, 2008, just after midnight, my Fiancée and I were driving east on E 96th street in Indianapolis, IN. As we approached Indianapolis Metropolitan Airport&#8206; (a small Cessna airfield and flight school) to our north west, I noticed about 6 bright yellowish/white lights in a V pattern; only it looked more like a “check” because the last top-left area was not lit. I’m familiar with “Lights over Phoenix” and I called my good friend who is quite skeptical of the famous video. At this point, I assumed I was looking at a couple Cessnas doing night training, but I wanted to call my friend and tell him what I was seeing just for fun. While I was on the phone with him, my Fiancée pointed out that there was a 7th light now in the sky next to them- and much to my surprise, I looked up to see the 7th light duplicate to reveal an 8th light, which instantly glided into position, turning the “check” into a “V.”  Two minutes into the event, as we neared the small airport, it became evident that the lights were not tiny Cessna aircrafts. We could now also make out that each ball of light was in fact three large white lights, as if a commercial airliner had a large spherical light on the bottom-front of the plane and one large spherical light on each wing tip. About another 30 seconds passed and the “V” shape broke up and each aircraft began to pass over head. At a stop light, I opened my car door and stepped out to get a better look at these “planes.” It was when one was right over head that I noticed a tiny red beacon in the very center of the aircraft that was blinking. There were no stars in the sky, and I cannot 100% fully verify that the triangle shaped craft was connected all the way around- but for whatever reason, despite never seeing a photo of one, I just assumed it was triangle shaped. It’s like I could make out the darker matter. I couldn’t make out wings or anything, but my mind saw it as a triangle.  My fiancée asked me what was going on, and I told my friend I would call him back. I told her I thought the planes were actually “UFO’s” because at that point I had no idea what they were and I wanted to scare her. They were large, triangular shaped crafts who made no noise as they passed overhead. I’ll reiterate that it was midnight on a deserted street and literally no noise could be heard. I turned into an apartment complex and physically got out of my car and attempted to take a picture with my phone. My hand couldn’t stay still and with the VGA resolution I snapped a blurred picture that looked more like headlights than anything else. I deleted it when I got home (before I realized the significance of our encounter.)  Because I couldn’t bring myself to fathom alien crafts, and my fiancée didn't appreciate me trying to freak her out, I just assumed I was witnessing some new airliner which I’d never seen before and began to drive home. I took I-69 south and noticed one of the aircrafts following the highway. This struck me as extremely odd because I’ve lived in Indy for quite a while and never before had I seen a low flying airliner simply “follow” the highway. It passed overhead and I saw a few more off in the distance. It was actually really eerie. I’d never felt like that before.  I got home and Googled whether or not Indianapolis International had any delays or runways out, explaining why so many aircrafts were simply cruising around the city at low altitudes at midnight. Literally every flight was on time. That’s the last I thought about this event until today when I stumbled upon a website describing these triangle shaped UFO’s with three white lights and a center red beacon. I noticed how they mentioned these crafts fly low over populated areas, and even follow highways. When I read that line I literally got chills. I’m not going on record saying I witnessed alien crafts, but I will stand by my report that I saw exactly what all of these websites are describing as “triangle shaped UFOs.” The physical description and behaviors mimic exactly as what I witnessed. I felt that I had an obligation to tell somebody or some organization that I witnessed a number of these crafts. I’d sure like to know what they were. I’d draw you a picture but it would look exactly like the dozens out on the web right now, except the center red light was about a quarter of the size as the three white lights. Well, that’s that.",
      "link": "http://www.nuforc.org/webreports/061/S61684.html",
      "state": "IN",
      "duration": "1 hour?"
    },
    {
      "_id": "64d005f478aba2ec5a3b68f0",
      "summary": "Flaming object in sky.",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2007-08-07T00:00:00",
      "story": "Flaming object in sky It looked like a plane on fire. We all saw it. it was completely unexplainable. We were all (20 of us) sitting on the White River in Indianapolis launching fireworks. It flew over and looked like an open flame flying in the sky. Like a plane on fire. I really became amazed when someone in Connecticut filmed the exact same thing that we saw the night before - July 3rd.  They captured it on film and posted it on Youtube. http://www.youtube.com/watch?v=we5Zas7SBe0   We saw the EXACT same thing in Indiana on the 4th. ((NUFORC Note:  Video appears to show orange colored, self-luminous objects moving slowly across the sky.  We cannot certify the authenticity of the video, and we do not know what the objects were.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57481.html",
      "state": "IN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d39",
      "summary": "Light.  ((NUFORC Note:  Flare of Iridium satellite?  PD))",
      "city": "indianapolis",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "A faint point of light was gradually moving along high up in the night sky; the light was moving from south to north, nearly overhead of my position; the sky was clear.  After it passed over me, it faded from view.  Then, a few seconds later, after I shifted my stance to get a better view over the roof of my house, I saw a much brighter light somewhat to the side of where the aforementioned one faded; the brighter light was about as bright as Jupiter and gradually moving north.  There were no sounds or navigations lights emanating from any of the aforementioned lights.  Such observation is among the latest of several I’ve encountered since October 2006.  The report regarding the October 2006 observation is posted on NUFORC’s online report database (http://www.nuforc.org/webreports/055/S55687.html).  Incidentally, I was a weather observer in the Air National Guard several years ago and thus trained to identify meteorological phenomenon as well as other sky activities.  Though I can’t conclude what exactly the lights are or what they represent, they nevertheless unusual. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Flare of Iridium satellite?  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57660.html",
      "state": "IN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b76ba",
      "summary": "On August 10,2007, at 12:20 AM, my Grandson and I where coming home from seeing a Spiderman movie.  We where on Madison Ave heading nor",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2007-08-14T00:00:00",
      "story": "On August 10, 2007,  at 12:20 AM, my Grandson and I where coming home from seeing a Spiderman movie.  We where on Madison Ave heading north.   My Grandson and I notice what we thought was a helicopter flying low at the intersection of Stop 11 and Madison Ave.  I told my Grandson that it was flying to low, and maybe it was a police helicopter looking for some one.  As I drove closer I notice one yellow and two white lights at which the white lights where  going on and off.  The yellow light stayed on.   As we got closer we could tell it was not a helicopter, and it was hovering above Stop 11 and Madison Ave.  I pulled into Egg Roll King Restaurant and stop my car to take a look, my Grandson got out of the car, I stay in the car.  It wasn't a plane or helicopter.  Both of us could see the bottom clearly.  The bottom looked like a triangle shape, I could see metal beams two on each side of the triangle.  I could not see the top, cause we where underneath the object.  The only lights we seen where on the bottom of the triangle.  The white lights we going off intermittently as the yellow stayed on.  I could see the outline above the triangle of the object.  It appeared to be somewhat oval shaped, and what I mean by that there where two spots where it protruded out and it equal in shape, opposite each other.  The color of the object was metallic, the triangle beams where of a black color.  We watched this object from one 1-2 minutes, then it started to move to the south slowly, then to the west.  We got back into the car and followed it for about half and hour, it want faster then higher and higher then disappeared.  I never in my whole life seen anything like it.  There also was no sound coming from it. I am also sending a picture, it's not the best drawing, but it it close to what we saw.  Thank you",
      "link": "http://www.nuforc.org/webreports/058/S58075.html",
      "state": "IN",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b79e7",
      "summary": "Odd formation over Indy around 3 am",
      "city": "indianapolis",
      "shape": "formation",
      "date": "2007-06-12T00:00:00",
      "story": "Odd formation over Indy around 3 am I saw a very odd formation of 3 lights traveling at an unnatural rate of speed across the dark sky over Geist Lake.  They were in some kind of triangle but the triangle was unlike any formation that a terrestrial craft would fly in.  It seemed as if they were miles apart. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57039.html",
      "state": "IN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d39",
      "summary": "Witnessed 15-18 lights in a V formation move from northeast to southwest across the north side of Indianapolis.  Lights moved about 90",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2006-12-14T00:00:00",
      "story": "Witnessed 15-18 lights in a V formation move from northeast to southwest across the north side of Indianapolis.  Lights moved about 90 degrees across the sky in less then 30 second. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53864.html",
      "state": "IN",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8039",
      "summary": "2 white lights moving at same speed in same direction.  ((NUFORC Note:  ISS and Space Shuttle in formation.  PD))",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "2 white lights moving at same speed in same direction Was taking dogs out for walk, looked up and saw 2 white lights moving in exactly same flight pattern at exactly same speed.  No strobes at all. No sound at all. They followed each other from west to east and I and my husband watched them until they disappeared. ((NUFORC Note:  ISS and Space Shuttle in formation.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72181.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b80b2",
      "summary": "1980's circular UFO seen while driving.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "1980's circular UFO seen while driving. This happened back in the early 80's. (81-82ish)  My grandfather, uncle and I were driving back to Lima, Ohio from a stamp and coin show in Indianapolis, Indiana. It was already dark out (not sure of the season, but I don't recall it being winter).  We were on the highway (I believe it's highway 70) and I was sleeping in the back seat of the car. I was awakened by the sound of my grandfather and uncle trying taking about something they were looking at. I leaned forward over the front seat and saw a large circular object in the sky, it had white lights on the bottom and red lights on it's sides (it might have been red on bottom and white on the sides, it was long ago). You could tell by the movement of the lights that the object was spinning. My grandfather tried to tell me it was a small plane pulling a lit up banner, but even at 11-12 yrs old I knew what we were seeing. I had a chance to talk to my uncle about this even earlier this year at a reunion and he said, \"I don't know what that was, but it was not a plane pulling a banner, we told you that so you wouldn't be frightened.\" ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65872.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b859e",
      "summary": "Rectangular shaped object hovering on Northeast side of Indy",
      "city": "indianapolis",
      "shape": "rectangle",
      "date": "2009-01-10T00:00:00",
      "story": "Rectangular shaped object hovering on Northeast side of Indy While driving south on US 37 (Binford) around 7:30 pm I noticed a rectangular shaped object hovering , then move east slowly and at an irregular pace.   It must have turned 90 degrees, because then it appeared to be a thin line.  I didn't see any lights, but it was solid and appeared silver.   It kept heading east(hovering, then moving slowly) and disappeared behind trees.   I was so tempted to follow, but I wasn't really sure what I was looking at, I was headed to a fitness class and I didn't want to piss any aliens off.  I really wish I had a camera with me because it was definitely unlike anything I've seen before.    I always thought UFOs were supposed to be round or at least more aerodynamic? ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66745.html",
      "state": "IN",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3b8757",
      "summary": "U/ V shaped gray object. Smaller sphere shaped object near it, no lights or sounds on either.",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "U/ V shaped gray object. Smaller sphere shaped object near it, no lights or sounds on either. We were heading south on the road, and saw a few people standing in their yard looking up at the sky, a couple houses down we noticed another family looking high in the sky with binoculars. We looked up and saw what they were looking at as we pulled off the road. High in the Southern sky the left and above of the moon was a very clear u/v -shaped object. It appeared to be gray.  Below it a small distance was a smaller object, it was not as clear, it was more of a sphere shape but I cannot be sure on that. We did NOT see any lights or sounds. The v- shaped object was very high and small in the sky but still had a very distinct shape. It didn't not move at all although my husband said he thought it might have been rotating horizontally. We watched for about 10 minutes with no change, This was at sunset; We scanned the sky to see if there were anymore around, after that we lost them. We did not see them fly away, they were just gone. We have been trying to figure out if anyone else has reported this besides the people who were near us tonight. We have never seen a UFO and are no sure what to think about it or how to find out if there is any information about this sighting.",
      "link": "http://www.nuforc.org/webreports/066/S66634.html",
      "state": "IN",
      "duration": "unsure"
    },
    {
      "_id": "64d005f478aba2ec5a3b8813",
      "summary": "((HOAX??))  Object changed shape and left  a tree flew away-in a 3-4point array shape-like a hat or disc-was gone-30secs or less.1",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "Object changed shape and left  a tree flew away-in a 3-4point array shape-like a hat or disc-was gone-30secs or less.1 ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  Possible hoax, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65408.html",
      "state": "IN",
      "duration": "30seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b79",
      "summary": "MY SON SAID, \"MOMMY, THERE ARE FOUR LIGHTS IN THE SKY THAT LOOK LIKE A UFO!!!!!",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2010-04-13T00:00:00",
      "story": "MY SON SAID, \"MOMMY, THERE ARE FOUR LIGHTS IN THE SKY THAT LOOK LIKE A UFO!!!!!   IT WAS ABOUT 9:00 PM IN THE SPRING OF 08.  MY SON WANTED A TOY FROM THE CAR, SO I TOLD HIM TO GO GET IT.  SUDDENLY, HE CAME RUNNING IN AND SAID, \"MOMMY, THERE ARE FOUR LIGHTS IN THE SKY THAT LOOK LIKE A UFO!   I HAVE ALWAYS BELIEVED BUT THIS WAS A STRETCH.  I STEPPED OUTSIDE AND THERE IT WAS!  I REALLY WAS INSTANTLY IN SHOCK.  I LOOKED TRYING TO COME UP WITH ANYTHING THAT IT COULD BE BESIDES THE ONE THING I HAD HOPED TO ALWAYS SEE.  NOTHING. THERE WAS NOTHING ELSE IT COULD BE. IT WAS PRETTY LARGE AND THE DETAILS ARE MISSING BECAUSE IT WAS IN A CLOUD OF MIST.  IT WAS TO LOW TO BE AN ACTUAL CLOUD.  IT WAS ABOUT 40 FT IT SEEMED, MAYBE MORE, FROM THE TOP OF MY NEIGHBORS HOUSE.  THROUGH THE CLOUDS IT WAS EMITTING 4 DIFFERENT LIGHTS.  DIMMED OF COURSE, THE COLORS LOOKED AS IF THEY WERE PINK, BLUE, GREEN, WHITE OR CLEAR.  THEY DID BLINK IN A PATTERN. THERE WAS NO SOUND AS IT HOVERED WITH NO MOVEMENT.  I SUDDENLY HAD A FEELING OF FEAR BECAUSE MY SON WAS STILL OUTSIDE WITH ME.  I GRABBED HIS ARM AND WENT INSIDE. AT THIS POINT I WAS PRETTY SHOOK UP AND TOLD MY BOYFRIEND TO LOOK OUTSIDE.  I KNOW HE SAW IT, BUT HE IS NOT A BELIEVER.  TO THIS DAY HE DENIES SEEING ANYTHING (POTENTIAL WITNESS).   AT THIS POINT I WAS STILL PRETTY SCARED, SO I KEPT LOOKING OUT MY SIDE DOOR TO SEE IF IT WAS STILL THERE.  MY GUESS IS IT STAYED FOR PROBABLY ANOTHER 10 MINUTES.  THE STRANGEST PART TO ME IS I DIDNT REACT THE WAY I THOUGHT I WOULD HAVE.  THE WHOLE EXPERIENCE SEEMS EERIE.  I WOULD HAVE TAKEN A PICTURE, CALLED SOMEONE, OR STAYED OUTSIDE BY MYSELF TILL IT HAD LEFT BUT, I DIDNT.  I DONT REMEMBER MUCH ELSE FROM THAT NIGHT.  THE NEIGHBORS WERE RETIRED NUNS.  I DIDNT ASK THEM ABOUT ANYTHING OUT OF EMBARRASMENT AND OBVIOUSLY THEIR STRONG RELIGIOUS BACKGROUND.  I DID NOTICE SOME INJURIES RIGHT AFTER.  THAT THEY SAID WAS DUE TO SURGERY ON BOTH (AT THE SAME TIME?).   THEN AFTER LIVING THERE FOR MANY YEARS THEY UPPED AND MOVED TO THEIR OLD PARISH.  I NOW KICK MYSELF FOR NOT ASKING ANYTHING ABOUT THAT NIGHT. EVEN STRANGER FOR ME, I DIDNT SAY ANYTHING FOR ABOUT 2 DAYS ABOUT WHAT I HAD SEEN.  I HAD COMPLETELY FORGOTTEN OR BLOCKED OUT, I DONT KNOW,  THE WHOLE THING UNTIL MY BOYFRIEND STARTED TO MAKE FUN OF ME ABOUT WHAT I HAD SAW.  I WOULD HAVE AT LEAST CALLED MY DAD AS WE HAVE A MUTUAL INTEREST IN THE MATTER.  I CANT STOP THINKING ABOUT ALL THAT HAPPENED?  HAS ANYONE HAD A SIMILAR SIGHTING OR EXPERIENCE (WEIRD FEELING, CANT EXPLAIN)?  I WAS COMPLETELY FLOORED!  HOW COULD I FORGET ABOUT SOMETHING THAT HAD BEEN SO IMPORTANT TO ME IN MY PAST, AS WELL AS, NOW IN MY PRESENT?  I AM REALLY BOTHERED BY THIS WITH NO ONE TO TALK TO ABOUT IT.  EVERYONE I KNOW THINKS ITS CRAZY, AM I?   THERE IS SO MUCH EVIDENCE OUT THERE WHY THE SECRECY FROM OUR GOVERNMENTS!  WE NEED TO DEMAND ANSWERS! ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74396.html",
      "state": "IN",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f86",
      "summary": "Seven faint white lights in triangle shape (one light leading with 2 lights following and two lights again and two more lights that out",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Seven faint white lights in triangle shape (one light leading with 2 lights following and two lights again and two more lights that outlined the triangle shape) appeared to be one unit - not seven separate units that floated low and slowly and may have rippled from south west to north east...",
      "link": "http://www.nuforc.org/webreports/067/S67066.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ffc",
      "summary": "Orange \"flaming\" light rising, then abruptly changing directions and slowly disappearing in the horizon.",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "orange \"flaming\" light rising, then abruptly changing directions and slowly disappearing in the horizon. I was sitting outside my front door when an orange light, flickering as if it were a ball of fire, seemingly rose out of the north. My initial reaction, since it's Halloween night, was that it was a roman candle, It stopped rising then appeared stationary, it slowly moved south then turned abruptly to the east and went at a slow but steady pace, and also started to rise.  It continued in the same direction and same rate of rising until it eventually disappeared in the horizon.  It had just gotten dark but the moon was shining brightly.  There were very few clouds.  The next door neighbor was sitting on her porch and I asked her if she could see it, she looked up and said 'yes'. We didn't discuss it further. Right after it rose and stopped, I opened the door and asked my wife to come and see it, she watched for the duration.  Oddly enough, we had seen (and reported) the exact same thing in the summer of 2008, which as it turned out, had been seen and reported by p! eople throughout Indiana and Michigan.",
      "link": "http://www.nuforc.org/webreports/073/S73096.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b90ed",
      "summary": "silent, V shaped object with reddish-orange glimmering light at the bottom of the V moving NE to SW.",
      "city": "indianapolis",
      "shape": "other",
      "date": "2008-08-12T00:00:00",
      "story": "silent, V shaped object with reddish-orange glimmering light at the bottom of the V moving NE to SW. Flew from the northeast to southwest about 11:00 PM, then turned directly south and made an abrupt turn west. Not a right angle, but a very tight turn. Bright, almost throbbing orange-reddish glimmering light. I was watching TV and noticed the odd light out the window, I went to look, at first thought it was an airplane on fire, my wife and I went outside and watched it for about five minutes as it made it's way from the northeast, turn south then go west. It wasn't moving very fast at all, but steadily progressing. When it made its turn, it was near enough that we would have heard if it was a plane, but there was no sound. Do to the high cloud ceiling, we could also then see the shape against the clouds, looked somewhat like an upright \"V\", the ends pointing upward and the glimmering light at the bottom. And by glimmering, it was kind of throbbing, but with no certain pattern, that's why I first thought it was a plane on fire. The airport is to the west, but it wasn't following the line the planes normally do and passed by to the south of Indianapolis International Airport. I host an internet message board pertaining to automobile racing and I asked if anyone else in the Indy area had seen it. Many people were still outside at the time veiwing fireworks. I had 2 responses on the message board from people in the Indy area that had witnessed the same object and both had the same reaction I had. I work in the insurance industry and my wife is a registered nurse.",
      "link": "http://www.nuforc.org/webreports/064/S64344.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b931a",
      "summary": "A flying white and red flashing saucer flew over my house",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2008-08-12T00:00:00",
      "story": "A flying white and red flashing saucer flew over my house I was looking out the window at about 11:50 pm july 7th 2008. i saw a flying saucer type thing. it hade white lights around the base and on the bottem it had red lights. It was just a saucer flying over my backyard. im freaked out",
      "link": "http://www.nuforc.org/webreports/064/S64406.html",
      "state": "IN",
      "duration": "5:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9394",
      "summary": "horizontal zig zagging white light",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2008-08-12T00:00:00",
      "story": "horizontal zig zagging white light We saw a long white streak across the horizon. zig zag motion from north to south.Was similar to a lightning bolt, but was it was not lightning. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64415.html",
      "state": "IN",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b94b1",
      "summary": "Triangle shape with spinning circle on bottom,  no sound, southside of Indianapolis, saw more on eastside.",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Triangle shape with spinning circle on bottom,  no sound, southside of Indianapolis, saw more on eastside. Me and my friend left my house about 7:30pm(est) when i looked up at the sky enjoying all the stars that were out, i noticed this really bright star. I told my friend this star could be for me. I told her i don't know if i should make a wish or what. Well we traveled to 86th and Hague Rd back to my house and then to the southside on the interstate. All this time this star is getting closer as we head south. We were about 1/4 mile from the Raymond exit when we noticed this star was moving toward the interstate. My friend was like is that a round thing, i said OMG what is that. There were other cars on the highway that night but i don't know how to find them to see if they saw the same thing. It dissappeared. Were looking out of the windows and was like where did it go. We then both kinda looked out the whinshield window and it was just hoovering over us with no sound. we saw a rediculous amount of lights. We were so scared, we had never seen anything like this before. I just want to know what they are or were. No one believes us, i feel so crazy right now. Can anyone let me know if they saw the same thing or was my mind playing tricks on me. We saw quite a few of them that night the whole thing had to last for about 2 1/2 to 4 1/2 hours. we sat over a relitives house on the southside for about 2 hours and came back to my house on the eastside and saw another one.",
      "link": "http://www.nuforc.org/webreports/068/S68632.html",
      "state": "IN",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b9565",
      "summary": "Black Triaglular aircraft with two white lights and one red going across Indianapolis sky.",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2010-06-03T00:00:00",
      "story": "Black Triaglular aircraft with two white lights and one red going across Indianapolis sky. Right after working at a concert, my brother-in-law and sister were driving home with me in the back of the car.  We were driving past firehouse number 20, and a Kroger.  And, I seen a thing in the sky that I was just watching.  And, when it went above us and past the clouds, it looked like a black triangle with 3 lights, like nothing I have ever seen.  Two of the lights were white and one was red, and it looked to be moving pretty quickly.  Then we drove past it, and it was back in the clouds again going to the left... with firehouse 20 and kroger to the right.",
      "link": "http://www.nuforc.org/webreports/075/S75402.html",
      "state": "IN",
      "duration": "1 minute driving past"
    },
    {
      "_id": "64d005f478aba2ec5a3b9543",
      "summary": "A multi-titled, multi-colored possibly foursided pyramid seen before I entered 2nd grade, brother saw same thing years later.",
      "city": "indianapolis",
      "shape": "other",
      "date": "2009-06-09T00:00:00",
      "story": "A multi-titled, multi-colored possibly foursided pyramid seen before I entered 2nd grade, brother saw same thing years later. My parents still tell a story about how when I was about to start 2nd grade during our family prayers I jumped up crying and hid in the closet in the room that me and my sister shared.  I told them that I was afraid to go to 2nd grade when in fact I was scared of what I had just seen out my window.  My bed was right next a large, nearly full wall window that faced our backyard in the room that I shared with my older sister.  My parents sat on the floor and my sister was in her bed and I was in mine. I remember being bored, per usual, and staring out the window when this...pyramid I suppose floated casually past the window.  It wasn't like any of the pyramid's I've looked up online.  I guess those are like black triangles with lights on their corners?  This was covered in little metallic/chrome-ish rectangles that were either silver or lighting up different colors.  I remember pinks and yellows and blues so nearly primary colors, but you could tell they were still metallic silver underneath.  It was weird and seemed to lazily float past.  It didn't seem to be propelled by anything and didn't seem to be in any sort of hurry. Ok and I get it, I was little could have just been my mind messing with me and I can't remember if it was four sided (feel like it was) or three because I only saw it in profile and in my memory it looks like it floated right between my house and the gazebo on our deck which is only about 25 feet or so, so there are clearly some missing pieces.  Also I remember it was completely silent.  The thing that has finally brought this up in my mind again after 15 years is that my brother is a sophomore in college now and lives in my house here and we were talking about random weird stuff that happened in our old house (which was a lot...I don’t know if that relates either) when he told me that when he'd been in about 2nd grade he'd been woken up two nights in a row by multi colored lights outside his window on the 2nd story but facing the street not the yard. He said he didn't see any object making them the 1st night because it'd been so bright but that the 2nd he'd seen a pyramid type object. I'd never told anyone about what I'd seen and neither had he till we had this conversation.  Now we just want to know if there’s anyone else who possibly has seen something like this because after looking it up forever and all over the internet I can’t find anything. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70349.html",
      "state": "IN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a03",
      "summary": "dark, slow, still, red lights, on Shadeland Ave. where my aunt had seen UFO 3 years ago",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "dark, slow, still, red lights, on Shadeland Ave. where my aunt had seen UFO 3 years ago I was driving and I a looked up in the sky and I saw something shoot up like a shooting star.so I continued driving and I was at the light and I saw a disk like shape hovering in the sky. It had red lights around it, blinking. When I looked back once again it was gone.I was in traffic so more than one person probaly saw it",
      "link": "http://www.nuforc.org/webreports/067/S67468.html",
      "state": "IN",
      "duration": "UFO Sighting"
    },
    {
      "_id": "64d005f478aba2ec5a3b9cef",
      "summary": "I saw a redish colored orb that was \"observing lighting show thunderstorms\" & it displayed 2 amazing climbs and a huge burst of speed.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2010-06-10T00:00:00",
      "story": "I saw a reddish colored orb that was \"observing lighting show thunderstorms\" & it displayed 2 amazing climbs and a huge burst of speed. I was the captain, flying a four engine turbine powered aircraft (L-188) at flight level 230 (23,000 feet) inbound toward Indianapolis, Indiana, thence cleared to Ft. Wayne for the Detroit Star Ft. Wayne transition into YIP (Yipsilanti, Willow Run Airport, Mich.)  That’s a  'standard terminal arrival route.'   I was on a heading of about 030 degrees.  Both my first officer & flight engineer were doing other duties when I first spotted traffic at my 1100 position, 10 miles & slightly below me.  As captain, I always kept the red instrument panel lighting at a absolute minimum setting so as to have the best visibility outside.   I first spotted a cranberry red light.  It appeared as if it were just another aircraft in the clear night sky, no shape or size, just a red light in level steady flight about 4000 feet below me & 10 miles to my left moving left to right at a steady speed of about 400 knots, about the same speed I was doing.  The size of the light was just like any other aircraft’s rotating beacon or light, but this was a constant steady light, not like a normal pulsating rotating beacon that aircraft are required to have.  I noticed in was headed straight towards a large thunderstorm cloud that was at my 1 o'clock position and 10 miles.  This thunderstorm had constant & consistent in-cloud to in-cloud lighting strikes that really was lighting up the large cloud like a Chinese lantern.  The red light kept a steady 400 knot speed aiming right at the storm cloud.   Then when it got to within 200 yards of the thundercloud itself, the red light changed course from 110 degree direction to a 250 degree direction, instantly, still maintaining the constant 400 knot speed.  It didn't turn, like an aircraft makes a turn, it just changed course, instantly, like a curser on a computer is capable of doing when you jerk your mouse control quickly left to right.  Now it was heading straight towards a long line of constant lighting thunder storms, or squall line, that was at my 9 o'clock position and about 20 miles off my left wing tip.  As I watched the light move at a constant speed from my right to my left directly in front of me, it suddenly climbed at a perfect 45 degree up angle, leveled off for a about 2 miles and then climbed again at a perfect 45 degree up angle without any change in speed either time, to an altitude about 3000 feet above me.  It then turned slightly right to a heading of about 250 degrees straight toward a point just in front of the first of a long line of constant lighting thunderstorms. As soon as the red orb got established on the new heading towards the all lit up lightning squall line to my left, this red light went from its 400 knot speed to, I'm going to guess between 2ooo to 3000 miles per hour for about one long second then it again immediately went back to its slower 400 knot constant speed again.  It covered that 20 mile distance in just over a second, someone should be able to turn that into a speed in miles per hour.  It didn't accelerate up to that speed and it didn't decelerate back to the slower speed again, it just made an instant jump from a slow 400 knots to a really fast 3000 knot speed, for just over a second, covering the 20 mile distance and then immediately back to the same slower speed of about 400 knots.  It was amazing to watch.  After being a airline captain for over ten years I have never ever, before or since seen an object under such obvious control that maneuvered & changed speed instantly, at will, so they could maneuver to and observe the constant & consistent thunderstorm light show display. I watched it make one more turn to its left, a heading of about 190 degrees so as to parallel this long line of constant light shows off to its right side.  It was then behind me to my 8 o'clock position.  I brought the attention of my other two crewmembers just before the red light made its two 45 degree climbs, they saw that but couldn't see to jump in speed an jump back in speed because it was off to the left side of our aircraft.   It was under something’s control, sightseeing at thunderstorm light shows in the night, making 45 degree climbs and capable of unknown speeds that amazed me to the point that I only thought was to turn off my rotating beacon/navigation wing-tip lights to hide my aircraft in the dark from its view.  But I didn't even think to call Indy ARTCC and ask if they had it on their radar.   My two other crewmembers really didn't grasp what I quickly brought to their attention, it all was over in 2 minutes.  I saw something amazing, I don't know what it was, I just hope it was from Earth. I was an ATP, flying four engine aircraft all over North, South America and Europe, for about 30 of my 40 years aviation life, and I never even came close to having an accident.  I was lucky to always fly well maintained aircraft.   That’s my story.",
      "link": "http://www.nuforc.org/webreports/075/S75669.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0df",
      "summary": "Huge, translucent vertical rectangle spotted floating in sky before sunset around 20:00 in Central Indiana",
      "city": "indianapolis",
      "shape": "rectangle",
      "date": "2010-06-03T00:00:00",
      "story": "Huge, translucent vertical rectangle spotted floating in sky before sunset around 20:00 in Central Indiana I was driving east on U.S. 40 around 8 p.m. on 5/01/10.  My attention was drawn to the sky in the southeast by a flash resembling a flare or a dud fireworks.  I became aware of a translucent object, a long, vertical rectangle with well-defined corners that floated north from the location of the flash. We are on Daylight Savings Time in Indiana and still have plenty of sunlight at that hour.   At first I doublechecked to make sure the object was not a banner being flown from an airplane, but the object had to be at least a mile from top to bottom. I slowed the car and got into the right turn lane and inched along.   The object, like a gigantic plastic film in the sky, kept moving north and was gradually assimilated or hidden by a darker cloud. I don't think this was a reflection of something on my windshield, because of the way the object moved, then remained stationary for a moment, even though my auto continued to move.  I had to turn into a parking lot at tha! t point and did not see the object after that. ((ADDENDUM FROM SOURCE OF REPORT)) To the staff:  I filed a serious, legitimate report but mislabled the date of the incident as 5/01/10 instead of 6/01/10.  This was a typographical error made in the way people use the previous month or year right after the date has changed.  Because it's the beginning of June, I've been putting \"05\" as the month on paperwork.  My deepest apologies -- however, I want to stress that the report as filed is serious for a sighting on 6/01/10. ((END))",
      "link": "http://www.nuforc.org/webreports/075/S75652.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1b4",
      "summary": "At 10:00 p.m. EST on 7-25-09, 20 to 30 yellowish disks were observed  travelling accross the northern sky near Indianapolis.",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2009-08-05T00:00:00",
      "story": "At 10:00 p.m. EST on 7-25-09, 20 to 30 yellowish disks were observed  travelling accross the northern sky near Indianapolis. At approximatley 10:00 p.m. EST on 7-25-09, I was in the driveway of my home in Lawrence, Indiana, a small town in the northeast section of Marion County (about 10 miles northeast of downtown Indianapolis. A female neighbor accross the street yelled at me, pointing at the northern sky and stated \"What is that?\" I immediately looked up and saw 20 to 30 bright yellowish disk-shaped objects, each with an illuminated vertical red center, flying accross the sky with no detectable sound. They were moving west to east about 40 degrees off the horizon at what appeared to be a high rate of speed. They were in a straight formation, although about 30 seconds into this encounter 2 or 3 seemed to \"break off\" from the formation and head south towards me for a few seconds, then quickly joined the others in their easterly trek. While I was watching this, the female neighbor's husband also came out of his house and joined his wife and I, who were watching this spectacle from the street. After another minute or so, the objects all disappeared into the eastern sky. I am a 56 year old college-educated male, who spent over 20 years in law enforcement in several different positions. I am currently an in-town truck driver, and I do not use illicit drugs or cosume alcohol. I can offer no logical explanation as to what these objects were that my neighbors and I saw. I hope to find out something about this when I watch the evening news at 11:00 p.m. tonight.  Finally, if someone would have told me I would be making a report to a UFO center, I would have laughed at them. I occasionally listen to \"Coast to Coast\" on the radio and always regarded UFO reports as just some type of goofy entertainment. Now I'm not so sure!At 10",
      "link": "http://www.nuforc.org/webreports/071/S71310.html",
      "state": "IN",
      "duration": "3 to 4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba3e3",
      "summary": "Strange yellow lights streaked across the Indiana night sky",
      "city": "indianapolis",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Strange yellow lights streaked across the Indiana night sky On Saturday evening October 18, 2008, I was in Indiana driving on Interstate 65 heading northwest from Indianapolis towards Gary.  I witnessed two similar phenomena occur twice within a half-hour or less of each other.  Not being too familiar with the area I don’t know exactly where I was located, but for the first event, I’d say I was between 25-50 miles northwest of Indianapolis, and for the second, maybe 50-75 miles northwest of Indianapolis.  For the second sighting, I’m reasonably sure that I was located no more than halfway between Indianapolis and Gary – most likely closer to Indianapolis.  Giving a generous estimation, I’d say both events occurred between 7:30 and 9:00 p.m. EST.  It’s more likely that they occurred between 7:30 and 8:30, but I wasn’t paying close attention to the time. I saw each time a single streak of yellow light occur in the northern sky heading north/northwest.  Each event lasted about 1 second each, moved extremely fast, and seemed to travel a great distance, assuming they were as far away as they appeared.  They looked to be pretty far away, but I could not accurately guess the number of miles.  The streaks were not directly overhead, but they were closer to being overhead than they were to the horizon.  They appeared to be as long as a pencil when it’s held at arm’s length away when they completed their streak.  There was a definite movement of the light.  That is, they did not appear immediately as a solid line.  They began as a point and streaked across a portion of the night sky, as if someone had drawn a line with a yellow marker.  As soon as the lights reached a certain distance, they faded immediately. There were no stars in the sky, and that coupled with the fact that I saw it twice led me to believe that they were not shooting stars.  It was not raining, nor was there thunder, so I’m sure they were not lightning streaks.  They appeared out of and returned to nothing, it seemed.  They were both very unnatural-looking phenomena. This is my first report of a sighting.  I thought these events were strange enough to deserve reporting.  I’d describe myself as being agnostic towards the existence of extra-terrestrials.  I don’t not believe in them.",
      "link": "http://www.nuforc.org/webreports/066/S66346.html",
      "state": "IN",
      "duration": "1 second each"
    },
    {
      "_id": "64d005f478aba2ec5a3ba58d",
      "summary": "2 dimentional, matte gray rectangle, slowly moving apx, 1000 or 2000 ft. off ground, no lights",
      "city": "indianapolis",
      "shape": "rectangle",
      "date": "2009-05-12T00:00:00",
      "story": "2 dimentional, matte gray rectangle, slowly moving apx, 1000 or 2000 ft. off ground, no lights May 5, 2009 May 5, 2009 Indianapolis, IN 8:46 a.m. 1)  This not a hoax. 2)  I have ingested no drugs or alcohol and am not deprived of sleep. 3)  I am not crazy, or otherwise distressed. 4)  I am not seeking attention or recognition of any kind. 5)  I didn’t even believe in UFO’s or the people reporting them until today. 6)  I have a college education and an I.Q. over 120. 7)  I am in my thirties, have reasonably good eyesight, married with 2 children. 8)  I am not selling drawings, info, interviews or otherwise attempting to profit from this report. This morning for aprox. 3 minutes I observed a large matte gray rectangle or trapezoid that appeared to have only 2-dimmentions. It was traveling very slowly, possibly floating, to the east @ much less than 100 m.p.h. apx. 1000-2000 feet above the ground. It was not rotating and it had no visible lights. The object had no depth like piece of paper or a thin sheet of metal but was not shinny. Visually, it seemed to be only one side of a larger 3-dimmentional object. I detected no noise or possible propulsion system. The object was DEFINATLY NOT being towed or otherwise supported from the ground. The was greater than 50 ft. wide and high, but was not over 300 ft. in any direction.  I was able to positively conclude the following. 1)  This was not a commercial or civilian aircraft. 2)  This was NOT a ballon or zeppelin if and known kind. 3)  This was not any military project that is public knowledge. 4)  This was not a reflection or other natural phenomenon. 5)  This was not a bird, kite, or  hoax perpetrated by another individual. 6)  It was created or manufactured by intelligent being using unknown technology. ((NUFORC Note:  We spoke via telephone with this individual, and we found him to be quite eloquent, sober-minded, and apparently sincere.  We suspect that his is a very good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69942.html",
      "state": "IN",
      "duration": "apx. 3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6b4",
      "summary": "wings up trianglur shaped craft moving faster than any jet and No flapping like a birds wings",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2009-04-14T00:00:00",
      "story": "Wings up trianglur shaped craft moving faster than any jet and No flapping like a birds wings At about 6:00 to 6:15pm EST, in Indianapolis, around 82nd street just off 465 Northbound and 69 N, from the Community North Hospital location, a craft coming Eastbound from the North sky portion, just after the sun peeked brightly from the clouds, it exposed a stealth moving craft with WINGS UP!!!, not moving, NO Bird ever moved that fast, let alone an aircraft, nor (military) fly in a COMMERCIAL ZONE for passenger craft (small or the size of 727, 747, etc). This is a very commonly flown zone for passenger aircraft each half hour and then some. There is a small craft airport in Fishers, less than 2 miles from the area and this craft came from the uppermost part of the clouds, without wings DOWN and no noise, and no flapping as a bird. Neither was it the same as fighter jets with wide wings. It clearly looked liked a craft with the wings UP like on a navy shipped when they docked on the aircraft carrier. It was more than odd, it was not from this world. This particular craft came out of the clouds, approached toward my area directly downward and then veered oddly somewhat southbound on a dime, with absolutely NO movement from the UPWARD CLOSED wings. The wings were like a bird but stayed locked upward still. It then did a 360 motion (turn)  in FULL VIEW with a second, while still moving back into the clouds, upward like a helicopter’s movements, without hesitation and clearly like no craft this world has or any I know of, 3-4 miles from it previous location in SECONDS. This was spotted by two individuals who did not know each other.  The other person saw it like me and slowed their driving from the hospital in awe, but moved on. I told my wife,  but I had no other witness before she came out of the hospital clinic area for allergies. It was awesome and yet fearful as this didn't look friendly but more of a probing observation. My heart was beating so fast, my mouth went dry and I couldn’t talk.",
      "link": "http://www.nuforc.org/webreports/069/S69562.html",
      "state": "IN",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6ee",
      "summary": "on 10/24/08 I observed 10-15 orange colored lighted objects floating or flying on the northeast side of Indianapolis.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "on 10/24/08 I observed 10-15 orange colored lighted objects floating or flying on the northeast side of Indianapolis. I am a police sergeant and while on duty on Friday (10/24/08) at approximately 22:20hrs., I observed about 10-15 amber colored lights floating or flying upwards.  I was parked in a downtown parking lot facing north when this occurred.  I iniatially observed 3 lights spaced pretty equally apart, but at slightly different altitudes.  Because of the downtown horizon I was unable to ascertain if they were coming up from the ground or just a slightly lower altitude.   These lights appeared to be coming from the northeast east quadrant of Marion County (about 10 miles away from me).   After noticing and watching the first three lights, I observed 3 or 4 more about 20-30 seconds behind, ascending in the same manner as the first 3. I then observed approximatly 6-8 more of these objects floating or flying upwards from the same area.  After getting so high into the sky the objects disappeared.   There was a cloud cover on this night, as we did have rainfall off and on.  I am not sure if the lights or objects just burned out or I was unable to see due to the clouds.  The puzzeling thing was that the clouds were going from west to east, and these objects were floating upwards from east to the west, into the wind, but only at a very gradual change.  Because these objects were going into the wind rather than with the wind, I quickly dismissed them as balloons of any kind but I could be wrong.   I have never seen anything like this before but there could be a legitimate reason for them.  I am just curious what they were.   I did watch the 6am newscast when I returned home from work and did not see any mention of the lights for legitimate or unknown purposes.  I did email the Indianapolis Star to see if they knew what the lights were, but so far I have not received a response.  I also observed what appeared to be a commercial aircraft heading towards the lights, but the lights had cleared its path by time the aircraft arrived in the area.  I would suspect there was a good possibility the aircraft pilots observed these lights as well.  The aircraft was going from the west to the east ( I assume leaving Indpls. Intn. Airport).   Several hours later when I returned to that spot (where I sit until a run comes out) I did observe what is mistakenly called a \"shooting star\" in the area.  This one appearred to be closer and brighter then ones I have seen in the past, but this could just be coincidence.  I just figured I would report it in case anyone else had seen it and no explanation could be found for the lights presence.  I also attempted to take cellphone pics and video of objects, but on review you can not see them due to poor camera quality on cellphone",
      "link": "http://www.nuforc.org/webreports/066/S66449.html",
      "state": "IN",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba722",
      "summary": "8 UFOs appear as silent orange fireballs in northeast Indianapolis IN",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2008-10-31T00:00:00",
      "story": "8 UFOs appear as silent orange fireballs in northeast Indianapolis IN I was on the north side of Indianapolis driving west on 86th street.  At College Avenue,  I saw 4 orange fiery lights in the sky.  The lights were headed north/north east. I turned north on College to follow the lights which were hard to track because of trees.  I turned east on 91st street and pulled into an apartment complex to get out of the car and watch them as I called a friend to come to meet me. The sky was dark.  The UFO’s appeared as orange fireballs and moved in complete silence.  The four fireballs were headed north/northeast toward U.S. 31.  (We were about 80 miles south of Grissom A.F.B.). As soon as the four U.FO.’s were out of sight, I looked back and saw four more come from the same direction.  They were not flying in formation, but all proceeded north/northeast. A friend caught up with me in time to see the last U.F.O. which is he said hovered and lowered and then took off fast enough to disappear before his eyes. I didn’t see the last U.F.O. because a tree was blocking my view.",
      "link": "http://www.nuforc.org/webreports/066/S66462.html",
      "state": "IN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8d2",
      "summary": "Flashing light over Indiana",
      "city": "indianapolis",
      "shape": "light",
      "date": "",
      "story": "Flashing light over Indiana Sighting of UFO over Indiana from Indianapolis Indiana flying NE into NW Ohio, Flashing lights red to green to white-blue, travels fast at times and stood still at other times.  Approx. 5000-6000 ft altitude.  Witnessed by numerous Indiana residence along its path including police officers.  Sighting found in newspaper articles of the time, not currently in database",
      "link": "http://www.nuforc.org/webreports/077/S77690.html",
      "state": "IN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3baa4f",
      "summary": "Large round gray object moving low to the ground making no sound.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "Large round gray object moving low to the ground making no sound.",
      "link": "http://www.nuforc.org/webreports/077/S77639.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bab19",
      "summary": "Ligt streak during a video on Sunday night football.",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "Ligt streak during a video on Sunday night football. On tonight's NFL Sunday Night game at approximately 8:40pm eastern, there was a streak of light during a live shot of downtown Indianapolis. There was an ad box in the middle of the screen. They had just switched from southwest airlines to Hyundai.  The streak started on the top dead center of the screen and moved towards the right in a curve towards a building with 2 blue light stripes on it.  It disappeared momentarily and reappeared for an instant moving horizontally. I did happen to DVR the event and reviewed it. it's just a light with no discernable features but didn't look natural.  I'm sure you could get the video image from NBC. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77906.html",
      "state": "IN",
      "duration": "1 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bac73",
      "summary": "Indianapolis Multi-Colored Round object 1972-74 chased by fighter jets",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2011-05-02T00:00:00",
      "story": "Indianapolis Multi-Colored Round object 1972-74 chased by fighter jets Aproximately 1972-74 west central Indianapolis, Indiana. I was a young boy probably around 7 years old. I was walking back home with my friend coming from his house on a dead end street (Corral & Birtha street)   When we reach the front of my house and sidewalk we noticed a huge round object hovering directly over us.  No sound, I can not explain how huge this was.  We had to actually move our heads back and fourth to see the entire object at one point.  It was rotating with multiple colored lights.  From our vantage point directly under it, it seemed to be like a spoke in a wheel.  The outer edges seemed to be rotating around the center and changing colors as it did that.   Suddenly the object shot straight up in a flash, hardly even able to distinguish between it and stars other than the color looked more orange from the distanced view.  We ran inside to tell my mother and finally we convinced her to come outside to see it.  By that time other neighbors was outside too looking at it.  The object had came back down to it's original position but occasionally would maneuver up, down or left or right and even diagonally.  Some times fast and sometimes slow.  The second time it shot up and was ha! rdly distinguishable between the stars other than the color difference.   We all went back inside and my mother called the police and reported it.  She also called the Air force. Moments later it was on the news on TV.  Wier Cook Airport at the time ( Now Indianapolis International ) had sent 2 fighter jets to intercept it.  We went back outside a third time and seen the jets heading towards the object. Suddenly the object shot straight upwards again so fast... but this time it disappeared completely out of view.  The news that evening said the Air force identified it as being a blown off course weather balloon. The next day it was in the news papers also.  A few day's later me and my friend was walking along side the road in the middle of the day and a blue car and 2  men in air force uniforms stopped us and asked if we saw anything strange in the sky. We told them about it as they took notes.  Then they drove away. I never head anything more about this.  Now I am 46 and still remember it so vividly. I tried researching the news archives without success. If anyone else who witnessed this please post here.  Obviously it was not a blown off course weather balloon. We do not chase weather balloons with fighter jets... I might add... they couldn't catch it...lol  I just wish I could find some archives or documentation on this.   Approximately 1972-75 Summer-time, at night very clear sky.  It was all over the news...  Why can't I find anything on it now? ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80755.html",
      "state": "IN",
      "duration": "1 hour Aprox."
    },
    {
      "_id": "64d005f478aba2ec5a3bb0b6",
      "summary": "silver cylinder object in sky 3ft L x 2Ft H white circle moved to cover whole object then disappeared",
      "city": "indianapolis",
      "shape": "cylinder",
      "date": "2010-11-21T00:00:00",
      "story": "silver cylinder object in sky 3ft L x 2Ft H white circle moved to cover whole object then disappeared I would like to report a UFO that I saw Nov. 2nd  2010. it was in Indianapolis Indiana. I was at the corner of Southeastern Ave and Arlington Ave. it was in the SW sky.  It looked to be about 3ft long and about 2ft high. It was silver in color and it only stayed for less than a minute. The silver was the shade of a trashcan.  As I was watching this object it looked like a white circle rose from the bottom left and moved to the top right. Once it finished it disappeared.  There were no blimps in the vicinity. It just hung in the air and then the circle of white moved to encompass the object. It appeared to be only one.  The sky was clear with some white clouds higher up than the object.  The address was ((deleted))  Southeastern Ave.",
      "link": "http://www.nuforc.org/webreports/078/S78708.html",
      "state": "IN",
      "duration": "60 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3bb32b",
      "summary": "Saucer seen on W. Michigan Street and Porto Alegre",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "Saucer seen on W. Michigan Street and Porto Alegre I’m a college student in Indianapolis, Indiana. It was around 6:26 P.M. on 11/7/2010 when I was standing on the sidewalk of W. Michigan Street that lead back to campus apartment housing at IUPUI (my college).  We usually have a lot of airplanes and helicopters around here, and at first I thought it was an airplane until I realized that it was flying way too low, but then I realized that it must have been a helicopter. I couldn’t have been more wrong I realized, as I looked up and saw a circular object flying right up above me, moving straight in the direction I was facing. It was huge, and if a full moon were out, I would have to say that from my perspective, I would have to say that maybe 15-17 full moons would be equal to the size of it. I’d like to give a better comparison, but I was in a state of shock. I did spend what felt like a long time gazing at it, although in actuality, only about 2 minutes had passed. The sky was clear, but being in the city, it appears as pitch black because of the city lights. It was either flying really low, or it was extremely huge.  I feel stupid for not thinking about getting a picture, but I was in total shock, as I don’t really believe in UFOs, or at least didn’t until now, and even now I’m still skeptical. I did, however, try my best to draw a picture afterwards, even though I’m not good at drawing. The UFO had red lights on it. If I remember correctly, I’d say about 3 of 4 of them, and I believe that red light was coming from the center as well. Since I was looking up at it, all I could see was what it looked like directly underneath. It looked like the stereotypical UFO, or flying saucer, in most aspects. Besides being a perfect circle, it looked like what a mushroom looks like from underneath, whereas you can see the edges of what might be a domed top from below, and striations leading towards the center. Most of the red lights were towards th! e exterior, with the exception of the center (where the stem of a mushroom would be). Here was where more red light emitted. Two things struck me as odd that distinguished this when compared to the stereotypical portrayal. For one thing, the front of the ship had a silver section, which reminded me of a bird shape since the shape had three corners. Secondly, I think that there may have been a protrusion at the base of it, which logically made me think that maybe somebody was playing a prank and it was actually some type of blimp because of how it glided forward, but it seemed much too big to logically call it this. There was no logical explanation for what happened. I went back to the apartment building and called my grandpa to tell him what I saw because I felt like I needed to tell someone that wouldn’t make fun of me. I made this call at 6:34P.M., and stepped through the back door of the apartment complex. I was partway into the conversation when I saw the object again flying over the apartment building, even though I thought it had already passed. At this point a passerby was walking down the sidewalk and saw me looking in shock up at the sky. He then saw the object too and said that it “sure is a wide airplane”. (He didn’t see it until it was going off into the distance.) I said that “was definitely no airplane.” This second encounter lasted until 6:37P.M., so it was three minutes long. This second encounter took place on Porto Alegre Street, and again the object continued moving in the same direction until it got past the river, where it ascended up and disappeared into the sky. A girl walking a ways behind me during the first incident didn’t bother looking up because she thought it was a helicopter and was busy texting, and was shocked when I told her what I saw. I was kind of angry that she hadn’t looked up and I was the only one that saw this the first time, but I extremely glad that someone else saw it the second time to prove that I wasn’t the only person that saw it. By the way, the IUPUI campus apartments are near the Ronald McDonald House, which is not far from the hospital. This area is extremely easy to find on Google Maps, however, for some reason it doesn’t show Porto Alegre, but the street that the UFO went across to get to the river is White River Pkwy E. Dr.",
      "link": "http://www.nuforc.org/webreports/078/S78789.html",
      "state": "IN",
      "duration": "three minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bba05",
      "summary": "More than 7 Red Flaring Orbs in East Indianapolis Sky on 4th of July",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2010-07-10T00:00:00",
      "story": "More than 7 Red Flaring Orbs in East Indianapolis Sky on 4th of July Approximately 2200 hours, a group of us on the deck were watching fireworks.  We noticed 3 red fireballs crossing the sky evenly paced.  They got to a certain pointin the sky and then vanished.  At first we believed it to be cloud cover being the reason they vanished but they never reappeared considering their brightness.  Ten minutes after first sighting.  We saw the same shape again coming from the south but a little farther east.  This time one appeared then followed by another then followed by another.  Each one was evenly paced.   After going a distance the first object disappeared, then another came into view.   Each object got to the same point and then disappeared and again another appeared.  This time there was five to six objects. I work for the military and checked with the local helicopter BDE.  It was confirmed that there were no flights that day.",
      "link": "http://www.nuforc.org/webreports/076/S76318.html",
      "state": "IN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbec6",
      "summary": "Parade of mysterious Lights traveling across Indianapolis sky for approx 5 min",
      "city": "indianapolis",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "Parade of mysterious Lights traveling across Indianapolis sky for approx 5 min Several orange/red in color lights that flickered moved from northwest toward the south all at the same speed and had different formations but each individual light kept to a fairly straight path, I was south and watched the objects moving upward traveling what appeared south gaining altitude with the line of several individual balls of light vanishing all approx at the same location.  The event lasted close to 5 min and 50+ objects where following the same path.",
      "link": "http://www.nuforc.org/webreports/085/S85007.html",
      "state": "IN",
      "duration": "5 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbeca",
      "summary": "09/02/2011 at 11:00 PM. Vertical, white, smoky cigar shape. White light a tboth ends. Lights did not flash. I saw it while driving.",
      "city": "indianapolis",
      "shape": "cigar",
      "date": "2011-10-10T00:00:00",
      "story": "09/02/2011 at 11:00 PM.  Vertical, white, smoky cigar shape.  White light a tboth ends. Lights did not flash. I saw it while driving. I left work at 11:00PM. I was driving E. on 86th. St. I saw a white, smoky, vertical object in the Eastern sky. Bright white circular light at bottom, small white light at top-bottom light went out, came back on twice, did not flash repeatedly.  Object remained stationary. It reminded me of a comet with a short,smoky tail...not a long one. I watched it as I drove 8-9 minutes...no visible movement up-down-right-left-nearer-further. If you hold your left hand on the steering wheel and raise your finger....the object was about as long as your fingernail...at whatever distance it was away. I did not see any other object. Several stars were visible in the surrounding sky. I arrived at home. I could no longer see the object for the trees.",
      "link": "http://www.nuforc.org/webreports/083/S83662.html",
      "state": "IN",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bc771",
      "summary": "It was one craft with white lights going very slow, then stopped, then the craft went back the way it came 3x it's original speed.",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "It was one craft with white lights going very slow, then stopped, then the craft went back the way it came 3x it's original speed. The location of this sighting was at Ben Davis High School in Indianapolis, IN.  But i live in Brownsburg, IN. I was there for a marching band competition, and I was facing east, and the object was heading to my left. My friend which was standing next to me also saw the object.  I saw the object for maybe 2-4 minutes, and the time was between 8pm-8:30pm.   The craft seemed large, and it was maybe a mile or so from where i was. I only saw the lights of the craft, I never saw any body to it.  The lights on the craft, which were white and there was two lights which did not change color.  The lights were close to each other, and appeared to be just a straight line. It was about maybe at a 40-45 degree angle from where I was standing. The reason I was watching this was because it was moving pretty slow, slower than a man made aircraft, and the lights were not blinking like planes, helicopters, etc usually have.  The lights also seemed like they were flickering a little ! at times but neither light was ever turned off.  It traveled east and it stopped after slowing down slightly, then stayed in the same spot maybe 3-5 seconds, then the lights became a little brighter.   After that without turning around it went the way from which it came, and now i could see a third white non-blinking light which was the same size and color as the other two. These three lights made a triangular shape. After starting back from the way it came, the craft was going maybe two to three times it's original speed. My view was blocked by a tree in the distance, about a minute after it starting going back from the way it came.  Then after that my view was blocked because of buildings and trees etc in the distance. I do not know if there were any noises or anything because there were bands practicing around us, and lots of people talking. I did not see it again after that for the rest of the night. P.S. Please, if an investigator calls me, I cannot accept calls during school hours, which is 7:50 am-2:50pm.  Any other time on a weekday after 3pm, except Tuesdays and Thursdays between 6:30-9pm which I have marching band practice.  Or after noon on Sundays would be fine to call. I am busy with marching band on saturdays until the season is over in a couple weeks. I also could communicate through e-mail.  ((NUFORC Note:  We spoke via telephone with this young witness, and he sounded to us to be a quite sober-minded young man.  We hope that the other witness to the event will submit a report, as well.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84437.html",
      "state": "IN",
      "duration": "About 2-4 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7e4",
      "summary": "20+ golden/orange UFO objects in the sky around 10pm.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2011-10-25T00:00:00",
      "story": "20+ golden/orange UFO objects in the sky around 10pm. At approximately 10pm on Friday night, October 21, 2011, my daughter and I were driving out of our neighborhood when suddenly up in the eastern sky, I saw what looked like multiple golden/orange objects in the sky.  There were approximately 20 objects forming a vertical/column like shape.  Once I cleared my housing division and was on the main road, this vertical formation was clearly starting to spread out into a horizontal shape formation.  I only made time to see about 2 minutes of these objects due to urge to  move on to my destiny.",
      "link": "http://www.nuforc.org/webreports/084/S84697.html",
      "state": "IN",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3bc991",
      "summary": "Fireball Indianapolis",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2011-08-21T00:00:00",
      "story": "Fireball Indianapolis The orange fireball seemed to be going from west to east during half a minute.  It was the coolest thing we have ever seen in the sky.  It seemed strongly wind at this time.  The fire to get bigger then smaller and then burn out or dissapeared as it came down.",
      "link": "http://www.nuforc.org/webreports/083/S83300.html",
      "state": "IN",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bccdc",
      "summary": "5-6 amber colored lights flying in formation.",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2011-06-20T00:00:00",
      "story": "5-6 amber colored lights flying in formation. While driving home from work, from Bloomington to Indianapolis, I noticed 5 to 6 individual amber colored lights in formation.  As they passed my car, the formation was maintained, but it wasn't a formation that is consistent to the military as it was very lose and not in line. The route I take from work is State Route 37 (northbound).  Normally on my return trip home there are aircraft on the left (west) side of the road flying the approach pattern into the Indianapolis International Airport (KIND).  As a private pilot, I am very aware of the orientation of the lights on aircraft.  This was unlike anything I have ever seen. Before the sighting, I noticed what appeared to be a shooting star going to the right, or east side, of the road.  Whether this has any connection to the sighting or not is unclear.  After driving for about 2-4 minutes I noticed the lights through the trees on the same side of the road as the shooting star.   Thinking that it look rather odd, I continued looking in the direction until I passed by a field where there was a clearing in the trees. I was about 10-15 miles from the city at this time. At that point, I could clearly see that there were 5-6 amber colored lights, almost in a Z formation.  I tried to take a picture with my cell phone camera but the lights were too faint to show up.  They appeared to be traveling southbound and I could not tell at what altitude, as there was no prospective on what I was seeing.   As they passed to the right of me, each light faded from the first to last and I couldn't see them anymore.  As I was looking, I noticed there was a cloud that was illuminated by the moon so i kept watch until I spotted them again.  They were no longer emitting any light, but I could see specks in contrast to the illuminated cloud.  They were not connected in any way, and were independant of each other. After realizing what i had seen, and the close relationship with landing aircraft, I did contact the TSA office at KIND.  They said that there had been no reports of anything that I was describing and that it would be noted.",
      "link": "http://www.nuforc.org/webreports/081/S81762.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd81",
      "summary": "Two orange lights moving same speed, same direction in an offset trail formation.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2011-06-20T00:00:00",
      "story": "Two orange lights moving same speed, same direction in an offset trail formation. Three people observed two orange lights rapidly going in the same direction heading north.  These objects were fairly low to the ground and were also going at the same speed and direction.  Objects were only one color but could not be determined whether or not a solid object.   There was an aircraft however that was flying from the east to the west, heading toward the Indianapolis Airport.  The weather was partly cloudy and humid.   The three witnesses were driving when they saw the objects.   After picking up a friend they drove back around they were not there.   At the stop sign the observers were at was a perfect place to see where the objects have been.",
      "link": "http://www.nuforc.org/webreports/081/S81856.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcdb9",
      "summary": "Acorn shaped object with light on bottom",
      "city": "indianapolis",
      "shape": "oval",
      "date": "2011-06-12T00:00:00",
      "story": "Acorn shaped object with light on bottom On 6/9/11, at 9:30PM, near eastside of Indianapolis, I was outside looking toward the western sky. I observed a dark acorn shaped object moving west to east slowly.  It had a large white light on the bottom that seemed to swivel or rotate. I heard no sound. I watched it move across the sky for approx. 10 minutes before I decided to go inside my workplace and get a co-worker to see it.  When I went back outside (approx. 5 min), It was gone. I feel this object was probably explainable, but interesting.",
      "link": "http://www.nuforc.org/webreports/081/S81712.html",
      "state": "IN",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0f5",
      "summary": "I was traveling home lastnight and coming over the last hill before I turn into my neighborhood there's a fair skyline over an abundanc",
      "city": "indianapolis",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "I was traveling home last night and coming over the last hill before I turn into my neighborhood there's a fair skyline over an abundance of trees, the orb caught my eye because it seemed to be a shooting star it illuminated very brightly and was much too close to be one.   What struck me more is the abnormal degree of turn it made after traveling very close to an obvious airplane when suddenly it shot to the ground at a complete 90° angle where it then disappeared   I My friend in I purely in awe attempted to chase the UFO but could not find anything.",
      "link": "http://www.nuforc.org/webreports/091/S91384.html",
      "state": "IN",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3b0",
      "summary": "I went outside to smoke and seen multiple fireballs slow moving over indianapolis towards the east all in close proximity of each other",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "I went outside to smoke and seen multiple fireballs slow moving over indianapolis towards the east all in close proximity of each other.  There also was planea in area and could tell the difference.  Could .not get video proof because of phone not working. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93180.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd730",
      "summary": "Large falling object that doesn't make a sound.",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2012-09-24T00:00:00",
      "story": "Large falling object that doesn't make a sound. Last night at around 22:30 I had been sitting out with my neighbors (4 of us) having a couple of drinks. I just happened to face north when I saw a large object flash. It was coming down at a very fast rate. For a second I thought it was an airplane because it seemed so large and we do live near the airport. I exclaimed to my friends to observe the object, I really thought it could be a plane crashing. By the time they turned to face the object, it had already disappeared behind one of the houses. I was scared, and they could tell I was scared. I don’t think anyone else saw it, someone said it could have been a shooting star. I think it was too large to be a shooting star. The object came by and went too fast for me to determine how far away it was. The object looked about the size of an airplane when it is closing in for landing. The flash I saw from it was white in color, but there seemed to be flames coming from behind it as it fell down, also white in color. I never heard a crash or anything of the sort and part of the reason I got scared was because I was expecting some sort of noise. I was thinking it could have been a meteor or space junk, but I was unsure if those would make a noise since the object I saw seemed so close and large. Bottom line is I don’t know what it was and was wondering if anyone else had seen it.",
      "link": "http://www.nuforc.org/webreports/092/S92520.html",
      "state": "IN",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb14",
      "summary": "Large orange light on SW side of Indy, near I-465",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2012-07-04T00:00:00",
      "story": "Large orange light on SW side of Indy, near I-465 I was getting off of I-465 on the southside when I noticed a large orange light in the air.  At first I thought it was a plane coming in, since it was near the airport, but I noticed there were no blinking lights.  As I continued to watch, the object stopped moving.  It seemed to be quite close at this point (within a mile).  I watched to make sure it was a helicopter, but it showed no signs of it, and made no noise.  As I pulled into my driveway, a tree momentarily blocked my view.  When I walked around the tree to get a better view, the light had disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Date may be flawed.  We wonder whether the witness intended a date of June 21st, but we have no means of contacting that person.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89870.html",
      "state": "IN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb61",
      "summary": "Red flame flying through the sky.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "Red flame flying through the sky. I live in the Geist area of Indianapolis and I work in Marketing for a large corporate law firm.  I'm not a UFO chaser but did just see something strange in the sky.  I was taking out the garbage and off to the south of my house I saw a light that caught my eye.  It travelled north for about 1 minute.  It was about as high as a low flying plane and it disappeared before it should have left my sight.  It moved very steadily and in a straight line.  The only way to describe it is it looked like an emergency road flare flying across the sky.  It was red and steady but it flickered a bit and was moving quickly.  It went over my street, right above me then as it went past, it was gone.  I've seen flares shot that float to earth on the little parachutes and it looked exactly like that except it was moving fast and in a forward direction.",
      "link": "http://www.nuforc.org/webreports/089/S89743.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bdbe6",
      "summary": "Unexplained star shaped colored object",
      "city": "indianapolis",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "unexplained star shaped colored object Thursday morning June 21, 3:24 am, a friend and I stepped out back to get some fresh air and smoke a cigarette. When we notcied an object in the clear sky that resembled a aircraft with no signal lights appearing to b a star shaped and colored object straight above us at a 15 degree angle. The object was moving from the South, to the North the object proceeded to slow down almost to a complete stop. instantly changed direction and course and vanished at a high speed to the South Southwest, the object had completely dissapeared.  Moments later approixmately two minuates later the star shaped colored object reappeared further to the North then first seen the object moved slowly as if it was a high altitude plane moving North, to south. upon observing it the object abruftly changed course direction from North to Northeast continuing to the East and once again completely dissapearing in the clear sky. Im a firm believer in UFO's My childhood friend on the other h! and is not but after witnessing this morning's events he must acknowledge that what we witnessed we cannot explain. we witnessed the unexplained object abruftly 20-30 seconds and was to far and dark to obtain any photos or video. if you have any questions or information please dont heisistate to contact me back thank you .",
      "link": "http://www.nuforc.org/webreports/089/S89791.html",
      "state": "IN",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf7b",
      "summary": "Triangular craft with two blue white strobing lights over Indianapolis",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "Triangular craft with two blue white strobing lights over Indianapolis I was traveling home from Muncie, Indiana to Lafayette, IN, returning home from work out of town.  I had just gotten onto 465 W from 69 S.  I watched a triangular shaped craft shoot southbound in the sky across 465. The craft moved much faster than an airplane, and even faster thatn jets I have seen in air shows.  It stopped abruptly in the sky over the north side of 465.  The craft stayed stationary for at least two minutes, until it left my field of vision (in a hurry to get home).  The craft had two white blue blinking lights, very similar to the light you see coming from a satellite. This craft obviously was not an airplane, as it was too fast and the lights were blinking in an erratic pattern.  The two lights were not coordinated in their blinking.  I felt compelled to watch the blinking of lights, even though I was driving.   After about two minutes of watching I started to feel dizzy and disoriented. This report is being filed two days after the fact.  Typically I would not mention something like this. However I can't seem to get this strange blinking or the image of the craft out of my mind.",
      "link": "http://www.nuforc.org/webreports/092/S92933.html",
      "state": "IN",
      "duration": "2-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be048",
      "summary": "Lights went out on something in the sky and as soon as the last light went out it literally disappeared before my eyes.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2012-11-19T00:00:00",
      "story": "Lights went out on something in the sky and as soon as the last light went out it literally disappeared before my eyes. My buddy and I were on the highway heading to martinsville,IN, for drumline practice and we were in the middle of a funny conversation and I just glanced up and to the left a little of my wind shield and noticed a semi circle of about 6 orange lights.  As I thought &quot;what the hell&quot; each light went out one by one and my buddy noticed it by time there were one 2 lights left one. I think there were lights all the way around it but they already went out.  And I almost hit a car because I was so focused on it.  All of a sudden while I was looking at it,like 3 seconds after the last light went out it was just gone. That area in the sky wasn't as dark and there was no sogn of it anywhere. my friend saw the exact same thing and we can't explain it.  I've never believed in anything like that until now and we told people about it and they all think we were tired or crazy but i know what we saw....I've ever seen something like that in my life and I can't explain it.",
      "link": "http://www.nuforc.org/webreports/094/S94555.html",
      "state": "IN",
      "duration": "What I saw was just a few"
    },
    {
      "_id": "64d005f478aba2ec5a3be216",
      "summary": "4 red lights traveling from the southern horizon to the northeast. Flickering but not flashing. Each light vanished one at a time after",
      "city": "indianapolis",
      "shape": "light",
      "date": "2012-05-29T00:00:00",
      "story": "4 red lights traveling from the southern horizon to the northeast.  Flickering but not flashing. Each light vanished one at a time after several minutes.  Took photos with my phone.  Video taped the last two lights before they disappeared.",
      "link": "http://www.nuforc.org/webreports/089/S89017.html",
      "state": "IN",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be36d",
      "summary": "See two huge balls of fire in sky",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2012-06-20T00:00:00",
      "story": "See two huge balls of fire in sky",
      "link": "http://www.nuforc.org/webreports/089/S89584.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3be5f6",
      "summary": "Triangular shaped fyling objects with orange amber lights.",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2012-06-14T00:00:00",
      "story": "triangular shaped fyling objects with orange amber lights. I was at the traffic lights at the intersection of 96th street and Keystone Avenue, facing east. I spotted ten or twelve triangular shaped objects with bright amber/orange lights, flying at the low altitude and slow speed.  There were a lot of other cars waiting at the traffic light, and this sight was not something subtle or difficult to see.  It was very clear and visible, so I’m thinking there are other people who witnessed this event.  I have never seen anything like this in my life.  I was so baffled by what I’ve been seeing, therefore I  completely forgot about taking photographs of it.",
      "link": "http://www.nuforc.org/webreports/089/S89507.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be75a",
      "summary": "Bright lights in the city of Indy...UFO???",
      "city": "indianapolis",
      "shape": "diamond",
      "date": "2012-03-13T00:00:00",
      "story": "Bright lights in the city of Indy...UFO??? I noticed 2 bright lights come together in the sky and I pulled my phone and began to record.  The lights went in separate directions and I proceeded to record, I noticed several other lights in the sky but was unable to record all of them.  Shortly after this event which lasted at least 45 min  it appeared to be followed by what appeared to be military craft observing the area.  My camera work was shaky at best because of my sheer excitement of trying to figure out what i was looking at.  At one point I drove under the light and nearly dropped my phone trying to capture the uniqueness of the object.  I am completely convinced this wasnt an aircraft but I will leave that for someone with trained eyes and a amplifier to decide.",
      "link": "http://www.nuforc.org/webreports/087/S87342.html",
      "state": "IN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3beccc",
      "summary": "Strange white shape shrinks and disappears.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Strange white shape shrinks and dissapears I noticed a bright light was glowing as I was driving to work.  I noticed it a few blocks further down in the direction I was driving but disarded it since some trees blocked most of it.  Figured it could have been a plane (there is an airport around the area) or the sun reflecting against something I don't know.  I reached a stop sign, which happened to be in front of where the light was and I got a clear view at it this time, no longer blocked by trees.  Right then and there I noticed it was shinning bright white light with a different form. The light was brighter on some areas. No other lights.  Just white light and the shape.  It was not a disk shape nor cone or anything that has been seen in pictures. It just stayed there for what seemed to be 20 seconds.  I was trying to pull my cell phone to try and take a picture and I realized, I was still at the stop sign so, I decided to make a left turn to continue my path seeing as there were cars behind me.  As I turned I just happened to look back and I noticed the driver behind me had his head sticking out looking at the same thing I was.  I made the left turn at a very slow pace while still looking at it.  Few seconds later, it seemed to have shrunk in size.  Once I completed my turn, trees again blocked my sight a bit so I decided to drive bit further and stop inside a neighberhood that was underneath the spot were the...light, figure what ever you want to call it was.   It was no longer there.  Even if it was a plane I am sure I would have still had been able to see it.  Same as a weather balloon or anything else we are used to see on a normal day. It was strange but it was not anything I had seen in pictures or sighting videos.  It was just bright white on all it's ends.   Again, it was not a disk, cone, nor small in size at first.  I can say it was probably the size of a car from the point of view I had.  The shape was just different.",
      "link": "http://www.nuforc.org/webreports/100/S100452.html",
      "state": "IN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beda7",
      "summary": "Bright Orange Sphere over Far Southside of Indianapolis",
      "city": "indianapolis",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "Bright Orange Sphere over Far Southside of Indianapolis My husband and I were leaving the AMC movie theater at US31 and I-465 on the far south side of Indianapolis at 10:23 pm.  We both noticed a very, very bright orange light at 45 degrees north of us. Initially thought it was a planet.  As we watched it, a commercial airliner came in for a landing and we could tell this thing was much larger than an airliner and at a much higher altitude.  The thing resembled a Chinese lantern and flickered very bright orange and white light.  We continued to watch it as it flew overhead.  Once overhead, it was round and very light grey in color.  Made no sound and had a S-SE trajectory.",
      "link": "http://www.nuforc.org/webreports/100/S100664.html",
      "state": "IN",
      "duration": "8-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beee5",
      "summary": "I think i was abducted when i was 11 years old in another incident.",
      "city": "indianapolis",
      "shape": "",
      "date": "2013-07-03T00:00:00",
      "story": "I think i was abducted when i was 11 years old in another incident. A moving star flashed a giant camera looking flash.  The flash lasted about 3 seconds.    When i was 11, a disc shaped object with lights evenly spaced lights on the side slowly right above me.  It had to be 200 to 300 feet above me and just hovered over me.   After what seemed like forever I finally watched it slowly zig zag away.  This was on a summer night in the year 2000. ((NUFORC Note:  Witness indicates that the date is approximate.  Witness does not indicate a city or state for the alleged event, so we have entered his current residence location as the location of the sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99076.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf113",
      "summary": "Flashing multi-colored lights on a flying object",
      "city": "indianapolis",
      "shape": "other",
      "date": "2013-07-03T00:00:00",
      "story": "Flashing multi-colored lights on a flying object The ship looked like a disk or a square with a flat line of lights. it was moving for about 30 min than stop and was hovering in the same spot for about 45 min so far. the lights were red, blue,while, purple ,and green.  All flashing in random order.   I was driving home when i saw this and then the rest of the family came out looking as well as my boyfriend at his house.  there was only one ship that we saw at this time but we were looking at it thru a scope and everything. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98397.html",
      "state": "IN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bf181",
      "summary": "10-20 orange dots, 5 feet off the ground, 2 witnesses. Didn't make a exact shape, but vanished after 5 seconds.",
      "city": "indianapolis",
      "shape": "other",
      "date": "2013-07-03T00:00:00",
      "story": "10-20 orange dots, 5 feet off the ground, 2 witnesses.  Didn't make a exact shape, but vanished after 5 seconds. We were pulling up to my house after going to get some things from the Store. As we approached my house i seen what appeared to be multiple orange balls about 5feet off the ground, what i would describable this looks like, would be when your driving and you see someone flick out a cigarette into the street at night, and those orange/red sparks come off of it..  But this was composed of multiple orange circles i believe, but was only between 10-20 small balls/circles.  I was looking at it for about  5 seconds then it just went away, like it vanished. I don't exactly believe in UFO stuff, but i do believe in heaven and hell, and i do believe that this is a trick of the enemy to distract peoples minds and hearts, and it say the devil is the father of the air ways, but i would say all this is fragments of heaven and hell.. At least some of the things, some of it might actually be UFO's, but dont get carried away and forget your maker. ((NUFORC Note:  Witness indicates that the date is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98430.html",
      "state": "IN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf26b",
      "summary": "Large, flat sphere with BRIGHT red and white fast, flashing lights flying in Indianapolis, Indiana.",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2013-05-15T00:00:00",
      "story": "Large, flat sphere with BRIGHT red and white fast, flashing lights flying in Indianapolis, Indiana. I went outside to get my sons drink out of my car and I looked up in the sky and saw a large flat object with a curved top flashing red and white lights.   The lights were very bright and blinking in a fast motion.   The object was a lot larger than an airplane and the lights were a lot brighter.  I stared at it for a couple of seconds before yelling for my son to come out and see it.  As he ran out the object seemed to slow down for about 10 seconds and then proceeded to go continue in the northwest direction at a fast speed. It vanished and we couldn't see it anymore.  Afterwards I looked at 3 airplanes that was no where near as big or as bright as this object was in the sky.  Compared to an airplane it was about 30-50 airplanes put together in comparison. This happened around 9:12 pm Indianapolis, Indiana.",
      "link": "http://www.nuforc.org/webreports/096/S96972.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf39f",
      "summary": "Triangle shape formation over Indianapolis.",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2013-07-03T00:00:00",
      "story": "Triangle shape formation over Indianapolis. I was in the car with my sister and his boyfriend getting home when we saw these lights on the sky in a triangle shape formation.  It was moving very slow.  There were no blinking light like the ones use on airplanes.",
      "link": "http://www.nuforc.org/webreports/098/S98501.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf4f6",
      "summary": "Metallic disk observed in the sky in broad daylight.",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2013-09-09T00:00:00",
      "story": "Metallic disk observed in the sky in broad daylight I was working with my brother, who owns a commercial HVAC company, at a site that contained an old communications tower and a building that housed communications equipment.  The site was being prepped for demolition and we had the task of removing air conditioning units.  It was a warm summer day, partly cloudy, with no rain in the forecast.  We had decided to take a break and I decided to lay back on the hood of the truck to relax, looking up into the sky.  While looking at the clouds and daydreaming, that's when I saw a disk-shaped object move laterally from behind a cloud.  It was a metallic disk and appeared dark on the bottom, with no sound, no lights, no trails.  It seemed to hover in place for a few seconds, then it moved back behind the cloud.  It then began to reappear and disappear behind a cloud several times within a span of 15 seconds.  It appeared that it was playing a cat-in-mouse game with any observers below, using the cloud as cover.  Not b! elieving what I was seeing, I decided to sit up and rub my eyes, and try to come to terms with what I was witnessing in broad daylight, and in plain sight.  After taking about 15 seconds to collect myself, I decided to lay back down and look for the object again.  It took about 10 seconds since the clouds were drifting fairly quickly that day, but I found it again, still moving in and out from behind the cloud.  As I continued to watch, it finally did not reappear from behind the cloud after viewing it for approximately 20-30 seconds.",
      "link": "http://www.nuforc.org/webreports/101/S101775.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf566",
      "summary": "Several boomerang shaped craft that started out like a huge bright red/orange ball of light, diminished to an amber glow, then to black",
      "city": "indianapolis",
      "shape": "chevron",
      "date": "2013-07-14T00:00:00",
      "story": "Several boomerang shaped craft that started out like a huge bright red/orange ball of light, diminished to an amber glow, then to black I got home from work and took my dog out on a leash to the yard and as we were walking around the yard I looked up at the sky as I always do and have for years because I love trying to spot the big dipper and little dipper and seeing the moon and all the stars...  And all of a sudden coming over one of the tall trees I see a huge and very bright orange/red light and it was about as big as the full moon but it was moving my way and from behind it came another and then another, and another, like bullets shooting out and I'm standing there thinking and saying out loud to myself what in the world is this!  I thought maybe weather balloons or hot air balloons, or parachutes.  I just didn't know and still have no idea. I looked around to see if anyone else was out and of course there was no one but me and my little Shit-zu, who could care less and I've never seen anything like it.   There was no sound and as the bright orange/red ball of light traveled it got higher and dimmer until you could finally tell that it was a boomerang shape and the intensity of the color diminished to an amber sort of glow until finally they turned black, but you could still see them flying across the sky, just like you can see a bat in the sky at night.   I saw 3 of them end up flying side by side and I ran to get my camera but by the time I got back outside they were so high and almost gone that they look almost like nothing but a joke, but believe me it's not a joke and these things were something!  You can only see 2 of them from the picture I was able to get and you can see one is more brighter in color than the other because this is how they went in intensity.  I so wish that I would have had my camera on me and been able to take the picture when they first started out because believe me that had my complete and full attention. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100087.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf775",
      "summary": "Ring light.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2013-09-09T00:00:00",
      "story": "ring light I was going though my security camera showing my grand kids the video of them playing at night with the fire going.  By mistake I clicked on the wrong night that when I  notice a light coming in and a object came out of the rings of light that was lighting up my yard and deck and it landed in front of the back door of my patio.  Then after about six minutes of this light going around my patio as if it was looking for the object that came.  The light rings picked up the object and the light and object disappeared in to the sky.  I have live video still on my camera system.",
      "link": "http://www.nuforc.org/webreports/101/S101806.html",
      "state": "IN",
      "duration": "sighting"
    },
    {
      "_id": "64d005f478aba2ec5a3bf983",
      "summary": "Slow moving, orange, round, flickering light moving slowly, sometimes flicker, not very bright.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2013-07-14T00:00:00",
      "story": "Slow moving, orange, round, flickering light moving slowly, sometimes flicker, not very bright. The first sighting was one object on 7/5/2013 at 2358 pm.  It was orange/yellow flickering slow moving light not large in diameter.  It hovered for a short time, then slowly moved away.   I left the area so i dont know how long it hovered. this was stop 11 road near us 31 south, indianapolis.  it moved slowly north west. A second event was on 07/06/2013 at 2330 hrs over interstate 465 where i saw 3 of the same in a triangle formation, but not vertically alligned.  They were slow moving and passed over the interstate.    There were a few not in formation following, one was different, dull red.   No sound, flickering slightly, quiet, moving overhead northwest bound.",
      "link": "http://www.nuforc.org/webreports/099/S99887.html",
      "state": "IN",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9ce",
      "summary": "White light turned red and vanished.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "white light turned red and vanished I was having a cigarette on my patio and my son was outside talking to me.  I was watching the sky just west and a little north of us because I thought it was unusual to see 7 jet airplanes flying so closely in the same area of sky.  I know they are farther from one another in the sky, but from the ground they looked very close to one another.  Still odd to see them so bunched up considering how vast the sky is!   It seemed as if they were confused, or that some air-traffic controller must have fallen asleep on the job.  My son agreed and as we watched the last two planes intersect safely there appeared a white light in the sky just above them.  At first glance I just thought it was a star. My son saw it too and it dawned on us that it wasn't there before!  We watched for a about 15 seconds and it moved a little, turned red, and simply vanished!  The rest of the evening I watched the sky for any other unusual happenings. I stayed up until 2:30 am and nearly everytime!  I went outside I noticed one strange reoccuring thing-all air traffic was bunched up in the same manner as earlier in the evening.  We never see so much air traffic out our way in the first place, so it just seems odd to see 3 to 7 planes all in the same patch of sky multiple times throughout the evening. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97375.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa08",
      "summary": "Spherical orange lights seen in western sky by family of 3 in Indianapolis.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2013-10-14T00:00:00",
      "story": "Spherical orange lights seen in western sky by family of 3 in Indianapolis Tuesday, Oct. 8, 2013 7:30 p.m. ET  My husband, son and I were traveling south in our car on Keystone Avenue in Indianapolis, Indiana. The sky was perfectly clear and very light, as the sun was just setting. We turned west onto 38th Street, a six-lane-wide street with a clear view of the sky nearly down to the horizon. As soon as we were on 38th Street, we saw four lights in the western sky in front of us. Each light was round, orange, and approximately four to five times the size of Venus, which was also visible in the western sky.  Their position in the sky appeared to be approximately 15 to 20 degrees to the right of Venus.  The lights were arranged in a straight vertical line, like a column.  The lights were the same distance from each other, and as we continued to watch them, the two bottom lights moved laterally to the left away from the two upper lights while still holding their position relative to each other, one on top of the other.  Then the two bottom lights moved back beneath the top lights, still keeping the same distance between each other.  Then the bottom lights seemed to sink toward the horizon while the top lights seemed to move upwards in the opposite direction.   We continued to drive west on 38th Street while my son and I took photos with our phone cameras.  Suddenly, all four lights seemed to flatten out, changing in an instant from round, star-like orbs to flat, horizontal streaks.  This happened so quickly that there was no discernible process of change--the forms just appeared different, though the new shapes were the same orangish color and retained their positions relative to each other.   We drove off 38th Street into the 100 Acre Arts Park of the Indianapolis Museum of Art and stopped the car in an effort to see better, but by then the sky had darkened and the flat, horizontal streaks faded rapidly. As we scanned the sky for the shapes, we then saw two streaks of white moving rapidly across the sky in the same path as the shapes.  As the white streaks continued moving, we saw that they were contrails from airplanes.  We could see the dark forms and the blinking red and white lights of the planes as they flew overhead. I Googled \"UFO reporting\" on my phone and found the number for the National UFO Reporting Center.  I called and reported what we had seen and am submitting our separate reports of the sighting as instructed. My husband, son and I all witnessed this sight together, and we agreed that it was unlike anything any of us had ever seen before. Submitted by L. On Tuesday October 8, 2013, my wife, stepson, and I were traveling west on 38th street in Indianapolis, Indiana.  When we approached 38th and Fall Creek, I looked in the clear Western Sky. It was approximately 7:30 p.m. and that's when I noticed four lights in the sky. They were in a vertical formation, with what I would guess from the ground looked like they had about 100 to 200 yards between them.  We began following these lights.  Two of these lights smoothly and suddenly began to float in a horizontal pattern and headed southwest.  As the sun set, the lights became more difficult to see, almost as if they were cloaked by the sunlight. We followed the lights to the 100 Acre grounds of the Indianapolis Museum of Art.  It was there that my wife called the National UFO Center, and we were told that a similar phone call had been made only moments before from Pennsylvania, and the caller had reported seeing these lights in the Western sky. Submitted by K. It all started as my mom, stepdad, and I were driving home from my grandmother’s house. We were all having a jolly old time in the car, discussing various subjects like school, politics, and dreams.  As we were heading close to the road that leads to my stepdad’s house, my mom suddenly jumped up and shouted “LOOK, UP IN THE SKY!” I thought she was crazy until I put my glasses on and saw four orange-ish lights floating in unison.  After I saw them, my stepdad finally noticed them as well.  Right after we acknowledged their existence, two of the bottom-most lights began to fly left horizontally.  It was then that we realized that these HAD to have been UFOs. We started following the lights but to no avail.  The closer we drove to the lights, the darker the sky became, and eventually the two remaining lights disappeared on the horizon.  We stopped near the Indianapolis Museum of Art to look up, but still nothing could be seen.  It was then that my mom called in the UFO hotline and reported our findings.  What intrigued me the most is how the operator mentioned someone in Pennsylvania reporting the exact same sighting as us mere minutes before we called in. Submitted by A.",
      "link": "http://www.nuforc.org/webreports/103/S103088.html",
      "state": "IN",
      "duration": "6-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfaf8",
      "summary": "Me and my kids saw these objects at the sam time moving north east indianapolis.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "Me and my kids saw these objects at the sam time moving north east indianapolis. Red and orange lights it looked as if it was a ball of fire move medium speed good enought to get pic ...but the pic is small it looks like a red dot......it just kept moving…",
      "link": "http://www.nuforc.org/webreports/097/S97848.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bfbef",
      "summary": "Triangular formation of reddish amber lights on the northeast side of Indianapolis",
      "city": "indianapolis",
      "shape": "formation",
      "date": "2013-07-22T00:00:00",
      "story": "Triangular formation of reddish amber lights on the northeast side of Indianapolis As I was driving down a neighborhood street at night to run an errand, I noticed three round reddish amber lights in a triangular formation about 500 feet in the air, moving from south to north.  They appeared strikingly similar to the so-called Phoenix Lights from 1997, although no large, dark triangular object was seen corresponding to the lights.  The lights where about 150 feet apart from one another in formation.  The lights then made a rounded turn and heading west, then two of the lights disappeared.  The remaining light had increased in altitude to about 2,000 feet, then was stationary then dimmed out.  They appeared to be moving a bit too fast to be Chinese lanterns, considering there wasn't really windy out nor storming (partly cloudy evening).   They didn't appear to be manmade aircraft; no plane, jet, or helicopter as each object was just one ball of light.",
      "link": "http://www.nuforc.org/webreports/100/S100209.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc56",
      "summary": "I got some weird markings on the concrete next to field of my house. It's unexplainable because a abandon car is right there and weird.",
      "city": "indianapolis",
      "shape": "",
      "date": "2013-09-09T00:00:00",
      "story": "I got some weird markings on the concrete next to field of my house.  It's unexplainable because an abandoned car is right there and weird marks leading into the grass on the sidewalk.  Concrete striped down where it looks brand new in one spot.  I can't make sense of it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101914.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bfd13",
      "summary": "Just saw a very strange sight.  A group of bright blue and neon orange orbs floated over my house.  They seemed to be at least 15,000 f",
      "city": "indianapolis",
      "shape": "changing",
      "date": "2013-08-30T00:00:00",
      "story": "Just saw a very strange sight.  A group of bright blue and neon orange orbs floated over my house.  They seemed to be at least 15,000 feet up.  They were blowing around in the upper wind and seem to morph positions.   The orange orbs or globes seem to glow and all of the blue and orange things seemed to change positions in the group.  It could have been balloons released or something else but their color was very vivid.   The orange orbs would suddenly appear to be blue and visa versa.  Very weird. ((NUFORC Note:  Witness corrected time to 18:04 hrs..  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101541.html",
      "state": "IN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd7e",
      "summary": "NOTE-This is based on what actually happened. The UFO explained, however, is real and the way it was seen is not changed in any way.",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2013-07-03T00:00:00",
      "story": "NOTE-This is based on what actually happened.  The UFO explained, however, is real and the way it was seen is not changed in any way.  I was out looking at the moon at this time, due to the fact that it was unusually shiny.   While I was out, I saw this odd thing in the night sky, with 2 different colored blinking lights. Every time I went to a different location, the craft was still following me, staying still when I didn't move.  I put on some glasses, looked closer, and realized that it wasn't just a single star (there weren't any stars), but rather an actual spacecraft, with a red light on bottom and a green bluish one on top.  It looked unusual, but kind of ovalish with 2 tiny things on its dies.   It couldn't have been a plane, for they can't be totally still, and jets couldn't possibly stop or they would stall and crash. I am a creative person, and very intelligent.  It took some hours for me to come to this conclusion, and I can't really think of what else to say about this. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98850.html",
      "state": "IN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfdbd",
      "summary": "Many white objects in the sky.",
      "city": "indianapolis",
      "shape": "formation",
      "date": "2013-09-30T00:00:00",
      "story": "Many white objects in the sky Going from the south to the north many objects to get a count, white in color, going very fast, some faster than others.  Hard to describe.  It looked like it was falling out of the sky from way up.",
      "link": "http://www.nuforc.org/webreports/102/S102770.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfec8",
      "summary": "Blue light turned and went over the house.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2013-07-14T00:00:00",
      "story": "Blue light turned and went over the house. I was on the front porch and a blue light just appeared in mid air, turned and went up and over the house.  It was very clear and at first I thought it was a firefly but they aren't blue.  I have no idea of the size, shape or distance but I have never seen anything like it before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99997.html",
      "state": "IN",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bff01",
      "summary": "Two whitish yellowish circular objects in nw sky.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "two whitish yellowish circular objects in nw sky. At approximately 8:30 in the evening while riding passenger with my fiance and our two children in her  car, driving 465 from east street to kentucky avenue, I observed In the relatively clear northwest sky two white to orange circular objects, very near eachother,  which both appeard to me to have been disappearing and reappearing from behind clouds, but again, the dusk sky was quite clear. Both objects seemed to be communicating with eachother, or atleast aware of one another's presence.  This happened 4 or 5 times for 20 to 30 seconds before finally niether object ever reappeared again.  I then searched the sky for them or any other similar activities with no luck. I then Informed my fiance as to what I had seen, although her nor the kids had witnessed it, as the event did not last long enough for me to have enlightened them of the event, or take pictures or record It.  ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101573.html",
      "state": "IN",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bff08",
      "summary": "Multiple round shapes moving slowly accross the sky, west of Raceway road we watched as multiple abjects cross the sky with no distint",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2013-10-14T00:00:00",
      "story": "Multiple round shapes moving slowly accross the sky, west of Raceway road we watched as multiple objects cross the sky with no distint pattern, no flashing lights, just a soft warm yellow color,  After those passed, we could see clusters of more way off with maybe 10 or more in close patterns flashing one at a time, we saw maybe 10 differant clusters of them, then immediatly following, the shy was filled with planes looking for them......Trust me...We are NOT alone!!!",
      "link": "http://www.nuforc.org/webreports/103/S103219.html",
      "state": "IN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c023f",
      "summary": "((HOAX??))  Massive cylinder shaped object, thousands of feet long.  ((NUFORC Note:  Witness provides no personal data.  PD))",
      "city": "indianapolis",
      "shape": "cylinder",
      "date": "2013-07-03T00:00:00",
      "story": "Massive cylinder shaped object, thousands of feet long. Noticed a large bright object approaching from the northwest.  Was moving fast on a horizontal flight path.  As it got closer the center appeared molten, ie: black/orange/red at the sides flowing to a white core. Exterior appeared to be metal with discolored areas.  It had huge sections of plating seemed together.  There was no pattern to the plating, just giant random pieces distinguishable by the dark colored seems. Shaped was more of a slowly tampering \"cone\" and was imperfect, had inconsistencies and appeared somewhat organic in design. Object came to a full stop and then vanished... This thing was not a flare, cloud, smoke, somebody playing with an RC toy, or frickin weather balloon.  It was huge, thousands of feet long and absolutely not made by man. NO way.. It was very frightening, we are absolutely terrified. I feel really ignorant now having expectations/ideas of friendly little UFOs buzzing around the galaxy on expedition.  This thing was massive and looked more like some horrible war ship out of the movies. Someone else has too see this… ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99040.html",
      "state": "IN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0940",
      "summary": "There were 2 aircraft. One has lights. The other did not. The one without lights was massive. Both craft were at a high altitude.",
      "city": "indianapolis",
      "shape": "cylinder",
      "date": "2014-01-10T00:00:00",
      "story": "There were 2 aircraft.  One has lights.  The other did not.  The one without lights was massive.  Both craft were at a high altitude. I seen two space craft.  Or at least what I think what I have seen.  One was like a normal aircraft but was to high for a normal airliner and like a weird light pattern.  It has rectangle LED style light all under the wings.  At some point those lights turned off to like make it look like a normal aircraft.  But it was very high up to where if it was normal lights I wouldn't be able to see it because those lights would of been turned off at that altitude.    The other ship I saw looked like a mother ship that you would see off the movies.  It had no lights and I had to look and stare at it to see it.  It did not move and it just hovered at a high altitude.  It looked black and it was like a cylinder shape with massive size wings.  I  was talking to a friend on Skype and I went out there for a second time to turn on my cam.  He saw the mother ship style thing.  Then that is when I saw the second ship that I talked above above.  The wings of the LED style craft looked to leaned back to be a normal aircraft.  The mother ship style thing looked MASSIVE at that high altitude.  I would guess it would be at a altitude of around 30 to 50 thousand feet. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105588.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0aa5",
      "summary": "Weird sounding bright white light, round but not flat shape UFO, faster then the speed of light gone within a blink of a eye.",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2013-12-02T00:00:00",
      "story": "Weird sounding bright white light, round but not flat shape UFO faster then the speed of light gone within a blink of a eye. It was in the first week of June 2013.  Dogs were barking like usual suddenly they stopped it was dead quiet and we heard a noise outside not like a plane or helicopter sound very hard to describe the sound.  We got up and tried to look out our window we couldn't see anything so we went out back and looked at the sky.. We didn't see anything right up above even though the sound sounded like it was above or very close to the house.  We looked to our left and down the street.  We saw the UFO hovering near the next street over near the street light.  It was very bright.  The light coming from it was white.   It hovered there for a good 2 minutes.  We had it on video but the phone it was on was stolen sadly. The weirdest thing was how fast it disappeared.  It went faster than the speed of light it was gone within a blink of an eye.  I have never seen or heard a sound like that ever before.   After I watched the video and the way it hovered was like nothing I know of that the USA or anyone has invented.  I don't know anything that can disappear as fast as it did either.  It was round but wasn't flat.  Have not seen any after that. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104836.html",
      "state": "IN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b73",
      "summary": "Me and my daughter seen the most beautiful shiney spaceship. Not a UFO it was real and was watching us all watch them!",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2014-02-07T00:00:00",
      "story": "Me and my daughter seen the most beautiful shiney spaceship. Not a UFO it was real and was watching us all watch them! Me and my daughters seen a huge spaceship and a lot of other people got out of there cars and seen it too.  It was so beautiful ans shiney.  They was watching us watch them. She. Was getting nervous and wanted to go where the other people were.  I said no honey I don't want to take my eyes off it.   Right then I turned my head and it was gone.  It was so beautiful and shiney. ((NUFORC Note:  We spoke via telephone with the witness, principally to confirm the date and time, which were November 11, 2013, at 18:45 hrs..  We have corrected the time and date above.  The witness indicates that the object looked like a disc, and he has offered to submit an illustration to our Center.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106940.html",
      "state": "IN",
      "duration": "16 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ebf",
      "summary": "Two objects, one stationary, one sweeping the other.",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2014-02-27T00:00:00",
      "story": "Two objects, one stationary, one sweeping the other West/North West of downtown Indianapolis. Background: 10 years as a Firefighter/paramedic.  Currently the manager of Operations for a State wide Private Safety Firm (private Fire/EMS/Safety Services) for institutions and industrial facilities.  Also a private investigator and aquatics homicide investigator. Description: Two objects, one was located in the center and the second swept from the 6'oclock to the 11'oclock positions.  The lightest were changing between White, amber,and red.  The lights were BRIGH but we're not strobes, they did not flash, rotate, or fliIcker. They were NOT Aviation NAV lights!  The lights \"TRANSITIONED\" smoothly between colors.  This lasted for approx 7min.  This was NOT along any approach path for the surrounding airports.  These lights appeared to be at approx 1500 feet. ((NUFORC Note:  We spoke via telephone with this witness, and we found him to be exceptionally eloquent and serious-minded.  We suspect he is a very good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107415.html",
      "state": "IN",
      "duration": "~7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c12d7",
      "summary": "Hovering craft with strobe lights about the Indianapolis Airport.",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2013-12-12T00:00:00",
      "story": "Hovering craft with strobe lights about the Indianapolis Airport. I was driving out of the Indianapolis airport tonight and saw what I thought was a plane coming in.  The odd thing was that this craft had an unusual configuration of lights.  I kept looking up at it when it appeared to stop and hovered.  Then a bunch of lights came on and started to 'strobe'  Lights were quickly flashing on and off.  This lasted for about 5 seconds then everything went dark and I could no longer see it.  I was alone when this happened.  I did notice that the other cars in front of me had put on their brakes and slowed while this was happening.  I cannot imagine what kind of craft would do this.  It was all very odd.",
      "link": "http://www.nuforc.org/webreports/105/S105116.html",
      "state": "IN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c15cb",
      "summary": "My husband and I were driving home from a dinner out.  I've never seen a UFO or any flying object like this.",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2013-12-02T00:00:00",
      "story": "My husband and I were driving home from a dinner out. I've never seen a UFO or any flying object like this.   My husband was the driver who first pointed it out to me.  It was kind of the shape of a cigar so I thought it was a plane until it got closer.  It was changing lights from red to yellow and flying in a way no airplane could fly.   Then suddenly it was moving so fast I was shocked.  The lights stopped blinking then it continued to remain one flash of light and I saw one behind it!!  It was following the first one I saw.   I never believed i would see something like this.   The location was on the east side of Indianapolis.   After they faded we also saw two of the similar objects by our home doing the same thing.  I can't be fore sure if they were the same crafts or not.  It was just very bizarre.  I'm in shock if no one else has reported or seen these. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104997.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1651",
      "summary": "I was driving West on McGregor Road. I seen two orange balls on light. When the one on the left got close to the one on the right it go",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2013-10-23T00:00:00",
      "story": "I was driving West on McGregor Road.  I seen two orange balls on light.  When the one on the left got close to the one on the right it got smaller and disappeared.  The one on the right got really bright.  It was  moving to the east.",
      "link": "http://www.nuforc.org/webreports/103/S103312.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ed0",
      "summary": "5 sets of lights fly into the clouds and turn into or return to 5 large black soundless a/c. ((NUFORC Note:  Witness is USAF vet.  PD))",
      "city": "indianapolis",
      "shape": "changing",
      "date": "2014-06-04T00:00:00",
      "story": "5 sets of lights fly into the clouds and turn into or return to 5 large black soundless aircrafts I observed two sets of lights in the sky in an area where commercial aircraft fly near my house to approach the Indianapolis airport for landings.   The lights were flying side by side with some distance in between them.  They were traveling at a low speed and I thought they were possibly helicopters, however there was no engine noise.   I noticed that there was more distance between the two sets of lights.   At that point I noticed that one set of lights was climbing upward.  I watched the ascending set of lights climb through a cloud until it vanished from my view.   Then I saw a very large black circular and triangular shaped aircraft emerge from behind the clouds floating very slowly.  The craft started descending and changed into a baloon like shape.   I saw a total of five sets of lights and all five flew the exact same pattern and did the same thing.  I did not see where they went or landed.  I am a 66 year old Air Force Veteran and I have never seen anything like this.",
      "link": "http://www.nuforc.org/webreports/109/S109916.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c202f",
      "summary": "Three yellow/orange lights over downtown Indy fliying in a slow triangler formation before fading in the semi overcast sky one by one.",
      "city": "indianapolis",
      "shape": "formation",
      "date": "2014-06-13T00:00:00",
      "story": "Three yellow/orange lights over downtown Indy fliying in a slow triangler formation before fading in the semi overcast sky one by one. A coworker and I were taking a break in a second floor conference room in the building we both work 2nd shift on tonight 6/11/14!    As we were looking out of one of two very large picture windows in the room facing east directly towards the downtown area of Indy, as we were both looking up at the sky, we were both amazed as we saw three yellow/orange lights, slowly flying right over the downtown area in a triangular formation!   As these lights/objects moved slowly in the sky over downtown Indy after several minutes had past, they each began to fade away in the semi over cast sky one at a time which was very strange to us both!",
      "link": "http://www.nuforc.org/webreports/110/S110137.html",
      "state": "IN",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c21a1",
      "summary": "Large gray stingray shaped object chases fighter plane.",
      "city": "indianapolis",
      "shape": "changing",
      "date": "2014-04-18T00:00:00",
      "story": "Large gray stingray shaped object chases fighter plane. I was on the grocery store parking lot placing my groceries in the trunk.  I heard a fighter plane type sound approaching us but didn't see anything.  About 3 seconds later I see a fighter plane coming from the west heading northeast. The fighter plane was traveling very low and very slow.  If I had to guess I would say 2,000 feet in altitude.  I told my son and my friend \"look it's a fighter plane\".  We watched it for about 8 seconds as it flied by directly above us.  Then a large gray object approached the fighter plane from the rear at a very fast speed.  The object had no navigation lights like the fighter jet had. It only had 4 very dim bar lights between the main body and the wings.  I thought it was going to crash into the fighter plane.  It slowed down suddenly about 3 plane lengths away behind the fighter plane. It followed the plane for about 5 seconds.  Then the object gained speed, made a hard right, and then a hard left, cutting off the fighter plane.   The object could be seen more clearly when it turned because it banked left. Then you could tell that the object was shaped like a stingray without a tail.  It was gray and about 12 times larger than the fighter plane. 4 dim bar lights on each side where the wings joined the main body.  The wings were not fixed.  The wings rippled at opposite rhythm like a stingray.  The object took off heading northwest very fast.  The fighter plane gained speed and continued northeast.  2 seconds later another fighter plane coming from the west followed the path as the first plane but traveled at a faster speed.",
      "link": "http://www.nuforc.org/webreports/108/S108675.html",
      "state": "IN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c254f",
      "summary": "Four to five synchronized flashes of white light, moving and circling repeatedly",
      "city": "indianapolis",
      "shape": "formation",
      "date": "2014-11-06T00:00:00",
      "story": "Four to five synchronized flashes of white light, moving and circling repeatedly On October 17, 2014, at approx. 8:40 pm, I saw mysterious lights in the sky as I was driving in Indianapolis, Indiana on I465 eastbound between Meridian Street and the I69 exit.  It was cloudy and cool.   These lights were moving in a synchronized fashion, 4 to 5 lights, coming together and then swooping out, circling around, then coming together again.  They would repeat this movement over and over as I traveled eastbound.   They were dim flashes at first, white color, getting slightly brighter as I watched.  The speed that they moved was quick, but not fast or frantic.   I was watching them ahead of me as I drove. They seemed to be moving slightly ahead of me, but not as fast as I was driving.   I exited I465 at the I69 northbound ramp, and couldn't watch them as close, but I saw them briefly when I turned my head to the left.",
      "link": "http://www.nuforc.org/webreports/114/S114622.html",
      "state": "IN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2670",
      "summary": "Fuzzy orange lights travelling south over Shadeland Ave..",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "Fuzzy orange lights travelling south over Shadeland Ave.. From 82nd st and shadeland ave, I watched one slow moving orange fuzzy light moving south in the sky.  I thought it was a burning plane at first.   I stopped my car and watched it and then from the north 2 more fuzzy orange lights followed a similar path.",
      "link": "http://www.nuforc.org/webreports/114/S114773.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c278f",
      "summary": "Red light with white halo around it.  Moving up and down back and forth through the night sky just above the tree lines.",
      "city": "indianapolis",
      "shape": "sphere",
      "date": "2014-11-06T00:00:00",
      "story": "Red light with white halo around it.  Moving up and down back and forth through the night sky just above the tree lines. At 8:00 pm I let my dog outside.  I looked up to the north east sky and seen a red ball of light with a white halo around it.  It looked like it was going to Land but then Rose straight back up into the sky very quickly That caught my attention.  I told my wife to come quick and look. We both watched as the object moved back and fourth through the sky.  It headed to the ground like it Was going to land, but went straight up into the sky moved left and right very quick and without changing altitude. then it went below the tree line.  We waited for a few minutes and went back into the house.",
      "link": "http://www.nuforc.org/webreports/114/S114689.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2825",
      "summary": "Red light over West Indianapolis.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2014-10-03T00:00:00",
      "story": "Red light over west indianapolis. Red light or orb slowly moving across Indianapolis sky at 22:00. At first I thought maybe it was a helicopter; however, the light was not consistent with any plane or heli i have ever seen. There was absolutely no noise at all and I followed it for a few minutes until it disappeared. Moved from north west to south direction. It was gone in a blink of the eye. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113932.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c362e",
      "summary": "On March 5, 2015, in Speedway,In indianpols. I seen in the speedway race track fans camping field area a very bright out of this w",
      "city": "indianapolis",
      "shape": "flash",
      "date": "2015-03-06T00:00:00",
      "story": "Hello.  On March 5, 2015, in Speedway, in Indianpols.  I seen in the speedway race track fans camping field area a very bright out of this world light blue flashing lights that lite up the dark sky.   Almost look like a transformer had blown but there wasn't any noise and it happen 3 differentt times. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117580.html",
      "state": "IN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3900",
      "summary": "Two intense flashes of light that looked liked transformers blowing.",
      "city": "indianapolis",
      "shape": "flash",
      "date": "2015-01-09T00:00:00",
      "story": "Two intense flashes of light that looked liked transformers blowing. I am a local Indiana Truck Driver.  I and a co-worker who is our company's safety officer were driving south bound on I-465 at, or around, mile marker 43, when we both saw an intense flash of light at the horizon line that looked to be no more then 300 meters ahead of us.  We saw two flashes, and brake lights were everywhere on the freeway at the time.  My passenger and I thought it was a transformer that blew, or some massive electrical issue with the power lines, but once we got to where we thought we could see the flashes coming from, there was no sign of any power outage.  It was very peculiar.  Two very intense flashes of light that resembled balls of electricity.",
      "link": "http://www.nuforc.org/webreports/116/S116589.html",
      "state": "IN",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c99",
      "summary": "Bright beam of light from ground up, then rumbling passing over the house for around 10-15 minutes, making the house shake.",
      "city": "indianapolis",
      "shape": "flash",
      "date": "2015-07-03T00:00:00",
      "story": "bright beam of light from ground up, then rumbling passing over the house for around 10-15 minutes, making the house shake. At somewhere between 5am and 6am, I heard a really loud noise that at first I thought was an airplane, although there are no airplanes that come anywhere near here after the evening.  This noise was pretty low sounding and sounded almost like a bulldozer going over the house, shaking it.  There was also a really bright beam of light that lit up the whole wall in one of the bedrooms, which has blackout curtains.  This didn't sound like thunder, and it wasn't lightning.  Plus, we've lived in this house for about eleven years now and no bright light like that has come in.  The noise woke everybody in the house up, and one of us actually thought that something had hit the house.  The bright light came from the ground, up.  Behind the house is a big field, small woods behind that, and a large golf course.  Not sure if any of the neighbors saw or heard it because this was around a time that most people are asleep.  I'd love to know if anybody else saw it, or what it could possibly be... It lasted about 10-15 minutes. No idea if there was any missing time or anything, but there are 5 witnesses.",
      "link": "http://www.nuforc.org/webreports/119/S119751.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c435a",
      "summary": "It was a big circular object with 4 red lights and a whole bunch of flashing lights",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2015-11-19T00:00:00",
      "story": "It was a big circular object with 4 red lights and a whole bunch of flashing lights. I was at the beauty shop on the east side of Indianapolis right off of 38th and I was outside talking to a friend when I spotted it.  It had me in a trance for a second, then when we noticed it and started pointing at it.  It started to move extremely slow, but it started coming closer and started to duck off behind trees to where we couldn't see it anymore. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123924.html",
      "state": "IN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c44cd",
      "summary": "V-shape craft..",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2015-11-19T00:00:00",
      "story": "V-shape craft. My husband, myself and 2 sons (ages 9 & 14) where going south on Ritter Ave and turn right to go west on 16th St and right above Community Hospital East I had noticed 10 to 15 V shaped crafts in the sky, flying in a v-like formation.   I told everyone to look and my husband pulled over to see them and all the (things) craft split up into different directions and disappeared into the sky.  My husband even got out of the car to get a better look and they where gone.   We continued to my relatives' house on Lynnwood Ave, all of us got out of the car but the crafts (things) where gone!  I have never seen anything like that, but my husband claims he has. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124002.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4537",
      "summary": "At kitchen window 1:00 a.m.for a drink of water.Saw Big obj., lgt's in circle red,green,etc. came straight towd. window then took off",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2015-11-26T00:00:00",
      "story": "At kitchen window 1:00 a.m.for a drink of water.Saw Big object, lgt's in circle red,green,etc. came straight towd. window then took off Seen (3) nights so far; 11/21,22,23/2015.  Starting around 1:00 am each date.  They are circular in shape and \"big\" with lights all the way around flashing and blinking red, green and white.  These things hover for 15 to 30 min's then take off.  I saw it first and couldn't believe what I was seeing.  My husband is a skeptic, so I woke him up to see it!!  It isn't an \"Airplane\" he said, as Airplanes could not hover for that long!  Too big to be a helicopter.  I tried to get pictures with (3) different cameras, but they wouldn't capture it.  Also tried my movie camera, but NOTHING!!  Last night, the 23rd there were (2) side by side of the same size...\"BIG\"!  If they were regular aircraft, they would have crashed.  I live in a community of 71 houses, haven't had the nerve to ask if anyone else might have seen anything!",
      "link": "http://www.nuforc.org/webreports/124/S124337.html",
      "state": "IN",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c45c5",
      "summary": "Two orange circle globes moving south west to north east at a slow speed with no noise.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2015-10-29T00:00:00",
      "story": "Two orange circle globes moving south west to north east at a slow speed with no noise. Time was around 9:30ish PM, event lasted about 5 minutes. I was sitting in my back patio having a cigarette and all of a sudden the circle orange globe objects, 2 of them, appeared on my right hand side in my peripheral view, I turned and followed, they were moving in unison and on a parallel, straight line target. I was surprised and immediately got out of my seat and walked backwards while keeping my eyes on the objects, which were moving from south west to north east, with no noise and as I got further out in my backyard the objects slowed down as I observed them, and them me, and then they slowly started to increase in speed and move in the direction to the north east.   I then decided to run inside and get my cell phone but by the time i got it they had moved from the side of the house to the front on the house and I ran inside to go through the house to go out the front door, as I did I shouted my wife, she and the kids came out and we all stood out front of the house.  The objects had moved off into the distance by this time and only one of them could be seen far away above the tree line.  My wife confirmed she had seen one that was still visible.",
      "link": "http://www.nuforc.org/webreports/122/S122971.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4820",
      "summary": "Orange circle globe, moving fast, then slowed to a stop... No sound…",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2015-10-16T00:00:00",
      "story": "Orange cirle globe, moving fast, then slowed to a stop... No sound... Orange circle object, moved from south east to northeast, fast at first with no sound then slowed to a crawl.  I observed from my back porch.  As the orange circle slowed down, I stood up to get a better view and them it disappeared.   There was also local Indianapolis flight path aircraft in the area and I am certain they must have seen it and should have been on radar.  Someone else must have seen this, it was really obvious, and there was lots of traffic in the area at the time.    One note: 1 - 2 hours before the event, lots of dogs in the local area south of my location were barking louder then usual and car alarms were going off... which I thought was strange.",
      "link": "http://www.nuforc.org/webreports/122/S122697.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c48d4",
      "summary": "V-shaped craft on south side of Indy by power plant.",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2015-10-16T00:00:00",
      "story": "V shaped craft on south side of Indy by power plant. Large V shaped craft over the South Side of Indianapolis, Indiana over the power plant on South Harding just sitting.Absolutely beautiful gray V shape. I was sitting with my wife and friend outside by our fire pit when I saw it and showed my wife and friend. I could not turn from it. ((NUFORC Note:  Date may be flawed. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122787.html",
      "state": "IN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c49f3",
      "summary": "A big, blue flash of light lit up the sky and neighborhood on East side.",
      "city": "indianapolis",
      "shape": "flash",
      "date": "2015-10-29T00:00:00",
      "story": "A big, blue flash of light lit up the sky and neighborhood on East side.  It only lasted a few seconds.  No craft seen, as we were in the garage.  There was no sound at all.  We have lived with in the landing path of the airport for five years, and have never seen anything like this.",
      "link": "http://www.nuforc.org/webreports/123/S123190.html",
      "state": "IN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c74",
      "summary": "A bright orange orb, north from the moon and constellation Orion, occasionally blinking off then on again",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2015-09-11T00:00:00",
      "story": "A bright orange orb, north from the moon and constellation Orion, occasionally blinking off then on again. ((NUFORC Note:  Time and date may be flawed.  We suspect that the sighting may have occurred at 0515 hrs. on 09/07/2015, but we cannot be certain.  Source of report elects to remain totally anonymous, and provides no contact information, so we are unable to verify the time and date of the event.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121774.html",
      "state": "IN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4db8",
      "summary": "Looked like a fireball floating through the sky, then it seemed to stop, change course and disappear.",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2015-09-02T00:00:00",
      "story": "Looked like a fireball floating through the sky, then it seemed to stop, change course and disappear. My friend and I were conversing on his front porch, and I was getting up to leave when we saw a strange light traveling through the sky.  He had mentioned earlier that he had been seeing a lot of military helicopters around lately, so we thought at first that it may have been a helicopter.  But it traveled at a constant, relatively slow speed.   As we watched, it appeared to be some kind of fire, and after it reached a certain point in the sky, it seemed to stop.  I thought I saw it move around a little bit, but it could have just been an illusion because it was dark and we were near the downtown lights.  After hovering near the same spot for about 30 seconds, the \"flame\" got dimmer and dimmer, and then seemed to disappear or get extinguished. I have never reported a UFO sighting before, and though I do believe they exist, until tonight, I have never been so perplexed as to what I saw and then watched disappear in the sky.   I'm a 29-year-old cell phone salesman, and my friend volunteers at homeless shelters and lives by himself.  He's 23 and has Parkinson's and is unemployed.  He has a military background I'm not fully knowledgeable on, I have never served in the military.",
      "link": "http://www.nuforc.org/webreports/121/S121624.html",
      "state": "IN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ee2",
      "summary": "While driving home from work on Ritter Ave. going S turning W on 16th St. and at the corner of Community Hospital East I saw 1",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2016-03-11T00:00:00",
      "story": "While driving home from work on Ritter ave going south turning west on 16th street and at the corner of Community Hospital East, I saw 10 to 12 round orange light hovering above hospital.  I yelled to my husband and 2 sons in the car with me to look at the lights.  My husband pulled over in parking lot of closed shoe store, we all got out of the car, and orange circles formed \"V\" shape in the sky and disappeared.   My youngest son was afraid and wanted to go home.  We have never had another encounter.   There where no noises and I called hospital next day and they have no info on lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  Date may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126221.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c559c",
      "summary": "Bright silver flash in a straight line and extremely fast",
      "city": "indianapolis",
      "shape": "flash",
      "date": "2016-07-08T00:00:00",
      "story": "Bright silver flash in a straight line and extremely fast A bright flash of light in a straight line horizontal high in the sky.  Bright silver color similar to silver tinsel or the color of a burning fireworks sparkler.  It was in a completely straight line and very much faster than aircraft.",
      "link": "http://www.nuforc.org/webreports/128/S128104.html",
      "state": "IN",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c55b4",
      "summary": "Two circular white objects were observed; one was stationary and the other moved very rapidly past it.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2016-07-08T00:00:00",
      "story": "Two circular white objects were observed; one was stationary and the other moved very rapidly past it. One circular white object was spotted in the western sky and while observing it, another object of the same description flew very rapidly from SE to NW past it.  The stationary object remained till obscured by low hanging clouds.  Video was taken of the event and posted to local news media WTHR Ch. 13.  http://www.wthr.com/story/32338121/video-mysterious-objects-in-the-sky-over-indianapolis   Within an hour of breaking the story, the video vanished from the internet.  Multiple people from Marion County and south of the city posted to social media about seeing the same thing.  A still photo from the video can be seen at the link provided.",
      "link": "http://www.nuforc.org/webreports/128/S128160.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5637",
      "summary": "Saw small glowing red spheres on the 4th of July in Indianapolis.  (Definitley not lanterns or flares.)",
      "city": "indianapolis",
      "shape": "sphere",
      "date": "2016-07-15T00:00:00",
      "story": "Saw small glowing red spheres on the 4th of July in Indianapolis. (Definitley not lanterns or flares.) Responding to a YouTube video,  https://www.youtube.com/watch?v=lcMKJbbkgok   I posted the following comment:  July 4th 2016 - We saw them in Indianapolis, Indiana.  I believe they are military drones that detect radiation emitted from possible nuclear devices or dirty bombs all around the country. Apparently people see them in every major population center around the USA.  I say, \"Good job military, I appreciate the protection.  Thanks for keeping us safe!\"  They seemed to be on patrol.  We would see them in one area of the sky, then they would move off and disappear and reappear somewhere else. Very impressive.  I can't rule out the possibility that they could be UFOs, but with the threat of terrorism on a holiday like the 4th of July, it's just my sense that they were \"ours\".  Obviously must be a secret military program. In the check boxes below, nothing applied.  The object(s) themselves glowed orangish red.  They seemed to be basketball or beach ball sized. ((NUFORC Note:  We doubt that the lights were drones.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128447.html",
      "state": "IN",
      "duration": "~30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c57df",
      "summary": "Observed obj. with different color lights flashing.  Obj. was slower than airplanes that were flying by it.  Obj. stopped in mid air.",
      "city": "indianapolis",
      "shape": "changing",
      "date": "2016-06-24T00:00:00",
      "story": "Observed object with different color lights flashing. Object was slower than airplanes that were flying by it.  Object stopped in mid air and went opposite direction.  It then disappeared.  Lights were flashing in a line pattern unlike an airplane.",
      "link": "http://www.nuforc.org/webreports/128/S128002.html",
      "state": "IN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5829",
      "summary": "Orange orb spotted on north side of Indianapolis near Castleton area.  ((anonymous report))",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2016-06-16T00:00:00",
      "story": "Orange orb spotted on north side of Indianapolis near Castleton area. First, let me begin by saying that i have NEVER reported or seen anything like this before in my life.  I know that we are not the only ones living in the universe.  However coming in contact with something not from here is very eye opening.   I was laying down in my bed, there is a dog in our neighborhood who was barking.  There is a window right above the head of my bed.  I see a light out the corner of my eye.  I turn my head to look and there it was:  A large bright orange orb.  I couldn't even say it was a plane or a helicopter.  It was close enough that I could see exactly what it was.   I got scared, ran downstairs to wake up my 73 yr old mother.  I can't get the image out of my head.  This happened at 4:00 am,  it was still completely dark outside.   I'm still scared, because I just don't understand and I can't justify what I saw.",
      "link": "http://www.nuforc.org/webreports/127/S127853.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5999",
      "summary": "Strange red moving objects low in the horizon",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2016-05-20T00:00:00",
      "story": "Strange red moving objects low in the horizon Tonight about 10:24pm, I was outside with my cat and noticed a low flying, bright red flashing object in the east horizon over the nearby highway.  It appeared to stop, and then another appeared from the east,  and then four more objects appeared and they appeared to just hover together.  Then aone by one, the lights were gone (like they turned them off, and a tiny light seemed to drop straight down, like ashes or a hot ember until nothing. As I looked around in the sky over the trees, 2 more appeared in the same area, hovered very close to each other, then \"lights out\" and then they were gone.  No sound whatsoever.",
      "link": "http://www.nuforc.org/webreports/127/S127346.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bd4",
      "summary": "3 silent military aircraft hover then fly over Indy",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2016-04-15T00:00:00",
      "story": "3 silent military aircraft hover then fly over Indy Looking northeast towards Indianapolis from Eagle Creek, we noticed two stationary lights hovering in the sky.  They hovered close together for a couple minutes and then the right one quickly shot up diagonally before flying directly overhead, maybe towards Whitestown. The second plane continued to hover before following the same path, and was shortly followed by a third.  They were triangular, military aircraft and were near silent as they flew low overhead. It was very strange and seemed to be a purposeful flight, they weren't just passing by.  It seems unlikely that they would waste personnel and resources to carry out a military exercise over Indiana, but if so, then why the hovering and strange maneuvers?",
      "link": "http://www.nuforc.org/webreports/126/S126836.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cf6",
      "summary": "23 amber lights travelling northwest to southeast making no sound.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "23 amber lights travelling northwest to southeast making no sound. Upon returning from the grocery, I noticed amber lights in the sky as I carried groceries from the car.  They were travelling northwest to southeast and made no sound.  I counted 23 of them.  They weren't keeping a strict formation and some were stragglers.  I reported them to CBS 4.  I've not heard back.",
      "link": "http://www.nuforc.org/webreports/131/S131188.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e96",
      "summary": "Triangular UFO, with protruding windows, over a field in Indiana",
      "city": "indianapolis",
      "shape": "triangle",
      "date": "2016-10-21T00:00:00",
      "story": "Triangular UFO, with protruding windows, over a field in Indiana One thing I use to love doing was taking drives at night.  One evening back in 2000, I decided to go for a drive; it was about 3:00 am.  Everything was fine.  It was a nice night out and I had the windows down on my car. I decided it was time to head home so I turned down 25th Street, just off of German Church Road. I passed over a small bridge when I saw a triangular-shaped object hovering over a small field.  From the car I could tell there were three dome-shaped windows on two sides of the object and another one off the bottom of the craft.  Lights were on inside. There was a small farm house between me and the UFO so I decided to go just past the house to get a better look.  When I got to where I should have been able to see it better, it was gone.  I didn't see it leave. I didn't see it disappear; it was just gone.   I spent the next minute or two looking around for it, but it was nowhere to be found. A few days, maybe weeks, later as I was watching TV, there was a show (Unsolved Mysteries) that was doing an episode on UFOs.  During this telecast I saw, for the first time, mention of the same craft as I had seen just days before.  It was then that I knew it was real. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130611.html",
      "state": "IN",
      "duration": ">1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fcc",
      "summary": "Glowing Orange orbs float across sky.",
      "city": "indianapolis",
      "shape": "sphere",
      "date": "2016-11-11T00:00:00",
      "story": "Glowing Orange orbs float across sky Multiple orange orbs, glided in a fluid motion in a north east direction.  They glowed an orange red color.  Followed them but disappeared.",
      "link": "http://www.nuforc.org/webreports/131/S131143.html",
      "state": "IN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c60ad",
      "summary": "Silent orange orbs fly very low and disappear.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "Silent orange orbs fly very low and disappear. I saw two orange orbs from my backyard. Both were moving in different directions, one west, the other north-east. The lights looked very low, and didn't flicker or wobble. No sound, as one flew nearly directly overhead. I called my girlfriend outside, who managed to witness one before we lost sight. They followed a straight path before disappearing behind trees and houses. I work at night at a busy airport, and I have never witnessed anything like it. Unsettling because of their altitude and how close to home they were, and their silence. A friend of mine several blocks to my north witnessed five orange orbs in a formation while looking my direction, on the same evening. He watched them disappear all at once, \"as if turning off an old TV.\"  Best rational explanation I can think of is Chinese lanterns or drones, though those explanations don't satisfy me.",
      "link": "http://www.nuforc.org/webreports/130/S130243.html",
      "state": "IN",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c642e",
      "summary": "Watched an orange circular globe travel from east to west.  It disappeared after it enters a high cloud.",
      "city": "indianapolis",
      "shape": "circle",
      "date": "2016-08-16T00:00:00",
      "story": "Watched an orange circular globe travel from east to west.  It disappeared after it enters a high cloud.",
      "link": "http://www.nuforc.org/webreports/129/S129077.html",
      "state": "IN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c84",
      "summary": "Fireballs over Indianapolis on New Years Eve.",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2017-01-06T00:00:00",
      "story": "Fireballs over Indianapolis on New Years Eve. Balls of fire went from a spot on the horizon and came up into the sky in a straight line.  One after another, a small gap between a couple of times.  Four in the sky in a line at once.  Went to a specific point in the sky and then disappeared one after the other.  Fireworks were going off and that was what we were watching.   After the started this event started to happen and coninued several minutes after the end of the fireworks.",
      "link": "http://www.nuforc.org/webreports/131/S131998.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d0b",
      "summary": "Multiple flying and lit-up diamond shaped objects were seen going from one specific place to another.  ((anonymous report))",
      "city": "indianapolis",
      "shape": "diamond",
      "date": "2016-12-30T00:00:00",
      "story": "Multiple flying and lit-up diamond-shaped objects were seen going from one specific place to another waiting in sync for each one to go. Around 1:01AM on Friday December 30th, 2016, I witnessed multiple flying objects in the night sky.  I was up watching a show, when all of a sudden I heard a loud and peculiar noise, not one of an airplane but it was louder and more high pitched.  I looked out of my bedroom window and noticed a flying, lit-up diamond shaped object coming from across the sky, so I watched it.  Curiously I stayed until it was out of sight then right as I was about to turn around I saw another one coming from the same area where the first one had come from.  So I waited for that one to pass but before I knew it I was there for over 45 minuets just watching these objects go from one side of my window to the other.  Finally I had gotten tired of waiting for another one after about the 15th one so I headed to bed. There was a gap between the 15th,16th and 17th ones.  Around 1:55AM, I went to lay down in bed whenever I heard the noise get louder.  Two of the objects flew close to each other a! nd stopped.  About 15-20 seconds later they left one going one way and the other the other way.  I thought it was finally over until I heard the noise coming back again, but shortly after that, a train came at 2:02AM, and after that train, there were no more flying objects that were seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131919.html",
      "state": "IN",
      "duration": "51 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7487",
      "summary": "I was on the highway on e 38th st & pendleton pike when I seen a object that resembled the sun it was a bright ball of light hovering o",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2017-05-11T00:00:00",
      "story": "I was on the highway on e 38th st & pendleton pike when I seen a object that resembled the sun it was a bright ball of light hovering over the highway and as we were getting close it split into 2 other lights then started maneuvering in a weird way it started traveling at a amazingly fast speed then all of a sudden came to a halt and started blinking rapidly as it seen me recording like it was trying to let us know it seen us but shortly after it disappeared and then reappeared on another side of the sky really fast I was shocked on how close we were to it like I never experienced anything of this nature but after this incident I started having problems concentrating on things and seeing strange light hover by my house its really bothering me as if it knew I was recording it and I wasn't posed to or something but I'm glad I got to share my experience and I also have video of this event I'm willing to share",
      "link": "http://www.nuforc.org/webreports/133/S133991.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7533",
      "summary": "4th of July.  Visitors enjoy a fireworks show, while I watched them.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2017-04-28T00:00:00",
      "story": "4th of July.  Visitors enjoy a fireworks show, while I watched them. I was watching neighbors shoot off fireworks.  Their backs were to the craft.  There were 5 lights in the shape of the 5 side of a die.  The object was in the northwest sky. I first thought it was a Japanese lantern, since it was the 4th of July.  However, as I continued to gaze, the object didn't follow the typical Japanese lantern pattern. An interesting few things happened, as I intently watched the object.  The object seemed to be watching the fireworks the neighbors were shooting off.  Then in a split second, the object dropped down vertically and straight back up to its location.  The brightness level stayed the same, the whole time. I went inside to grab my telescope to see it closer, when I returned, it was gone.",
      "link": "http://www.nuforc.org/webreports/133/S133792.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7964",
      "summary": "Noticed a black disc approximately 1,000 feet below about the size of an automobile, no wings.",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2017-11-17T00:00:00",
      "story": "Flying at approximately 30,000 feet from Chicago O'Hare to Orlando, FL, over the skies of Indianapolis, IN, my 9 year old daughter got my attention.  \"What is that black thing near those clouds?\"  I immediately looked out the Boeing 767 port side window and noticed a black disc approximately 1,000 feet below about the size of an automobile, no wings, no vapor trail and it was perfectly visible because we were above the clouds with the object, contrast of the object was perfect.  My wife also saw the object and asked me, \"What is that?  That doesn't look like a plane to me!\"  She is a seasoned flier, over 1,000 flights easy for business and travel, can identify nearly all commercial aircraft.  After about 20 seconds time the object disappeared in the distance heading in a northeast direction.   I'm former Air National Guard, worked for 4 different airlines and Aviation Management major in college.  I know the FAA doesn't allow drones at 29,000 feet, especially in Class Bravo airspace. Familiar with both Air National Guard bases in Indiana and know they do not operate this type of object the 3 of us witnessed.  Daughter later told me the object had a \"green dot or light\" on top of disc.",
      "link": "http://www.nuforc.org/webreports/137/S137195.html",
      "state": "IN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7959",
      "summary": "Multiple red lights, flying in groups of 2 or more, over Indianapolis on 10/6/2017.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2017-10-19T00:00:00",
      "story": "multiple red lights, flying in groups of 2 or more, over Indianapolis on 10/6/2017 Multiple red lights, in groups of two or more, moving at steady pace from south to north, visible with naked eye, above western half of Marion County, in front of cloud cover.  Speed was steady, not fast, not erratic.  As they approached thicker cloud cover, we lost sight of them.  Overall time span lasted about 11 minutes.  They emitted no sound, no flashing or strobes.  In each grouping, the individual lights did not alter position within the group, or individually speed up/slow down.",
      "link": "http://www.nuforc.org/webreports/136/S136596.html",
      "state": "IN",
      "duration": "10-11 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c1f",
      "summary": "Light/object moved sporadically for almost 50 minutes, unexplainable speed and precision.  ((NUFORC Note",
      "city": "indianapolis",
      "shape": "light",
      "date": "2017-09-28T00:00:00",
      "story": "Light/object moved sporadically for almost 50 minuets, unexplainable speed and precision. Stepped outside to have a smoke, and I tend to look at the sky, and to the northeast sky, I see a light, flashing like a plane far off in the distance would, but I noticed the object wasn't moving away or towards me but rather up and down, rather quickly.  Also it moved in an oval shape from time to time and also in a close figure eight movement.   It also seemed to turn, that's when I noticed it wasn't really flashing but something else.  I really can't explain how this thing was moving.   I have a few videos I tried to take.  You can clearly see the light/object.  You can see it moving sporadically up and down, side to side.  My heart was pounding a few times because of the way this thing was moving, and how fast and precise it was.  Honestly amazing.",
      "link": "http://www.nuforc.org/webreports/136/S136313.html",
      "state": "IN",
      "duration": ">40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7dd8",
      "summary": "Kathy Davis abduction.",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-05-31T00:00:00",
      "story": "Kathy Davis Abduction at Kitley Woods. (Budd Hopkins) The subject of the book & TV movie, \"Intruders\", was allegedly abducted near Indianapolis.",
      "link": "http://www.nuforc.org/webreports/141/S141582.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7e5b",
      "summary": "2 oval some what metallic objects at different alt. crossing sky underneath two passing jets headed in opposite dir. ((MUFON report))",
      "city": "indianapolis",
      "shape": "sphere",
      "date": "2018-05-15T00:00:00",
      "story": "Two oval some what metallic objects at different altitudes crossing the sky underneath two passing jets headed in opposite directions. Working on the Campus of IUPUI in Indianapolis, Indiana, on the 4th floor of the BS building looking directly West.  There is always a considerable amount of airplane traffic as the Indianapolis Airport is SW of this location.  That day I counted nine aircraft that where visible due to the atmospheric change that causes water vapor contrails.  As I counted two aircraft appear to be headed toward each other at different altitudes.  I thought it would be interesting to record a video.  In the video you see me raise my Iphone clearly seeing the bell tower in the center of campus as I point the phone to the sky you see the reflection of the office window glass and just after that I zoom in on the two jets (at the 7-8 sec mark) you see the UFO cross the path below the jets from right to left at a tremendous rate of speed.  At the 9 sec mark, you see similar object cross the same path at a higher altitude.  (it appears smaller) I never saw the objects until I watched and slowed down the video.  The objects appears oval and potentially reflective to the sunny day.  The motions where great speed from right to left.  In watching the video I was shocked as I didn't see the object when I first created the video.  I would have never had seen them if it wasn't for the fact I wanted to see how close the two jets were getting.  I lost sight as the objects went out of range.",
      "link": "http://www.nuforc.org/webreports/141/S141537.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7ed9",
      "summary": "Yellow/orange fireball in Southern sky seen in S. Indianapolis, IN, for 4 minutes in evening of 05 May, 2018.",
      "city": "indianapolis",
      "shape": "fireball",
      "date": "2018-05-10T00:00:00",
      "story": "Yellow/orange fireball in Southern sky seen in S. Indianapolis, IN, for 4 minutes in evening of 05 May, 2018. On 06 May 2018 at 21:55 EST, I was walking South in the 5200 block of Madison Ave. in Indianapolis, IN. Mildest haze, no clouds, visibility 8 / 10. I saw a yellow/orange ball of light at approximately 15-18 degree elevation in the Southern sky. It appeared to have ignited, burned increasingly brighter for one minute, and slowly extinguish over the next 3 minutes.  It wasn’t visible at 22:00 EST, from my perspective. If the object had the appearance of motion, I would have thought it was a paper lantern. I estimate the distance from 6 miles to infinity.",
      "link": "http://www.nuforc.org/webreports/139/S139744.html",
      "state": "IN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f18",
      "summary": "Flat black square object flying NE at altitude of plane on approach.   ((NUFORC Note:  MUFON CMS report.  PD))",
      "city": "indianapolis",
      "shape": "rectangle",
      "date": "2018-04-26T00:00:00",
      "story": "Witness reported a flat black square object flying NE at altitude of plane on approach to Indy airport.  Object flew directly over his home near intersection of I-65 and Lafayette Rd., traveling NE approximately 20 degrees from true north.  Altitude:  in between a high flying hawk and private plane on approach to Indianapolis International airport.  Notes: - Not a balloon or bird - held altitude - silent - no lights of any kind. 5 mins. (NUFORC) http://www.nuforc.org/webreports/110/S110717.html",
      "link": "http://www.nuforc.org/webreports/139/S139597.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8260",
      "summary": "VERY unusual loud ongoing 'engine' noise for 25 minutes or more in the sky - invisible",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2018-09-27T00:00:00",
      "story": "VERY unusual loud ongoing 'engine' noise for 25 minutes or more in the sky - invisible This morning, at around 6:45 am, I was awakened by what seemed to be a very loud ongoing noise in the sky.  We are in a flight path but this seemed to be not the usual airplane engine noise.  It continued for at least five minutes, and I finally went out in my pjs and stood on the driveway at the back of our cul de sac.   The sky was whited out and nothing could be seen visibly in the sky.  The sound, however, was like massive engines that had tones (f and g above middle c, half note measures) and underneath those tones was a low infrasound engine tone that sounded like low heavy steady wind.  It was Extremely loud and ongoing and I kept wondering why no one else had come out of their homes to see what the source was.  The Only thing I could come up with is perhaps it was a Massive cloaked mothership and or a fleet of same, flying low and slow.   It kept up for at least 20 minutes and then finally started fading off and I could hear it in the distance, it seemed to be heading southwest as far as distance sound.  I'm wondering if perhaps other have heard this.",
      "link": "http://www.nuforc.org/webreports/143/S143230.html",
      "state": "IN",
      "duration": "25 minutes or more"
    },
    {
      "_id": "64d005f478aba2ec5a3c82a9",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-11-09T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143630.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8357",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-09-27T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143197.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8377",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-10-25T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143565.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c845e",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-09-13T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143032.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c84e2",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-08-10T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/142/S142386.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8608",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-08-10T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/142/S142480.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8618",
      "summary": "MADAR Node 107",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-08-22T00:00:00",
      "story": "MADAR Node 107 MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/142/S142802.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8b9b",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2019-02-27T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/145/S145018.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8be2",
      "summary": "I saw what I bleave to be a UFO. up close. 30ft.  Above the ground.  And apparently 40-50ft. ((anonymous report))",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2019-02-14T00:00:00",
      "story": "1977 Indianapolis, Indiana.  I saw what I bleave to be a UFO. up close. 30ft.  Above the ground.  And apparently 40-50ft.  Up the street from where I was standing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144810.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8c04",
      "summary": "2 Very fast Lights Chasing each other from East to West right above cloud line.",
      "city": "indianapolis",
      "shape": "light",
      "date": "2019-02-14T00:00:00",
      "story": "2 Very fast Lights Chasing each other from East to West right above cloud line. This morning at 7:17am, when going to warm up my car, I saw 2 UFO'S chasing each other!  They were white lights.  They caught my eye because at first, I thought they were shooting stars; but they were way too big and low.  They were flying right above the cloud line and going faster than any aircraft I've EVER seen.  I live by the airport so I'm used to seeing aircrafts all night and day long.  This lasted 10 seconds.  They were \"playing\" over my house and reminded me of kids chasing each other.  They flew in snake like formation not a straight line.  They went from the west sky until they went so far east they disappeared from my range of sight.  They appeared to be their own light source.",
      "link": "http://www.nuforc.org/webreports/144/S144843.html",
      "state": "IN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8c58",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2019-02-01T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/144/S144643.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8daf",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2019-01-11T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/144/S144381.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8e9a",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2019-01-04T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/144/S144276.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8f68",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-11-24T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143777.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8f72",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-11-24T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143775.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8f6d",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-11-24T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143779.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8f8d",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-11-24T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143866.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8fc2",
      "summary": "MADAR Node 07",
      "city": "indianapolis",
      "shape": "",
      "date": "2018-11-24T00:00:00",
      "story": "MADAR Node 07",
      "link": "http://www.nuforc.org/webreports/143/S143865.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c9009",
      "summary": "I was walking home after visiting family, and looked up and saw 3 lights roating on an unknown object. The lights were above the clouds",
      "city": "indianapolis",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "I was walking home after visiting family, and looked up and saw 3 lights roating on an unknown object.  The lights were above the clouds and it was completely silent.  I called my roommate to tell them what I saw.  During the call, the phone cut out for a few seconds then the lights suddnly disappeared.",
      "link": "http://www.nuforc.org/webreports/151/S151155.html",
      "state": "IN",
      "duration": "1-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c902c",
      "summary": "Low flying huge disc spotted in Indianapolis, IN, 1963, by a group outside at dark.",
      "city": "indianapolis",
      "shape": "disk",
      "date": "",
      "story": "Low flying huge disc spotted in Indianapolis, IN, 1963, by a group outside at dark. A small group of neighborhood teenagers were outside in the early evening just talking and hanging out.  All of us spotted a rotating object approaching low but with no sound.  It stopped directly over us.  It had green lights revolving around it; hovered, and then sped off.  I was 17 years old; now retired and living in Colorado.  This has bothered me for 56 years.  One of the other people who saw it became my husband several years later, is an MD and very high up in the Air Force when he retired.  We reported this to the Indianapolis airport and was told we probably saw nothing.  This was definitely not a joke to us - scared us all pretty badly.  I was an educator for 30 years; all of our group became professional people.  From that day forward, I became a complete believer in UFOs as I witnessed one and will never forget it.",
      "link": "http://www.nuforc.org/webreports/150/S150865.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9113",
      "summary": "Object left a neon orange trail in its wake. The trail diminished quickly, like a sparkler trail. At first I thought it was a shooting",
      "city": "indianapolis",
      "shape": "disk",
      "date": "2019-12-01T00:00:00",
      "story": "Object left a neon orange trail in its wake.  The trail diminished quickly, like a sparkler trail.  At first I thought it was a shooting star.  Then it stopped dead. It became aware that I was observing it.  It shot strait up in an arch fatter than I've ever seen anything move.",
      "link": "http://www.nuforc.org/webreports/149/S149590.html",
      "state": "IN",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c92b8",
      "summary": "MADAR Node  87",
      "city": "indianapolis",
      "shape": "",
      "date": "2019-12-01T00:00:00",
      "story": "MADAR Node  87",
      "link": "http://www.nuforc.org/webreports/150/S150108.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c948f",
      "summary": "((NUFORC Note:  Little information provided by witness.  PD))",
      "city": "indianapolis",
      "shape": "unknown",
      "date": "2019-12-19T00:00:00",
      "story": "((NUFORC Note:  Little information provided by witness.  PD))",
      "link": "http://www.nuforc.org/webreports/151/S151292.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c94f5",
      "summary": "Strange rotating lights seen over Indianapolis Airport Hub.  ((NUFORC Note:  Possibly advertising lights.  PD))",
      "city": "indianapolis",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Strange rotating lights seen over Indianapolis Airport Hub I was returning to work after getting food on 11/28/19 around 23:50 hours and noticed 4 to 5 lights rotating in a counter-clockwise formation equally spaced apart from each other in a diameter.  The lights while rotating would zoom into the center and then back out to the exact distance they originated from above the Fed Ex Hub at the airport (Above the control tower from the perspective to my location). The clouds were low hanging, no craft was visible.  I thought that it was strange to be seeing that but also that it had to be some sort of ground light making this effect. I  asked my senior officer about this on 12/2/19 and he stated that there is nothing that would produce that over the hub.  I have not seen the pattern before or sense.  I then searched the internet and located this reporting site that also has a claim of strange lights in Indianapolis roughly 15 to 20 minutes after the time I had observed them.",
      "link": "http://www.nuforc.org/webreports/151/S151266.html",
      "state": "IN",
      "duration": "1-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c951c",
      "summary": "Pyramid shape narrow craft, four bank of lights beginning in red then white, and point light was red, stable craft moving at a steady p",
      "city": "indianapolis",
      "shape": "other",
      "date": "2019-12-01T00:00:00",
      "story": "Pyramid shape narrow craft, four bank of lights beginning in red then white, and point light was red, stable craft moving at a steady pave with no sound of propulsion system",
      "link": "http://www.nuforc.org/webreports/150/S150657.html",
      "state": "IN",
      "duration": "30 seconds"
    }
  ]
}