{
  "city": "irvine",
  "fetch_timestamp": "2025-07-12T14:35:53.012309",
  "record_count": 70,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b43ce",
      "summary": "I saw blue lights that were formed into a circle moving right to left for 30 seconds then went all the way to its right and disappeared",
      "city": "irvine",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "I saw blue lights that were formed into a circle moving right to left for 30 seconds then went all the way to its right and disappeared My dad was evtering the freeway, as he entered i looked up and imediately notice at least 6 blue lights forming a circle. I looked very closely and the object did not have any wings, just a circle, it looked as if it was very far yet so close. after 30 seconds of moving right to left, we continued driving and i turned to look through the rear window, it loked as if it was landing  fastly, after 40 seconds it disappeared into the ground.",
      "link": "http://www.nuforc.org/webreports/049/S49843.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4b8b",
      "summary": "Cigar shaped object shiny and silver looking then immediately faded into nothing.  Clear blue skies!",
      "city": "irvine",
      "shape": "cigar",
      "date": "2019-07-12T00:00:00",
      "story": "Cigar shaped object shiny and silver looking then immediately faded into nothing.  Clear blue skies!",
      "link": "http://www.nuforc.org/webreports/147/S147471.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cc3",
      "summary": "Thousand of lights like fireflys and dim light shined down....Beam of light around 12 ft. wide.",
      "city": "irvine",
      "shape": "unknown",
      "date": "2019-06-07T00:00:00",
      "story": "Thousand of lights like fireflys and dim light shined down....Beam of light around 12 ft. wide. Around midnight the electric had went out.  There had been storms the day earlier.  The next night the electric went out around 12:00am.  I think could have been off due to reparing electric poles ets. finishing up from the day earlier.    Around 2:00am there were thousand or more firefly lights all over the sky.  I looked out the window and a dim light was shining down on my home.  We are in the mountains and rural not close to the city.  The electric came back on around 7am in the morning.  7 hours and these lights were there till light 7:00am when electric came back on....",
      "link": "http://www.nuforc.org/webreports/146/S146497.html",
      "state": "KY",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b5406",
      "summary": "There was a ring of blue lights that did not appear to move in the sky.",
      "city": "irvine",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "There was a ring of blue lights that did not appear to move in the sky. I was exiting the freeway when I looked up and saw a small ring of blue lights.  It caught my eye as it was unlike any light configuration I had ever seen on an aircraft (there is an airport near by and we have a lot of heliocopter traffic, so I am familiar with standard aircraft lights).  I watched it for as long as I could until the turn of the freeway off ramp took it out of my field of vision.  I saw it for approximately 10 seconds and in that time it did not appear to move nor did any lights flash (such as flashing red and blue lights that is on standard aircraft).",
      "link": "http://www.nuforc.org/webreports/062/S62850.html",
      "state": "CA",
      "duration": "10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a73",
      "summary": "Dark circular object surrounded by white/bluish tinted lights.",
      "city": "irvine",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "Dark circular object surrounded by white/bluish tinted lights. Experienced bright lights go by our second floor townhome window.  When I looked outside my window, above my townhome I saw a dark circular object with lights around it.  It was about 50 ft above the ground.  The white lights around the object seemed to have a blue tint around them.  The object made something like a \"buzzing\" sound as it hovered over my townhome.  It looked as if it was spinning in place as it hovered there for about 5 minutes.  I looked outside my window to see if anyone was controlling a toy but no one was around.  Then it flew west toward the foothills at a very fast speed.",
      "link": "http://www.nuforc.org/webreports/062/S62857.html",
      "state": "CA",
      "duration": "5 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d1e",
      "summary": "Bright white circles of light on one side, red light on trailing edge of other side. Amazing flight patterns.",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "Bright white circles of light on one side, red light on trailing edge of other side. Amazing flight patterns. These were two strange objects cavorting in the sky in Irvine/Foothill Ranch area - Bright white rings of light on one side, red light on trailing edge of other side.   Amazing flight patterns... Capable of sharp turns and twists, followed by periods of hovering.  Flight pattern reminiscent of those hydro-plane toys that have become popular, except that these two were much larger and capable of flying above the cloud layer (600').  If this is some kind of hoax or toy, then damn, I want one for myself!",
      "link": "http://www.nuforc.org/webreports/059/S59225.html",
      "state": "CA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d1f",
      "summary": "Lights in Irvine October 2007: Hoax",
      "city": "irvine",
      "shape": "",
      "date": "2007-11-28T00:00:00",
      "story": "Lights in Irvine October 2007: Hoax Seeing circular lights in Irvine area? It's a hoax - and dammit, I STILL WANT ONE!!! http://www.ocregister.com/news/ufo-orange-county-1886384-unidentified-flying",
      "link": "http://www.nuforc.org/webreports/059/S59226.html",
      "state": "CA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5de3",
      "summary": "Disk-Like object  with lights west of John Wayne Airport",
      "city": "irvine",
      "shape": "disk",
      "date": "2007-11-28T00:00:00",
      "story": "Disk-Like object  with lights west of John Wayne Airport Disk like object darting up and down in the sky. It would go side to side, gently turn and dart back up to the sky. I often watch the airplanes leave John Wayne Airport, and this was the approximate size of average passenger plane. It had lights evenly spaced along sides. The whole experience was strange, but what seemed odd to me is it darted toward the ground and disappeared beyond a hill approxametly over Costa mesa/Santa Ana.",
      "link": "http://www.nuforc.org/webreports/059/S59246.html",
      "state": "CA",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f3d",
      "summary": "Circluar shaped object outlined with blue lights flying over Irvine, CA",
      "city": "irvine",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "Circluar shaped object outlined with blue lights flying over Irvine, CA I know John Wayne Airport is really close by but it has a curfew, and it's not that close enough to make the planes look that big when they take off. This thing was a perfect disc shape. It was a saucer, it had very bright blue lights that outlined the sides, it varied in speed from practically hovering to way too fast for any helicopter to ever catch up, and it even flew on it's side and while changing it's angles. And it was either really big, or really really close. And it just stayed flying around in the same general area for a long time, five or ten minutes. I know helicopters don't do that and if they did, they would have a searchlight looking for something. This thing looked like it was just having fun flying around as if it was joyriding. And if it were a helicopter it would make that continuous droning helicopter sound. I think this thing was actually really close because I did hear it make some noise every now and then, depending on if it was flying towards me or away or if it was flying flat or on its side. And it definitely did not sound like a helicopter. It made this sort of high pitched buzzing sound. Sort of like those toy planes, but a little different. When I first saw it, I was actually walking back to my dorm hall on the UC Irvine campus. Judging by the area where it stayed flying for the ten minutes or so that I saw it, I know I couldn’t have been the only one to have seen it. It was only around 10 o’clock at night and I would guess that it was flying somewhere in the direction of the 405 Freeway or the Irvine Spectrum Mall; somewhere anyone could get a good, unobstructed view of it. But I went up to my room, and the window of my room faces the same area where it had been flying when I had initially seen it outside, and it was still flying around for another few minutes. And when it went away, it didn't fly off into space, it looked like it was flying downwards to earth and it disappeared from my view behind the other dorm halls and trees.",
      "link": "http://www.nuforc.org/webreports/063/S63094.html",
      "state": "CA",
      "duration": "10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b625b",
      "summary": "...a flying circular disk with bright lights on the bottom outer rim.   It was about 6-20 feet in diameter, spinning and hovering",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "...a flying circular disk with bright lights on the bottom outer rim.   It was about 6-20 feet in diameter, spinning and hovering At about 10:30pm PST, my girlfriend and I were driving home from dinner about 5 miles away from our residence.  On the way home, I noticed a flying circular disk with bright lights on the bottom outer rim.   It was about 6-20 feet in diameter, spinning and hovering from side to side, less than 50 yards from the ground.  I was about 100 yards from the object when I noticed it and I froze.  My girlfriend asked me what was wrong, and I told her to turn around at the next street after we had passed it.  As we drove up the hill, I got a closer look and saw that there was blue and red lights spinning around the outer rim at about 1 revolution every 5 seconds.  I told my girlfriend to make a right into the \"Strawberry Farms Golf Course\" to take a closer look, but she refused and we had to drive another mile before we could take another glimpse at it.  When we returned, the object had flown about 1/2 a mile away on top of a hill, and was very hard to spot.  I was going to take a picture, but could not get a clear shot from a moving vehicle, especially with a camera phone.",
      "link": "http://www.nuforc.org/webreports/057/S57303.html",
      "state": "CA",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b6318",
      "summary": "object flashed lights down on river across from my house",
      "city": "irvine",
      "shape": "unknown",
      "date": "2008-01-21T00:00:00",
      "story": "object flashed lights down on river across from my house I was looking out my sliding glass door towards the Allegheny River. The river is in my back yard.I saw a bright light coming towards me over the mountain ridge across the river from my house.. It came closer and startd to go north over the river. It flashed two beams of light down on the river.There were multicolored lights flashing on the bottom and no noise. I could not make out the size as it was 2Am and very dark out.It went about 50 yards up river and suddenly flew off at a great speed. I saw two very bright objects over the mountain ridge. Circular in appearance. At this very spot three years ago. I never reported these sighting.I got the nerve when I saw all the reports on this sight ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60913.html",
      "state": "PA",
      "duration": "5 Min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6312",
      "summary": "A triangularly shaped, noiseless aircraft almost crashed into our car.",
      "city": "irvine",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "A triangularly shaped, noiseless aircraft almost crashed into our car. Last night, the moon was a bloody red and the sky was blue and black and purple. it appeared very ominous but still nothing to flip out. While I was driving, everyone in the car claimed to smell the sweet sweet aroma of vanilla cupcakes. We were out in the middle of nowhere, not knowing where we were apart from the fact that it was en route to irvine. They thought it was rather strange that the smell would be so prominent in the middle of the night, when we're surrounded by nothing but hills. Soon after, everyone in the car started exclaiming, 'omg, wth is that?! look at that!?\" from the corner of my eyes, all I could see were lights. It looked like a car was coming from a merging lane. When I actually looked over, i saw this triangular shaped aircraft. It had two lights, and was tilted at a 45 degree angle. It was flying at the same level as us, as if it were a car. And then, for some incomprehensible reason, this unidentified aircraft flew right in front of us, cutting us off. I was driving at 80 miles per hour, and was forced to brake. It might sound bizarre and a little egotistical, but it really, really, really, seemed like it was out to get us. It pretty much intercepted us. changed directions right when it came in front of us. And when it was ahead of us, it took off, and decided to head towards the sky. It made no noise. You know how airplanes and things like that make an insane amount of noise even if you're about a mile way? well, it was close as hell to us and we heard nothing from it.",
      "link": "http://www.nuforc.org/webreports/058/S58566.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b63cd",
      "summary": "Ring of blue light flying in physics-defying pattern around Irvine Spectrum.",
      "city": "irvine",
      "shape": "circle",
      "date": "2008-03-04T00:00:00",
      "story": "Ring of blue light flying in physics-defying pattern around Irvine Spectrum. Circular disc about the size of a helicopter (size cannot be determined, only its location of flight is compared to a helicopter that flew past that region) gliding in circles, dipping and gliding back upwards, gliding down towards the unseen hillside. Re-emerges a few minutes later to continue its erratic physics-defying gliding pattern. Moves at a consistent speed, and moves easily from the ground to very high into the sky. Unidentified craft has only two lighted rings of blue on its underside, thinner ring outside, thicker ring inside, and seems to have a reflective surface. One blinking light was observed. The object seems to emit some motorized humming sound, confirmed by two other witnesses. The craft flew for approximately 10 - 15 minutes on the other side of the 405 freeway from the Irvine Spectrum's Nordstrom parking lot (where the craft was being observed from). 5 minutes later the craft was observed to be hovering over the other side of the Irvine Spectrum, only to dip behind one of the corporate buildings (WTBG Building if memory serves correct) and disappear, observed from the Macy's parking lot.",
      "link": "http://www.nuforc.org/webreports/060/S60433.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6475",
      "summary": "Blue/White Circular UFO near UC Irvine's Mesa Court at 9:30 p.m. on 5/19/08",
      "city": "irvine",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "Blue/White Circular UFO near UC Irvine's Mesa Court at 9:30 p.m. on 5/19/08 I am a student at UC Irvine living in the Mesa Court Undergraduate Housing near the intersection of Campus and University Ave. I reported about a similar, if not the same UFO that I had witnessed 11 days ago flying in the exact same place as tonight. I was in my dorm room on the third floor which faces Parking Lot 5, when I heard the same sound that I had heard a week and a half prior coming from the UFO. Again it sounded similar to that of a toy plane, but I think it’s buzz is a little bit higher pitched than a toy plane. I looked out of my window and there it was, the UFO outlined with blue lights, flying closer to my housing community. I ran outside, this time determined to get a video of it, but when I went outside, I realized that I wasn’t wearing my glasses so it just looked like a small thin line of blurry blue lights. So I ran back up to my room, grabbed my glasses, and ran back outside. I could see it clearly now, flying overhead like last time, in what seemed like the direction of the 405 freeway. I ran towards the parking lot so that I could get a better video of it, but unfortunately, all that my video camera was able to pick up was a spot of blue light. There were other students in the parking lot also. There were a couple of guys by their car, one of them I heard saying to his friend, “It’s a UFO, it has to be.” After all, it was in plain sight, flying fairly low to the ground, probably no higher than one of those privately owned propeller planes that I see a lot of flying around Irvine. I’ve read other UFO reports from people who have seen them near the UC Irvine campus and it seems like there are two common sightings: one has blue lights and the other has white lights. From my dorm room, as well as when I saw it without my glasses, it looked like it had blue lights. But when I got a closer look in the parking lot, it seemed to have white lights. Maybe the lights look different depending on how close you are. But the lights themselves looked slightly different this time; t! hey didn ’t necessarily look like clean rectangles that outlined the sides like last time, instead they seemed to have an edge, sort of like a cross between circles and triangles, that outlined the edge. And there seemed to be some sort of a flickering light underneath, within its circular shape that flickered every now and then. It stayed flying in the same place for about ten minutes, flying at different angles as well as hovering in place for a few seconds at one point. I also saw a helicopter that seemed to be flying towards its direction. After a few minutes, I ran to another spot near the parking lot to hopefully get a better quality video of it but a few seconds after I got there, it slowly started flying away behind the trees and apartments and disappeared from my sight. There were another couple of guys in the parking lot who obviously saw it. One of them was waiting in the parking lot while his friend ran across the street when there were no cars coming and tried to run up the hill where the apartments are located to see where it was going. I doubt he was able to locate where it had gone because he came back a couple minutes later looking a little disappointed; so was I that I couldn’t get a better video of it.",
      "link": "http://www.nuforc.org/webreports/063/S63318.html",
      "state": "CA",
      "duration": "10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b66c1",
      "summary": "Ring of Blue Lights that moved similar to a jelly fish seen from 405 Freeway in South Orange County California.",
      "city": "irvine",
      "shape": "other",
      "date": "2008-03-04T00:00:00",
      "story": "Ring of Blue Lights that moved similar to a jelly fish seen from 405 Freeway in South Orange County California. At around 8:45pm my sister, boyfriend and I were on the 405 freeway (South Bound) about to exit Lake Forest Drive, when my sister looked up and said “what is that!” I looked up and saw a ring of blue lights wobbling in the sky as it moved forward. It moved kind of like a jelly fish. When it moved out of my site because I was driving, I asked my boyfriend what it was doing. (He was in the back seat) and he said that it turned sideways then zoomed off quickly in a diagonal motion upward.",
      "link": "http://www.nuforc.org/webreports/060/S60520.html",
      "state": "CA",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b66ee",
      "summary": "Sighting near Irvine Spectrum.",
      "city": "irvine",
      "shape": "changing",
      "date": "2007-11-28T00:00:00",
      "story": "Sighting near Irvine Spectrum. I work in south Irvine near the Spectrum and I was behind our building when I saw the object. Our building is at the end of a street named Goddard and right behind us are hills and some wilderness. I was out back talking on my cellphone and having a cigarette, just as I finished my phone call I happened to look up at a passing jet airliner. John Wayne Airport isn't too far away, so we see alot of air traffic. Well, as I was observing the jet, another object moved into view. What caught my eye was the sun reflecting off it's surface. At first I thought it was a weather balloon, as it was translucent in nature. It was a solid shape at first, like an aspirin. Then it lost it's shape and became unstable and undulated along. It did this for a moment, and then became a sphere, then going back to undulating. I watched it sharply and then it just disappeared. I'm not sure if my eyes were playing tricks on me, but I know what I saw. Also, I should mention a few other details such as it's size. While at first appearing small, the jet passed right underneath it. The jet was pretty high up there, so this thing must have been about 1/6 the size of the aircraft. Even though it was translucent, I did notice that whenever the sunlight reflected off it's surface, the material briefly became dark and metallic. Also, the object was coming from the direction of the hills behind us (west) and was heading east towards Santiago Mountain.",
      "link": "http://www.nuforc.org/webreports/059/S59543.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6721",
      "summary": "circular object flys over the Irvine Spectrum 50+ people all saw it also.",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "circular object flys over the Irvine Spectrum 50+ people all saw it also. So my friends and I went to see a summer thriller at midnight at the Irvine Spectrum on July 3rd 07.  The place was packed with a lot of people cause it was the day before the Fourth of July.  As we were walking towards the ticket booth at the entrance of the Theatre we noticed that everyone was looking up at the sky..taking pictures and using their cells to capture what we saw up in the sky.  It was a Circular object..with pinkish/green lights (about 5)   flying over in the night sky.  At first I thought it was a helicopter or plane since its in the direction of the John Wayne Airport...but the swift hoovering and flight pattern was too quick and very unusual.  It definitely caught my friends and my attention, as well as all the people there at the Spectrum mall in irvine.  It then descended in such a weird and fast fashion and dissappeared behind the buildings.  I haven't heard anything about it... and although I don't believe in this sort of stuff...it left my friends and myself wondering... I feel so cliche saying this, but..I Am certain I saw a unidentified flying object.",
      "link": "http://www.nuforc.org/webreports/057/S57483.html",
      "state": "CA",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a34",
      "summary": "Floating circular object seen over Irvine Spectrum",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "Floating circular object seen over Irvine Spectrum After exiting the Irvine Spectrum movie theater through the front by the ticket office we saw several people looking upward into the sky. The couple we were with as well as my girlfriend and I saw one object floating over the area in a hover pattern. It was circular in shape and had several blue lights surrounding it. I am very skeptical about UFO's however both the group I was with and a large number of people (about 50) were staring into the sky wondering what the object was. We did not hear the sound of a helicopter and do not believe it was an airplane due to its ability to hover and the tight circles it was doing in the sky. After about 10 minutes the object floated about the cloud layer and was not seen. There were people there taking pictures of the image and most of us were dumbfounded by what we saw. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57553.html",
      "state": "CA",
      "duration": "10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d54",
      "summary": "several bluish green lights created a circular object.",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-10-08T00:00:00",
      "story": "several bluish green lights created a circular object. I saw a circular object formed by several small blueish green lights.  The object appeared to flying in a small circle, then went straight up and came back down until it disappeared behind a tree line.",
      "link": "http://www.nuforc.org/webreports/058/S58824.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e84",
      "summary": "Blue circle lights over Irvine campus",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-06-12T00:00:00",
      "story": "Blue circle lights over Irvine campus My girlfriend and I were driving down University Ave and Campus Ave when all of the sudden I saw some flashing blue lights through the clouds toward the University of California Irvine Mesa Court dorms, but thought nothing of it because it is a fairly brightly lit area. Then all of the sudden she said \"Hey do you see that?! That thing in the sky!\"  I thought nothing of it until I looked up again toward the sky and saw two bright blue circle of lights flying around the sky. We turned into the Mesa Court dorms' parking lot to catch a better look at it but as we turned around back, our view was obstructed by the buildings themselves. By the time we came around the corner and into an open area the lights were gone already. To be honest, I was really doubtful of what we saw because I do not believe in those type of things- UFO and all, but I searched on Google and came across this site that reported two other reports of seeing circle lights in the sky. She said that she saw two flying circles one above the other circling the buildings high above. I was driving at around 50MPH, passing by the wild life reservation area toward the university campus when we witnessed this. Did anyone else see it?  You can e-mail me if you saw it also.",
      "link": "http://www.nuforc.org/webreports/056/S56614.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f11",
      "summary": "Two objects seen in sky near Irvine, California.",
      "city": "irvine",
      "shape": "circle",
      "date": "2008-02-14T00:00:00",
      "story": "Two objects seen in sky near Irvine, California. This happened on Thursday night 01.31.08 at around 9:50pm.  I saw what appeared to be two small dots hover up into the sky.  I was in the industrious part of Irvine where there are many buildings, so the horizon line was out of sight to me.  These two dots appeared to be disks.  One was more aggresive than the other and they would glow a very bright blue/white(similar to those new headlights cars have nowadays) and a few times turned very red(just like a brake light).  Four other of my co-workers witnessed this as well.  About one hour later, another co-worker who moves our trucks for us(we work in a warehouse) saw the objects as well. I work nights and our shift takes lunch from 9:30 to 10pm.  When I saw these objects I waved a co-worker over to see them.  I also work near an airport, John Wayne, and remember thinking that those dots were planes.  But they were far to high in the sky and they seemed to be rising and hovering in the same area.  As stated before, they would glow extremely bright.  The \"dots\" looked more like a disk from time to time, mainly when the would glow brighter.  Seriously, I have no explanation what they could be.",
      "link": "http://www.nuforc.org/webreports/061/S61352.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b6fdf",
      "summary": "A circular object with bright blue lights floating near UC Irvine campus.  Object flew in a circle for 10 or so minutes.  Object then n",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "A circular object with bright blue lights floating near UC Irvine campus.  Object flew in a circle for 10 or so minutes.  Object then nose dived to a lower altitude.  Flew in circles for a little while longer at the lower altitude then dove out of sight.  The object seemed to have circular blue lights.  It seemed as if the lights were on the bottom.  When object was diving lights were a straight line.  Object moved fairly quickly but still appeared to follow normal propulsion physics.",
      "link": "http://www.nuforc.org/webreports/057/S57659.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6fb7",
      "summary": "Circular UFO with Blue lights seen near 405 S at Bake Pkwy exit.",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "Circular UFO with Blue lights seen near 405 S at Bake Pkwy exit. I was driving home from work tonight on the 405 south and as I was exiting the fwy at Bake Pkwy a blue light caught my eye.  I looked to my right and I saw a flat circular object with blue lights around it hovering over close to the fwy.  When I exited the fwy I pulled to the side of the road and watched it hover close to the fwy.  It looked as though it was spinning because it was wobblig.  It moved up, then down, then started to move North towards the Irvine Spectrum.  All of a sudden, the object dropped down like it fell from the sky then shot up into the air and disappeared.  I started to freak out becuase I knew what I saw so I stayed a minute to see if it would come back.  All of a sudden the object appeared to drop from the sky and was wobbling and moving in all different directions, I decided to drive the rest of the way home real fast to grab my video camera but by the time  I got back (10 minutes later) to see if I can catch a video of it, it was gone.  Whatever it was, was not from this world.  The lights were a silvery blue and were in a perfect circle.  The object was perfectly circular and extremely flat.  I will never forget what I saw.",
      "link": "http://www.nuforc.org/webreports/059/S59781.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b76f7",
      "summary": "Diamond shaped lights rose rapidly up in the sky, then moved left to right in a fluid, fast movement",
      "city": "irvine",
      "shape": "diamond",
      "date": "2006-12-07T00:00:00",
      "story": "Diamond shaped lights rose rapidly up in the sky, then moved left to right in a fluid, fast movement Exiting Irvine Center drive from the 405 freeway SOUTH, we were stopped at the light on the top of the overpass.  Glancing out the window to the southeast towards Laguna Hills We noticed 4 lights in a diamond arrangement rise from around 300' off the ground very rapidly to around 1000' off the ground in a matter of 2-3 seconds.  And in a continuous move, rock left to right very fluidly.  Our driver drove us out of view before we could observe more.  After discussing this with the other passengers, we all agreed that we could also observe searchlights in the sky around this object as it moved.   While not directly on the object, the searchlights were focused in the area around it.",
      "link": "http://www.nuforc.org/webreports/053/S53378.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b77b9",
      "summary": "Circular object seen in Irvine, CA",
      "city": "irvine",
      "shape": "oval",
      "date": "2007-10-08T00:00:00",
      "story": "Circular object seen in Irvine, CA There have been a number of Irvine, CA UFO reports all reporting the same object.  All other reports of this \"UFO\" have the similar characteristics.  Its basically a circular disk with blue lights on the the bottom.  It weaves around the sky in a circular manner and climbs and dives very quickly.  I saw this object near the UCI campus towards the south east.  This is the second time my girlfriend and I have seen this object.   My girlfriend and I are both well educated, and although we don't believe in \"UFO\"s in the alien sense of the word we do agree that this object is certainly unidentified.  I was able to take about 5 pictures as well as a 1 minute movie file with my low quality digital camera.  Please contact me by email, and I will send them to you.",
      "link": "http://www.nuforc.org/webreports/059/S59147.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b77c9",
      "summary": "White Lights in a large circle over UC Irvine, Campus.",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-04-27T00:00:00",
      "story": "White Lights in a large circle over UC Irvine, Campus. Driving home, to my right i saw a circlular shaped ring of lights, about 5-6 feet in diameter, with white lights around the entire circumference. They were a constant light, not blinking or anything. the object was about, 7 stories in the air (it was near a parking structure) and was hovering for a few seconds, then proceded to move towards my direction then away from me. For a few moments everything became very still, and quiet, my radio stopped working and for a slpit second everything became dark. The object then floated in a swaying mannor floating up towards the sky then disappered. It occured around 10pm, dark black sky, with no stars around and could not be mistaken for a plane or helecopter since there were no flashing/blinking or colored lights and was silent. It occoured near UC Irvine, near the corner of Bridge and Campus. I only obsereved one of them. Other people in their cars slowed down to view this amazing sighting, and people on the streets stopped dead in their tracks and pointed upwards. I feel different, i can explain how i do, but i do not feel how i did seconds before viewing this UFO.",
      "link": "http://www.nuforc.org/webreports/056/S56251.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b783e",
      "summary": "Circle of blue lights.  ((NUFORC Note:  Excellent report from an individual with engineering background.  PD))",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-04-27T00:00:00",
      "story": "Circle of blue lights On the evening of April 17, 2007 I went out onto my front yard for a smoke before bed.  It was about 9.55 p.m. PST.  My house faces NNE.  The planes approaching Orange County Airport approach my house from the NNE and go past North to my left to the NW to land at OC approximately 8-9 miles away.  Normally I can see the planes unaided and hear them as they descend. This night was overcast so I could hear some but not see them as they broke cloud cover once they had passed my house.  As I was standing on my driveway, I saw some blue light aloft to the North moving back and forth, almost flittering like a moth.  I initally thought it was a police helicopter.  This is a well populated suburb community and it's not unusual to see one of those things circling around.  What I thought was unusual was that it was moving more in a quick back and forth movement instead of what is usually seen as a slow circle.  Also, I could not see a strong search light or hear an engine sound.  It appeared that the object was 1-2 miles away.  I thought this was odd so I retrieved a pair of quality 20x binoculars that I keep hanging on a coat rack inside the front door.  What I saw raised the hair on the back of my neck.  These lights seemed to consist of a row of individual blue lights that first were traveling to the left.  As the object reversed direction, the object appeared to be first an ellipse and then a full circle that had maybe 24-30 individual blue lights around the perimeter.  It then traveled to the right and reversed the process again forming a circle at the end of its travel when reversing direction.  Its travel in each direction was maybe 3-5 seconds.  There were definitely no red/green port/starboard lights, only the blue perimeter lights and no strobe lights.  I watched this object for 2-3 minutes and I believe it was out there longer than that since I noticed it there soon after I initially stepped outside.  It finally disappeared into the cloud cover.  I waited a few minutes to see if it would come back but it was gone.  I don't have a working video camera and probably would not have had time to get it if I had.  I don't really want my name associated with this.  I'm a 55 year old engineer and I've never really believed that something like this could not be identified, but I have never seen anything like this.  I used to fly small aircraft so I have some experience with the shapes and types of various small planes.  BTW, the only thing I drank that night was a cup of tea and a glass of Metamucil so I was completely aware of what was happening.  If you would like to contact me, please respond to my e-mail address.  If you would like to speak to me, let me know and I'll call you, or respond to you with a phone number to reach me.  What I would find crazy about this is if no one else saw it.  As said, although the community is quiet and most people are in bed or in home at that hour, there are enough people around here that someone else should have seen this to collaborate.  If you would to contact be, do so at the e-mail listed in witness information. ((NUFORC Note:  We would welcome reports from others who may have been witness to this object.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56283.html",
      "state": "CA",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3b79ae",
      "summary": "close encounters looking and very close it hovered and moved in abnormal directions.",
      "city": "irvine",
      "shape": "disk",
      "date": "2007-03-08T00:00:00",
      "story": "close encounters looking and very close it hovered and moved in abnormal directions. My husband a I were driving down Irvine Bvld. at 9:50 pm and made a right on jefferey.  Thats when we saw it at around 30 to 50 above our car.It was a disc/saucer thing with lights that moved around the outer edege and it whizzed past us without a sound.We pulled over as well as others to see whats was going on.It hovered over a field moving side to side making a low humming vibrarion.At this point it was maybe 3 to 400 feet away,it then turned vertically and shot toward the sky.then once again  went horzontal and started moving in a triangle formation . at that point my husband who I might mention is a commerical pilot said maybe we should call someone.All of a sudden this thing dropped like a falling star towards the earth and stopped within feet of the ground, hovered still vertical,and then righted itself and started moving side to side once again.we thought it was maybe kids playing a prank but now having thought about it more we are not sure what happened that night on a dark road.",
      "link": "http://www.nuforc.org/webreports/055/S55473.html",
      "state": "CA",
      "duration": "20+ min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a31",
      "summary": "A Circular object with bright green lights hovering over near UC Irvine campus.",
      "city": "irvine",
      "shape": "circle",
      "date": "2007-06-12T00:00:00",
      "story": "A Circular object with bright green lights hovering over near UC Irvine campus. It was on Sunday night around 10:30 PM. I was sitting on the couch and watching TV in my apartment. I noticed something unusual hovering outside. I looked over the window and I saw a circular or oval shape object with small green or blue lights around it. Then I asked my roommate to come over to the window and she also saw it. The flying object was floating without any noise and making circular motion. It was moving slowly toward northeast direction.",
      "link": "http://www.nuforc.org/webreports/057/S57041.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ddf",
      "summary": "A light in the night sky that wobbled, changed direction and zoomed off at an astonishing rate of speed",
      "city": "irvine",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "A light in the night sky that wobbled, changed direction and zoomed off at an astonishing rate of speed I was sitting in my backyard sipping a soda pop on a reclining chair with my head facing the sky.  I was looking at the stars and suddenly noticed a yellowish light which appeared to be heading down toward earth because as it moved it grew slightly larger.  My first thought was that it was a shooting star. It had no flashing beacon or tail.   As soon as the thought occurred about the shooting star, the light seemed to hesitate for a split second and wobble slightly.  It suddenly and I mean SUDDENLY changed course about 30 degrees and headed due west toward Los Angeles at an astonishing high rate of speed. I tried to follow it and dropped my soda can in the process but it I lost it behind a palm tree. It was just going too fast to follow.  Of course I do not know what it was, but I do know that it wasn't a shooting star because it changed direction. It wasn't an airplane or helicopter because there was no flashing beacon. It was not a satellite because it was going too fast and changed direction.  Commercial airlines fly over my house on a regular basis.  They fly over at about 10,000 feet altitude.  These jets are traveling about 300 to 400 miles per hour. If the light that I saw was at this same altitude, it was traveling easily in excess of 10,000 miles per hour.",
      "link": "http://www.nuforc.org/webreports/065/S65091.html",
      "state": "CA",
      "duration": "about 6 or 7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8513",
      "summary": "Disc hovering at a southernmost tilt west of NB I-405 at Irvine Medows CA",
      "city": "irvine",
      "shape": "disk",
      "date": "2009-03-19T00:00:00",
      "story": "Disc hovering at a southernmost tilt west of NB I-405 at Irvine Medows CA My wife and I were traveling north on I-405 - approx midday.  Before Culver exit, I glanced to the west and briefly saw a nearby tilted disc hovering directly over the northern part of Irvine's Preservation Area. Disc appeared reasonably large - maybe 40 feet in length, but viewing perspective made it appear very thin. The disc appeared to be very 'real' and solid in nature; I did not see any form of glowing or radiation of bright color. Object was gray/brown - I believe. It was hovering and completely/effortlessly static. Notably, it was tilting distinctly to its southernmost side. I viewed the object from the freeway, but could not alert my wife's attention to it quickly enough before a freeway bridge and trees obscured it from my view. I pulled off the Culver exit and drove west over the freeway to attempt a better view, feeling sure that we would be able to view something explainable, but the object was no longer visible. I often question if I had actually seen the object, but cannot account for how I could imagine the length, flatness and angular titling of the disc if I had indeed been confused or subject to some kind of illusion. Date and precise time are approximate, since I could not substantiate the sighting with other witnesses and questioned the 'reality' of it. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68723.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b893c",
      "summary": "Fireball with tail of sparks over Orange County skies",
      "city": "irvine",
      "shape": "fireball",
      "date": "2009-03-19T00:00:00",
      "story": "Fireball with tail of sparks over Orange County skies I was merging onto the 5 freeway north when I saw (very clearly as the light was still out) a light in the sky. It looked like something entering the atmosphere as it seemed to be traveling much slower than a shooting star you might see at night. It had a tail of what appeared to be sparks. I am sure lots of people on the freeway saw it but I can't find anything about it online. It appeared for only a couple of seconds before disappearing in a north east direction. Here is a google maps link of where I was and the direction I was facing when it happened:  http://maps.google.com/maps?f=q&source=s_q&hl=en&geocode=&q=irvine+transportation+center&sll=37.0625,-95.677068&sspn=38.638819,78.837891&ie=UTF8&ll=33.670443,-117.754984&spn=0,359.972599&z=16&layer=c&cbll=33.670634,-117.755051&panoid=W8YhBR5WwkXRCOxFgaPvhw&cbp=12,346.4568740764644,,0,-10.251370399373544",
      "link": "http://www.nuforc.org/webreports/068/S68138.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9531",
      "summary": "3 diamond shaped light configurations in the northwest corner of the sky towards Newport Beach, CA",
      "city": "irvine",
      "shape": "diamond",
      "date": "2009-03-19T00:00:00",
      "story": "I was walking out of my Irvine CA apartment, which is on the third floor, on my way to meet a friend for dinner around 8:15 pm.  I immediately noticed 3 diamond shaped light configurations in the northwest corner of the sky towards Newport Beach, CA.  I of course stopped and just stared.  They were moving very fluidly, counter clockwise and then clock wise, back forth with no apparent set pattern- like kites would do.  The lights were a very bright light blue. They would go completely off and them come back on.   I couldn't make out exactly what type of craft they were on.  I watched for about a minute and then two of them disappeared and just one remained.  I saw it go behind a cloud and then reappear...so they had to be at least at cloud level.  They were quite high in the sky because I was seeing them way over trees and building tops.  I knew immediately that what I was seeing just by the shear movement of them was not an airplane, helicopter or military craft.  I was already running quite late so I got in the car and headed to meet my friend, while I was driving I tried to hang my head out the window to see the remaining object.  I wound up right under it when I got to the intersection and could make out a faint outline of some sort of a craft that looked grayish.  I was a little worried at that point, realizing I was right under it.  Then the traffic light turned and it was above my car so I could no longer see it.  I called two friends and tried to get them to go outside and se if they could see it as well, but didn't reach them in time.  Southern California is a big place with a huge population and I'm quite sure lots of other people had to see this as well.  The whole experience left me in awe and made me feel quite small….there’s a big “world” out there obviously and I doubt we here on earth are much more than a speck.",
      "link": "http://www.nuforc.org/webreports/068/S68681.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b96da",
      "summary": "3 crafts hovering in Irvine,Ca close to the 405 freeway for about 10mins.",
      "city": "irvine",
      "shape": "unknown",
      "date": "2010-04-13T00:00:00",
      "story": "3 crafts hovering in Irvine,Ca close to the 405 freeway for about 10mins. 3 crafts were hovering in Irvine over the mountain next to the 405 freeway at 4.40pm on wednesday,March 17th,2010.  1 of the crafts was a little more active then the other 2.  They were about to leave and started traveling back over the mountain slowly and in a blink second they made a mad dash in the opposite direction towards the freeway.  They slowed down again and were hovering for a few minutes.  We were traveling on the freeway and as a  freeway overhead blocked our view for a few seconds they were gone after that.  It was a pretty cool experience :)",
      "link": "http://www.nuforc.org/webreports/074/S74699.html",
      "state": "CA",
      "duration": "0010"
    },
    {
      "_id": "64d005f478aba2ec5a3b9acf",
      "summary": "circular distorted shape   please look!",
      "city": "irvine",
      "shape": "circle",
      "date": "2010-06-23T00:00:00",
      "story": "circular distorted shape   please look! I was scrolling through google maps in the area of saddleback mountains, orange county california for a bike trail.  I was following the trail on my screen when what i thought i saw was first a triangle,  It was very eiry feeling   even thinking of what i saw is giving goose bumps.   After scolling in as far as i could i could tell that the image was circulare and distorting the satellite imagery.  I have looked at thousands of mile of map and have never seen this before.  AND the image is still there!   i took a screen shot just incase SOME ELSE finds this. I ride mountain bike all over the clevleand national forest. I am also a student in Networking and Communcation with a proud 3.7 gpa ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75792.html",
      "state": "CA",
      "duration": "current"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e48",
      "summary": "Extended Duration of UFO Sighting  ((NUFORC Note:  Sighting caused by model airplane.  PD))",
      "city": "irvine",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "Extended Duration of UFO Sighting ((NUFORC Note:  We are grateful to the witness for the report, and we commend him for his having been able to determine what the cause of the sighting was.  Please see below.  PD)) From 9:46PM until 10:22PM, 2 unidentified objects were witness by myself seemingly \"dancing\" in the cloud covered night skies.  These 2 objects were circular, with lights ringing the outside perimeter of their circumference.  Their movement was eratic, ranging from hovering, to then quickly darting about while flipping and rotating. As the objects flipped in abrupt directional changes, the top of the disk appeared to be a dark metallic.  The lights surrounding the craft would ocassionally flash brightly.  It appeared as if the objects were ringed with 8 white lights, and 1 larger red one; which by watching the movements of the objects, would indicate being the 'front'. The objects were visible this entire time just barely under the low slung clouds.  They would dart in and out of the cloud cover, and then stay for extended periods below the clouds.  It appeared that their relative distance from the observers did not change that much, only altitude. Photos will be forthcoming. Observers were:  Myself:  Corporate President My Girlfriend:  Mathematics Teacher  (Irvine High School) Neighbor:  Custom Home Developer Neighbors Wife 2 Visiting Relatives of Neigbors 1 Other new neighbor, apprx 25 yrs of age, name and occupation unknown ((ADDENDUM FROM WITNESS)) Apparently, this report is in all likelihood a false alarm.  I called the Irvine Police Dept and they stated that there is a local resident that conducts experiments from time to time that have in the past generated similar reports of UFO's.  They continued to state that he normally reports in first, before conducting these experiments, but that tonight he did not.  However, the are reasonably certain that this is probably the source of our observations. Given the late hour, I will not press my neighbors to compile the photos and video tonight, however, will retain the information awaiting you verification of this mundane event.  If for any reason this was not what actually happened, all materials will be available for you. Thanks!",
      "link": "http://www.nuforc.org/webreports/066/S66156.html",
      "state": "CA",
      "duration": "00:45"
    },
    {
      "_id": "64d005f478aba2ec5a3bafb3",
      "summary": "two small red lights going across the skay and never faiding.",
      "city": "irvine",
      "shape": "unknown",
      "date": "2011-03-10T00:00:00",
      "story": "two small red lights going across the skay and never faiding. I was at home and my husband is a non believer, he went to take out the trash and called me to look out the window... when I did there was 2 red lights very far away to the south.  No!  NOT fireworks... they we're moving very fast one in the front was in a straight line and the one right in back was, what seemed to be bouncing up and down behind it.  My husband saw them because he noticed my neighbor looking up with his mouth open.  When my husband saw what the guy was looking at, he called me... he was in awe!  The lights went accross the sky, never faiding and they would take turns going straight and bouncing up and down.  I tried to get my video camara, but the image was never captured.  The 2 red lights were too far away for my low pixal in my cam to capture anything. Not sure what they were... but it was not normal, that much I can say.",
      "link": "http://www.nuforc.org/webreports/080/S80327.html",
      "state": "CA",
      "duration": "20:45"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2d5",
      "summary": "By the reaction of the other drivers who were slowing down in front of me on the 405 freeway in Irvine Ca. I knew I couldnt be the only",
      "city": "irvine",
      "shape": "other",
      "date": "2011-03-10T00:00:00",
      "story": "By the reaction of the other drivers who were slowing down in front of me on the 405 freeway in Irvine Ca.  I knew I couldnt be the only one who thought this was strange and unusual.  It was im guessing motionless about 200 or 250 feet in the air.  As I approached it I noticed the three white lights and just thought it was a plane patrolling the freeways.  But as I got closer it became clear this was no plane nor was it a blimp due to its shape which was honestly dark and was only viewable due to some overcast skies reflecting the city lights behind it.  To me it looked like a soccer ball shape with 4 courners that seemed to flare  By this time im now very close to it and can see 3 more new lights that were red and staggerd between the first lights I seen from the front.  Passing it at well below the 65mph speed limit along with everyone else Im trying to make out what im looking at.  But I couldnt. It was just yards away on the oppisite side of the freeway so im lo! oking out my driver window stumped and somewhat suprised it was just sitting there.  I would argue til the end of time that it was not a blimp. Ive seen plenty of them to know this was much smaller and not elongated.and it was not a helicopter as it made no sound and was definately not equipped with rotors.  Oh and it wasnt a weather balloon or flares. Its something else and I just wanted to share what I saw in the sky last night.  Peace.  ((name deleted))",
      "link": "http://www.nuforc.org/webreports/080/S80304.html",
      "state": "CA",
      "duration": "1 or 2 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bb98e",
      "summary": "Golden Ball in SKy",
      "city": "irvine",
      "shape": "circle",
      "date": "2010-07-10T00:00:00",
      "story": "Golden Ball in SKy At your prompting on Coast to Coast this evening, I will report what I saw.   I was in Irvine, CA, visiting my sister and brother-in-law.  We were having a lovely evening and playing cards and had not decided to go watch fireworks.  When the fireworks began, we decided to take a break and hustled so we would be able to see them. I was in the back seat of the car and looking out what I believe to be toward the northwest.  I saw a golden globe hovering in the sky, not very high but not low either, like the height of fireworks.  I asked if the fireworks were over that way.  They were not in that direction but in the opposite direction. I looked and saw it again.  I mentioned to them that I think I was seeing a UFO but since it was 4th of July, I chalked it up to possible fireworks.  I did mention it again on the way home it had left an impression. It was gold, not bright gold but pale yet had a definite brightness that seemed to be contained in some way.  I had some sense that it may have been spinning.  I felt it had some purpose and that it was doing something. It continued to be on the back of my mind throughout the evening.",
      "link": "http://www.nuforc.org/webreports/076/S76212.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc092",
      "summary": "Triangle, Diamond shaped star that moves in different directions, 3 spikes coming out one side with retracting line of lights.",
      "city": "irvine",
      "shape": "other",
      "date": "2012-01-12T00:00:00",
      "story": "Triangle, Diamond shaped star that moves in different directions, 3 spikes coming out one side with retracting line of lights. I have watched this \"thing\" move in all directions, stop, move again. I called my friends (2) people and they both are watching. The shape is a mix of traingle and diamond (it is very high) it looks like it has 3 spikes coming off a side. There seems to be some type of strand of light that retracts, it goes out and back in from what seems to be the back side. It has lights that flash every 20 seconds or so on all sides at different times. Whaite, Red & Blue. The whole \"thing\" is lit like a star. I cannot determine shape. At first I thought it was a satellite but satellites don't move like this. It has gone in all different directions. Slowly and VERY quickly, to complete stop. I feel crazy but I have NEVER seen something like this before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86001.html",
      "state": "CA",
      "duration": "10 min (still there)"
    },
    {
      "_id": "64d005f478aba2ec5a3bc11b",
      "summary": "Irvine CA, 8:05 PM Dec. 24 2011. V Shaped light formation 4 lights on each side which pulsated extreamly bright white.",
      "city": "irvine",
      "shape": "triangle",
      "date": "2012-01-12T00:00:00",
      "story": "Irvine CA, 8:05 PM Dec. 24 2011. V Shaped light formation 4 lights on each side which pulsated extreamly bright white. Eight very bright lights in a triangle (4 light in each side creating a V).  LIghts were VERY bright white and they pulsated in a methodical way like a heart beat.  Moving slowly and very low in the sky. Arched towards the ocean and continued to gain speed at a gradual pace and disappeared.  Unusually clear for Orange County.  And when I stopped my and got out to look at the lights all the neighborhood dogs were barking.  Barking stopped about 4 min after the UFO was out of sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86060.html",
      "state": "CA",
      "duration": "3-5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd132",
      "summary": "Near 10:30pm, silent, triangular UFO, deep orange lights, white beam, flies slow about 10,000 ft; disappeared by vertical ascent.",
      "city": "irvine",
      "shape": "triangle",
      "date": "2012-08-05T00:00:00",
      "story": "Near 10:30pm, silent, triangular UFO, deep orange lights, white beam, flies slow about 10,000 ft; disappeared by vertical ascent. (July 3, 2012 in Irvine, CA)  My husband and I were walking the dogs around 10:30pm, when I looked up at the stars, and noticed a triangular object high in the sky. It was gliding slowly, in a straight line, making no sound – flying in from the coast.  The bottom of the object had three large deep orange lights, spaced close together and non-blinking.  In the center of these lights was a wide beam of bright blue-white light (shaped like an inverted ice-cream cone), pointing toward ground.  After the radiant object turned off the cone-shaped beam, it continued to fly in the same straight line.  Then it stopped and hovered overhead a few seconds before ascending vertically into space.  My husband is a private pilot and estimates the object flew near 10,000 ft.  He is confident it was not a helicopter with a searchlight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90659.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd2e3",
      "summary": "Hi speed orange ball, not meteor.",
      "city": "irvine",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Hi speed orange ball, not meteor. Peter,  Just heard you on C2C with George. Approximately 2 hours ago i saw a bright orange ball and streak moving at a very high speed in Orange County CA. I was traveling South on Laguna Canyon Road which runs in a general north south direction. The orange streak was moving close to my direction, about SSE, perhaps 190 to 200 degrees on the compass. It was notable for several reasons. It was moving extremely fast. It was almost a pumpkin orange, not at all like the burst of light from a meteor. Appeared to be low, maybe several hundred yards above me, although this is my best guess, have no way to quantify that altitude. Sincerely,",
      "link": "http://www.nuforc.org/webreports/093/S93175.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd53f",
      "summary": "Dot of light making imposable turn",
      "city": "irvine",
      "shape": "sphere",
      "date": "2012-07-04T00:00:00",
      "story": "Dot of light making imposable turn When I was 16 I was star gazing and I saw a light that I thought was a plane or satellite.  While I was watching it made a perfect 90 degree turn with out losing speed or using and arc.  It was a white’ish light. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89871.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd674",
      "summary": "6 extremely bright lights, surrounding a dark bodied craft, moving very slowly",
      "city": "irvine",
      "shape": "cylinder",
      "date": "2012-09-24T00:00:00",
      "story": "6 extremely bright lights, surrounding a dark bodied craft, moving very slowly September 3rd, 2012. Irvine, California. (about 40 miles south of Los Angeles)  Approximately 4:45 pm, warm clear day, bright sunlight, sun was a bit off to the west, and there was no clouds. It is the afternoon, the sun is arcing towards the west, but still quite high in the summer afternoon. I’ll try to present the experience without interpretation first, just as you would experience it, then save my interpretations for the end. While doing the backstroke in my pool, I was looking up at the clear, bright blue sky. There were a few birds, and occasional passing airplanes in the sky. Nearly directly overhead, (just very slightly to the east, but still very substantially overhead), I saw a VERY bright light, fairly large, (compared to the apparent size of commercial aircraft at cruising altitude) or possibly a tight group of lights. It looked very, very bright, like the brightest of stars, only this was visible in the daytime. It also looked quite a bit bigger than any star you see at night. I only mention the word “star” here, to give at least some idea to the reader, as to what caught my eye. It looked stationary. That seemed odd to me, because all aircraft I know of have some motion. I wasn’t quite sure if it was moving or not, so I swam over to the edge of the pool, stood stationary myself, and placed the edge of the roof of my house in my sightline to the object, so as to better determine if it wa! s moving. Comparing it to the tiles of my roof, I could see that it was moving, but VERY slowly. There was no trail, and the lights stayed a brilliant white color. After a couple of minutes, I was so curious about it’s apparent odd size, extreme brightness, and lack of velocity, that I went inside (dripping wet!), and got my Tasco 10x-40x63 zoom binoculars. I tried to look at the object freehand without steadying the binoculars, but the image was too jerky. I tried using a table first, then a chair, but it was still too shaky. I found that the best way was to lie on the pool deck, and look almost straight up. Once I got situated, I again used the “zip focus” center wheel, and focused on the object first without any zoom at all, (no zoom gives a wider field of view, and makes it easier to initially locate an object in the sky). I could clearly see that it was not a single point of light, but rather, a dark tubular craft of some sort, with several extremely bright lights clos! e around it. It looked to be about 6 lights. I initially thoug! ht I was looking at a satellite, with solar panels reflecting the bright sunshine, and I wasn’t alarmed at all. If I tried zooming in all the way, it would get blurry, so I couldn’t zoom all the way. I could only zoom in about 2/3rd of maximum zoom, without it going out of focus. Even though my arms were fairly supported, the image was still somewhat shaky. I kept trying to brace myself better, to get a clear, more stationary image. At times, when I could hold steady, I was able to see the object fairly clearly, or as clear as possible. The lights were so extremely bright, that it made it hard to see the dark body of the craft. As best as I could make out, the body was a long, dark, and seemed to connect to the lights around it.  It looked as if a parking lot light standard had drifted up into the sky, with about 6 lights, connected by a dark body. During this time, the object was slowly but steadily moving across the sky, towards the east.  I got my wife and daughter to come outside and check it out. My wife tried looking through the binoculars, but was unable to locate it through the eyepieces. She’s unfamiliar with using them, and hard to teach. By this time, it had traversed from being directly overhead, (“0” degrees) to about 75 degrees, down towards the neighboring houses’ roofline. It was getting smaller, and farther away as time went by. I had already seen the best view of it that I was ever going to get, so I gave up following it across the sky, and went inside and searched the internet for coo-berating sightings. There are no coo-berating sightings so far. I called the Irvine Police Department, but they had no reports at all, even in a city of over 250,000. Nasa’s website did have a projected orbit path of the International Space Station, that showed it crossing southern California about 5 pm.  Interpretations-  At first, I thought it was a commercial jet aircraft, maybe at 35,000 to 40,000 feet. As we know, even though they may be doing over 500 mph, they appear to move very slowly across the sky, because their great height makes it hard to gauge their velocity. But this object wasn’t even moving fast enough to fit that model. It was either moving much slower than that, or it was “orbiting” at a much greater altitude. From the time I first sighted the object directly overhead, until the time I quit tracking it, it made about a 75 degree arc across the sky. A commercial jet aircraft, at typical altitude and cruising speed, would not take the 9 minutes or so that this object took to traverse that arc, and was visible for. A commercial jet does not fit this model for that, and others reasons, below. Sometimes, a shiny aluminum jet, especially like those used by American Airlines, can turn just right, and if the surfaces are angled right, you can catch a glint of the sun, making the aircraft appear very bright in the sky, even on a bright, sunny day. Only this craft had no typical wings, like you can see on 747s and the like, even at their typical cruising altitudes.  And, this craft was much, much brighter than that. I thought the lights were possibly solar panels, which may reflect the sunlight much better than shiny aluminum.  This object was VERY bright. Just like a star, but you don’t see stars on bright sunny days. And there were several points of light around the dark bodied craft, so a star doesn’t fit the model.  Living close to several airports, I am familiar with what a commercial aircraft looks like, flying at typical 35k-40k feet, 500+ mph. The observed velocity, brightness, apparent altitude, did not fit this model.  The International Space Station was actually my first guess. There are some aspects of the sighting that are congruous with the ISS. These are- A central body, and solar panels surrounding, that may reflect sunlight, and this object seemed to be following an orbit of sorts. And there are aspects of this sighting that are not congruous with the ISS, (and space junk, + dying satellites, for that matter) First off, in my internet investigation, I learned that satellites need to orbit at 17,500 miles per hour to fight gravity, and stay in orbit. This speed generates centrifugal force that combats gravity. If they slow down, their orbit decays. They also orbit at least 60 miles up, above most of the artmosphere. Some orbit at 100 miles up, or 400, or 1200 miles altitude. No satellites orbit within ten miles of the earth, because the atmosphere would burn them up at 17,500 mph, and the atmosphere would slow them down. As a decaying satellite orbit hits the atmosphere at 17,500 mph! , they get hot, and burn up on re-entry. In contrast, this sighting of mine was of an object moving excruciatingly slowly. This fact is completely inconsistent with space junk, the ISS, falling satellites, communications satellites, spy satellites, and it is also inconsistent with geo-synchronous satellites, that are in geo-synchronous orbit.  In fact, all satellites, regardless of whether they are geo-synchronous, or orbiting at 17,500 mph, are completely inconsistent with this sighting. This is because satellites orbit above the atmosphere, and are not visible in the daytime. When the sun lights up the atmosphere, you can’t see the light of stars, nor man-made orbiting satellites. The atmosphere is too bright to allow any viewing of objects like satellites, that orbit 60 miles up, or 400 miles up, and more. The first 10 miles of atmosphere are the thickest, and if you are going to see anything flying with the naked eye, or binoculars, it isn’t going to be outside the first ten miles of atmosphere. The only reason you can see the moon sometimes in the daytime, is because it is so extremely huge, that it allows your eye to perceive its’ presence. It is true, that if you know exactly where to look, you may see an “iridium flare” even in the daytime, where the light of the sun is briefly reflected towards your location, from a passing satellite. This is an extremely brief flash, (and a rather dim one at that), as it is moving at 17,500 mph. This fact is totally inconsistent with my sighting, that lasted about 9 minutes, and was extremely bright. An iridium flare is only visible for the time that the solar panels are angled so as to reflect the sun back to your eye. Because they are moving so fast, and because they don’t rotate to keep the sun focused on you, they only make a very brief, small, dim dash of light. Check ‘em out on YouTube. They aren’t much to look at, and are completely inconsistent with what I saw, which was an extremely bright, and continuous  cluster of lights, that moved extremely slowly, had a dark body, and took about 9 minutes to traverse a 75 degree arc across the sky.  On YouTube, you can see videos of the ISS passing overhead at nighttime. It streaks across the sky very rapidly. Not as fast as a “shooting star”, but much much faster than what I saw. The ISS also appears fairly dim. Somewhat like a small star. Even through my binoculars, the ISS would still look like a dot of light, and you wouldn’t be able to see the degree of detail that I saw, not at all. What else could have a dark body, be surrounded with about 6 lights so bright, they rivaled the sun, make absolutely no noise, stay at the same brightness for 9 minutes, and take 9 minutes to traverse 75 degrees across the sky? Helicopters could arc across the sky like that, but they make a ton of noise, and this didn’t look anything like a helicopter at all, (nor a Harrier jump-jet, or even a group of weather balloons, nor a blimp) Even if you could attach lights as bright as stars on any of those crafts, they still wouldn’t look like what I saw. A group of balloons would not reflect the sun like what I saw. This object had lights so bright, they were like small suns in themselves. The reflection of the sun off of satellite solar panels is the closest earth-borne analogy to the brightness of light that I witnessed. But as stated earlier, satellites are completely incongruous because of altitude and speed, and the fact that you can’t see them in the daytime. But the sun/sola! r panel possibility is closest to explaining the brightness and sheer quantity of light emanating from this craft.  Like I said, it looked like (closest analogy possible coming up right here), a parking lot light standard, (minus the pole, just the light cluster), that floats within the visible atmosphere, with no apparent means of motion, and a dark, central body.  So to wrap up, my sighting is inconsistent with the ISS, space junk, any known satellites, balloons, Harriers, commercial aircraft…I can’t think of anything made by mankind that fits all the criteria. It is definitely an unidentified flying object. Any ideas?",
      "link": "http://www.nuforc.org/webreports/093/S93032.html",
      "state": "CA",
      "duration": "about 9 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6c2",
      "summary": "Two yellow spheres rotating about each other (barrel rolls) moving right to left and vanishing.",
      "city": "irvine",
      "shape": "sphere",
      "date": "2012-07-04T00:00:00",
      "story": "Two yellow spheres rotating about each other (barrel rolls) moving right to left and vanishing. I am writing this report because what I saw needs to be documented.  I have recounted the event to several people in casual setting without any sufficient explanation. I was unaware of such a place that I could record what I saw, that’s why I have never formally submitted what I saw. In 2007 I lived in Southern California in a town called Irvine. It’s a crowded city with lots of modern city development and is a “well off” expensive place to live. I was separated from my significant other and spent a lot of time waiting to pick up my daughter from her mother’s house so I would hang around different places until we could meet for me to pick her up. It was while waiting for my daughter one evening at a local park that I saw this UFO. Irvine has a park called “Colonel Bill Barber” park that is very well kept and has beautiful walking paths, tennis courts, and softball fields and playgrounds. I was walking between 9:00 and 10: PM at night in the summer time at a location on the walking path that was elevated 30 feet above the rest of the park. The walking path comes to a memorial on a hill where commemorative placards and a U.S. flag are displayed. From this point you can look out over the north side of the park with tennis courts to the right. The hill was not so high as to be able to see over the privacy netting of the tennis courts. While standing on this hill and facing north my attention was drawn to something out of the corner of my right eye. This area is well lit with amber colored lights on the parking lot and bright lights on the tennis courts. Some distance south of the tennis courts but within the boundary of the park two yellow orbs rotating in a counter clock wise rotation (as on the face of a clock) caught my eye. I stared at them in amazement and disbelief. They rotated keeping seemingly equal spacing from each other and constant rotational speed as these two yellow orbs moved from my right to left across in front and just above where I was standing. They gradually accelerated from the point where I first noticed them to the point just in front and to the left of me where they began to climb in altitude and vanish. The total distance the orbs traveled while I could see them was around 300ft and less than 100ft off the ground. I was feeling like I had just witnessed two spirits at play maybe! fascinated with the movements of the tennis ball at night? The orbs were moving with machine like precision so I also wondered if I had witnessed some type of energy from an engine source on some type of space craft. I also tried to reason if I was hallucinating?  There was no sound that I could remember other than the sound of tennis racquets striking tennis balls and the noise of cars and traffic on the nearby roads. I believe in extra terrestrial life. What I saw was unlike anything I have ever heard anyone describe except for sightings of colored orbs that have random movements.",
      "link": "http://www.nuforc.org/webreports/090/S90126.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7e2",
      "summary": "My employees got me out and looked on the west in the sky there were 9 shining UFO moved from west to east with a zoom speed. It looked",
      "city": "irvine",
      "shape": "disk",
      "date": "2012-05-13T00:00:00",
      "story": "My employees got me out and looked on the west in the sky there were 9 shining UFO moved from west to east with a zoom speed.  It looked like they played with each other in the air and disappeared in the sky.",
      "link": "http://www.nuforc.org/webreports/087/S87842.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1b8",
      "summary": "Bright shiny object-looked like a shiny fish in water-but changed shape quickly, then vanished",
      "city": "irvine",
      "shape": "changing",
      "date": "2013-05-15T00:00:00",
      "story": "Bright shiny object-looked like a shiny fish in water-but changed shape quickly, then vanished I just got out of church and was looking at the beautiful partly cloudy sky enjoying the breeze while talking to friends, when I noticed at first what looked like a reflecting light in the sky, which looked comparable to a silver fish in water.  It was shiny and shaped like a football. From the distance I was at, it looked about 1 mile away.  Within about 1-2 seconds it changed shape and started to shrink down to a small black object.  It disapeared in about 8 seconds total time. It seemed to be traveling west and straight.  It seemed to be moving fast as well.  Small planes do not change in shape from a bright reflection round shape to a tiny black object in 8 seconds and dissapear. It was moving fast, then vinished quickly. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96856.html",
      "state": "CA",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf923",
      "summary": "White object moving from left to right and took off quickly.",
      "city": "irvine",
      "shape": "unknown",
      "date": "2013-02-04T00:00:00",
      "story": "White object moving from left to right and took off quickly. It moved zig zag before disappeared.",
      "link": "http://www.nuforc.org/webreports/095/S95610.html",
      "state": "CA",
      "duration": "30 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb33",
      "summary": "Continuous shrieking sound.",
      "city": "irvine",
      "shape": "unknown",
      "date": "2013-07-22T00:00:00",
      "story": "Around 3:00 am on 04/29/13, I was abruptly awakened by an incredibly loud shrieking noise. It was continuous and never changed tones or pitches.  It was so loud that the instant I was awakened, I covered my ears.  I had a hard time even moving because it was so loud.  I did not open my eyes.   This loud noise continued for about 1-2 minutes straight.  I feel like I saw a flash of bright light, maybe white or yellow in color right as the noise began; however I cannot confirm the color as I did not open my eyes.   Then it sounded like whatever was creating the noise drove/flew/etc away but still making the continuous shrieking sound but it got fainter and fainter as it went further and further away.   My bedroom is on the 3rd floor of my condo and my bed is positioned exactly the same height as the window.  My head is right in front of the window.  I always keep my window opened.  The sound that I heard felt like it was literally right outside of my window.   I have a house ! and fire alarm; however this sound was not either of those.  It was a sound I have never heard before and still have not heard since then.  I don’t remember anything past this point but woke up the next morning with a very strange almost nauseating feeling.   The next morning, I asked my sisters if they heard that loud shrieking noise and they both said “no”.  I don’t know what it was but it was the most unusual and strange feeling and sound I have ever experienced.",
      "link": "http://www.nuforc.org/webreports/100/S100356.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe02",
      "summary": "11 cylinder shaped aircraft with very bright blue lights",
      "city": "irvine",
      "shape": "sphere",
      "date": "2013-07-22T00:00:00",
      "story": "11 cylinder shaped aircraft with very bright blue lights I was looking at the stars at night on my balcony when suddenly 11 of the stars started moving at impossibly fast speeds.  They were very bright.  The light was dark blue.   I noticed that they were a sphere shape.  They also had produced a beam sound.   I tried video taping it with my phone but for some reason my camera was malfunctioning.   After the event my phone battery went from 80% to 4%.   The entities disappeared into thin air.   When I started filming the ufos made very sharp turns and disappeared.",
      "link": "http://www.nuforc.org/webreports/100/S100189.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c03d1",
      "summary": "UFO sighting, 2 objects, May 11, 2013 approximately 10:30pm, Irvine, CA",
      "city": "irvine",
      "shape": "oval",
      "date": "2013-05-15T00:00:00",
      "story": "UFO sighting, 2 objects, May 11, 2013, approximately 10:30pm, Irvine, CA I spotted two very distinct objects in the night sky over Irvine, CA while looking eastward from my northeast-facing bedroom window. Unfortunately, I did not have any camera equipment or binoculars available.  I could not see the shape of the craft, but the lights appeared to be large (but different sizes), different colors of red, white, and yellow. There were approximately 5 to 8 different lights on each object.  The red light appeared to be the largest, but there were more of the yellow lights surrounding it.  I could not say for certain if the lights were flickering, but they did not appear to blink or pulse.   The lights formed an oval shape.  Both of the objects appeared identical to me.  They appeared at first to be very small objects, at least a few miles to the East, traveling steadily West (towards my location).  I can only estimate speed to be somewhat faster than a helicopter, but slower than a commercial jet.   The entire sighting was probably a full 15 minutes as the obj! ects approached my location before their ascent and disappearance.  There seemed to be a noticeable increase in speed as the objects ascended, but I can't really say for sure.  I did not hear any noise from the objects.  Everything was very quiet.  The objects followed a very similar (perhaps identical) westward flight path just a little beyond my location (about 8 miles from the Orange County airport) at an estimated altitude between 20,000 to 25,000 feet, and then ascending so high that the bright colored lights completely disappeared into the night sky. I feel confident that the objects ascended because they were getting smaller and smaller until I could no longer see them.  And I also feel confident that the objects would have needed to be higher than 35,000 feet to completely disappear because commercial aviation lights are still visible with my own eyes (at night while traveling at typical, long distance cruising altitudes).",
      "link": "http://www.nuforc.org/webreports/097/S97750.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a76",
      "summary": "((HOAX??))  They are here.",
      "city": "irvine",
      "shape": "",
      "date": "2013-12-02T00:00:00",
      "story": "They are here. From www... \"There is a friend of mine that started two companies ((deleted)) and ((deleted)), Corp.  I believe they are based in CA.  I personally saw them working on a similar phone and other devices.  They were actually at the stage of testing them in his garage over a year ago!  The device they played with looked thiner and there where no pins or screws also the materials they used looked something like from SPACE - light as plastic but had the look and feel of metal - when put together was similar to.........  Interestingly I couldn't see any openings on the components (like for mic or speakers)  As far as I know they came up with some sort of new radical approach that enabled them to do all kind of stuff.  However, they are extremely secretive company and till recently wouldn't even update their website  The name of the actual inventor that made it possible is ((name deleted)) - He was a former electrician and mechanic. .... ....him he was playing at his office in Irvine with this crazy vintage 1930's phone they modified for a joke.  It acted as HD sound system (super powerful -The sound quality was comparable to good size stereo -however I couldn't see any speakers ) it also worked as a regular phone dialing etc, It was cordless and could connect to any phone or PC.  He told me that it lasted 150+ hours playing/talking?  I hope whoever reads this has a chance to meet him and with bit of luck see some of the stuff they came up with -he is.....\"Date: 2013 Location: Orange County , Summary: They started to update their site - \"new technology that allowed them to do all sorts of stuff.\" \"besides producing medical inventions, also has divisions for automotive, home, electronics, apparel and software inventions.\" Note \"CORPORATE OFFICES: ((deleted)) IRVINE, CA 92612 LABORATORY: UNDISCLOSED LOCATION \" ?!   \"((name deleted)) is a ((name deleted)) student/inventor who has distinguished himself by his abilities in electronics, mechanics, and repair of medical instruments. ((name deleted)) moved to the USA at ((deleted)), unable to speak English and without living family.  Only ten years later, ((name deleted)) is an American citizen, has gained a degree in biology, is in ((deleted--graduate))school, has submitted several articles to professional peer-reviewed journals, acted as a consultant to a biomedical device company, has been approached by another company wanting to develop and use one of his inventions, and has taught biomechanical and surgical techniques to physicians and professors. At the beginning of his third year in ((deleted)) school, ((name deleted)) started a company to develop and market his first major medical invention, but when the stream of inventions continued to flow, it became necessary to start Inovatzia, Inc. which, besides producing medical inventions, also has divisions for automotive, home, electronics, apparel and software inventions.\" ((deleted)). is a company centered around the inventions of ((name deleted)) a (graduate) student, political asylee, and American citizen. Inspired by Nikola Tesla, Stan has created a world where control of medical equipment, household appliances, automobiles, and even footwear is accessible and customizable  'I saw them playing with a working prototype over a year ago – not exactly as the one described in the Video. They had developed new technology that allowed them to do all sorts of stuff. The name of the inventor is ((name deleted)), and his companies are ((names deleted)) They are very secretive company and until recently wouldn’t update their web sites. However if you doubt it – give them a call pretending you are looking for a Job as software or hardware engineer.\" login ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104806.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c0fc5",
      "summary": "Large Triangular translucent craft flew over the house while star gazing the width of 2 full moons.  I was 100% silent with no lights.",
      "city": "irvine",
      "shape": "triangle",
      "date": "2014-01-30T00:00:00",
      "story": "Large Triangular translucent craft flew over the house while star gazing the width of 2 full moons.  I was 100% silent with no lights. I saw a large translucent/shadowy wide triangular craft.  I was star gazing and it crossed my POV about 5 minutes in doing a fly by lasting about 35-40 seconds.  It made NO sounds, and had NO lights.  It moved in a perfect straight line.  It was the width of 2 moons so it must have been a very giant low flying craft. I have it on Google Maps checked where I was standing at: 33*42' 17.43\"N 117*47' 1.18\"W  -Craft was flying mostly East to West towards the ocean/Newport Beach.  Through my research I found about 2 weeks earlier a popular Newport Beach triangular formation o flights the same dimension as the craft I saw is going viral on Youtube, but filmed in the day time.  My theory is it must have some cloaking device considering it matched the color of the sky perfect.  It look just like a black outline and flew in such a perfect straight line into the horizon, almost like someone dragging an icon across a monitor perfectly straight.",
      "link": "http://www.nuforc.org/webreports/106/S106682.html",
      "state": "CA",
      "duration": "35-40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1250",
      "summary": "Witnessed a handful of cigar-shaped aircrafts with 4 red and 4 turquoise lights; red lights were blinking.",
      "city": "irvine",
      "shape": "cigar",
      "date": "2013-12-02T00:00:00",
      "story": "Witnessed a handful of cigar-shaped aircrafts with 4 red and 4 turquoise lights; red lights were blinking. Witnessed 3 – 4 UFO’s moving much quicker than normal commercial aircrafts and at a lower altitude.  The aircraft was in the shape of a rocket with 8 lights.  4 lights were of a turquoise color while the other 4 were red and pulsating on and off.   All the lights were positioned near the middle of the aircraft.  The lights were positioned in a circular orientation, following a red then turquoise pattern.   UFO’s appeared to be surveying the land, for it was moving in straight lines, making turns much sharper than normal aircrafts.   Deep buzzing sound heard as one aircraft flew above and behind us and into the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104829.html",
      "state": "CA",
      "duration": "20+"
    },
    {
      "_id": "64d005f478aba2ec5a3c2927",
      "summary": "Large round red ball, approx 200 ft. diameter. Observed descending slowly behind a nearby hill, 7/8 obscured by hill when seen. Then di",
      "city": "irvine",
      "shape": "sphere",
      "date": "2014-11-14T00:00:00",
      "story": "Large round red ball, approx 200 ft. diameter.  Observed descending slowly behind a nearby hill, 7/8 obscured by hill when seen.  Then disappeared.  However, within a short time, it rose slowly again so that the very top appeared just over the hill and it expelled a very bright light momentarily, and what appeared to be sparks.  Then dropped out of sight.  I have previously seen UFOs twice in the form of orange balls, once during WW2, when I was the captain of a bomber returning from a raid over Germany.  It was  sitting on the water of the English Channel, and again about fifty years later, in Canada.  At that time I saw 2 UFOs identical to the one I had seen previously, sitting on the water of Horo Straight, about 1 1/2 miles from my home.  The internet has a report that I wrote about my UFO experiences.  If you Google Flt. Lt. Gordon Cammell R.A.F., you can read my report",
      "link": "http://www.nuforc.org/webreports/115/S115261.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c355c",
      "summary": "About 8 fireballs over Irvine, CA.",
      "city": "irvine",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "About 8 fireballs over Irvine, CA. About every 40 seconds a red fireball could appear do close I could take a shot at them ....total about 8 of them ...  They would hover on top of us ....  The red bright light would dim ...then shut off ...  We could still see the UFO while it fly away going stright up ......  Then two more would appear and repeat the same thing .....  It was beautiful....my dad took video on his iPad",
      "link": "http://www.nuforc.org/webreports/116/S116316.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b4e",
      "summary": "Hovering craft with red and green blinking lights.  Hovers for a minute and then moved to a new spot.",
      "city": "irvine",
      "shape": "triangle",
      "date": "2015-07-31T00:00:00",
      "story": "Hovering craft with red and green blinking lights.  Hovers for a minute and then moved to a new spot. I was walking my dog and we were passing through two buildings in my Condo Complex.  I heard a buzzing sound like a drone but didn't see anything.   After I came to the side walk I looked up and I saw 3-4 red blinking lights.  The aircraft was hovering high in the air, but the lights were extremely bright.   Within a few seconds of noticing the 3/4 bright red lights, a green light blinked.   The craft moved in a line and then stopped again.  Hovered for about 30-45 seconds and then moved again in a horizontal line.   At this point, I noticed another green light blinking.   I was quite mesmerized by the sight of this and it was definitely not a helicopter.   I was curious if anyone else saw something on this quiet night.",
      "link": "http://www.nuforc.org/webreports/120/S120658.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f74",
      "summary": "red, green and yellow fireball over Irvine/Newport Beach area tonight",
      "city": "irvine",
      "shape": "fireball",
      "date": "2016-10-11T00:00:00",
      "story": "red, green and yellow fireball over Irvine/Newport Beach area tonight I was walking my dog at night and saw the fireball travel sideways along the tree line over the city in the background...maybe fell into water near Newport Beach?  The colors were green, yellow and red.",
      "link": "http://www.nuforc.org/webreports/130/S130378.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6726",
      "summary": "I was driving on 405 freeway going north.  I noticed red flashing orbs side by side.",
      "city": "irvine",
      "shape": "circle",
      "date": "2017-04-20T00:00:00",
      "story": "I was driving on 405 freeway going north.  I noticed red flashing orbs side by side. I noticed red flashing orbs side by side, I thought it was a helicopter, but it didn't have a front light.  Or shape of a helicopter.  It was just hovering a cross freeway coming from north east a cross freeway going southwest.  Low altitude, and would pause at times.  It continued going on left side of freeway.",
      "link": "http://www.nuforc.org/webreports/133/S133598.html",
      "state": "CA",
      "duration": "5+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e3c",
      "summary": "I have pics of spherical metal objects.",
      "city": "irvine",
      "shape": "sphere",
      "date": "2017-09-05T00:00:00",
      "story": "I have pics of spherical metal objects. After watching unacknowleged the other day, I took the opportunity to observe the sky while at work as a pool monitor.  A fewer hours later I saw an object appear from the distant sky.  As it became more visible I was able to see it more clearly, it seemed to suddenly split in to two aircraft.  I have pics.  Could it be to helicopters traveling in unison?",
      "link": "http://www.nuforc.org/webreports/135/S135926.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7626",
      "summary": "Two Large Lights with bright cloud formations in darkness.  ((NUFORC Note:  Missile launch.  PD))",
      "city": "irvine",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "Two Large Lights with bright cloud formations in darkness. Irvine CA at the 405 and 133.  Two large lights moving through the sky.  Missed the starting point but there is a brightly lit cloud trail from what looks like a start location.  One light moving west shining a wide bright light back towards the following light.  The following light was emitting what could only be described as light “bursts” in a circular pattern around the light.  Both moved away in the same direction then I lost sight of the following light.  The lead light kept going west towards the ocean and moved out of site.  The cloud pattern it left behind remained bright and lit until it dissipated. ((NUFORC Note:  Missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138026.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c762d",
      "summary": "Orange fireball in front then no color.  ((anonymous report))  ((NUFORC Note:  Rocket launch from Vandenberg AFB.  PD))",
      "city": "irvine",
      "shape": "fireball",
      "date": "2018-01-12T00:00:00",
      "story": "Orange fireball in front then no color. I and two other witnesses saw a fireball with a triangular smoke trail, with two smaller bright objects breaking off from front larger object. There was a smoke trail that is lingering in the air in front of the moon.  Flew over John Wayne airport from Northeast to Southeast direction. ((NUFORC Note:  Rocket launch from Vandenberg AFB @ 5:26 p.m..  We have corrected the time.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138003.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ae7",
      "summary": "Four shiny objects flying in close formation with one breaking formation and flying straight up.  ((anonymous report))",
      "city": "irvine",
      "shape": "disk",
      "date": "2017-11-03T00:00:00",
      "story": "Four shiny objects flying in close formation with one breaking formation and flying straight up. I was travelling north on Interstate 5 just south of the Irvine Spectrum and saw what I thought was a plane pulling a banner near the old Verizon Amphitheater.  The \"banner\" was towards the north and the \"plane\" was towards the south.  I then realized that the objects were actually moving north towards the Irvine Spectrum so the \"banner\" had to be something else unless it was being pushed by the \"plane.\"  The formation then crossed Interstate 5 heading east.  The formation consisted of four separate objects flying in close proximity.  The objects were shiny and appeared disc-like.  The front three objects were very close to each other; the forth was trailing behind.  Once the objects crossed the interstate one of the object in the group of three broke formation and went straight up very quickly.  I then lost sight of the remaining three object. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137023.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b35",
      "summary": "((HOAX??))  VERY LOUD NOISE HEARD OVER SOUTH LAKE SCHOOL AND SANTA ANA IT LOOK LIKE X WING PLANES.  ((anonymous report))",
      "city": "irvine",
      "shape": "unknown",
      "date": "2017-10-19T00:00:00",
      "story": "VERY LOUD NOISE HEARD OVER SOUTH LAKE SCHOOL AND SANTA ANA.  IT LOOK LIKE X WING PLANES. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136723.html",
      "state": "CA",
      "duration": "3"
    },
    {
      "_id": "64d005f478aba2ec5a3c7dff",
      "summary": "I was in bed sleeping and some strange noise woke me. It sounded like a loud bass hum.",
      "city": "irvine",
      "shape": "light",
      "date": "2018-05-31T00:00:00",
      "story": "I was in bed sleeping and some strange noise woke me.  It sounded like a loud bass hum. When I opened my eyes there was what looked like a small star in the sky at about 80 degrees. It looked like it was about 5 to 10 miles away.  The object was moving in place in small movements side to side and up and down. The lights were brighter than a small star.  The object was moving in place, but moving in a downward trajectory.  When it was at about 20 degrees I lost track.  It was up for more than 30 minutes.",
      "link": "http://www.nuforc.org/webreports/141/S141613.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c800f",
      "summary": "Like nothing I have ever saw before.  I can’t explain what I saw.",
      "city": "irvine",
      "shape": "cross",
      "date": "2018-04-13T00:00:00",
      "story": "Like nothing I have ever saw before.  I can’t explain what I saw. I work for the Fire Department in my hometown.  I had just got off work and had pulled into my driveway at home.  As I exited my car, I noticed a very bright white light in the sky. I stopped and began looking at this light, thinking it may be a medical helicopter taking off from a nearby helipad.   As I looked at this light it didn’t take long for me to rule out it being a helicopter.  What I was looking at was actually at least 3 very bright, white balls of light.  These balls of light looked to possibly be connected.  And directly above and below these balls of lights was either a long, thin stream of light or possibly some sort of lit up structure.  Sort of reminded me of a jack, like you would find in a children’s game.  Only it was a brilliant white color.  As I began to study this object, I began to notice that the balls of white light were actually rotating around fairly slow.  There was definitely no sound whatsoever.  I live out in a more rural area of the co! unty.  There was not a cloud in the sky when I observed this object.  I had a very clear, unobstructed, view of this object.  It was fairly high up in the sky, but not nearly as high as other objects such as stars or possible satellites.  Things such as that can definately be ruled out.   I continued to watch this object for 30 minutes or so.  During this time period the object never appeared to move up or down, or left or right.  It only sat in one spot and rotated.   After 30 minutes, I began to get cold, as well as needed to get some sleep.  So I went on in my home and went to bed.   Oh, one last thing... I did take a couple of pictures of this object with my cellphone.  But unfortunately you can’t make out any of the details of it.  All you can see is one bright white light in the photo.",
      "link": "http://www.nuforc.org/webreports/139/S139417.html",
      "state": "KY",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8667",
      "summary": "A mesmerizing string of red lights ascending into sky quickly and diagonally past/towards Venus.  ((anonymous report))",
      "city": "irvine",
      "shape": "formation",
      "date": "2018-08-22T00:00:00",
      "story": "A mesmerizing string of red lights ascending into sky quickly and diagonally past/towards Venus. A mesmerizing string of red lights ascending into sky quickly and diagonally past what appears to be Venus. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142794.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8c7e",
      "summary": "Watch a bright star at twilight it descended and split off into two over the bay with no sound two objects with neon lights underneath.",
      "city": "irvine",
      "shape": "diamond",
      "date": "2019-01-24T00:00:00",
      "story": "Watch a bright star at twilight it descended and split off into two over the bay with no sound two objects with neon lights underneath one with arrow the other with triangle.  No sound flew over and turned into one star.  After fly over many helicopter activity.  Location near john wayne airport. ((NUFORC Note:  Date in 1989 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144554.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c92d7",
      "summary": "x shape brightness irregular star on east sky after late night programming.",
      "city": "irvine",
      "shape": "sphere",
      "date": "2019-12-01T00:00:00",
      "story": "x shape brightness irregular star on east sky after late night programming.",
      "link": "http://www.nuforc.org/webreports/150/S150200.html",
      "state": "CA",
      "duration": "Long"
    }
  ]
}