{
  "city": "irving",
  "fetch_timestamp": "2025-07-12T14:36:08.877947",
  "record_count": 24,
  "pages_fetched": 1,
  "api_calls": 2,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b439e",
      "summary": "The triangular shaped  U.F.O. was almost silent and hovered like a helecopter but didn't make a sound.",
      "city": "irving",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "The triangular shaped  U.F.O. was almost silent and hovered like a helecopter but didn't make a sound. I was travelling south on hwy.360 just before post and paddock exit when a large triangular shaped aircraft flew right over me. My sunroof was open and I had the radio up, so I didn't hear it, I glanced up and seen the bottom of it about 10 foot higher than the budget suites motel. The U.F.O. then became stationary (hovering) above Ave.k. exit. I watched and my friend as a witness (she was in the truck with me)all the way, going south to Lamar exit, we went almost directly under it. The U.F.O. seemed to have a circular suction cup underneath it with three bright rectaingular lights on bottom that went off and on randomly. As we passed and it was behind us it all the sudden dissapeared. I don't know wich way it headed or where it may have gone. I myself have seen this U.F.O. twice since that night.",
      "link": "http://www.nuforc.org/webreports/049/S49888.html",
      "state": "TX",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b5ec2",
      "summary": "UFO Alien Encounters",
      "city": "irving",
      "shape": "diamond",
      "date": "2008-06-12T00:00:00",
      "story": "UFO Alien Encounters  Two incidents on UFO alien encounters:  The first incident was several years ago; the second one was recently on May 6, 2008.  I don’t know if the whole thing was a dream or if it was real but I can assure you that they communicated to me mentally and not verbally, as we do.  My first encounter with the aliens took placed several years ago.  They took me to their galaxy that had 5 suns and several planets, which I was able to see from their spaceship.  Since our galaxy only has one sun, I was astonished to see so many suns in just one galaxy.  I don’t recall ever getting out of the spaceship; the whole trip was just like a “tour” through the universe.  They were green aliens, very short, not with the usual configuration depicted in Roswell, NM.  Their heads were wide, mostly by the cheeks area and they were very nice to me.  My most recent encounter was with just one alien.  This one had pink skin and came-up in a small gray color spaceship.  His head had a light bulb shape and he was skinny.  He told me via mind communication that it was time for me to go with them for good.  Some sort of force started taking me towards his spaceship (I started floating in the air) but then, suddenly, I decided I did not want to go yet, and saw myself back into my home.  The next day, May 7, 2008, I received a call from one of my doctor’s office, in which I was told they found pre-cancerous cells in a yearly routine exam I recently had.  Every year this exam comes-out normal and, all the sudden, right after the encounter I had with the alien, it happened to come-up abnormal.  Now I am going to have to get a biopsy done on June 2nd to check on the stage level of the cancer findings.",
      "link": "http://www.nuforc.org/webreports/063/S63160.html",
      "state": "TX",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f11",
      "summary": "tryangle over tx",
      "city": "irving",
      "shape": "light",
      "date": "",
      "story": "tryangle over tx a friend an i who were abought 11 or 12 tears old were looking over the dallas sky line on a hill in irving.the lights were moving ,not to fast towards dallas .above us they slowly stoped .they were in a tryangle with one in the front.iam not shure if they were white or orange in color.they were not making a sound.my dad worked at bell helacopter company an i told my friend the reason we couldnt hear them was because they were too high.iam 62 now an i know better.theystoped for a second or two an the one in front went back towards the west then the other two did the same togeather an so on with the resti guess i will dy wondering what they were. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60179.html",
      "state": "TX",
      "duration": "5minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5fc4",
      "summary": "Green Tail; Red Flash",
      "city": "irving",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "Green Tail; Red Flash Our classes for a lock-in was heading out to a polo field to play capture the flag. Many described the object as being a shooting star with a green tail. As it rose into the sky they say that it stopped, flashed red, and disappeared. I did not see it, however. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59542.html",
      "state": "TX",
      "duration": "Less than 1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b75dc",
      "summary": "As we was driving down Shady Grove heading west we saw a bright blue light steaking across the sky, dipping in and out of the clouds be",
      "city": "irving",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "As we was driving down Shady Grove heading west we saw a bright blue light steaking across the sky, dipping in and out of the clouds before dissappearing. The light was brilliant and it left a very bright tracer behind it that lasted only a second. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52753.html",
      "state": "TX",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ca0",
      "summary": "Oval shaped aircraft shimmered in the sky and disappears",
      "city": "irving",
      "shape": "oval",
      "date": "2009-08-05T00:00:00",
      "story": "Oval shaped aircraft shimmered in the sky and disappears I was driving down the street in the passenger seat of my car when me and my brother saw what looked to be a airplane light up and sparkle for a few seconds.  The light slowly faded away until we were able to discern that it was not a airplane, and was an oval shaped aircraft of somesort that I have never seen before.  The light continued to fade,and the craft began to look blurry, until the entire plane faded away and disappeared completely.  I was left looking all over the sky for the object, but it was gone.  It had just vanished in the middle of the sky, and it hadn't been flying at a very high altitude.",
      "link": "http://www.nuforc.org/webreports/070/S70797.html",
      "state": "TX",
      "duration": "10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcea7",
      "summary": "UFO's fighting in the sky.",
      "city": "irving",
      "shape": "circle",
      "date": "2011-05-29T00:00:00",
      "story": "UFO's fighting in the sky. Their was a heavy storm and I was taking pics of the sky.  The sound over our head sounded like UFOs over our head.  It was a noise I'd had never heard.  Lightning was over our head and the sky looked incredible.  When I wentin, I looked at the Pics and that is when I saw the different circular objects in the pic.  They were everywhere.  I was totally amazed.  What a night it was. It sounded like there was fighting in the sky of UFO's.  We also heard jets going by real fast.",
      "link": "http://www.nuforc.org/webreports/081/S81524.html",
      "state": "TX",
      "duration": "all night"
    },
    {
      "_id": "64d005f478aba2ec5a3be8ca",
      "summary": "Stationary triangular pulsing red lights seen in Irving, IL on 05/27/12 at 17:30 hours.",
      "city": "irving",
      "shape": "light",
      "date": "2012-05-29T00:00:00",
      "story": "Stationary triangular pulsing red lights seen in Irving, IL on 05/27/12 at 17:30 hours. I looked up into sky and saw a red triangular shaped, solid, and slightly pulsing light. At first I thought it was a plane coming to land at Lambert Airport in St. Louis but it wasn't moving and was too big to be a plane.  The lights were not the same as on a airplane getting ready to land.  I watched it for about four minutes until a text message came from my daughter. After I read her short text, I looked up and it was gone and nowhere to be seen. I live in the country where street lights, etc... so not ruin the view of the night sky.",
      "link": "http://www.nuforc.org/webreports/089/S89236.html",
      "state": "IL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c09e2",
      "summary": "Triangular object with faint yellow-orange lights on irregular flight path hovered, then descended rapidly and observed as cylindrical",
      "city": "irving",
      "shape": "cylinder",
      "date": "2013-11-11T00:00:00",
      "story": "Triangular object with faint yellow-orange lights on irregular flight path hovered, then descended rapidly and observed as cylindrical Took dog outside for his bathroom break and noticed a strange object overhead on a path from Dallas to Irving (east to west).  At first I thought it was perhaps the space station, as this is sometimes observed just after dark on a clear night.  However, this object had an irregular flight path and came to a complete stop and hovered.  When first sighted, the object appeared triangular with faint yellow-orange lights.  After hovering for a moment, the object suddenly and sharply began to move my direction in a descent and for a brief moment I could observe a large dark cylindrical object dotted with faint yellow-orange lights.  The object appeared to ascend, at which point it became faint again.  The object then moved in a SW direction and was barely visible after another 30 seconds.  The entire event lasted about 3 to 4 minutes and the object traveled about 15 miles in the final 30 seconds, not including elevation changes.  The object made no detectable soun! d.",
      "link": "http://www.nuforc.org/webreports/103/S103566.html",
      "state": "TX",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11b2",
      "summary": "Spotted three orbs creating a triangle rotating in scnychronized manner.",
      "city": "irving",
      "shape": "fireball",
      "date": "2013-11-20T00:00:00",
      "story": "Spotted three orbs creating a triangle rotating in scnychronized manner. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104402.html",
      "state": "TX",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1791",
      "summary": "Was circling a star and then moved away and disappeared, minutes later saw another one and a jet following the object.",
      "city": "irving",
      "shape": "circle",
      "date": "2014-06-04T00:00:00",
      "story": "Was circling a star and then moved away and disappeared, minutes later saw another one and a jet following the object. I was outside taking pictures of the moon when I caught a strange object then on my last picture the object was gone then it circled the moon and was moving away from it then a minute later it disappeared then like 3 minutes later it came back towards the moon but away and a jet was following it.",
      "link": "http://www.nuforc.org/webreports/109/S109326.html",
      "state": "AK",
      "duration": "15 mintues"
    },
    {
      "_id": "64d005f478aba2ec5a3c20e9",
      "summary": "A friend and I were at Running Bear Park and I witnessed one fiery object falling from the sky behind the trees. Unfortunately, my frie",
      "city": "irving",
      "shape": "fireball",
      "date": "2014-05-08T00:00:00",
      "story": "A friend and I were at Running Bear Park and I witnessed one fiery object falling from the sky behind the trees.   Unfortunately, my friend didn't witness it as well, and I didn't have site of the object before it was in free-fall.   I heard no noise.",
      "link": "http://www.nuforc.org/webreports/109/S109189.html",
      "state": "TX",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3dbe",
      "summary": "Red and green blinking lights over 4th of July fireworks.  Moved suddenly in reverse direction.",
      "city": "irving",
      "shape": "rectangle",
      "date": "2015-07-06T00:00:00",
      "story": "Red and green blinking lights over 4th of July fireworks.  Moved suddenly in reverse direction. There were 2 crafts visible while the 4th July Fireworks were going on.  One was very close to us red and green blinking lights, other was far away and looked like a green bright small light.   The one close to us was just static for about 10 minutes and then started moving in the direction of the blinking green lights, and disappeared over the buildings.  It then came back again with green light blinking ahead and red light blinking at the rear of the craft.   It looked like it dropped in height and moved side ways and then it was static.   Suddenly, the red and green lights switched places and craft started moving in the reverse direction.  I cannot think of any craft that can move in one direction, stop and simply reverse its direction without  turning.   Also the other craft, the green bright light was static for most of this time, at the end of the fireworks, it moved very rapidly from the static position and disappeared.   I am sure it was a U. S. Air Force surveillance craft, but I do not know of an aircraft or helicopter that can do that and not make any noise at all.",
      "link": "http://www.nuforc.org/webreports/120/S120034.html",
      "state": "TX",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c48be",
      "summary": "3 lights in the sky lined up, not moving at all till we went to go look at it. As each were taking off one by one another one appeared",
      "city": "irving",
      "shape": "unknown",
      "date": "2015-09-25T00:00:00",
      "story": "3 lights in the sky lined up, not moving at all till we went to go look at it. As each were taking off one by one another one appeared. Okay, I was with 4 other people and we went to get pick up one of people from work and i noticed on the way to picking him up..  there was 3 dots in the sky lined up not straight liked up but just about..  And it wasn't moving at all.  Then we were driving home and i looked up and they were still there and i didnt tell any of my friends about it.  so we pulled up to our apartments and i brung attention to it and then we all went to the back of the apartment. for we can get a better view of it.  And all 3 dots were still there.  It wasn't a star.  Neither was it a plane, cause planes do not stand in mid air floating.  So we were watching it and it was weird after we starting to acknowledge that they are there.  One starting going up slowly and it starting taking off towards the left and it had a red light.  Again not airplane.  So it started taking off to the left pretty fast and we couldn't tell the shape of the object it was dark but it had bright lights around the object with a flashing red light.  Okay then there was the other two they were and the same place and after the first one took off the second started to go up with a not so bright light then it got bright and did the same thing as the first one. and right after that second was about to go up there was a bother light that appeared out of no where it wasn't as bright but then it got bright. And it was in between of the other two lights. and they each took off one by one. with the same speed and flashing lights.",
      "link": "http://www.nuforc.org/webreports/122/S122053.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c51c1",
      "summary": "Light source, 90 degree sharp turn, amazing acceleration above Texas skies.",
      "city": "irving",
      "shape": "light",
      "date": "2016-01-05T00:00:00",
      "story": "Light source, 90 degree sharp turn, amazing acceleration above Texas skies Travelling westbound on hwy 635, I and my fiance saw a green light above the horizon.  The light source \"appeared\" to be pretty far off, but understandably hard to tell when looking in space. Suddenly, the light source did a 90 degree turn and accelerated and an unbelievable speed. I asked my fiance if she saw it, she replied, \"Yes, what was that?\"  I said, \"I have no idea, but nothing manmade can turn and accelerate like that.\"   I have tried to see if others had seen it as Irving is in DFW metroplex (not podunk, Arkansas) to no avail. FWIW - I am an engineer, and my fiance is a ((physician; specialty deleted))  I feel this is noteworthy as we are not some wackjobs mistaken \"Venus for a UFO while traveling down a curvy road\" ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124905.html",
      "state": "TX",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c518a",
      "summary": "Driving down Rochelle Rd. towards N. Story Rd. and saw 3 lights  1 leading like 3:00p while other two were 12:00p & 6p. they appear to",
      "city": "irving",
      "shape": "light",
      "date": "2016-01-29T00:00:00",
      "story": "Driving down Rochelle Rd. towards N. Story Rd. and saw 3 lights, 1 leading like 3:00p while other two were 12:00p & 6p.   They appear to be located on south Irving side (across 183)    Very bright compared to DFW planes we usually see. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125437.html",
      "state": "TX",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d3b",
      "summary": "Two observers. Both are professionals working in Children's television. One of which is the producer of a network locally in Fort Worth",
      "city": "irving",
      "shape": "other",
      "date": "2016-12-05T00:00:00",
      "story": "Two observers.  Both are professionals working in Children's television.  One of which is the producer of a network locally in Fort Worth, Texas, that produces programming for Children's hospitals nationwide.  We know camera lens malfunctions, we know how to debunk lens flare, dust, exposure issues, et al.  We went outside to take photographs of the super moon.  We missed the largest expression of the moon but hurried out to capture what we could.   Standing in the parking lot facing east, I began taking photos.  I noticed an anomaly in the photos which seemed to be a smaller sphere to the lower right of the bright moon.  I looked with my physical eyes at the moon and saw something darker than the moon and sky in the same area.  I took more photos and each one contained the sphere.  It looked very solid.   I decided to clean the lens and take the case off the phone and use an additional lens that hooks on the back of the iPhone 6 Plus.  I saw the object even clearer at this point.  I zoomed in without losing resolution and took a few more.  I examined those with my partner and he was very intrigued and we zoomed in and were awe struck.  It was a sphere but it was a moon.  It looked exactly like our moon only smaller. In the photos, there is a visible lens flare/glare that is bouncing off of the overhead lot lights.  This sphere/additional moon was not a lens anomaly.  To further debunk the oddity, we walked to the park in the middle of our condos.  We saw the bright big moon through the tree tops. I took out the camera and began shooting more pictures.  We figured if it was a lens or camera issue, it would project this second moon overlapping the tree branches, thus copying the image of the actual moon.  Much to our surprise, this secondary moon was shadowed by the branches in the actual placement of where it corresponds and the actual moon/supermoon was not shrouded by branches in real visual observation nor in the photograph.  This blew our minds.! We took several photos and then went inside to grab the very ! large te lephoto lens for the SLR camera and came back out.  We took more photos from the original device, my partners device, and the SLR and there was no second moon present in these photos.  So this phenomenon was present for roughly 5-7 minutes then gone.",
      "link": "http://www.nuforc.org/webreports/131/S131247.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a04",
      "summary": "UFO, with helicopters.  ((NUFORC Note:  Report from former airline employee.  PD))",
      "city": "irving",
      "shape": "light",
      "date": "2017-02-22T00:00:00",
      "story": "UFO, with helicopters. I observed a brilliant light west of my location. It was not Venus. It was not an airplane, or in usual flight path towards DFW.  (I have worked at an airline at DFW for 24 years, I know the flight patterns and what an aircraft looks like.)  This light was hovering, and so bight it radiated starburst.  There were a dozen or so helicopters circling it.  I shot video, you can clearly see helicopters going around the object, even passing over head.  They are different than object, in they have the typical lighting after about 15 minutes, the light descended closer to ground, and then proceeds west, diminishing in intensity of brightness.  https://www.youtube.com/watch?v=3wC3e-QflaI",
      "link": "http://www.nuforc.org/webreports/132/S132699.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a90",
      "summary": "White glowing lights overhead in Irving. TX.  ((NUFORC Note:  Possible sighting of Venus.  Anonymous report.  PD))",
      "city": "irving",
      "shape": "light",
      "date": "2017-11-09T00:00:00",
      "story": "White glowing lights overhead in Irving, Texas It was a typical Friday morning.  I was up by 5 am and in my car by 6 for my 35 min commute to Dallas.  The drive was uneventful, til about 15 minutes on highway 183 until the traffic came to a grinding halt, that lasted about 20 minutes.   As I sat on the highway, I figured there must be an accident ahead, and then I saw this magnificent light in the sky.  I knew it was not a star, a planet nor tthe moon and I immediately ruled them out.   Tired of sitting on the highway, I got off on the next ramp only to find myself stuck waiting to catch a traffic light.  I was compelled to look at the light because there was something \"off about it\".  It wasn't a helicopter.  It was so quiet outside it really surprised me.   Took a couple of pics then decided to turn on my video.  I witnessed this light shining brighter still, glowing and it appeared to be two circles of light.  It became very bright then dimmed and began hovering away at a very fast rate of speed.  I am convinced it was a UfO. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137144.html",
      "state": "TX",
      "duration": "Morning"
    },
    {
      "_id": "64d005f478aba2ec5a3c8364",
      "summary": "I saw a strangely shaped aircraft near my bus stop.  ((anonymous report))",
      "city": "irving",
      "shape": "other",
      "date": "2018-10-18T00:00:00",
      "story": "I saw a strangely shaped aircraft near my bus stop. I was waiting at the bus stop in the morning and I saw a strange shaped aircraft fly over the area.  It was somewhat similar to a plane however the wings were bent down and forward into a horseshoe like shape.  I was only able to see it for a few quick seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143474.html",
      "state": "TX",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bb7",
      "summary": "Plane with 1 or 2 round white balls flying around.",
      "city": "irving",
      "shape": "circle",
      "date": "",
      "story": "Plane with 1 or 2 round white balls flying around. I was about 10 years old with my brother.  This occurred on a Sunday morning around 8 AM in late 1940's or early 50's. The sky was clear. I said a twin engine plane, maybe have been a DC3, with a round white ball coming out of the nose and going into the tail, now I know it was going around the plane.  Not sure if this was 1 or 2 balls.  Not sure how long it lasted.  But I remember seeing it.  This may have never been reported do to the time. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144964.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c9219",
      "summary": "pulsating orange / white light hovering",
      "city": "irving",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "pulsating orange / white light hovering Report 1 of 2  On Saturday, October 12, 2019, my girlfriend and I were working in the yard at her house.  At 5:10 PM, with bright blue skies, I observed to small orange/white light that looked like a bright star overhead at about 80-degrees NNE of my location in Irving Texas.  I could not make out any shape.  It was slowly pulsating and was not moving.  I pointed it out to my girlfriend, and she saw it too.  After about 20 – 30 seconds, I went to my car, a few feet away, to get my binoculars. After retrieving my binoculars, my girlfriend told me that it faded away, and we could no longer see it.",
      "link": "http://www.nuforc.org/webreports/149/S149829.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c921b",
      "summary": "White object changing shapes",
      "city": "irving",
      "shape": "changing",
      "date": "2019-12-01T00:00:00",
      "story": "White object changing shapes Report 2 of 2  On Saturday, October 12, 2019, my girlfriend and I were working in the yard at her house. We were working in the yard, and at 6:20 PM, I observed an object that was bright white at about 60 – 70-degrees elevation to the east of our location.  I could tell it had a shape and was not an airplane. It appeared to be hovering.  I looked through my binoculars and could see it, still very small. It appeared to be at a very high altitude.  It appeared to be a long bright loop, small and nearly closed about 2/3’s of the length and an open loop at the other end.  It slowly changed shapes to an “V” shape.  About a minute or so later, it changed to a “)” shape. A minute or so later, it changed to a straight tube or cigar shape.  I took five pictures with my cell phone. You can see the object as a small white dot in the blue sky, but no details. Enlarging the photo, you can see the shape changes. One picture, you can see the “V” shape. I called the Irving Police department to report what I was seeing and to see if anyone else was reporting it.  I was on the phone with the police department for about 5 minutes, describing what I was still looking at.  They took down my information and said they would check it out. The object was visible for about 10 minutes, slowing moving to the east. Then, at about 45-degree elevation due east, it just disappeared. I called the Irving Police Department back and told them it was no longer visible.",
      "link": "http://www.nuforc.org/webreports/149/S149828.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c97dd",
      "summary": "Reddish orbs flying across the sky starting bright then fading out in distance. Coming from SE direction to NE. Event lasted approx 10",
      "city": "irving",
      "shape": "fireball",
      "date": "2019-10-04T00:00:00",
      "story": "Reddish orbs flying across the sky starting bright then fading out in distance.  Coming from SE direction to NE.  Event lasted approx 10 mins.",
      "link": "http://www.nuforc.org/webreports/149/S149129.html",
      "state": "TX",
      "duration": "10-15 minutes"
    }
  ]
}