{
  "city": "jacksonville",
  "fetch_timestamp": "2025-07-12T14:18:49.104955",
  "record_count": 204,
  "pages_fetched": 10,
  "api_calls": 11,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b42b6",
      "summary": "These are accounts of several personal UFO and 'other' experiences.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2006-05-15T00:00:00",
      "story": "These are accounts of several personal UFO and 'other' experiences. 1) The January 2005 UFO sighting, Jacksonville, Florida:  Shortly after dusk on the evening of January 19, 2005, I was closing the curtains in the band room of my West Jacksonville home.  While doing so, I noticed a very bright light in the sky, larger than a star, which was changing colors, hovering and moving slightly up and down, which was located in the ESE sky. I called for my live in boyfriend to observe as well, in which he did.  We watched the object for a good ten to fifteen minutes, as it appeared to hover, and make only slight movement in the sky, mostly in an up and down motion, but sometimes slightly back and forth.  The object appeared to grow brighter and dimmer at times, but did not seem to be 'traveling,' like a plane. In the center of this object, stretching horizontally across the object, the lights emanating from the object changed colors frequently, and one could clearly distinguish that this was not a star or planet. My boyfriend and myself both noted that this was not a star or planet from it's slight movements, and the line of lights which changed colors, and noted that it was not like any aircraft which we normally see from where we live, because of it's movements, and sometimes the lack thereof.  We heard no noise from this object. I began cooking supper, but occasionally checked back on the object, which was there several times when I checked on it, but eventually disappeared. One interesting note, in another account of the January sighting, the person witnessed the UFO on the 15th, we witnessed it on the 19th, however, the witness was on HWY 301, which is not far from our house.  We live on Cahoon Rd, off Normandy Blvd, which runs into, and ends at HWY 301.    Normandy Blvd., Jacksonville, FL 32205  This incident can be verified by my current boyfriend of 4 years.  I did notice several conventional style aircraft flying in the same area that night which may be able to substantiate this story further.  .....................................................................................  2) The electrical assault incidence:  This may sound very strange, but on my word of honor, this is the truth, and did in fact happen. In 2003 or 2004, my memory escapes me as to which year exactly in which this occurred but, one afternoon I was washing dishes at the same address as the above incidence, and I was alone in my house, as my live in boyfriend was at work.  I became aware of a strange frequency which I could hear which seemed especially 'targeted' at my right ear.  This frequency was a lower pitch than the frequencies I normally pick up on from time to time, and seemed strange that it seemed 'targeted' at the right ear, instead of being heard by both of them.  What was also strange was this frequency was also felt as well as heard.  As I experienced this frequency, I also experienced a strange sensation in my head, almost like a slight stun to my brain.  Though I found this to be quite odd, it did not become unpleasant until a few seconds later when from this frequency I suddenly experienced what felt like an electric shock to the upper right side of my head, which felt like I was being zapped by a stun gun!  This immediately brought me to my knees!  After about a minute, I returned to my feet, (quite startled, scared and somewhat pissed off), only for this to happen once again! Immediately after somewhat regaining my composure, I grabbed a pistol and searched the house for an intruder and a possible explanation, but I discovered that I was indeed alone in the house, with the doors locked.  I had never before experienced anything like this, nor have I since, however I am now quite frightened when I hear frequencies. I debated with myself the idea of calling up the military to see if they were doing some kind of military weapons testing using frequencies, but declined to do so, as it dawned on me that they probably would not tell me the truth, and them knowing I would sue them for testing on me, I figured that it probably might not be a good idea, as they could (and would), probably kill me by zapping me, if they chose to, rather than being sued, if this occurrence was a result of military testing.  I also pondered that this may be UFO related, as I have had 'other' strange occurrences happen in my lifetime, which I suspect could be UFO related. I have no answers or explanation as to who is responsible, or why this incidence happened, but would truly would like the answer to this.  Have you ever come across any instances like this in your research?  If so, would you please share them with me?  Any input on this is greatly appreciated! .....................................................................................  3) Time loss incidence #2:  In early spring of 1997, I was traveling from Louisville KY, on my way home to Jacksonville, (I lived on the Northside of Jacksonville at this time, but was spending time with my boyfriend at the time, who was a mechanical engineer working in Louisville, while my best friend stayed at my house, held down the fort and cared for my dogs.  One of my dogs was in the pound, and I went home to rescue my dog.) I had stopped at the Pio-Ono (GA) exit on 1-75 late at night, to get gas and coffee, before leaving the parking lot, I put in a fresh 90 minute cassette tape, of some recorded music, (45 minutes per side), which had CCR on one side and Aretha Franklin on the other.  The tape was rewound before I left the parking lot, as I used 90 minute cassette tapes to help 'time' the trip. I got back on I-75 headed south, (I was quite sure of this), and was on my way down the road.  In what seemed like just a few minutes back on the road, I went to take a sip of my coffee, and it was cold, at this point I knew something was weird, as I had just bought the coffee moments before, and it was quite hot at the time, and I take creamer in my coffee, and powdered creamer does NOT dissolve in less than hot liquid, yet the creamer in my coffee was perfectly dissolved.  I then became suddenly aware that the tape I was listening to was well into the other (Aretha) side, and I had not changed it! I kept going on my journey to spite the strange occurrence, pondering an explanation.  A few moments later, I discovered that I was not traveling South as I was sure that I was, but was headed North instead.  (I was starting to weird out at this point). I got off the next exit, and turned around, and started heading South again.  It took me about 20 minutes to reach the Pio-Ono exit once again, and it was at this point, that I understood that I had experienced another time loss episode.  I later told my best friend, and boyfriend (at the time), about the incident, which you can contact both of them concerning this. .....................................................................................  1996 UFO sighting, Jacksonville FL:  One evening while sitting home enjoying an evening alone, (no boyfriend in this incidence LOL, and this event took place at my Northside Jacksonville residence, the same one as the incidence above), I was lounging on the couch, listening to music, and I happened to look out the window at the night sky, and noticed an object fitting the exact same description of the UFO in the #1 sighting in the sky.  I observed it just hovering there, moving slightly up and down and sometimes back and forth growing sometimes dimmer, sometimes brighter, and changing colors.  I realized it had to be a UFO. I watched this object for a good half an hour, when my roomate/friend came home, and I told him about the object.  He checked it out, agreed that it was probably a UFO, and after a while, he went to his room, where I did not see him for the rest of the night. I watched the object for a while longer, and suddenly it just disappeared like a light being turned off! This can be verified by my ex-roomate.  .....................................................................................  Time loss incident #1, Jacksonville, FL, 1994:  About 10:45 PM, I went to the convenience store to fetch a soda and a pack of cigarettes before the store closed at 11.  I lived on Deerfield Lane in the sticks off of Starrat Road in North Jacksonville.  This was the only store for about 5 miles, and wanted to get there before the store closed.  This store was only about one half mile away from my home, so the entire trip usually only took 15 minutes tops, even if I stopped to chat with someone, or their was a line, etc.  It was the norm for me to put off making the trip until the last minute, because at the time I was writing a book, and was very much caught up in the process of doing so. When I left, my boyfriend Brian, was sitting in the recliner watching TV.  This too was the norm, as he would retire for the evening customarily after I made my evening run to the store. I went to the store, got my RC and smokes, and headed back home as usual.  When I returned home, the lights in the house were dimmed, and the TV was off.  I thought this very strange.  I started feeling quite spooked for some strange reason, which is NOT the norm for me.  I walked in the door, and there was a very pissed off Brian waiting for me interrogating me as to where I had been!  Of course, I thought he had lost his mind, as I had just been to the store and back as usual. I asked Brian if he had lost his mind, and explained/protested that I had just been to the store and back as usual.  This infuriated him, as he said that I had not been just to the store, that the store has been closed for hours, he began ranting and raving about how he went up there looking for me, I was nowhere to be found, how he called my best friend, blah, blah, blah, and pointed at the clock and said it doesn't take 3 hours to go a half a mile to the store, blah, blah, blah, and proceeded to have a conniption!  I looked at the clock and it was after 2 AM!  I then thought that he had lost his mind, AND was picking a fight with me, that he had moved the hands on the clock. He then tells me to call my best friend Brenda, and let her know I got home safely.  I did. I found out then that Brian had not moved the hands on the clock, that in fact I had a strange and unexplainable time loss eppisode.  (I'm still not convinced that Brian had not lost his mind though, from the conniption he threw.  I then nick named Brian, \"Flyin' Brian\".  LOL.)  Brenda had been very worried about me, as was Brian. I could not explain what had happened during that time, but after that, everytime I had to travel down that stretch of road between the convenience store and home, I was terrified, though I could not offer any logical explanation as to why! Shortly after that, I began having \"nightmares\" in which I could swear I was awake, and these things were happening to me.  I would pinch and even slap myself to make sure I was not dreaming but.... I would 'dream' that I would be awakened by a presence in the room.  I would get up, look around and sometimes there would be typical greys, sometimes no 'seen' being was there, but a presence was felt none the less. I would try to wake up (Flyin') Brian, but never could wake him up when this happened. In this dream, I would wake up, and get up and look out the bedroom window into the field out back which was covered in blackberry briars, and sandy Florida soil, with dips in it, where it was not exactly driveable, and see lights like 8 or ten vehicles lined up outside, complete with dust and sand flying up, in this field.  I could swear that I was awake, but apparently this was a dream, because the next day when I would inspect the field where the lights were, no vehicle tracks were apparent, nor were the blackberry thickets matted down.  This was a fairly regular occurrence.  And like I said, the field was not exactly drivable. Brian and I broke up not long after that, and to this day, I refuse to go down that stretch of road. This incidence can be verified by my ex-boyfriend Brian, and ex-best friend Brenda as well.  .....................................................................................  Fall 1986, UFO sighting, New Bern, NC:  One evening in the Fall of 1986, I went country cruising with a friend and coworker and we decided to take a break from riding, and parked in the Croatan State Park just East of New Bern, NC, and not far from Cherry Point Marine base.  Yes, we had parked to smoke a joint, as hey, we were in our mid-twenties at the time, and to just talk.  (I am now in my mid-fourties, and no longer smoke weed.) As we were sitting in my friend's truck smoking the tater and chatting, we noticed an object, that again matches the description and maneuvers of the other UFO's in the above instances. Both of us, having lived in the area for quite some time were quite aware of the aircraft, military and otherwise, which flew regularly over the area.  This was NOT the normal aircraft which we were accustomed to seeing, and no, the pot was not especially spectacular either. The next day, there were articles in the paper about a rash of UFO sightings seen across the US and the world. This can be substanciated by my friend.  About 6 months, maybe less before this incidence, my mother told me in the strictest of confidence, and after much prying as to what was bothering her, that she was hearing 'signals' one night, kind of like when one hears frequencies, only in something like Morse Code. My mother lived directly across the street from me, and I did not hear them.  My mother never drank or smoked a tater in her life, didn't take so much as an aspirin, and was a very honest, Christian woman.  .....................................................................................  Fall of 1978 UFO sighting, Hendersonville, NC:  About 2 weeks before I was to be married, my mother and I were sitting up discussing \"if I was sure I really wanted to get married or not\" mother and daughter speech.  It was a pleasant night, and we were sitting on the couch with the lights off, and the windows open to her 2nd floor apartment. Mom alerted me to check out the object in the sky.  The object, again matching the same characteristics and maneuvers as the ones in the accounts stated above, only with the slight difference, that there was one large one, and three other smaller vessels which moved about in the sky around the larger one.  They would move in directions that clearly differentiated them from any aircraft we had ever encountered or knew of, and would change colors in tandem with the larger craft. Sometimes these vessels would hover in a triangular pattern around the main vessel, and at times zig-zagged about, or go straight up and down.  We watched these crafts for about 25 minutes, until all of a sudden they took off at tremendous speeds.  We knew from the speed they were traveling, that these had to be UFO's. Unfortunately, my mother is no longer with us to substantiate this story, she died in early 1987 of a rare disease, sideroblastic anemia.  My ex-husband however, can substantiate that Mom and I told him about the incident.",
      "link": "http://www.nuforc.org/webreports/050/S50208.html",
      "state": "FL",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4355",
      "summary": "Circular disc with two lights viewed over st. johns river jacksonville",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "Circular disc with two lights viewed over st. johns river jacksonville I seen a circular disc appear over the st. johns River by Naval air station. It had two bright orange lights on the bottom of it",
      "link": "http://www.nuforc.org/webreports/049/S49609.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4c92",
      "summary": "Visitor for the heaves before the Falcon Heavy 9 launch on June 25 2019.",
      "city": "jacksonville",
      "shape": "teardrop",
      "date": "2019-06-27T00:00:00",
      "story": "Visitor for the heaves before the Falcon Heavy 9 launch on June 25 2019 It was between 0020 and 0050.  I was walking Mickler Beach that is located in Jackonville, Florida. I was there because I was waiting to see the launch of Falcon Heavy 9 from Cape Canaveral at 230 am.  While I was waiting for the launch to happen I was observing the stars, at the time there was no moon.  I saw a couple of shooting stars and satellites.  When out of the blue I saw this bright light coming from the northwest.    I was impressed so I pull my cellphone and started recording.  It was moving strangely, I concluded that it was no plane or helicopter, because it didn't make any noises and it was just a bright intermittent bright light. after two minutes it looks like it went southeast extremely fast or it went up (I couldn't see it after). I am sending this video to see what it was.  I didn't come to any conclusion. Thank you! ((NUFORC Note:  We spoke via telephone with the witness on two occasions, and he seemed to us to be quite serious-minded.  PD)) ((ADDENDUM FROM WITNESS)) Thank you so much for the response.  Well like I said in the report I was at the beach. Exactly Mickler Beach. Its located in the city of jacksonville, florida. I was waiting for the rocket falcon heavy 9 launch at 230am on the 25th of June 2009. I don't know why my celluphone didnt picked any stars. It was a clear beautiful night. Moonless for a couple of hours. I was looking at the stars and stuff up there. When from the corner of my eye I sae a shooting star. When I looked the direction in disapeard.  I SAW this very bright light.  Then I took my camera and started filming it. It was doing some crazy moves. And the thing that caught my attention was that it didn't have any directional lighta requeird by the FAA on any fying aircraft. I can't tell what it was and like I said unfortunatly no stars where picked up on my celluphone SAMSUNG GALAXY S10E. It was doing some crazy manouvers and all of the sudden it was gone.  Took of like to the south east.  I was speech less. And all I have ia that video and unfortunatlly I was the only one at that beach.  Again thank you ao much for responding. I wish it had reference points. I saw a report like back in april 30 I thing andit looks like thiS guy saw something similar. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/147/S147046.html",
      "state": "FL",
      "duration": "139 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cfe",
      "summary": "Light appearing behind satellite, in front of it and then disappearing on 4th of July",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2019-07-05T00:00:00",
      "story": "light appearing behind satellite, in front of it and then disappearing on 4th of July I live in a pretty old somewhat historic area with very old large trees around my property in every direction that block any distant views. It was 4th of July here in the united states. My boyfriend and I had decided to go outside to see if we could see any fireworks at around 9:15pm central time, we witnessed a few fireworks of a local neighbor & were able to see part of the finale at the local shooting & sports complex that is adjacent to my house several blocks north of my house. Those were the last viewable fireworks we saw from my house, you could still hear the fireworks from several directions but we were not able to see them with all the very large trees surrounding the area. We continued to stay outside, we put a blanket in the back of my boyfriends trailer, both of us having back problems decided to just lay in it and look at the stars & listen to the radio, my boyfriend went inside for a cigarette and i laying there on my back in the trailer looki! ng directly up above me see a slow moving satellite just passing by then out of nowhere i see a gold colored oval shaped o light appear a bit of a distance behind the satellite moving at the same speed trailing it for a brief moment as if it was following it. then the light went out then it reappeared a good distance in front of the satellite & sat there like it was waiting for it to catch up as if it was inspecting it. the light went out again, then came back on a short distance ahead of where it previously was then it disappeared & zoomed off instantly. The sattelite and the object both went south. My boyfriend came back outside & I had told him what I had seen. we stayed outside until about 11pm, the object was not seen again, the satellite had floated off and no more fireworks were seen",
      "link": "http://www.nuforc.org/webreports/147/S147336.html",
      "state": "AR",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4dba",
      "summary": "((HOAX)) After asking if any ETs were around tonight, to show me they are here and within seconds one flashed.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2019-04-25T00:00:00",
      "story": "I was outside on my porch skywatching, and after asking if any ETs were around tonight, to show me they are here and within seconds one flashed bright enough to get my attention.  So, I flashed my little green laser light up near it and then it flashed extremely bright.  I did it again and same response.   Then I asked it without the laser and it flashed extremely bright again in response.  It made me cry because i was able to communicate with it and get an actual response in return!  It was the best thing ever!  After it left over my area, it headed SE and did not flash again that bright.  It came from the NW direction from where I live. ((NUFORC Note:  When we first posted this report to our website, we labeled it as a probable hoax.  However, the source assures us that it is not a hoax, and that she submitted it as a sincere report.  We apologize for having mislabeled the report, and we post it again, without any editorial comment.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145764.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ec5",
      "summary": "Activity after the meteorite hit in Florida",
      "city": "jacksonville",
      "shape": "other",
      "date": "2019-04-08T00:00:00",
      "story": "Activity after the meteorite hit in Florida On the night of 30 March 2019, I was working as a security officer on the northbound rest stop on interstate 95, near exit 331.  As I was making my rounds, I saw a bright object fall smoothly to the ground.  It was too smooth to be a flare, or fireworks.  Amazed, I walked over to a trucker and asked if he saw what I have just seen.  He said no, we joked for a minute about UFO’s, and he went on his way. I was still confused, so I returned to the spot where I witnessed the light.  As I was staring in the area, two objects appeared in the sky.  They were off set from each other.  They were maneuvering unlike anything I have ever witnessed on this earth.  At first I thought that they were flying bugs in the distance that were attracted to the street light.  But they were flying smoothly around the area where the light fell.  I was still convinced that my eyes were playing tricks with me, because the objects began to mimic my movement.  They would glide back and forth in sequence.  Then they would maneuver around each other.  When I took steps forward, they ascended, then stopped, when I backed up, they would descend, then stop.  I was convinced it was not my eyes because as I continued to stare, they started gliding again.  This went on for about a good 5 minutes.  Then, I guess they got tired of messing around and disappeared. The objects reminded me of a dragon fly.  They were not saucer shaped, and I did not see any lights coming from them.  I would say drones, but I never saw two drones fly next to each other with that much control, and speed. This report may be nothing, but I will never forget what I saw.  I only wrote this report because, I was reading the news today, and they claimed that the light was a meteorite.",
      "link": "http://www.nuforc.org/webreports/145/S145527.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ec8",
      "summary": "Bright green flash/fireball.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2019-04-08T00:00:00",
      "story": "Bright green flash/fireball Just for correlations:  At approximately 11:54pm, sighted VERY bright green fireball (most likely meteor) dead west of my location,  12 miles south of metro Jacksonville.  Trajectory very steep as it looked to be coming strait down.  Flash was like daylight for 1/2 second.  No sound/boom.",
      "link": "http://www.nuforc.org/webreports/145/S145418.html",
      "state": "FL",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f1d",
      "summary": "Star formation moving across sky.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2019-04-18T00:00:00",
      "story": "Star formation moving across sky On Mar 22, 2019, I had walked outside my garage to look at the full moon and the stars.  As I looked straight ahead, there was a star formation right in front of me that I had never seen before.   It was sitting perfectly still.  I said to myself, “where did you come from and why are you so close.”   As I stood there watching and thinking the formation looked like it accelerated and started moving about the speed of an airplane.  I said you can’t do that!   I called my granddaughter to come look.  It went behind a tree with no leaves, so it was still visible.  I thought to show it to my granddaughter as it came from behind the tree but it disappeared as if swallowed or it turned off its lights or something. It was comprised of 6 stars and was triangular in shape.  A star formation is a perfect camouflage.",
      "link": "http://www.nuforc.org/webreports/145/S145687.html",
      "state": "AL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f94",
      "summary": "It's a clear night and I was wanting to do some sky watching, so I went out on my porch and sat for a bit and then coming from the nort",
      "city": "jacksonville",
      "shape": "light",
      "date": "2019-04-12T00:00:00",
      "story": "It's a clear night and I was wanting to do some sky watching, so I went out on my porch and sat for a bit and then coming from the north/West I saw a bright white orb fly over.  It was as low down as a plane can fly and just very bright, but didn't seem very big at all.  It kept a straight patt S/E.   I've seen these before on different occasions that are pretty low and theu make no noise.",
      "link": "http://www.nuforc.org/webreports/145/S145593.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fcb",
      "summary": "I was sitting outside on my porch step and was sky watching as I do every night when the weather is cooperating and happened to look up",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2019-03-29T00:00:00",
      "story": "I was sitting outside on my porch step and was sky watching as I do every night when the weather is cooperating and happened to look up to the left (west) and saw an object with what looked like red and white lights moving in a circular direction, heading NE.  When it flew over there was no plane engine sound, but there was a low frequency humming sound.",
      "link": "http://www.nuforc.org/webreports/145/S145360.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b51a5",
      "summary": "It was between 3 and 5 am in my backyard when i went to let dog out. I was staring at the constellation Cassiopeia and then turned my a",
      "city": "jacksonville",
      "shape": "chevron",
      "date": "",
      "story": "It was between 3 and 5 am in my backyard when i went to let dog out. I was staring at the constellation Cassiopeia and then turned my attention behind me, to the south west, where a very bright star was...maybe Jupiter, not sure. Out of the corner of my eye, I saw something moving from right to left..which would have been exactly in a southerly direction. Naturally, automatically i tried to see what it was and soon found a black, boomerang shaped object moving, very steadily across the sky. It had no lights and no visible features and disappeared out of sight, in a very weird kind of fading manner. It is like it flickered out. It was completely silent. The size is very hard to estimate. Since it was black I could not judge the distance or the size. My BEST estimate would be about the length of a football field from end to end. It was moving very straight. My best guess is that it would have been flying directly over the St Johns River, right on the eastern shore, moving southward. Im a few locks from the river, on University blvd W., between San Jose blvd and Powers avenue. A few days later, I went online to see if anything had ever been talked about. I googled \"boomerang ufo\" and got scared with what I found. This is EXACTLY what it looked like, except it was night time and much darker. The other thing, the most significant was this website: www.cassiopaea.org/cass/boom.htm I imagine it is a coincidence that I was staring at Cassiopaea just prior to this since I stare at constellations all the time and it was the only one visible in that direction at that time of night due to the trees on that side of my yard. But...it strikes me as odd, that I REMEMBER having been staring at that specific constellation and secondly of course, that the only time in my life I have ever seen anything like this (a UFO) was immediately upon turning away from looking at it. Please, if you can, read what that website says about contact from the constellation.  I have always been agnostic but open to these things. I am a sane, normal, everyday person that never ever thought it would happen to me...as the story goes..as Ive heard people say. If you have questions, I would be happy to answer them. I could go on about the psychological nature of the experience, which in itself, was unique, but I will leave that open if you wish to ask. Im very glad this is possible to share. This is now a very real thing to me and my desire is great to see us learning what is happening.   here is a link to the page and it is the image top center - www.cassiopaea.org/cass/boom.htm",
      "link": "http://www.nuforc.org/webreports/063/S63410.html",
      "state": "FL",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b526c",
      "summary": "very low hovering black rectangular object on a sunny day",
      "city": "jacksonville",
      "shape": "rectangle",
      "date": "2006-10-30T00:00:00",
      "story": "very low hovering black rectangular object on a sunny day walking dog in business park area in the afternoon, observed a very low flying black rectangular object, with several colored lights on the tip of the corner closest to me.  object hovered slowly and continued from NE to SW until disappearing past the treeline.  there was absolutely no sound and it appeared to be several stories high and about 5 stories long.  on the corner i saw sunlight defract against the material, and it was shimmery or segmented like shuttle tiles.  i live very near an airfield by this business park, and there is a large military presence in this community.  the object was too low, too big, too dark, and too quiet on a sunny afternoon to be a trick of the eye, but no one passed on the busy street for the duration so that i could compare stories... just with the dog who stared also! ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD)) ((NUFORC Note:  Source of report indicates that the alleged event occurred sometime in 2004.  Does not specify exact date.  We have assigned an arbitrary date in 2004.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51944.html",
      "state": "FL",
      "duration": "several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5274",
      "summary": "A mysterious blue light filled my room and I felt a friendly presence.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "A mysterious blue light filled my room and I felt a friendly presence. It was one or one-thirty in the morning on a warm summer night in July.  I was only five years old at this time.  My window was open in my bedroom on the first floor of my house, facing towards the backyard.  I had abruptly awoken to a loud humming sound coming from outside.   After a few seconds, I noticed a blue light that seemed to be coming from my open window.  At first, it was very faint and hardly noticeable; but after the course of a few minutes (three to five), the blue light had become so bright that it covered everything in my field of vision.   I tried to go and get my parents, but I was paralyzed, either out of shock from the event or from an unknown force.  All of the sudden, I felt a presence in the room.   At first I was scared, but then I felt a strong reassurance that the presence was not there to harm me.  Then, with an overwhelming flash of white light, the buzzing sound stopped and the blue light disappeared.   After this, I was able to move, and went to the windows to see what had happened.  I looked out into the lawn, and everything looked eerily still.  The trees weren’t moving, the grass wasn’t waving, and there wasn’t a single ripple in the pool.   Since that day, I have never seen that blue light again. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63763.html",
      "state": "IL",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5265",
      "summary": "silent nested silver aircraft, unattached chevron formation",
      "city": "jacksonville",
      "shape": "chevron",
      "date": "2006-10-30T00:00:00",
      "story": "silent nested silver aircraft, unattached chevron formation this is my 2nd report of 2 separate incidents in one year, both in the spring of 2004, in the same part of jacksonville, florida.  this instance happened also in a business park in the same part of town, separated by a highway.  the broad object(s) were traveling from NE to the SW on a hazy day, as towards the local military airfield.  they were flying mid altitude, that is not full commercial aircraft height and not at a low approach.  however, they appeared to be slowly descending.  the object(s) seemed to be distincly separate, but in a chevron formtion, one smaller nested inside a larger, but absolutely NOT touching.  because of the distance they only appeared gray or silver.  i could not detect any sound at any point.  i live near this area and have observed many military aircraft using the nearby airfield--this was nothing like any of those craft or formations.  these were abnormally large, including the inner craft. i walked over to a field to get closer, and at no point saw anyone else notice! ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  We have assigned an arbitrary date in April 2004.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51945.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5879",
      "summary": "5 or more balls of light darting back and forth. over the skies of Jacksonville, NC. near Camp Lejeune.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2007-11-28T00:00:00",
      "story": "5 or more balls of light darting back and forth. over the skies of Jacksonville, NC. near Camp Lejeune. I am a LCPL. in the USMC. me and a buddy of mine were walking down the street from our hotel room to a liquor store.  We had not been drinking at the time our prior. hence why we were goin to the liquor store.  On the way there I happend to look up into the sky, and seen 5 or more balls of light.  moving in a way that would be impossible for any knowin man made aircraft. darting all over the sky and running into each other it seemed like.  my whole life i have been a skeptic of aliens, but after that, now im a believer. i didnt come sooner because i didnt think anyone would believe me.  but now i could care less if anyone believes me because i know what i saw.",
      "link": "http://www.nuforc.org/webreports/060/S60026.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b594a",
      "summary": "((HOAX??))  Fire ball with red lights, red tail behind it and a tall object.  ((NUFORC Note:  Student report.  PD))",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2008-03-04T00:00:00",
      "story": "Fire ball with red lights, red tail behind it and a tall object We were outside About 2am, 4months ago. I seen a ball of fire in the sky and we thought it was a star. Then the \"fireball\" went behind the trees, a few seconds later we both seen a tall figure about 8ft tall walking down the road. The figure did not go into the light of the street lights, instead it stayed in the shadows.  The figure looked as if it had wings and it's legs were webbed together, as the figured got the closer it started to hover off the ground, the figure went into a neighbor's yard and went to the chain link fence, as the figure stood there it put it's hands on the fench, that  is when we seen the figures face.  The figure had these big black eyes and it looked as if the figure did not have a noise and a small mouth, it was something we have never seen before, there was only 1 figure that we seen.  The object was A ball of fire and it left a trail behind it, you could also see lights on the craft.  The observers was myself and my friend, when we seen the object then the figure, we could not move at all nor run for that matter it was like the figure did not want us to run away like a force field if you will.  The background was we were in the yard it was dark and hazy out kinda chilly and the only light was the street lights and the moon. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  Possible hoax, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60543.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b59ff",
      "summary": "half mile from de saint Jhons River, low flying sphere,   at slow speed without noise",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "half mile from de saint Jhons River, low flying sphere,   at slow speed without noise 04:30 AM. I SAW LIGHT SPHERE FLYIN LOW AT SLOW SPEED, FLYING SILENTLY FOR ABOUT 30 SECONDS AND THEN THE OBJECT DISAPPEARED  LIKE GO THROUGH  THE TUNNEL OR DOOR, THE INCIDENT WAS FANTASTIC.",
      "link": "http://www.nuforc.org/webreports/060/S60490.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a03",
      "summary": "((HOAX??))  One april day i saw a Ufo and it has changed my life.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2007-02-01T00:00:00",
      "story": "One april day i saw a Ufo and it has changed my life. One april day when i was 12 yrs. old i was down at my pond fishin when i had heard an airline so I looked up.I saw a Southwestern 737 flying above my pond and the a small metallic sphere came out of the coulds and started to do these high G (looked like at least pullin 12Gs) turns and dancing around the aircraft then it went into the clouds with the airliner and all that came out of the clouds was the 737.Im thinkin this has had something to do with the course of my life because later on that year from what i can tell i might have been abducted by aliens and ever since then i have experienced missing time up to 2-3 hours. If someone can help let me know. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  Student report; possible hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54450.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a47",
      "summary": "IN A CLOUDLESS SKY BEFORE SUNRISE I BRIEFLY OBSERVED A VERY HIGH, WHITE STAR SHAPED OBJECT, MOVING EAST TO WEST.",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2006-10-30T00:00:00",
      "story": "IN A CLOUDLESS SKY BEFORE SUNRISE I BRIEFLY OBSERVED A VERY HIGH, WHITE STAR SHAPED OBJECT, MOVING EAST TO WEST. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  Satellites do not orbit to the west.  Possible high-altitude aircraft??  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51933.html",
      "state": "FL",
      "duration": "10  SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a6f",
      "summary": "My friend and I looked at each other and said, “What just happened?”",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2008-06-12T00:00:00",
      "story": "Our class was at recess. I happen to look north-west above a middle school when I saw an oval shaped, purple and silver object. A friend walked over to where I was standing and looked in the same direction. He was watching the same object. It took off 20 seconds later into the Northern sky. My friend and I looked at each other and said, “What just happened?” ((NUFORC Note:  Source of report indicates that date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62782.html",
      "state": "FL",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5bae",
      "summary": "it was a very bright light in the eastern sky, it was a full moon with clear skys it  was parial to the moon.this object was of triangu",
      "city": "jacksonville",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "it was a very bright light in the eastern sky, it was a full moon with clear skys it  was parial to the moon.  this object was of triangular shape and brighter than anything i had ever seen before,it was twinkling( too big to be a star) was wobbling, but not going anywhere for about 15 seconds,then it went straight up then came straight back down,then it went to the left then to the right.this lasted about 1 minute.  then i went running into the house to get my husband when we returned it was gone.we stood watching the sky,there was no object like the one i had witnessed eariler.  then a bright light light appeared from the north to the south very bright,and moving very fast it disapeared into the ocean.  i realize that we were having a metor shower at the time but this was not a metor.a metor does not just wobble in the sky then go straight up and down then side to side.",
      "link": "http://www.nuforc.org/webreports/052/S52005.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ce5",
      "summary": "Brightly glowing scaucer shaped UFO moving slowly overhead with a \"scanning\" beam of light moving and coming from the bottom .",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2008-03-04T00:00:00",
      "story": "Brightly glowing scaucer shaped UFO moving slowly overhead with a \"scanning\" beam of light moving and coming from the bottom . I went out very early just past 4AM with my pug dog to let him do his buisness . And saw this glowing object in the night sky   I went and got my camera to get a pic.  It appeared to be moving slowly south around 20-30 feet in diamiter and both glowed and emited light or energy from the bottom that moved forward and back as well as right to left like it was scanning below it or something & was about a couple of miles or a bit more more away. I am familar with the blimps that come around for the Jags home games as well as hot air ballons ,airplanes,  helicopters, and have taken pic of them, and even the stealth bomber and fighter jets from the navy bases around here and such and all of them make some noise you can hear .  Specially in the dead of night like this but this glowing object was totally silent as it moved through the earlt morn sky .",
      "link": "http://www.nuforc.org/webreports/060/S60521.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5cf4",
      "summary": "i saw an odd craft and was possibly obducted by space men .",
      "city": "jacksonville",
      "shape": "cigar",
      "date": "2007-02-01T00:00:00",
      "story": "i saw an odd craft and was possibly obducted by space men .  500 Lights On Object0: Yes i was outside i had just started  a late night run being as im in the military i try hard to keep in shape as i was running i heard several loud and violent crashes or hard landings very simular to a helicopter or osprey which a a newer military aircraft which has been rather unsucessful however i really didnt pay much mind to it thinking it was just late night training i went further down the road and felt a strong breeze and a brilliant flash of light it was white but had a soft blueish tint to it the hugh of the light was beautiful i couldnt beleave what was happening i fell and i geuss i hit my head because i woke up the next day early in the day with a thobing back and head i had some sort of warm slime like substance unaware to what had happend i keep the event top my self for a few day until i noticed a discoloration of my flesh and hair a few days later a friend of mine came to me and had asked what happend to me as he had passed by me standing in a field staring upward looking lost he said he shouted my name several times and i didnt answer i just turned slowly and looked at him and colapsed he sadi that he saw a light very simular to the one i aw and that he drove off very quickly as to try and avoid the cigar shaped craft that had emitted the light when i woke up i went bback to my barracks room and wased my body off to rid my self of the starange goo covering my body",
      "link": "http://www.nuforc.org/webreports/055/S55017.html",
      "state": "NC",
      "duration": "30- 45 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d52",
      "summary": "Bright blue orb with a tail",
      "city": "jacksonville",
      "shape": "teardrop",
      "date": "2008-03-04T00:00:00",
      "story": "Bright blue orb with a tail Bright blue orb shaped with a tail, seemed to be hoovering then decended slowly for maybe .5 sec then very fastly out of site, the tail left a line of the same color in the sky for the 2 or 3 seconds i seen this object.",
      "link": "http://www.nuforc.org/webreports/060/S60187.html",
      "state": "FL",
      "duration": "2 to 3 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d6e",
      "summary": "Completely Silent Small UFO with Spotlight Illuminated my bedroom durring early morning.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2007-04-27T00:00:00",
      "story": "Completely Silent Small UFO with Spotlight Illuminated my bedroom durring early morning. Early one morning, I awoke sometime between 3-4am. I found it disturbing because I could not determine the reason I had awoken. I did not usually wake for no reason. I felt alert and full of adrenaline. I then noticed my old cat looking at something outside. This itself would normally be very odd. She was old and almost blind. She never focused on anything including me. That is when a spotlight illuminated my room for an instant moving from N to W. My room had 3 large (4 ft tall, 1.5 ft wide) windows facing directly south and one window facing west. I quickly pulled my blinds up on 2 of the south facing windows hoping to catch a glimpse of it. My house is close to Cecil field airbase and our house was directly in the path of P-31 Orions on landing approach which normally fly E to W. They never illuminated my room. Sometimes, our local Sheriff  helicopters fly over too which is what I expected to see. They had illuminated my room before but they flew higher, their light was not as blinding, and they tended to fly in circles which this did not do. They also tended to make noise. I was surprised to see a dark circular craft hovering over some nearby tree lines. There was no sound. None. It had an Extremely bright spotlight which was very Blue in color. The craft was moving NNW and its path took it just past my house and past my backyard. I estimated the craft to be hovering at a very low altitude. 50-75 feet above the ground. As it moved, it was also moving its spotlight. After I had opened my blinds, the light had been refocused at the street 60 feet away (South of me) and just to the right of the craft straight down. Again, if facing my house from the north, to the right of my house and south 50 feet on our street. It moved the light quickly north, then northwest and then again into my bedroom where it then stayed (obscuring my view of the craft for most of its time within my vision) focused on me as the UFO moved towards, and then past my house. I would estimate its speed at 20 mph.I tri! ed looki ng through my west facing window and watched the light as it moved to the neighbor's house directly behind mine and then northward out of view. I never heard of other reports and did not bring it up because it greatly disturbed me. I didnt sleep the rest of the night. I cannot stress how errie it was that there was no sound at all. Were there sound, everything about the incident would scream normal sheriff helicopter activity. There was just absolutely no sound at all, completly silent, and it seemed much lower than I normally observed local helicopters. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56286.html",
      "state": "FL",
      "duration": "5s-10s"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f5d",
      "summary": "Rotating Saucer Shaped Object with Multicolored Lights Flying Over Jacksonville",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2008-02-14T00:00:00",
      "story": "Rotating Saucer Shaped Object with Multicolored Lights Flying Over Jacksonville I have debated whether I should share this story or not, but this has bothered me for almost 31 years.  Although time has faded my memory of the exact date and time of this event.  I will attempt to re-account my sighting.  I was around 7 years old at them and it was in the evening perhaps in the spring/summer of 1976 and my parents, younger brother and I had stopped by a local McDonalds for a bite to eat.   We were eating inside our car in the parking lot when both my brother and I noticed a low flying rotating object flying over a strip mall across the street.  My parents dismissed it as an airplane or helicopter or something rationale, since Cecil Field was very close to this area,  but my brother and I were just fixated on this object!   The object was maybe 400-600 ft. up in the air as it flew over this strip mall moving from left to right in our field of vision.  The object was circular with multicolored lights (red, green, blue, etc.) around its edges, it rotated like a carousel with a slight tilt to the right and angled facing us so you could see it was circular.  I could see all the individual lights and the object itself rotating clockwise.  The object also had a single light on the top that illuminated a little bit of the surface around it.   We did not hear any noise that would suggest an airplane, helicopter or blimp.  We eventually lost sight of this object, but I was left very shaken and the event has remained etched in my mind ever since. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61331.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b609c",
      "summary": "Bright object appearing and dissapearing slowly.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2007-10-08T00:00:00",
      "story": "Bright object appearing and dissapearing slowly. Looking North East, in approximately the lower left corner of the cup of the Big Dipper, a round and very  bright object appeared, became larger and closer and then appeared to reverse direction slowly and dissapear. It was about 10 times larger than any other star or planet in the sky. The total duration of sighting was 15-20 seconds. Witnessed by 2 observers.",
      "link": "http://www.nuforc.org/webreports/058/S58494.html",
      "state": "OR",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6201",
      "summary": "We watched for 40 min.and there was a stationary ship with 2 red light docking ships. I tried to take pics but I haven't put them into",
      "city": "jacksonville",
      "shape": "",
      "date": "2008-03-04T00:00:00",
      "story": "We watched for 40 min.and there was a stationary ship with 2 red light docking ships. I tried to take pics but I haven't put them into my computer to review.  Myself, daughter and friend saw the same thing 20 plus years ago. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60389.html",
      "state": "OR",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b660a",
      "summary": "conformation by another",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2008-01-21T00:00:00",
      "story": "conformation by another Sighting Report Occurred : 11/10/2007 20:00 (Entered as : 11/10/2007 20:00) Reported: 11/11/2007 4:05:33 PM 16:05 Posted: 11/28/2007 Location: Jacksonville, FL Shape: Fireball Duration:3-5 Minutes Object entering southeastern Florida atmosphere at high velocity--NOT SPACE SHUTTLE  Leaving my home for a late evening bike ride I noticed an object several feet above the treeline entering our atmosphere in the southeastern sky.  I was confident that I was watching the space shuttle Discovery returning form it's mission. I watched as it streaked along the sky at a slow pace with what seemed to be sparks and embers trailing behind. It glowed orange and then red and back to a dark orange. After a few minutes it decended below the treeline where I could not see it. It also appeared to be losing its color. There were several aircraft that seemed to be in the vicinity so again I felt it was a normal shuttle landing.  I just read that the shuttle landed around 1:00pm versus this event that I witnessed around 8:00pm. I have contacted several news outlets that have also had recent calls regarding this strange object.  I have never seen something like this and wasn't unhinged about it until I found out it wasn't our space shuttle returning home.   saw the same thing looked like it stopped over the ocean then saw it take off right back the way it came at i very high rate of speed. my girlfriend watched it too ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60778.html",
      "state": "FL",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6647",
      "summary": "A triangle with bright white lights at each point and red flickering light in the middle. Lasted about 40min.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "A triangle with bright white lights at each point and red flickering light in the middle. Lasted about 40min. I looked out my window about 1:00am or so to the west of the city and saw an unusual white light with a red flickering light that was really low, to low to be a star. I thought it was a plane or helicopter, except it wasen't moving toward me or away from me. It did looked like it was slightly moving side to side a little but still staying in the same place. I thought maybe it was a meteror falling and waited for it to burn out as it came closer to the atmosphere. About 20 to 30 minutes went by and it still was not moving. I then went and got my binoculars to get a better look. As I focused on the light it was pretty wild, it was a triangle with a bright white light at each point and red was flickering in the middle. I watched this for about 10 minutes and still never moved. I went to put the binoculars up and as I came back it was gone. I was only gone for about 45 to 50 seconds. Now this is funny, I just went out to measure the time that I was gone and I looked out the window just now and there it is again. This time it's further away. I got my binoculars and could see it very clearly but it's now further away. I assume this is a star. It has white lights and the red light flickering in the middle. It's almost in the same spot as the other night. Just north of this light is another but to far to really tell. I hope I'm not crazy and sorry to waste your time if it is just a star. I'm not sure if I really believe in UFO's anyway, but it was and is pretty interesting.  Good luck,",
      "link": "http://www.nuforc.org/webreports/055/S55838.html",
      "state": "FL",
      "duration": "45min"
    },
    {
      "_id": "64d005f478aba2ec5a3b66ad",
      "summary": "While driving west on a major highway,JTB, just a few miles from the beach, a  green fireball wisked by really fast, going W-SW.  It wa",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2008-01-21T00:00:00",
      "story": "While driving west on a major highway,JTB, just a few miles from the beach, a  green fireball wisked by really fast, going W-SW.  It was about the height of a 8-10 story office building.",
      "link": "http://www.nuforc.org/webreports/060/S60964.html",
      "state": "FL",
      "duration": "10  - 15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6827",
      "summary": "Large wing shaped mother ship with over 80 small craft  formation",
      "city": "jacksonville",
      "shape": "other",
      "date": "2007-04-27T00:00:00",
      "story": "Large wing shaped mother ship with over 80 small craft  formation It was going on 9:30..im always looking in the sky at night and i finally seen what my wifes been talking about. This UFO appeared to be in space..it was very dim but very visible to the naked eye, it  appeared to be the mother ship for what was to come. The shape of the craft resembled that of a wing. It just lookied like a huge wing. judging by the distance it was at, i beileve this ufo was miles long. A 747 flys a 32,000 feet. This object was in space and completely dwarved what planes look like in the sky. It crossed the sky in about 15 seconds. Within an hour this ufo was seen twice. Also, with and without the \"mothership\" there were massive formations. They were in Formations resembeling the \"mothership\". there were about 8 different goose like formations each consisting of 8 to 9 craft. to creat one massive formation. The awesome part was. When it was directly above us in the clearest part of the sky, you can actually see individual craft drifting in and out of formation. these formations crossed the entire sky south to north within 15 seconds. FYI My wife and i are completely aware of what airplanes look like, what stars look like, and what satilites look like in orbit. This incident consited of none of the above. This happens every single night. several times a night. Something is going on in the NC skys. i HIGHLY SUGGEST A PROFESSIONAL COME AND CHECK THIS OUT!..like i said..it happens everysingle night. I am far to lazy to make a report everyday. THIS should be taken seriosly.",
      "link": "http://www.nuforc.org/webreports/055/S55709.html",
      "state": "NC",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b6bab",
      "summary": "SILENT LARGE HOOVERING PLANE",
      "city": "jacksonville",
      "shape": "",
      "date": "2008-06-12T00:00:00",
      "story": "SILENT LARGE HOOVERING PLANE I HAVE HAD MANY SIGHTINGS IN THE PAST 2 MONTHS. THIS WAS THE SECOND ONE THIS WEEK. LAST NIGHT IT WAS ON LANE AVE. SATURDAY AFTERNOON ON 118TH STREET. IT LOOKS LIKE A LARGE PLANE THAT HOOVERS AT TREE LEVEL AND IT IS SILENT. I TURNED MY CAR AROUND TO TAKE A PIC AND AND IT WAS GONE. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63706.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e50",
      "summary": "The triangle strikes again",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "The triangle strikes again I was sitting in my garage reading a book, when i felt the need to move out to the driveway to enjoy a smoke. Like any other time I smoke outside I gaze upon the night sky. This night would reveal something to me, and not the first time I have seen objects of unidentified origin moving in the sky.  I was looking at this one start in the western part of the sky when I seen a star shaped obect moving away from the star. At first I thought plane, but no blinking lights. What would further tell me it was not a plane is when 2 more lights kicked on and made a perfect equilateral triangle.  To ensure I was not seeing things I glaced elsewhere for about 10 seconds and returned to the object in question. To my amazement it was still there growing the distance between the star it originated from. After what seemed to be a minute the distance had grown extremly and the all 3 lights disappeared.  The lights were all white and in each corner of the equilateral triangle.I couls not make out anything else but the lights since it was so late but I could only guess the ship color had to be dark only because I felt like I was watching 3 stars move, but the fact they moved perfectly together with no change in distance from the other lights told me they were connected to a much bigger object.  I was not Fearful simply because if life does exist beyond ours i doubt with such amazing technology they would be coming to do harm to us. Truely an amazing sight.",
      "link": "http://www.nuforc.org/webreports/055/S55921.html",
      "state": "FL",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e59",
      "summary": "Object entering southeastern Florida atmosphere at high velocity- NOT SPACE SHUTTLE",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2007-11-28T00:00:00",
      "story": "Object entering southeastern Florida atmosphere at high velocity--NOT SPACE SHUTTLE Leaving my home for a late evening bike ride I noticed an object several feet above the treeline entering our atmosphere in the southeastern sky. I was confident that I was watching the space shuttle Discovery returning form it's mission. I watched as it streaked along the sky at a slow pace with what seemed to be sparks and embers trailing behind. It glowed orange and then red and back to a dark orange. After a few minutes it decended below the treeline where I could not see it. It also appeared to be losing its color. There were several aircraft that seemed to be in the vicinity so again I felt it was a normal shuttle landing. I just read that the shuttle landed around 1:00pm versus this event that I witnessed around 8:00pm. I have contacted several news outlets that have also had recent calls regarding this strange object. I have never seen something like this and wasn't unhinged about it until I found out it wasn't our space shuttle returning home. ((NUFORC Note:  The Space Shuttle had landed on November 05th, 2007.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59756.html",
      "state": "FL",
      "duration": "3-5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ecd",
      "summary": "Oval or round shaped object passed by during lunar eclipse, emitted neon blue light.",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2008-03-04T00:00:00",
      "story": "Oval or round shaped object passed by during lunar eclipse, emitted neon blue light. We were observing the lunar eclipse. Shortly after 2200, I saw an object that was round to oval in shape I am unsure if it was tilted if at all. It was not emitting any light at first but a faint reflection of light pollution making its shape apparent. I was facing east; it passed by at about 20-30 degrees above the horizon moving from south to north. I noticed it first coming into sight from the right behind a few trees. It was in plane sight for approximately 90-120 degrees, for 5- 10 seconds.  For the last 3 seconds of my observation, it was emitting a neon-blue light. There was no apparent source of the light, meaning no visible bulb or bulbs, it looked like it was projected off of the surface or the surface itself was emitting the light in sporadic pulse. Only parts of it were making light, not the whole object, it was not in unison or uniform. It was like an imitation of lightening or the reaction to some form of stimulation, comparable to bio-lumination. It stopped making the blue light just before it fell out of sight behind more trees. It did not slow, stop, accelerate, or alter course for the duration of my observation.   I am within 5 miles of a municipal airport, and within 10 miles of a naval station, that holds near constant helicopter operations, this was not a helicopter, I have military training in identifying and reporting surface and air “contacts” and identifying standard light configurations, I am very familiar with the helicopters I used to observe in the military and watch fly over the house every day and all hours of the night. It did not make a sound. I can only speculate the altitude of the object; it was low enough to reflect a very faint and dull light from urban lumination for the duration of my observation.",
      "link": "http://www.nuforc.org/webreports/061/S61753.html",
      "state": "FL",
      "duration": "5-10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ed0",
      "summary": "Two lights moving at very fast speed across sky in Jacksonville Florida during Lunar Eclipse.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Two lights moving at very fast speed across sky in Jacksonville Florida during Lunar Eclipse. Watching the Lunar Eclipse at approximately 10:55 PM on the 20th of February 2008 I was outside in my front yard where I had the lights off in a relatively dark area. I saw two lights as stars but a bit dimmer coming from North north east going South southwest. They were traveling to my best observation much lower than what you would see during the day when trails can be seen by an airplane and much faster. They were not blinking and moving very fast. Observation  from beginning to end would be approximately 7 to 8 seconds. There was no noise whatsoever, and the lights were not one right behind the other. They were at a distance of approximately 5 degrees and one behind the lead light was to the right offset to about 2 degrees. I immediately went online and called to give report and was instructed to give details here. I am 35 years old and an avid sky watcher for years and this is the first time in my life that I was prompted to call because I truly did not recognize this from anything I have ever witnessed before. Thank You..",
      "link": "http://www.nuforc.org/webreports/061/S61742.html",
      "state": "FL",
      "duration": "8-10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b72a9",
      "summary": "It was a V shapes craft with 7 dem lit lights. It looked like it was gliding and didnt make any noise. i saw it at about 10:30 pm and t",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "It was a V shapes craft with 7 dem lit lights. It looked like it was gliding and didnt make any noise. i saw it at about 10:30 pm and tryed to point it out to my friend but hes to much of a tard to look at where i was pointing i watched it for about 10 seconds till it went above a cloud and then vanished. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62408.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b730f",
      "summary": "Saw a triangle shaped object traverse sky on very clear night",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2007-02-24T00:00:00",
      "story": "Saw a triangle shaped object traverse sky on very clear night I am reporting this event for the first time, as I have not really considered researching any online articles or sites relating to this matter until now.  I am a professional who works in the medical field radiologic imagery (not X-ray).  This incident occurred when I was 14 years old. It may seem strange to describe the exact circumstances of my observation, but you have to see this through the eyes of a teenager.  I had a cassette player which was the type that your regular portable unit which was about the size of an elongated cigar box.  My parent's house was about 5 blocks from the ocean.  At night, the next door neighbor would come over and she would sit at the dinner table with my mom and talk for hours.  So, to play my music and get away from my surroundings, I would take refuge by easily ascending to the rooftop by clmbing a palm tree via the ac unit. One evening after dusk, 9pm, I was listening to music, not to loud on the rooftop, when suddenly, the tape stopped playing.  At first, I thought the batteries died, but I could see the rollers were still moving.  I fiddled with the volume wheel, but it was not that either.  Perplexed, I sat there for a minute thinkin that the tape was bad or my player was going bad.  I honestly do not remember why I looked up, but I did.  Then I just leaned back and stretched my arms behind my head.  I noticed something odd, but I could not figure out what I was seeing.  Something to the east and to the North was moving. I saw a dark triangular object that looked to me at the time like a black hang glider up in the clear star lit sky traveling from North to South at a speed of maybe 300 mph or more.  It was dead quiet and it was definitely up there.  No lights but it was so clear out, that I could see its shape.  Now, Ironically later in life, it seemed to me to look more like an F-117 stealth in its overall shape, but this was in 1983.  Whatever it was, it profoundly etched itself in my memory.  About 30 seconds after traversing the peripheral of my view,  the tape player started playing music again. It was playing the song as if it had missed the part where the track was silent.  Before this incident, and after, I never had any problems with the tape or the machine, until I got rid of the player a few years later. I do not claim to have seen a UFO or a secret military craft.  But what I saw defied any satisfactory explanation to this day. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55322.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b748f",
      "summary": "Bright light streaks across the sky",
      "city": "jacksonville",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Bright light streaks across the sky I'm not a believer of aliens, but this night really shook me. I was walking my dogs back home and when I got to the front porch, I happened to look at the sky and saw a bright light just streak across the sky and then go out.  The light looked light blue, but probably looked that color against the black sky.  It was very bright but did not light up the sky, more like a skylight would look or one of those white light flashlights. It lasted only seconds and streaked across the sky, so I knew it wasn't an airplane or helicopter.  I can't say what it looked like, since there was no real shape I could see in that short time frame.  It was just weird.   Believe me or not, I saw something and I can't even think what it could be",
      "link": "http://www.nuforc.org/webreports/054/S54664.html",
      "state": "FL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7498",
      "summary": "Silent Light passes from Southern to Northern Horizon",
      "city": "jacksonville",
      "shape": "diamond",
      "date": "2007-04-27T00:00:00",
      "story": "Silent Light passes from Southern to Northern Horizon I stepped out onto my western facing deck to smoke and let the dog go before turning in early for the night. It was clear and and unusually cold for April in Alabama so I urged the dog to hurry.  I noticed a steady white approaching quickly from due south at what to me seemed a low altitude. There were no flashing lights like I normally see on planes.  As the \"light\" flew directly over my head I was able to see 4 distinct points of white light forming a diamond shape but still saw nothing flashing.  I followed these lights to the northern horizon but never saw any flashing.   When the light was to my north I noticed a plane crossing east to west.  I could clearly see the flashing lights on the plane and could hear its engine even though it was at a higher altitude than the light.  After the light passed out of view on the northern horizon I noted that were 2 other planes in the air at the time (one to my south passing east to west and the other to my west headed south -both headed toward birmingham) Both of these had flashing lights. I could also hear the engine of the plane to my south as it passed. All 3 of the planes were in \"normal\" flight patterns  (where I expect to see air traffic)- the light was not.  In fact, I can never remember seeing any plane cross directly over our house like this thing did. The \"light\" passed from southern to northern horizon in less than a minute.",
      "link": "http://www.nuforc.org/webreports/056/S56159.html",
      "state": "AL",
      "duration": "45 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b7678",
      "summary": "Falling green object north of Jacksonville",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "Falling green object north of Jacksonville My wife and I witnessed a fairly large bright green object seeming to fall through the sky at a rapid rate.  We did not see an impact flash.   The object seemed to fall within a few miles of I-95, on the east side.",
      "link": "http://www.nuforc.org/webreports/054/S54776.html",
      "state": "FL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d89",
      "summary": "I was outside after coming back from a dance.  It was between 2:45am and 3:00am.  I was outside because it was said that Mercury, Mars,",
      "city": "jacksonville",
      "shape": "other",
      "date": "2006-12-14T00:00:00",
      "story": "I was outside after coming back from a dance.  It was between 2:45am and 3:00am.  I was outside because it was said that Mercury, Mars, and Jupiter were going to be so close together that the naked eye could see it.  So after searching the sky, I looked straight up and saw a falling star.  No more than 5 seconds later, an object moved across the sky, then dissapered.  It then immediately reappeared and disssapeared again.  The oject appeared pretty big, but made no noise.  I knew it was not a plane because a plane being that close would make alot of noise, but the object was quiet.  It was shaped like a triangle, but with one side carved in.  It was almost shaped like a stealth plane except this object had light around the edges of its sides.",
      "link": "http://www.nuforc.org/webreports/053/S53910.html",
      "state": "FL",
      "duration": "5 to 10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b815c",
      "summary": "round metallic object with three white lights hovering at tree top level made no noise left at high rate of speed",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "round metallic object with three white lights hovering at tree top level made no noise left at high rate of speed Dark had recently fallen. My mother and I had to run an errand. Leaving our driveway, we turned south onto Main street. We noticed a round metallic object hovering just above the pine trees.  We were directly under the object hovering above Frazier Mill works in Hollyford area. It had three white lights forming a triangle and made no noise. We continued traveling south slowly as I watched the object it turned into a ball of light and moved at a high rate of speed off to the east. When we returned home about 30 minutes later, military helicopters were flying all around the area .  I have never reported the incident until now. ((NUFORC Note:  Witness indicates that date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67523.html",
      "state": "FL",
      "duration": "1min 30secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b8288",
      "summary": "A rectangle shape object like a cigar box (maybe three times the size) touched down in my back yard.  ((NUFORC Note:  Hoax??  PD))",
      "city": "jacksonville",
      "shape": "rectangle",
      "date": "2009-01-10T00:00:00",
      "story": "A rectangle shape object like a cigar box (maybe three times the size) touched down in my back yard one night about 1 or 2 am.  My (then wife) wife and I watched it for over 2 hours through the bathroom window; it was near the privacy fence of a neighbor but on our side.  It had lights of un- imaginable colors that were going crazy at first when it touched down.  It started running the lights in some kind of sequence and then another.  I was not scared but rather kind of calm as if I knew what they were doing.  They have the ability to increase and reduce their craft shape and they use lights to repair things.  When it ran the last sequence of lights it seems to click in place and it disappeared.  The next day there were no signs in the yard where it was of any kind. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  Possible hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67451.html",
      "state": "FL",
      "duration": "2hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b83ce",
      "summary": "NAS plane with bright red and blue lights around it followed by a bright white ball of light.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "NAS plane with bright red and blue lights around it followed by a bright white ball of light. I live in a townhome community in Mandarin. We have NAS planes fly over our homes many times a day. My 10 y/o daughter and I were in our parking lot looking at the stars. You could hear a military plane approching. It appeared across the parking lot flying very very low and slow for that time of night. If we were not familiar with these planes and it was not so low, I would not have figured out it was one. The plane had red and blue lights going all around it in a circle kind of blinking on an off as they went around. I could see the actual military plane, as it was so close. Following behind it, about 50 yards, was a very big bright white ball of light. I looked back to the plane to see how it was \"pulling it\" but I didn't see anything. The plane went over my building and the bright white light followed. We couldn't see it any more as our building was in the way. We never hear any sound other than the plane. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67135.html",
      "state": "FL",
      "duration": "10 secounds"
    },
    {
      "_id": "64d005f478aba2ec5a3b85ae",
      "summary": "Formation of 9 orange lights",
      "city": "jacksonville",
      "shape": "formation",
      "date": "2009-12-12T00:00:00",
      "story": "Formation of 9 orange lights I saw 9 orange lights around 10pm in a V formation flying east very quickly.  Normally I would say it was a flock of geese but they were too high and flying too quickly to be geese.",
      "link": "http://www.nuforc.org/webreports/072/S72501.html",
      "state": "FL",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b87fc",
      "summary": "I was sitting in my p/u in the Piney Green shopping center.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "I was sitting in my p/u in the Piney Green shopping center. Appeared in sky south of city at approx 25000 ft altitude and in a cloudless sky. It was of a shiny silver color. It appeared for about 5 to 10 seconds and then completely disappeared.",
      "link": "http://www.nuforc.org/webreports/068/S68876.html",
      "state": "NC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b888a",
      "summary": "Object moving above cloud line in Jacksonville, FL Oct 2, 2009 at 10:30 am",
      "city": "jacksonville",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Object moving above cloud line in Jacksonville, FL Oct 2, 2009 at 10:30 am I was driving south on I-295 between San Jose Blvd and St. Augustine Road when I noticed above the cloud line in the distance a thin line moving South just above the clouds then it completely vanished, quickly. The object was not leaving a visible jet wash like the plane I saw at the same time was. This morning had some clouds appearing to be linear towards the East with very blue skies above the clouds on the horizon.  It could be nothing but it caught my attention!!",
      "link": "http://www.nuforc.org/webreports/072/S72699.html",
      "state": "FL",
      "duration": "Couple of Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b92ea",
      "summary": "It was a hugh bright bluish-greenish object traveling the tree line from east to west.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2008-10-31T00:00:00",
      "story": "It was a hugh bright bluish-greenish object traveling the tree line from east to west. I live in NE Florida.  My neighborhood is by the river, and is known for it's big, mature trees.   My lot faces the northeast, so when I went out back Wednesday night, 9/24/08, around 10:30 PM, I was looking up into the southwestern sky.  The view is surrounded by tree tops.  It was a clear night, and I could see stars.   The object came into my view as fast as it left.  I was able to watch until it disappeared behind some trees, approximately 7 seconds.  It looked like the pictures you see of meteors going across the sky, except this was at tree level, about the size of an average house in prospective to the trees, and was silent.  It was bright bluish-greenish in the front and red in the back, traveling from east to west.   I waited there in astonishment, waiting to hear a crash.  I was unraveled and ran inside to call our local TV station to report it. The next day, as I was explaining it to my neighbor, his teenage son saw it too!  He works around the corner from our home, and saw it from the window at his work place. He thought it was going down on the gas station across the street from him.  He didn't hear it either.  We are just wandering if anything was reported or if anyone else seen it too.",
      "link": "http://www.nuforc.org/webreports/065/S65907.html",
      "state": "FL",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b99f8",
      "summary": "Blueish/Green Flash around 2 am over Jacksonville",
      "city": "jacksonville",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Blueish/Green Flash around 2 am over Jacksonville On July 17 at aprox. 2 am me and 1 other saw in the western sky over Jacksonville, Fl. an extremly bright blueish/green light that illuminated the entire sky as far as my vison could see to the right and left for aprox 2-3 secs.  At first I thought I was having a Phenomanon moment as say \"Oh no, not a tumor\" but 1 other person saw it as well, it happened 2 times within 30 seconds of each other and never happened again. Can anyone else confim this event, yes there is a military base right in the area, however I was on the base and the event occured beyond the tree line of the base as I could see the silouette of the trees.",
      "link": "http://www.nuforc.org/webreports/064/S64615.html",
      "state": "FL",
      "duration": "2-5 secs  twice"
    },
    {
      "_id": "64d005f478aba2ec5a3b9aca",
      "summary": "It is diamond in shape with 12 or more bright lights on the bottom of the object.",
      "city": "jacksonville",
      "shape": "diamond",
      "date": "2010-06-23T00:00:00",
      "story": "It is diamond in shape with 12 or more bright lights on the bottom of the object There is a ufo near our home, 5 miles from the Naval Base, in Jax, Fl   It is not as high as airplanes.  My husband thinks maybe it might be a satellite and sun is shining on the object.  I think since the design and the many lights (12 or more), seems to me to be a U F O.",
      "link": "http://www.nuforc.org/webreports/075/S75783.html",
      "state": "FL",
      "duration": "still going on"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e3b",
      "summary": "Triangle UFO chased by osprees",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2010-06-10T00:00:00",
      "story": "Triangle UFO chased by osprees I was sitting in my car and saw a sphere just above the canopy of the trees.  The ball was gold and hung in the air.  It was coming towards my car but hovering as if it had seen me.  My street is a culdisac, I drove straight and drove through to the other end of the street.   The sphere was gone but directly in front of me I saw a triangle, at each point of the triangle was different balls of light.  One light was red.  The triangle tilted sideways and nose dived quickly into the woods.   I parked in my driveway and told my husband.  I went back outside and called a friend of mine who has interest in aliens as I was telling him I saw another light in the same area as the first light was.  I thought it was the ufo again and called my husband outside.   He said it was an ospree (military aircraft) 2 flew over head towards the direction of the ufo.  I think the ufo either landed or crashed.   I heard no noise from the ufo AT ALL but I did hear the noise of the planes I can tell the difference.  I think they were chasing it.   I want to know if anyone else has seen the type of ufo I have seen.",
      "link": "http://www.nuforc.org/webreports/075/S75670.html",
      "state": "NC",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f9a",
      "summary": "SILENT TRIANGLE SPARKLING LIGHTS INVISBLE CENTER.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2010-05-12T00:00:00",
      "story": "SILENT TRIANGLE SPARKLING LIGHTS INVISBLE CENTER. SPARKLING LIGHT, LOOKED LIKE WHITE CHRISTMAS TREE BULB FROM A LONG DISTANCE. THE OBJECT WAS IN THE WESTERN SKY MOVING VERY SLOWLY IN A WESTERLY DIRECTION. IT WAS MOVING SO SLOWLY THAT AT FIRST GLANCE IT DID NOT APPEAR TO BE MOVING, BUT AS WE NOTICED IT AGAIN IT HAD MOVED JUST SLIGHTLY. IT HAS TAKEN OVER 2 HOURS FOR IT TO CROSS THE SKY BEHIND THE TREES. THERE WAS NO SOUND, NO JET SPRAYS, NO WINGS. IT WAS SHAPED LIKE A TRIANGLE AND HAD 3 LIGHTS (ONE ON EACH TIP)- THE CENTER WAS CLEAR OR NOT VISIBLE TO US. WE ARE THREE ADULTS WHO WATCHED IT MOVE VERY SLOWLY ACROSS THE SKY FROM THE  FRONT PORCH OUT IN RUAL AREA ON THE WEST SIDE OF TOWN WELL AWAY FROM MAIN TRAFFIC OR A LOT OF LIGHTS.",
      "link": "http://www.nuforc.org/webreports/075/S75327.html",
      "state": "FL",
      "duration": "2 1/2 hrs."
    },
    {
      "_id": "64d005f478aba2ec5a3ba386",
      "summary": "two lights flashing in unison very odd to see. very high in sky, in between horizon and directly over head. they flashed and moved off",
      "city": "jacksonville",
      "shape": "flash",
      "date": "2009-08-27T00:00:00",
      "story": "two lights flashing in unison very odd to see. very high in sky, in between horizon and directly over head. they flashed and moved off together. they were about 1/2 mile from each other.then one vanished and then 30 seconds later the other was gone. the sky was clear. the lights were white.there were no aircraft in the sky at the time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71817.html",
      "state": "FL",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba34d",
      "summary": "Boomerang object with no sound seen in night sky",
      "city": "jacksonville",
      "shape": "chevron",
      "date": "2009-01-10T00:00:00",
      "story": "Boomerang object with no sound seen in night sky On 29 Dec 08 at about 20:05, I’ve noticed a brownish / tan object in the northeast night sky just above the tree tops.  The object at first was distorted but came into focus as it moved from the northeast to southwest.   As the object moved over my head, I noticed that it was in a shape of a boomerang with a light gray to dark silver color disc in the center.  The rest of the object was a light brown/tan.   As the object moved over head, there was no sound and it disappeared out of sight.   The object did not have an appearance of any military aircraft that I have seen.    I’ve called Marine Corps Air Station, New River to see if they seen anything on their radar and I was told no and was advised to call the County Sheriffs Office to see if any one reported seeing a UFO.  Again I was told no.",
      "link": "http://www.nuforc.org/webreports/067/S67726.html",
      "state": "NC",
      "duration": "30 - 45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba4d7",
      "summary": "UFO seen over St Johns River",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2008-07-05T00:00:00",
      "story": "UFO seen over St Johns River I was standing on a dock on the St Johns river watching an approaching thunderstorm when I noticed a shadow against the clouds.  As it moved a little closer I could just make out the shape of a triangle or possibly a diamond shaped object.  The object was solid black and about 100 feet long moving very slowly heading south towards downtown Jacksonville.  It was completly silent and I guess about 80 feet off of the ground.  It was probally a quarter mile from my location.  I could also make out a couple small dim white lights that seemed to be on the edges.  At one point it looked like it momentarily turned on some sort of spotlight for a few seconds and shined it on a large ship docked at the port.  It freaked me out and I could not believe what I was seeing.  I watched for about a minute then ran inside to get my wife.  When I came back outside it had started to rain and I could no longer see the object.  This is the first time I have ever seen anything like this.  I don't want to tell anyone because they might think I'm a nut case.  My wife gave me this funny look.  All I could do was stand there with my knees shaking.  I actually had trouble sleeping thinking about what I had seen.  Very strange and creepy. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63982.html",
      "state": "FL",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba52d",
      "summary": "Bright white light seen over jacksonville, moving in odd directions and fading until unseen.",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "Bright white light seen over jacksonville, moving in odd directions and fading until unseen.",
      "link": "http://www.nuforc.org/webreports/066/S66353.html",
      "state": "NC",
      "duration": "almost 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6a5",
      "summary": "Bright fireball looked like a second sun hid behind cloud never came in front of it,it wasyellow/orange",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2008-07-05T00:00:00",
      "story": "Bright fireball looked like a second sun hid behind cloud never came in front of it,it wasyellow/orange Saturday June 21,2008  My wife and I were traveling on route 95 north just shy of the Jacksonville International Airport (JAX Florida) exit . At approximately 7:30 pm my wife said look over there at the sky keep in mind the sun is over in the other direction completely visible.  And what I saw was a thin white fluffy cloud with if I didn’t know better another sun behind it glowing brightly yellow .  It was extremely bright and you couldn’t stare at it just like you can not stare at the sun. The cloud  was only covering the center .. I have no idea what this was. My wife and I both saw it until we got off the highway and weren’t facing it anymore about 5 minutes.  It was at about 10 o’clock  high and the real sun was at 2 o’clock and visible. This thing was huge as large as the sun or larger ..",
      "link": "http://www.nuforc.org/webreports/064/S64093.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba957",
      "summary": "i'm 26 and havn't graduated college yet or don't  really care too since all that stuff started happening.   i went to a prestigious ar",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "i'm 26 and havn't graduated college yet or don't  really care too since all that stuff started happening.   i went to a prestigious art school program in highschool, douglas anderson school of the arts. i've never been into hard drugs and in the past 3 or 4 years i've hated weed, and i never smoked it a lot. i don't drink except for maybe once every couple months or so.  i'm Christian and i'm planning on being baptised catholic.   i know this is getting way out there, but i have very famous connections.  i can be reached via email at   mccormick.rob@gmail.com  me and about 30 or 40 other people saw the same fireball looking things as the gentlemen from  Annapolis, MD.  It was mostly people from my high school. These fireballs (or whatever they were) seemed a little more spaced apart, maybe about 5 seconds apart. There were three.  I could probably find about half the people to testify... it was an outdoor concert during this coffeeshop's last day open.  we're all early to late 20's  except for the owner, who i think saw them too, who i could contact, she lives in manhatten now.   we're located in jacksonville, fl and they were travelling south.  most of us, except the owner, are in the early to late twenties... i was stupid not to  call the news. it happened about 2 maybe 2 1/2 years ago.  and i was the only cool person there - based on a personal observation.   i bet somebody got it on their camera phone. http://maps.google.com/maps?hl=en&rlz=1C1DVZA_enUS346US347&um=1&ie=UTF-8&q=uncommon+grounds+coffee+shop+jacksonville+fl&fb=1&gl=us&hq=uncommon+grounds+coffee+shop&hnear=Jacksonville,+FL&cid=0,0,2456018304246050171&ei=zCuNTKP4CsTflgfwsbVi&sa=X&oi=local_result&ct=image&resnum=1&ved=0CBYQnwIwAAA   all of use were standing in that parking lot to the right while watching an indi rock band play...  it was travelling south, a little south east but directly at 0y...  here's some addiction stuff that probably doesn't matter. i was driving down 3rd st N a1a N  (map at bottom), at jax beach, and saw the same style \"ufo\" as my grandma and her neighbor saw in the 70's... football shaped. but hers moved by quickly,  mine flashed in an out and i was like... oh hey did you see that?  girlfriend was looking at her cell phone or something.   this is the crazy part that no-body will believe probably, but i've been abducted while paralyzed at least 15 times in the past year since i've seen it... and just the other night, while laying down, i saw an object flash in front of... it was black and seemed to be alive, but definately technology.  it was sweet looking... way cooler than any science fiction i've ever seen.  since my friend experience though, i've been able to remote view more often.  i just figured out that's really what it actually is. http://maps.google.com/maps?hl=en&rlz=1C1DVZA_enUS346US347&um=1&ie=UTF-8&q=uncommon+grounds+coffee+shop+jacksonville+fl&fb=1&gl=us&hq=uncommon+grounds+coffee+shop&hnear=Jacksonville,+FL&cid=0,0,2456018304246050171&ei=zCuNTKP4CsTflgfwsbVi&sa=X&oi=local_result&ct=image&resnum=1&ved=0CBYQnwIwAA",
      "link": "http://www.nuforc.org/webreports/077/S77783.html",
      "state": "FL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba965",
      "summary": "3 dimensional diamont craft ,in front yard,quarter mile from University of jacksonville FL.",
      "city": "jacksonville",
      "shape": "diamond",
      "date": "2010-11-21T00:00:00",
      "story": "3 dimensional diamont craft ,in front yard,quarter mile from University of jacksonville FL. At the night of 12/08/2008 a friend and I were sitting outside my home talking when what looked like a shooting star coming through the atmosphere shot towards us,and stopped aprox 15\"feet\" above our heads,and just hovered still in one spot. The shape of the craft was a 3 dimensional diamont,with from  dim grey to bright white pulsating orbs on each corner and tips of the craft. Each time the orbs dimmed we could observe a purple/grey surface,with odd almost hyroglyphic carvings on the object. The aprox. size of the craft,probably just 4\"feet in hight,and about 3,5\"feet in diameter.(in my opinion,I don't believe it to be a manned craft,but rather a type of probe) It was giving of an almost silent humm. After about 2 minutes of shock,I opened my frondoor and called my 2 roommates,to come outside.  As they came outside,the object started to hover across the street at 5-10 mph,then stopped above the houses across from us,stood still for another 30 secs.to 1 minute,then shot of back into the cloud cover.",
      "link": "http://www.nuforc.org/webreports/077/S77561.html",
      "state": "FL",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba90f",
      "summary": "Three gold circle UFOs fly in formation, warp drive away and disappear.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "Three gold circle UFOs fly in formation, warp drive away and disappear. Was driving north when I noticed a large gold circle about the size of the moon fairly high in the sky. It was moving back and forth from south to north, north to south.  I turned into the driveway of my home and continued watching it. After a short time two more circle shaped lights came out from each side of the first one looking like they might have come from within or perhaps from behind it. The three lights commenced doing a formation moving in slow patterns. Then they shot away as if in warp drive one after the other the northern most shooting first to the north, then the middle and south most following it disappearing suddenly almost right after. The incident lasted around five minutes.  A day or two after it was reported in the paper that others had seen a UFO in a nearby town that same night, unfortunately I can’t remember the date or time of the incident since it was way back in the eighties and I am a non-linear person. It was probably between 7 to nine pm and it seems like it was fall weather. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78117.html",
      "state": "IL",
      "duration": "five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba99c",
      "summary": "Oval white light with no navigational lights travelling to the northeast.",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "Oval white light with no navigational lights travelling to the northeast. While working outside, I looked up at the stars to the southwest and noticed an oval white light that I thought to be a landing light of an aircraft coming towards me.  The light was moving faster than what I thought it should be and also observed that there were no navigational lights that an aircraft would be flashing (green for right and red for left). The light continued to the northeast with no sound until I saw an obvious aircraft with navigational lights travelling to the northwest. he light stopped as if it was at a traffic light and as soon as the obvious aircraft passed, the light continued on it's northeastern path. I thought that was pretty strange and approx. a half hour or 45 minutes later while walking back to the office, something was biting the left side of my neck. Thinking it was a bug of sometype, I tried squishing it on my neck but the intense biting sensation continued.  Thinking it was a bug bite of sometype, I ignored the painful bite for a couple of days until I saw a nurse who worked at the same place I do.  I asked her to look at this painful bug bite for me on my neck and upon looking at it, she informed me that it was a burn and not a bite.  She said the burn was a triangular shape. A day or two later, I had my son take a picture of the triangular burn and upon relating what happened and expecting him to laugh at me, he immediately went to the computer and pulled up a very similar triangular mark on a male allegedly made by aliens when he was abducted. While I wasn't abducted, the uncanny similiarity of the two triangular marks, both appearing like arrowheads, leads me to be suspicious of what I really saw that night. It was a clear night, no clouds, stars could easily be seen, and there were no fires or any other instruments/equipment near me that could have burned me in such a manner.  I still have the scar on my neck as well as the pictures of the burn.",
      "link": "http://www.nuforc.org/webreports/078/S78143.html",
      "state": "IL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bae38",
      "summary": "streak of light low to ground caught on game camera",
      "city": "jacksonville",
      "shape": "flash",
      "date": "2011-01-05T00:00:00",
      "story": "streak of light low to ground caught on game camera Captured 2 videos on game camera of this flash of light. These videos were taken in a remote area of East Texas near a creek that is very active with wildlife. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79167.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baf79",
      "summary": "Large, silent, triangles in Jacksonville, FL",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2011-03-10T00:00:00",
      "story": "Large, silent, triangles in Jacksonville, FL I saw something strange in the sky once but I'm an idiot so I didnt write the date down.  However, I'm certian it was on a day between Feb. 10 and Apr 5, 2008.  I will describe the best I can.... I was in Jacksonville, Fl on the campus of Jacsonville U.  I saw a silent, dark, triangular object cruising at an altitude of no more than 1,000 ft and the length of each side appeard to be approx. 160 feet, give or take 20 ft.  I clocked it at bout 75-100 mph and was standing almost directly underneath its flight path (it was about 120 ft off to my left side) and there was a circular white light near each corner of the triangle (8-15 in diameter?). It was also headed North.  I didn't make a big deal about it to my friends cause theres no point and it's honestly not that shocking to me.  But it was awesome b/c that technology seemed eithr a good many evolutions ahead of the current stuff on the mass market or it was alien.  Either way ! O SHITson!!  I promise this is the truth, this is the first and only time I've seen anything like it 24 years and I was sober and on no meds, know what I mean. sincerely, ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80358.html",
      "state": "FL",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0f3",
      "summary": "Bright meteor-like object falling from upper left sky to lower right quickly changed directions and disappeared over the horizon",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2011-03-10T00:00:00",
      "story": "Bright meteor-like object falling from upper left sky to lower right quickly changed directions and disappeared over the horizon Sighting occurred in the NE area of Jacksonville, FL about ¼ mile SE of intersection of Yellow Bluff Rd and Starratt Rd while looking directly NE towards Amelia Island thru a large picture window in my house, and at about a 60 degree angle from horizon. One object appearing like an orange and yellowish round fireball, or meteor-like, started rapidly falling from upper left portion of window (about 10 o’clock on a watch dial) towards the lower right of the window (or about 4 o’clock).  After dropping to about 20 degrees off of the horizon to the lower right of my window, the object very quickly changed direction and shot off slightly to the right and away and disappeared over the horizon in kind of a bow shaped pattern following the contour of the earth at about 20 to 30 degrees. I would estimate the distance to the object was initially several miles from my viewing location, and was 15 to 20 miles away before disappearing over the horizon.  It initially appeared about the size of a golf ball from my vantage point, but was very small when it shot off and away to the right.  Total viewing time was a matter of a few seconds.  My wife was with me, but her back was facing the object when it appeared, and object was out of sight before she could turn to take a look at it. Event occurred the same night as the last launch of the Space Shuttle Discovery from Kennedy Space Center.  I have lived near Naval Air Stations in San Diego, and now Jacksonville, FL, and have observed numerous military aircraft, but have never seen an object like this, and seen it move and change directions so quickly.",
      "link": "http://www.nuforc.org/webreports/080/S80396.html",
      "state": "FL",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0f5",
      "summary": "We were outside i step to the side by myself to look at the stars and i seen a triangular shaped object with bright white lights... ive",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2011-03-10T00:00:00",
      "story": "We were outside i step to the side by myself to look at the stars and i seen a triangular shaped object with bright white lights... ive been in the airforce and seen strange things but this was so strange the shear size of it was unbelievable and the speed was uncomperhendable.  I was very excited and called the other four witnesses over to see.  It flew southward and made a sharp lef turn and dissappered into the heavens.  i knew the speed had to be incredible, once it disappeared we witnessed a military jet tring to trail behind but it couldn't catch up.",
      "link": "http://www.nuforc.org/webreports/080/S80275.html",
      "state": "FL",
      "duration": "1- 2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1f8",
      "summary": "Ball of orange light shot into outer space and came back",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2011-04-03T00:00:00",
      "story": "Ball of orange light shot into outer space and came back Stepped put for a smoke and we saw this orange ball of light rise straight up from about 2 miles away and it shot strait up at a increasingly fast rate until it was in outerspace and then it came back down and shot by us and there were airplanes in the sky so we saw the clear difference and no sound at all filmed it on my iPhone but u can't see anything I just tried in case we could enhance it somehow ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80607.html",
      "state": "FL",
      "duration": "1min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb427",
      "summary": "Comet-like UFO. Major air surveilance at time of sighting. Two seperate crafts sighted.",
      "city": "jacksonville",
      "shape": "other",
      "date": "2011-03-10T00:00:00",
      "story": "Comet-like UFO. Major air surveilance at time of sighting. Two seperate crafts sighted. Thank You for your time. Please excuse this for its minor length. I saw two objects. The first object was heading north bound, actually flying across the little dipper constellation. The second object appeared immediately to the north when the first object flew over the tree line. The sky was clear and bright with stars. A few miles down my road is Historic Camp Milton. I looked on Google Earth a few months back and saw that they have an air strip. It is not uncommon to see helicopters flying a perimeter around the base.  So, I assume the base is active.  But there isn’t much plane activity going in an out of Camp Milton. On March 6, 2011, at roughly 4:00 p.m., I was alarmed to hear low flying planes, so I went outside to have a look. I saw two radar planes, flying at least a mile apart, circling a huge perimeter around Camp Milton within 200 ft from tree level. I also noticed various planes at various clearances moving at various speeds, with the fastest I guessed was moving at around Mach 2. They were peppering the sky with activity. The spectacle of seeing so many planes in the air, with a lot of them moving in formation, was enough to be in awe over, or at least enough to make me question.  It also gave me a lot of things to compare my sightings to. So, I did question. I figured they were looking for something, so I kept looking up, hoping to maybe catch a glimpse of what they were searching for. These radar planes were circling for hours. At around 9 p.m. after checking the scene out a few times, I just stared up in no general area thinking something would catch my eye. That’s when I saw the first UFO. This sighting lasted 3-5 minutes. It caught my attention much as a shooting star would, but it was moving much slower. Light put off was a constant when it was visible, but would fade in and out, much like a comet, but the trail lasted longer. The craft was still moving at a fantastic rate for its altitude. It looked as if it were among the stars. When it would appear, it would be further than I had saw it, but its position did not make sense in relation to its speed. It never blipped or blinked, only faded in and out in no apparent pattern. It took anywhere from 3 seconds to 10 seconds to reappear. Each time it appeared, it looked like a shooting star. I know it wasn’t a meteor shower, because it kept a path. It was a yellowish light that had a haze to it, not a definite shimmer as a distant light might have within our atmosphere. It moved directly north, but after a few appearances, I lost it for around 10 seconds only to see it reappear, heading directly east and over th! e tree line. I was astonished, but saddened that I couldn’t watch it for long. That’s when a bright light caught my eye to the north. This sighting lasted around 10 seconds. The light from this UFO was blue, much like the new types of headlights for automobiles. It appeared and descended a little past Camp Milton, maybe a couple of miles above the tree line, which is within 8 miles from my house. The light was huge. I thought it was a helicopter, but it was moving much faster. The light had an aura, much like any flashlight shined in your eye, then it seemed to dim to as faint as a distant star, never blinking; remaining constant. It curved down, then flew off in a 45 degree angle, away from the horizon, until I could see the light no more. This sighting happened within 10 seconds, so I guessed that this craft was moving at a stellar rate of speed. There were no clouds in the sky at the time, so I was able to see it fade to nothing as it seemed to ascend into the sky. Both sightings combined happened within minutes. I stayed outside and kept watch. I noticed one other thing, which was a blip of light around Orion’s belt, which I dismissed.. But then I saw that blip in the same spot. I could hear the planes circling on until midnight. I went outside for a late cigarette around 1 in the morning and there were NO PLANES IN THE SKY. I sat there for a while to try and see another plane, but there were none to be seen for my duration of looking at the sky. A thick fog rolled in around 3 in the morning. My rational explanation for the first sighting would be that it was a stealth plane. I may have saw its propulsion. I know they move at incredible speeds.  But, for the other, I have no guess. It was amazing.",
      "link": "http://www.nuforc.org/webreports/080/S80380.html",
      "state": "FL",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb47e",
      "summary": "I was flying at 45 thousand feet in a Lear Jet when I sat back in the seat and looked up into the sky and saw a bright star like object",
      "city": "jacksonville",
      "shape": "light",
      "date": "2011-02-08T00:00:00",
      "story": "I was flying at 45 thousand feet in a Lear Jet when I sat back in the seat and looked up into the sky and saw a bright star like object.  It was motionless and I considered it some type of stationary satelite.I called up to the pilots and they also saw it.   We then notified Jax Center to see if they could see it. They made a joke of it and discounted our observation. I continued to watch the light until the end of our flight and in our car until we reached our house on the ocean at Ponte Vedra Beach.   Both Pilots and I then continued our observation from my driveway.  I estimated its height at least 100,000 feet.   After another 10 minutes or so the light flashed from one quandrant of the sky to another.  A viewing angle of at least 30 degrees.   It stayed at this location for only ten seconds and then disappeared to the west in an instant.   That was all we observed.  Thank you. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79961.html",
      "state": "FL",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4eb",
      "summary": "bright white light flashed across sky for quick second, possibly meteor, or military affiliated",
      "city": "jacksonville",
      "shape": "",
      "date": "2011-02-18T00:00:00",
      "story": "bright white light flashed across sky for quick second, possibly meteor, or military affiliated",
      "link": "http://www.nuforc.org/webreports/080/S80036.html",
      "state": "NC",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb572",
      "summary": "Since I'm a hunter (waterfowl) when I was what looked like snow geese circling I started to watch close. The sighting was about 1/2 mil",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2011-02-18T00:00:00",
      "story": "Since I'm a hunter (waterfowl) when I was what looked like snow geese circling I started to watch close. The sighting was about 1/2 mile east of my home and looked to be approx 500 ft above the ground.  After about 10 seconds I realized what I was not looking at birds. The objects appeared to be relatively small (5-10 feet) white in color with a V-ish shape. The objects seemed to be playfully flying about with one another.  After about 25 seconds 7 of the objects formed a neat triangular formation and flew due east and almost instantly and disappeared.   One object hovered to the left of the triangular formation and with a few seconds one of the objects in the formation flew directly across the sky towards the hovering object in a straight line and both vanished.",
      "link": "http://www.nuforc.org/webreports/080/S80081.html",
      "state": "MD",
      "duration": "40 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5a3",
      "summary": "A meteor like object falling from the sky with a smoke trail that stops instantly and appears to be a green light hovering then gone.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2011-02-08T00:00:00",
      "story": "A meteor like object falling from the sky with a smoke trail that stops instantly and appears to be a green light hovering then gone. It was 9:45pm on 1/31/2011 as I was driving down Philips hwy when I looked up at the sky and noticed a meteor looking object falling from the sky with a small smoke trail, maybe coming from engines but then it stopped almost instantly and there was no more smoke or fire, just a faint shining green light hovering in the sky, and a second later it took off again this time with no smoke or trail, it just zoomed out like it went into warp speed and disappeared.",
      "link": "http://www.nuforc.org/webreports/079/S79897.html",
      "state": "FL",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb649",
      "summary": "2 orange balls traveling over Jacksonville Florida",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2011-01-05T00:00:00",
      "story": "2 orange balls traveling over Jacksonville Florida I saw 2 orange circles traveling from South to North.  I live southeast of Jacksonville by 10 miles, and their path was west of me by approximately 1-2 miles.  They travelled approximately 10 miles from south to north during my observation.  They were not at exactly the same altitude but were fairly close.  They had no blinking lights and made no sound.  They looked almost like you would expect after-burners to look on a jet fighter, but there was no sound at all.  The size of the light was too big to come from an airplane, and the speed at which they traveled was too fast for a helicopter.  I’m not sure what these were, but they looked very similar to those I found on youtube videos when I searched for “Orange UFO”. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79445.html",
      "state": "FL",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb7d5",
      "summary": "Bright Light Southwest of Jacksonville, AR",
      "city": "jacksonville",
      "shape": "light",
      "date": "2010-08-30T00:00:00",
      "story": "Bright Light Southwest of Jacksonville,  AR Saw a bright light through the trees that has never been there before. While watching the object which was a very bright, white light, I could see it was making up and down moves.  I went in and got my binoculars while my neighbor watched it. We watched with the binoculars and could definitely see it moving downwards.  My neighbor noticed two other set of lights at the 10 O'Clock and 2 O'Clock positions above it.   The other two lights were red and green in color. While watching the bright light through the binoculars, it went from a single light to 5 lights in a pentagon shape, and then it went back to a solid light.   We watched it for about 30 minutes until it went below the tree line.  I live very near the Little Rock AFB, and the bright light was in the southwest of my house in the direction of the far end of the runway.  When the bright light dipped below the tree line, I could still see the two green and red object at the exact 10 and 2 positions above w! here the bright light dipped below the tree line.   Coincidentally, two C-130 aircraft flew in after the bright light dipped below the tree line. They were flying in the direction of the bright light, and then they did a U-turn over the base and flew in the opposite direction of the light.  Coincidence??  No C-130s in the area while the bright light was glowing.  I tried to take a photo, but couldn't focus on it with the digital camera. I got one blurry photo.",
      "link": "http://www.nuforc.org/webreports/077/S77459.html",
      "state": "AR",
      "duration": "30 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb8ed",
      "summary": "Single golden diamond shaped object, very fast.",
      "city": "jacksonville",
      "shape": "diamond",
      "date": "2010-07-19T00:00:00",
      "story": "Single golden diamond shaped object, very fast. 1 multi-tiered diamond shaped object flew over my house at 12:10 in the morning.  I noticed it outside my window as it flew from the south heading directly north. The object was very fast and had a gold haze around it.   Weather was clear at the time and me and my mom both watched the object for about 3 minutes before we completely lost sight of it. I immediately began looking for a way to report the sighting once I could sort my thoughts.  The experience was very frightening and even caused me to lose my breath for awhile. I do not wear glasses but my mom does, we both clearly saw the object as it passed by very close, she was wearing her glasses at the time as she had just got home from work. ((NUFORC Note:  Date is flawed.  We have asked the source of the report to provide the correct date.  Correct date may be July 12, we believe, and we have altered the original date, to reflect that possibility.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76520.html",
      "state": "OR",
      "duration": "0:13"
    },
    {
      "_id": "64d005f478aba2ec5a3bbab8",
      "summary": "Ball of light, west of city, was wiggling, observed for 20 min.  ((NUFORC Note:  Sighting of Venus?  PD))",
      "city": "jacksonville",
      "shape": "light",
      "date": "2010-07-06T00:00:00",
      "story": "Ball of light, west of city, was wiggling, observed for 20 min. I was on break at work, was looking out to the west from my position on the north west part of the city. was a cloudy evening, no stars we visible at this time, and I seen a very bright ball of light which appeared to been wiggling in the sky.  The object never moved from its position as I observed it for about 20 min.  When I took my next break 1hr 30 min later the object was gone.  I watched the skies for the next week and never seen it again. ((NUFORC Note:  Sighting of Venus?  Curiously, the source of the report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76152.html",
      "state": "IL",
      "duration": "20 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bbaf3",
      "summary": "Triangle over the St John's River",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2010-07-06T00:00:00",
      "story": "Triangle over the St John's River I was driving home from St Augustine, FL to my home on the west side of Jacksonville, FL.  I was traveling west on I-295 approaching the Buckman Bridge when I saw a light that I thought to be a helicopter out over the St Johns River to the south.   As the object got closer to the bridge, I could that it was a very large pitch black triangle shape that was moving in a north westerly direction.  It looked like a triangle shaped black hole against the night sky and clouds.  It at first had one bright white light then changed into 3 dim yellowish lights.   It was still out over the water as I traveled on and out of sight.  It was a really dark night with rain and some lightning.  The black triangle shape really stood out against the low clouds over the river.  It was more than a hundred feet long and a couple of hundred feet from the water.   Very odd, kinda freaked out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76079.html",
      "state": "FL",
      "duration": "30 to 45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbc89",
      "summary": "A friend and I were driving home from work late one early morning in mid-august and were stuck at a red light that doesn't normally cha",
      "city": "jacksonville",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "A friend and I were driving home from work late one early morning in mid-august and were stuck at a red light that doesn't normally change when there are so few cars on the road.  We were stopped right next to a woman in a car by herself.  All of a sudden a huge ball of incredibly bright, white light appeared directly in front of us, in the sky but not very high up.  My friend and I were freaking out and we glanced over at the lady next to us who was very clearly witnessing the same thing.  We looked back at the light which had been hovering in front of us for about 30 seconds, then it suddenly zoomed away.  Much faster than any aircraft can possibly go, and it vanished.  It's not much but it's one experience I will never forget. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84209.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbdcb",
      "summary": "Orange Lights in the Jacksonville Sky",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "Orange Lights in the Jacksonville Sky My husband and I were driving home towards the Wonderwood bridge area in Jacksonville FL., when we saw no less that 20 orange spheres in the sky, which were symmetrical. At first I thought it was just the lights on the power lines.  Then I saw one of the lights turn to a brighter orange and pick up speed and move at a fast pace across the sky off into the distance.  While the other ones were a paler orange and they remained in the same spot.  If they were moving it was not at a fast pace. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85026.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbda0",
      "summary": "FIVE ORANGE, PURPLE, AND COBALT AND WHITE BALLS OF LIGHT FLASHED ACROSS NIGHT SKY.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2011-12-12T00:00:00",
      "story": "FIVE ORANGE, PURPLE, AND COBALT AND WHITE BALLS OF LIGHT FLASHED ACROSS NIGHT SKY. I WENT OUT AT NIGHT TO TAKE PHOTOS OF OUR CACTUS PLANT THAT ONLY BLOOMS AT NIGHT.  THERE WERE FIVE BRIGHT, COLORFUL BALLS OF LIGHT FLASHED ACROSS THE NIGHT SKY.  THEY ALL LEFT TRAILS, AS IF TRAVELING AT A HIGH RATE OF SPEED.  ONE BALL WAS BRIGHT ORANGE, ONE VIOLET, ONE WHITE W/COBALT HUE, ONE WAS A DIMMER/DARKER SHADE OF ORANGE (AS IF FARTHER AWAY, AND NOT AS BRIGHT), AND ANOTHER WAS SORT OF GRAY AND DIMMER AS WELL.   SEVEN PHOTOGRAPHS WERE TAKEN IN IMMEDIATE, RAPID SUCCESSION, BUT ONLY THE FIRST PHOTO REVEALED THESE BALLS OF LIGHT.  THE OTHER SIX PHOTOS JUST SHOWED A DARK, SKY W/NO STARS.  THESE LIGHTS MUST HAVE BEEN TRAVELING AT AN EXTREMELY HIGH RATE OF SPEED BECAUSE THEY WERE NOT VISIBLE WITH THE NAKED EYE, AND I ONLY SAW THEM IN MY PICTURES ONCE DEVELOPED.",
      "link": "http://www.nuforc.org/webreports/084/S84891.html",
      "state": "FL",
      "duration": "SPLIT SECOND"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe74",
      "summary": "white light  ascends vertically",
      "city": "jacksonville",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "white light  ascends vertically Saw a bright white light approaching from my northwest.  I initially assumed it to be an approaching plane from the Huntsville area.  As the light reached almost due west, it flashed and instatly began a near vertical ascent.  The light visible during ascent (from what I now believed to be the bottom of this object) appeared reddish in color.  The reddish light got increasing smaller as it ascended and finally disappeared",
      "link": "http://www.nuforc.org/webreports/083/S83629.html",
      "state": "AL",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfae",
      "summary": "Bright green small object traveling North to South.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2012-01-12T00:00:00",
      "story": "Bright green small object traveling North to South. A bright green object moved across the Eastern sky over the ocean approximately 35 degrees above the horizon traveling in a North to South direction at a high rate of speed.",
      "link": "http://www.nuforc.org/webreports/086/S86093.html",
      "state": "FL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc1fb",
      "summary": "A light hovered in the sky two nights, moving back and forth.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "A light hovered in the sky two nights, moving back and forth. 12/38/11 a light in the sky stated to become brighter and brighter until it seem to be at least 5 times brighter than any star or planet.  There were absolutely no stars in the sky at the time. The craft hovered for around 15 minutes before the object became dimmer and took off into the east. The next night, the same light was in the sky, this time not as bright.  The object made no noise whatsoever, and seemed as if it was moving back and forth.  The object stayed in the sky about 5 minutes before disappearing.",
      "link": "http://www.nuforc.org/webreports/086/S86149.html",
      "state": "FL",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc563",
      "summary": "Fleets holding position",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2011-10-25T00:00:00",
      "story": "Fleets holding position \t Every night in the Jacksonville, Florida Skies  A few weeks ago while star gazing, i started noticing that most of them were moving. Not in the direction of our planets rotation, but rather racing back n forth, turning on 90 degree n less angle turns. Also swaying back n forth. The movement from here on the ground would travel to what appears up to be about 1\" to 1-1/2\" before turning or curving back around in a different direction. That doesn't sound like much distance but if you consider that these objects are in our atmosphere, a star moving 1-1/2\" in the sky must be a pretty good distance of travel. And the speed that they travel this distance must be great as well. They seem to be in patterns and holding there positions for the most part and have been there a while now.... As crazy as it sounds and appeared to me myself, I had to get some other person/s to see this as well to insure i wasn't seeing things. So I had my kids come out as well as a few of their friends to see these objects as well.. The did in fact see t! hem and noticed there movements just as I was... I myself do not the equipment or resources to film these objects, but believe someone should try to document them with a high powered telescopic/camera. Just have to get this out there n tell someone...Thanks...If you witness this as well please comment back, also if you have the equipment to document this please send me a copy...Thanks again...",
      "link": "http://www.nuforc.org/webreports/084/S84647.html",
      "state": "FL",
      "duration": "every night"
    },
    {
      "_id": "64d005f478aba2ec5a3bc77c",
      "summary": "Numerous (I5-20) solid red-orange flare-like lights over Jacksonville in about a 2 minute period.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2012-01-24T00:00:00",
      "story": "numerous (I5-20) solid red-orange flare-like lights over Jacksonville in about a 2 minute period. I happened to look out the window and see 3-4 solid red fireballs (not flashing like a plane) floating in pretty close together.  I said, \"what the heck is that?\" and proceeded to get up and have a better look....at that point, I noticed that there were more--many more--coming behind the first that I'd seen.  I called the rest of the family and we all stood on our deck and watched.  It was very surreal as it appeared we were being invaded!   I'm guessing they were flares, but I'm not sure now that I've seen so many similar reports.  I'd say they were each about the size of Venus or Jupiter on a good night, reddish/orange, solid (no blinks) and just seemed to dissipate like a flare might.  But there were at least 15-18 total that we saw in about a 2 minute period, really.  They just kept coming, one set behind the other.",
      "link": "http://www.nuforc.org/webreports/086/S86747.html",
      "state": "FL",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc948",
      "summary": "My wife, daughter, and I witness a bright object moving North-North-East in the sky. It was a bluish-white colored light and stayed vis",
      "city": "jacksonville",
      "shape": "light",
      "date": "2011-10-19T00:00:00",
      "story": "My wife, daughter, and I witness a bright object moving North-North-East in the sky. It was a bluish-white colored light and stayed visible for a few minutes.  It appeared to be large and even though my blackberry camera has a hard time picking up stars and such in the evening sky, i was able to get a picture and a video.  Not sure how good the video will turn out but you can clearly make out what looks like a star in the picture.  Also, there was no sound when this object flew overhead nor did it have flashing lights leading me to believe it was not a plane or helicopter.",
      "link": "http://www.nuforc.org/webreports/084/S84585.html",
      "state": "FL",
      "duration": "few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1dd",
      "summary": "Disk-on-disk UFO making atmosphere around it pulsate",
      "city": "jacksonville",
      "shape": "other",
      "date": "2012-10-30T00:00:00",
      "story": "disk-on-disk UFO making atmosphere around it pulsate In the backyard of my house, my brother and I were grilling out at around 6 p.m.  While waiting for our burgers to cook, we were shooting off some left over bottle rockets we found from independence day.  As he launched his bottle rocket off, something caught my eye.  I noticed an object flying what seemed to be a little to low for a normal airline plane. I noticed that it was slow moving and not shaped like an airline's aircraft and it had no exhaust trail and made no noise.  I pointed this object out to my brother and both of us were dumbfounded by this event.  Hat was most fascinating to me about this object is that it seemed to run an odd path in the sky and the atmosphere surrounding the object appeared distorted such as the heat waves you would see radiating off of hot pavement.  It didn't distort in a heat-wave type pattern though.  It was more of a pulsating visual as though it were bending light rays from its form of propulsion. The object seemed to be a dull metallic disk, with a smaller disk stacked on top of it, and it moved in a smooth elliptical path heading north before slowly, and gradually, decreasing in size until it finally disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93546.html",
      "state": "IL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd232",
      "summary": "Blob when you see it throw a telescope.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "bright light blob when you see it throw a telescope.",
      "link": "http://www.nuforc.org/webreports/093/S93143.html",
      "state": "NC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bda1e",
      "summary": "Fluorescent green streak in jacksonville sky",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Fluorescent green streak in jacksonville sky A fluorescent green streak in the south to southwestern sky above the Southside Blvd area of Jacksonville, FL.  It appeared out of the clouds and disappeared back into the clouds in the span of about 5 seconds and there was a similar colored trail following it as it disappeared back into the clouds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90960.html",
      "state": "FL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be07a",
      "summary": "Rectangular silver/gray spacecraft hovering close to land with no sound.  ((NUFORC Note:  Date of event not indicated by source.  PD))",
      "city": "jacksonville",
      "shape": "",
      "date": "2012-08-19T00:00:00",
      "story": "Rectangular silver/gray spacecraft hovering close to land with no sound As I pulled out of my driveway heading east I saw lights in the sky.  My 1st thought was it was a plane.  As I drove closer   I could see a gray/silver spacecraft,hovering with no sound.  There were lights shining from the front & back (outwards & pointing downwards) off this spacecraft.It was big & so close to the ground.  I was afraid to drive by it for fear it might suck me and my vehicle up in it.   I drove past fast looking back in my mirror and out the window, nothing was seen!   I told only a few people and now wished I would have thought to stop and video taped it.  It all happened so fast and I remember being scared.  I have been reluctant to tell any one. I just sorta dismissed to \"I do not know what to think.\"   A friend said imagine all the people that have seen things & probably do not report it.  So I figured I would share this ((NUFORC Note:  Date of event not indicated by source.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91767.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3be56b",
      "summary": "Disc shaped saucer seen inside a glowing orange ball of light in Jacksonville, florida.",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2012-05-13T00:00:00",
      "story": "Disc shaped saucer seen inside a glowing orange ball of light in Jacksonville, florida. My Husband and I were out in our backyard.  We see an orange glowing ball of light  - kind of reminiscent of fire.  It was moving towards us at first and got to about 1/4 of a mile away.  The craft was approiximately 500 feet up and we could see a definite saucer shaped craft encased within the orange glowing sphere. It almost seemed like a hologram but was not.  Once it got to about 1/4 mile from us, it turned and continued to go fairly slowly around the tree tops and out behind our property where it disappeared.  This craft was completely soundless.",
      "link": "http://www.nuforc.org/webreports/088/S88729.html",
      "state": "FL",
      "duration": "2:00"
    },
    {
      "_id": "64d005f478aba2ec5a3be6c2",
      "summary": "Fast moving object w/ a bauitiful orange aura that seemed to pulsate travaling at high rate of speed.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2012-03-13T00:00:00",
      "story": "a fast moving object w/ a bauitiful orange aura that seemed to pulsate travaling at high rate of speed. 2/19/12 around 12:15-12:35am i seen a brillent orange object.  It made no sound that i heard and stayed a constent speed as the object travaled East/North East.  Its speed was fast compared to the distence it travaled across the sky.  There was no blinking ID lights like on an aircraft just this beautiful orange aura around the object that appeared to pulsate.  The object was about the size of a tennis ball from my location to the object.",
      "link": "http://www.nuforc.org/webreports/087/S87268.html",
      "state": "FL",
      "duration": "10-12 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3be764",
      "summary": "Bright circular light in the sky with glowing lights around the object.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2012-06-14T00:00:00",
      "story": "Bright circular light in the sky with glowing lights around the object. Last night after we put the girls to bed, my mother, sister and I went out on the front porch to have a cigarette,   While we we talking, we noticed a round shape in the sky moving faster than a normal plane or helicopter, around the right side and bottom of the glowing white, ball-like shape was a neon bluish, green light, the lights were squiggly, bottom one looked almost like a sideways S shape, the glow of the lines were very noticeable.  When asking each other what it could be, my mother said, SHHHH, listen to the engine, but could not hear the aircraft or whatver it was in the sky.   First time seeing anything like this.  Strange.",
      "link": "http://www.nuforc.org/webreports/089/S89560.html",
      "state": "NC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bea54",
      "summary": "21:00 pair of objects seen in sky. Moved diagonally and in sync against cloud motion. ((NUFORC Note:  Jupiter and Venus.  PD))",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2012-03-13T00:00:00",
      "story": "21:00 pair of objects seen in sky. Moved diagonally and in sync against cloud motion. No colors noted. Near 21:00, noticed 2 abnormally bright stars in sky directly to the right of Orion's belt.  Over the course of 20 minutes, the object(s), which moved in sync, moved diagonally at about a 45 degree angle until they passed out of our sight behind trees.  The objects were moving against the few clouds, and at a much faster speed then the background starfield.  They were diagonally positioned to one another as well, the right one being lower.  There were two other craft in our field of vision at the time we saw these.  It is difficult to know what type of craft were there, or if they were in pursuit or observing the objects.",
      "link": "http://www.nuforc.org/webreports/087/S87577.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bec6b",
      "summary": "Circle Appears from cloud cover and moves west.  Photos available",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Circle Appears from cloud cover and moves west.  Photos available I took a series of 5 photos of a gorgeous sunset from my back deck on July 12.  I didn't notice this object while I was taking the shots, but it shows up in several and appears to be moving across the sky.   I have tried to enlarge it to get details but only end up with a circle.  This circle is first seen at the edge of a cloud and in successive photos appears to move west.   I will try and forward the photo set which will have an incorrect date.  The shots were taken within a 3 minute time span.  I hesitated to file this report because I thought it may be a natural object.  When I read a post dated that evening in Atalla, AL, which is about 20 miles away, I decided the photos may be of some significance.",
      "link": "http://www.nuforc.org/webreports/100/S100644.html",
      "state": "AL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8d7",
      "summary": "I saw fireball like objects in the sky on New Year's Eve.  I saw atleast two that night. It was like slow moving, flickering.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "I first saw fireball like objects in the sky on New Year's Eve.  I saw at least two that night. It was like slow moving, flickering fireballs that were low in the sky.  Seemingly way lower than your average plane and after 30 seconds or so, as I am trying to figure out what it is they flicker out and completely disappear.  The reason why I am reporting this is because I just saw the exact same thing and googled it and found all these similar reports. Tonight I only saw one.   Same exact thing.  Slow moving, flickering like a fireball, I initially thought it resembled what the average person identifies as a comet.  Then just appeared to almost &quot;burn out&quot;. I've talked to several people about it because we have a naval base local.  But tonight a clearly US aircraft was flying towards this right as I saw it......there is no way this is not something recognized on US radar.  Clearly. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97330.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf98d",
      "summary": "4 orange glowing, non flickering spheres, very crisp and clear.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2012-12-20T00:00:00",
      "story": "4 orange glowing, non flickering spheres, very crisp and clear. Was returning home from work and passing a radio station and tower on the East edge of town.  Was going over a bridge over the rail road tracks and Sighted a Single light a few hundred feet above my car.  First i thought it was beacon light on transmitter tower and realized it was solid orange and not the tower light.  As i got to the top of the bridge I looked back forward and Saw 3 more. orange brightly glowing spheres.  Weather was extremely foggy and could only see a few hundred feet in any direction.  This is a 2 lane road i was on and couldnt jsut stop.  I slowed to about 15 miles and hour and was leaning forward to look up at them thru the windshield.  I had already past the first. the other 3 were in view. lasted 20 seconds at most.  But they were 2-3 ft round spheres glowing a bright but defined and non-flickering orange light.  At first i wanted to believe they were chinese lanters.  But they were smooth round, and orange no flickering. they were moving east-south east fairly slowly.  It was a calm foggy light.  Once i got home &lt;approx 2 minutes later&gt; I decided to go look for them again. I drove around the area for 10-15 minutes stopping and looking all the way to the interstate and did not see them again.",
      "link": "http://www.nuforc.org/webreports/094/S94924.html",
      "state": "IL",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa80",
      "summary": "Bright light makes 90 degree turn.",
      "city": "jacksonville",
      "shape": "light",
      "date": "",
      "story": "Bright light makes 90 degree turn. Coming home from boot camp in a friends car traveling south on Interstate 95.  I was in the back seat looking up at the stars. I spotted a bright light that was moving.  At first I thought it was a satellite.   I watched it for about 10 minutes and told the other guys in the car that I think I spotted a satellite.  We kept watching it move when all of a sudden it made an exact 90 degree turn.  Now as far as I know nothing man made can make a movement like that.  I know it's a little late in the game to report this but I had no source back then to report it to.   I was always skeptical about UFO's until then.  That incident certainly changed my mind. ((NUFORC Note:  Date may be approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100286.html",
      "state": "FL",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfbb2",
      "summary": "Jacksonville, Fla spots red/yellow glow in night sky with changing, slower velocity and then going black",
      "city": "jacksonville",
      "shape": "other",
      "date": "2013-06-02T00:00:00",
      "story": "Jacksonville, Fla spots red/yellow glow in night sky with changing, slower velocity and then going black I am a science teacher and tonight, as I entered the house just after dusk, I noticed a large, bullet shaped object coming towards my part of the overhead atmosphere.  At it's speed I first thought it to be a helicopter, due to size and altitude, but it had no noise and no visible tapering tail end.  It was shaped more like a ahort bullet and glowed reddish/orange/yellow as if it were extremely warm.  It was not a meteor.  It did not travel in a straight path but rather moved slowly on an angle, as if to steer it self a bit and then straighten out again.  I had enought time to call a witness to this from in the house. As the oject moved over head it appeared to pulse with this heat while it seemed like it was losing some of that heat.  It was moving slowly, like a slow helicopter speed.  As it pulled away finally, after 2 minutes, it started to cool and slowly went black, not to relight.  I looked to watch it then continue on it's way, as black stone looking object as if it never been lighted in the 1st place. This object had no flaming, fireball tail and did not appear to be disintergrating.  It just looked aglow and seemed to pulsate with reddish/yellow heat.  Moving at a rather astonishly slow clip. Once black, it drifted out of sight to the north. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97833.html",
      "state": "FL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bff68",
      "summary": "Three very bright orange lights above the tree lines traveling in the same pattern and direction.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2013-06-02T00:00:00",
      "story": "Three very bright orange lights above the tree lines traveling in the same pattern and direction. On Saturday night, my fiancee and I were sitting out on the front porch chatting.  Suddenly a very bright orange light caught my attention above the tree line on the opposite side of the street.  We both were astonished as we got up from the porch walking to the back of the house to keep the light in sight as it travelled over the house.  It appeared to descend and turn dark as it dissapeared behind the woods.  Just as we could no longer view it we turned and immediatly noticed two more identical lights travelling in the same pattern and direction as the first one.  The first of these lights seemed to have a haze over the top, and all were equally bright.  Immediately, we jumped into the car and attempted to follow these lights, however they dissapeared rather quickly.  My first thought was that perhaps they were associated with the military base, however I quickly realized that the only aircraft associated with the base are helicopters, and these lights certainly were not helicopters. I have seen the military aircraft every day of my life for the past thirty years, however have never wittnessed anything like this.  I believe the lights came from the west, were extremely bright, and made no sound.  As the lights appeared to be descending behind the woods they appeared to fade or darken and the shape seemed to be something of an elongated sphere.  I am not good with size or distance, however I would describe them as being the size of a smoke detector held at approximately two arms lengths.  Upon returning home, I called my Dad who happens to be a pilot and asked if he knew of any aircraft that had bright orange lights, he did not.  I also called my son as he is in the Air Force and asked him the same question.  His response was also the same.   I am still puzzled over what I have seen. Wish I had an answer.",
      "link": "http://www.nuforc.org/webreports/098/S98250.html",
      "state": "NC",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bff37",
      "summary": "UFO sighting in Jacksonville, FL",
      "city": "jacksonville",
      "shape": "egg",
      "date": "2013-07-14T00:00:00",
      "story": "UFO sighting in Jacksonville, FL My girlfriend and I were poolside by ourselves the night of July 10, 2013 in lounge chairs staring up at the beautiful night sky in Jacksonville, Florida.   At approximately 10:22pm high above us in the sky above cloud level we witnessed a spherical egg shaped type object appear and then vanish within a few seconds.  It was an unusual bright yellow color unlike the bright white lights of normal flying objects.   Immediately we both knew we had witnessed something special and unique.  We knew it was something we could never forget.",
      "link": "http://www.nuforc.org/webreports/100/S100037.html",
      "state": "FL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c02a5",
      "summary": "Oval shaped craft with blunt ends no lights, completely black.",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2013-04-12T00:00:00",
      "story": "Oval shaped craft with blunt ends no lights, completely black In early February, 2013, I stepped out my front door with my Jack Russell terrier so he could do his business one last time for the night.  As I recall, it was around 2200 and the moon was nearly full and there was some sporadic cloud cover. The front of my home faces east and it is located about twenty five miles west of the Atlantic ocean and about eighty miles north of Cape Canaveral. As I gazed up at the moon, I observed a dark, elliptical shaped object silently pass in front of the moon, almost blotting it out, and then disappear in the cloud cover.  I was able to view the object for approximately two seconds, as it crossed south to north.  It was hard to gauge its size, but the impression I was left with was that the object was very large; it was oval shaped in the middle, but the ends were blunt, or square. I quickly dismissed the object as being an aircraft because it had no wings or navigation lights.  The object was completely blacked out.  It was several days before I mentioned the sighting to my wife, who met my revelation with a very perplexed expression.  We’ve been married for twenty three years and she served twenty of my twenty one years in the Marine Corps married to me, not to mention the past seven years that I have been a police officer, and my wife knows I am not easily impressionable, prone to exaggeration, or likely to joke about such things. Occasionally I have caught glimpses of shuttle launches from my front yard, but I truly cannot explain what it was that I saw that night in February.",
      "link": "http://www.nuforc.org/webreports/097/S97073.html",
      "state": "FL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0522",
      "summary": "Reddish-yellow elongated diamond star-sized lights moving in elongated V formation against night sky that gradually disappeared.",
      "city": "jacksonville",
      "shape": "diamond",
      "date": "2013-03-03T00:00:00",
      "story": "reddish-yellow elongated diamond star-sized lights moving in elongated V formation against night sky that gradually disappeared I was just out in my backyard around 9:40 pm Saturday, February 8th looking at the evening sky-some low clouds, a clear moom, stars bright against the night sky.  And then I noticed these lights, as bright and slightly larger than the stars, the color of a lit match- something between red and yellowor, like a hot orange.  There were 5 or 6 of them moving steadily from right to left in an elongated V formaton at a moderately steady pace.  The one furthest to the right was highest with the next one slightly lower, the next lower still, the next dropping much lower, the next much higher and the last higher still. They weren’t blinking or alternating color like lights from a plane, neither was there any noise like helicopters make.  I followed them as they moved across the sky until they were blocked by large tree, so I went out into the street to follow them and noticed two or three of them were gone.  I watched the ones remaining as they continued their path across the sky and noticed that one by one, from the right to the left, they were becoming fainter, losing color until they disappeared.  And then they were gone.. It was truly the strangest thing I’ve ever seen and have no idea what they were.  I’m not one for conspiracy theories and figure there’s an explaination other than extraterrestial, but I’m totally at a loss for what it is.  When I did a search online, I was shocked to find so many hits of similar sittings over the last year and from many locations across the country.",
      "link": "http://www.nuforc.org/webreports/096/S96483.html",
      "state": "FL",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c061f",
      "summary": "Large gray triangular aircraft following florida air gaurd jet.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "large gray triangular aircraft following florida air gaurd jet I was on a industrial bldg. rooftop,working on HVAC PM's,I noticed two florida air national gaurd jets,one heading south,and one heading north,they were east of me and I was about 17 miles inland,they both were leaveing solid condensate trails as it was a fairly humid morning,just after they passed each other I noticed a battleship gray colored triangle with a circular structure in the exact center,it was following the northbound jet,but was at a higher elevation and trailing it allmost as if it was paceing it, it left no trail at all,and was moving a little between 11 and 12 oclock,I watched them go behind a cloud and after a few seconds the jet emerged from the other side,but I never saw the gray triangle again,it was a perfect triangle,with rounded corners,it was 20 times larger than the jet it was following! the color of it made me simply think it was a military aircraft,but after looking online I decided to report it to this site.",
      "link": "http://www.nuforc.org/webreports/096/S96131.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c078b",
      "summary": "At night I look up at the sky to admire the stars if I am walking home from work at night. This night in particular I was walking from",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "At night I look up at the sky to admire the stars if I am walking home from work at night. This night in particular I was walking from my car to my house and stopped to admire the clear night sky.  I had seen a few helicopters over the water which is common because I live near a base and it's not unusual.  I had seen two on my right over the water and heard the helicopters I could clearly tell what those were. Less than a minute later I saw what I thought was a plane high up moving over my house.  I stared at it ad then it moved back and forth a few times and then moved really fast and disappeared.",
      "link": "http://www.nuforc.org/webreports/105/S105617.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0811",
      "summary": "Bright red flashing moving slow from NNW to the SSE",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "Bright red flashing moving slow from NNW to the SSE The object was very bright and red it was moving from the NNW to SSE.  It slowly faded out as it went into the distance.  At first I though it to be space junk burning up in the atmosphere , but because of the direction it was moving I don't think that is possible.  There are no launches down at the Cape so it wasn't that either.  To give aspect on the direction, if staring at the cape the object started about 75 degree to the right and ended about 20 degrees to the right.",
      "link": "http://www.nuforc.org/webreports/105/S105713.html",
      "state": "FL",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c08da",
      "summary": "The 1st sighting was in July 2013 - and this 3rd sighting was 11-25-13",
      "city": "jacksonville",
      "shape": "flash",
      "date": "2013-11-11T00:00:00",
      "story": "The 1st sighting was in July 2013 - and this 3rd sighting was 11-25-13 I was sitting on the back porch and relocated to the seat my fiancie was sitting in.  That is when I noticed a object that had an appearance of a star, but had flashing lights. When ((woman's name deleted)) returned outside, I asked her if she noticed this object, she replied, \"Yes, I’ve been watching it for about an hour.\"  Then I got out my phone and turned on the video camera.  At that moment the object lowered behind the tree level.  It rose up and a lot of flashing lights went all around it the our eyes, but on video it shows a object of light shooting off of the one we was recording. It then started moving and stopping, and then lowered again. It came back up and stopped, and then flew away like and airplane would have been flying. This report will be on the local news Nov. 21st 2013. I have seen this object  1st in the north sky right above the tree level.  The 2nd sighting it was me and ((woman's name deleted)) and it was in the west sky, and again right above the tree level.  I called my mother, ((name of 2nd woman deleted)).  And the object moved alittle but that was it, and floated with the sky out of sight.  The 3rd sighting was in the south sky, right above the tree level.  Me and ((womnan #1)) witnessed this one as well.  I tried to video it but this phone’s camera isn’t as good as the other I had. A day right after the 1st sighting that I captured on video, I storm came thru that was like a UFO cloud that I captured on video as well",
      "link": "http://www.nuforc.org/webreports/104/S104242.html",
      "state": "FL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c094d",
      "summary": "5 lights in pentagon formation moving extremely fast across sky.",
      "city": "jacksonville",
      "shape": "chevron",
      "date": "2014-03-18T00:00:00",
      "story": "5 lights in pentagon formation moving extremely fast across sky. I witnessed 5 lights in a pentagon formation moving swiftly across the sky.   I live right across from the base in Jacksonville, NC.  I see many aircraft in the sky.  They all give off noise.  This object moved roughly 10 times faster than any craft I have seen before.   Didn't give off any noise at all.   I witnessed it for roughly 20 seconds till lost site of it.   Lights were not extremely bright, but object was solid, blocked out stars as it traveled across the sky moving from north to south.",
      "link": "http://www.nuforc.org/webreports/107/S107592.html",
      "state": "NC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c09d0",
      "summary": "I could not have described what me, my husband and daughter witnessed than the description that was posted by someone in St. Cloud, Flo",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2014-01-10T00:00:00",
      "story": "I could not have described what me, my husband and daughter witnessed than the description that was posted by someone in St. Cloud, Florida, on 12/23/13.  It was the perfect description of what we saw.  The only thing different was the city and date.  It was one of the weirdest things I've seen in the sky.   I am a star gazer by nature and this was defiantly something I've never witnessed.  New years eve 12/31/13, we ended up seeing three before the night was over.  When you first catch glimpse of it you see this bright orange object cruising across the sky.  The three on New Years night were not as clear to me as the one on 12/29/13.  That one was very clear to me and looked to be on fire.  All I can say is weird.  Very curious to know what they are!! ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105914.html",
      "state": "FL",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a8a",
      "summary": "~8 bright orange, almost as if on fire floating orbs coming in off the ocean then disappearing.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "~8 bright orange, almost as if on fire floating orbs coming in off the ocean then disappearing. ~8 bright orange, almost as if on fire floating orbs coming in off the ocean, no sound, or normal aircraft strobe lights.  Disappearing after reaching inland.   They were moving slowly, and in formation, they then disappeared one at a time shortly after reaching the coast. ((NUFORC Note:  We presume an evening sighting, not morning, and have amended the time above, to reflect that fact.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107735.html",
      "state": "FL",
      "duration": "~2.00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cd2",
      "summary": "1 rectangular object seen hovering while drifting out of a cloud and after less than one minute went back inside the cloud.",
      "city": "jacksonville",
      "shape": "rectangle",
      "date": "2014-02-27T00:00:00",
      "story": "1 rectangular object seen hovering while drifting out of a cloud and after less than one minute went back inside the cloud.   2 seconds later in far distance (5 miles?) a black rectangle appeared in the far distance, but was too far to get a good visual. I have 20/15 vision and could see a better picture than than my 8MP camera.",
      "link": "http://www.nuforc.org/webreports/107/S107382.html",
      "state": "FL",
      "duration": "1"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d15",
      "summary": "Round orange extremley fast moving and silent. Traveling west.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "Round orange extremley fast moving and silent. Traveling west. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106074.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fef",
      "summary": "Strange Row of Lights Over Jacksonville, Fl.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2014-02-14T00:00:00",
      "story": "Strange Row of Lights Over Jacksonville, Fl My sister and I were coming home at approximately 2 am.  I noticed a row of maybe 5 red lights in the sky that were so perfectly vertical that at first I thought it was a constellation.  Then I noticed another red light approaching the row from the left of the others and it joined the row at the bottom.  That's when I turned off the radio and asked my sister if she thought the lights in the sky were as strange as I did.  She agreed, so I grabbed my phone and we fumbled nervously to record what we saw.  Besides the fact that my sister didn't know how to work the video camera on my phone, the lights were difficult to record because they seemed to move without really moving.  I don't know how to explain it. Once they were in a row, the lights turned from red to orange and kept changing colors.  They never seemed to move but somehow disappeared.  We never heard any noises like we would have if it was a plane or several planes, which we hear often because we live in between a navy base and a commerce center for private/commercial planes. When we got home, I called the non emergency line for our sheriffs office to inquire if there had been any other reports.  I was told no but they would send out an officer if I wanted to file a report.  I declined the report.",
      "link": "http://www.nuforc.org/webreports/107/S107031.html",
      "state": "FL",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c110c",
      "summary": "Big area of blinking light in the sky.",
      "city": "jacksonville",
      "shape": "other",
      "date": "2014-02-14T00:00:00",
      "story": "Big area of blinking light in the sky. I was driving and in the far distance I saw a blinking light.  It looked like it would be coming from a baseball stadium, because it was so bright and it was low to the ground.  I did not see any crafts, but I thought this blinking light was very unusual.   It is a very foggy night with light mist, this made the light stand out to me.",
      "link": "http://www.nuforc.org/webreports/107/S107076.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c1140",
      "summary": "Bright disc spotted over east Jacksonville near 295, with aircrafts following.",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2014-01-30T00:00:00",
      "story": "Bright disc spotted over east Jacksonville near 295, with aircrafts following. Was outside taking out the trash and saw a strange light in the sky. I had my phone on me so I called my wife who was in the house and told her to get outside.  She was standing by the garage and I was walking back towards the house (about 90 feet).  My neighbor was also outside.  It appeared to be moving towards the ground, vertically towards the area where we live, then prior to it disappearing it moved back towards the sky.  It was bright and disk shaped, no sounds were present. It stayed in one place for a few seconds and then would move erratically in a chaotic pattern, but with no recognizable signature to identify it by any means.  It was not an aircraft, because immediately as this was happening we heard two jets (aircraft of jet-like origin) moving towards the object.  We tried to video tape this with the camera phone but it was too dark, and would not be sufficient for what we saw.  After we heard the jets coming towards the area of the object, it shot ac! ross the sky and disappeared.  The jets continued to make loud noise, but soon after were gone as well.",
      "link": "http://www.nuforc.org/webreports/106/S106687.html",
      "state": "FL",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c128b",
      "summary": "I'm only reporting this because now it happened a second night in a row and my husband saw it this time too and the helicopters and pla",
      "city": "jacksonville",
      "shape": "flash",
      "date": "2013-12-12T00:00:00",
      "story": "I'm only reporting this because now it happened a second night in a row and my husband saw it this time too and the helicopters and pla A flash of light skiped thru the sky three times befor disappearing approx 40 seconds later the sky filled with helicopters and planes and on 12-7-13 @ 10:03pm the same happened except the object was going south opposed to north and did not skip just disappeared as on 12-6-13 and again the sky filled with helicopters and planes but this time ot only took 20 seconds for them to come there was 6 in a very close air space!",
      "link": "http://www.nuforc.org/webreports/105/S105144.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1398",
      "summary": "A flash of light that went into a cresent shape before disappearing was seen heading south bound @10:03 pm approx 20 seconds later the",
      "city": "jacksonville",
      "shape": "flash",
      "date": "2013-12-12T00:00:00",
      "story": "A flash of light that went into a cresent shape before disappearing was seen heading south bound @10:03 pm approx 20 seconds later the air space in the same region filled with 4 helicopters and 2 planes which circled back and forth the area where the craft was, this was seen on 12/6/13 @ 8:34 except in that instance the flash skipped and was going north in the sky and the helicopters and planes came 40 seconds after but it was in the sky north where that light disappeared.",
      "link": "http://www.nuforc.org/webreports/105/S105145.html",
      "state": "FL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c14b4",
      "summary": "5 possible meteors traveling in single file.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2013-12-23T00:00:00",
      "story": "5 possible meteors traveling in single file 5 possible meteors, all traveling the exact same path,  Orange in color,one after the other, travelling south to north. The first two were in the.  Sky at the same time,before the first was completely over the horizon, another appeared. I was taking out the trash when I saw this begin, the neighbor saw it as well.  I got my wife in time to see the last one. They were soundless.  At one point, an airplane at high altitude with its lights on passed underneath it, the object was at least twice the speed of the airplane. Possibly a meteor, but never seen any that color, or ever seen multiple shooting stars ever travel the exact same path before. Coincidentally, my son and his cousin walking to the movies saw at least 2 of them that night as well.",
      "link": "http://www.nuforc.org/webreports/105/S105515.html",
      "state": "FL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1565",
      "summary": "Some type of rocket launch.",
      "city": "jacksonville",
      "shape": "cigar",
      "date": "2013-12-05T00:00:00",
      "story": "some type of rocket launch I was outside yesterday at approximately 10:30 AM.  We heard a loud noise that sort of sounded like a jet.  But it went on so long that I started looking for it.  Then, to me, it started sounding more like a rocket.  I looked in the direction of the Kennedy space center as I often watch launches from there.  And there was indeed what looked like a rocket.  I enjoy trying to catch the take offs from my area when the weather is nice.  So I am usually familiar with what is taking off when because I try to watch for them.  (And sometimes photograph them)  I remembered that SpaceX had tried to take off early in the week and had been delayed but I thought it took off that night before on Dec. 3.    When I got home I did searches and could NOT find anything about any launches at Kennedy. I also checked the schedule of launches from Kennedy and other than one later this month there was nothing scheduled after the Dec. 3 SpaceX launch that had happened the night prio! r.  So after lots of digging I have yet to find anything about this launch.  My guess is it's unpublished NASA launch of a spy satellite or something.  But it definitely was a rocket launch and looked very much like it would if it were from Kennedy Space center. Also immediately after there seemed to be a lot of activity at the NAS Jax. (Tons of military jet planes) The area I was in 32256 is very close to the NAS base (just across the river from it), however, the \"launch\" was coming from the coast in the South eastern direction.  Again this is the exact direction I have previously watched many NASA launches. I did find, after lots of digging this video-http://www.youtube.com/watch?v=BgRzshn_8QI&list=FLgk_WMPAW3xQhP2N9OtTnMA&index=1 .  It sounds and looks just like the launch I witnessed.  (Although I witness, obviously, from a much greater distance).  It was LOUD though even from our area.",
      "link": "http://www.nuforc.org/webreports/105/S105087.html",
      "state": "FL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c156a",
      "summary": "Three lights were coming together and then the left and right vanished. middle light stayed a moment before vanishing too.",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2013-11-20T00:00:00",
      "story": "Three lights were coming together and then the left and right vanished. middle light stayed a moment before vanishing too. We were standing outside when we noticed 3 lights in the sky. They were apart for about 30 seconds and then they were getting closer together.  Then all of a sudden the two lights on the left and right side vanished.  The middle light stayed another minute before it vanished as well.",
      "link": "http://www.nuforc.org/webreports/104/S104523.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1884",
      "summary": "WE WATCHED 2 CANDLELIT LOOKING ORBS IN THE SKY OVER A RESIDENTIAL AREA WHICH THEY SEEM TO HAVE COME IN A LITTLE FAST THEN SLOWED DOWN.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2014-06-04T00:00:00",
      "story": "WE WATCHED TWO CANDLELIT LOOKING ORBS IN THE SKY OVER A RESIDENTIAL AREA WHICH THEY SEEM TO HAVE COME IN A LITTLE FAST THEN SLOWED DOWN, TURNED THEN WENT OUT.",
      "link": "http://www.nuforc.org/webreports/109/S109432.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c194a",
      "summary": "Circular glowing disced shaped object",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-06-04T00:00:00",
      "story": "Circular glowing disced shaped object Me and my girlfriend was driving up my street and we saw a circular object with illuminating green rings around it flying tree line in the air for about 5 minutes then it looked like it landed or disappeared in the woods.",
      "link": "http://www.nuforc.org/webreports/109/S109398.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ab5",
      "summary": "White circle shapes moving counter clockwise north west.  ((NUFORC Note:  Advertising lights?  PD))",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-07-04T00:00:00",
      "story": "White circle shapes moving counter clockwise north west. Four white lights going counter clockwise and meeting up in the center then spreading apart.  Circle shape in the north west area. In the clouds. ((NUFORC Note:  Advertising lights?  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110713.html",
      "state": "AL",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b23",
      "summary": "Flashing flying object.",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2014-07-26T00:00:00",
      "story": "Flashing flying object My boyfriend and I were sitting outside in front of his house, when he asked me to look up at the sky a little distance away and asked me what was that we were seeing.  It looked like a unidentified aircraft with bright flashing lights with multiple colors was slowly moving and then just stopped.   My boyfriend ran into the house and grabbed a pair of binoculars, and he first looked at it and then I did.   What I saw was multiple flashing lights that were the colors of amber, orange, white, red.    I couldn't tell what the shape of it was but I think it was rounded based on the formation of the lights.   We got in his vehicle and started down the street and by the time we got to the end of the street, it vanished.",
      "link": "http://www.nuforc.org/webreports/111/S111762.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e52",
      "summary": "White, star like orb slowly moves across the night sky for 30 seconds.",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2014-06-27T00:00:00",
      "story": "White, star like orb slowly moves across the night sky for 30 seconds While walking my dogs I was looking up at 2 stars.  Suddenly, a white oval appeared to the left of one of the stars.  I thought it was another star because it looked like one.  However, the orb slowly moved across the night sky for about 30 seconds and simply disappeared. It had no flashing lights and made no noise.  I have seen these orbs many times before.",
      "link": "http://www.nuforc.org/webreports/110/S110665.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1efe",
      "summary": "Black oval craft flying below cloud line making no sounds, displaying no lights & travelling at high velocity.",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2014-05-02T00:00:00",
      "story": "Black oval craft flying below cloud line making no sounds, displaying no lights & travelling at high velocity. April 4th, 2014, I was about to return to work after lunch break was over.  I was walking in the door and glanced up in the sky to try and see if it looked like it was going to rain, a Black orb/oval shaped object caught my attention.  The object was flying across the sky horizontally towards the downtown area, the rate in which it was moving looked faster than any fighter jets that i have seen flying. The back object was moving rather fast, however there was no sound or flashing lights like airplanes, jets or helicopters have.  As the object was moving towards the direction of the downtown area (10-15 miles from my workplace), it appeared to rotate mid-air resulting in looking more narrow and smaller than it did when i first noticed.  After a couple seconds in this narrow appearance it rotated again and was back to the first observed shape. From the moment I initially saw the object until it was out of view lasted about 15-20 seconds. There were clouds covering the sky, and I am no expert of the distance of things, but it was well below the cloud line.  My guess is this object had to be between 1,000 feet - 2,000 feet in the air. I rushed inside work to tell my co-workers what I had seen only to get laughed at.  Within a minute of entering the building, my co-workers & myself heard what sounded like 2 fighter jets flying overhead & the sound of the jets was going in the same direction as the object. I do not know what the black orb/oval was that I saw.  The object made  No sounds,  No lights and a fast velocity, which was shortly followed by some fighter jets.  I can only describe the object as a U.F.O,  I'm not automatically assuming Extra Terrestrial, I just can't explain what the object was.",
      "link": "http://www.nuforc.org/webreports/108/S108992.html",
      "state": "FL",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f88",
      "summary": "Very bright angular object that stayed motionless within eye view; lots of disturbed birds.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2014-06-13T00:00:00",
      "story": "Very bright angular object that stayed motionless within eye view; lots of disturbed birds. ((name deleted))",
      "link": "http://www.nuforc.org/webreports/110/S110088.html",
      "state": "FL",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1fc2",
      "summary": "Very bright white light(s) on a stationary object with angular lines.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2014-06-13T00:00:00",
      "story": "Very bright white light(s) on a stationary object with angular lines. Same sighting as reported 6/9/2014 except the object was further away.   Single object in the eastern horizon with a very bright white light or a series of very bright white lights with a dark angular or triangular outline.  Object was stationary.  I did notice a circular aura around the object.",
      "link": "http://www.nuforc.org/webreports/110/S110104.html",
      "state": "FL",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3c2163",
      "summary": "We were going to our friends house when we noticed the UFO and stopped to look at it just hovering. It was in broad daylight and all wo",
      "city": "jacksonville",
      "shape": "chevron",
      "date": "2014-04-11T00:00:00",
      "story": "We were going to our friends house when we noticed the UFO and stopped to look at it just hovering.  It was in broad daylight and all would could see were the 3 lights on both sides.  We watched it for 10 minutes just hovering, no noise at all.  After 10 minutes it just took off.",
      "link": "http://www.nuforc.org/webreports/108/S108419.html",
      "state": "FL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c22ec",
      "summary": "Hovering triangular craft with search lights.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2014-04-11T00:00:00",
      "story": "Hovering triangular craft with search lights. I was driving along the I95N at about 06:45 when I saw something very bright in the sky in front of me.  It was still dark.  At first I thought it might be a star, but as I drew closer I realized it could not be.  As I continued to travel along the freeway I was watching it and it did not appear to be moving.  I considered that perhaps it was a signal light on top of a cell phone tower or similar but I was not aware of any such construction in the area. As I got closer and it came clearly into view, it appeared to be triangular in shape and the size of a large plane.  It seemed to hover and didn’t have any speed like an airplane or jet would.  There was also no audible sound coming from it.  Although I did not lower the windows on my vehicle, I feel sure that had it been a plane of that size I would have heard the roar of the engines. The other thing that struck me as unusual was that it appeared to have search lights on it.  They were very big and round and they faced down, towards the ground, not like the head lights of an airplane.  It did also have a red and green light on it which I understand is used to signal port and starboard on aircraft. I am not sure how many of these search lights were on this triangle as I did not count them, but I would guess at perhaps 6 or 8. I was unable to stop on the freeway, or to take picture whilst I was driving so I took the off ramp and drove around to where I normally park, hoping I would still be able to see it, however by the time I got around the building, I could no longer see the craft. I would very much like to learn what it is that I saw.",
      "link": "http://www.nuforc.org/webreports/108/S108410.html",
      "state": "FL",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c261b",
      "summary": "Orange orbs.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "We saw 8 total orange orbs in the sky near kernan blvd. 4 were in a diamond formation and 4 were coming off the diamond in a line.  They were bright orange, had no sound, didnt move for about 10 min.  Then they just turned off and were gone.  Was hoping someone else saw this but have not heard anything yet. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114688.html",
      "state": "FL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2878",
      "summary": "White Disc In the Sky:  Viewed From Riverside Avenue.",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2014-10-10T00:00:00",
      "story": "White Disc In the Sky:  Viewed From Riverside Avenue So I had a terribly weird morning. I woke up with strep throat, which had started kicking in last night.  I tried all types of medicines and finally gave up and went to the hospital.  After being diagnosed and given my prescription for antibiotics and pain meds, I went to a diner and had breakfast while I waited for the pharmacy to open.  At the diner I check my Facebook page and I read a message from my sister; Dad has cancer and is not going to do chemo.  Then crying.  Then pharmacy to pick up meds, call dad, he is too sick to talk, and eventually drive back home. I am one block from my house though and see this disc in the sky. It is a white disc, oval shaped.  At first I just thought, \"what a weird shaped cloud\", but then I realized it was moving.  I passed my house and continued down the street to catch a better glimpse of this thing.  I quickly reach for my phone to take a picture and it quickly flies away.   I park at Memorial Park on the river and try to look for it , but it is no where to be seen. This is the second alien sighting I've seen in the last 6 months, and last time I was with two other friends (all of us sober!) who saw it as well.  Last time it also happened that when we brought out our cameras it disappeared, but last time it was flashing different colors and it was also night time instead of daylight . Very interesting.",
      "link": "http://www.nuforc.org/webreports/114/S114250.html",
      "state": "FL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c28c1",
      "summary": "Disc shaped object seen in the middle of the afternoon.",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2014-10-10T00:00:00",
      "story": "Disc shaped object seen in the middle of the afternoon. Driving north on highway 17 (Roosevelt blvd) at about 4pm just past NAS Jax towards my left (East) I would say maybe 2 or 3 miles away was a large probably disk shaped object (about the size of my Galaxy s4 held at arms length.  I was traveling at about 60 mph and could not tell if this object was stationary or moving but I think stationary.  I saw it a few times through the tree line until I reached San Juan ave. then it was just gone.   When I first saw it it was level and the last time I saw it it was at about a 15 degree incline (no idea if it was facing down or up as the shape was very uniform).   I was not the only driver to see it as I noticed other drivers trying to get a picture of it (I tried but was unable to get it without stopping and there was too much traffic to just stop).  I honestly have no idea what this thing could have been.   This just happened 25 minutes ago and I fine with you contacting me if you need to.",
      "link": "http://www.nuforc.org/webreports/114/S114242.html",
      "state": "FL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2926",
      "summary": "Blue green ufo silent.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2014-11-14T00:00:00",
      "story": "blue green ufo silent e and I saw the craft up close it used a beam of light and stared at us flying irregular it was so close but made no noise had bright blue green puffy light asscended lighting fast then descended between Hodges and kernan I know its no drone it was silent n very close scared the hell outta me.....it stared us down with light beam. ..all 3 phones/cameras quit working ...have video after it crossed road of it slowly decending if interested",
      "link": "http://www.nuforc.org/webreports/115/S115267.html",
      "state": "FL",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29e4",
      "summary": "Looking up  in sky saw round circle orbit like.not a star...no way.  A airplane before it and one after we're with it.  It moved quite",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-11-26T00:00:00",
      "story": "Looking up  in sky saw round circle orbit like.not a star...no way.  A airplane before it and one after we're with it.  It moved quite fast and then disappeared between both planes.",
      "link": "http://www.nuforc.org/webreports/115/S115571.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a80",
      "summary": "Driving west down J Turner Butler Boulevard (by the intercostal area) we glanced up to see a white ball of light, standing still over t",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2014-11-26T00:00:00",
      "story": "Driving west down J Turner Butler Boulevard (by the intercostal area) we glanced up to see a white ball of light, standing still over the St Johns river.  It began traveling very quickly away from us horizontally- headed north.  It slowed down and sped up quickly and made impressive distance in a very short amount of time.  It appeared to also slightly dip and soar upwards smoothly a few times.  I kept my eye on it the entire time it was in view until it got so far away that it became hard to find through the trees.  It was pure white with no blinking lights or anything else that would make me believe it was an airplane or helicopter. Was amazing to see!",
      "link": "http://www.nuforc.org/webreports/115/S115577.html",
      "state": "FL",
      "duration": "4 minutes approx"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b21",
      "summary": "2 red lights disappear behind mountain.  5 jets follow behind.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2014-09-25T00:00:00",
      "story": "2 red lights disappear behind mountain. 5 jets follow behind. 9:30pm Saturday, September 20th.  Two circular red lights resembling star hover above a mountain on new liberty road in pleasant valley area. Both hovered glimmering a red tint just as some stars do.  A jet came by over my house as it is in a flight path.  As the aircraft approached the mountainside the ufo on the right slowly descended behind the mountain until out of sight.   As the aircraft got closer the ufo to the left slowly dropped to the treeline, hovered there a few seconds, and dropped behind the mountain out of sight.   In a five minute window afterwards five planes came flying by in the directon of the ufos.",
      "link": "http://www.nuforc.org/webreports/113/S113748.html",
      "state": "AL",
      "duration": "5 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b2e",
      "summary": "Bright light on Hodes BLvd fast flying close not plane or helicopter.",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2014-10-03T00:00:00",
      "story": "bright light on Hodes BLvd fast flying close not plane or helicopter Driving on JTB towards jax beach at 8:30 PM on 9.28.14 I saw a blue/red/pink/purple looking light going way up and down above the tree tops, in the area of beach blvd. At first I thought it was a helicopter. But the object moved so fast. It dove down and right back up and swirled around, way too fast and too bright to be a helicopter. It was not a plane either. I knew that from the start. It did not have the right shape or fly like one. As I turned on to Hodges blvd I continued to watch this light rise and fall in the sky. It would go way up in the air maybe 100 or 1000 feet and then fall right back down fast and zoom back up.  When I made it to my home my family got in the car with me and we drove toward beach blvd to try to find what it was. As we turned onto Hodges again we saw the ball of light zooming around.  It flew over the Windsor realty office and when we got in the turn lane to get closer it flew above our vehicle, about 10 feet above us. And then we pulled into Cape House and it zoomed away from us. It seemed to hover 20 feet away and above from us. I took out my camera phone and tried to get a video but the quality is horrible. As I started to film it I felt like it was watching us. It was so weird and then my husband took my phone from me and tried to zoom in on it and lost the light in the image. Then it zoomed up over the cape house office building. So we drove into Cape House Apts. Trying to ! find where it had gone but we never saw it again. We drove around for about 20 minutes trying to find it again. Got home at 9:20 PM. So It ended at about 9:00 PM.  We thought if it wasn’t government or alien then maybe someone had a gas powered flying toy that they modified with blue/red/pink lights. I don’t understand why no one else driving around noticed this thing and tried to find it too. It was so bright and flying so close and all over Hodges Blvd.  I want to say it was maybe a foot long of light but I couldn’t get a good view of it because of the bright light. It was so fast. I have no idea what it is. The lights did not blink. It was like a bright ball of light maybe a foot wide. NO sound. After the ball disappeared a Plane came by flying kind of low and we wondered if that was government coming to find out what it was too. Or maybe the plane had dropped a drone in that area. I'm stumped. The light seemed clear but we couldn't tell what it was attached too couldn't see anything but the light.",
      "link": "http://www.nuforc.org/webreports/114/S114049.html",
      "state": "FL",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c31",
      "summary": "Orange/Red UFOs.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2014-09-18T00:00:00",
      "story": "Orange/Red UFOs. I was on San Jose Blvd turning to Baymeadows Rd.  The second I turned onto Baymeadows Rd, I saw over 30 big bright orange/red circles right above the tree line.   I couldn't believe what I was seeing, so I made a u turn to capture it on video.  When I pulled over, there were 50+ above me and some were moving fast, some just disappeared and than others appeared.  They were moving together and were going around in circles around San Jose and Baymeadows Rd.   When I took the first few pictures my battery was at 37%, and out of no where while I was recording the video, my phone dropped down to 2% and about 10 of those same objects  came right above my car and turned from a red color to white and made a horrible static sound.",
      "link": "http://www.nuforc.org/webreports/113/S113520.html",
      "state": "FL",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c9a",
      "summary": "((HOAX??))  I finally have it on tape.",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2014-09-25T00:00:00",
      "story": "I finally have it on tape. I finished giving my dog a bath outside in the front yard and I looked up in the sky and there is a object with blue and red lights flashing really fast.  I  heard a helicopter in the distance, but when the sound went away and the object was still in the sky, I knew it was not a helicopter.  The movement that the object was making was not of a helicopter or plane.   I left my home to follow it, and when I got to a close enough location it disappeared and appeared on the other side of the street in different colors.  Now it was flashing green and yellow lights.  It dropped below the tree line and didn't appear again. ((NUFORC Note:  Possible hoax, we wonder.  Witness elects to remain totally anonymous; provides no contact information.  Hence, we are unable to invite the individual to forward the photographic evidence to our Center, which he/she has not done.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113814.html",
      "state": "FL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2da3",
      "summary": "At a glimpse while driving on 9a headed towards San Jose before the Phillips hwy exit,there was a black egg/cigar shaped object with gr",
      "city": "jacksonville",
      "shape": "egg",
      "date": "2014-09-18T00:00:00",
      "story": "At a glimpse while driving on 9a headed towards San Jose before the Phillips hwy exit, there was a black egg/cigar shaped object with grey spiral design (about the size of a small economy car) that shot straight up out of the trees.   This happened in a matter of seconds.",
      "link": "http://www.nuforc.org/webreports/113/S113596.html",
      "state": "FL",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e24",
      "summary": "Orange oval object, hovering in one place for about 30 secs, then makes a large circle and vanishes.",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2014-08-15T00:00:00",
      "story": "Orange, oval object, hovering in one place for about 30 secs, then makes a large circle and vanishes I was driving, people were shooting fireworks behind me, but I saw something hovering about 200 yards above me.   It was oval and bright orange, and was not moving, which is what caught my eye.  I stopped the car and tried filming it.  I only got about 20 seconds worth of footage, but what I captured was the orange oval rising in the sky.  It made a circle then vanished.",
      "link": "http://www.nuforc.org/webreports/112/S112357.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c303f",
      "summary": "Dark black saucer hovering over tree line.",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2014-08-22T00:00:00",
      "story": "Dark black saucer hovering over tree line 1 noticeably dark black craft hovering just above tree lines, still hovering as I write this!  Noticed 3 lights come on then go off..   It was very cloudy out this morning, but the craft was very noticeable.",
      "link": "http://www.nuforc.org/webreports/112/S112669.html",
      "state": "FL",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c384c",
      "summary": "I saw 3 objects  one was flaming red with 4-6 flames beneath the other 2 were just red lights",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "I saw 3 objects  one was flaming red with 4-6 flames beneath the other 2 were just red lights I was heading south on a residential drive in westside jax fl to go to the store, looking forward driving I noticed a bright ball of red flame with 4-5 flames coming down from bottom of the flaming ball.   Since this was New Year's Eve, I thought the object was some fireworks but had no sound.   I slowed down to look at object ahead of me and I noticed the two other objects, a total of 3.  Being in  communication technologies I thought it was a radio tower but realized there were no towers by the house in this direction.  They were in a triangle formation.   The object that was flaming was the top left (east) of triangle.  The other two, one was to the right (west) horizontal to the flaimng one.  The third was below the other 2 and in a center position.   As  I turned left there were several couples with children walking , they were all looking and pointing at the objects.   As I ended the street I lost sight of the 3 objects due to trees and houses. I took a right turn an! d saw the flaming object still in the same place.  The other 2 objects were gone.   People walking on Blanding blvd were also looking and pointing at the object too.  I was not the only one who saw this.  The flaming one stayed stationary till I reached the next light.  The object was still flaming, then it moved toward the east at a fast pace and was gone.  It did not go away in a flash.  This all occured just 1 air mile away from Naval Airstation Jacksonville (NAS JAX)",
      "link": "http://www.nuforc.org/webreports/116/S116447.html",
      "state": "FL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c385a",
      "summary": "Shiny, metal, objects flew over my house.  I have video.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2015-01-26T00:00:00",
      "story": "Shiny metal objects flew over my house, I have video. I was outside flying a quadcopter and looking up and spotted a group of shiny objects heading Northeast at a fairly fast rate.  They were \"dancing\" around each other including going backwards, I assume they were slightly above cloud height.  There was no sound, although I can't hear aircraft at that height either, they clearly were not aircraft or balloons.  I ran and grabbed my cell phone and recorded about a minute of it.",
      "link": "http://www.nuforc.org/webreports/116/S116952.html",
      "state": "FL",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c386d",
      "summary": "While laying in bed, I looked out of the window and saw a set of what looked like four lights hovering in the sky.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2015-01-26T00:00:00",
      "story": "On 01/25/15 at 9pm while laying in bed I looked out of the window and saw a set of what looked like four lights hovering in the sky. The lights were in a rectangular shape and larger and brighter than the surrounding stars. I witnessed several planes (more than ten and a very loud helicopter)fly by the area where the lights were so I could tell it was not a plane.  It was very big, very bright, very still and very quite. Now my neighborhood has alot of dogs and is normally a bit noisy, but since seeing and watching the lights in the sky it was absolutely silent outside. After about two and a half hours of watching the sky the lights appeared to shift into what looked like one light that wasn't as bright as the four. The lights then began to move slowly behind my house out of my sight to which I ran outside to see how far it had moved, and it was gone. I continued to watch the sky for about thirty minutes, as I was still stunned and shocked that the enormous light had disappeared so quickly. I also noticed that the planes that were flying by had stopped as well.  By this time its 11pm and I went to bed.",
      "link": "http://www.nuforc.org/webreports/116/S116962.html",
      "state": "FL",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c3dd3",
      "summary": "Silent bright orange sphere moving south to north at various speeds maybe 500 feet above tree line.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2015-07-10T00:00:00",
      "story": "Silent bright orange sphere moving south to north at various speeds maybe 500 feet above tree line. ((NUFORC Note:  Date may be flawed, but witness remains totally anonymous, so we have no way of contacting him/her to verify the date.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120268.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3eae",
      "summary": "I was sitting on my porch and I took a picture of some flowers. When I looked at the picture and zoomed in I noticed a small saucer.",
      "city": "jacksonville",
      "shape": "other",
      "date": "2015-06-15T00:00:00",
      "story": "I was sitting on my porch and I took a picture of some flowers. When I looked at the picture and zoomed in I noticed a small saucer like object in the distance.   The object has something protruding from underneath it.  It is hard to make out in the photo, but at the time that I took the photo, there were no sounds of any aircraft around my house.  When I looked up again the craft was gone. ((NUFORC Note:  Object appears to us to be an insect in flight, possibly a cicada.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119400.html",
      "state": "NC",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f53",
      "summary": "Smooth silver sphere in cloudless blue sky hovering at about 300 feet.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2015-05-29T00:00:00",
      "story": "Smooth silver sphere in cloudless blue sky hovering at about 300 feet On a cloudless day, in the middle of the afternoon, I was in the backyard of my in-laws house by the pool, talking to my husband who was about 40 feet away in the yard.  I looked up to admire the sky and was surprised to see a silver sphere sitting stationary in the sky about 390 feet above me.  It was shiny silver, looked like a pinball from a pinball machine except it was a brighter metal, like silver.   I could not discern any movement at all as I watched it, saw nothing that appeared to anchor it, saw no exhaust, etc.  It was fascinating.   Having grown up with access to a naval base, I am familiar with military craft, and this was nothing like an aircraft.  It also did not resemble any craft I have seen out of NASA, and did not resemble a balloon, blimp, or any other known craft I could think of.  If anything, I thought maybe it was a new type of drone, but I haven't seen a military or civilian one that was a perfect sphere like this was.   I turned to call my husband! so he could witness it and when I looked back up maybe a second later it had vanished.  No contrail, no clouds to disappear into, fairly open horizon, and I searched the sky trying to locate it again, but it was nowhere to be seen.  I have never seen a plane vanish that quickly.   It made no sound, I observed no lights or color changes, may have had a slight haze around it, but if so it was so minor it caused little to no distortion of the craft or air surrounding it.  I did not feel threatened by it, more surprised and curious.   There had been a plane that passed by at a much higher altitude and at a different point in the sky several minutes earlier, but it and its contrails were already gone, and I saw one or two several minutes later, and the were also at higher attitudes at different points and had contrails.   Date and time of day are not exact because I didn't report it right away.  We were not using electronics so observed no issues with them. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119175.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4351",
      "summary": "Green golf ball sized ball that was moving VERY fast and then disappeared a second later.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2015-11-19T00:00:00",
      "story": "Green golf ball sized ball that was moving VERY fast and then disappeared a second later. We were driving east down highway 202, around the exit for Southside blvd.  Me and my fiancee looked up in the sky and both saw the same thing:  A large green, low flying ball, about the size of a golf ball from its altitude.  It moved VERY quickly from north to south and then just disappeared, as if it had just blown up.  We didn't hear anything and it was gone as soon as it appeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123547.html",
      "state": "FL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4490",
      "summary": "On the night of November 9th, I saw a singular U.F.O come across the sky. The U.F.O was moving at rate faster than any plane or aircraf",
      "city": "jacksonville",
      "shape": "rectangle",
      "date": "2015-11-19T00:00:00",
      "story": "On the night of November 9th, I saw a singular U.F.O come across the sky.  The U.F.O was moving at rate faster than any plane or aircraft I've seen.  The object had a light blue aura surrounding it, the aura had a tail as well.  The tail was about 1/5 of total lenth. It appeared rectangular with a rounded front. It stared from the north west traveling south west. When it passed the rear seemed to have two white lights emitting out from it.  Appeared to be similar to a torch flame. 30 - 40 seconds later we heard a low grumble.  Shorty after seeing the U.F.O planes began to cross hatch the sky.  There was approximately 5 - 8 planes in a large spread over the close area of the sighting.  The planes then moved further out and back over the area for a time more than 30 minutes",
      "link": "http://www.nuforc.org/webreports/123/S123932.html",
      "state": "FL",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4801",
      "summary": "Heard the same event as another report",
      "city": "jacksonville",
      "shape": "",
      "date": "2015-11-20T00:00:00",
      "story": "Heard the same event as another report In reading  http://www.nuforc.org/webreports/123/S123930.html  I wanted to report that my Girlfriend, brother and I (as well as our 4 dogs, all of whom were disturbed by the sound) all heard a very low and abnormally long grumble sound the evening of Nov. 9th that caused us to go outside and try to identify its source.  The mentioned report's description and time match what we heard, although we never saw anything (I reported that it was approx 8pm, but I am afraid that I don't remember exactly... Jeopardy was over... I remember that for sure).   I can not stress enough how odd this sound was - both audibly and in duration.  I think we must have heard the same thing your witnesses did.  Probably no reason to post this as we didn't see anything but I wanted to let you know.",
      "link": "http://www.nuforc.org/webreports/124/S124203.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ef3",
      "summary": "((HOAX??)) I stepped outside during night hours and look up to the sky, because I'm a skeptic.  Started seeing these odd white lights.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2016-03-04T00:00:00",
      "story": "I stepped outside during night hours and look up to the sky, because I'm a skeptic.  Looked around and starting seeing these odd white and orange/red flashing lights shaped things flying like gravity in steady motion and others could move fast saw little line beams of light as if shooting eachother I'm guessing.  Looking at the sky the next night I sew fear of them but they just float around.  I tried to search for anyone else who might have knowledge of what they are but few mindless people think they are drones as an excuse...naive people open your eyes (finally seeing the truth of what's going on around us)",
      "link": "http://www.nuforc.org/webreports/126/S126060.html",
      "state": "FL",
      "duration": "2 sequential nights"
    },
    {
      "_id": "64d005f478aba2ec5a3c5097",
      "summary": "2 side-by-side green lights moving super fast and were super loud.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2016-03-04T00:00:00",
      "story": "2 side by side green lights moving super fast and were super loud. Super fast moving and loud.. Enough that it shook the house.  Two flying very close to each other and looked like jets but each only had one green light on the bottom. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126171.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c526d",
      "summary": "Football field-sized aircraft with bight, green lights hovered for 2,5 minutes.  Video shows lights flashing like sending a code.",
      "city": "jacksonville",
      "shape": "rectangle",
      "date": "2016-01-05T00:00:00",
      "story": "Football field-sized aircraft with bight, green lights hovered for 2,5 minutes.   Video shows lights flashing like sending a code. Large aircraft (size of a football field) with bright, greenish lights rose from behind the trees and hovered in the same spot for almost 2.5 minutes.  The aircraft appeared and disappeared at a high rate of speed, faster than any aircraft I am aware of while working in the aerospace industry.   Although the lights appeared to the naked eye to be solid and not blink, the video shows white lights blinking intermittently as if they were sending a code.   The two people I have shown the video to are a retired federal agent and defense subcontractor which both have stated the aircraft was not of this world.",
      "link": "http://www.nuforc.org/webreports/124/S124907.html",
      "state": "FL",
      "duration": "2.25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5376",
      "summary": "I noticed the moon had a ring around it and then saw a multi colored object in the sky.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2016-01-05T00:00:00",
      "story": "We had a rare power outage last night at approx 04:30.  I was unable to sleep so walked out to the back yard.  I noticed the moon had a ring around it and then saw a multi colored object in the sky.  It was changing colors rapidly.  It hovered in that spot for maybe a minute or two.  It then just zipped away going up in a very quick and sudden movemwnt.",
      "link": "http://www.nuforc.org/webreports/124/S124801.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c547e",
      "summary": "Pulsating white light on flying object that hovers in same area for a long time.  ((NUFORC Note:  Possible sighting of Sirius?  PD))",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2015-12-17T00:00:00",
      "story": "Pulsating white light on flying object that hovers in same area for a long time. This is the 2nd time a pulsating object has been seen in the same part of the sky in the past 2 weeks.  This object appears to hover and has pulsating white light that appears to move around the object.  There is also a noticeable blue light that is only seen sometimes.   My first encounter was about 2 weeks ago and I quickly went to get my husband and was also joined by my daughter.  We all agreed it was not a plane or helicopter.  On this occasion, I noticed another smaller pulsating light to the right of the first one.  I don't know how long either of them stayed as I only watched for around 30 minutes.   Last night, I showed both my parents, this was after my husband and daughter both viewed it first.  My dad said it could be military and it might be over water.  It was quite a distance away.  We watched for around 15 minutes.  The object never moved. ((NUFORC Note:  Possible sighting of Sirius?  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124630.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c568a",
      "summary": "A floating ball of light that zig-zag's at light speed leaving a light trail.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2016-07-08T00:00:00",
      "story": "A floating ball of light that zig-zag's at light speed leaving a light trail. I was traveling back from Ohio to Florida and it was dark outside.  I was in the back seat watching the stars as we were driving and listening to music when all of sudden i see a bright light about 10 above a 30-40 foot tree. It was a ball,  The color was orange. I could tell it was moving at about 30-40 mph as we were traveling at 70 Mph on a freeway and it was moving by slow.  After we passed it I shouted at my sister to look and she looked back and as she looked back we saw the ball zig-zag SUPER fast.  It was so fast it left a light trail, then fade away.  She saw it too as she said \"Wow!\"  I tried recording it but i just couldn't pull my phone up to do it, something wouldn't let me.",
      "link": "http://www.nuforc.org/webreports/128/S128245.html",
      "state": "FL",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c57d3",
      "summary": "Massive black triangular shaped craft with three lights at each point slowly hovering without a sound about 100 feet above the treeline",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2016-06-10T00:00:00",
      "story": "Massive black triangular shaped craft with three lights at each point slowly hovering without a sound about 100 feet above the treeline.",
      "link": "http://www.nuforc.org/webreports/127/S127767.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5810",
      "summary": "A fast-moving, pentagon-shaped object rapidly transiting across the norhtern face of the moon.",
      "city": "jacksonville",
      "shape": "other",
      "date": "2016-06-24T00:00:00",
      "story": "A fast-moving, pentagon-shaped object rapidly transiting across the norhtern face of the moon. Observation of a Fast Moving Lunar Transit Anomaly Jacksonville, Florida, June 23, 12:31 EDT.   At about 0:31 hours (12:31 EDT, to the nearest minute) this morning, I was observing the waning gibbous moon from our driveway with a 4.25” f/6 reflecting telescope.  At the time, I was using a magnification of about 100X with a # 21 orange filter.  Although the rising moon was still low in the SE, seeing was quite good, and there were no clouds or haze. While observing features on the lunar terminator near Mare Serenitatis, I noticed a fast moving, solid black pentagon-shaped object traversing from west to east [moving from the terminator roughly in the direction of Mare Imbrium] across the lower (mid-northern) portion of the moon.  The estimated time of passage before it swept out of the eyepiece’s field of view was – my best guess – well under five seconds.  As I was not wearing a watch, I immediately went inside and looked at a wall clock (known to be accurate within a minute or so), and recorded the time. The most unusual aspect of this observation was the shape of the object.  Because it swept across the field of view so rapidly, I am not 100% sure that I am getting this exactly right, but my recollection is that its silhouette was something between a pentagon and a five-pointed star, as shown on the accompanying drawing.  This rendering is based on a quick pencil sketch that I made within a few minutes of seeing the object.  The thing that sticks in my mind is that this object was inky black and perfectly symmetrical – with no change of shape or tumbling effect as it crossed the face of the moon. As to the object’s size, I have tried to relate it to some of the named lunar craters in this area, and – again, to the best of my ability – it seems to have had an apparent angular size midway between that of Menelaus (27 km) and Manilius (39 km), so my best guess would be an apparent size of about 30 km, as projected against the lunar disc. Based on its eastward trajectory, moving roughly in line with the ecliptic, my suspicion is that this is some kind of large, earth orbiting satellite – but what could it be?  Although I have never witnessed a lunar transit by the International Space Station, I am familiar with its appearance, both as it has been imaged in telescopes and as it has been photographed traversing the moon, but the object that I observed looked noting like this. Has anyone else seen anything like this? ((NUFORC Note:  Witness provides very nice illustration of what the object looked like in the field of view of his telescope.  PD)) ((ADDENDUM #1 FROM WITNESS)) Hello Peter -- Thanks for your follow-up email on the report that I submitted this morning.  You wrote: \"You do state in your report that the object appeared to be moving from west to east.  Am I correct in assuming that your statement implies west to east, as the witness faces the Moon, and not as he is looking at the (reversed) image in the telescope?  I think your drawing pretty well answers my question, but I would like to be certain on that point.\"  Yes, you are correct, moving from west to east across the face of the moon as shown in the diagram.  In my reflector's eyepiece view, everything is of course inverted but not mirror reversed, and I corrected for this in the drawing.  Always confusing.  One of these days, I am going to get a good penta-prism so I can get non mirror-reversed views in my refractor, lol. Of perhaps more interest, I shared my report with a friend, a retired aerospace engineer [His wife is a retired aerospace engineer, too, lol.] who was able to take the data -- with a few assumptions about a probable earth orbit height -- and perform the following simple calculations: ((calculation)) Hello ((witness name deleted)), You don't need trig for this one, just algebra. 30km (object)/ 376364km (Earth, Moon Distance - surface to surface) =  X/200 miles.  Solving for X, we get .0159 miles which at 5280 ft/mile  gives a size of approximately 84 feet, about right for a large spy  satellite or old booster tank.  Likely just more space junk. ((name deleted)) PS. You may find this site interesting. http://www.stuffin.space/ Click  on an object to see what it is. Hummmm.  84 feet is not as large as I thought it might be, but it would seem to \"fit\" the data pretty well  I remain puzzled by the odd symmetrical shape, but perhaps this is the way that some satellites are constructed.   Anyway, thanks again for the follow-up on the report.  My feeling is that we have now, most likely, gone from a \"UFO\" to an earth satellite, albeit of unknown origin, lol.   PS--Yes, you have my permission to post the drawing, and -- if possible -- it might be interesting to post Richard's back of the envelope calculations as well as a postscript, so long as there is no need to specifically identify him. PPS--I always enjoy hearing your segment on Coast to Coast, and hearing about what other people are seeing in the sky these days.  As I have mentioned to you, my only \"real\" UFO observation was made back when I was a kid -- almost sixty years ago, now.  The truly amazing thing is how much data has been gathered about this phenomenon over all of the intervening years, but how little we still seem to know about what it all really \"means.\"   Clear Skies -- ((name deleted)) ((END ADDENDUM #1)) ((BEGIN ADDENDUM #2)) Hello Peter --        As for my friend's calculations, you are correct, there was indeed some bootstrapping involved, lol.  At my suggestion, he made the assumption, as a starting point, that the object was in low earth orbit at an arbitrarily chosen altitude.  Then, he applied the simple geometric calculations that you see to get its approximate size.           Obviously, if the object was not in this type of orbit -- in a higher orbit, or much closer to the lunar surface -- then it becomes much larger, and far more problematic in terms of an explanation.  The limiting case would be a huge object -- on par with the diameter of a moderate sized lunar crater -- flying at incredible velocity over the face of the moon.  Think Independence Day II, lol.        On the other hand, its [unhappily, not very well] observed transit time can also serve as a geometric limiting factor.  That is, if something is seen to cross the entire face of the moon in, say, five seconds, then this (from the application of simple geometry) gives us a strong indication about where -- and how fast -- it must be moving relative to the earth and the moon.  In this case, all of the parameters, working backward, seem to \"fit\" the more mundane explanation that this is some kind of earth satellite, but it still might not be... Going Down the Rabbit Hole        As I mentioned in my last email, the most interesting / deeply troubling aspect of all of this is that most of us -- you, me, and the Coast listenership -- seem to be struggling to come up with some kind of logical, rational, and more or less coherent and comprehensible \"model\" of what the UFO phenomenon is all about and what it might actually \"mean\" in practice.  Sadly, this is not the model that \"our\" government seems to be pursuing -- cf, the contributions of everyone from Richard Dolan to Dr. Steven Greer -- and we never seem to get much closer to a real understanding of what is happening.        As I remember you observing many years ago, such a deliberately orchestrated denial / obfuscation of reality is absolutely toxic to our form of representative government, and this would help to explain everything from the pent-up anger of the public [The Brits seem to have voted to leave the EU yesterday.] to the near total dysfunction of Official Washington.  We are, at best, living in a carefully manufactured official reality where very little is what it appears to be, including the sundry aerial phenomena that you record every day, and yet nothing much is \"done\" about it.        Unlike the more optimistic assessment of Dr. Greer and others, my fear is that we live in a world in which anything like official disclosure (or even a simple confession of ignorance as to the exact nature and purposes of the phenomenon) may never occur, and The Powers That Be will simply do whatever is necessary to make sure that their version of reality \"sticks,\" even though an increasing majority of citizens know better.  How our present system of government can survive such a dual reality in which everyone knows that its public officials are lying in their teeth about important things is open to question*, but it took quite a while for the Soviet system to implode, and TPTB now have much better \"tools\" with which to mold / coerce society**. *As seems to be taking place in the election of 2016, lol. ** See, for example, Jane Mayer's recent book, Dark Money. As a number of people in the field of ufology seem to be calling for at this point [Many of these people have appeared on Coast and in other venues.], perhaps the best that we can do is to continue creating a citizen-sourced, distributed network model type of investigation that simply gives up on the idea the gov'mint will ever come clean with the public in this area.  Instead, we will, I hope, end up with something like a Wikipedia of UFO-related material that will constitute (for most people, probably) a viable alternative to the manufactured \"reality\" that the government and / or TPTB continue to shovel in our direction.  Then, based on this open, public consensus version of reality, perhaps we can begin to \"do\" something--whatever this might turn out to be--about our objective situation vis a vis the things that everybody keeps seeing in the sky. Thanks, as always, for your help with this -- ((witness name deleted)) ((END ADDENDUM #2))",
      "link": "http://www.nuforc.org/webreports/128/S128024.html",
      "state": "FL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c58e4",
      "summary": "While stargazing, an ultra fast moving, glowing (white/yellow) object appeared in a clear, cloudless sky.  ((anonymous report))",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2016-06-01T00:00:00",
      "story": "While stargazing, an ultra fast moving, glowing (white/yellow) object appeared in a clear, cloudless sky, much like any shooting star might suddenly be spotted as it enters the atmosphere.  It initially appeared to be moving slightly downward and was thought to be just that, a meteorite.   It then appeared to level out ever so slightly, still at very high altitude.  It had a Southern heading.   As it was tracked visually, its abnormal shape became more apparent.  The chevron-like outline was the only part that appeared to glow (now a white/blue) and thus was clearly visible, but the interior portion, while difficult to make out, was definitely opaque (making the object a triangle rather than just a chevron).   Just before the object left line of sight, it abruptly and instantly changed direction and increased speed, heading East, toward the Atlantic coastline.  There was no trail, haze, or sound throughout the duration of this sighting. As a military veteran, I initially suspected some sort of stealth craft upon recognizing the unnatural shape, but nothing in the United States military arsenal (that is known publicly or that I've seen during my time in service) can travel that fast or instantly change direction at such speeds. This was my first unidentified flying object sighting. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127613.html",
      "state": "FL",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c58f1",
      "summary": "Free floating Orbs above Sunbeam Road in Duval County, Florida.  I watch sober.",
      "city": "jacksonville",
      "shape": "oval",
      "date": "2016-05-20T00:00:00",
      "story": "Free floating Orbs above Sunbeam Road in Duval County, Florida.  I watch sober. Almost every night, a large orange orb in the sky that is located above Craven road off Sunbeam Road in Jacksonville, Florida.  A planet does not move at will nor do stars while this orb does.  I looked at it one night and thought to myself, if this thing is satanic, evil, it has to do what I say, as that is what the bible says.  So, I looked at and “thought clearly”, “Move away from me if you are evil. “Here’s the weird thing; It did just that. It has two orbs below it that blink constantly.  One blinks dark blue and light blue and the other blinks red, white and green.  The red white and green orb has actually moved on its own, much like a drone, but there are no drones that look like it.  This orb has a saucer shape but you can only see an outline as if it is covered in camouflage paint, it blends with the night sky.  Again, there are no drones that are like this.  It is the size of a very large helicopter but completely quiet, not even a whistle sound like a drone would make. They seem very curious about the people in the apartment complexes on Sunbeam Road for some reason as well.  I have observed a figure with only an outline walking by one of the buildings that looked too skinny and small to be a human. Shaped like a grey but, with a smaller head, barely visible.  These orbs seem to enjoy being near the hill located by Sunbeam Road across from the veterinarian hospital but they have moved location, sometimes sitting above the post office in front of the trees.   There is also an isosceles Triangle located above Sunbeam Road that changes locations quite often and has an odd rounded shape at the bottom. I get a very creepy feeling when I look at it, almost like someone is staring at me.  I have made the attempt to create a drone to fly towards the red, white and green orb, I call it Italy, but, I am stuck trying to figure out a good power source to fly that far.  I also do not want it to destroy or take my drone nor assume it to be a hostile attack.  It has flown directly over a plane one night, very slowly, showing its size.",
      "link": "http://www.nuforc.org/webreports/127/S127368.html",
      "state": "FL",
      "duration": "continuous"
    },
    {
      "_id": "64d005f478aba2ec5a3c58c8",
      "summary": "Bright Orange Orbs Over Jacksonville Florida",
      "city": "jacksonville",
      "shape": "light",
      "date": "2016-05-20T00:00:00",
      "story": "Bright Orange Orbs Over Jacksonville Florida I wanted to share this because Jacksonville seems to have lots of orange orb sightings.  February 15, 2012, @ about 1950.  Just West of Hodges Blvd. on Beach Blvd. in the Wolf Creek housing development, Jacksonville, FL.  Two bright orange lights in South-Western sky.  They were separated horizontally at about 45 degrees and maybe a mile or so vertically.  The bottom light was to the left of the top light.  I watched them for a few minutes and the bottom light started moving to the right.  When it was almost lined up with the top light, the top light started to move South-West very rapidly.  The bottom light started moving South-West also a few seconds after the first.  They both moved extremely fast and disappeared in the distance. I left the spot where I first spotted the lights and drove about two minutes or so to another part of the housing development.  I made a right on another road and the two objects were back in the same part of the sky.  I drove back to the original spot. They were arranged different.  The top one was to the left of the bottom. They sped off tho the South-West again.  Amazing!  The second time I saw them, there were two other people watching the lights.  We did not speak. Later that night I saw at least 8 more orange orbs moving though the sky.  They could have been Chinese lanterns, but they were not flickering like there was a flame.  The were solid orange and very bright.",
      "link": "http://www.nuforc.org/webreports/127/S127420.html",
      "state": "FL",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3c597a",
      "summary": "Large triangle craft.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2016-05-20T00:00:00",
      "story": "Large Triangle Craft This was a big triangle.  It didn't have the lights on the bottom that I have read about but it did have some faint lights around the perimeter and they were blue.  I live about 6 miles north west of NAS-JAX and it came from that direction so I assume it is very possible this was a military aircraft but it doesn't make a lot of sense to me that they would fly secret craft over very populated areas.  Anyway it was moving very slow and you could really only even make it out, at first, because of the perimeter lighting.  I am no aeronautical expert by any means but it was certainly lower than the normal craft we see flying around here (but I don't know what that elevation is...) I am going to guess that it was at around 8 to 10k feet.  This just happened so I am a little excited, I apologize if I am skipping around. After a couple of minutes it got brighter - significantly brighter - and then sped away very, very quickly - still heading north-west.  I only even went outside because my dogs were barking at the door yet no one was there.  I didn't even think to mention that until I got to the part of your form that asked if animals noticed.  I did take a picture on my phone but there is nothing there.  You can't even see the outline.  I can send it if you think you could find something on it.",
      "link": "http://www.nuforc.org/webreports/127/S127366.html",
      "state": "FL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a90",
      "summary": "Orange 5 ufo formation.",
      "city": "jacksonville",
      "shape": "formation",
      "date": "2016-04-29T00:00:00",
      "story": "Orange 5 ufo formation Driving south on Monument road towards intersection with Fort caroline road, a half a mile away from same I saw 5 orange spherical lights in horizontal bow like formation flying away from me. I started recording, and I passed them by directly underneath the last 2 crafts, no sound was recorded being this lights as high as or lower than a helicopter, no blue and red blinking lights were seen or recorded by camera, I turned at the end of Monument and turned right on caroline road, entering to my left the front yard of a church Stoped but the lights dispersed and only one remained static, but I was unable to get a good angle, so took on Monument Ave.  In the oposite direction going north, I captured 2 lights at the time moving, static, more coming behind in pairs up 3 or 4 more occasions, my engine blinking lights, passing by cars and even a woman's voice conversing with a male as well could be heard from the other side of the Monument road/blvd..  Though farther away while still recording, no sound was recorded of this objects, which moved slowly to finally slowly dimming its orange glow light to finally disapeared I've heard helicopters even athough a needle point view distance, have 16 segments of short videos lasting over 20 minutes. One more thing , a small blue light at the beginning trailing passing them by and later guiding them in the oposite direction as if reacting to my observations was only viewed in my review of the video, it was invisible to the naked eye.",
      "link": "http://www.nuforc.org/webreports/127/S127050.html",
      "state": "FL",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b35",
      "summary": "Light looks like satellite little biger, cover 50 grades of azimuth in 1 second, A=0 grades, H=56 approach, solid light. ((anonymous))",
      "city": "jacksonville",
      "shape": "light",
      "date": "2016-04-22T00:00:00",
      "story": "Light looks like satellite little biger, cover 50 grades (sic.  degrees) of azimuth in 1 second, A=0 grades, H=56 approach, solid light, trajectory semi parabolic.  NO tracks like meteorites. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126897.html",
      "state": "FL",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bdd",
      "summary": "I was sitting on bench in front of my place and looked up and saw a triangular shaped craft moving very fast. Then it stopped for a min",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2016-04-15T00:00:00",
      "story": "I was sitting on bench in front of my place and looked up and saw a triangular shaped craft moving very fast.  Then it stopped for a minute changed direction and moved very fast then stopped again.  Changed direction again and went very fast until out of sight.  A guy walking buy also saw it.  Had lights around it.  I never saw anything like it.",
      "link": "http://www.nuforc.org/webreports/126/S126847.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c94",
      "summary": "Fireball chased by jets.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2016-03-24T00:00:00",
      "story": "Fireball chased by jets. Saw a glowing fireball headed NNW at approximate 300 mph.  2 fighter jets followed.   Moved like it was gliding and had no definite shape.",
      "link": "http://www.nuforc.org/webreports/126/S126514.html",
      "state": "FL",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d3a",
      "summary": "Bright Light in Clear Sky.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "Bright Light in Clear Sky I was driving home with my mother on 11.14.16.  Once we turned into our complex I stopped at a stop sign.  I noticed an exceptional bright star and mentioned it to my mom. Then it went dim!  This freaked me out. I was sure it was the North Star until that happened.  We continued to our house but I kept my eyes on it.  The star started to move slowly behind a tree line near race track.   I ran into our house and pointed it out to my husband, from our backyard patio.  He insisted it was a plane but there was no blinking of red/blue lights.   It was just a bright light moving slowly.  I am beyond convinced that I saw a UFO. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131250.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c5ff7",
      "summary": "For 2 weeks, a bright star-like light appears in SW sky every night around dusk, then disappears.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2016-10-27T00:00:00",
      "story": "For 2 weeks, a bright star-like light appears in SW sky every night around dusk, then disappears. Two weeks ago, my boyfriend and i noticed what we at first thought was an intensely bright star just above the tree-line in the southwest sky.  It appeared to be moving extremely slow.  It appears every night just as the sky behind to darken, and disappears after 15 minutes or so.  It always appears around the same time and always in the exact same position in the sky, and always disappears before long.  Some nights, it is stationary.  Other nights, it very slowly drifts one direction or another.  No blinking or colors, although my boyfriend swore it had a green tail on one night.  I didn't see it that night, though.",
      "link": "http://www.nuforc.org/webreports/130/S130766.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6024",
      "summary": "Blue light hovering then zoomed away.",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2016-10-21T00:00:00",
      "story": "Blue light hovering then zoomed away. I was driving to work, saw a bright blue light hovering a mile or two south of me.  It stayed still for 20-30 seconds, then zoomed away faster than anything I've ever seen.",
      "link": "http://www.nuforc.org/webreports/130/S130664.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6086",
      "summary": "Saw small craft with white, blue, and red blinking lights hovering in one area then saw a triangle craft with light sound fly from mili",
      "city": "jacksonville",
      "shape": "light",
      "date": "2016-10-21T00:00:00",
      "story": "Saw small craft with white, blue, and red blinking lights hovering in one area then saw a triangle craft with light sound fly from military air base then saw 2 regular military aircraft (very loud) fly from air base. all began to follow the lights",
      "link": "http://www.nuforc.org/webreports/130/S130680.html",
      "state": "AR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c639e",
      "summary": "5 orange-yellow lights near I-295 E of Buckman Bridge, moving slowly vertically and horizontally.",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2016-09-02T00:00:00",
      "story": "5 orange-yellow lights near I-295 E of Buckman Bridge, moving slowly vertically and horizontally. 5 orange/yellow lights that were not airplanes.  They moved vertically and horizontally very slowly.   Observed from highway I-295 driving 65 MPH.",
      "link": "http://www.nuforc.org/webreports/129/S129574.html",
      "state": "FL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c644f",
      "summary": "At least 20 different colored shining objects in the sky that are moving.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2016-08-16T00:00:00",
      "story": "At least 20 different colored shining objects in the sky that are moving. There are at least 20 different colored lights in the sky, right across my house, and they're moving and shining at the same time.",
      "link": "http://www.nuforc.org/webreports/129/S129063.html",
      "state": "FL",
      "duration": "Still happening"
    },
    {
      "_id": "64d005f478aba2ec5a3c65b2",
      "summary": "My girlfriend noticed a bright star over one of the trees and pointed it out to me.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2016-08-16T00:00:00",
      "story": "On August 13, 2016, in south Jacksonville, FL, my girlfriend and I decided to take my telescope onto the golf course that is behind her house.  We walked out and onto the green on one of the holes and set up the telescope there.  My girlfriend noticed a bright star over one of the trees and pointed it out to me when we got out there but I insisted we look at the moon first.   After observing various objects in the sky approximately 15 minutes after my girlfriend noticed the bright star, I looked up and found the star, and proceeded to tell her I was going to try and locate it in the telescope.  We observed the bright spherical \"star\" for another 10 seconds before I turned to move the telescope.  We both took our eyes off of it for no more than 5 seconds and as I looked up the star was gone!  It was not a shooting star (wouldn't have stayed there for 15 minutes), not a satellite (once again wouldn't be up there that long in the same exact spot), what does th! at leave?  The event was one of the craziest things I've ever witnessed.",
      "link": "http://www.nuforc.org/webreports/129/S129244.html",
      "state": "FL",
      "duration": ">15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6675",
      "summary": "Three bright reds lights crossing the sky, and then straight up and out of sight.",
      "city": "jacksonville",
      "shape": "changing",
      "date": "2016-08-02T00:00:00",
      "story": "Three bright reds lights crossing the sky, and straight up and out of site. I was outside on the phone when I saw a large flickering red light moving west, then a second light, moving slow, then a third.   As they move closer, the light lowered, and one by one, they went straight up and out of site.   I managed to get my wife out to witness this, as well as a naybor.  I also videoed with my cell phone.   This was something I will never forget.  I'm glad I got to finally witness something like this for real.",
      "link": "http://www.nuforc.org/webreports/128/S128968.html",
      "state": "FL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c688f",
      "summary": "Circle shaped bright orange type craft moving S to N; no noise no blinking light.  ((NUFORC Note:  Missile launch.  PD))",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2017-03-23T00:00:00",
      "story": "Circle shaped bright orange type craft moving south to North no noise no blinking light it wasn't a aircraft that we use either plane or helicopter.   All of the sudden, it disappeared without any trace prior of vanishing bright light started to diminished until it was gone with no trace. ((NUFORC Note:  Launch of Delta IV out of Cape Canaveral at 20:18 hrs., 18MR17: http://www.space.com/36117-wgs9-military-satellite-delta-iv-launch-photos.html  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133194.html",
      "state": "FL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b95",
      "summary": "Bright, circular light in the sky unmoving.   ((NUFORC Note:  We suspect a celestial body.  PD)) ((anonymous report)",
      "city": "jacksonville",
      "shape": "light",
      "date": "2017-01-26T00:00:00",
      "story": "There is a bright light in the sky unmoving obviously not a helicopter the light seems to be circular no matter which side of it i drive to the light makes it impossible to see the object itself ((NUFORC Note:  We suspect a celestial body, possibly Jupiter.  If the time indicated by the witness is p.m., then the object may be Venus.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132292.html",
      "state": "AR",
      "duration": "Ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b59",
      "summary": "Oval with flashing green and red lights, hovering and no sound.",
      "city": "jacksonville",
      "shape": "other",
      "date": "2017-02-03T00:00:00",
      "story": "Oval with flashing green and red lights, hovering and no sound. Hovering object believed to be a smaller plane at first with red and green flashing lights.  Bright white light at head of object.  Oval in shape with a elongated back.  Hovering just above tree line with no sound.  Drove past and noticed another one half a mile away flying towards other craft but unusually slow.  Also, no sound.  Noticed another about 3 miles away that flew slow and straight, the bolted upwards at a extremely fast speed.",
      "link": "http://www.nuforc.org/webreports/132/S132417.html",
      "state": "FL",
      "duration": "Ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c6bb7",
      "summary": "A total of 5 orange-red spheres/lights spotted in Jacksonville, FL 01/01/2017.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2017-01-19T00:00:00",
      "story": "A total of 5 orange-red spheres/lights spotted in Jacksonville, FL, 01/01/2017. Sighting date/time:  January 1, 2017, at approximately 12:07AM  Objects:  Orange-red lights/spheres   Location:  Mandarin area of Jacksonville, FL. Conditions:  Clear evening sky with some cloud formations visible. Total time frame of event:  2-3 minutes   Observers:  Two women (65 and 32 years of age)   At approximately 12:07AM, January 1, 2017, a total of 5 bright orange-red spheres were spotted between 60-70 deg. from the horizon, traveling in a Westerly direction.  Spheres were situated lower in the sky than a plane would fly and no contrails were seen. Sequence of events:  Three spheres initially spotted from an open window moving slowly with no sound in an evenly-spaced  zigzag pattern, then hovered momentarily as a fourth sphere joined them.  \t* *         \t\t*                     *  From a driveway view, I saw the spheres shift into square formation for approximately 15-20 seconds ... *\t* *\t*  until a larger, brighter sphere  entered the area from East at a faster rate of speed than the previous spheres. The smaller lights then broke the square formation into a line and began traveling NW with the larger sphere at the rear until they were out of sight.",
      "link": "http://www.nuforc.org/webreports/132/S132149.html",
      "state": "FL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d9f",
      "summary": "Looking in the east night sky, two airplanes where flying in an echelon formation, approximately 10,000 feet. Appearing between the two",
      "city": "jacksonville",
      "shape": "light",
      "date": "2016-12-15T00:00:00",
      "story": "Looking in the east night sky, two airplanes where flying in an echelon formation, approximately 10,000 feet.   Appearing between the two aircraft, a bright white beam of light traveled in a straight and upward fashion which lasted approximately two seconds.  No sound was emitted.",
      "link": "http://www.nuforc.org/webreports/131/S131731.html",
      "state": "FL",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e5e",
      "summary": "Orb seen in eastern sky.",
      "city": "jacksonville",
      "shape": "circle",
      "date": "2017-07-07T00:00:00",
      "story": "Orb seen in eastern sky. I was sitting on my back porch looking east and a chrome orb appeared wobbled a little then disappeared.  We have lived here over thirty years and I have never seen anything like that!!!",
      "link": "http://www.nuforc.org/webreports/134/S134836.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c707e",
      "summary": "Flash of solid body with trail.  Anomalous movement.",
      "city": "jacksonville",
      "shape": "cigar",
      "date": "2017-07-23T00:00:00",
      "story": "Flash of solid body with trail.  Anamoulous movement. Cigar shaped craft, bright,  with small trail.  Moving South to north.  Upward trajectory.  Craft and trail vanished at the same time.  Distance undetermined. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135161.html",
      "state": "FL",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c71e0",
      "summary": "Jacksonville, FL.  Two bright orange lights moving south to north.  No “contrails” seen, no sound.  Second light followed same path.",
      "city": "jacksonville",
      "shape": "light",
      "date": "2017-07-07T00:00:00",
      "story": "July 4, 2017, 9:42pm: Jacksonville, Florida.   Two bright orange lights moving south to north.  No “contrails” seen, no sound.   Second light followed path of first light, approximately 10-15 seconds later.  Disappeared in extreme northern sky.   Sky was clear.   Difficult to determine altitude or speed, but seemed to be moving faster than typical aircraft.  Steady northward movement, but seemed to have gentle “zig-zag” motion in flight.",
      "link": "http://www.nuforc.org/webreports/134/S134948.html",
      "state": "FL",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7383",
      "summary": "((HOAX??))  saw a 30 yd. sphere about 50 yds from me about 200 yds up.  it maid a humming sound it disappeared. ((anonymous report))",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2017-06-15T00:00:00",
      "story": "saw a 30 yard sphere about 50 yards from me about 200 yards up.  It maid a humming sound it disappeared right in front of me. Freaky. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134528.html",
      "state": "FL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c744a",
      "summary": "Very dark Gray craft heading west on a direct path. Object appeared to turn into 3 shapes and then back into one solid object again.",
      "city": "jacksonville",
      "shape": "formation",
      "date": "2017-06-02T00:00:00",
      "story": "Very dark gray craft heading west on a direct path.  Object appeared to turn into 3 shapes, and then back into one solid object again.  Very hard to describe.   It was moving quickly west.  Seemed to pulse and change shape with regular intervals.   Object appeared to have a circular force field around it almost like heat distortion in a transparent circle around it.  The circle of distorted air shifted and was not there the entire time.   It was completely silent.  No lights, no sound.  Object was mesmerizing.   Object looked very complex, no reflection, not \"metallic\" looking.  Flat and almost back.   Morphing 3 objects and then into one solid straight line, over and over as it flew by overhead.",
      "link": "http://www.nuforc.org/webreports/134/S134379.html",
      "state": "FL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7618",
      "summary": "Green two-dimensional figure  ((anonymous report))",
      "city": "jacksonville",
      "shape": "other",
      "date": "2018-01-12T00:00:00",
      "story": "Green two-dimensional figure I was driving home and as I entered my neighborhood, I saw what looked like a neon green \"S\" and as i passed the object it slowly disappeared as a sort of \"tilt shift\" effect.  As if the object could only be seen from one angle and it was very large hovering in place making no noise.  The object was maybe 100-200 yards inn the sky and maybe 12-14 feet long from my perspective. I am writing this as someone who does not believe in \"ufos\" and immediately tryed to debunked this as being a drone but there is no way that it was.   I am sincerely spooked out by what I just witnessed because with my knowlage of physics, nothing that I just saw was possible in any way.",
      "link": "http://www.nuforc.org/webreports/137/S137933.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c79a2",
      "summary": "Fast moving, black star-shaped object seen transiting the moon at 144X magnification.",
      "city": "jacksonville",
      "shape": "other",
      "date": "2017-12-04T00:00:00",
      "story": "Fast moving, black star-shaped object seen transiting the moon at 144X magnification. Another Lunar Fast Walker?  While observing the moon last night with a three inch (80 x 900 mm) refractor, I saw a black, star-shaped object transiting through the eyepiece field of view at approximately 17:57, EDT.  [Please see the attached diagram for more details.]  I was observing the Aristarchus - Herodotus area of the moon--near the lunar terminator at this time--with a star diagonal and a magnification of 144X .  The waxing gibbous moon was rising in deep twilight, and seeing was excellent.  At the time of the sighting, I had just switched to a 12 mm eyepiece with a 2X Barlow, and just as I was coming to focus with this combination I glimpsed a black, five-pointed, star-shaped object transiting from right to left through the eyepiece field of view (FOV). All of this happened very fast--probably in less than 1 second--and my impression is that when I first saw the object it had already begun to cross the FOV, and I was only able to observe it as it moved toward the left side of the image.  Again, please see the associated diagram for more details.  Note that since I was using a star diagonal which gives a mirror-reversed image, the object was actually moving from east to west--the opposite of what is shown in the eyepiece view. As a point of interest, this is actually the second of these objects that I have seen while observing the moon.  The earlier observation took place on June 23, 2016, and there is a report on file with NUFORC.  As memory serves--and going back to my earlier report to confirm my recollection--this is exactly the same type of object that I observed last year, and moving in the same east to west direction. As I am at best a \"casual\" (as opposed to a systematic) observer of the moon, I am wondering about the reported frequency of sightings of objects of this type.  Given that I have now seen two of these within the space of a year and a half, it would seem to me that others must also be seeing them.  But what is it, exactly, that I and presumably others are seeing?  ((name deleted)) Jacksonville, FL",
      "link": "http://www.nuforc.org/webreports/137/S137512.html",
      "state": "FL",
      "duration": "~1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ab9",
      "summary": "I was out on my front porch around 8:24 pm and just happened to look up above my place and saw what looked like 2 bright stars in the s",
      "city": "jacksonville",
      "shape": "light",
      "date": "2017-11-09T00:00:00",
      "story": "I was out on my front porch around 8:24 pm, and just happened to look up above my place and saw what looked like 2 bright stars in the sky in a line formation.  I watched for maybe 2 mins as they moved very slow, and then gradually disappeared in the night sky.  They were moving towards the East from the direction I was sitting.",
      "link": "http://www.nuforc.org/webreports/137/S137104.html",
      "state": "FL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b5a",
      "summary": "Craft was flying at about 2500 feet shaped like a chevron with 7 dome lights on the bottom. The craft was almost translucent and the 7",
      "city": "jacksonville",
      "shape": "chevron",
      "date": "2017-10-19T00:00:00",
      "story": "Craft was flying at about 2500 feet shaped like a chevron with 7 dome lights on the bottom.  The craft was almost translucent and the 7 dome lights were barely visible you could almost see through the light source itself. Direction of travel was from north to south and weather was clear.  No sound was heard and moving at approx 150 knots.",
      "link": "http://www.nuforc.org/webreports/136/S136739.html",
      "state": "FL",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b16",
      "summary": "Louver-like design, lights emitted no light pollution, Hovered slightly above clouds.",
      "city": "jacksonville",
      "shape": "diamond",
      "date": "2017-10-19T00:00:00",
      "story": "Louvre like design, lights emitted no light pollution,  Hovered slightly above clouds. My understanding of these sightings in the past to me have been that these people must be of not sound mind.  Simply put that has changed.  I now have been a witness and through thorough online research have found many other conversations of this nature.  My wishes in this letter are that I bring to attention a possibility of a defense flaw in our technology, also a possibility to learn from their designs as well as seek video evidence which will allow a reverse engineering if possible of the technologies in which they use. I went outside at 3:48 am 10/13/2017 at 30°15'58.5\"N 81°44'01.4\"W I saw clear as day a diamond shaped object with a blunted rear.  Large cylindrical shaped matte green lights were similar to doughnut shaped circles that were phosphorescent but did not emit any light pollution outside of the light itself or within the center.  I believe this was caused due to a magnetic field as the light would normally have emitted a void within the center.  It was not far I would estimate 500ft up at most or whatever the ceiling height of the cloud cover was.  About 200 ft away to the SW.  Size of about six houses maybe as large as twelve in mass.  I was awestruck at the magnificence and engineering that went into it.  I could see the louver like body on the craft and the design was like plates were set similar to a red clay roof as if the heat was dispersed by the space behind each plate.  The sound may be in the video however my ac unit could have caused that.  I would pass any lie detector test on this I am 100% certain of what I saw. I am going to do my best to have an image rendered.  I could pass a lie detector test on this. I was not open minded on this and grew up in Bermuda.  I am now very interested and am setting cameras up to record any anomalies. I have video however it may need some editing to be able to get a clear view of what I saw. When I saw it it rolled right and turned slightly leaving my sight.  It was clear as day.",
      "link": "http://www.nuforc.org/webreports/136/S136756.html",
      "state": "FL",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b32",
      "summary": "UFO sighting - detailed - close up",
      "city": "jacksonville",
      "shape": "diamond",
      "date": "2017-10-19T00:00:00",
      "story": "UFO sighting - detailed - close up I was standing outside and looked up to see the most magnificent engineering feat my eyes have had the pleasure of witnessing.  The structure, design, and detail I was able to see with the moon out as bright with the angle it hit it was amazing.  The engines had a green matte color and emitted not light pollution outside of the doughnut shaped engine looking halos. I could see louver like plates seemingly used to disperse heat possibly.  I saw little of the top only the side and rear as it made a slight roll to the right and into the distance above the treeline.  The UFO was about 500 ft away at most and the size of about 24,000 sq ft+ .  I pulled my cell phone out to take video and when I did my eyes were blinded by the light of my phone screen.  I used the phone to record but I got no video just all black. I recored another video for a control video thirty minutes after since I was seeing no footage and I could see the clouds where the object was.  I was not a believer before I saw one and now I can say I have a new interest indeed.",
      "link": "http://www.nuforc.org/webreports/136/S136780.html",
      "state": "FL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d1b",
      "summary": "10 orb-like blinking objects seen flying during the day,",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2017-09-21T00:00:00",
      "story": "10 orb-like blinking objects seen flying during the day, Two friends and me were on our road, just talking.  Looked up and noticed what appeared to be a blinking light.  This is when I noticed several of these blinking orb-like objects.  In total there was around 10 of them flying towards the west.   Made no sound, which would rule out helicopters or other aircraft, and were definitely not drones.   They eventually disappeared.  Whole sighting was around 6 minutes.",
      "link": "http://www.nuforc.org/webreports/136/S136244.html",
      "state": "FL",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e6f",
      "summary": "Very quickly a white disc shaped object zoomed down almost to the water then E and W.",
      "city": "jacksonville",
      "shape": "",
      "date": "2018-05-10T00:00:00",
      "story": "I was on telephone with my brother March 3. 2018, looking out my living room window facing beautiful waterfront right at dusk.   Very quickly a white disc shaped object zoomed down almost to the water then east and west and almost to ground at end of Pottsburg Creek; object zoomed across my view and disappeared.   I was unable to hit video on phone but did press camera.  Zoomed (1 second) to south and disappeared. I was yelling on phone to my brother “hold on hold on something over water flying over water”.  My brother asked what but continued our conversation.   I have included original picture and enlarged picture the best of my ability.",
      "link": "http://www.nuforc.org/webreports/139/S139802.html",
      "state": "FL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c817a",
      "summary": "Strange rotating lights by Jacksonville airport",
      "city": "jacksonville",
      "shape": "sphere",
      "date": "2018-02-22T00:00:00",
      "story": "Strange rotating lights by Jacksonville airport It was around 8:30 last night in Jacksonville and a clear night.  From my balcony at Eastport apartments which is within 5 miles of the airport.   My girlfriend and I were smoking a cigarette, when I saw a light with rotating light switching from left to right to right to left, and then up and a rotating light.  Also, the object changed direction rapidly.  We sit out here every night and I grew up by the airport.  So, I know a airplane when I see the lights at night.   The direction of the light/or lights was moving north.  Paralleling the airport and the object,  I can’t seem to change direction rapidly up-and-down and zigzag pattern and I would estimate that this is between my porch and the light had to of been 10 miles, if not more.   The lights were steady and change direction and every once in a while call us with flash as well as anyone else Sean this before?",
      "link": "http://www.nuforc.org/webreports/138/S138828.html",
      "state": "FL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8198",
      "summary": "Triangular formation of 5 extremely bright balls of light hovering in place in the sky.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2018-02-22T00:00:00",
      "story": "Driving down the road, we noticed a triangle formation of 5 extremely bright Balls of light hovering in place in the sky.  To the left of formation or our right there were three separate light orbs moving at a high rate of speed towards the main formation which was holding position, to the other side of the formation was a single one closing in on the main formation as well.  The craft appeared as incredibly bright balls of light flickering in and out a orange color.   As I started video recording, the 3 separate craft moved very fast and completely silently at a low altitude approximately 500 to 1000 feet in heigth and joined with the main triangle formation, at that point all the lights began to move north and faded out.",
      "link": "http://www.nuforc.org/webreports/138/S138839.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c827d",
      "summary": "The Spaceship was very close I was outside fixing to open a 40oz and I feltit and it was true I couldn't believe my eyes I didn't dare",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2018-09-27T00:00:00",
      "story": "The Spaceship was very close I was outside fixing to open a 40 oz and I felt it and it was true I couldn't believe my eyes I didn't dare look away it stayed as I studied it  The ship was perfect on top and bottom in disk shape it was black and reminded me of some kind of material from the ground I could see 3 windows rectangular windows from the second story of the apartment I tried to figure out all I could about this mother ship I called it cause my mom lived in front of me and I thought it almost wreaked and darted up My mother said she had burn marks in the shape of a circle in her back yard I couldn't figure out how it was so silent and hovering because I'd like to help in inventing faster air crafts or any knowledge that could help the USA I watched until it zipped faster then anything I could imagine out of the sky.",
      "link": "http://www.nuforc.org/webreports/143/S143166.html",
      "state": "AR",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3c82c2",
      "summary": "Bright orange streak following circumference of earth, then abrupt change in direction into space and change from orange to white.",
      "city": "jacksonville",
      "shape": "fireball",
      "date": "2018-09-27T00:00:00",
      "story": "Bright orange streak following circumference of earth, then abrupt change in direction into space and change from orange to white. On September 10th, at 12:30am, traveling home to Jacksonville, FL, from a vacation on the west coast of Florida, we noticed a bright light in the air over the St. Johns River.  We were traveling east on 295 about to go over the Buckman Bridge in Orange Park about to enter Jacksonville.  The light was bright orange traveling north then upward, it looked like a bright orange Nike swoosh, then turned into a white light.  At first I would have thought it to be a meteorite, but it was traveling along the circumference of the earth and made an abrupt change straight up, almost a 90 degree turn.  Then it changed colors from a bright orange to a white light.  My wife, two daughters and a friend all saw this light.",
      "link": "http://www.nuforc.org/webreports/143/S143098.html",
      "state": "FL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bfa",
      "summary": "Disc or circular objects with colorful lights moving erratically high in the sky.  ((anonymous report))",
      "city": "jacksonville",
      "shape": "disk",
      "date": "2019-02-22T00:00:00",
      "story": "Disc or circular objects with colorful lights moving erratically high in the sky. Tonight and on many different occasions one to three colorful disc shaped objects have been seen hovering high in the sky. One is always in the center moving slowly side to side and up and down, its seems to be larger than the others.  Sometimes it is alone, but on most occasions it is accompanied by two to three smaller ones . The smaller ones are also multi colored, and move erratically in circles and side to side around the larger one.  The movement is very erratic at times not like any air craft I have seen. They really put on a show, with the blinking and rotating lights.  It usually last a few hours. They are so high in the air, if they were still you would think that they were stars. This happens several times per month, five miles east of the Little Rock Air Force Base, around the Kerr station road/South Bend area. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144896.html",
      "state": "AR",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e1f",
      "summary": "Orange (fire color) obj.  very bright.  low flying across almost the entire sky from W to E.  slow moving, silent ((anonymous rept.))",
      "city": "jacksonville",
      "shape": "light",
      "date": "2019-01-04T00:00:00",
      "story": "Orange (fire color) object.  very bright.  low flying across almost the entire sky from west to east.  very slow moving and no sound as it past over head.  it slowly dimmed and faded out..",
      "link": "http://www.nuforc.org/webreports/144/S144180.html",
      "state": "FL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ff4",
      "summary": "Ball of orange light.  ((anonymous report))",
      "city": "jacksonville",
      "shape": "light",
      "date": "2018-11-24T00:00:00",
      "story": "Ball of orange light moving like nothing I could recognize. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143863.html",
      "state": "FL",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9544",
      "summary": "3 circular lights gliding and hovering over NAS Jax.  Looked camouflaged and was completely silent.",
      "city": "jacksonville",
      "shape": "triangle",
      "date": "2019-12-19T00:00:00",
      "story": "3 circular lights gliding and hovering over NAS Jax.  Looked camouflaged and was completely silent.  Made maneuvers no modern aircraft can make",
      "link": "http://www.nuforc.org/webreports/151/S151232.html",
      "state": "FL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9896",
      "summary": "In the west southwest sky near capricornus, there is a large, bright light. The light is yellow-white and undulating. Off and on we can",
      "city": "jacksonville",
      "shape": "unknown",
      "date": "2019-12-19T00:00:00",
      "story": "In the west southwest sky near capricornus, there is a large, bright light.  The light is yellow-white and undulating.  Off and on we can see two red and two green lights on it.  It's been there for 25 minutes now.  It's silent and stationary.  It flickers wildly.",
      "link": "http://www.nuforc.org/webreports/151/S151717.html",
      "state": "AL",
      "duration": "25 minutes - ongoing"
    }
  ]
}