{
  "city": "jerseycity",
  "fetch_timestamp": "2025-07-12T14:35:22.103002",
  "record_count": 16,
  "pages_fetched": 0,
  "api_calls": 1,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4c5b",
      "summary": "Fiery circular craft spotted hovering in Jersey City and then vanishes",
      "city": "jerseycity",
      "shape": "fireball",
      "date": "2019-07-05T00:00:00",
      "story": "Fiery circular craft spotted hovering in Jersey City and then vanishes After watching the latest Spiderman movie with my family at Newport Center Mall in Jersey City we headed home.  After leaving the mall garage, we cut through the BJ’s shopping center area and my wife (seated in the passenger seat) says, “What is that in the sky?”.  A few seconds after, my cousin seated behind my wife saw it too.  Since it was visible on the right side and I was driving I couldn’t see it initially.  Then I opened the moonroof of my truck and I was finally able to see it.  Shortly after my son saw it as well. It looked like a large circular fireball hovering over a distant city somewhere west of us in NJ.  It was about as high as a plane would be flying.  The appearance of the ball seemed like a glowing orange fiery light and it seemed like it had some type of aura.  My wife’s first thought was that it was a plane on fire.  But after watching the object for about 30 seconds that claim was quickly refuted.  I asked if someone could take out their phone to! record it.  My son immediately began to reach for his phone and as he started reaching for it to the second this bright orange object began to move North in a linear fashion.  As it started to move this bright orange light that lit up the night sky began to diminish in a matter of seconds until it was completely dim and vanished out of sight.  It’s almost as though it knew we were about to record it.",
      "link": "http://www.nuforc.org/webreports/147/S147286.html",
      "state": "NJ",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b641b",
      "summary": "Worm shaped object seen by at least 6 adults from Jersey City back yards",
      "city": "jerseycity",
      "shape": "other",
      "date": "2007-08-07T00:00:00",
      "story": "Worm shaped object seen by at least 6 adults from Jersey City back yards I was with two other people (all adults) in the back yard in the evening, right around dusk. There were 3 adults and 2 children in the adjacent yard. We all saw a silent, dark gray object in the sky, it looked like it was a few miles away, just above the tree line. It was worm shaped, it looked kind of like a para-sail. It seemed to have three sections that were fairly straight, but combined together to make a shallow downward facing C shape - the open part of the C facing the ground. At first I thought it was a balloon or a kite, but it didn't behave like either. I ran into the house to find a camera, when I returned, it had moved to a new position, and had become much fainter. I watched it gradually, over a period of 2 - 3 minutes, grow fainter and fainter, until it vanished. It was also growing darker at the same time. It may have simply vanished into some clouds, but it was starting to grow dark outside, so it was hard to tell if there were clouds that it could have disappeared into.  I took a picture with my cell phone camera-you can see something there, but it just looks like a blurry smudge. I took some pics with a digital camera, but unfortunately, i couldn't figure out how to turn the flash off. I also took some video with the digital camera, but by that time, the object had grown very faint, and it was growing dark outside.  We did see and hear an aircraft approach the same area at great speed. I was unable to tell what kind of aircraft it might be, but it sounded like a military jet.",
      "link": "http://www.nuforc.org/webreports/057/S57337.html",
      "state": "NJ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6572",
      "summary": "09/02/07 12:25 Jersey City NJ White Disk or saucer against a background of clear blue sky. Posted 03/21/08",
      "city": "jerseycity",
      "shape": "disk",
      "date": "2008-03-31T00:00:00",
      "story": "09/02/07 12:25 Jersey City NJ White Disk or saucer against a background of clear blue sky. Posted 03/21/08 Not long ago looking through photos taking on the second of September 2007 during the on-board cruise around the Manhattan I discovered a few strange pictures.  I have found on these pictures an object which presence I can not interpret unambiguously.  This strange object in the shape of “flying saucer or disk--can be seen against a background of clear blue sky of Jersey City (NJ).  The exact time of this phenomenon (12 hours 25 minutes PM) has been fixed on the big clock of Jersey City presented on the photo.  On the attached photo as well as on the other photos I have can be seen also the reflection of the above-mentioned strange object on the tall building of Jersey City. ((NUFORC Note:  We have corresponded with the witness, and looked at the photos.  At first, we thought the objects were reflections of ceiling lights off a window through which the photographer was",
      "link": "http://www.nuforc.org/webreports/062/S62274.html",
      "state": "NJ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b7058",
      "summary": "Bright white diamond shaped object in the sky within the atmosphere standing motionless.",
      "city": "jerseycity",
      "shape": "diamond",
      "date": "2007-04-27T00:00:00",
      "story": "Bright white diamond shaped object in the sky within the atmosphere standing motionless. Within the atmosphere there is a bright white diamond shaped light in the sky. The sky is completely clear, no clouds. The object is standing still. I asked a few bystanders passing by what they thought it was and they said it was definitely not a star, planet, or plane. The people that observed the object with me were parents and adults that appeared to be in their late 20's and 30's. I noticed this object in the sky at 20:00 and it is still there, motionless. The current time is 21:05. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56005.html",
      "state": "NJ",
      "duration": "1 hour and still ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3b8474",
      "summary": "ufo jersey city  blurr became 3 energy/light orbs which lapped & toyed with 747 jet",
      "city": "jerseycity",
      "shape": "changing",
      "date": "2009-03-19T00:00:00",
      "story": "ufo jersey city  blurr became 3 energy/light orbs which lapped & toyed with 747 jet In a car coming back from Jersey city lowes historic theater with family; parents 2 software engineers & two brothers 20, 22 (at the time i was 18) who also witnessed the event which conspired. A 747 jet was coming over the sky line & near it a slightly lite blurry small area of the sky. Three orbs of light came through whatever the liter area of the clouds were & proceeded to literally \"do laps\" around the 747. It was akin to a swarm of flys in the sense each has its own free movement but follows with the swarms general movement. So these things lapped(seemed to be playing with it). It was an amazing experience! ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68754.html",
      "state": "NJ",
      "duration": "1minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8fb1",
      "summary": "slow flying round shaped object with many lights flying at night in Jersey City,NJ",
      "city": "jerseycity",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "slow flying round shaped object with many lights flying at night in Jersey City,NJ I saw outside my window a slow round shaped object that was outlined in white lights. The object itself was like the color of tin can. I have a picture and zoomed in as much as I could. Unfortunately you can't see the lights in the picture but it was a pretty good shot. The object moved slowly going east, it lasted a long time but I couldn't see anymore out of my window.",
      "link": "http://www.nuforc.org/webreports/065/S65757.html",
      "state": "NJ",
      "duration": "10minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b945b",
      "summary": "A light appeared and shot across a small portion of the sky over the statue of liberty in an arc and then disappeared.",
      "city": "jerseycity",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "A light appeared and shot across a small portion of the sky over the statue of liberty in an arc and then disappeared. My girlfriend and I just walked out side to have a cigarette on the roof deck of our apartment which is about eight floors in the air and faces the statue of liberty.  Our apartment consists of two towers and the roof deck conneects them.  We are exactly one block away from the Hudson River so we are very close, and the sky was completely clear of clouds.  There were only other planes and a few stars in the sky. We sat down lit our cigarette when a singular light similar to a plane appeared and flashed across a specifc section of the sky in a downwards arc at an incredible speed of the likes I've never seen before.  Judging by the speed and trajectory this could not have been anything like a shoot star.  Also, because of the fact the light just went on then all of a sudden went off-not out of sight although we couldn't see it anymore-I do not think it was anything man made. I have never been on a UFO site before nor have I have had a sighting.  I do not know anything else that this could be.",
      "link": "http://www.nuforc.org/webreports/075/S75009.html",
      "state": "NJ",
      "duration": "Three Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d9b",
      "summary": "I saw an erratic flying object with a red blinking light. It was traveling west to east in the northern sky. It flew straight for a sho",
      "city": "jerseycity",
      "shape": "light",
      "date": "2010-06-10T00:00:00",
      "story": "I saw an erratic flying object with a red blinking light.  It was traveling west to east in the northern sky.  It flew straight for a short distance then flew in a jittery zig zag pattern then flew straight again.   It repeated this pattern about 4 times then suddenly the lights of the object turned off.",
      "link": "http://www.nuforc.org/webreports/075/S75678.html",
      "state": "NJ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb78",
      "summary": "Very fast green hazy fireball over jersey city NJ",
      "city": "jerseycity",
      "shape": "fireball",
      "date": "2011-07-17T00:00:00",
      "story": "Very fast green hazy fireball over jersey city NJ My lady and I were watching television this evening.  Our sofa faces the west window exposure in our loft.  It was around 9:40 p.m. when I jumped off the couch yelling \"what the he'll is that?!?\"  My lady looked and couldn't believe it either.  What we had seen was a green fireball like object jet across the window exposure wickedly fast.  There was a small trail behind it but quickly dissipated.  The fireball then vanished into the sky while moving south west.  What's interesting is that I've seen this green fireball twice before in a property we lived in just one block east from where we currently reside in 2004.  It was seen traveling in the same south west direction.  My lady didn't necessarily believe me until this evening.  I can say what we saw this evening lasted roughly 12-15 seconds.  In our prior living space we had north west exposures so I know it had come from that direction.  Tonight It just appeared west and travelled south west.  She and I thought maybe fireworks initially but there are no structures surrounding to allow a launch in that direction especially being it moved horizontally.   I have an iron clad memory and know without a shadow of doubt this IS the same gree fireball light I've seen twice in 2004.",
      "link": "http://www.nuforc.org/webreports/082/S82428.html",
      "state": "NJ",
      "duration": "12 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3be110",
      "summary": "Orange lights in sky above New jersey",
      "city": "jerseycity",
      "shape": "disk",
      "date": "2012-11-19T00:00:00",
      "story": "Orange lights in sky above New jersey We are in Jersey City, USA. We were looking out of the kitchen window towards  the south, kind of out over Newark airport. We saw three orange glows in the sky.  At first, I thought it must be the sun or moon, but they were clearly distinct shapes and they were moving kind of toward the left and downward until they finally disappeared behind the houses in the distance.  I would say they were not some kind of optical illusion, nor did they appear to be some kind of reflection caused by the sun.  They were definitely not airplanes. We then did some looking around online to see if anyone else had reported any similar sightings, and we found that there have been many reports in the last few years (one in my home town in Huntingdon, England) and others more locally.  Finally, we came across this website and decided to add our voice to the many others who say they have seen something.  I wouldn't like to say it was definitely something from outer space! Big claims require big evidence (or something like that) as someone once said. But they were definitely UFOs.",
      "link": "http://www.nuforc.org/webreports/094/S94570.html",
      "state": "NJ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c323f",
      "summary": "Fast moving stick-shaped objected witnessed above Jersey City.",
      "city": "jerseycity",
      "shape": "other",
      "date": "2015-04-03T00:00:00",
      "story": "Fast moving stick-shaped objected witnessed above Jersey City. I am traveling from Newark to Chicago.  When the airplane flied out of the cloud, I decided to take some pictures of the sunset.  So I took out my iPhone6 and shot three pictures in less than 2 minutes.   After I came home, I happened to noticed that there is a strange object in the first picture I took.  The object is stick-shaped, seems to be flying down to the earth.  It left a visible trail after it.  It seemed to be moving very fast because it was nowhere to been seen in my next picture took within one minute.",
      "link": "http://www.nuforc.org/webreports/118/S118085.html",
      "state": "MI",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c47f3",
      "summary": "Triangle shaped bright green fast travelling sighting.",
      "city": "jerseycity",
      "shape": "triangle",
      "date": "2015-11-06T00:00:00",
      "story": "Triangle shaped bright green fast travelling sighting. Bright green forward facing triangle zipped quickly through the sky before dipping downwards in an arc shape out of sight.  Lasted approx 5 seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123355.html",
      "state": "NJ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6392",
      "summary": "The aircraft was silver and gray.  It looked like an arrowhead.  The lights were orange.",
      "city": "jerseycity",
      "shape": "rectangle",
      "date": "2016-08-29T00:00:00",
      "story": "I was in my attic apartment.  My room started to shake.  I thought it was an earthquake.  It woke me and my girlfriend.   At first we thought it was a low flying helicopter.  The sound was eerie.   I ran to get my cell phone to take a pic.  The aircraft was silver and gray.  It looked like an arrowhead.  The lights were orange.   The ship flew between two bright lights!  Then it soedef straight up and disappeared.  I have pics!",
      "link": "http://www.nuforc.org/webreports/129/S129505.html",
      "state": "NJ",
      "duration": "Night"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a83",
      "summary": "White orb intelligent actions.",
      "city": "jerseycity",
      "shape": "sphere",
      "date": "2017-02-17T00:00:00",
      "story": "white orb intelligent actions been seeing bright white light in the sky for the past 2 to 3 weeks on and off in the same exact spot hovering and making intelligent movements then brightening and dimming as time goes its crazy I'm at a lost or words",
      "link": "http://www.nuforc.org/webreports/132/S132644.html",
      "state": "NJ",
      "duration": "~3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c77ed",
      "summary": "WOW NYC UFO SPOTTED ON WEBCAM !",
      "city": "jerseycity",
      "shape": "oval",
      "date": "2017-12-21T00:00:00",
      "story": "WOW NYC UFO SPOTTED ON WEBCAM! So I will watch different webcam’s that are close to me to try and see strange things. I saw a huge round object scan over the NYC skyline,  Very cool to say the least… I used to post a lot of these videos, but all anyone who ran these web sights ever said was, “No that’s A plane, or a helicopter”….. Yeah, sure and i’m Santa’s foreman at the toy shop in the north pole !!!  Hey see for yourself how large and slow this thing moves, then tell me its from here….!!! ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137872.html",
      "state": "NJ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c91e2",
      "summary": "Thought it was a helicopter because shape was so odd, like spherical, so as we walked closer, my son and I noticed that it had a big li",
      "city": "jerseycity",
      "shape": "other",
      "date": "2019-12-01T00:00:00",
      "story": "Thought it was a helicopter because shape was so odd, like spherical, so as we walked closer, my son and I noticed that it had a big light Or beam in the middle, and it wasn't moving, just flashing brightly, standing still.  Then it suddenly just disappeared. Just like that.",
      "link": "http://www.nuforc.org/webreports/149/S149750.html",
      "state": "NJ",
      "duration": "2 minutes"
    }
  ]
}