{
  "city": "kansascity",
  "fetch_timestamp": "2025-07-12T14:32:11.764101",
  "record_count": 113,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b43b4",
      "summary": "parabollic bell glowing hot blue white",
      "city": "kansascity",
      "shape": "changing",
      "date": "2006-05-15T00:00:00",
      "story": "parabollic bell glowing hot blue white For some time now I have observed a very bright blue-white glowing object in the sky in the southwest of downtown KC. The striking thing is to a non-astronomer at first I thought this was a twinkling star.  It is not a star. It moves sometimes slow, sometimes fast and its brightness changes. I thought at first it was some sort of surveillance aircraft, it moves not linearly, but seems to be moving about the night sky.  I bought a spotting lens 30-90x.  Tonight I was able to focus on it and was amazed.  This object changed form freqauently but had a basically tranlucent body with a dark orb at the bottom or within.   At times it appeared bell shaped with a glowing hot blue white band where the base of the bell would would be  base form was fairly smoot but appeared as though it was flowing in shape and nearly constantly changing shape. At the bottom of the bell or parabola was a dark globe like form. Not to be trite but the object looked like a taco bell logo, sort of. It's activity was similar to one of those static electriciy balls, a pulsing electric form, but with straight lines and a ring rather than truly static.  The bell or parabollic form was a hazy white which seemed to rotate about itself slowly. It seemed to have stripes running from the arch to the base around it.  It rotated its nearly continually, so as to appear as though it was floating about itself. It was of intense brightness without magnification. It seemed 5-10 degrees elevated from the horizon.  It eventually took off to the west and suddently disappeared.  I viewed it a number of diffent ways.  At less magnification it looked like a parabola which was bright and squiggling. From this perspective it was multicolored including a bright blue white, with varous colors inlcuding red continually fluctuating.  As it rotated it also gave the appearance of a cylinder with the globe portion at the end. and with stripes of brighter light running the length of its body which seemed to rotate about it.  The object always appeared translucent or nearly so. although not truly a triangle, it appeared to have an elonated parabollic triange.  It behaves as though it is conducting a survey.  It is out at night regularly.  It was of such intensity that I have eye pain from watching it. I made some drawings of it.  I figured it for  some sort of reconisance craftbeing tested out of one of the numerous bases around here, and I say this because it truly gives the appearance of beig a bright star but doesn't behave like a planet in terms of its' motion.",
      "link": "http://www.nuforc.org/webreports/049/S49791.html",
      "state": "MO",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4437",
      "summary": "Craft with red,blur & green lights almost on the ground at tree top level lights bigger then a house & very quite seen by myself &",
      "city": "kansascity",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "Craft with red,blur & green lights almost on the ground at tree top level lights bigger then a house & very quite seen by myself & I believe it was 6/11/1999 it was around 10:30pm I was heading to the store with my 2 sons in Kansas City (north) Missouri (Crestview area)I turned left down the hill & at the bottom of the hill we all saw it, Tree top level, it was behind a house but so much bigger, it had red, green & blue lights. The lights where bigger then the house, it was so big! We stopped got out & just stared at it for like 5min.  It was so huge I couldn’t be leave what we were seeing , 1 light was bigger then the house it was behind the house blocked a tiny spot of the bottom of I think the green light, but the light was still bigger then the house & it was almost on the ground that’s how low it was, it looked like it was in the back yard. We couldn’t really see how big it was but from where we was standing you could normally see the highway that is very lite up & trees & the huge church & parking lot , the price chopper,plus the fountain beyond the overpass but you could tell the ! craft was beyond huge because you couldn’t see any of those things, it blocked all of it & that was over 5 or more blocks that are very well lite up.We didn’t hear anything but maybe a light hummmm. Then it was just gone, that fast, didn’t even see it leave just gone & everything was as it always is, you could see the highway overpass & everything. We never talked about it after that night until last summer 2018 I asked my son if he remembered & I got so excited when he said yes he & his brother had been talking about it, I don’t know why I didn’t report it, I figured it would be on the news in the morning but it never was. I remember it as clear as if it was yesterday! I can sit down and draw a picture of what we saw & do some Research if you are interested & write me a letter and give me a form to write each down. I can go take pictures of the street house it was behind and what you can see from the way we was standing I can take a video and explain it as I remember it and give directions facings if interested in that it’s not far from where I live now. Please send a letter and I can call you back or leave a message",
      "link": "http://www.nuforc.org/webreports/147/S147990.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b454c",
      "summary": "Bright Light Moving West To East In South KC",
      "city": "kansascity",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Bright Light Moving West To East In South KC One large, very bright light moved west to east fairly low on the horizon.   The light appeared very bright, almost white and about 10 times larger than a star.  I watched the light suddenly dim down and break up into 3 small lights.  It then completely dimmed just as sudden.  The night was very clear and clam.  I heard no engine sound.  I hope someone else saw this.",
      "link": "http://www.nuforc.org/webreports/050/S50223.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b46a1",
      "summary": "A bright flash of light and i wake up 500 miles back at the texas kansas boarder where i was 4 hours earlier.  ((anonymous report))",
      "city": "kansascity",
      "shape": "other",
      "date": "2019-06-07T00:00:00",
      "story": "I took a trip accross the usa in my dodge van went to all national parks on and on was getting home sick so headed back to NJ.  up from texas into Kansas .taking pics of all the cool stuff on the side of the road wind mills .a contractor redoing ac duct work at a school.stoped at a nowhere gas station for a case of water a large coffee and a loto ticket.filled up with gas .got in the van drove a block .took a left into a desert road to take a leak .turned left onto the road .A bright flash of light and i wake up 500 miles back at the texas kansas boarder where i was 4 hours earlier.on the side of the road paralysed behind the stearing wheel.cant move at all .But i could see.then felt like a thermometer dropping .the hot fluid in my spin felt like it drained out and i could move so i reached for my coffee it was almost frozen .its 110 in the desert.then i grab my phone . the time was off by 4 hours.and the loto ticket in my pocket .that said 13.36 on it the tim! e i got it from 500 miles a head of where i was.5 seckonds ago .and my tank was still full.so how did i go back 500 miles without burning any gas..went to little hospital cop came said what do you want us to do . doriean take pics of the back of his neck and make the usual report.I said what usual report the cop said what do you think your the only one this happens to . nurse said usual injection spot asked if i felt anything . i said feels like a pencile point broken under my skin.just behind the top bone .  she said ok took pic and said have a safe trip.I left pissed off felt like i was raped . didnt know where i was for 4 hours of my life.so gets better as im aproching kanses city now 8 hours later i see a red led drop from space behind city .real fast then dead stop turn led blue then slowly desend behing mountains.gets better thank god for tripple a. Next 3 days vans electrical seytem falls completly apart . starter.towed dash out lights .boom towed on and on .was towed ! all the way to Pennsylvania by tripple a .so thats it.last wee! k the th ing in my neck finaly shifted from under my top bone to bottom right side of my neck at least it dont hurt alylonger.ps i will never go to kansas again and my van went to junk yard a weak later.complete electrical failure.i didnt see any aliens no ship when i was taken i no recolection of the 4 hours .it ducks ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146371.html",
      "state": "KS",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b85",
      "summary": "I received a phone call from a friend asking if I was observing the objects in the N sky.  ((NUFORC Note:  High-altitude balloon?  PD))",
      "city": "kansascity",
      "shape": "circle",
      "date": "2019-06-27T00:00:00",
      "story": "At or about 7:50 p.m., on June 20th, 2019, I received a phone call from a friend, asking if I was observing the objects in the northern sky.  I quickly ran outside and observed the 2 objects in the northern sky roughly 30 degrees above the horizon.  I retrieved my binoculars for a closer inspection and the 2 objects were actually ring shaped.  They were bright white glowing, not moving at all.  After about 20 minutes of observing they were obscured by clouds. ((NUFORC Note:  High-altitude balloon?  Please see other reports, going back to June 18 over Ohio.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146949.html",
      "state": "MO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b84",
      "summary": "Noticed one reflective dot in the sky, totally motionless for approximately 20 minutes.  ((NUFORC Note:  High-altitude balloons?  PD))",
      "city": "kansascity",
      "shape": "unknown",
      "date": "2019-06-27T00:00:00",
      "story": "Noticed one reflective dot in the sky, totally motionless for approximately twenty minutes.  Then suddenly saw a second dot.  This one has been in the same position relative to the first dot since appearing.  Neither of these dots have moved in any direction since appearing. ((NUFORC Note:  High-altitude balloons?  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146951.html",
      "state": "MO",
      "duration": "Currently"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b83",
      "summary": "2 silver/white spheres hovering/non-moving at 5000 ft. until covered by clouds after 20 minutes.",
      "city": "kansascity",
      "shape": "sphere",
      "date": "2019-06-27T00:00:00",
      "story": "2 silver/white spheres hovering/non-moving at 5000 ft. until covered by clouds after 20 minutes. 2 silver/white spheres approximately 5000 feet in altitude and around 500 yds. apart.  Did not change position during the 20 minute sighting and were eventually covered by incoming clouds.  At first sight we thought they were stars but were closer and larger than a true star.  The evening sun made them shine like stars, I do not believe they were emanating light.   This was approximately 5 miles E/SE of Kansas City International airport.  There was nothing particularly significant about this other than they just didn't move at all the whole time while clouds and aircraft were crossing above.",
      "link": "http://www.nuforc.org/webreports/146/S146945.html",
      "state": "MO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4bba",
      "summary": "Witnessed 2 bright white disc-like objects high in the sky to the N of Liberty. ((NUFORC Note:  High-altitude balloon?  PD))",
      "city": "kansascity",
      "shape": "circle",
      "date": "2019-06-27T00:00:00",
      "story": "Witnessed 2 bright white disc-like objects high in the sky to the north of Liberty.  Seemed to be moving at same pace, slowly.  Bright lights on ends.  No sounds-high in the air. ((NUFORC Note:  High-altitude balloon?  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146950.html",
      "state": "MO",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e0a",
      "summary": "Illuminated gold/yellow Chevron traveling from East horizon to West horizon in seconds.",
      "city": "kansascity",
      "shape": "chevron",
      "date": "2019-05-09T00:00:00",
      "story": "Illuminated gold/yellow Chevron traveling from East horizon to West horizon in seconds. Gold\\yellow Chevron-shaped something was seen in the North East horizon, approximately at a 10 o'clock placement to the Earth if there Earth were at 6 and directly overhead was a 12.  It traveled from East to the West covering the entire horizon in a matter of 10 seconds.  It traveled faster than anything that humanly exist.  It was very big.  The size of the Moon on any given average night.  It was a Chevron-shaped, triangle with another triangle offset directly behind and the triangle behind tip of triangle splitting the middle of the one in front.  Never seen any thing like it and no question of it possibly belonging to this planet.  Absolutely not of this world.  Moved faster than any thing we have on this planet. Unbelievably fast.  One horizon to the other (East to West) in a matter of less than 10 seconds. ((NUFORC Note:  We have attempted to contact the source of the report, in order to establish the correct date of the sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145959.html",
      "state": "MO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fbd",
      "summary": "My sighting occurred last Monday morning, March 18th.  I was looking out of my building from the 11th floor and noticed contrails so I",
      "city": "kansascity",
      "shape": "formation",
      "date": "2019-03-29T00:00:00",
      "story": "My sighting occurred last Monday morning, March 18th.  I was looking out of my building from the 11th floor and noticed contrails, so I began to follow one.  Suddenly, there was a shimmering and a formation of about 20 of them appeared and sort of “followed the leader” like a flock of birds.  They’d fly a bit, then head into this small and apparently lone cloud.  In a couple of seconds they’d reappear from the cloud and repeat.  Watched this repeat itself for a about a minute then it passed over the building.  I would say it as a flock of birds but this was way too high for that and also they appeared to be silver and saucer/diamond shaped. This was in North Kansas City in the center of the city, not out in the country.",
      "link": "http://www.nuforc.org/webreports/145/S145326.html",
      "state": "MO",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fd6",
      "summary": "We were waiting at a restaurant outside and someone pointed out a strange object in the sky. It was red and yellow in color and had a t",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2019-03-29T00:00:00",
      "story": "We were waiting at a restaurant outside and someone pointed out a strange object in the sky.  It was red and yellow in color and had a triangular shape, shortly after we noticed another much smaller object orbiting the larger one.  It moved very slowly and was rotating slowly.  It was headed westward we watched it until it was out of spite (sic.  Sight).   It went out of sight at about 6:50 PM.",
      "link": "http://www.nuforc.org/webreports/145/S145349.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5188",
      "summary": "MISSOURI INVESTIGATORS GROUP Report:  Two brothers witness chevron-shaped object streak across sky.  PD))",
      "city": "kansascity",
      "shape": "chevron",
      "date": "",
      "story": "First of all my brother and I where playing outdoors that evening chasing each other around our apartment buildings,  when I spotted  something coming in from the north, a glowing object shaped similar to that of a  boomerang, (^  this kind of shape)  I continued to watch the object streaking across the evening sky  until it passed overhead without a sound.  As it passed directly over I could make out some detail to its shape, it had three raised ribs on each half of the boomerang, and was golden in color.  It must have been moving at tremendous speed, because it didn't take 3 minutes to pass from horizon to horizon.  I knew it was moving very fast, from watching many B-36s flying out of Offutt Air Force base over our home in Kansas.  My brother is now deceased.  And I have been wanting to tell my U.F.O. story to someone for years.  I do believe that their is life throughout the great universe. Report taken by B. Becker - ufomig@yahoo.com MIG: Missouri Investigators Group  - http://ufomig.bravehost.com ((NUFORC Note:  We express our sincere gratitude to Barbara Becker, Director of the Missouri Investigators Group, for sharing the report with NUFORC.  Anyone with additional information about the case is invited to contact that group directly.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63690.html",
      "state": "KS",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5314",
      "summary": "Bright white triangular shaped object with multiple colors trailing behind it viewed while driving on I435 Kansas City, KS",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "Bright white triangular shaped object with multiple colors trailing behind it viewed while driving on I435 Kansas City, KS I saw a triagular shaped object mostly bright white with oranges, purples and blues trailing behind it.  I moved across the sky at an incredible speed for about 5 seconds then disappeared.  I was driving my vehicle at the time with my father-in-law in the passenger seat. He saw exactly what I saw.  We were traveling southbound on I 435 in the Kansas City, KS area.",
      "link": "http://www.nuforc.org/webreports/051/S51905.html",
      "state": "KS",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5342",
      "summary": "Seconds later the four objects became one and looked like a huge fireball falling fast from the sky.",
      "city": "kansascity",
      "shape": "fireball",
      "date": "2008-06-12T00:00:00",
      "story": "We were traveling north on 18th street expressway when I looked into the sky and saw four objects falling straight down out of the sky.    Seconds later the four objects became one and looked like a huge fireball falling fast from the sky.   My husband thought is might be \"space junk\".  I thought it might be an airline part that was on fire.   This object fell for about 45 seconds and then it appeared as four objects again traveling in different directions.   All four objects then leveled off and went behind a small cloud and then it disappeared.  It was really something to see.  Report taken by MIG: Missouri Investigators Group. http://ufomig.bravehost.com",
      "link": "http://www.nuforc.org/webreports/063/S63023.html",
      "state": "KS",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5935",
      "summary": "Triangular shape with dull red lights.",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "Triangular shape with dull red lights. We were watching for meteors on December 12 when we saw a large, triangle shaped object float by. It consisted of 5 dull red lights in a triangular shape, if you could even call them lights.  It was completely silent, but also fast. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  We have assigned an arbitrary time above.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57611.html",
      "state": "MO",
      "duration": ">1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5cc2",
      "summary": "2 F - 16 fighter jets and black helicopter Circle in formation",
      "city": "kansascity",
      "shape": "other",
      "date": "2007-08-07T00:00:00",
      "story": "2 F - 16 fighter jets and black helicopter Circle in formation I was sitting on my porch with my daughter at 10:00 am talking to some friends . And we all watched 2 F-16 fighter jets fly overhead in a alert formation which is unusual in this area . Shortly after the jets came a solid black helicopter flying west in the same direction . Then the jets passed by another 5 or 6 times heading west as well . This all took place inbetween 10 am and 11 am , I havent heard of any airshows going on in my area and thought maybe they could have been scrambled for a reason . If there were any sightings in my area around this time and were reported this may be the reason for this .",
      "link": "http://www.nuforc.org/webreports/057/S57116.html",
      "state": "KS",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e5f",
      "summary": "Wyandotte county Kansas 1967 object appeared as aircraft suspended midair.",
      "city": "kansascity",
      "shape": "other",
      "date": "",
      "story": "Wyandotte county Kansas 1967 object appeared as aircraft suspended midair. In 1967 I along with several others were in a sparsley poulated area around 1:00 Am and I did observe what I would describe as a World war II airplane with no lights suspended midair.I was driving my 1967 Chevrolet and there were five occupants in the car and all I remember was the airplane first to the left of my car then to right midair facing my vehicle then above my car then facing us in front of a tree and then back again in the same position and emitted a yellowish beam from the rear of the plane and we left the area as I never remember the airplane moving only remember when it was stationary.I drove to a area where there were caves that were used for storage next to a major river close to where the  river meets another major river and driving along a gravel road observed an individual facing the road in a green panel van wearing dark black sunglasses as this was in the early morning and dark as I remember telling the others look at that nut and a red light came from behind me as it was a police vehicle county Sherriff's patrol and two deputies got out and all occupants of my vehicle got out and were questioned as to why we were out in this area at this time and I told the deputies we were out looking for UFO'S and they told us to go home after checking our ID's as I thought it was funny that they did not laugh at us or disbelieve our story as we were all teenagers. A week later as I was 19 years old and living at a rooming house  as I went to take a shower on the third floor on a Saturday afternoon as I had a date and a young man with long Blond hair and wearing a white outfit and wearing dark sunglasses walked into the restroom and came straight to the shower as I opened the door and he grabbed me by my groin and turned and left. I immediatedly got dressed and went to the lobby to report this to the desk clerk and asked him if he saw a young man with Blond hair wearing dark sunglasses come down and he said no as at that time another man came down and said a young man wearing sung! lasses o pended the shower door on the second floor and turned around and left but did not touch him as he did  me. After all this occurred I was exaimed by Doctor's and an exray clearly showed that an object which Doctor's could not identify was lodged near my femur bone as this object is still near my femur bone as I have had exray's taken over the years and as of two years ago this object still near the femur. There is more to this as I married and fathered two daughters and  divorced in 1974 and who my exwife married would be of extreme importance to your organization and all UFO investigators. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  We have assigned an arbitrary date in June 1967.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61089.html",
      "state": "KS",
      "duration": "Uncertain"
    },
    {
      "_id": "64d005f478aba2ec5a3b6236",
      "summary": "small white circular white object like a  period on apiece of paper but white in the sky.",
      "city": "kansascity",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "small white circular white object like a  period on apiece of paper but white in the sky. My daughter and I were looking in the sky at what appeared to be two jets that were circling a bright white circular light in the sky. The jets were pretty high up and after the object disappeared then the jets did as well. I have seen some pictures on the internet that resemble what we saw. In those pictures it looks likes a light hight in the sky similar to a very small sun.",
      "link": "http://www.nuforc.org/webreports/059/S59440.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b635b",
      "summary": "I was on my roof last night in Kansas City's Westbottem's and I was out there for the purpose to catch a UFO on camera.  It was still",
      "city": "kansascity",
      "shape": "formation",
      "date": "2007-04-27T00:00:00",
      "story": "I was on my roof last night in Kansas City's Westbottem's and I was out there for the purpose to catch a UFO on camera.  It was still early since I figured it would maybe happen, a sighting I mean, at about 3 am the witching hour.  Well to my surprise I was laying there playing guitar for about an hour straight, all alone laying on my back looking up at the almost full moon.  Well the moon was sort of in the west at this point but I sat up and put my guitar down and I saw three oval shaped craft with no light's flying in formation from south to north towards the old downtown airport. The ships looked maybe brown but really stood out, against the clear night sky about 300 or so feet above me.  They flew in such a way that it looked like one craft, and there was a jitter effect on one of the oval shaped craft like tracer but they were not moving that fast maybe 100 to 200 miles an hour.   The sighting lasted about 10 to 15 seconds enough time for me to blink a couple of times. I found it strange because to start the night of I looked at the sky and said in my head LIVE  TO LOVE AND LOVE TO LIVE LIFE which is my sort of meditation words, and as soon as I was done playing guitar they flow over, it scared the shit out of me I called my dad and he instructed me to get off the roof so I did but remained at my roof hatch for the rest of the night with camera in hand but I was to late.  I am going to make it a point to be up there every night till I get footage. Good luck on your quest I am both scared a bit excited to help you with your journey, I have always believed but now my life has changed because I know.  Thank you for doing this the world needs to wake up and see what has been hidden, I was thinking about my statistic's class in collage which I went to but It was art collage, any way the chances of me catching eye of a UFO on my first night and the fact that they flow over me very low to the ground lower then a normal helicopter even it seemed, are almost impossible.  People spend there whole life looking and never see, my only conclusion is the power of the mind is a very special thing that many do not realise or they noticed that I enjoy life or, sorry, they liked my music. About me, well I am in my mid twenty's and am trying to start a Animation Studio. I have many hobbie's and have just recently started giving thanks for life not in a religious way but sort of just an outloud way and I dont kill bugs I try and save them so I see myself as maybe being good even though I still have road rage and stuff like that.",
      "link": "http://www.nuforc.org/webreports/056/S56070.html",
      "state": "MO",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b63a9",
      "summary": "3 round lights in a boomerang shape with a bright comet like tail, very close to the ground.",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "3 round lights in a boomerang shape with a bright comet like tail, very close to the ground. Location: I-435 hwy & I-35 hwy Intersection (facing south towards downtown K.C.) An object with 3 circular white lights and a long \"tail of white sparks\" that came very close to the ground,  appeared out of nowhere and rapidly flew straight east to west and then went straight up into the sky. At first, I thought it was a shooting star, but then as it got closer to the ground, did I realize what it was.",
      "link": "http://www.nuforc.org/webreports/058/S58589.html",
      "state": "MO",
      "duration": "10 secs."
    },
    {
      "_id": "64d005f478aba2ec5a3b6703",
      "summary": "Object over south Kansas City, MO. Lights on bottom, flying low.",
      "city": "kansascity",
      "shape": "oval",
      "date": "2006-12-07T00:00:00",
      "story": "Object over south Kansas City, MO. Lights on bottom, flying low. I was about 10-11 years old playing in the front yard with some friends.  I don't rememebr how my attention was drawn to the sky, probably by someone else.   I looked up and observed a low flying craft approx. 1000-2000 feet up.  It was large but I only vaguely remember the outline being circular or oval in shape.  What drew my attention was a circular formation of lights underneath alternating colors.   I do not recall any other lights on the object.  Our house was just 5 miles north of Richards-Gebauer Airbase so seeing aircraft was common all times of day and night. This would have been about the time that the base was slated for closing but the military traffic continued well past from when I moved from the neighborhood several years later.   The object was moving roughly from the northwest to the south east.  I rememebr someone saying \"Looks like the UFOs are landing.\"  I totally freaked and went inside the house.   That was the last I saw and I never talked about it over the years.  I had convinced my self that it was something normal, possibly a blimp.  Just recently I contacted my brother and asked him if he remembered the event and asked about the detatils just so I coudl verify that I had not missed soemthing after I went inside.  He related that he did remember, he would have been about 12-14 at the time.  He remembered the object as silvery with lights on the bottom but no other lights.   It was low and he and other(s) (Unknown who the other kids were) went in the backyard as it went over the house.   He remembers the object turning to the North and he watched it until it was out of sight.  He distinctly remembers thinking that the object definitely was not an aircraft.   pointed out the possibility of a blimp and we both agreed that that we had never seen a blimp in the area before (Especially due to the presence of the airbase) and we were very familiar with the aircraft that frequented the base since we alsways tried to identify the aircraft by the sound they made as they approached for a landing. This object made no sound at all. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53856.html",
      "state": "MO",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b2c",
      "summary": "UFO",
      "city": "kansascity",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "I CONTACTED YOU BEFORE ABOUT A UFO SIGHTING BY MY DAUGHTER AND I AND A FEW DAYS LATER THE NEWS CHANNEL ADVERTISE A UFO SIGHTING BY LOTS OF PEOPLE IN THE AREA.  SINCE MY DAUGHTER AND I SAW THE ONE WE SAW THERE HAS BEEN A SIGNIFICANT INCREASE IN THE JET ACTIVITY.  WHAT IS UP?",
      "link": "http://www.nuforc.org/webreports/059/S59862.html",
      "state": "KS",
      "duration": "1 MIN"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c9c",
      "summary": "Shiney parallel objects seen over KCKC and then KC north.",
      "city": "kansascity",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Shiney parallel objects seen over KCKC and then KC north. Driving on I-29 near Barry road I saw two shiney objects that I thought were airplanes passing each other near the downtown airport and Kansas City, KS.  They never crossed and stayed parallel stacked vertically.  They glinted in the sun light like chrome in the sun.  Then I couldn't see them anymore.  I looked to the west and they were about 500 feet in the air and were horizontal.  Very shiney, but couldn't really make out a shape.  I thought they might be balloons from a car dealer, but they were over a residental area/wooded area.  They were stationary.  Soundless as far as I could tell.",
      "link": "http://www.nuforc.org/webreports/057/S57594.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d27",
      "summary": "Bright lights seen in Western sky moving very slowly from SW to NE.",
      "city": "kansascity",
      "shape": "other",
      "date": "2007-06-12T00:00:00",
      "story": "Bright lights seen in Western sky moving very slowly from SW to NE. On Tuesday night at 20:10 I went out on my deck for a minute and I spotted three bright lights in the Western sky.  There was one light on the left and another slightly lower and to the right and the third was directly right of the second.  At first I thought it was a plane with its landing lights on.  The object was almost stationary.  I watched it for a total of 45 minutes and in that time it moved extremely slowly from SW to NE and descended at an angle.  The object passed behind a tree and as it was emerging from behind the tree the lights went out and I did not see it again.  On Wednesday night I was in the kitchen at approximately 20:10 and looked out my window and saw the same lights.  I got my digital camera and tried taking pictures using the RAW format.  The object moved in an almost identical flight path as the night before but this time the lights did not go out and after an hour it disappeared below the tree line on the horizon.  The light never changed in intensity or position the whole time they were visible.  They did appear to be coming toward to some degree.  There was never any sound or apparent turns.  It moved in a straight line path from high left at sighting down at about a 30-45 degree angle until it went below the horizon at lower right.  The pictures I got only show a light and not all three.  A large tree provides a reference point to show angle of travel.  The lights were seen by two other witnesses, my wife and my neighbor who is a local fireman.  I served 8 years in the US Air Force & US Army and was a police officer for 6 years.  I have not seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/056/S56612.html",
      "state": "MO",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b70d9",
      "summary": "I was taking my dog out at 2:23 AM on 01/05/07 and while looking to the East toward Liberty Missouri I saw the weirdest thing I have ev",
      "city": "kansascity",
      "shape": "cylinder",
      "date": "2007-02-01T00:00:00",
      "story": "I was taking my dog out at 2:23 AM on 01/05/07 and while looking to the East toward Liberty, Missouri. I saw the weirdest thing I have ever seen in the sky.  I saw what I first believed to be a star.  However, about three seconds into looking at the star it disappeared.  I then noticed this same light reappear several miles to the Southeast of where I first saw it.  Then the light disappeared again.  The next time I saw the light was about five seconds later.  The light was almost exactly where I saw it the first time.  I thought this was odd flying for an aircraft, especially at this odd hour of the morning.  It almost felt like the object knew or sensed that I was watching it.",
      "link": "http://www.nuforc.org/webreports/054/S54506.html",
      "state": "MO",
      "duration": "16 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7267",
      "summary": "I was camping out hoping to see Skylab come down when I saw a red arrow move across the sky.",
      "city": "kansascity",
      "shape": "cylinder",
      "date": "2007-02-24T00:00:00",
      "story": "I was camping out hoping to see Skylab come down when I saw a red arrow move across the sky. July 11, 1979 was the night that Skylab came down.  Me, my older brother and some neighbor kids spent the night outside hoping to see Skylab come down.  We were camped out of the patio on the East side of the house and didn’t have any kind of view of the Western sky at all.  (We were kids I was 12, not real smart).  Anyway in the middle of the night I was looking straight up when I saw directly above but miles up in the sky a red arrow.  It was crisp, no streaks, exhaust or noise.  It was moving directly East and was only visible for 4 seconds.  The other kids of course were screwing around and missed it.  It was gone before any of them could get a look and of course they didn’t believe me.  I assumed at the time that what I saw was Skylab but now I’m pretty sure it was something else, I just don’t know what.  I’m really hoping others saw the same thing and know what it was.  If you know what this was you can just e-mail me, I really don't expect a phone call or for your organization to spend a lot of time on this.  Thank you.",
      "link": "http://www.nuforc.org/webreports/055/S55229.html",
      "state": "MO",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b80",
      "summary": "A large, triangular object with two banks of very large, bright white lights on the front two sides, hovering motionless near I-435.",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2007-02-24T00:00:00",
      "story": "A large, triangular object with two banks of very large, bright white lights on the front two sides, hovering motionless near I-435. Driving home from the Kansas City International Airport at approximately 00:45 Wednesday morning, February 14, I saw a large, bright object hovering over a field area near the northbound lane of I-435. I was headed southbound on I-435, about 2 miles south of I-29, and at first I assumed this was a landing plane. It was much brighter than a plane, however, and it was \"pointed\" due north rather than east/northeast, which is the direction of the airport from this freeway. As I drove nearer, I realized that the object was not moving. I slowed down to about 45 mph to get as close a look as possible from my driver’s side window. The object was triangular in shape, with banks of very large, bright white lights across the \"front\" two sides. There were two other colored lights, I believe red and blue, which were smaller and near the points. The triangular shape was very well defined from the bottom, and in the dark in looked to be a grayish/metallic color. I continued to watch as I drove by, and the object remained in place. \tI was so alarmed and curious that I considered calling the police, but I didn’t know the name of the county I was in and dropped that idea. I also considered pulling over and getting a better look, but it was an extremely cold night and I didn’t feel safe stopping on the side of the freeway. I did call my husband to describe the experience to him. \tI am an extensively published nonfiction writer and adjunct lecturer in English at a university in Kansas.",
      "link": "http://www.nuforc.org/webreports/055/S55392.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c18",
      "summary": "UFO sighting in Kansas City - two craft exit a larger craft",
      "city": "kansascity",
      "shape": "sphere",
      "date": "2006-07-16T00:00:00",
      "story": "UFO sighting in Kansas City - two craft exit a larger craft I was at my mother's house staying the night with her when I awakened at 3:47 AM and had a nagging feeling to go outside and look up. I did and shortly after steeping out on the back patio I saw a white round shaped object traveling from the North East to the South West almost straight overhead - maybe 15 degrees off of vertical. The night sky was clear with a few scattered wispy clouds and stars were clearly visible.  The object appeared to be a satellite, but I thought it as a little large to be a satelling and though it might be the space station. It was traveling fast but was very high up so it took a while to move accross the sky. I first noticed it when it was approximately 45 degrees up from the horizon.  I and watched it travel along a straight line until it was approximately 30 degrees from the horizon.  The thought that it could be a UFO came into my mind and I thought \"Well, if you are something not of this world then show me a maneuver so I know for sure.\"  I really wasn't expecting it to do anything as I was still sure it was a man-made craft.  At that point I was just about to turn around and go back into the house when it started wavering, then stopped dead and immediately (one second) went back the same direction it came from. I remember thinking \"satellites don't do that.\" The object traveled a short distance then stopped. Two smaller objects came out of it and moved downwards, one to the right and one to the left in an upside down V pattern.  I kept my eyes on the larger object and watched as it faded out as if moving away from the earth out into space. It was too far away to tell exactly what it was doing.  I did not find the other objects in the sky after that and don't know where they went. The time on the clock when I returned was 4:05.  I locked the patio door and pulled the drapes but was a little ancy about going to sleep after that.",
      "link": "http://www.nuforc.org/webreports/051/S51136.html",
      "state": "MO",
      "duration": "17 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ec5",
      "summary": "MISSOURI INVESTIGATORS GROUP Report:  ..out of the white came a boomerang craft \"straight forward\" and \"flipped\" on its side …",
      "city": "kansascity",
      "shape": "changing",
      "date": "2009-12-12T00:00:00",
      "story": "...out of the white came a boomerang craft \"straight forward\" and \"flipped\" on its side ... I go to bed very late do to insomnia.  It was 4:30am and I figured I'd try to get some sleep; upon going to the bedroom I went to the bathroom first.  Something told me to look out that window.  My eyes looked directly under the tree across the street, which I might add, I live in a development.  There I saw hovering about 3-4 feet above the ground which looked to me like sparkly bright orange atoms trying to cling together, shaped in a circular formation. Well, I thought \"hmm\" must me a UFO. I hurried to my window behind my bed to see if I could see it from a different prospective.  After running around like a crazy woman, I decided to go to the front door. This was the morning before the storm and it was quite windy, but some how I missed it getting daylight.  Seems I had missing time; anyway, I looked around and didn't see it, then my eyes were drawn upward, above my neighbors house across the street only this time it was white, and it seemed to be dancing in mid air. It definately knew that I was watching it and I knew it was watching me.  It moved left to right and right to left, upward and inward, then came to a dead stop.  It was about 2-3 houses high and hovered just by the brim of the tree tops.  Then, suddenly, it started to back upward slowly real high like a dot in the sky.  At that point I thought \"Oh, is a plane coming?\" yet there was no sound.  Then I heard a plane, and it passed over in front of it.  After it passed, guess what?  The ufo came slowly back down, right in the same exact spot in front of my house!   By this time it was a few minutes after 6am or 1800, as I ran to try to find my camera, I don't own a camcorder. Franticly, and unfortunately, I couldn't locate it.  (Later that day, I found it in the spot I was looking).   My husband was sleeping on the couch and I tried to wake him up twice, for some unknown reason I couldn't wake him.  Back down the stairs I go. It was glowing from behind it a bluish and amber color and there was a red dot to the right of it.  The neighbors were leaving for work and yet didn't see this!  Then I had the idea to see if I could play with it, because that’s how close it was and I felt a connection with it.  I started bending my body in different directions at the waist, and each time the ufo would move in that direction. The feeling that overwhelmed me was a feeling of love, understanding and peace and just an abundant amount of love to the point tears started rolling down my cheeks. Then I thought, \"Stop playing with my head and show me your craft.\"  I heard a hummmmm and then it stopped, and the white ufo came even down closer below the tree line and between the roofs of my neighbors two houses and poooff, out of the white came a boomerang craft \"straight forward\" and \"flipped\" on its side (as if you were making a peace sign with your fingers).  Let me tell you, I remember it happened so quickly, that I gasped!  Then I said \"Thank you, you have a very nice craft now don't hurt yourself.\" (lol). I know it sounds crazy, but it’s the gods honest truth. I used 'rule of thumb, to measure' at arms width. Then after standing on its side and me eyeballing it for a good minute or so, like it was showing me its metallic etched craft it flipped back down and went backwards and into a white light again. AMAZING. It backed up, going higher and higher in the SAME spot as it did when the plane passed over, and out of sight. Since that sighting I have seen numerous crafts and strange sightings that would knock your socks off. I'm so glad I finally found a website for Missouri sightings. Additional information: I forgot to mention something that may be of importance to document. After my sighting, my eyes were burning, inside and outside. I spoke of this to my family. That night I took my glasses off and my daughter and law let out a yell, \"Oh my God, your eyes are all pink\" I looked in the mirror and low and behold ALL around my eye lids and corners of eyes looked as if they were sun burned. My girlfriend said that the red light I saw on the craft must have been some sort of laser, and that they gave me a lasor treatment; for the next week after that I was seeing \"Colors\" HUGE blots of burgandy and black while sitting on my patio, everywhere I looked. So, I went to the eye doctor, told him of the incident. He gave me every test available and said that it was unbelievable that there was no change in my right eye which I am legally blind in, usually it disintegrates at a rapid pace. To be honest it felt like I could see better. Report received by Missouri Investigators Group - http://ufomig.bravehost.com ((NUFORC Note:  We express our sincere gratitude to the MISSOURI INVESTIGATORS GROUP, and to its Director, BARBARA BECKER, for their having shared this report with our Center.  If you have had a sighting in Missouri, please consider contacting that organization, at the website above, to share your sighting with their investigators, in addition to submitting a report to NUFORC.  Thank you!!  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73241.html",
      "state": "MO",
      "duration": "2 1/2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b801c",
      "summary": "1952 daylight sighting of multiple discs in formation",
      "city": "kansascity",
      "shape": "disk",
      "date": "",
      "story": "1952 daylight sighting of multiple discs in formation In the early Fall of 1952, I was on the playground of my grammar school in Kansas City, MO, when I happened to glance eastward at the horizon. I saw a very large number of disc-shaped UFO's glinting in the sunlight.  As I watched in astonishment, the objects passed directly over my head and continued onward until I lost sight of them, in all an event of about 90 seconds.  I had the good sense (even as a 10-year-old) to punch a nearby playmate and point upward.  He saw them too.  After school the two of us went to my house and called Richards-Gebauer AFB to report on what we had seen.  About two or three weeks later, two Air Force officers came to my school and I was called out of class and interrogated by them.   First, they asked me how many objects there were and I said about a hundred.  They were obviously shocked and, intimidated, I said maybe there were fifty.  I have always believed the number to be closer to a hundred.  I explained that the discs flew in perfect formation, in what I would today call a chevron formation.  I also explained that they did not fly in an uninterrupted, straight-ahead motion, but displayed a yo-yo motion, almost as if they were intaking air to propel themselves, then resting momentarily before the next intake and move forward, and so on.  This they did in perfect unison.  The two officers were skeptical and asked me if I knew what ducks look like in formation.  I made a V with my fingers and refused to go along with the duck hypothesis.  Then they told me that \"these things are usually reported in two's and three's, not in large formations.\"  They asked if anyone else saw the event, and I told them the name of my playmate, who was sitting in his classroom, not 100 feet from where we were sitting.  They then said they had all the information they needed and left without interviewing the other boy. Over the years, I have read much of the published UFO literature and have found only one sighting that somewhat resembled my own--that of a U.S. soldier in the South Pacific in 1942.  He also saw a large formation of disc-like objects, which at one point made a loud rumbling sound.  In my case, there was no detectible sound.  The amazing thing is that there were at least 100 children playing on that playground, and as far as I was able to determine at the time, no one else noticed this obvious intrusion into the skies above our school.  Had I not thought to signal my playmate, even I might have concluded that I saw an optical illusion.  But it was no illusion. On a couple of other occasions, years ago, I attempted to contact other UFO organizations, but no one got back to me.   Now I am 66 years old and feel strongly that I want some permanent record of what I saw to exist after I am gone.  I would also like to explore whether the record of my Air Force interrogation still exists, though I doubt it.  I have always felt very privileged to have had this unusual sighting, at the same time frustrated by the official disinformation campaign that obviously is still going on. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65839.html",
      "state": "MO",
      "duration": "90 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b8d63",
      "summary": "Can the Silent approach of UFOS be heard????",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2008-08-12T00:00:00",
      "story": "Can the Silent approach of UFOS be heard???? One night as i went outside i sat on my deck outside my house overlooking the dence woods that overlook my house. the air was chilly that night so cold an eskomo would say \"Damn!\". i was out that night looking at the sars observing the night. i had a tape recorder that night incase i saw something interesting. i did past my woods lies a field about 50 yards away from my standing. out of no where 3 dimonds beguin decending from the sky. makeingno sound as it lightly bends the trees upon decending then hovering on the ground for half a minuit i hit record once i see it. The crafts lights are a Purple on the tip and 2 orange on the left and right bottoms. the craft raises and then is gone the trees whip up and i come out of my gaze of disbaleaf when i hear the limbs cut the wind. later i review the tape and hear pulsing hums raising and lowering in pitch then a static .sound with hums like a tv with static. that night the wind blew loud but on the tape you cannot hear it. i show my brother and some of my friends the tape and they were freaked out within days the tape dissapears literaly.... from there tape and the tape cannot be recorded over. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64717.html",
      "state": "MO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b906d",
      "summary": "Unknown \"orange\" object seen floating above Kansas City",
      "city": "kansascity",
      "shape": "cone",
      "date": "2008-10-31T00:00:00",
      "story": "Unknown \"orange\" object seen floating above Kansas City While working in the yard I glanced up at the moon, which was still high in the sky. Passing directly in front of the moon, was a small object (to the naked eye) moving very slowly to the north-northwest.  I grabbed my binoculars out of the car, and examined the object through the binoculars.  While the object was still quite tiny even with the binoculars, I noted a bright orange/red \"sheen\", with a small white globe near the top of the object. Could not determine if the object was metal or cloth.  It continued moving very slowly to the NW, then vanished from sight.  I immediately contacted the National Weather Service office in Kansas City (Pleasant Hill, MO) and spoke with the on-duty meteorologist.  I inquired if they had recently launched a weather balloon.  He stated weather balloons for this area are launched from Topeka, Kansas which is 60 miles west of my location.  He also stated weather balloons are only launched at 0600 and 1800 hours from Topeka.  I attempted to take a photo of this object, but even with 20x optical zoom, the object did not even show up on the screen of the digital camera.",
      "link": "http://www.nuforc.org/webreports/065/S65792.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b90f3",
      "summary": "Slow moving triangle shaped craft. Size of 2 or 3 football fields.",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Slow moving triangle shaped craft.  Size of 2 or 3 football fields. I was outside walking my dog at night.  Some movement above me caught my eye.  I looked up and saw a triangle shaped object sillouted with the sky as a background.  There were no clouds so the sky was dark.  The triangle was moving at a slow rate of speed maybe 2000 ft off the ground. It continued to fly at a slow speed until I could no longer see it.  The bottom of the triangle had 5 to seven lights along the leading edges of the bottom.  The lights were a bright white light.  The rear of the triangle did not have any lights. I live in the flight path of the KCI airport and see planes every day and night for the past year and a half that I've lived here.   I have never seen this before. And it was completely silent. I have also seen stealth fighters and bombers but they have normal blinking lights like other jets.  Plus they make very loud jet noise when they pass over head. I work for the Federal government as an attorney.  I was previously a commissioned officer in the United States Navy.  I was formerly an assistant District Attorney for Jackson County Missouri.",
      "link": "http://www.nuforc.org/webreports/067/S67146.html",
      "state": "MO",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b924a",
      "summary": "On 2/6/9 I saw a very fast moving black object with a rounded front and small tail in the sky. It disappeared behind a cloud.",
      "city": "kansascity",
      "shape": "teardrop",
      "date": "2009-03-19T00:00:00",
      "story": "On 2/6/9 I saw a very fast moving black object with a rounded front and small tail in the sky. It disappeared behind a cloud. On Friday,  Jan. 6th, 2009, I was traveling by car from Kansas City, MO to Sedalia, MO along I-470E/US-50E and I saw a fast moving black object  in the sky several miles ahead of me. It had a rounded front and a small tail. It caught my attention because of how fast it was moving and its shape. I watched it for approx. 10 seconds before it went behind a cloud. I waited for it to reappear on the other side of the cloud, which it never did.",
      "link": "http://www.nuforc.org/webreports/068/S68560.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b93be",
      "summary": "Brillaint Flash of Green light in sky over Kansas City, Missouri at 01:30 am on 11-12-2009.  ((NUFORC Note:  Possible meteor??  PD))",
      "city": "kansascity",
      "shape": "flash",
      "date": "2009-12-12T00:00:00",
      "story": "Brillaint Flash of Green light in sky over Kansas City, Missouri at 01:30 am on 11-12-2009. At 01:30 am 11-12-2009, saw brilliant flash of Green light over Kansas City Misouri area. Weather was clear, no clouds.  My 22 year old son and I both saw it. In his words, \"it kinda freaked us out\".  Have NO IDEA what it was, have NEVER seen anything quite like this.  Just a BRILLIANT Green flash that lit up the night sky. ((NUFORC Note:  Possible meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73264.html",
      "state": "MO",
      "duration": "Flash of Light"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b87",
      "summary": "Blue football of light seen over Kansas City near Claycomo",
      "city": "kansascity",
      "shape": "oval",
      "date": "2009-05-12T00:00:00",
      "story": "Blue football of light seen over Kansas City near Claycomo Around 9pm on 4/14/09 I was heading home from a friend’s house, when I saw one of the most beautiful and amazing sights I have ever seen. I was smoking a cigarette, just cruising down the highway when I looked up through my windshield and saw a ball of light. Once I focused in on the light and saw that it was not a plain, it shot of into the westward sky.  It had a tail almost like a comet.  I have never seen anything move so fast in my life.  It looked almost as it disintegrated.   I was not a believer until last night, I do not do drugs, nor was I drinking.  What I saw was real.",
      "link": "http://www.nuforc.org/webreports/069/S69644.html",
      "state": "MO",
      "duration": "10 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b9e60",
      "summary": "Rectangular connected series of \"glass\" globes with exhaust...",
      "city": "kansascity",
      "shape": "other",
      "date": "2009-08-05T00:00:00",
      "story": "Rectangular connected series of \"glass\" globes with exhaust... I saw an unusual craft flying overhead today at approx 12:15 am CDT. It looked like a series of glass globes, possible six, in tandem with an afterburner/exhaust and very unusual lights on it, although it had a blinking red light on what was the rear section. It also had three bands of marquee-like lights on the bottom. There were lights between some of the sections and internally. I have never seen this type of craft before nor read any accounts of it. (You may post this if you wish...I did not have anyway to draw then post to internet so I found a program called draw where I made a \"sketch\" of the general shape.  The smaller circle at the end represents the exhaust or afterburner; the rectangles represent the three strips of \"marquee\" like lights which were solidly on...they did not blink,,,,and the small circle the red light which was flashing on and off. I am emailing you seperately the 'drawing\"  as an jpg I made using draw online software.)   I don't know if it was of earth or beyond, but it was impressive, and much larger than a typical jet.  It sounded like a typical jet but the light patterns and shape dispelled similarity to a typical jet. It made the sound of a typical jet albeit louder than average, and it appeared much larger than typical jet, if I held my arm at full length and measured using fingers I would say it appeared four inches in length, about 1/2 inch in width against the night sky.  I would estimate it was way less than 30,000 feet --maybe 10,000 feet up. <To match drawing being mailed seperately please look for KCSHAPE in tagline of my sepearte email.>",
      "link": "http://www.nuforc.org/webreports/071/S71271.html",
      "state": "KS",
      "duration": "40 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1f6",
      "summary": "flash of light over kansas city",
      "city": "kansascity",
      "shape": "flash",
      "date": "2009-03-19T00:00:00",
      "story": "flash of light over kansas city driving along 35 south off of southwest blvd, and large flash, like before a nuke goes of in movies goes off in the southern direction. Lasted at least 7 seconds if not more from the time I noticed it. looked for it in news and nothing for some reason didn't think about it much untill the meteor that almost struck earth march 2, and realized i had forgotten such a huge sighting. I think it's connected to our so called tenth planet B52.",
      "link": "http://www.nuforc.org/webreports/069/S69056.html",
      "state": "MO",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baf11",
      "summary": "linear formation of 6 to 7 bluish orbs moving from north to south in the approximate location of Blue Springs, MO",
      "city": "kansascity",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "traveling east on I-70 around 630PM on Friday, October 29, 2010, we witnessed a relatively low level very linear formation of 6 to 7 bluish orbs moving from north to south in the approximate location of Blue Springs, MO.  There was a haze between the object, my son said 'that object looks like the Phoenix lights'.  The line of orbs was followed by what appeared to be a helicopter, flying above and behind the line.  As the linear formation traveled further to the south, the orbs scattered, became very bright and then disappeared.  A couple of helicopters circled the area for some time after.  There was a lot of traffic and others must have encountered this formation. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78640.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baf3e",
      "summary": "Two orange, flashing oval craft hovering low in sky",
      "city": "kansascity",
      "shape": "oval",
      "date": "2011-01-05T00:00:00",
      "story": "Two orange, flashing oval craft hovering low in sky Sighting 2 Dec 2010, Wyandotte County, KS In northwest sky, at about 17:00 hours, two solid objects, bright orange, and round or oval in shape, were seen out north-facing picture window hovering, one low above horizon, the other directly above the lower one at about the same point in sky as upper power lines (looking out house window). Weather was clear, no wind to speak of. The objects flashed, with orange light (did not blink on and off) like a strobe effect. Both were larger and brighter than stars appear. Point of observation is atop a hill about 1 mile south of MO river, situated below regular MCI and downtown airport flight paths (aircraft such as commercial jets, small planes, helicopters frequently overhead). These objects were not moving: neither to either side, nor becoming larger or smaller for several moments. I called my husband to see them. The uppermost object then moved away rapidly into the northwest sky. The lower object remained stationary for another several minutes (I had time to get my telescop! e from another part of the room and aim it at the object). The object remained where it was; a regular plane flew over the space with normal movement toward airport, but the hovering object did not move at all. Finally it very slowly moved upward (judged by power line in foreground) and then away toward the northwest(in the same direction as the one before had gone) and was quickly no longer visible. Could not tell how far away or at what altitude, but compared to the commercial jet it was (estimated) about half the size of the fuselage of the jet and at about the same altitude, but seemed more distant  – no wings were apparent. When these objects moved away they quickly became \"smaller\" to the naked eye, and then disappeared. Observer is a woman with a Master's degree, and husband is an IT specialist.",
      "link": "http://www.nuforc.org/webreports/079/S79116.html",
      "state": "KS",
      "duration": "approx 6 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bbc1e",
      "summary": "Possible abduction, witnessed several hovering discs from the ground.",
      "city": "kansascity",
      "shape": "disk",
      "date": "2011-10-10T00:00:00",
      "story": "Possible abduction, witnessed several hovering discs from the ground   The night this happened, my husband and I were up pretty late watching a movie. It ended about 1:30 AM, and I went up to bed. My husband was crashed out in the basement, so I decided to leave him there. I climbed into my bed next to my daughter (who frequently sneaks out of her bed to sleep with me). I must have been exhausted and just crashed, which is odd for me, because it usually takes several minutes to get to sleep, even when it's late. The next morning, I woke up extremely dehydrated and recalled a very startling and vivid “dream” of being around aliens and UFOs. This was so startling, and unlike any other dream that I’ve ever had, so I decided to explore other options, such as an actual abduction. I’ve heard of the UFO/alien phenomena, but had never given it much consideration till this event. I don't recall being \"beamed up\" but I clearly remember being taken somehow to a place with a lot of hallways. Then I remember feeling like I was being instructed to urinate in a long and wide tube with strange markings on the side. I think the markings indicated measurements or something. The last thing I remember was being on the ground, outside, in what looked like a vacant/abandoned parking lot. I remember the concrete had lots of cracks in it like it was old and worn. There were evergreen trees surrounding this place. There were other people standing around me with cages of small animals, like house cats, birds, dogs, etc. I got the feeling like these people around me were going to release them. I remember feeling like it was approaching morning, but it was still dark outside. I looked up in the sky and noticed several (at least four) UFO craft very near above the ground of this parking lot, just hovering. There were three red lights coming from the bottom of them that ! blurred or blinked till they became one light beam. It's very hard to explain. These craft were larger than I’d have expected for what you see on television. I guess I’d always pictured them being the size of a small bus, but these were the size of a large home. I don’t remember ever being inside of the craft, but being inside of a building or structure near this lot. The other people there, like me, weren't completely in reality. It was like we were in a trance. I remember standing in this lot, looking up, and seeing one UFO fly high, stop, fly a little bit to the left, stop, fly higher, stop, and then flew off and vanished. So, after looking up at these UFOs from the ground, I remember it all of a sudden clicking (like a switch had been turned on) that this wasn't normal... And I remember taking off running as fast as I could. I had just snapped back to reality. As soon as I started to run, I recall the others, which I assumed had also been taken, almost clicking too and ! scattering in all directions. The last thing I recall is some ! kind of luminescent \"beam\" of sorts encasing me as I ran. I woke up very dehydrated, a bit weak, and still tired, but I remembered this almost like it had really happened. After that night, I had a minor sore throat and occasional minor pains in my abdomen. This lasted about two weeks, off and on. Ordinarily, I would have chalked this up to just being a dream or my subconscious manifesting my fears in an odd way, but the next day, my daughter said something extremely startling to me...\"Mommy, who were those boys that came and took you when you were sleeping?\" I questioned her a little, but I didn't want to push it with her, so I sort of left it be. She didn't seem particularly worried or concerned about it, just curious. (She was just shy of 4 years old at the time.) I’ve since asked her about it off and on, and she doesn’t appear to recall much more than she already said. Since then, I’ve started to attend MUFON meetings and I joined a group for experiencers and have been speaking with the leader, who is also a regression therapist. I haven’t shared this with anybody outside of this small group about this experience. I’m pretty sure my peers, family, and friends would think I’m crazy, so I would like to keep this somewhat anonymous. Upon reflection of this event, I started to piece together a few of my memories from childhood, and start questioning them more. For example, I remember a period of missing time when I was about 12 years old, where there were several hours unaccounted for. I had never even thought to question the “missing time” or even heard that phrase till after this last event occurred. If any of this seems relevant, please feel free to contact me, but I would appreciate my name being withheld from any public report.",
      "link": "http://www.nuforc.org/webreports/083/S83575.html",
      "state": "KS",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3bbc9e",
      "summary": "8-16-2011 I saw a rectangular object like a 2-story building on its side not moving and 8-20-2011 8 orbs not moving were together.",
      "city": "kansascity",
      "shape": "formation",
      "date": "2011-10-10T00:00:00",
      "story": "8-16-2011 I saw a rectangular object like a 2-story building on its side not moving and 8-20-2011 8 orbs not moving were together. I have two different sightings at different dates and times within days of each other.  On August 16th, 2011 at 17:00 in Kansas City, I was looking out my sixth floor window, facing N.E., when I noticed an unusual object. This object was higher than most planes I see.  This rectangular object appeared as a two-story building, but on its side, not tall as a building.  I remember thinking how it was not very long.  There were evenly spaced rectangular, well-lit openings which I thought at first were windows, but later I realized since they were far away, they had to be more like doors.  Although I did not count them, it seemed there were only about 8 of these openings on the first layer, then below them there were identical openings.  This \"building\" was very still, not moving for about 15-20 seconds.  Then it moved slowly and disappeared.  This object bothered me, but I decided not to report it since I did not have a picture or video. Then on August 20th, at 21:15, I looked close to where the “building” had been, just slightly west of there and I saw 8 orbs, almost like stars, but in a loose group together.  They were a little larger than stars, all the same size.  None of them moved at this time.  After around 10 seconds three of the orbs on the outer edge of the entire group started to move slowly as the others remained motionless.  Taking turns, the first orb of the smaller group went behind a neighboring orb and disappeared.  Of the smaller group this left two and again, an orb went behind the other and disappeared, leaving one and then it disappeared.  They did not leave, they just ceased to be in my sight.  As soon the last orb was gone, the remaining larger group of about 5 orbs moved slowly at the same time but did not go very far.  Then they all repeated the same actions of the first group, going behind each other until they were gone, although they went more than one at a time as before, disappe! aring quicker than the first group.  Wondering how these orbs disappeared, perhaps they were actually going into something that was cloaked, thus disappearing from sight.  Since there were two sightings of mine, I deemed this significant so I am reporting them, though I have no pictures or video.",
      "link": "http://www.nuforc.org/webreports/083/S83646.html",
      "state": "KS",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc178",
      "summary": "North Kansas City UFO",
      "city": "kansascity",
      "shape": "oval",
      "date": "2011-12-12T00:00:00",
      "story": "North Kansas City UFO I had some street lights on Barry Road turn off right before I noticed the object in the sky.  I saw an oval object with lights all around it hovering on top of the Macy's at the Metro North Mall by 169 highway.  It was stopped there and not moving for about 2 minutes, then took off heading towards Southwest.  It was going very fast but it went from being really low to up.",
      "link": "http://www.nuforc.org/webreports/085/S85308.html",
      "state": "MO",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3cf",
      "summary": "Saw a thin and long triangular shaped object with red and green lights.",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "saw a thin and long triangular shaped object with red and green lights. At around 9:30pm I heard a strange noise outside, it sounded like a very low flying plane.  I went out the front door (which faces the west)and saw a low flying triangular shaped aircraft with flashing red and green lights.  At first I thought it may be something like a stealth aircraft because the Chiefs were playing at Arrowhead on this night, but then I realized most stealth aircrafts do not make noise nor do they have flashing lights.  The strange thing about this object was that it was flying just above the tree tops and it stopped and hovered for approximately 2 to 3 minutes then it did a 180 (while it was hovering) and took off at a pretty quick speed.  When I looked to the north I saw a helicopter coming at a high rate of speed toward the aircraft (we have a police helicopter station within a mile of my house),but the aircraft just seemed to vanish leaving the helicopter to just fly in circles around my neighborhood.  I guess the thing that really has me questioning what this object was is that back in the latter part of August I was walking up our street and saw the exact same aircraft hovering above the school up the street.  On this occasion my neighbor was returning home and saw it also.",
      "link": "http://www.nuforc.org/webreports/085/S85536.html",
      "state": "MO",
      "duration": "approx. 5-10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc4cf",
      "summary": "Orange fireball crosses the sky in Kansas City.",
      "city": "kansascity",
      "shape": "fireball",
      "date": "2011-10-10T00:00:00",
      "story": "Orange fireball crosses the sky in Kansas City. At 9:43 pm a bright orange light, approximately 10 times larger than Venus appeared in the Southwestern sky. It traveled Northwest 20  degrees for about one minute.  The orange \"fire like\" glow pulsated consistently for about 55 seconds.  Then the light pulsated to nothing in the last 5 seconds.  The height was about 20 degrees from the horizon.",
      "link": "http://www.nuforc.org/webreports/084/S84270.html",
      "state": "MO",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc4d0",
      "summary": "Unusual fireball-like orb moving in the sky, and suddenly disappears",
      "city": "kansascity",
      "shape": "fireball",
      "date": "2011-10-10T00:00:00",
      "story": "Unusual fireball-like orb moving in the sky, and suddenly disappears As my friend and I sat facing the south western sky we both saw a reddish orange light perhaps 5 times larger than any star moving westward horizontally  at an irregular slow speed.  Neither of us had seen it's likeness and as we watched it it appeared to flicker as if on fire, moving sometimes closer (larger) and farther (smaller) away from us.   After about 40-45 seconds it entirely disappeared.",
      "link": "http://www.nuforc.org/webreports/084/S84269.html",
      "state": "MO",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc865",
      "summary": "Several blue lights blinking in the sky not moving. they look light stars but serveral of them twinkling at the same time…",
      "city": "kansascity",
      "shape": "light",
      "date": "2011-12-17T00:00:00",
      "story": "several blue lights blinking in the sky not moving.  They look light stars but serveral of them twinkling at the same time…",
      "link": "http://www.nuforc.org/webreports/085/S85878.html",
      "state": "MO",
      "duration": "current"
    },
    {
      "_id": "64d005f478aba2ec5a3bcab8",
      "summary": "Kansas City MO/ Independence MO lights and configuration night sky sightings",
      "city": "kansascity",
      "shape": "unknown",
      "date": "2011-08-21T00:00:00",
      "story": "Kansas City MO/ Independence MO lights and configuration night sky sightings 08/19/2011 21:07 In Northeast Kansas City MO driving West, in the Northern part of the night sky.   Saw approx 5-6 small, but bright white lights that would perform coordinated synchronized movements and make shapes such as triangle and diamond. When these small bright white lights moved, they would each leave a small lit trail from their last position.  Sometimes, there would be two together at once forming the synchronized shapes. 08/19/2011 21:45 Heading home driving south in Independence, MO saw a large, long thin object with different colored lights moving eastward.  The lights were multicolored, but there was a large section unlit, and the very tail of the other end was partially lit.  This object was moving at a fast pace.",
      "link": "http://www.nuforc.org/webreports/083/S83296.html",
      "state": "MO",
      "duration": "1 1/2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcab9",
      "summary": "Cluster of lights spotted in sky over Kansas City, KS, moving at incredible rate of speed east toward KC, MO",
      "city": "kansascity",
      "shape": "light",
      "date": "2011-08-21T00:00:00",
      "story": "Cluster of lights spotted in sky over Kansas City, KS, moving at incredible rate of speed east toward KC, MO Traveling East on I-70 in Kansas City, KS saw two clusters of white lights in the sky.  Took note because not a location for lights.   While watching lights changed formation, and began to move away from it's present location heading east as well toward Kansas City, MO.   Lights moved slowley at first then picked up speed and moved far enough in to the distance we could no longer see them.  Four our five seconds later we noticed a singular light almost over head.  It hovered for a moment and quickly moved into the distance as well, traveling north east. In both cases once the lights began to move, they moved in to the distance in seconds, easily traveling faster than our moving vehicle.   Dissaperated into the distance faster than a commercial plane normaly appears to move.",
      "link": "http://www.nuforc.org/webreports/083/S83297.html",
      "state": "KS",
      "duration": "1 minute?"
    },
    {
      "_id": "64d005f478aba2ec5a3bcaa0",
      "summary": "Large white object came into atmosphere and broke up into 5 smaller objects over Kansas City, MO",
      "city": "kansascity",
      "shape": "fireball",
      "date": "2011-08-21T00:00:00",
      "story": "Large white object came into atmosphere and broke up into 5 smaller objects over Kansas City, MO While driving southbound on I-29 highway north of Kansas City, MO, my driver and I saw what looked like a large round white fireball coming into the atmosphere.  There was a long white trail following the main object that was headed downward.  As the object got lower it appeared to slow down, the trail of fire disapeared and the object broke into 5 smaller white objects.   These objects seemed to stop falling, spread out in the air and hover for approximately 10 seconds before disapearing behind trees and the horizon. ((NUFORC Note:  We spoke via telephone with this witness, and he seemed quite sober-minded and eloquent.  We suspect that he is a highly reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83295.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd1f",
      "summary": "A large white object moving slowly at cloud level that was over an aproach corridor to KCI airport. It slowly entered a large cloud and",
      "city": "kansascity",
      "shape": "cylinder",
      "date": "2011-06-12T00:00:00",
      "story": "A large white object moving slowly at cloud level that was over an aproach corridor to KCI airport.  It slowly entered a large cloud and disapeared.  It seemed to be two to three times the size of a jet liner.  Two jets did fly over and under it, but evidently didn't see it.   Its white color probably blended with any clouds that were near.  The cloud that it entered was huge, but was only 1/4 as wide as the craft which seemed maybe 1,000 ft. X 300 ft.if it was a disc, it would have to have been tilted quite a bit to have shown such an exposed face which had no shadow to speak of.  Bright white and possitively Not a baloon or derigible! I was driving to eat lunch when I noticed the thing in the sky.  When I saw that it was virtually standing still or was moving very slowly, I raced to the middle school and ran inside to get some other witnesses.  Three people came out and I said \"now somebody tell me what that is!\"  Nobody could identify it, but we all agreed that it was not a conventional aircraft.  Upon entering the cloud, the others went inside the school to go back to work.  I of course had to stay, never taking my eyes off of the cloud. In four minutes, I noticed that the cloud had moved to the right with the wind ( the object had gone from right to left) and something very bright was now moving away into the distance very fast! It soon disapeared at a slight angle upward.  Art bell was correct in stating that people only see these things when they bother looking up!  I wonder what else I've been missing all these years...oh yes, as the object slid into the cloud, and the haze slid around it, It took on a grey or metalic color. the shape was oval or cylinder.  ((name deleted)) III, Archaeologist for ((company name deleted)) Research. ((NUFORC Note:  Date not indicated.  NUFORC has assigned an arbitrary date above.  PD))",
      "link": "http://www.nuforc.org/webreports/010/S10312.html",
      "state": "MO",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bce23",
      "summary": "UFO's spotted over kansas city mo",
      "city": "kansascity",
      "shape": "circle",
      "date": "2011-06-03T00:00:00",
      "story": "ufo's spotted over kansas city mo i just got home from walking around in the woods to plant some seeds,  i got nothing better to do anyway.  It was 3:30 in the morning on tuesday may 31 2011 when i got home i went outside my basement door to have a smoke where i always smoke and i was looking up it was about to rain some it was fairly cloudly and had been storming all week  i think the direction i was looking is south but dont take my word for it i dont have a compass haha and this enormous circular object appeared it looked to be about the same level as the clouds and it also looked transparent practically invisible to the eye and moving fast with no sound heading north,   then a few seconds later three balls of light going a lot faster were heading south in the opposite direction of the circular transparent object and the flying balls of light turned around in a split second all three of them turned around at the same time and took off in the direction as the big circular object going insanly fast and it was gone i have never seen anything like it before and tonight ive spent some time looking up in the sky and theres no clouds even out and ive been watching the planes in the distance and i can tell you right now that what i saw were not planes. ((NUFORC Note:  We spoke via telephone with this witness, and we found him to be sincere and serious-minded.  We suspect that he is a credible witness.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81609.html",
      "state": "MO",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcf30",
      "summary": "Aircraft that can explain some of the sightings",
      "city": "kansascity",
      "shape": "other",
      "date": "2012-08-05T00:00:00",
      "story": "aircraft that can explain some of the sightings This is not a UFO  but an oddly lit aircraft that might be the source of some of the UFO sightings in the Kansas City region. The aircraft about the size of a 747 with yellow-orange lights running down the body of the aircraft from the nose to the tail. The lights are extremely bright compared the the normal aircraft lighting from the cabin windows being open and the typical lighting on an aircraft. Spotted the aircraft moving north to south and looked like a glowing orange cigar shaped craft at about 20-30 miles out.   Plane then tuned  and flew directly over my house and clearly make it out as an  aircraft. Not sure what aircraft it was, but had quad engines and wings under under the body.  Body length about the size of a 747.    Could not clearly make out the body or any markings as the lighting was too bright.      Aircraft was not in a landing approach to MCI or from a take off at MCI.    Looks like its flying around.  Changed directions and started to head to Kansas City Kansas about 1 or 2 miles from my house.",
      "link": "http://www.nuforc.org/webreports/091/S91366.html",
      "state": "MO",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd056",
      "summary": "Cigar shaped object next to jet",
      "city": "kansascity",
      "shape": "cigar",
      "date": "2012-09-24T00:00:00",
      "story": "Cigar shaped object next to jet I saw an object to west of a jet traveling south in the high noon position.  Jet was high enough to create a clear contrail which did not obscure the viewing of the object.   Object was similar in shape to jet without wings, possibly longer.  It was not moving.  The jet was about 100 yards away and continued south, while the object remained stable.   The “ufo” was silver/white in color and remained in the same position for at least 45 seconds.  I was unable to follow any longer as I was moving out of viewing position.  The sky was clear with no clouds at all.",
      "link": "http://www.nuforc.org/webreports/092/S92001.html",
      "state": "KS",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd153",
      "summary": "Red solid sphere in sky",
      "city": "kansascity",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Red solid sphere in sky Was setting on patio in backyard and the kids had just finished setting off fire crackers nothing that would go up into the sky, it was still daylight out.   The kids went inside because of the heat, myself and a friend was setting out talking when we looked up we seen a small sphere shaped object that seemed solid and red in color gliding along the treeline making no sound heading in a northeasternly direction.  Did not look like a lantern or a controlled flying object such as a plane or toy UFO.  Very strange to us we had never seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/090/S90702.html",
      "state": "MO",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd2ed",
      "summary": "5 objects viewed during landing approach to Kansas City MO airport MCI",
      "city": "kansascity",
      "shape": "teardrop",
      "date": "2012-09-24T00:00:00",
      "story": "5 objects viewed durning landing approach to Kansas City MO airport MCI 8/26/12 at 8:15 pm on approach into Kansas City (MCI) airport from Memphis, flight touched down at 8:25 pm ct.  Observed 5 metallic dark silver tear drop objects with red glowing interior as it passed above large radio broadcast antenna and below our wing.  Tried to make out if it was another aircraft, determined it was not as there were no wings or rotors.  If it was suspended or supported from the ground and could not see that.  The objects were very close to the plane 100-200 feet and closer to the plane than the radio broadcast antenna.  Do not know what I saw.  A white light appeared at the end of one of the objects.  Plane flew over them and they were gone out of sight from my window.  They were moving at and angle slightly away from the plane while the radio antenna stayed in a constant left to right position, so I determined the object was not attached to the ground and moving away from the plane meant they were flying, basically our flight path did ! not “make” the objects move as the ground objects moved.  They were in the air and in formation.  I will email a image that I have mocked up of what I saw, as my camera was turned off for landing.",
      "link": "http://www.nuforc.org/webreports/092/S92248.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd2c6",
      "summary": "Pyramid Drone over KC, Kansas. Morphed to oblong oval before disappearing.",
      "city": "kansascity",
      "shape": "other",
      "date": "2012-10-30T00:00:00",
      "story": "Pyramid Drone over KC, Kansas.  Morphed to oblong oval before disappearing. In our backyard, my girlfriend had noticed a bright helicopter light, probably 10-15 miles away. We often focus on these things, in hopes, to one day see a UFO for ourselves.  As the light moved closer towards us from the south east, the object took a shape.  To our astonishment, the object was pyramid shaped.  The light that was on the vehicle was set at the base of the pyramid.  This light did not have beam like qualities, but it seemed to be spotting.  The craft would stop, rotate the light around the body, stop the light to observe something, then continue on it's path.  We watched as the object moved closer and closer.  After about 2 minutes the object was probably 2 miles away from us at the most.  It was BIG!  There also seemed to be some kind of &quot;Heat-wave&quot; aura around it, like heat waves you see coming off of the hot streets in the summer.  There were no sounds that we could hear from the object.  At its closest point to us, estimating about 2 miles, the object turned towards the South west.  Before the craft disappeared behind the trees, it had sort of morphed into a more oval/oblong shape.  As soon as the thing had left our sight, we dashed for the car.  We traveled down I 635 in hopes to find the path of the object.  There was no trace of this object!  One thing to note: few seconds after this had left our sight, a large commercial like plane flew pretty low in the same direction as the ufo. We find this odd because there is no major airport to the sw of us.",
      "link": "http://www.nuforc.org/webreports/093/S93164.html",
      "state": "KS",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd590",
      "summary": "Photo picks up 2 pink ufos",
      "city": "kansascity",
      "shape": "disk",
      "date": "2012-10-30T00:00:00",
      "story": "Photo picks up 2 pink ufos took these pictures and did not see the ufo images until we looked at the pictures.  My 14 daughter took the pictures because I commented that there were chemtrails in the sky.  She complained that it looked like pink lips in the photos but they were not visible to the naked eye.",
      "link": "http://www.nuforc.org/webreports/093/S93344.html",
      "state": "MO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd586",
      "summary": "Super brilliant Orange/Red spherical object/orb",
      "city": "kansascity",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Super brilliant Orange/Red spherical object/Orb Sunday 07-08-2012 Time;10:13PM CDT. Near Liberty Missouri. Azimuth:78 Deg., viewed to North, Direction of travel from east to west. Duration of observation 2-3 mins. My partner and I stepped outside to smoke a cigarette be for going to bed. I noticed the super brilliant Orange/Red spherical object just over the rooftop. She also witnessed this event. Orb/object was surrounded in a conical Iridescence, possibly ionization from the atmosphere, which varied in shape aft of the object and decreased in shape and visibility further downrange to the west. Initially the object size at first sighting overhead was the size of a \"BB\" held at arms length.  Appx Altitude was 30-40,000 feet, ceiling:Unlimited.  To slow to be meteoric.  To low to be a satellite.  I am ruling out aircraft military/commercial and this was not an Iridium Satellite flash sighting folks.",
      "link": "http://www.nuforc.org/webreports/090/S90736.html",
      "state": "MO",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6db",
      "summary": "All the ships were moving indepently and then they conected and then move at the same time",
      "city": "kansascity",
      "shape": "diamond",
      "date": "2012-08-05T00:00:00",
      "story": "All the ships were moving indepently and then they conected and then move at the same time We saw many ships, in the fist 45 min we saw these trinagle and dimond shaped ships about 5 or 6 of them moving back and forth rappedly, turning and moving to the east. there were these red and white flashing ships that were zig zagging and moving around other ships like that. it look like there were lights coming out of it to.there also were white dot ships that were doing the same thing and moving very fast. Next about an hour into it there were clouds moving to the east farly fast during this period i could see a few bigger triangle shaped ships and many small ones. Once the clouds move to the east fully clearing the sky and i could see these big dimond shaped ships, it looked like they were triangle shaped ships attaching to the bigger dimond shaped ones, and had small ones moving in and out of the main ship.  saw atleast 10 bigger ships moving tword one another, and then sundly the stop and all the ship started to move at the same speed at this time they were going back to the west. While this was going on the clouds stop moving to the east and started moving to the west.i could still fully see the ships moving to the west.there was a tringle ship that disengaged from the main one and then rotated counter clock wise and took off. the small ships were still what looked like going in and out of some thing. I could see the out line of a diomond ship didnt see much of it but the outline. so about an hour and a half into it there a cloud about to cover up but then stopped and some how was kinda moving in a circle. i saw these three black dots in the sky that went behind a small cloud and the the cloud fadded away. There was one of the small red and white flashing ones that was low enough that i could see the outline of it. it was a smaller circle one but it didnt go the full 360 it kinda looked like one of the ufos off of independce day. At one point when the clouds were over us  we saw this ship that looked like a glass circle going very fast through the sky. The reson why i think that they attached to one main one is that i could see perfect tringles and there all were moving at the same speed.  We saw many ships that would just take off and couldnt see nothing but a small light moving accross the whole sky. At the start of it they were not moving at the same speed they all were scattered and moving in weird ways with smaller ones zipping every where. the whole night i could not see any of the stars that are normaly here at this time and did not see the big dipper once.",
      "link": "http://www.nuforc.org/webreports/090/S90808.html",
      "state": "MO",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd857",
      "summary": "Crescent shaped lights that emitted green light and then moved jerkily and then hovered in place",
      "city": "kansascity",
      "shape": "chevron",
      "date": "2012-11-19T00:00:00",
      "story": "Crescent shaped lights that emitted green light and then moved jerkily and then hovered in place I walked onto my deck at 19:50 and a flash caught my eye in the western sky. I live only 6 miles from the Kansas City airport so I am accustomed to seeing planes takeoff and land. I looked at it for a time and realized that it was making jerky movements preceded by a green flash. It was a light at high altitude, crescent shaped.   I watched it for half an hour and it moved repeatedly, then I sighted two more in the southwest sky. I also witnessed what appeared to be planes with red and white flashing strobes, and I assumed that it was military observation of the phenomenon.   Then I sighted two more in the southern sky.  After 22:00 the lights from a nearby shopping center were dimmer and I was able to see more right overhead and in the eastern sky.  I became unable to count accurately due to the number of UFOs in the skies. Until last night, November 6, 2012, election night, I have been a skeptic and now I am a believer. I phoned my sister in Syracuse, NY, who is professor emeritus SUNY, during this sighting, since she attends UFO conferences and is a staunch believer.   She questioned me and was sure that I was in fact witnessing an event.   They looked different from stars which appear as a bright light that twinkles sometimes and do not move in the manner of water bugs on surface tension on a body of water like these objects did.   I am not sure of the exact duration of the event, because the election coverage was on TV and I went inside to see who was elected. I ceased watching at 22:00 and went back out at 00:30 and they were no longer there. The constellations had changed position, but that was all I saw in the skies by that time.",
      "link": "http://www.nuforc.org/webreports/094/S94201.html",
      "state": "MO",
      "duration": ">2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd8b5",
      "summary": "3 oddly lit planes that might explain some of the UFO sightings.",
      "city": "kansascity",
      "shape": "cigar",
      "date": "2012-08-19T00:00:00",
      "story": "3 oddly lit planes that might explain some of the UFO sightings. location is 100th and N. Woodland ,  kansas City Mo 64155   This is not a UFO but just 3 really odd aircraft that would totally confuse people.      There is a 747-8-International with spot light like lighting going down the  body.   This 747 is visible as a cigar shape  from about 50 miles away, and looks  brighter then venus if it is heading towards you.   paint color seems to be white.     There 2nd aircraft looks to be a 737 with same lighting as the 747 but about 60% dimmer.  You can see it as a cigar shape from about 15-20 miles and looks like a normal large aircraft coming in for a landing.   Plaint color is all black.       The 3rd aircraft looks to be a small business jet with all the same characteristics as the 737.      747 is the main one I have noticed and it is magnificent.  They have been flashing the lights in cloud formations and it can resemble lighting.  If its flying overhead, its brighter then the full moon.     All the planes are zigzag! ging the Kansas City area,  with lights on, sometimes off, sometimes pulsing the lights, and flying around 5,000-15,000 feet.",
      "link": "http://www.nuforc.org/webreports/091/S91477.html",
      "state": "MO",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be45a",
      "summary": "Five fast.cigar shape images going in circles above our neighbor hood.",
      "city": "kansascity",
      "shape": "cigar",
      "date": "2012-07-04T00:00:00",
      "story": "Five fast.cigar shape images going in circles above our neighbor hood. At about 10:30PM I went outside, the sky above me had five cigar shape images going in circles above our neighbor hood.  At first they were bright and then started to dim down and shot five different directions very fast.   Then they came back went together for about three seconds and broke in five again.  The trees blew like a forty-mile an hour wind and lighting shot across the sky one time.  They left for about ten minutes and three returned and started circling again but no wind this time everything was still.  The people across the street came out of their house and saw the same thing I saw. It was scary. It reminded me of close encounters somewhat the speed they had. I tried to take a picture with my phone each time the picture was black and all the other pictures in the phone but two. I then got my digital camera and took pictures and all the pictures were black.",
      "link": "http://www.nuforc.org/webreports/090/S90279.html",
      "state": "MO",
      "duration": "over1 and a half hours"
    },
    {
      "_id": "64d005f478aba2ec5a3be70c",
      "summary": "Large Red Object.",
      "city": "kansascity",
      "shape": "fireball",
      "date": "2012-04-18T00:00:00",
      "story": "Large Red Object. At about 11:50 PM Central Standard Time. Large glowing red-orange object moving north to south.  Looked almost circular but just slightly oval shaped. Longest axis parallel with the ground.  Shortest axis Perpendicular to the ground. Sighted originally at the approximate location on google maps:    http://maps.google.com/maps?q=n.+woodland+and+100th+street+kansas+city&hl=en&hnear=N+Woodland+Ave+%26+NE+100th+St,+Kansas+City,+Clay,+Missouri+64155&gl=us&sqi=2&t=h&z=16  Object disappeared at about 11:52PM near the missouri river I435 and Front Street:   http://maps.google.com/maps?q=435+and+front+st+kansas+city&hl=en&ll=39.139913,-94.491692&spn=0.082814,0.117416&sll=39.090101,-94.510574&sspn=0.165745,0.234833&t=h&gl=us&hq=435+and&hnear=E+Front+St,+Kansas+City,+Jackson,+Missouri&z=13   Object size looked to be about size of a USA 25cent piece '\"Quarter\" that is placed 12\"  from a human eye with 20/20 vision, at the initial spotting location.   NO noise heard.  No aircraft wing, tail, or landing lights. At or near the Kansas City Metropolitan Community College Maple Woods Campus, Object seemed to be gaining elevation and still heading south.  No other lights but the consistent red-orange glow was observed.   We can observe elevation due to a consistent white glow of the city that goes about from the horizon to about 30 degrees above horizon while facing due south. At or near the final location of spotting, the item seemed to be turning due east.  Then item disappeared.   Final size was about the size of a USA 10 piece \"Dime\" that is placed 12\" from a human eye with 20/20 vision.    No shape of a craft was observed. Spotted it all most directly overhead near the initial location above.   Initial thought it was a shooting star, but after watching it for 20 seconds I realized it was not.   My father was watching the documentary about the guy who got eaten by the grizzly bears and I called him out to observe it with me.  We watched the object for about a full minute or more together as it moved across the sky.   We thought it was a burning plane about the size of a Boeing 737, but realized it was gaining height and  there was NO aircraft wing or tail lights.  Looked more like we were looking directly at the exhaust of a rocket.   No exhaust cloud was observed.",
      "link": "http://www.nuforc.org/webreports/088/S88014.html",
      "state": "MO",
      "duration": "120 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be957",
      "summary": "4/8/12 bronze disc running over Kansas City",
      "city": "kansascity",
      "shape": "disk",
      "date": "2012-04-18T00:00:00",
      "story": "4/8/12 bronze disc running over Kansas City Golden disc.  Brighter than streetlamps on the street, had a bronze/gold reflective appearance.  Moved extremely fast, crossing an expanse of open sky faster than any airplane or military jet I've seen.  No sound whatsoever though it appeared to be flying at a height of similar approaching aircraft, just moving at incredible speed.  Very near KCI so I've been a plane observer for some time and I feel safe stating this was very different.  Also it was not following any of the 4 \"airlanes\" of aircraft approaching KCI in my area.  Not a shooting star unless it was one about to hit earth.  Not a satellite, nearer Earth than that.  Headed due North. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88262.html",
      "state": "MO",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beaa1",
      "summary": "White object stalled vehicle",
      "city": "kansascity",
      "shape": "other",
      "date": "2012-02-10T00:00:00",
      "story": "White object stalled vehicle Driving from KC to Norton, KS.  GPS did not take us I70 route so we were driving on dark roads.   Object darted across the highway in front of the car so close that the driver thought he had hit the object.   It was all white like a light.  Vehicle completely stalled and all electronics in the car shut off.   Driver checked outside and found no damage and came back in the vehicle white as a ghost.   Car and electronics came back on within minutes.",
      "link": "http://www.nuforc.org/webreports/087/S87036.html",
      "state": "KS",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7fb",
      "summary": "Traveling  at a high rate of speed orange red traveling out of the south going north",
      "city": "kansascity",
      "shape": "cross",
      "date": "2013-07-14T00:00:00",
      "story": "traveling  at a high rate of speed  orange red traveling out of the south going north",
      "link": "http://www.nuforc.org/webreports/100/S100086.html",
      "state": "KS",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb65",
      "summary": "Sweeping light soutwest to north observed central KC.",
      "city": "kansascity",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Sweeping light soutwest to north observed central KC. I was walking in a park on a high hill at more or less 11 pm.  I didn't think too much of it.  I often observe the night sky.  There was a haze due to water vapor in the sky. I saw a light beam originating from a point almost due South sweep Esst to North.  It swept about 120 degrees.  It was like those powerful lights they shine up into the clouds like at a store opening or event they want to attract people to.  BUT BUT the odd thing is it wasn't from the ground up it was from the sky downward. ((NUFORC Note:  Witness provides no contact information; indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101424.html",
      "state": "MO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ba4",
      "summary": "Red flashing orb/fireball seen near Front St. in Kansas City, Missouri.",
      "city": "kansascity",
      "shape": "fireball",
      "date": "2013-12-02T00:00:00",
      "story": "Red flashing orb/fireball seen near Front St. in Kansas City, Missouri I was driving South on 435 from Liberty to Front Street exit to meet my ex and pick up my girls and noticed a red flashing light.  At first I thought it might just be a very bright light on a radio tower but as I got closer I could see it was not attached to anything and was 3 or 4 times higher than the towers around it.  I parked the car and watched to see if it was moving. It was moving very slowly straight across the sky and then would stop and move the other way.  It flashed on and off just like the lights on top of the towers.  I watched it for 5 minutes and then decided to get closer underneath it, so I drove to the train yard it was up above. It stopped flashing and was just a dim orangish, red color, and I could barely see it against all the street lights when I got close to it a couple minutes later.  I drove back to the spot I parked at and couldn't see it anymore.  A white light had appeared in that direction and looked like a plane coming in for a landing just to the north of Front St. and right off the highway.  I'm not too familiar with the location but I know there is not an airport.  It is very industrial and has lots of trains and big warehouses around.  I don't know if it landed or not because it disappeared behind some warehouse building.  I told my ex about it on the phone but by the time he showed up it was all over.  I know others had to have seen it because the highway is right there, and I could see it coming down 35 and 435 from Liberty.  I could see it the whole 15 minutes I was driving down the busy highway.  I have seen fireballs before that were white and red and orange but none that blinked like this one and possibly landed.  There are a lot of UFOs around Kansas City and Branson area where my Grandma lives.",
      "link": "http://www.nuforc.org/webreports/104/S104699.html",
      "state": "MO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e16",
      "summary": "Bright red objects over Raytown.",
      "city": "kansascity",
      "shape": "oval",
      "date": "2013-12-02T00:00:00",
      "story": "Bright red objects over Raytown Looking north from my couch coming directly from the direction of the stadiums, I saw what first looked like a plane that may have been on fire, the light was bright red and moving about the same pace a small engine plane would move only no sound and seemed to be floating instead of actually flying.  I used my binoculars and I saw what looked like an orb with fire in the center heading due south....and just as that one disappeared in the distance another appeared following the exact same path, and looked exactly the same. I've never seen anything like it, and for the life of me can't think of anything that can fly man made that I can compare them to. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104764.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1430",
      "summary": "Red pulsing orb flying over Kansas City, MO.",
      "city": "kansascity",
      "shape": "sphere",
      "date": "2013-11-20T00:00:00",
      "story": "Red pulsing orb flying over Kansas City, MO I was walking my dog and saw what appeared at first to be a plane landing with a pulsing red light. I live in South Kansas City which is somewhat far from the airport so this caught my attention.  Aside from that, the light was pulsing from a low dim light to a bright red light with intervals of one second.  It pulsed like that the entire two minutes as it slowly moved directly over me…maybe 10,000-15,000 feet above?  It went almost in front of the half to full moon so it was very easy to see.  I’d describe it like a Jelly Fish.  The inner part of the jellyfish is where the glow was and I could clearly see an outer dome over it.  The object continued on the same trajectory and same speed over the course of the two minutes and there wasn’t a single noise associated with it.  Strangest thing I’ve ever seen.  Went from South South West to North North West",
      "link": "http://www.nuforc.org/webreports/104/S104453.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ae0",
      "summary": "Three Bright Lights moving from Left to Right in Platte County MO.",
      "city": "kansascity",
      "shape": "light",
      "date": "2014-06-20T00:00:00",
      "story": "Three Bright Lights moving from Left to Right in Platte County MO. Taking photos of the moon on Friday the 13th, 2014, to send to my wife.   I captured three objects moving from left to right only after the photos were taken did I notice them.   I cannot explain what they were but the were NOT in any particular formation.  Simply staggered high to low and not in a straight line.  I have photos to show the objects. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110195.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1bdc",
      "summary": "Yellow and white light falls to Earth, breaks to pieces/seperates and turns to all white lights",
      "city": "kansascity",
      "shape": "light",
      "date": "2014-07-26T00:00:00",
      "story": "Yellow and White Light falls to Earth, breaks to pieces/seperates and turns to all white lights I ended a phone call and went to the balcony to smoke a cigarette.  I sat down on the chair, light my smoke and looked up. I saw a yellow whitish light moving at a decline towards the earth and immediately thought UFO.  At this point, my instinct was to record with my phone, but it was in the house.  I proceeded to the door to get my phone, looked back to make sure I wasn't crazy, and saw the light.  I was fascinated, so I was in a gaze.  Moments later, the light broke into pieces and turn into a white color and fell towards the Earth light fireworks at a big display.  As the white lights fell, it disappeared. This was not a firework.  The angle it was traveling and the speed would make it impossible to be a firework.  This object fell from the sky and towards the Earth at an angle that would make it impossible to be.  Only other explanation would be a meteor falling to Earth and breaking up.",
      "link": "http://www.nuforc.org/webreports/111/S111816.html",
      "state": "MO",
      "duration": "1"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c51",
      "summary": "Neon blue and purple flying disk object over Kansas City.",
      "city": "kansascity",
      "shape": "disk",
      "date": "2014-07-11T00:00:00",
      "story": "neon blue and purple flying disk object over Kansas City it was minutes before a storm happened July 7th 2014. I was out with my dog.  I happened to look up and see the saucer shaped object.  It was neon purple and it was lined with a strip of neon blue in the middle.  It had bright neon pink lights on either side of the craft.  And it both neon lights were only singular on either side and each one flashed one at a time after the other and down on the trees. and then it hovered downwards and was gone behind the trees.   I wanted to run across the street but it was at a far enough distance that I would have never have seen it.  it probably wasn't even close but I happened to see it at my distance.  I don't think it actually landed anywhere it just went beneath the tree line where I couldn't see it anymore and disappeared.   I was flabbergasted at the fact that I was the only 1 outside at the time who could have seen it.  It literally was a bright neon purple saucer and it had blue in the middle and pink interchanging lights on the side and it literally was gone in 3 minutes flat!!   I cried a little because I was so terrified given that I've never believed in these things before and I didn't want to ever think that this kind of thing could be real, but I was also excited because it was awesome at the same time!!",
      "link": "http://www.nuforc.org/webreports/111/S111364.html",
      "state": "MO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d45",
      "summary": "I was walking my dog when I noticed a red light in the sky moving slowly from south to north around the mid-town area.  I knew it wasn'",
      "city": "kansascity",
      "shape": "light",
      "date": "2014-07-20T00:00:00",
      "story": "I was walking my dog when I noticed a red light in the sky moving slowly from south to north around the mid-town area.  I knew it wasn't a plane as it was low enough, below the clouds that I would have heard the engines.  Also, the light was not blinking.   I stopped and listened thinking it might be a helicopter, but again, no noise and no blinking lights.   As it disappeared, I shrugged it off.   A few minutes later, there were six more red lights, all traveling together slowly and quietly below the clouds, but spaced erratically and at different altitudes.  Again, they were low enough that I would have heard engine noise.   They flew in the same direction and eventually disappeared out of sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111694.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c22d8",
      "summary": "Fast moving light.",
      "city": "kansascity",
      "shape": "light",
      "date": "2014-04-04T00:00:00",
      "story": "Fast moving light. This was on a crisp night, what I mean by that is there was no clouds in the sky. I was headed north after picking up my son from daycare.  As I was coming to a stop light at the intersection I noticed out of my upper peripheral suddle movement.  Nothing side to side or eratic just moving forward at a speed like a plane would heading in the same direction. When I came to a complete stop the light was blocked by the roof of my car along with the stars.  My upper peripheral catches movement again as the light moves from out of the blockage of the roof and I look up.  At this point my eyes are locked onto this light, no more peripheral.  You can see movement out the side of your eye and it could be anything but when I locked eyes on the object I saw it was too high to make out a shape with no blinking lights of a plane but low enough to know it wasn't a star, and it was moving.  Any sound that the object might of had was block out by music. After maybe 3 seconds of looking at the light I seen it cut real hard and fast at an angle away from earth.  The best way I can describe how it took off is Star Trek warp speed.  It went out in space and the only thing that was missing was the blink of light at the end. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108182.html",
      "state": "KS",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3c265a",
      "summary": "During the lunar eclipse of April 15, 2014, I observed and photographed a blue orb about the size of the moon that entered from the eas",
      "city": "kansascity",
      "shape": "sphere",
      "date": "2014-10-10T00:00:00",
      "story": "During the lunar eclipse of April 15, 2014, I observed and photographed a blue orb about the size of the moon that entered from the east about 1 AM CT, circled around the moon with the first photo at 1:14 AM.   Successive photos that show the orb end at 2:24 AM.  My camera was duct taped to the tripod so the photos have some motion blur.  I just happened to be awake during this time and thought I'd get some photos of the eclipse. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114240.html",
      "state": "MO",
      "duration": "54 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c286c",
      "summary": "Green disk with red lights hovering over Kansas city",
      "city": "kansascity",
      "shape": "disk",
      "date": "2014-10-03T00:00:00",
      "story": "green disk with red lights hovering over Kansas city I went out to let my dog out about midnight.  She's on a leash so I had to walk and walk. And I looked out to the street about 400 feet away and saw a flashing light over the road. And it caught my eye because it was pretty.  It was a round green object, sorta disk-like hovering about the height of the street lights. It had red flashing lights. Many of them. There were several and they each flashed one after the other all around the disk. Then it went to only 2 red lights but still a green disk-like hovering object. It went many feet down the strip of the road and came back. It went up and down the road and stayed at the height of the street lamps.  This object would occasionally bob higher and lower but stayed relatively the same height.  I had no one to tell so I called my mother and she told me to get inside immediately and questioned why I had been watching it for a whole hour. I turned around to head inside and heard what sounded like a very short length tornado siren only a few seconds long. It stopped and as I jumped around to see what that was the object came my direction and then went back.  It only came my direction a few seconds before deciding to stay where it was already at.  I continued heading inside when it went the opposite direction it was originally going and toward my apartment complex leading office.  As it came this way it made a sound like a plane and helicopter engine combo. I booked it inside. It went behind the leasing office and disappeared but I could still hear that sound. My mom has seen a ufo so she advised me not to play around with them.  I reported another ufo back in July that I got no responses on.  I am curious about them, but I have enough respect/terror of them that I keep plenty distance.  I went inside on my deck to look from a safe distance and that was the end of it.",
      "link": "http://www.nuforc.org/webreports/113/S113962.html",
      "state": "MO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c2916",
      "summary": "Bright blue light (brighter than a star) slowly blinking about every 7-10 seconds, but not at regular intervals.",
      "city": "kansascity",
      "shape": "circle",
      "date": "2014-10-10T00:00:00",
      "story": "Bright blue light (brighter than a star) slowly blinking about every 7-10 seconds, but not at regular intervals. Craft moving slowly from east to west, exactly at midpoint between zenith and horizon (at 45 degrees, if zenith to horizon is a 90 degree angle).  Because of the bright moonlight, craft was still viewable when not emitting the blue light - craft was a dull darker grey.  As time passed during the incident, the intensity of the blue strobe-like light diminished before craft disappeared behind trees.  I could not clearly discern how far up it was but it seemed very high up in the atmosphere.",
      "link": "http://www.nuforc.org/webreports/114/S114265.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2ab3",
      "summary": "3 UFOs in clouds, chasing each other.  ((NUFORC Note:  Possible advertising lights?  PD))",
      "city": "kansascity",
      "shape": "disk",
      "date": "2014-11-14T00:00:00",
      "story": "3 UFOs in clouds, chasing each other. 3 UFOs I spotted from my window.  Circling quickly like they were chasing each other in perfect alignment at fast speeds in a tight circle.  They were just above the clouds but could still see the shape.  Round objects with what seemed to be a second level on top.  They then darted away and returned with the same chase pattern. Repeated this over and over and then would suddenly chase in reverse direction.  This continued for 15 minutes. I never saw them return. I do not know the color as they were covered by the clouds.  Could only decipher the shape. I know they were flying faster than a plane and no plane or helicopter could have made such tight quick turns, nor could they reverse directions so quickly. ((NUFORC Note:  Possible advertising lights?  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115198.html",
      "state": "KS",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c33b2",
      "summary": "Very loud sound from the sky as from something huge, with nothing in sight.",
      "city": "kansascity",
      "shape": "unknown",
      "date": "2015-04-03T00:00:00",
      "story": "Very loud sound from the sky as from something huge, with nothing in sight. I heard a loud sound similar to a helicopter, only either extremely close or extremely large.  There is a railroad track a few miles from here so my girlfriend and I listened closer and it was for sure NOT a train; we hear trains all the time but not usually at night.  I left my porch to look for this huge helicopter and did not see anything as the sound got louder. It was so loud at one point I'm sure I felt the vibration.  It was coming from the sky and there were no helicopters in sight.  For how loud it was I should have seen one landing.  The sound seemed to be from something really BIG.  It lasted a lot longer than something passing by.  It seemed to just get softer and not farther away. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118174.html",
      "state": "MO",
      "duration": "6-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c35c7",
      "summary": "Parkville, MO, very bright fireball landing slowly.",
      "city": "kansascity",
      "shape": "fireball",
      "date": "2015-03-13T00:00:00",
      "story": "Parkville mo, very bright fireball landing slowly. We were on a hill walking down, and we looked in the sky and at first I thought something was on fire like a small plane, but then I realized it was going way to slow.   My friend thought it was just a plane at first but not that much farther away there was a plane and trust me the very bright fireball that we saw was not any kind of plane.   It started slowly getting a little bit closer then it just starts lowering all the way to the ground like it wasn’t even there.   About 10 minutes later we saw a helicopter go by.  It was really creepy.",
      "link": "http://www.nuforc.org/webreports/117/S117756.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d68",
      "summary": "I noticed a violet or pale pink over white object hovering in the south sky just under the moon it was diamond shape on top flat bottom",
      "city": "kansascity",
      "shape": "diamond",
      "date": "2015-07-23T00:00:00",
      "story": "I noticed a violet or pale pink over white object hovering in the south sky just under the moon it was diamond shape on top flat bottom The object was moving south to west from naked eye it was about 3 inches below the moon and a little smaller than a dime.  At that time it was emitting a white light traveling in a straight line.  It then vanish for a while when I saw it again it appeared as if it was floating but it could have been traveling toward me.  It seemed as if it was twinkling it was a light violet or pale pink over white.  It floated for awhile then vanished.   I'm a retired postal worker.",
      "link": "http://www.nuforc.org/webreports/120/S120596.html",
      "state": "KS",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c41bf",
      "summary": "Bright white light appearing to move, with several blinking lights next to it.",
      "city": "kansascity",
      "shape": "unknown",
      "date": "2015-05-08T00:00:00",
      "story": "Bright white light appearing to move, with several blinking lights next to it. As I was looking outside of my window, I saw a light (brighter than a star) among the clouds.   Just as I was about to look away, I saw the light move up and left for about 15 seconds.  This light was surrounded by several other smaller lights that appeared to be stagnant, but blinking blue and white dim lights rapidly. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118835.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a06",
      "summary": "I was driving on I-70 west toward Kansas city around 730 pm on 9/19/15  when i first saw them. i just remember the sun was going down a",
      "city": "kansascity",
      "shape": "light",
      "date": "2015-09-25T00:00:00",
      "story": "I was driving on I-70 west toward Kansas Cit,y around 730 pm on 9/19/15,  when i first saw them.  i just remember the sun was going down and i was driving toward this beautiful sunset, as i watched these lights appear and they faded as the horizon changed colors and turned dark.  i actually sped up because i wanted to see what they were and it looked like one of the lights was moving to the right toward the direction i was driving to which was into downtown.  there were two bright lights that appeared circular one brighter than the other which was the one the was moving right toward where i was going.  the other two lights are harder to explain because at first i thought they were those clouds that the airplanes make but as i drove closer and watched they didnt fade but seemed to get brighter. these 2 werent circular but kind of a swish shape, was very odd. these four lights hung in the sky sort of in a square formation as the brightest circle moved toward what se! emed to be over  downtown. i then saw a PLANE !!like one of those small ones, fly between me and these lights and then fly back and back again before it dissapeared. i have never seen a plane to that in my life! i was in shock, took my phone out which is very dangerous while driving but i wanted to record this but i couldnt do it while i was driving. i was looking at every person driving beside me to see if they were seeing this but the couple people i saw didnt seem to notice this!!? wtf.  it all was very bizzare.  then the lights began to fade and by the time i reached the westside it was pretty much dark and i could only see one of the lights which then faded or i lost view of it from behind buildings.",
      "link": "http://www.nuforc.org/webreports/122/S122104.html",
      "state": "MO",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c50e5",
      "summary": "White/blue light seen southwest of Kansas City, Kansas.",
      "city": "kansascity",
      "shape": "light",
      "date": "2016-02-26T00:00:00",
      "story": "White/blue light seen southwest of Kansas City, Kansas. We were sitting in a parking lot talking when we noticed a light, it was relatively cloudy.  It started off as a dim speck, stationary, then grew about 10 brighter and started moving west at a downward angle.  Blue, white and red lights could be seen pulsing wildly.  3 sightings in the past month near the same area.",
      "link": "http://www.nuforc.org/webreports/126/S126003.html",
      "state": "KS",
      "duration": "1 hour +"
    },
    {
      "_id": "64d005f478aba2ec5a3c5821",
      "summary": "Silent vibrating disc flashes, and disappears.",
      "city": "kansascity",
      "shape": "disk",
      "date": "2016-06-24T00:00:00",
      "story": "silent vibrating disc flashes and dissappears Thursday June 23, 1;16pm – Kansas City, KS.  I was driving to a Drs apt and I was headed west on Ruby Av from 14th st. after a stop sign at 14th & Ruby. In the sky, directly west, was a shiny white disc-shaped craft floating slowly from south to north. It had no lights of any color, and it looked as though it was vibrating at times (briefly). I slowed to watch the object, and had it in my sight for about 8 to ten seconds, then I went under an overpass, and I emerged just in time to see it flash very  brightly two times and vanish.  The object made NO sound. There were several other vehicles and pedestrians in the area, even a car in about 25ft ahead of me driving with 2 passengers, but no one else seemed to be reacting as if they saw it. It wasn’t very high in the sky: lower than most planes fly.  My heart was POUNDING! – I looked for other people’s reactions, but I don’t think anyone else saw it. Great experience, though.",
      "link": "http://www.nuforc.org/webreports/128/S128046.html",
      "state": "KS",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a7d",
      "summary": "Strange lights that fly in unison blink out when observed.",
      "city": "kansascity",
      "shape": "light",
      "date": "2016-04-29T00:00:00",
      "story": "Strange lights that fly in unison blink out when observed. Early this morning, I got up and went out on my back deck to enjoy the beautiful morning weather and night sounds.  It was still dark and the sky was clear.  I sat down for about 2 minutes, then looked up at the stars.  I don't know the constellations, but I could clearly see several points of light without any obstructions.  Directly in front of me (facing northwest),  I could see a group of three stars immediately flanked by two other lights to my right.  At first, the two lights were stationary so I didn't really think about them.  But soon they both started to slowly move from their stationary position to my left.  I thought it odd that satellites would be still and then move in apparent unison.  With my right arm fully extended, I estimate they were a hand width apart.  Very high up but still very clearly visible.  I watched them move slowly in unison, then stop in unison, then resume moving in unison in the same direction.  They followed their motion f! or approximately a five count, then the lead light simply went out, while the second light continued to move in the same direction.  When the second light reached the point where the first light went out, it too went out.  No clouds, no obstructions at all.  I'm an avid UFO person so naturally I interpreted this as a possible sighting and said out loud \"why do you always blink out when I see you?  How do you know I'm looking at you?\"  I thought this might illicit some kind of response, but they didn't reappear.  I've been fooled by birds before, but these lights were too bright and way to high to be birds.  I ruled out airplanes because they went from stationary to moving and I didn't hear any jet-related sounds like normal when a high flying jet passes over.  Helicopters don't go that high, or I'm not sure why they would, and again no noise.  Perhaps some kind of experimental craft that can go stationary, then move with no noise.  Just seems odd to me.  I've seen! these lights before and always just as I notice them, they bl! ink out. This pattern of seeing them, then they disappear suggests to me whoever they are, they know I'm watching them.  It's happened too many times to be coincidental.",
      "link": "http://www.nuforc.org/webreports/126/S126995.html",
      "state": "MO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5eef",
      "summary": "Metallic sphere flew into my bedroom from the hallway and out through the bedroom wall.",
      "city": "kansascity",
      "shape": "sphere",
      "date": "2016-10-27T00:00:00",
      "story": "Metallic sphere flew into my bedroom from the hallway and out through the bedroom wall. Approximately 10 years ago I was living in Kansas City, MO.  I was sitting in my bed talking online to a friend on a laptop in front of me and had the TV running to my left. I sensed something and looked up.  A sphere that appeared to be metal and about the size of a softball was flying into my bedroom from out in the hallway (in front of me to the right).  It flew about arms length in front of me.  It did not have wings or rotors that I could see, but it flew and maneuvered as a helicopter would.  I did not hear any noise from it.  I didn’t see any windows, etc., but it must have had some type of sensors.  It turned by pivoting in its space and started to fly away toward the wall in front of me.  I thought it might have been some sort of police spybot, but I had no idea how it would have entered my house or why. I wasn’t dreaming.  I was wide awake with lights and noise from the TV and typing on the laptop and the light happened to be on in the hallway.  It was a completely physical experience, until it flew right through the wall of my bedroom. Although I was not a reporter at the time, I have been an investigative reporter for a county newspaper the past 5 years.  I have an interest in the unknown or unexplained along with ancient history where my passion has led to discovering some ancient geophysical structures that interested the Faram Research Foundation. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130786.html",
      "state": "MO",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c614d",
      "summary": "Strange sounds were heard from outside. A sound ringing pitch,and a crunching aluminum sound. Then a humming rang inside my head and I",
      "city": "kansascity",
      "shape": "unknown",
      "date": "2016-09-30T00:00:00",
      "story": "Strange sounds were heard from outside.  A sound ringing pitch, and a crunching aluminum sound.  Then a humming rang inside my head and I put my ear against the back for and could hear something outside.   My dog cowered inside her kennel (pitt bull so she's not scared of anything)  I  opened the door and all the car lights were on even though the keys were inside!  Next thing I know I shut the door and it's 2 hrs later.   Today I have a very weird bad headache.  I've experienced missing time before but I had a dream about seeing a ufo that night.  I don't remember having a dream this time.",
      "link": "http://www.nuforc.org/webreports/130/S130193.html",
      "state": "MO",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c64c9",
      "summary": "I-70/MM 90, I saw two low-flying triangular crafts.  They were massive and appeared to be flat. ((NUFORC Note:  B2 bombers.  PD))",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2016-08-25T00:00:00",
      "story": "Driving on I-70 East at mile marker 90, I saw two low-flying triangular crafts.  They were massive and appeared to be flat.  They were also VERY black.   One flew over, going west, moving very slowly, then another came shortly after, moving at the same speed. ((NUFORC Note:  Witness was asked whether the objects might have been B2 bombers.  He claims to have looked up B2 bombers on his phone, and confirmed that that was what he had seen.   We are not aware that B2 bombers fly in formation.  They usually fly individually, we believe.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129460.html",
      "state": "MO",
      "duration": "10 minutes (flyover)"
    },
    {
      "_id": "64d005f478aba2ec5a3c6547",
      "summary": "Disappearing/reappearing dot in the sky, going down.",
      "city": "kansascity",
      "shape": "circle",
      "date": "2016-08-19T00:00:00",
      "story": "disappearing/reappearing dot in the sky, going down. At around 9 o’clock PM CT, I was outside enjoying the night air with my sister and looking up at the sky. Surprisingly, we could see a lot of stars.  Even more surprisingly, I saw what I thought was a falling star.  It was circular and white. It looked like it was falling straight down, but when I followed it with my eyes for a few seconds, it disappeared - not something your average meteor does!  And then, a moment later, it reappeared, lower than before, and kept falling.  I was very excited, and pointed it out to my sister, who quickly saw it.  It was too far away (sadly too far away to film or take a picture of) and going too fast to be a plane, or anything like that. It disappeared again, and this time I counted.  It was 4 seconds, and then it would reappear for 4 more seconds, and then disappear once more.  This went on for a good 15 seconds, and then whatever it was disappeared from our view, behind some trees.",
      "link": "http://www.nuforc.org/webreports/129/S129363.html",
      "state": "MO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c66cf",
      "summary": "Falling chevron UFO fire coming from the back above my school AL last Thursday. ((NUFORC Note:  Student report.  PD))",
      "city": "kansascity",
      "shape": "chevron",
      "date": "2017-04-20T00:00:00",
      "story": "Falling chevron UFO fire coming from the back above my school AL last Thursday. I was playing tag at my school Academie Lafayette, when suddenly I heard screams and my friend said look up!  I looked up and saw the UFO.  It scared me too death.  It was falling, very fast.  It got closer and closer to the ground until it froze in mid air and I blinked.  When I opened my eyes it wasn't there.  This all happened within 15 seconds.   At its highest, it looked about the size of the sun.  Like it could block my view of it.  When it was falling it was massive.  I got pretty damn close to us.  I thought it was gonna squish us.  It was jet black.  I think it was on fire.  It smelled like burning plastic, and there was a gigantic trail of blue fire behind it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  Witness is a student.  We contacted the school, but an administrator there stated that she was not aware of any such sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133585.html",
      "state": "MO",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c686d",
      "summary": "Four Light Objects Moving Fast from East To West over Kansas City 3/17/2017 9:45 pm",
      "city": "kansascity",
      "shape": "light",
      "date": "2017-03-23T00:00:00",
      "story": "Four Light Objects Moving Fast from East To West over Kansas City 3/17/2017 9:45 pm When looking to the west of Kansas City.  Viewing stars on a clear night sky.  A fast moving light caught my eye.  Coming from the east headed west.  Appeared to turn, or bank right, and faded out of sight. Sighting lasted 2 to 3 seconds.  Bright white in color, and would estimate it to be traveling at a elevation of at least 60,000 ft. or higher. Then about 7 seconds later.  Coming from east again, headed west.  I see three bright lights moving fast.  Headed in the same direction as the first object.  Two in front were side by side, with the third following behind the front one on the right. Sighting of those three lasted for about 2 to 3 seconds.  Estimated elevation of 60,000 ft. Moving to fast to be satellite’s. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133162.html",
      "state": "KS",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c686f",
      "summary": "Four Fast Moving High Flying Light Objects Moving From East To West Above Kansas City",
      "city": "kansascity",
      "shape": "light",
      "date": "2017-03-23T00:00:00",
      "story": "Four Fast Moving High Flying Light Objects Moving From East To West Above Kansas City When looking to the west of Kansas City.  Viewing stars on a clear night sky.  A fast moving light caught my eye. coming from the east headed west.  Appeared to turn, or bank right, and faded out of sight. Sighting lasted 2 to 3 seconds. Bright white in color, and would estimate it to be traveling at a elevation of at least 60,000 ft. or higher. Then about 7 seconds later.  Coming from east again, headed west.  I see three bright lights moving fast.  Headed in the same direction as the first object.  Two in front were side by side, with the third following behind the front one on the right. Sighting of those three lasted for about 2 to 3 seconds.  Estimated elevation of 60,000 ft. Moving to fast to be satellites. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133161.html",
      "state": "KS",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c698e",
      "summary": "4 green dots.  ((anonymous report))",
      "city": "kansascity",
      "shape": "formation",
      "date": "2017-03-23T00:00:00",
      "story": "4 green dots were in a formation that suddenly appeared and went down, and then disappeared after about 3 seconds. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133261.html",
      "state": "MO",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d2e",
      "summary": "I was getting ready for bed, when the house starts vibrating,",
      "city": "kansascity",
      "shape": "",
      "date": "2016-12-15T00:00:00",
      "story": "It was the night Michael Jackson played at Arrowhead stadium, my grandmother and I had just gotten home from the drive in and I was getting ready for bed, when the house starts vibrating,   I look out the window facing south and see a large craft that was at least the size of a football field maybe bigger, trapezoid shape with 6 white/blue (?) lights on the bottom, it slowly moved over the house and was gone. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131750.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e33",
      "summary": "Triangular Lights spotted over downtown Kansas City.",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2017-07-07T00:00:00",
      "story": "Triangular Lights spotted over downtown Kansas City. I live in Kansas City, and was with a few of my friends at this monument that over looks the city when I took a picture on Snapchat.  I swiped right a couple of times to find the right filter, posted it and kind of forgot about it.  That is until I looked at the picture again later that I noticed something I hadn't seen before.   In the upper left hand corner, you can see 3 faint lights in the shape of a triangle that I am 100% positive were not stars or a plane or anything like that because we didn't even see the lights with our naked eyes.  There is proof its not just a filter or smudge or anything because you can see a plane in the upper right corner of the picture.   I decided to put the picture through a few other filters on an application on my desktop and could make out a kind of rim that was connecting the lights.  Although I'm not very proficient at photo editing.  What do you think?  I'm pretty spooked myself.  Maybe someone who is more proficient at photo editing could get a crack at it.   If you have any other questions feel free to reach out to me. ((NUFORC Note:",
      "link": "http://www.nuforc.org/webreports/134/S134896.html",
      "state": "MO",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e6d",
      "summary": "Driving along Hwy. 35 N and saw an object right above us flying in the same direction we were driving. ((NUFORC Note:  Meteor?  PD))",
      "city": "kansascity",
      "shape": "fireball",
      "date": "2017-09-05T00:00:00",
      "story": "Driving along highway 35 North and saw an object right above us flying in the same direction we were driving.  It seemed to burn out and break up into 4-5 pieces after seeing it burn for about 5 seconds.  All visual of the object was lost after the break up.  No sounds were noticed. ((NUFORC Note:  Report appears to us to be consistent with a meteor.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135931.html",
      "state": "MO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7452",
      "summary": "I was walking back to campsite from casino by kansas city race track at about 420 am i saw a green light in sky and it shot off faster",
      "city": "kansascity",
      "shape": "light",
      "date": "2017-05-15T00:00:00",
      "story": "I was walking back to campsite from casino by kansas city race track at about 420 am i saw a green light in sky and it shot off faster than a meteor and it split in two like a v shape and brightest green ive ever seen that trailed behind cause of the apeed it shot off and it was gone craziest thing ive ever seen and it was silent no sound.",
      "link": "http://www.nuforc.org/webreports/134/S134089.html",
      "state": "KS",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7747",
      "summary": "Thin cigar horizontal red pulsating light flying south over downtown Kansas City MO.",
      "city": "kansascity",
      "shape": "cigar",
      "date": "2017-12-21T00:00:00",
      "story": "Thin cigar horizontal red pulsating light flying south over downtown Kansas City MO. I was a passenger in a car traveling westbound on I-670/70 out of downtown Kansas City, MO during the evening of December 14 at approximately 10:45 PM Central Time.  My point of view was on the Kansas side looking East towards the downtown KCMO skyline. At this time I saw a horizontal cigar-shaped, thin red light at the same approximate height of the skyline.  It appeared to be either behind or almost directly over downtown.  The width of the light was approximately the same width of many of the skyscrapers. The light would pulse uniformly on and off similar to an aircraft, but there were no other colors or pinpoints of individual lights, just one solid horizontal red light. I-670 curves to the south just outside of downtown, so during this portion of the travel I could see the craft moving south with us.  It then cleared the skyline and was flying over the shorter buildings due south of downtown, confirming it was not a strip of lights at the top of one of the skyscrapers. I lost sight of it once the road curved due West and downtown was no longer in view.  I was so mesmerized by what I was looking at that it didn’t occur to try and snap a photo.",
      "link": "http://www.nuforc.org/webreports/137/S137781.html",
      "state": "KS",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7811",
      "summary": "Satellite Looking Star Stopped In Orion's Belt",
      "city": "kansascity",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "Satellite Looking Star Stopped In Orion's Belt What appeared to be a satellite travelled from the Southwest of Kansas City toward the Northeast.  I've lived at my location for 20 years, and have never seen a satellite because of the light pollution.  I watched it enter toward Orion's Belt for about a minute, then it stopped.  I observed it in a stopped posItion for around 3 minutes.  It was slightly brighter than any star, but was too high to be a conventional aircraft.  It looked like a star.  I went indoors to get a video camera, and when I went back outside 1 minute later, it was gone.  Nothing else in the sky in the direction it was travelling was moving.",
      "link": "http://www.nuforc.org/webreports/138/S138316.html",
      "state": "KS",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b82",
      "summary": "Circular light formation seen in sky.",
      "city": "kansascity",
      "shape": "circle",
      "date": "2017-10-19T00:00:00",
      "story": "Circular light formation seen in sky. My husband and Daughter and I were on our way to the movies last night in the Kansas City area as a storm was rolling in.  I took a picture of the massive storm clouds and when we looked at that picture a few minutes later, we noticed the light circle formation in the picture of the sky.",
      "link": "http://www.nuforc.org/webreports/136/S136746.html",
      "state": "MO",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c66",
      "summary": "Multi-colored object in KC, MO sky.  ((NUFORC Note:  We suspect a sighting of Venus, or Cappella.  PD))",
      "city": "kansascity",
      "shape": "light",
      "date": "2017-10-19T00:00:00",
      "story": "Multicolored object in KCMO sky. Witnessing an object identical to one I saw in 2012 that was documented on the news in Blue Springs, MO, which occured over several days.  Stationary light in the sky, what I believe to be southeastern in direction.  Looks akin to a very bright star, with flickering and pulsing of different colors.  (Red, green, blue, white.) ((NUFORC Note:  We suspect a sighting of Venus, or Cappella.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136840.html",
      "state": "MO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f6b",
      "summary": "Green orb moving fast and smoking then disappeared before it was out of sight.",
      "city": "kansascity",
      "shape": "circle",
      "date": "2018-04-26T00:00:00",
      "story": "Green orb moving fast and smoking then disappeared before it was out of sight.",
      "link": "http://www.nuforc.org/webreports/139/S139528.html",
      "state": "KS",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8026",
      "summary": "I was sleep in my bed with my dog barking which woke me up.  I realized that there was a bluish whitish rising from my floor through my",
      "city": "kansascity",
      "shape": "disk",
      "date": "2018-03-23T00:00:00",
      "story": "I was sleep in my bed with my dog barking which woke me up.  I realized that there was a bluish whitish rising from my floor through my ceiling.  It was not a continuous light but retracted through the ceiling by my door.   I grabbed my flashlight which I kept by my bed to shine it on my dog to see what she was barking at, but before I can shine the light, I can already see her green eyes which meant there was a light source, so I look up in right above the tree in the backyard was a disc ovary with lights blinking counter-clockwise about 50 ft in diameter I looked at this thing and mentally something was telling me come with us, mentally I could feel myself saying no.  After what seemed like five minutes, it turned into a bright ball of white light and zoomed straight up, and within a matter of one minute, it looks like another star.   I went and woke my sister up and told her what happened.  I grabbed my BB gun and gave her my baseball bat, and we went to go check on my dog who was okay.  I did not wake my mother up because she was a school teacher.  The side of my face just kind of hurting, so I went and looked in the mirror and there was a mark on my face like I have laid on something, and look at my pillow but there was nothing there to this day that mark is still on my face. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139121.html",
      "state": "MO",
      "duration": "~10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ffc",
      "summary": "((HOAX??)) i saw the diamond like space craft it was getting closer and closer and then it just went up and left earth.",
      "city": "kansascity",
      "shape": "diamond",
      "date": "2018-04-13T00:00:00",
      "story": "i was walking outside my house for a walk, and then i saw the diamond like space craft it was getting closer and closer and then it just went up and left earth it came back down with 3 space crafts this time and their was a flash of light it was mid day and i have no idea why they targeted me.",
      "link": "http://www.nuforc.org/webreports/139/S139385.html",
      "state": "MO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c858d",
      "summary": "2 triangle shaped UFOS spotted.",
      "city": "kansascity",
      "shape": "triangle",
      "date": "2018-08-10T00:00:00",
      "story": "2 triangle shaped UFOS spotted in kck I was returning home off and while walking to my house noticed 3 red lights, upon closer inspection I noticed they appeared to be in the corners of a dark triangle object with a white light in the center, the object was moving fairly slow and very low, but was traveling the opposite direction of the airport.  I went and grabbed my dad but by the time he came outside you couldn't make out anything besides red lights in the distance.  As I was explaining what I had saw, a second aircraft that appeared to be the same exact design, same relative altitude, followed the first craft but at a much higher rate of speed, higher than any aircraft id ever seen flying that low, I spent hours outside after that watching but no other unusual occurences.  Both aircraft made relatively no sound for the speed and size of the aircraft.  Will provide sketch and map of where I was and exact direction of crafts if requested by an investigator",
      "link": "http://www.nuforc.org/webreports/142/S142398.html",
      "state": "KS",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c86eb",
      "summary": "Hovering Lights in Kansas.  ((anonymous report))",
      "city": "kansascity",
      "shape": "light",
      "date": "2018-08-10T00:00:00",
      "story": "Hovering Lights in Kansas. Hovering lights above Kansas City, Kansas for over 2 hours.  No explanation. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142560.html",
      "state": "KS",
      "duration": "Ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c89ad",
      "summary": "40 miles E of Kansas City, MO, Heading E on highway 70  Saw an “orb” like figure 2 or 3 miles away in a pasture.",
      "city": "kansascity",
      "shape": "circle",
      "date": "2019-09-19T00:00:00",
      "story": "10:20 pm 40 miles east of Kansas City, MO.  Heading east on highway 70.  Saw an “orb” like figure 2 or 3 miles away in a pasture, GROUND level, got brighter & brighter & brighter. Then the whole sky flashed like a strobe light, showing every single color on the spectrum, and then it disappeared.",
      "link": "http://www.nuforc.org/webreports/148/S148810.html",
      "state": "MO",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8dd7",
      "summary": "Looked like star trek warp engine double trail.  ((anonymous reports))",
      "city": "kansascity",
      "shape": "other",
      "date": "2019-01-04T00:00:00",
      "story": "Looked like star trek warp engine double trail. Just finished work and got home petting the dog around 4:45 am last Wednesday morning when I looked up west just south of downtown Kansas City and it looked like the back to the future tire streak so it was two things very fast like warp drive initiation mixed with back to the future but it was not fire and it was not a shooting star, very strange.",
      "link": "http://www.nuforc.org/webreports/144/S144143.html",
      "state": "MO",
      "duration": "0:03"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f83",
      "summary": "((NUFORC Note:  Witness provides no description of the object(s).  We have requested a more detailed report.  PD))",
      "city": "kansascity",
      "shape": "",
      "date": "2018-11-24T00:00:00",
      "story": "((NUFORC Note:  Witness provides no description of the object(s).  We have requested a more detailed report.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143724.html",
      "state": "MO",
      "duration": "33 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c940b",
      "summary": "Stationary light streaks across the sky at the speed of a shooting star after being stationary. 1 second stationary 1 second moving out",
      "city": "kansascity",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "Stationary light streaks across the sky at the speed of a shooting star after being stationary. 1 second stationary 1 second moving out I just had left work, was on my way home, and was randomly looking up at the stars. I had noted various stars and also some relatively slow moving airplanes off in the distance identified by their lights creeping very slowly across the sky and blinking as they do. All of the sudden I noticed a brighter than the rest light that appeared as a dot like a star but larger and brighter and completely stationary/not moving. As soon as I looked at it literally 1 second after I locked eyes onto whatever it was it streaked across the sky out of sight off into the horizon at what seemed like the speed of a shooting star. I was shook at what I had just witnessed all in 2 seconds. I kept telling myself it has to of been a shooting star but then how would it be possible for it to be stationary as it was when I had first made eye contact with it. I cannot explain what I had witnessed with a sober mind and absolutely history of seeing things that aren’t there. What I have j! ust seen defies any reasonable explanation. Whatever I witnessed could be clearly differentiated from anything known.",
      "link": "http://www.nuforc.org/webreports/150/S150486.html",
      "state": "KS",
      "duration": "3 seconds"
    }
  ]
}