{
  "city": "knoxville",
  "fetch_timestamp": "2025-07-12T14:36:50.772347",
  "record_count": 114,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b41aa",
      "summary": "Saw one large ship during the day around noon hovering over the trees, it look like Battlestar Galactica but it was grayish with multic",
      "city": "knoxville",
      "shape": "rectangle",
      "date": "2006-05-15T00:00:00",
      "story": "Saw one large ship during the day around noon hovering over the trees, it look like Battlestar Galactica but it was grayish with multicolored lights all over it.  The whole week at night in the skies over Oakridge and Cumberland Gap counted at least forty ships.  See at min at least ten every night in Knoxville area.  Some come down to about 30,000 feet and are very large craft bigger than a 747.  I was an aircraft controller and saw many craft while in the military 1971-1974 on radar in Germany and was told to ignore them. They were very high speed aircraft that could cover the 250 mile distance on my scope in less than a blink of an eye. We have nothing that fast.  Something is definitely going on in Knoxville area and should be investigated with cameras. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49786.html",
      "state": "TN",
      "duration": "week"
    },
    {
      "_id": "64d005f478aba2ec5a3b4563",
      "summary": "Green and orange lit cylinder flashed across the sky while outside at work.",
      "city": "knoxville",
      "shape": "cylinder",
      "date": "2006-05-15T00:00:00",
      "story": "Green and orange lit cylinder flashed across the sky while outside at work. I was at work on a break outside talking with a coworker the sky was clear and there was nothing unusual about it.  We were just talking when suddenly out of nowhere this huge cylinder shaped light appeared in the sky it was huge considering how far away it was and it moved across the sky diagonally southwest (FAST) then just as quickly as it appeared it was gone.  The front of it was green and then it tapered into orange, there was much more orange than green.  It wasn't a green object with an orange tail because the whole thing moved together as one object.  There was no noise.  The way it appeared it reminded me of shooting a bottle rocket.  Only it was huge.  And going down not up.  And it never exploded like a bottle rocket.  We both were silent for a few minutes and then we looked at each other.  I asked what that was, she said she didn't know.  I asked if she thought it was a plane.  She said no.  I said maybe fireworks.  She said no.  Then she said sort of quietly do you think it was a ufo?  I said no one would believe us.  We quickly put out our cigarettes and went back in.",
      "link": "http://www.nuforc.org/webreports/050/S50227.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b46cb",
      "summary": "Me and my sister saw a strange light rise up from the horizon, move like I have never seen any aircraft move, all while making no noise",
      "city": "knoxville",
      "shape": "circle",
      "date": "2019-08-23T00:00:00",
      "story": "Me and my sister saw a strange light rise up from the horizon, move like I have never seen any aircraft move, all while making no noise Me and my sister were walking our dogs around 9-10 o’clock at night when we saw some sort of circular light rise up incredibly fast from the horizon.  It looked like a circular white light with a smaller red light towards the top of it.  It seemed to have a slight disc shape, but due to distance and my glasses lenses, it was hard to tell if it was a glare from my glasses or simply a blur from the distance.  It made no noise. it stopped in place for a few moments before beginning to accelerate incredibly quickly and make super smooth and quick turns.   It was hard to tell the speed of the object, since it was so far away, but it did go significantly faster than any aircraft I have ever seen before and it was silent.  It continued in that pattern, occasionally stopping in place.  Eventually, it disappeared behind some trees and emerged a few minutes later, but this time it was blinking like a plane would, but it continued the irregular movements from before.  It disappeared again behind the same trees and then soon emerged again, now it wasn’t blinking but was a solid light like before, but we saw it change to start to blink again.   It then drifted back down to the same general area it initially rose up from, and me nor my sister saw it again.",
      "link": "http://www.nuforc.org/webreports/148/S148074.html",
      "state": "TN",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4752",
      "summary": "Triangular shaped object in sky",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2019-08-23T00:00:00",
      "story": "Triangular shaped object in sky The object was orange brown color.  It was hovering in the sky looking west.  First, I only saw the tip of what appeared to be the top of the object, then the full body became visible.  It was triangular is shape and disappeared with in 20/30 seconds after becoming fully visible.  There was no sound.  It was very large in size.",
      "link": "http://www.nuforc.org/webreports/148/S148115.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a0f",
      "summary": "Bright orange oddly shaped object sighted near Knoxville, TN.",
      "city": "knoxville",
      "shape": "other",
      "date": "2019-07-25T00:00:00",
      "story": "Bright orange oddly shaped object sighted near Knoxville, TN. At approximately 11:35 p.m. on the night of July 19th, 2019 I observed an oddly shaped orange light in the sky above northern Knox County, Tennessee.  The object was substantially brighter than the surrounding stars, and was approximately 30° over the horizon.  The object held a stationary position for around five minutes before something behind me caught my attention.  I looked back immediately to find it had disappeared. Judging from the direction and height of the object it may have appeared overhead in or around Northern Tennessee.",
      "link": "http://www.nuforc.org/webreports/147/S147686.html",
      "state": "TN",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f5b",
      "summary": "Bright orange lights seen by a family of 4 in rural Knoxville, Illinois.",
      "city": "knoxville",
      "shape": "light",
      "date": "2019-04-18T00:00:00",
      "story": "Bright orange lights seen by a family of 4 in rural Knoxville, Illinois. On the evening of April 16, 2019, at approximately 9:30pm CST, I was driving my van south on Knox Station Rd in rural Knoxville, IL, when I noticed what I originally thought were fireworks in the sky.  These lights appeared to be very high in the sky, possibly ½ mile in altitude.  I asked my husband his opinion of what they were.  Both of my children, 15 and 11 were also in the vehicle.  We pulled over on the side of the road, where both of my children exited the vehicle to begin recording the strange phenomenon.  My husband also began recording the lights in the sky from inside the vehicle.  There were two large orange lights that would leap in equal intervals from one and other.  Each would leave a tail of smaller orange dots and then disappear for approximately ½ of a second before reappearing and leaping west again.  The lights would make a rapid movement and then stop.  At one point both of the larger lights collided and went dark.  Again within a split second the! lights reappeared with the tails of smaller lights and began moving westward again.  As we proceeded South on Knox Station Road, the lights never appeared to become closer.  They were very bright and were very apparent in the night sky even with a cell phone tower below them and a ¾ moon.  At approximately 9:38 pm CST, the lights vanished from the sky.",
      "link": "http://www.nuforc.org/webreports/145/S145695.html",
      "state": "IL",
      "duration": "08:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f7a",
      "summary": "I saw this large green object streaking across the sky.  ((anonymous report))",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2019-04-12T00:00:00",
      "story": "I was traveling on Pellissippi Parkway with about a mile to go before taking the I-40 junction when I saw this large green object streaking across the sky.  The object appeared to have a tail like a comet.  Significantly larger than a meteorite. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145601.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5007",
      "summary": "At 07:53 hrs., I was outside in Knoxville, TN, and saw a green fireball pass overhead.",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2019-03-29T00:00:00",
      "story": "At 07:53hrs I was outside in Knoxville, TN, and saw a green fireball pass overhead.",
      "link": "http://www.nuforc.org/webreports/145/S145399.html",
      "state": "TN",
      "duration": "7-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5154",
      "summary": "300 ft Flying wing followed by fighters, later observed by glowing ball.",
      "city": "knoxville",
      "shape": "chevron",
      "date": "2006-10-30T00:00:00",
      "story": "300 ft Flying wing followed by fighters, later observed by glowing ball. Observed large craft at altitude of perhaps 1000 feet directly overhead.  Shaped like flying wing.  3 Lights, one on nose, one each wingtip.  Wingspan was 250-300 feet.  Speed was 20-30kts.  Followed in car for a couple minutes before getting out of car and getting up to second story of apartment complex. It was not a KC-135!  Object crossed over I-40 from N-S before heading West and out of sight at a moderate speed.  Within 10 minutes 2 fighters entered area low (3-4000ft) and at high speed from different directions and departed to the West with afterburner.  Total time observing was over 15 min.  Less than two hours later an object which seemed spherical was observed traveling S-N cycling between green and red.  It came to a stop and gained intensity staying red before departing to the East at high speed.  Total time was approx 4min. ((NUFORC Note:  Witness elects to remain semi- anonymous;  provides only e-address.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52008.html",
      "state": "TN",
      "duration": "20min"
    },
    {
      "_id": "64d005f478aba2ec5a3b51f6",
      "summary": "Two disc shaped objects flying in tandem",
      "city": "knoxville",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "Two disc shaped objects flying in tandem  This is the first time I have officially reported a sighting.  It was in the fall; as best I remember it was 1976 or possibly 1977.  I won't go into the details of how I arrived at that date - I do not actually remember the exact date.  I had gone to my parent's home to pick up my son - he rode the school bus and stayed at their house until I got off from work.  They needed a few items from the grocery store (about a mile and a half from their house) and I volunteered to go get them.  My son was with me.  As we drove down the road, I saw two  ojects in the sky.  They were flying at tree-top level. They made no sound. They were silvery in color.  The looked like two saucers laid rim to rim.  They had red, white and green lights. The white lights were around the middle - windows were also visible around the middle.  I stopped the car - flashed my headlights - and watched them. Nothing happened.  I continued on my way to the store.  I asked the cashier at the store if she saw the UFO's and she looked at me as if I had two heads (or no brain) and has yet to answer,  I decided at that time not to pursue it any further. I could see no movement inside the closest craft; although it seemed as if I could see in the windows.  The next day an article was in the Knoxville News-Sentinel relating a similar sighting in a nearby county by two police officers.  They described the lights as patriotic - red, white and blue.  I did tell my parents of the sighting. My mother scoffed.  My father stated he saw them all the time in the back yard in the evening when he was feeding the animals.  A few years ago, I remembered that after I flashed my headlights (which I had to turn on to do so), and continued down the road that I had to turn on my headlights as it was now getting dark.  I don't know if any time was lost - my parents didn't say anything about being gone a great length of time.  They are both now deceased so it will be impossible to get that input.  My son says he still remembers the UFO's - he was about 8 years old at the time - he will be 39 this August. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63244.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b520d",
      "summary": "light following a grid",
      "city": "knoxville",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "light following a grid I was about eight years old, we lived in Maynardville at the time. We came to Knoxville to get groceries. I spotted the white light high over the TN/VA sky, or so it seems. At first glance it looked like a dancing star, it looked as if it was on a grid. I mean ninety degree angles without slowing down or speeding up. My mother also saw it. I am convinced if such technology existed as it seems beyond what we have seen so far, including stealth. We would be utilizing it by now. It covered hundreds of miles in split seconds. I am 36 now and nothing so far comes close. I know what I saw, just don't know what it was.",
      "link": "http://www.nuforc.org/webreports/062/S62825.html",
      "state": "TN",
      "duration": "15 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b5920",
      "summary": "Disc-shaped object spotted seen about 15:00 hrs. for a duration of about 4 minutes.",
      "city": "knoxville",
      "shape": "disk",
      "date": "2007-11-28T00:00:00",
      "story": "Disc-shaped object spotted seen about 15:00 hrs. for a duration of about 4 minutes. It was a beautiful day as I went to pick up my mail at the mailbox which is at the end of a rather steep driveway. When I was walking back up the drive, I turned to take in a deep blue sky with large cumulus clouds. That is when I saw a large disk-like object sitting next to a big cloud in the southeast at approximately a 35 degree angle. It looked a little shiny because it was probably reflecting the sun from the SW. I would estimate that it was about the size of a large, commercial plane. It did not move for about two minutes, but then moved very slowly to my left and stopped. When it started to move to my right, there was a bright flash of red light from the bottom of the craft. It continued to move slowly to the south until it disappeared from my view because of some trees.",
      "link": "http://www.nuforc.org/webreports/060/S60027.html",
      "state": "TN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b646d",
      "summary": "Large object moving slowly without sound, close to ground, small light on front and flashing light at rear",
      "city": "knoxville",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "Large object moving slowly without sound, close to ground, small light on front and flashing light at rear Stepped outside of our house and noticed a large mass a little SW of us in the night sky.  We couldn't make out the shape, but it had a small red light in the front and a flashing white light in the back.  It was moving NE at a very slow speed, and had no sound. It seemed very close to us, and very large.  Our first guess was blimp, which would explain the size and lack of sound, however we couldn't find any reports of blimps in the area and there were no sporting events.",
      "link": "http://www.nuforc.org/webreports/054/S54839.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6659",
      "summary": "Ball of Light over Knoxville,TN Fell from the Sky!",
      "city": "knoxville",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "Ball of Light over Knoxville,TN Fell from the Sky! A ball of light fell from the sky over Knoxville,TN on 10/29/07 at around 10:11pm. This object fell in between 2 aircraft that were traveling in opposite directions, it fell at a high rate of speed. This object did not have a tail like a shooting star. I am sure that the pilots of the 2 aircraft must have seen this object!  A for the description of the observer. I was just getting home from work and as I got out of my car I just happened to look up and catch a glimpse of this thing. I have never reported a ufo before....",
      "link": "http://www.nuforc.org/webreports/059/S59518.html",
      "state": "TN",
      "duration": "5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d47",
      "summary": "Silent white light expands and blinks out over head at night.",
      "city": "knoxville",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "Silent white light expands and blinks out over head at night. I was in the yard, with my dogs, watching two stars on my left (i was facing south) when a neighbor came up the alley walking his dogs, as he left and my dogs calmed down, I resumed looking at the two faint stars (no stars were very bright) when almost directly overhead, a white star ? appeared.  It grew, large.  To put it in scale, if all the other stars were pencil lead points, this grew, within seconds, to the comparable size of a quarter.  It was silent, and seemingly as far away as the other stars.  When it expanded to it's fullest it blinked out.  It didn't shrink back, or splinter into sparks, it just ceased to be.  I've watched the sky since and haven't seen even a star in that spot.  There appeared just faintly around the edge of the light, a blue haze, very faint and very thin.",
      "link": "http://www.nuforc.org/webreports/052/S52527.html",
      "state": "TN",
      "duration": "minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c4d",
      "summary": "Large blue fireball reported in Knoxville, TN over Tuesday night, Nov. 28th sky.",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2006-12-07T00:00:00",
      "story": "Large blue fireball reported in Knoxville, TN over Tuesday night, Nov. 28th sky. The object appeared over the western horizon moving toward the east.   It was a huge fireball, blue in color.   It was unlike any \"shooting stars\" I have ever seen, which are usually white in color and appear but for a second.   This went all the way across the sky, breaking up into two or three pieces as it reached the eastern sky. It reminded me of the way the space shuttle looked when it broke up upon re-entry. It was the size of the blue fireball that impressed me most.   Something got very deep in our atmosphere, obviously. We had just come out of a restaurant.   My wife and I were meeting with another minister friend for dinner.   He saw it first and said, \"Look at that.\"   It was almost frightening because it lasted so many seconds, and it seemed so close.",
      "link": "http://www.nuforc.org/webreports/053/S53710.html",
      "state": "TN",
      "duration": "Ten seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c85",
      "summary": "Several bright lights in a row over Knoxville, TN",
      "city": "knoxville",
      "shape": "light",
      "date": "2006-12-07T00:00:00",
      "story": "Several bright lights in a row over Knoxville, TN Possible UFO sighting in Knoxville, TN  It was seen approximately 22:45 on Tuesday November 28, 2006.  My wife and I were taking a walk in the World’s Fair Park in downtown Knoxville.  I looked up and noticed several (about 8 or 10 all in a row) bluish-green lights, circular in shape and very bright, just over the clouds.  I thought they were fireworks or a bomb at first but the lights never faded.  They were 1,000 to 2,000 feet high in a partly-cloudy sky.  I saw them for about 12 seconds.  The light in front was the largest.  It appeared the size of a half-moon; the lights following behind it were just a bit smaller.  The lights were almost directly above us. They started in the west and were headed east to south-east at about 60-100 mph.  It was an amazing spectacle and very pretty.   After it had passed, I noticed one of the TN Air National Guard refueling planes following behind.  I noticed the plane about 30 seconds after the UFO's.",
      "link": "http://www.nuforc.org/webreports/053/S53730.html",
      "state": "TN",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7cdd",
      "summary": "Five bright blue lights in formation streak across sky without making a sound",
      "city": "knoxville",
      "shape": "light",
      "date": "2006-12-14T00:00:00",
      "story": "Five bright blue lights in formation streak across sky without making a sound I was taking my one year old daughter down to the end of our driveway to pick up our empty trash can, when I noticed a seeming change in the darkness around us, as though something was lighting up the night.  There are two houses being built beside us, so I thought that maybe a car or someone at one of the houses had turned on very bright lights.   As I was quickly processing this info, I happened to look up and saw five very bright blue lights absolutely zoom across the night sky, in single file formation, without making a sound.  When I noticed the lights, they were almost directly overhead, perhaps a few thousand feet in the air, and they disappeared after only a few seconds, as they vanished into the distance.   I could not tell whether they simply flew out of view, or actually turned off, but they had obviously been visible before I noticed them overhead, as their light was so bright that, in the few seconds before I looked up, I had felt their light all the way down to ground level.  At the same time, a neighbor across the street was out on her porch, calling her dogs in, and after they disappeared from view, I asked her if she had seen the same thing I had just witnessed.  She said that she had.  I asked her what she thought it was, and she had no idea.   About 1 minute after the lights disappeared, a very distant boom could be heard, almost like a sonic boom from miles and miles away, but without any visible signs.  About 5 minutes later, another boom was heard, again without any visual cues to what was going on, and then nothing more happened the rest of the night.",
      "link": "http://www.nuforc.org/webreports/053/S53929.html",
      "state": "TN",
      "duration": "5 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c43",
      "summary": "White lights over Knoxville TN",
      "city": "knoxville",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "White lights over Knoxville TN It was around 11:30 pm.   My husband was outside on our front porch when he saw them.  He came in and got me to come out and look.  There were white lights that would just appear and look like stars off in the distance in the sky.  They would sit still for a second and then zig zag around and disappear.  Sometimes it was one at a time and sometimes there were 2 at a time.  Once it started out as one light and when it took off, it separated in to 2 separate lights.  They don’t leave any kind of trail behind them.  They don’t make straight lines either.  They either zig zig or circle around. My husband has seen them once before, but I don’t remember the date or time.",
      "link": "http://www.nuforc.org/webreports/065/S65584.html",
      "state": "TN",
      "duration": "10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b8d8c",
      "summary": "Two Triangles in the sky, one over the top of the other.",
      "city": "knoxville",
      "shape": "",
      "date": "2009-12-12T00:00:00",
      "story": "Two Triangles in the sky, one over the top of the other. I was driving down HWY150 on 10/21/09 west of Knoxville, Illinois, at 8:45pm.  To my right I noticed a set of lights. At first I thought it was a plane with alot of lights. Then I noticed the lights seperating.It looked like a plane ontop of a plane. Then I noticed that both objects were triangel. One had three white lights in front,a red light in back. The other on had two red lights and one big flashing light in the front with a red flashing light in the back.  The one that was on top and seperated from the bottom one took off to the left so fast it was gone in a blink. I pulled off the road to watch the other one still in sight it was standing still. Then in a matter of 30sec it was clear to the south headed toward a town called Abingdon, Illinois.  I dont beleive in UFOs,bur what I saw didnt look like planes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72963.html",
      "state": "IL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9155",
      "summary": "I looked up to see  teardrop shaped light , back dropped by a mountain, as it shot towards the ground at a 45 degree angle.",
      "city": "knoxville",
      "shape": "teardrop",
      "date": "2009-01-10T00:00:00",
      "story": "I looked up to see  teardrop shaped light , back dropped by a mountain, as it shot towards the ground at a 45 degree angle. I live in a rural neighborhood in central Maryland at an elevation of about 500 ft..  The Blue Ridge Mountains are about 1 ½ mile west and the South Mountains are about ¼ mile east.  The Potomac River is about 1 mile south.  I am a 58 year retired social worker with a masters degree.  This is my first report of an unidentified object seen in the sky. On 11-25-08 at about 7:15 p.m., I was shutting my backyard gate in the dark, facing west towards Elk Ridge (in the Blue Ridge Mts., about 1400 ft. elevation) which runs roughly southwest to northeast.    As I looked up, I saw a lighted object rapidly descending at about a 45 degree angle below the ridge line at a very rapid rate of speed.  I only saw it for about three seconds before it dropped behind the roof line of a neighbor’s house.  The object’s speed was much faster than planes, helicopters, or fireworks that are occasionally seen in the area.  My estimation is that the lighted object was in the valley, about ½ to 1 mile from my house. The lighted object was oblong in shape, wider at the end headed downward, like an elongated teardrop.  In relation to how the moon appears in our sky, the length was about the diameter of the moon, with a tail of more diffused light extending further out.  The width was about a third of the moon’s diameter.  The color reminded me of a Halloween glow-stick, so it had a florescent look.  The only sound I noted was that of distant barking dogs, off to the northeast towards the ridge. I have never seen anything like this before.  The lighted object was seen with the mountain range as a back drop.   I am frequently outside, day and night, caring for horses and have a familiarity with the sights and sounds of the area.  This was certainly out of the ordinary and I have no idea what I saw.",
      "link": "http://www.nuforc.org/webreports/067/S67256.html",
      "state": "MD",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9554",
      "summary": "My husband and I were just walking in our neighborhood and saw something we can not explain.",
      "city": "knoxville",
      "shape": "diamond",
      "date": "2009-12-12T00:00:00",
      "story": "My husband and I were just walking in our neighborhood and saw something we can not explain. I am posting this because neither of us can think of who you call and there have to be other people who saw this. It was over our neighborhood near a large shopping area, but our neighborhood is still darker at night which we guess is why we could see the object. It was black-ish with what looked like moving/flipping panels that would catch the light as it moved or reflected some light we could not see. When he first saw it he thought it was birds, but there was no bird sound and then we both realized how large it was. And that it was diamond shaped. Plus it was blocking out the sky as it moved. As it moved away I could hear a hush noise, like snow flakes or a low white noise sound. He did not pick that up, but we both know my ears are more sensitive and he is getting over a cold. Also as it moved away it turned into a triangular shape and we could really see the tile-like things flipping. The object was moving overhead toward the downtown of the city we live outside of, so a straight line following a major interstate seemed to be its path or to pass over the interstate at some point. East-Northeast(emphasis on East). It left behind a massive white trail similar to what planes can leave behind but huge. My husband wants me to add that it was not like an exhaust trail, but more like displacement? No other way to explain how it looked or felt but displacement. Also as it was moving it passed in front of a plane that was much higher up and the object totally blocked the light out of the plane. I always carry a strong flash light when we walk at night and it did not even reflect off of this object. Either it was much higher up, which means it was even larger than we think, or it was non-reflective. We watched it from tonight 7:07 pm until 7:09 when it moved out of our field of vision. It became a straight line like this but massively thick ______. It seemed as though one of the diamond's points flattened to make the triangle and then the the front point of the triangle flattened to make a wide line. If you have ever seen ticker tape or confetti that was how the tile thing looked when they were moving. Birds do not have exhaust and that trail was not there until the object went by. No air craft we know of is that quiet, I am a Military Brat and have grown up around planes so I know their sounds. It can't have been a Stealth because we would have felt that and it would have to have been really low to block the sky in the way it did. No way we could not have felt it were a low flying Stealth! Also we realized after we saw the trail that in fact there were two other trails spaced evenly and parallel to the one this craft made.",
      "link": "http://www.nuforc.org/webreports/073/S73301.html",
      "state": "TN",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b9580",
      "summary": "Orangish, white \"stars\" or \"planets\" in Orion's Belt, then moved and flew off",
      "city": "knoxville",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Orangish, white \"stars\" or \"planets\" in Orion's Belt, then moved and flew off Orangish, white light. Like a star or planet. But, brightest light in sky. Just after dusk eastern time USA. 9/22/08. No blinking lights. Apparently not an aircraft. Not moving in straight line nor had speed as a sun-reflected orbiting craft would have looked like. Length of viewing: 30 seconds. In east, northeastern sky. In Orion’s Belt halfway in gap between lower two stars and top star. Then moved down and to the left (a 3-10 degrees), hovered, and moved away until light faded away. Then, a few days later., I saw the same thing in the same place. In Orion’s Belt halfway in gap between lower two stars and top star. Only this time it was two star-sized lights. Stayed precisely same distance from each other as they moved down, to the left, and faded away (appeared to be moving away from me). Length of viewing: 2 minutes. Noticed low-flying aircraft in that direction (a couple of small private planes) and maybe a commercial jetliner flight), but slower than the objects and didn't seem to be associated with the lights. Looked at a NASA website to see if ISS or other orbiting craft were above my location, but didn’t come up with anything.",
      "link": "http://www.nuforc.org/webreports/065/S65957.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9956",
      "summary": "Egg shaped Bright Light in the sky , it appeared to glow bright white but the photos taken only showed it to be red and turned to blue",
      "city": "knoxville",
      "shape": "egg",
      "date": "2009-03-19T00:00:00",
      "story": "Egg shaped Bright Light in the sky , it appeared to glow bright white but the photos taken only showed it to be red and turned to blue On Monday evening 18:10 pm I walked outside of Baptist West Hospital ER to have a quick smoke (my wife was in the ER nothing to serious) anyway I lit up and turned around and looked up for what ever reason and at first I thought it was a star then I thought it might be the comet that was viewable that night. But,I realized I was staring dead straight into the Southern Sky. There were a few stars off to the left & then I started looking for possible planes in the sky for a reference (since we are only a couple miles form the McGhee Tyson Airport & Air National Guard Post. Their were a couple planes off to the East very high ~ So this was a very , very clear night. Now the light I saw hadn't moved but say 1000 yards from where I saw it and It was Glowing Bright White light ~ NO FLASHING NO COLORS what so ever ~ it seemed to move only in left to right and right left a couple of times in very short distances ~ I watched it for about 10 minutes and then realized what I was seeing ~ I took out my phone which has a camera and clicked 4 quick photos ~ and to my amazement two of the photos showed the light as red and one of them showed blue and one showed nothing like it wasn't there ~ About this time 2 EMT'S came out of the E.R. heading to the Ambulance and I yelled at them and asked if they could see that light in the sky ~ They were both like \"WOW\" what is that? Now this thing was about 2000 ft. to 3000 ft. in the air ~ I have done skydiving before and have a pretty good idea about heights , it is a guess but pretty close none the less.Neither of them had any idea what it was & they both stated that they had seen numerous Helicopters at night for pickup at accidents & at crime scenes with Police Helicopters & they both were like \"That's Chopper\" I continued to watch the light still only white to my eyes & theirs. It was so bright it almost hurt to look at it to long I watched for about 10 more minutes then \"poof\" it was gone. Nothing , it never came back and I couldn't find it anywhere in the s! ky I wen t up to the 3rd floor observatory and scanned the entire sky for 15 minutes and saw nothing except a couple small jets going in for landing at McGhee Tyson.Now I live here and we see all kinds of Military Helicopters and C130's also refueling Cargo Planes and lotsa local air traffic dailey. I'm positive that this was nothing of the sort ~ It was no Comet or Meteor ~ it wasn't a weather balloon or \"Flares\" THIS THING WAS THERE WE SAW IT! Thanks for your time.",
      "link": "http://www.nuforc.org/webreports/068/S68938.html",
      "state": "TN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b78",
      "summary": "Unusual diamond light pattern on a triangular object flying silent in Knoxville, TN.",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2010-06-23T00:00:00",
      "story": "Unusual diamond light pattern on a triangular object flying silent in Knoxville, TN. 3 teenage girls witnessed an object in the sky flying west to east.  It was triangular in shape, low flying, and silent.  The object had a diamond pattern of lights in the middle of the object, with a bright flashing light in the center of the diamond light pattern; each point of the triangle also had a light 2 red and 1 white.   They are certain it was not an airplane it had no wings and made no noise.",
      "link": "http://www.nuforc.org/webreports/075/S75806.html",
      "state": "TN",
      "duration": "a few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d50",
      "summary": "We saw a circular-shaped UFO flying over the river and mountain.  ((NUFORC Note:  Student report.  PD))",
      "city": "knoxville",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "We saw a circular-shaped UFO flying over the river and mountain. My cousin and I were sitting in his dad's truck when I looked over outside the passenger window and saw circular-like object flying over the Potomac River and mountain. This is off-topic but I would like to be talked to by an investigator albeit by e-mail only. ((NUFORC Note:  Student report.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68851.html",
      "state": "MD",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d93",
      "summary": "I just witnessed a large static formation or 1 very large craft over Fountain City. It moved fairly slow and made a low steady rumble a",
      "city": "knoxville",
      "shape": "unknown",
      "date": "2010-05-12T00:00:00",
      "story": "I just witnessed a large static formation or 1 very large craft over Fountain City.  It moved fairly slow and made a low steady rumble as it passed over West to East until it appeared to be East of Fountain City and turned North.",
      "link": "http://www.nuforc.org/webreports/075/S75277.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f28",
      "summary": "Five white lights int he sky, like stars or planets, move around one another and then move quickly over the tree line and out of sight.",
      "city": "knoxville",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "Five white lights int he sky, like stars or planets, move around one another and then move quickly over the tree line and out of sight. I was walking to my car and noticed the sky was packed with visible stars. It was something that is not a common sight in the city.  As I was taking in the sky I noticed, what looked like, 5 stars that were brighter than the others. They looked to be as bright as planets in the sky. I don't know much about astronomy but I do know that there aren't that many planets to be seen that well, not to mention these \"stars\" were very close to one another.   After a couple minutes of trying to figure out what they could be they began to move.  They had been fixed in the sky and now were moving towards one another.  They were in very close proximity and moving all around each other.  The best way to describe them is to compare them to gnats or moths flying around a light source only a lot slower.  When they first started moving I thought maybe they were lights from helicopters but I don't think helicopters fly that close to one another and not in those kinds of patterns.  After 30 seconds or so of being confused by what I was watching they moved, in unison and fairly quickly, over the tree-line and I could no longer see them.  These objects never made a noise that I could hear.  I am generally a skeptic when it comes to UFOs but I am really perplexed by what I saw. I have been searching the web since, trying to find a similar sighting.",
      "link": "http://www.nuforc.org/webreports/069/S69316.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba361",
      "summary": "bright white light in sky moving slowly to southeast.",
      "city": "knoxville",
      "shape": "circle",
      "date": "2009-06-09T00:00:00",
      "story": "bright white light in sky moving slowly to southeast. Very bright light went across dark sky. It moved in a straight line from northwest to southeast.  It appeared to be pulsating from right to left. It got really bright then got small and turned orange then disappeared off in the distance.  No noise and appeared to be 20k to 30k in elevation.",
      "link": "http://www.nuforc.org/webreports/070/S70245.html",
      "state": "TN",
      "duration": "3 minitues"
    },
    {
      "_id": "64d005f478aba2ec5a3ba490",
      "summary": "Large white object in sky moving much faster than jet observed in eastern sky.",
      "city": "knoxville",
      "shape": "cylinder",
      "date": "2009-03-19T00:00:00",
      "story": "Large white object in sky moving much faster than jet observed in eastern sky. It was still really light outside with the sun shining and the moon also out.  I noticed the moon up in the sky and noticed a jet really high up, a white jet, leaving a chemtrail, sort of to the right of the moon when I noticed a really weird object moving perpendicular to the line of the jet.  It was much higher in the sky than the jet and it was moving much faster than the jet.  It was either two objects moving at tandem or it was one object with some sort of \"color\" in the middle of the object making it seem like two objects.  This object was very white. It seemed much whiter than the jet and this object was moving so much faster than the jet it was unreal.  I stood and watched it for approximately 15 seconda when I came back into the house since I had no way of filming it.  I could not see any wings or tail on it. It seems to me that if it had been a jet that the darker area between the two objects or the dark area in the middle of the object would have not been in the middle of this thing since wings on a jet are not in the center of the plane.  They would have been closer to the front. I'm not sure what it was but I'm sure it wasn't an airplane or helicopter.  I could not hear any sound.",
      "link": "http://www.nuforc.org/webreports/069/S69116.html",
      "state": "TN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5f4",
      "summary": "Four short and closely grouped contrails observed in clear skies",
      "city": "knoxville",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "Four short and closely grouped contrails observed in clear skies On October 22, 2008 at approximately 15:55 while traveling west on Interstate 40/75 between mile markers 379 and 376, I observed what appeared to be three relatively short jet aircraft contrails grouped closely together traveling in a southwest direction  The sky was clear.  Other long contrails were visible in other areas of the sky, particularly to the south.  The altitude of the three contrails seemed to be similar to typical jet contrails. The three contrails seemed unusual to me.  The contrail lengths were relatively short compared to others in different areas of the same sky.  The two most westward contrails were relatively close and in parallel.  A third contrail was close behind.  After observing these objects for about 20 to 30 seconds, it then appeared that there were actually four contrails.  The fourth contrail seemed to be close to the forward two.  The flight paths were apparently straight and the movement seemed to be consistent with high altitude aircraft speed which I have routinely observed. These contrails apparently were evaporating rather quickly.  After about 60 to 90 seconds after the initial observation, the contrails disappeared, one by one.  The last one observed was the trailing contrail. At this point, my initial impression was this phenomena could have been some type of debris entering the earth’s atmosphere and breaking into three or four relatively large pieces.  I was not able to determine if the contrails were actually due to aircraft.  I did not have access to any type of optical devices or cameras.  There was no observed points of light associated with the contrails. There was one other observer besides myself.  My background is in chemistry and radiological safety.  The other observer is a registered land surveyer. My question would be, \"Has any local radar station observed these objects at this location and time and made any identification?\" A response via email would be welcome if this observation warrants an investigation.",
      "link": "http://www.nuforc.org/webreports/066/S66391.html",
      "state": "TN",
      "duration": "1 to 2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bac4a",
      "summary": "A string of about  12 amber lights sighted in clear late evening sky moving NNE from the Smoky Mnts.",
      "city": "knoxville",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "A string of about  12 amber lights sighted in clear late evening sky moving NNE from the Smoky Mnts. A string of amber lights appeared to rise from SSE.  I first thought they were aircraft following each other towards TYS air field.  I called my wife and quickly got my binoculars after about 6 bright amber lights appeared in a straight line.  I tried to focus on each individual head lamp to get it into focus but I couldnt get a sharp image of an aircraft head lamp on none of the lights.  They seemed to have gained altitude about 30 miles downrange, rise and get closer to the air field in an unusual single file path. Their were about 12 amber lights.  I checked the objects for aircraft navigation lights, red, green, white flashing lights but there were none.  I commonly see aircraft takeoff and land from my front porch so not seeing navigation lights really alarmed me.  They appeared to fly about 2 miles apart and then they appeared to bank right turn to a visual landing at the field. Once they made the turn they appeared to fade out of sight one by one.  The airfie! ld is 14 miles ESE of my position. The unusual thing was that the lights stayed at the same altitude when they turned, no sighs of desent or loss of altitude.",
      "link": "http://www.nuforc.org/webreports/078/S78552.html",
      "state": "TN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad85",
      "summary": "ball of light flying over Farragut/West Knoxville",
      "city": "knoxville",
      "shape": "egg",
      "date": "2011-05-02T00:00:00",
      "story": "ball of light flying over Farragut/West Knoxville I was driving down Parkwest Blvd. towards Lovell Rd. in West Knoxville/Farragut and I saw an egg shaped ball of light, fairly large, moving very quickly through the sky, fairly low, in the direction of Oak Ridge.  I saw it for a few seconds and then it was gone.  I kept looking for it but it never showed up again.",
      "link": "http://www.nuforc.org/webreports/080/S80791.html",
      "state": "TN",
      "duration": "3 to 5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb408",
      "summary": "Large, spherical, solid black craft emitting a blue beam, followed by black helicopters.",
      "city": "knoxville",
      "shape": "sphere",
      "date": "2011-01-31T00:00:00",
      "story": "Large, spherical, solid black craft emitting a blue beam, followed by black helicopters. Three years ago in Knoxville TN, my home town, I witnessed my first UFO.  What i saw changed my life, my perception of how i understood physics, and what i once viewed as possible and impossible.  I have always been interested in the paranormal, since my first memories i can recall an interest in ghosts, spirits, angels aliens etc.. but overall i am a pretty sound and logical person.  The details of my first sighting were pretty much exactly the same as what is described by eyewitnesses of the famous Phoenix lights, but that's not why I'm here.  I'm here because this morning at 1:30am, I witnessed something that frightened me to my very core.  Unlike my other UFO sighting experiences in which i was not frightened, just fascinated and curious about the possibilites of what i was seeing i felt a combination of peace, warmth, and awe. what i witnessed tonite was completely different.  I had just gotten home from a little late night shopping at wal-mart.  The time was around 1:30am and i was walking out of my bathroom and down the stairs to my basement to smoke a cigarette, when i heard a very loud rumble as if a tornado was directly over my home.  It was such a loud humming/rumbling sound that i could literally feel the vibration from it.  Curious, i walked out my front door expecting to see a helicopter flying directly over or a low flying jet, but... that is not at all what i saw.  I open the door, and directly in front of my point of view was an ENOURMOUS, solid carbon/black perfect circle shaped craft hovering extremely low and close to my home. The sound was loud enough that i'm surprised... better yet shocked that it didn't wake the whole neighborhood.   Again, this thing was huge.  In the dead center of this giant circular craft (Which i could see almost perfectly, and it had no wings, no landing gear, no strobing lights and no visible markings of any kin! d) was an extremely bright laser like lighting blue beam pointing in several different directions. I have to admit, i was frightened by it, but i wanted to document it somehow. Now, i own a video camera, but i keep forgetting to purchase new film, and did not have any in it at the time, which REALLY sucked. So, since option 1 was out of the question i ran to get my iphone from off my counter top. Here's what is strangest part of the story. By the time i got back outside with my phone in hand, this thing, this craft, this... sort of ominous eye of god ship had left. I could still hear it, it was still very loud, and knew it had to be near by. Mind you, I was in the house for all of 15 seconds searching for my iphone. I ran as fast as i could in house shoes around to the back of my house hoping to catch a final glimpse. This craft (or whatever you want to call it) had traveled several miles north, and all i could see was the faint remnant of the beam shooting out of it, and i! t was rotating up and down and back in forth as if it was sear! ching fo r something, and then it dissapeared behind the ridgeline, although the noise emminating was still very noticeable. Wait it gets weirder. SO i hear another loud rumble coming from behind me, althought this sound is familiar. I look up, and there 3 black helicopters with only their spotlights on in formation flying along the same path the craft took, as if they were chasing after it. These choppers were hauling major ass. I knew i had just witnessed something i was not supposed to see. I will remember this day forever, and the unusual ominous sense of fear i got from witnessing this thing. If you would like, i am a bit of an artist, i could send a detailed sketch at a later date. Thank you for your time.",
      "link": "http://www.nuforc.org/webreports/079/S79678.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb65e",
      "summary": "We found this orb of light that is purple and cannot be seen by us, we also know it was way up in the sky.",
      "city": "knoxville",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "We found this orb of light that is purple and cannot be seen by us, we also know it was way up in the sky. I was out taking photos on the night of  Nov. 19. I took a total of five photos and the forth one was the only one that it showed up on. We did not see this mysterious object in the sky.  So the this object is very far up or possibly paranormal. It could be a U.F.O. We cannot decide what it is, or what to make of it. The first thing that we thought it was was a star, then we thought that stars are not purple.  Then we thought about an orb of purple light , like I said we cannot decide whether it is an orb of paranormal light or a U.F.O. We got this spot of light when we were taking pictures of the moon, and like we said we took about five photos and they were about three minutes apart and this one is the only one that it showed up on. Thank you for your help.",
      "link": "http://www.nuforc.org/webreports/078/S78997.html",
      "state": "TN",
      "duration": "3 Mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc030",
      "summary": "Over NW Knoxville TN, viewed from central Knoxville, appeard high over 10,000 ft?, one, perfectly elliptical opaque white with a bright",
      "city": "knoxville",
      "shape": "other",
      "date": "2011-12-12T00:00:00",
      "story": "Over NW Knoxville, TN, viewed from central Knoxville, appeard high over 10,000ft?,  one, perfectly elliptical opaque white with a bright white light at the 9:00 narrow end, stationary for the 10+ min after I first observed,  then dimmed twice before abruptly vanishing.  Vicinity: blue sky, zero clouds.",
      "link": "http://www.nuforc.org/webreports/085/S85197.html",
      "state": "TN",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc16c",
      "summary": "7 orange orbs flew across the sky one at a time in the same path, appeared out of nowhere, and faded away.",
      "city": "knoxville",
      "shape": "sphere",
      "date": "2012-01-12T00:00:00",
      "story": "7 orange orbs flew across the sky one at a time in the same path, appeared out of nowhere, and faded away. On the evening of Christmas day I was told that I needed to quickly come outside. I saw a orange sphere traveling across the horizon from west to east.  The object made no sound at all and moved much faster than the wind could carry it.  It was moving slower than a plane but fast enough for me to tell that it was being propelled by something. after about 15 seconds it disappeared. Then another one appeared in the western part of the horizon.  It took the exact same path as the first orb, and faded away in the east.  I observed a total of 5 of these orbs traveling across the sky in the same way. The person who told me to come outside saw a total of 7 orbs.  There were a total of 4 people that witnessed this. It was the weirdest thing that I have ever seen. I have been trying to figure out what these were.  There is no possible way that these were Chinese lanterns.  They were moving way too fast, and they were following a straight horizontal path.",
      "link": "http://www.nuforc.org/webreports/086/S86129.html",
      "state": "TN",
      "duration": "10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc206",
      "summary": "Sighting of a saucer in broad daylight in Knoxville, TN.",
      "city": "knoxville",
      "shape": "disk",
      "date": "2011-12-12T00:00:00",
      "story": "Sighting of a saucer in broad daylight in Knoxville, TN. I was taking a walk in a local park around 15:30,clear sky above my head, when through the trees surrounding the path,   I watched a set of yellow-orange lights, arranged clearly with one long, base light and three curved rectangular lights which appeared thinner, resting on the top of the slope of cerulean blue material that connected these lights.  The upper layer of lights extended past the edge of the bottom one, which appeared more rounded than rectangular.  I watched the craft leaving no contrail, and then, suddenly, jolting to a stop, it begin to move forward in waves, like it was being tossed in the wind.  Upon chasing after it, I lost sight of the object and have not relocated it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85432.html",
      "state": "TN",
      "duration": "about 1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc436",
      "summary": "West Knoxville Bright Blue Object",
      "city": "knoxville",
      "shape": "oval",
      "date": "2011-10-10T00:00:00",
      "story": "West Knoxville Bright Blue Object This is my second sighting of this object. First time was back in Jan 11. about 7:30pm also.  Bright blue object.  Extremely bright blue.  First time I tried to get a neighbor to see also but no one was home. This time my neighbor came out and saw also. What is crazy is it is over a heavily populated area of West Knoxville.  I can't believe there isn't more response.  Object makes no noise.  Fly's in every direction quickly.  First time a spotlight shown down onto the ground from object but I did not notice it this time.  I have video from both nights also but from a cell phone so not very good. Very interesting. I would just like to know if anyone else saw this.  Is it a toy???  No plane can fly like this.",
      "link": "http://www.nuforc.org/webreports/084/S84239.html",
      "state": "TN",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc718",
      "summary": "4 UFOS",
      "city": "knoxville",
      "shape": "other",
      "date": "2011-10-10T00:00:00",
      "story": "4 UFOS I saw 4 UFO's not moving in the air for at least five minutes.  Just hovering the whole time.  OCT 8th 2011 3:30pm in Knoxville, TN, above my house.  Clear sky and they were silver. I went inside tried to find camera came back out and 3 were gone.  The last one started moving very slow and when I tried to look in my binoculars to see it and then couldn't see it so 5 seconds later when I pulled them from my eyes it was gone.   I do not know who to go to or to see if anyone else around me seen the same thing.   I tried to take a picture with my phone but you cant really see anything but 3 of them and they just look like dots in the sky.",
      "link": "http://www.nuforc.org/webreports/084/S84415.html",
      "state": "TN",
      "duration": "10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc824",
      "summary": "Orange flickering light in sky",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2011-12-17T00:00:00",
      "story": "Orange flickering light in sky We were leaving Brixx on Kingston Pike when I spotted an orange flickering light traveling horizontally in the sky toward Papermill.  I tried to watch it as long as I could, but keeping up with two children and a boyfriend that dismissed it as a \"lantern:  kind of drew my attention away.   It was definitely something you don’t see every day, and I would really like to know if it can be explained.   I was just complaining the other day that all these \"non-believers\" see objects all the time, and I’ve never seen anything.   I’ll just consider it a complimentary viewing after my request I suppose. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85881.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8a0",
      "summary": "One spherical fireball which quickly died out leaving a dark, spinning mass that drifted southwest as it descended",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2011-08-07T00:00:00",
      "story": "One spherical fireball which quickly died out leaving a dark, spinning mass that drifted southwest as it descended I am an RN case manager and musician and visual artist.  My husband is a computer scientist and jazz pianist.  We are avid bird and nature watchers.  We walk in our West Knoxville, TN, neighborhood almost every day. Tonight my husband and I just witnessed what might be described as a fireball in the Farragut/Concord area just southeast of Turkey Creek and Concord Roads at about 21:15 tonight. We were walking eastward on Turkey Creek Road just east of Anchor Park when we realized that the bright object in the sky above was not a helicopter or airplane.  The center of the roughly spherical object blazed bright orange at first.  It had a dark, slightly irregular outer edge.  It appeared to be spinning. This went on for maybe a minute at most and then the bright center quickly died out and all that was left was a dark, cinder-like spinning object, possibly spherical or disc shaped, that slowly lost altitude as it drifted roughly southwest and was lost to our sight as it descended in the direction of Northshore Drive.  It made no discernible sound. We do not know if there is any relation, but there has been a bad smell in the area this evening - possibly a chemical odor or the smell of something burning.",
      "link": "http://www.nuforc.org/webreports/082/S82648.html",
      "state": "TN",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc99d",
      "summary": "Oval Shaped Bright Blue (like LED bright) moving above populated area",
      "city": "knoxville",
      "shape": "oval",
      "date": "2011-10-19T00:00:00",
      "story": "Oval Shaped Bright Blue (like LED bright) moving above populated area I would describe the night as \"clear,\" there was a storm coming in from the south, but it hadn't reached our area yet. My son and I were heading home from taking care of our horse.  As I was driving, I observed Jupiter in the sky to the front right of my car. As I rounded a curve in the road, I noticed a extremely bright blue light thru the tree tops to my left.  I have driven down this road countless times in the past year and I knew that light wasn't there before.  I said to my son\" what is that blue light over there, do you see it?\"  He replied \"ya, I see it.  I don't know what it is.''   We then came to a point in the road where we could pull on a side street.  We sat there for a minute and watched in wonder.  This bright object was moving from side to side, even doing a \"figure eight\". I drove a little further down the street to get closer to it.  We sat and watched it for another minute, then it just blinked out.  Gone.  And before I could say anything, it was back, bright as ever, just in a different spot.  I'm sure this was the same object we had been watching. To me, the shape was oval, but there was a time or two when it moved it almost seems to get longer.  We had the windows in the car down,there was not any noise that we could hear. Ok, so I really wanted the validation of another person.  I tried to flag a car down, they wouldn't stop.  Cant say I blame them, but that didn't stop me from flagging another car down.  He did stop. I said \"thanks for stopping, and i know this is going to sound crazy, but do you see that blue light up there?\" as i pointed to it.  He looked and said \"yes\". I said \"don't you think that it looks weird, the way its moving?\"  I believe his reply was \"  I think its a police helicopter\".   Um.... Are you kidding me? My father is a pilot, fixed wing and helicopter.  I grew up in a plane. I'm pretty confident I could figure that out myself if that was the fact.  The guy was still watching the object and then he says \"maybe it a searchlight, ya know, like when a new place opens and they want to draw attention\".    Well, Im pretty sure those lights just don't stop and make a oval in the sky.  There was no ceiling....no clouds. Nothing for the light to bounce off .  Disappointed that the guy wa! s not as amazed as we were, I told him thank you for stopping, and he drove off.  I hope he got down the street and looked up at it one more time. We rushed home to get the camera, but of coarse, it was gone when we returned.  I even dragged my grumpy husband out of the house to go driving around to look for it.  Im bringing my camera with me from now on.",
      "link": "http://www.nuforc.org/webreports/084/S84619.html",
      "state": "TN",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bcb9c",
      "summary": "Strange orange lights over Knoxville, TN",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2011-07-06T00:00:00",
      "story": "Strange orange lights over Knoxville, TN While watching fireworks, a light caught our attention which appeared to be a flare at first. It was orange in color and seems to glimmer like a flame.  However, we begin to watch as it moved across the sky beyond our view.   It appeared to be high in the sky.  Roughly 10 minutes later another \"orange flare\" came across the sky following the same pattern almost, it too flew out of view as the first.   As it flew overhead, binoculars form within the house were obtained.  View through binoculars, the object was very hard to focus in on remaining blurry.   Approx. 10 minutes later another flew in about the same path and direction as the previous. This time, this particular \"orange flare\" was moving faster than the others coming from the same direction and going towards the same direction as the other.  (The direction these things were going was from the North - Northeast moving towards the southwest - sometimes turning west).  This one slowed down and appeared to come to ! a complete stop while still glowing orange.   A minute or two later, the item began to move in a western direction and slowly began to disappear until it was gone.  Once it disappeared, another came into view across the sky to the north again - it followed the same path.  This point was when the choice to grab the telescope was made.   However, as the telescope was being sought after, two more objects appeared outside. This time as one went across (same direction) another appeared across the sky in the direction they were coming from making visible two of these objects at one time.   These objects were photographed and caught on video (phone).  However, watching the video and film afterwards, it is very hard to see what was actually seen.  Describing the view through binoculars - the objects appeared to be an orange spot light moving from side to side almost.  It was very hard to focus in on the objects.  The sky was clear except for some smoke in the southern portion of the sky from t! he fireworks - however, these objects moved through clear skie! s.   When the one object stopped, we observed a plane flying from the east to west and appeared to be flying toward the direction; however, when the plane flew by the object - you could tell the plane was much higher than the object.  However, it seemed weird that object slowed and stopped as the plane approached and as soon as the plane passed over head of the object, that is when the object begin moving in the westerly direction as the same as the plane, then vanished.  Further research on the internet mentioned items such as Chinese lanterns which may be possible - not sure because we have never seen them but the objects were weird as they seemed to be moving at various speeds and the one that stopped.  We have never seen anything like this before. The first two objects came from the North and traveled in a southwestern direction.  The remaining objects came from the Northeast and traversed in a southwestern direction except for the one object that stopped and changed to a western direction.  All objects except the first vanished or disappeared in the sky in view, while the first vanished behind the house out of view.   The object emitted no noise from at least what we could tell - there were fireworks going off in the distance and the booming of those were heard, however, when the plane flew by, we could hear that.  The objects were very hard to focus on and appeared blurry even through the binoculars; however they were very bright in color and looked like flares in a way but without the excessive smoke or flame appearance flares give off - the same color though.   The first two were moving about the same speed and the third that stopped was moving very fast before it slowed to a stop.  The remaining was various speeds but no! t as fast as the third.  The items were viewed from about 2115 hours to approx. 2215 hours.   The objects appeared as circle type and blurry. We stayed out until 2250 hours waiting for more but no more were observed.",
      "link": "http://www.nuforc.org/webreports/082/S82160.html",
      "state": "TN",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd17d",
      "summary": "Craft gleaming in sunrise.",
      "city": "knoxville",
      "shape": "cylinder",
      "date": "2012-09-24T00:00:00",
      "story": "craft gleaming in sunrise I was driving East bound on Kingston Pike taking my son to school when above the sunrise there was a craft that was gleaming bright.  It was shining on the opposite side than where the sun would have been reflecting on it.  I actually passed up my turn because I was watching it.  I tried to take a picture, but the craft turned at what appeared to be roughly a 90 degree angle and all but disappeared.  The moment it changed direction I could just barely see a dark spot and then it was gone.  My oldest son saw this as well, but he doesn't want to believe.  Yes, I understand it could have been a plane, but it was the brightness of it that caught my eye.  There was also a helicopter flying in the same area as the craft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92206.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3fc",
      "summary": "Bright light moving very quickly across night sky. No noise but seemed relatively close.",
      "city": "knoxville",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Bright light moving very quickly across night sky. No noise but seemed relatively close. A very bright light, moving under cloud cover at 1 am, was seen moving VERY quickly from one side of the night sky to the other.  The light seemed bright enough that we should have been able to hear if it was a plane of some sort.  It was headed from southwest to northeast.  There is no airfield of any kind in that direction. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92334.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4b1",
      "summary": "Like a shooting star, but it was overcast Slow to fast and disappeared Knoxville TN",
      "city": "knoxville",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Like a shooting star, but it was overcast Slow to fast and disappeared Knoxville TN Was stationary, then moved quickly across sky.  Could have been mistaken as shooting star, or like object, except sky was completely overcast.   It had been raining all day, and through out the night.   Disappeared suddenly after a quick movement.  Wasnt flashing or twinkling,  Orangeish yellow, too fast to be a plane to overcast to be a star. 2nd sighting in 17 years.   First sighting moved the same way, different color.",
      "link": "http://www.nuforc.org/webreports/093/S93272.html",
      "state": "TN",
      "duration": "5-8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd71f",
      "summary": "Green flashes/strobing in the western sky",
      "city": "knoxville",
      "shape": "flash",
      "date": "2012-10-30T00:00:00",
      "story": "Green flashes/strobing in the western sky. Did anyone report a bunch of bright green lights flashing in the sky?  I have never reported anything like this but it was real weird.   My wife dismissed it as a bunch of laser pointers until she saw it for herself about 30 seconds after I saw it.  It was in the western sky from here in halls and it was a bunch of flashes all over like a crazy christmas tree in the sky. Ill remain nameless right now, lol",
      "link": "http://www.nuforc.org/webreports/093/S93404.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd805",
      "summary": "5-6 balls of light floating above the Mechanicsville/Middlebrook area, spotted from Alcoa Hwy",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "5-6 balls of light floating above the Mechanicsville/Middlebrook area, spotted from Alcoa Hwy They moved so smoothly and with such perfect synchronization, almost as if on a puppet string. The light radiating from them was unlike that of a helicopter (our first suspicion).  It glowed like a ball of light, yet, you could still tell that it was an OBJECT.  You could also tell their position in the sky. THEY WERE NOT THAT FAR FROM US....maybe a mile away from us and a mere 500-700ft. from the ground. For these craft to be so close to the ground, they made no audible disturbances. (This would not be the case if they were government aircraft.)",
      "link": "http://www.nuforc.org/webreports/092/S92582.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf1d",
      "summary": "Two bright lights in the sky moving in coordinated efforts, my boyfriend and I witnessed the same event.",
      "city": "knoxville",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Two bright lights in the sky moving in coordinated efforts, my boyfriend and I witnessed the same event. I am composing this note for both my boyfriend and I. We were driving home from dinner on Tuesday, September 18, 2012. At approximately 9:00-9:15 p.m. we witnessed an event we have ever seen before. My boyfriend's recollection of the event is a little different than mine. That is why I want to include both of our reports as two different testimonials for the same event. Here is his report: &quot;I am typing this report at 10.30 pm est September 18, 2012. My girlfiend and I were driving home from dinner at about 9:00pm est. We live in Knoxville, TN in an area about 20 miles from McGee-Tyson Airport. We are used to seeing airplanes fly over our neighborhood all the time, and this sighting was absolutely not an airplane. It moved too fast in the sky and in a very strange manner. I am not sure what I witnessed was from another world or something the government may be doing, but it was definately something I have never seen before. It was pitch black outside, and just as we were coming over a steep hill on our way home, I witnessed two distinctively bright lights that appeared to be changing colors from orange- to red- to green. They were very bright, brighter and larger than any other star or plane in the sky. What I witnessed lasted from about 5 to 8 seconds, it was very brief. However, I can say there was no avoiding seeing this because it was obvious something was happening that was not normal. The two lights moved higher in the sky in a coordinated effort, then crossed each other. First making arches in the sky, then creating an &quot;X&quot; path in the sky. The two lights then came together, stopped and held their spots, then took off at opposite directions a speed I have never witnessed. There was also a truck down the road from us that was stopped. We drove towards them, they rolled down their window and told us that they had witnessed the same thing. This was, by far, the strangest thing I have ever seen. The “orbs” (as some people have been referring to them) were in the southeastern night sky.&quot; In addition to my boyfriend's report above, I wanted to give my own testimonial for this event: We were coming home from dinner at around 9pm on September 18th. We were coming over a steep hill, and I could see in the sky, much much higher than the tallest trees, two very bright lights. They were circular &quot;orbs&quot;, I guess some people have been calling them. One was red-ish in color and the other was green-ish. They were very bright, much brighter and larger than any star. And they appeared to have a hazy ring around them. What I witnessed only lasted 1 to 2 seconds, but I know that it was not normal. It was not a star, an airplane, or any other &quot;normal&quot; object or light you would expect to see in the night sky. The two lights were moving towards each other, like mirror images. Then they stopped, and separated apart, almost like they were repelled from each other, at a speed I have never witnessed. They moved so fast that you could not keep your eyes on them, then they were simply gone. I did not see the first part where the two lights created arch paths, then &quot;X&quot;ed over each other (as my boyfriend described) because I was looking out the other window, but I did witness the last part of the event, and I can stand with my boyfriend in saying that it was not normal, and something I have never seen before. As soon as this happened, I had a hard time recognizing what happened, I wasn't sure of what I saw, then my boyfriend asked me if I saw it. I immediately knew what he was talking about, and didn't know how to respond. My first response was to call 911 and report it, but we didn't end up doing that. We saw a truck parked down the road of 2 people we have never met. We rolled down our window and they told us they had just witnessed the same event. Basically, I saw one bright red light, or &quot;orb&quot;, and one bright green light. They were large and moved at a speed I have never witnessed before, in the following pattern: First moving towards each other, in a coordinated effort: --&gt;   --&gt;   --&gt;         O    O         &lt;--   &lt;--   &lt;-- When they met, they stopped and held their position, then separated in opposite directions at a speed I have never seen. Exponentially faster than any other airplane: O   &lt;----- &lt;----- &lt;----- &lt;-----       -----&gt; -----&gt; -----&gt; -----&gt;   O Then they were simply gone, nowhere to be seen in the sky. Like I said, what I saw only lasted 1 to 2 seconds, but I do not doubt my boyfriend's testimonial at all. I believe that we saw the same thing, and I believe that he did see the lights first create arch paths in the sky, the &quot;X&quot; over each other. My boyfriend works in sales, and I am a manager at a local company in Knoxville. We make good money. We are not religious, or spiritual, nor are we &quot;UFO hunters&quot;. We have nothing to hide, and we are not looking to be famous. We have never witnessed anything like this before, and we are honest people who just thought that what we saw needed to be reported. After the event, we researched internet sites to report what we saw, and nuforc.org seemed like the only legitimate website we could find. Thank you.",
      "link": "http://www.nuforc.org/webreports/092/S92886.html",
      "state": "TN",
      "duration": "5 - 8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf27",
      "summary": "I observed what  I thought was a low flying plane, but as I approached I realized it was stationary and hovering.",
      "city": "knoxville",
      "shape": "circle",
      "date": "2012-11-19T00:00:00",
      "story": "I observed what  I thought was a low flying plane, but as I approached I realized it was stationary and hovering. On the evening of November 14th I was driving home from in the western suburbs of Knoxville, Tennessee on Westland Drive.  I was headed east when I noticed what appeared to be a very low flying airplane in the distance. There is McGhee Tyson airport about 8 miles to the southwest, so I didn't, at that moment, think it was out of the ordinary, except for the altitude it was at.  For the next 45 seconds I had a clear view of this craft. I kept waiting for it to pull away and gain altitude, but as I got closer, I realized that I was gaining on it.  I slowed down as I got closer and realized that it was hovering about what appeared to be 400 feet above the road. It had two white lights on either side of what I first thought were the wings, with a red light blinking in the center.  As I got closer and closer, now only going maybe 20 miles an hour I had a totally clear view of this craft.  As I drove under it, only then was I able to see that it had an oval or rounded shape to the underside of it.  I really wanted to pull over, get out and observe this craft, but I was just a little freaked by the whole experience.  As I drove away I kept looking in my rear view mirror, but never saw the lights or craft again. I would really like to think that it was a plane or helicopter, as it was hovering, but I know of no plane that can do that and I've seen too many 'copters and it made no noise that I could hear. The exact location was on Westland Drive right across from A.L. Lotts Elementary school.",
      "link": "http://www.nuforc.org/webreports/094/S94472.html",
      "state": "TN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be10f",
      "summary": "Brilliant bright light seen above high altitude airplane with no plume then disappears over Knoxville, TN.",
      "city": "knoxville",
      "shape": "unknown",
      "date": "2012-11-19T00:00:00",
      "story": "Brilliant bright light seen above high altitude airplane with no plume then disappears over Knoxville, TN. Traveling 275 to I-40 West, approximately 5pm, right before taking the Alcoa Exit, noticed a high altitude aircraft toward the West with a white plume behind it.  In perspective, approximately 1-2 inches above this aircraft was a brilliant white light, shape unknown, with no trailing plume, which the light became even brighter than before, then completely disappeared. I believe this was too close to be another airplane.  Also, if it was an airplane, it would not have disappeared. It did not have a trail of any kind. I was the front passenger in the car, and was telling the driver, my sister, to look at the object, and why it did not have a plume, when it completely disappeared.  She was driving and did not see it.  We were traveling to UT Medical Center with 2 grandchildren to see my new grandchild.  I have never seen a UFO before. I am 55 years old, have been a Registered Nurse for over 30 years, and have lived in Anderson County most all of my life.",
      "link": "http://www.nuforc.org/webreports/094/S94549.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be14a",
      "summary": "Multiple bright flashes of light with no sound, enveloping sky with light.",
      "city": "knoxville",
      "shape": "flash",
      "date": "2012-05-29T00:00:00",
      "story": "Multiple bright flashes of light with no sound, enveloping sky with light. Witnessed multiple flashes of light, extremely bright and lit up entire sky completely.  There were booming metallic sounds off and on prior to flashes, but not in sync with the flashes of light.  There were no clouds and a completely clear night.  These flashes enveloped the sky with light and were brighter than any lightning I have ever witnessed, and were completely silent.  (The booming noises were minutes before and in between the flashes but never in sync).   I proceeded to call my fiance' who was travelling in a rural area of southern Kentucky that morning and she saw the flashes at the same time that I did.   We saw them simultaneously three times, spanning about a 5-10 minute period.",
      "link": "http://www.nuforc.org/webreports/089/S89189.html",
      "state": "TN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3be247",
      "summary": "Circular oject floating in place for a few seconds then darting off into the distance",
      "city": "knoxville",
      "shape": "circle",
      "date": "2012-11-04T00:00:00",
      "story": "Circular object floating in place for a few seconds then darting off into the distance I was driving home at 3:35 am and saw an object that looked like a shooting star but hovered over the horizon for a few seconds then darted off into the distance ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94070.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be2db",
      "summary": "Gray floating objects. One with reddish glow below.",
      "city": "knoxville",
      "shape": "other",
      "date": "2012-07-04T00:00:00",
      "story": "Gray floating objects. One with reddish glow below. June 29, 2012 Approximately 8:45 PM. The sun was down but there was  sufficient light to see the sky. Walking outside on Kingston Pike in Knoxville, TN. near the 3700 block. TN. Looking in the eastern sky. Saw multiple gray objects appearing to be floating down. Looked like parachutes but no one was below them.  They were close enough that had there been lines and people below the parachute I would have seen them and there were none.  One had a reddish glow below. Almost like the light of a fire. They did appear to be drifting downward to the north. There were several groups of them. Maybe 3 or 4 per group. They descended below the trees and went out of sight.  Two other people observed this with me. It lasted for several minutes as when I first saw the gray objects no one else was near me. Then two other people came outside and I pointed the floating objects out and they saw them as well.",
      "link": "http://www.nuforc.org/webreports/090/S90225.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be8b1",
      "summary": "Orange lights in triangular formation.",
      "city": "knoxville",
      "shape": "formation",
      "date": "2012-05-13T00:00:00",
      "story": "Orange lights in triangular formation Traveling down I-75 South approaching Emory Road Exit.   Saw 7 orange lights in a triangular formation.  Some of them had a blinking light on them the same color. As we drove under them they appeared to dissappear.  We stopped at the Weigles and got out but it was so bright with all their lights we could see nothing.  We left and got back on the interstate but did not see them again.  Opened window but did not hear any sound from them.",
      "link": "http://www.nuforc.org/webreports/088/S88903.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be8b6",
      "summary": "Cresent  formation of  11 lights seen over I75 outside of Knoxville Th on May 11,2012 at 22hundred hr",
      "city": "knoxville",
      "shape": "unknown",
      "date": "2012-05-13T00:00:00",
      "story": "Cresent  formation of  11 lights seen over I75 outside of Knoxville Th on May 11,2012 at 22hundred hr We were traveling south on I75 about 7 miles outside Knoxville and the cresant shaped lights looked they were traveling north   We did not stop the car so it was hard to tell.  I know they were not stars because of the overcast.They were not planes because of no flickering of lights.  The radio was on so we could not hear a sound.  We were sobe so I know we were not seeing things.  Very strange.  I have never seen anything like that befor nor had my friend.",
      "link": "http://www.nuforc.org/webreports/088/S88939.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be8b7",
      "summary": "May,11, 12 A cluster of lights were observed in the south sky over I75  at 22hundred hour traveling north",
      "city": "knoxville",
      "shape": "unknown",
      "date": "2012-05-13T00:00:00",
      "story": "May 11, 12   A cluster of lights were observed in the south sky over I75  at 22hundred hour traveling north Driving south on I75 about 11pm about 6 or 7 miles outside of Knoxville We observed a cluster of lights in the south sky.  We were traveling south and they looked like they were going north. We only saw them for about 10 to 15 seconds.  They were not blinking or or  colored.  Radio was on so I don't know if there was a sound.It was just a strange thing to see.",
      "link": "http://www.nuforc.org/webreports/088/S88947.html",
      "state": "TN",
      "duration": "about 10to15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bef68",
      "summary": "I was playing basket ball i looked up and two lights were next to eachother then a triangle appeared it scare all f the six witneses",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "i was playing basket ball i looked up and two lights were next to each other then a triangle appeared it scare all f the six witneses We were playing basketball and i suddenly see two lights flying next to eachother then they kept coming andthe a triangle appeared i wen around my house then they were gone",
      "link": "http://www.nuforc.org/webreports/096/S96681.html",
      "state": "TN",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf661",
      "summary": "Big reddish-orange (planet-looking) light hovering over Knoxville, TN during 4th of July festivities",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "Big reddish-orange (planet-looking) light hovering over Knoxville, TN during 4th of July festivities I'm surprised that no one else mentioned this!   When I lived in Knoxville, TN in 2010, my husband, best friend and I were walking closer and closer to the river during the 4th. of July festivities in World's Fair Park to get a better look at the fireworks.  We kept walking and walking and walking until we got up to a neighborhood right next to the river, and we couldn't walk any further.  There were a whole bunch of people sitting on their front porches, sitting in their front lawns.....etc watching the fireworks.  There was a middle-aged man on the sidewalk with a pet boa constructer, my 19 year old friend was wearing a cute, white sun dress, and she (being the daring type of person that she is) asked the man if she could touch it.  It weighed about 70 lbs, and she was tiny herself, so I was very surprised and completely distracted when the man said, \"Sure,\" and instead, draped the gigantic snake over her shoulders, and she was totally freaking out.  I was kind of giggling and no longer paying attention to the sky and the fireworks when I suddenly noticed everybody walking out into the streets like they were mesmerized or something.  I didn't understand what could've been so wonderful about the fireworks, because I was getting bored with them and paying attention to my friend's nervous reaction.   I suddenly turned to my husband iand asked what the big deal was to notice that he was in a daze staring at the skies as well.  He pointed and said, &quot;Look&quot; while still partially in a trance.  I looked up, and there was this small, but distinctive, ball of a red-orange light that looked like it was far in the distance and getting bigger and bigger as it seemed to be quickly approaching.  I felt like I was dreaming but looked around to realize that everyone else was still looking at it too, which made me realize that it wasn't even close to my imagination!  As I looked back up again, I noticed that it was gigantic. Granted I di! dn't have my prescription glasses on at the time, but to me,  it somewha t resembled a small planet or something, and it seemed like it was so close that I thought that it was going to hit us.  Instead, it seemed as if it was hovering a little bit higher than a high helicopter right in front of everyone in the neighborhood, but over the water.   It hovered over there for a long matter of seconds, and suddenly (out of nowhere), it quickly darted off almost directly right and disappeared in a split second almost as if it never was really there.  Once again, I thought that I was imagining it, and realized that everyone was still standing around looking up at the sky for a couple of seconds after it disappeared. I mentioned that I wished that my son was there to see it as soon as I came to, and I looked back at my friend who still had the snake draped over her as if the snake was barely even phasing her anymore until she 'came to' again, and finally asked the guy to get the snake off of her.",
      "link": "http://www.nuforc.org/webreports/098/S98111.html",
      "state": "TN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c00ee",
      "summary": "Brilliant Light Shines and Disappears.",
      "city": "knoxville",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "Brilliant Light Shines and Disappears I remember the exact day because it was that of the $500 million lottery drawing.  My girlfriend and I were on the way to purchase a few tickets. We pulled into the local gas station parking lot and through the sun roof a brilliant light was shining, almost floating in our direction. We both saw it and I commented to how it was flying very low.  It was not a plane as we saw planes, indicated by blinking lights, flying in the back ground. After parking, instead of rushing to buy lotto tickets, I was curious and wanted to see if I could hear the motor flying the mysteriously bright light.  I  could hear nothing, and I've been known to have keen ears.   My girlfriend and I were just looking at it when I noticed Venus next to the moon.  I know it was Venus because i used a star map app to find out.  As I focused on Venus, with the app, my girlfriend looked away from the shining object. An instant later the brilliant shining light was gone.  I wanted to put the object in the app but no suck luck. We were also out of luck when it came to winning the lottery.  Maybe next time we'll get a video and the money.",
      "link": "http://www.nuforc.org/webreports/094/S94965.html",
      "state": "TN",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0513",
      "summary": "Triangle with each corner lit, moving VERY fast.",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2013-02-18T00:00:00",
      "story": "Triangle with each corner lit, moving VERY fast. One single craft, lights at each corner in Triangle shape.  Moving very quickly through the sky, tried to pull out phone to record but craft was gone within seconds.  Moving very, very fast.",
      "link": "http://www.nuforc.org/webreports/096/S96300.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c05c7",
      "summary": "3 medium bright lights in a triangular shape. Large circular light in center lit up and object moved, seemingly instantaneously to the",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2013-02-18T00:00:00",
      "story": "3 medium bright lights in a triangular shape.  Large circular light in center lit up and object moved, seemingly instantaneously to the West what must have been at least a hundred miles.  Center light went out and apparently hovered for several minutes.  Altitude increased until out of sight using binoculars. I am a 62 year old male retired from a customer service position with 40 years of service.  Have studied the Aurora programs and this was identical to tr3b sightings reported.No audible sound.",
      "link": "http://www.nuforc.org/webreports/096/S96290.html",
      "state": "IA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c05f3",
      "summary": "4 bright white lights, house-size formation - on South Knoxville ridge. Stationary, then moving west along the entire ridge.",
      "city": "knoxville",
      "shape": "diamond",
      "date": "2012-12-20T00:00:00",
      "story": "4 bright white lights, house-size formation - on South Knoxville ridge.  Stationary, then moving west along the entire ridge. 4 bright white lights up on View Park ridge, South Knoxville - configured in a large house-size shape.  We were about 0.3 miles to the north at a lower elevation.  Noticed the stationary lights and thought they were perhaps Christmas lights, in a triangle/ diamond formation - but they were in an odd location, not a residential area.  Then the lights lifted and moved west along the entire ridge.",
      "link": "http://www.nuforc.org/webreports/095/S95108.html",
      "state": "TN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0609",
      "summary": "Half Red / Half Orange Sphere hovering in Knoxville TN",
      "city": "knoxville",
      "shape": "sphere",
      "date": "2013-02-18T00:00:00",
      "story": "Half Red / Half Orange Sphere hovering in Knoxville TN It was 6am, 2-14-13. The sky was still completely dark.  My bedroom which is on the 2nd floor filled with a bright light coming from outside.   I looked out my window and about 30 feet from me there was a solid bright sphere which was half orange and half red hovering 8-10 feet above the road.   You could cut a verticle line down the middle to separate the two colors.   The orange stayed on the left and red was on the right.  It was so bright that it was hard to look at it for more than a couple seconds at a time. It continued to hover to a height of 18-20 feet off the road and travelled away from me until I could no longer see it.   Total time watching it was about 10 seconds.  The ball was approximately 3 feet in diameter.",
      "link": "http://www.nuforc.org/webreports/096/S96311.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c079d",
      "summary": "We saw a small object the size of a car shaped like a jet that hovered near the ground in 1949 or 1950.",
      "city": "knoxville",
      "shape": "other",
      "date": "",
      "story": "We saw a small object the size of a car shaped like a jet that hovered near the ground in 1949 or 1950. On a Sunday after noon in rural Burlington area of Knoxville, Tn., my little sister and I were in the front yard playing with acorns.  It had rained that day and finally stopped.   We heard a loud noise and saw a thing in the shape of today's stealth jet.  It was silver, with black windows.  It was the size of a medium size car and was able to maneuver in a small area as we were in an area with lots of trees and another small house near by.   It came low, close to my little sister and hovered.  I was on the steps of the front porch and she was in the yard collecting acorns.  I thought it might take her.  Neither of us moved.  We felt no wind or any thing.  I don't remember it being too loud at that time.  It stopped for a time then whooshed away in same direction it came from.   We ran in and told every body about it.  They paid no attention.  We went across the street and talked to a neighbor lady.  She said she heard a noise but may have just said that to make us feel better.  If the two of us had not seen and remembered it, I would think I dreamed it.   We remember it pretty much the same.  My sister was frightened to be alone for a long time.  It was before TV and I only knew it kind of resembled my cousins toy jet.  I had never really seen a jet or even an airplane at the time..   I'm not positive about date as it was years ago, but my sister was not yet in school, and we think it was 1949 or early 1950s.  We wondered if any one else ever saw such a thing.  It stays in our memory fresh like the memory of Kennedy's death. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107738.html",
      "state": "TN",
      "duration": "~15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a86",
      "summary": "Myself and a friend was traveling north on whittle springs roads. As we approach the stop at the corner of edgewood. We both notice thi",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2014-02-21T00:00:00",
      "story": "Myself and a friend was traveling north on whittle springs roads.  As we approach the stop at the corner of edgewood.  We both notice this \"craft\" in the sky right over the intersection.  It was triangle in shape and massive in size.   It was very close to the ground..I would guess maybe 400 yards.  It was so close and so massive I could see the detail i the ship.  It did not look like it was made of metal,  It look more like it was made of some sort of stone and had hieroglyphic type symbols on the base with round bright lights underneath them.   My friend stops the car as we both have our head out the windows observing,  I would guess the whole incident lasted about 1 min.  Hard to say because it was almost like we was under a trance as we look but was prob just in shock.   I remember we pulled into the parking lot about 30 feet away to get out of the car and the \"ship\" started to move very slowly heading east.  I never seen the ship fly off though, it moved east slowly and then just was not there anymore.  We have told very few people about this over the years in fear.  But if anyone else remembers seeing this in the Knoxville area around that time please note.",
      "link": "http://www.nuforc.org/webreports/107/S107280.html",
      "state": "TN",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fb4",
      "summary": "Yellow Orange Light Shot Across Sky.",
      "city": "knoxville",
      "shape": "light",
      "date": "2014-01-16T00:00:00",
      "story": "Yellow Orange Light Shot Across Sky. Overcast evening on the 10th of Jan, bright flash of pulsing yellow orange light ripped across the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106180.html",
      "state": "TN",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c1120",
      "summary": "Approx. 7-8 orange orbs flew in arc above Knoxville, Tennessee, 11/1/2013",
      "city": "knoxville",
      "shape": "oval",
      "date": "2013-11-11T00:00:00",
      "story": "Approx. 7-8 orange orbs flew in arc above Knoxville, Tennessee, 11/1/2013 Around 10 or 10:30 p.m. Friday, Nov. 1, 2013, I was walking my dog in my parents' yard in West Hills.  It was a clear night. I looked up and saw about 7 or 8 orange orbs in the sky.  They flew silently and in such even formation that it was as if they had a string attached between them.  They arc'ed up, but not too high in the sky, flying south. My father and mother were in the yard and also saw the flying objects.  When we got inside the house, Dad called the local newspaper to see if anyone else had reported the flying objects, but no one had.   A few days later, I called the airport traffic control center.  They don't handle this kind of thing and suggested calling the UFO hotline.  That's how I came to this site.",
      "link": "http://www.nuforc.org/webreports/104/S104252.html",
      "state": "TN",
      "duration": "not sure"
    },
    {
      "_id": "64d005f478aba2ec5a3c136a",
      "summary": "Four redish pink balls of light traveling very slow in a straight line then turned to east and disappeared.",
      "city": "knoxville",
      "shape": "light",
      "date": "2013-12-02T00:00:00",
      "story": "Four redish pink balls of light traveling very slow in a straight line then turned to east and disappeared.",
      "link": "http://www.nuforc.org/webreports/104/S104843.html",
      "state": "TN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c18f6",
      "summary": "3 Bright orange lights in triangular formation moving 20 mph (no sound).  Seen by 12 people, directly in front of us.",
      "city": "knoxville",
      "shape": "light",
      "date": "2014-07-11T00:00:00",
      "story": "3 Bright orange lights in triangular formation moving 20 mph(no sound).  Seen by 12 people(directly in front of us July 4th, 2014 @22:45(Eastern)   I, my family, and several other witnesses were out in the parking lot shooting off fireworks when we noticed 3 brightly glowing orange lights suddenly appear out of nowhere.  They were moving at a rate of about 20 mph in a triangular formation.   There was no sound.   As they moved higher up in the sky, they began to form a straight line when, just as quickly as they appeared, they disappeared. These orange lights just appeared out of nowhere, almost like they just rose up from the neighbor’s backyard.  It was the craziest thing I have ever seen in my life!!!!   I’ve watched TV with people on there with their footage talking about the experience, but to actually experience it on my own is on a completely different level.   My son took footage on his cell phone.  I will try to include it.",
      "link": "http://www.nuforc.org/webreports/111/S111261.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c20d6",
      "summary": "10 orange lights in formation vanished in a matter of seconds.",
      "city": "knoxville",
      "shape": "formation",
      "date": "2014-05-02T00:00:00",
      "story": "10 orange lights in formation vanished in a matter of seconds. At 20:45 in the eastern sky of fountain city my wife and I witnessed approximately 10 orange lights hovering over the tree line in a staggered formation.  In about 5 seconds the formation completely shifted around as the objects moved up and down and back and forth.  In a matter of two minutes each individual light vanished without a trace.   I work for the Knoxville police department and my wife is in the military, we know a normal aircraft when we see it and this was definitely not something we had seen before.",
      "link": "http://www.nuforc.org/webreports/109/S109016.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2492",
      "summary": "Green and red light falling downward and then out of sight at a very fast speed.",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "Green and red light falling downward and then out of sight at a very fast speed.",
      "link": "http://www.nuforc.org/webreports/115/S115121.html",
      "state": "TN",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c254a",
      "summary": "Several UFO's in Knoxville Tennessee; included is a military helicopter.",
      "city": "knoxville",
      "shape": "formation",
      "date": "2014-11-06T00:00:00",
      "story": "Several UFO's in Knoxville Tennessee; included is a military helicopter. I looked up and saw something falling from the sky that looked like a fireball at first as I continued to look at the object it changed shape then a long disk shaped object approached it from the east at the same time another disk shaped object approached from the west along side this there was a smaller object that was oval and lit up red appeared and disappeared then all the objects vanished except for the one that appeared to be on fire falling slowly and at that moment a military helicopter flew close to this thing falling from the sky I heard no noise from any of the objects except for the helicopter when all of this was happening hundreds of bats were flying around acting crazy I've lived here five years and never saw one single bat until this also all of the dogs in my neighborhood were howling and freaking out and I heard a lot of car alarms going off all at once my husband and his brother both saw all of this I have pictures of the crafts on my phon! E",
      "link": "http://www.nuforc.org/webreports/115/S115102.html",
      "state": "TN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2678",
      "summary": "4 lights seen.",
      "city": "knoxville",
      "shape": "light",
      "date": "2014-10-03T00:00:00",
      "story": "4 lights seen. 2 lights were vertical in sky.  They were not moving. There was a larger light flashing red blue and green to the right of them.   There was a slow moving light that made its way under the two lghts and they just stood still in a vertical line.   Unsure of how long they appeared.",
      "link": "http://www.nuforc.org/webreports/113/S113919.html",
      "state": "TN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c2697",
      "summary": "Glowing Red Object in the Night Sky.",
      "city": "knoxville",
      "shape": "oval",
      "date": "2014-10-03T00:00:00",
      "story": "Glowing Red Object in the Night Sky I was standing out on my patio looking up at the sky. I love looking at the sky at night.  I saw something moving across the sky, going west, at maybe 1500 to 2000 feet above tree level. It was oval shaped, and it was a glowing red color.  It moved in a smooth fashion, straight, and there was no sound at all. I yelled for my wife and son who came out and saw it, as well.  We watched it for about a minute before we couldn't see it anymore due to trees and buildings. I don't drink, don't do drugs, and I've never seen anything like that before.",
      "link": "http://www.nuforc.org/webreports/113/S113879.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c26b3",
      "summary": "Nightly sighting increasing in # and drawing closer - 6 stationary/white lights and 3 in motion red lights sporadic jerking in motion",
      "city": "knoxville",
      "shape": "light",
      "date": "2014-10-03T00:00:00",
      "story": "Nightly sighting increasing in # and drawing closer - 6 stationary/white lights and 3 in motion red lights sporadic jerking in motion I have been experiencing nightly occurrences since Sept 12th with the exclusion of Sept 24th. - between the hours of 2:30 - 6:00 am  I am concerned or rather frightened at this point,  last night the number increased from 2 - 9 ( 6 stationary white lights circling / 3 flying in from the west with red lights)  The flight pattern was sporadic almost a jerking in motion  They are closer then ever and almost seem to be focused in on me.  I would have reported this earlier but to be perfectly frank I had no idea who to contact and honestly was questioning what I was seeing.   I have more information but its almost too crazy to put in writing.  I am afraid for my safety.",
      "link": "http://www.nuforc.org/webreports/113/S113917.html",
      "state": "TN",
      "duration": "2.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c2936",
      "summary": "Orange ball of light disappeared and reappeared in cloudless parts of the sky three times before we lost it.",
      "city": "knoxville",
      "shape": "circle",
      "date": "2014-12-05T00:00:00",
      "story": "Orange ball of light disappeared and reappeared in cloudless parts of the sky three times before we lost it. Driving down I-40 West we saw a higher than usual amount of planes flying in the sky.  All of the planes had jet streaks trailing out behind them, but then we saw an orange ball of light moving across the sky among them without streaks behind it.   It disappeared and reappeared in cloudless parts of the sky three times before it finally disappeared for good.",
      "link": "http://www.nuforc.org/webreports/115/S115755.html",
      "state": "TN",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d0a",
      "summary": "Bright White 2 Dimensional Circle intercrossing Jets flying in single file on sunny day.",
      "city": "knoxville",
      "shape": "other",
      "date": "2014-09-18T00:00:00",
      "story": "Bright White 2 Dimensional Circle intercrossing Jets flying in single file on sunny day. My husband and I were sitting on back porch when 2 jets passed over in front of us. We watched them go Eastward.  I kept watching them and following the jets with my eyes and head and could still hear them as they went by us and now I could see their tail ends, when all of a sudden a white flat circle that was brighter than the white clouds flew across (intercrossed) the tail ends of the jets.  My husband quit watching the jets as they had crossed over him.  He just slightly turned his head to watch them.  The jets were flying one behind the other keeping perfect spacing between each other.  I followed the bright white circle until it went behind a tree that obstructed our view.  The white Circle didn't go behind the tree on purpose, it was just a big tree that was on the side of the house that blocked my view.    My husband watched me stand up and follow the circle with my eyes and he turned to see what I was looking at and pointing at, that's when our view was ob! structed by our tree. The circle was flying as fast and steady as the jets and was very high in the sky. It was a perfect circle, brighter, whiter than a cloud. It looked flat almost like a orb dancing in your vehicle from jewelry or a watch that the sun reflected off of.  The circle didn't fly behind the tree on purpose it was just a big tree beside our house that blocked our view from seeing the circle any longer.  The circle was moving as fast and steady as the jets and was very high in the sky. There was no sound from the circle.  I don't know if the circle came out from a cloud next to the jets or where it came from.  I just began seeing it come from the right side going to the left side of the back end of the jets.  It was a sunny day.  Yes, there was some clouds but sun was shining and the wind was blowing.  My husband didn't see it because he didn't react fast enough and the tree obstruction didn't help.",
      "link": "http://www.nuforc.org/webreports/113/S113635.html",
      "state": "TN",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f62",
      "summary": "cigar shaped object pulsating brilliant white light.",
      "city": "knoxville",
      "shape": "cigar",
      "date": "2015-06-15T00:00:00",
      "story": "cigar shaped object pulsating brilliant white light I was out watering my lawn, when I looked up and noticed a cigar shaped object flying in a NE direction.  There was noting else in the sky.  The sun was already down on the horizon but it was still light outside (dusk).   After watching about 2 seconds, the object lit up and \"glowed\" very white.  This object had a distinct dark line in the middle of the craft and when it first \"glowed\" the front half of this thing appeared to glow first followed by the rear end of it following.  The whole craft was illuminated and it went back to the original finish that appeared to be something like an airplane.  It pulsated twice now with both ends illuminating at the same time.  The dark line in the middle stayed dark.   I turned toward the west to see if there was anyway that it was reflecting the sun but the sun wasn't even above the horizon and had it been reflecting the sun it would not have been such a brilliant white light.  It was traveling faster than I hav! e witnessed airplanes traveling. I witnessed another cigar shaped object in the identical place in the sky a few years ago, but it never \"illuminated\" like this one.",
      "link": "http://www.nuforc.org/webreports/119/S119559.html",
      "state": "TN",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4643",
      "summary": "A white triangular shaped object flew over 25 ft from the ground.",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2015-11-12T00:00:00",
      "story": "Myself, and my husband were outside watching the asteroid show. This was supposed to be the big night.  We had watched for a week now, and this so far, had been the best night at seeing the shooting show.  We were facing true NORTH, in our front yard, practically laying down.  We live in the country, away from lights.  My husband jumped up to check some traps on the other side of the property.  As I continued to look up, right over my head a white triangular shaped object flew over 25 ft from the ground. No noise no lights, I screamed \"do you see that\" twice, screaming.  I watched as it flew to the Nort/east direction. Maintaining its level with the ground.  I couldn't believe it. Explained it over and over. Husband said it was a droid probably, he don't believe it was solid. It was a solid triangular shape, sort of like a Chevron-like.  About 3.5 feet across the widest part.  I saw it.",
      "link": "http://www.nuforc.org/webreports/123/S123876.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c27",
      "summary": "2 blinking red lights, no sound. Moved slowly east, disappeared and a comet like light shot out of the cloud.",
      "city": "knoxville",
      "shape": "formation",
      "date": "2015-09-25T00:00:00",
      "story": "2 blinking red lights, no sound. Moved slowly east, disappeared and a comet like light shot out of the cloud Sitting on front porch having a conversation, when I looked up and noticed 2 red lights sitting in the sky towards the east.  As I told my friend to look up I noticed they were moving very slow.  As they progressed towards the east they moved as if they were connected by something, and the two lights were sort of rotating on a large axis, not independent. They both blinked, like the red lights on a tower.  Same speed, same intensity.  At this point I thought it was 2 helicopters chasing eachother, but they moved too slow and there was no sound.  One blinked red, the other red with very faint white lights in between each blink.  As they continued to slowly move east they started to fade.  Once they began to fade they seemed to spread apart, as if they were two different crafts afterall.  The very moment they disappeared into the clouds a bright comet like light shot out from the same spot into the opposite direction, directly over head. To add the this, once I went back inside to use my phone, none of my apps worked, as if I had no signal or WiFi connectivity.  But all signals were good. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122226.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e10",
      "summary": "UFO on Chapman Hwy Knoxville, TN.",
      "city": "knoxville",
      "shape": "circle",
      "date": "2015-08-13T00:00:00",
      "story": "UFO on Chapman Hwy Knoxville, TN We were driving down the highway when we saw  this large circular object with large flashing red and green lights and a concaved center just hovering about 20 above the street light.   I pulled over right under it.  It had such a loud hum that my van was vibrating.  It just sat there for a couple of minutes then took off super fast.  Hovered there a minute then started coming back towards us.   I had grabbed my phone and took video footage.  The lights shown white in it.",
      "link": "http://www.nuforc.org/webreports/120/S120974.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e1e",
      "summary": "Light in the north direction, 40 degrees above horizon, very slowly alternating colors.",
      "city": "knoxville",
      "shape": "light",
      "date": "2015-08-27T00:00:00",
      "story": "Light in the north direciton, 40 degrees above horizon, very slowly alternating colors. Observed a light, rather bright, but not much larger in apparent diameter than a star or planet, that was clearly changing colors, alternating white, then reddish and greenish, yellow/blue, alternatively, but not at all in the \"blinking\" fashion of an airplane.   Color changes were much slower, changing color every second or so.  The light was \"scintillating\" or pulsing, which could have been caused by the slight wind as well.  It was visible in the North-North-West direction, about 40 degrees above the horizon.   It was moving slightly, slowly, apparently going further in the north direction, and/or lower toward the horizon.  It became hidden behind trees after about 10 minutes of observation.  I called two of sons to observe that with me.   I tried to take pictures/movies with iPhone but the pictures do not show anything.  It could be a distant airplane but I was very surprised by the pace and diversity of changing colors.",
      "link": "http://www.nuforc.org/webreports/121/S121486.html",
      "state": "TN",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e75",
      "summary": "Saw a very high, black louvred rectangular object headed from S to N at cloud level, over South Knox County.",
      "city": "knoxville",
      "shape": "rectangle",
      "date": "2015-08-13T00:00:00",
      "story": "Saw a very high, black louvred rectangular object headed from S to N at cloud level, over South Knox County. I was about to start sunbathing.  Temp was about 87, partly cloudy day in South end of Knox County.  As I noticed a huge high cloud came across the sun, my eyes focused on something rectangular shaped, at the edge of the cloud height. The object appeared to have a louvred appearance, much like that of a laundry room door or the kind of windows one sees on older homes in a beach area--louvred.  The object appeared to be black, and was headed due North in direction.  It wasn't blown on the wind, in a \"wafting\" type direction, it was on a steady path.  No variation in its path, as I said, just at the edge of the lower level of a white cloud and at that height, it would've had to have been easily 50x100 ft, but looked really tiny from the ground.  To place perspective, when we see a jumbo jet pass near a cloud, it looks like a period on a huge paper.  This object had to be approximately the same dimension, as it was cloud level, just under a huge cloud blocking the sun, had louvres, and was black. I could see that half the louvres went in one direction, the other half in the opposite direction. Very perplexing, and moving quickly.  I couldn't begin to estimate speed, but I know it was definitely going pretty fast, kept its height (no sinking) and kept going due North.  It came from the direction of Maryville and crossed the sky heading toward the NE side of Knoxville City, across the sky. I've never seen anything I could compare it to, except one of those old louvred type doors with horizontal slats running back and forth across the height of the door...matter of fact, that was my first thought when I looked up and focused on it. There's an air-base in Maryville, approx 15 miles from here as a bird flies, but there's no way anything could gain that altitude from lifting off there.  There's an AirForce base there, too. ((ADDENDUM FROM WITNESS)) Ah! Sorry, it was absolutely Aug 10th.  I wonder if it could've been some type of low satellite or drone, perhaps?  Maybe something from Google maps...?  Perplexing. If you do find out anything, or hear of similar reports, keep in contact.  Thanks much! ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/121/S121062.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5251",
      "summary": "Large triangular metal object hurling through the sky.",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2016-01-29T00:00:00",
      "story": "Large triangular metal object hurling through the sky. At approximately 14:00, I was on my back deck.  I saw a triangular shaped metal object moving at a high rate of speed.  It looked like a silver more streamlined Stealth bomber.  It was tumbling end over end, the \"bottom\" was flat and shiny like chrome and the \"top\" was dull and bulged out in the middle like a cockpit.  Other than that there were no remarkable details that I could see.  The object was moving northeast.  There was no smoke trail or other trail behind the object.  Because of its velocity, I moved indoors because I was afraid there might be a sonic boom.   There was no boom in my area, but I saw on Twitter last night that there were sonic booms heard in parts of the northeast shortly after I saw this object (confirmed by USGS).  It had to have crashed somewhere; it was spinning out of control. I was by myself.  As a hobby I keep my eye on the sky observing airplanes, satellites, astronomical objects, cloud formations, etc.  I've seen mid-air refueling, Air Force One, satellites, and \"shooting stars\" from my deck, but this is the first time I've seen something I can't explain.",
      "link": "http://www.nuforc.org/webreports/125/S125501.html",
      "state": "TN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5391",
      "summary": "I was driving to work last night when I saw a flash of light streak across the sky and then disappear.  I was heading southwest.",
      "city": "knoxville",
      "shape": "flash",
      "date": "2016-01-14T00:00:00",
      "story": "I was driving to work last night when I saw a flash of light streak across the sky and then disappear.  I was heading southwest and the object was to my left heading in a downward direction.  I could not see the source of the light but it was a blue flash of light so bright it almost appeared white in color.",
      "link": "http://www.nuforc.org/webreports/125/S125250.html",
      "state": "TN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5514",
      "summary": "Short, cylindrical craft that gleamed like a star, was illuminated briefly by the sun, and disappeared",
      "city": "knoxville",
      "shape": "cylinder",
      "date": "2015-12-10T00:00:00",
      "story": "Short, cylindrical craft that gleamed like a star, was illuminated briefly by the sun, and disappeared Date:  December 8, 2015 Time:  5:15 PM, Eastern Standard Time   Place:  Knox County, Tennessee  Object was seen while this witness was driving westbound. It looked like a star at first, gleaming, but not huge in the sky. Then it turned towards my left (its right) and looked like some kind of craft. It was not a jet plane.  It looked more cylindrical. The waning sunlight allowed a brief observation. Then it simply disappeared. Amount of time observed:  Maybe 10 seconds; 15 seconds max. There were several jets in the sky at the same time. Their contrails were visible.  This object had no contrail. In fact, there were three jets to the right (north) of this object, all with contrails. From the point of view of this witness, the three jets looked to be almost stacked in the sky. Then this witness had to make a turn onto a road heading north. When lack of trees allowed, I did glance over towards the area. All I saw were jet planes, maybe 8 or 9 of them going different directions. No sign of the object. Thank you very much.  Have a great day.",
      "link": "http://www.nuforc.org/webreports/124/S124587.html",
      "state": "TN",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bd5",
      "summary": "Triangle craft with escort.",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2016-04-15T00:00:00",
      "story": "Triangle Craft with escort. 2 Craft.  Heading due south, slow speed Front Craft was triangle shaped.  Large red slow flashing light toward center rear, Small blue white lights on the corners with 3 moreon the nose section non blinking.   2nd Craft following directly behind was a straight row of lights,  2 bright white strobes on the ends with 2 red flashing in the center.  No noise.  elevation about 5 thousand feet.  Partly cloudy skies. ((NUFORC Note:  We spoke via telephone with the witness, and he sounded to us to be quite serious minded.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126837.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f17",
      "summary": "Yellowish circular object moving in same region of space for more than three hours.",
      "city": "knoxville",
      "shape": "circle",
      "date": "2016-10-27T00:00:00",
      "story": "Yellowish circular object moving in same region of space for more than three hours. On the night of May 19, 2016, I observed what I thought was a satellite moving cross the sky until the object ceased moving in the approximate region of the stars Altair and Tarazed.  The object then began moving in a random zig-zag motion while staying in the same region of space.   I observed this for approximately 30 minutes before getting my camera to film and video tape the object.   Over the course of three hours I watched and took approximately 30 pictures and 10 minutes of video before clouds moved in and obscured my view.  The object is circular and orange in color.   When magnifying the image the object takes on the color spectrum ranging from orange, yellow, green, and purple.",
      "link": "http://www.nuforc.org/webreports/130/S130833.html",
      "state": "TN",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f63",
      "summary": "Bright stationary lights in Knox County, Tennessee.",
      "city": "knoxville",
      "shape": "light",
      "date": "2016-11-04T00:00:00",
      "story": "Bright stationary lights in Knox County, Tennessee. Two stationary bluish white lights appearing as rapidly brightening stars (much brighter than Venus) were noticed at approx 40 degrees elevation while setting up my telescope.  One object was 2-3x brighter than the other.   These lights were separated by about a full moon's diameter( 0.5 degrees) and gradually brightened and then faded from visibility.  Definitely not a satellite or Iridium flare.   I am an avid skywatcher and have never seen anything like this.  The \"stars\" were rock steady in the sky.  I was unable to snap a photo before the objects faded away. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130909.html",
      "state": "TN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6075",
      "summary": "Bright orb over Knoxville, TN.  9/16/2016.",
      "city": "knoxville",
      "shape": "light",
      "date": "2016-09-22T00:00:00",
      "story": "Bright orb over Knoxville, TN.  9/16/2016. This morning, after arriving to work I stepped out to smoke.  I was watching a plane fly by pretty low in the sky just as the sun was coming up.  I noticed behind the plane what looked like a bright star.  Slowly rising straight up into the sky.  It was far to daylight to be a star.  I ran inside to grab a friend and upon arriving again to look the object was gone.",
      "link": "http://www.nuforc.org/webreports/129/S129950.html",
      "state": "TN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6113",
      "summary": "Two slow-moving red lights, flashing in unison, in a loose, staggered formation.",
      "city": "knoxville",
      "shape": "unknown",
      "date": "2016-10-27T00:00:00",
      "story": "Two slow-moving red lights, flashing in unison, in a loose, staggered formation. On 26OCT2016, at approximately 2315 EDT, I heard several instances of noises coming from outside of my house.  The noise that most caught my attention was similar to someone riding a skateboard on pavement but was accompanied by a notable amount of low frequency energy as a steady drone, no rhythmic interruptions, just a Doppler effect as through passing slowly by my observation point.   After the third such occurrence in an estimated 15 minute window, I exited my house and attempted to locate the source of these aural events.  Upon looking to the northeast sky, I observed two slow moving, flashing red lights in what appeared to be a loose, staggered formation traveling away from my location in a northeast direction.   The lights pulsed with only a saturated red color in a slow, steady pattern, similar to a communications tower at night.  They were quite intense, despite the perceived distance but were not blinding--certainly brighter than any aircraft I've witnessed.  The lights also flashed in perfect unison with each other but, given the distance separating them in the sky,  I have no reason to believe they were in fact attached to the same craft.   The only sound witnessed as they departed was a low frequency rumble similar to that of a distant freight train, or high powered jet engine.",
      "link": "http://www.nuforc.org/webreports/130/S130851.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6226",
      "summary": "huge yellow/orange  bright light immobile for 20 seconds, reversed and sped forward behind our house, made absoultly no sound and trave",
      "city": "knoxville",
      "shape": "circle",
      "date": "2016-09-09T00:00:00",
      "story": "huge yellow/orange  bright light immobile for 20 seconds, reversed and sped forward behind our house, made absoultly no sound and traveled faster than any known human engineering.   i so want to see that another caught this object and recorded it. one cannot explain what another individual witnesses. either people of the unviserse or our military is awesome..",
      "link": "http://www.nuforc.org/webreports/129/S129655.html",
      "state": "TN",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c63da",
      "summary": "Circle in yard.",
      "city": "knoxville",
      "shape": "",
      "date": "2016-08-25T00:00:00",
      "story": "Circle in yard On October 19, 2016, about 6:30 am, I was taking out the trash to be picked up, and in my back yard was a circle about 14 feet in diameter. Almost half the circle was under a tree.  The ground wasn't burned but there was a substance there that I had never seen and couldn't determine what it was.  It is a dark brownish and powdery substance. I touched it and I was able to wash it off my hand easily and it had no smell.  I didn't think about taking a sample until it started to rain and I thought it would be gone but when I went back to it, the rain hadn't washed it away.  I took a sample with a paper towel and picked some of the grass. It clings to the grass in a peculiar way, like nothing that I have seen.  A couple of years ago, a friend that lives about 15 miles away had something similar in her yard but in the circle there were imprints in the ground like something had sat on the ground.  The grass in that area died.",
      "link": "http://www.nuforc.org/webreports/129/S129371.html",
      "state": "TN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c63de",
      "summary": "UFO Fleet of bright green star-like orbs photographed while traveling across downtown Knoxville.",
      "city": "knoxville",
      "shape": "light",
      "date": "2016-08-29T00:00:00",
      "story": "UFO Fleet of bright green star-like orbs photographed while traveling across downtown Knoxville. I was exiting a restaurant with a friend on Gay Street on 8/19/16 at 8:49 pm in Knoxville TN.  As soon as we stepped out onto the street, I looked North (with my I-Phone 6 in hand) and I was overwhelmed by the sight of a very strange cloud formation.  It had three plumes jetting out of it and there was a ceiling of another cloud above it.  It was so surreal and I said to my friend, “I’ve never seen anything like that before in my life!”   At that moment, I had a strange feeling that gave me a sense of it being “other worldly” and it gave me an odd looming feeling. (It should be noted that I was and still am, completely sober.)  Anyhow, I started taking photos of this strange cloud and realized that I had it set on “square” photo and then I switched it to “regular” photo after a few shots (just to explain the difference in layout).  My friend was ready to go and stroll Gay Street, so I turned around on my heels and hopped in the street (as I often do) to take more photos of Gay Street looking South towards the Tennessee Theatre and the river.  So I snap, snap, snap, etc. and then hop back on the sidewalk and take a couple more shots after that. During my photo blitz, I was more focused on looking through my phone-camera than I was on looking at the sky, so I didn’t pick up the details that I had shot until I got home (about an hour and a half later).  As I flipped through the evening’s shots, I could clearly see something in the sky of one of the shots and when zooming in, I discovered that I had photographed a Fleet of bright green UFO’s!  Of course, I then took a much closer look at the photos before and after this particular shot and discovered that I had tracked this Fleet coming out of the clouds (near a mountain which is lined with radio towers) and seconds later, they were on the opposite side of the sky over the Tennessee River.  In the next to the last shot, you can see two domed lights on top of the mountain (across the river).  NOTE:   There are no lights on top of this mountain and the lights are not seen before or after the incident.  Then in the last shot, you will notice the same two dome lights lifting off into the sky and there is also an orb-type UFO faintly seen in this shot as well. The last shot was taken out of series at 9:14 pm. (I think I just happened to catch them again while they were “taking off”).  None of my photos before or after this series of Gay Street shots, show anything in the sky, nor specs on the lens, etc.  I still have all these photos on my phone and I am happy to show anybody who would like to see the original shots so you can verify the time, date and that I have not retouched these in any way.  I have only emailed them to myself and saved them to my desktop to put a slide show together which I shared on my FaceBook page. I should also mention that I have had Close Encounters (of several kinds) numerous times throughout my life.  However, this is the first time that I have ever managed to take photographs of the visitors.  Not that it means much to those who don’t know me but I’m a very logical person, a respected professional in my industry (fine art painting) and a “normal” 49 year old mother.  I hope these photos help open some minds on the topic. Also to note:  In one of the photos, the glowing green orb heads towards me and is photographed from about 10 feet from me near the sidewalk.  Also, when I zoomed in on these photos, each of the anomalies appear to have a 6 pointed star-like glow and each have a hue of violet/rose colored aura around them.",
      "link": "http://www.nuforc.org/webreports/129/S129527.html",
      "state": "TN",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6af0",
      "summary": "triangular shape hovered over our heads",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2017-02-03T00:00:00",
      "story": "triangular shape hovered over our heads I was watching a tv show earlier about ufo sightings and I found it quite interesting due to the shape of the ufo and the dates of similar sightings...around 1989. You see, around 1989 my brother and I both saw a ufo. Basically, we were standing at the bottom of my cousin's driveway (In Knoxville, TN), waiting for the school bus.  It was always our waiting spot so we were standing there waiting for our cousin's to walk down the driveway.  It was your average morning when my brother and I just looked up and saw this ufo hovering just a few feet right above our heads.  It's an event I'll never forget because that night I dreamed the ufo shot rays down at my brother.   My memories are vague to two brain tumor surgeries I had a few years later but I asked my brother about it years later.  He said it was triangular shaped and had lights all around the bottom of it.  I know there was no noise whatsoever nor was there any wind.  It was just the huge, silent thing above our heads... In my excitement,I ran up the driveway to meet my cousin's shouting, \"Did you see that?\" The reply was,\"See what?\"  I turned around and walked back down the driveway to my brother where I asked him, \"Where did it go?\"  He simply said,\"It just flew away.\"And that was that. The reason I'm writing now is because I saw the show on the tv and they said there were several ufo sightings around 89, which was or was about the same year we saw it AND it was triangular shaped too.. We never really told anyone about it except for my cousins and family.  My parents never believed us and still don't.  My cousin believes me although she didn't see it.  I just wanted to tell someone ....Thanks for your time… ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132384.html",
      "state": "TN",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6df4",
      "summary": "Approx. 02:30 a.m., saw a green fireball, with a bright yellowish-center, and a white tail, falling diagonally.  ((anonymous report))",
      "city": "knoxville",
      "shape": "fireball",
      "date": "2017-09-05T00:00:00",
      "story": "A co-worker and myself, approximately 02:30 a.m. on lunch break...saw a green fireball, with a bright yellowish-center, and a white tail, falling in a diagonal direction \\\\\\\\\\ straight to the ground, I'd guess less than a mile, right behind a small ridge in the landscape in front of us… we both said \"you saw that, right...?\"   We BOTH got goosebumps, and I still do when I think about it, cause I know what I saw and I knew my co worker saw it too… ((NUFORC Note:  Possible meteor, we suspect.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135951.html",
      "state": "TN",
      "duration": "1 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c75d9",
      "summary": "Large black rectangle, silent, 2 red rectangle lights on the rear, no other lights, very slowly circled my property, 4 witnesses.",
      "city": "knoxville",
      "shape": "rectangle",
      "date": "2018-01-12T00:00:00",
      "story": "Large black rectangle, silent, two red rectangle lights on the rear, no other lights, very slowly circled my property,3 other witnesses Me and three other people were setting inside my single wide mobile home on my 11 acres of land.  We were talking when I heard a very soft (all most inaudible) hum.  Recently, tornadoes had gone through my county and I was quite weary of storms so I walked to my back door and opened it to check the weather.  There was no sound outside but a lot of cloud to cloud lightning in the distance.  I stood there a moment and noticed something moving above my tree line (A hundred yards or so away).  I couldn’t see it very well at that moment just a black silhouette against the lightning in the back ground (no thunder).  It was shaped like a black domino, the size of a few football fields, floating silently, horizontally at the speed of an ultralight, perhaps even slower but much bigger, its altitude must have been as high as two or three fully grown pine trees.  The object was directly in front of me traveling from my left to my right.  One of my friends walked over to me and ! I asked them what they thought it was.  After a moment watching it we could see the rear of the object (I’m assuming the rear since it was going away from us now) there were two red/orange lights like engines from a Star Wars movie, no glow just the color, like it was a red/orange sticker stuck to the rear (I don’t know if they were engines though) they were the complete height of the object which I’m guessing was about a two-story building.  As if you put your thumb in the center of a rectangle and to the left and right side of your thumb was red/orange light and where your thumb is it was black like the rest of the object.  My friend looked at me and we both agreed we never seen anything like that before (Warner robins air force base is about 30 minutes away so we see planes and the such all the time.)  We watched as it tilted 45 degrees like a plane banking left but it stayed on the same course it had been on.  We watched the back end of it (the engines) until it passed behin! d some trees (we could only make out the shape of the object with each flash of lightning in the distance of which there was an abundant amount).  Awe struck we walked back to the living room and started to explain to the two-other people hanging out what we just saw. I was ecstatic telling them how I’ve never seen anything like that before. A few minutes later (less then five) while we are describing the object I heard the same vague hum. I asked if anyone else could hear the hum, they could not. Excited I ran to the back door but there was nothing there, disappointed I walked around to the front of my mobile home to take a look and to my surprise there it was, a giant black rectangle moving very slowly, about 5 acres away, across my field, above more tree lines. Coming from my left to my right again (as if it had circled my property while we were inside). It was very large, completely silent (I could only hear the hum both times inside the mobile home). The object was horizontal again and I could see the front since it was so far to my left. ! There were no lights of any kind on the front, bottom and side. I watched it slowly crossing my field. A few minutes passed and I realized the other three had come out side and they were watching it, not saying a word. The object made a slow turn to the right (never banking) as if it was following a giant half circle. Realizing I was not alone and others were witnessing the same thing I began jumping up and down screaming “What the expletive is that? What is that? Do yall Expletive see that” No one said a word. We watched it for a few more minutes until it was going away from us and disappeared over another tree line, in the direction of Warner Robins Air-force Base that’s when we could see the rear and there were the red/orange engines again. It never made a sound and moved way to slowly to be able to stay in the air for its rectangular shape and size. Perhaps it was some weird blimp I’ve never seen before. The next day my friend that saw it the first time with me refused ! to talk about it saying over and over it was just a C-130, tho! ugh it m oved way to slow and C-130’s are super loud that close. The other two swore it was an alien craft (One friend, my future wife, claimed to be very frightened during the whole ordeal) which made me laugh (though it could have been, not doubting that possibility). I didn’t even think about aliens, I was thinking it was some piece of technology the U.S government had that we have not been told about yet, something similar to how people thought the stealth bomber years ago was an alien craft. I never felt endangered the entire time.  I just find it so odd that a day or two later my friend (that saw it with me first) was so reluctant to talk about the experience saying it was just a C-130 even though all the rest of that night he was flabbergasted as the rest of us.  That was in 2009, at the time of me writing this it is 2018 and I have never seen the object again. I apologize for the description being so lengthy. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138326.html",
      "state": "GA",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c781d",
      "summary": "((NUFORC Note:  Witness provides no information; elects to remain anonymous.  Hoax??  PD))",
      "city": "knoxville",
      "shape": "",
      "date": "2017-12-04T00:00:00",
      "story": "((NUFORC Note:  Witness provides no information; elects to remain anonymous.  Hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137449.html",
      "state": "TN",
      "duration": "Long"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b3d",
      "summary": "Irregularly shaped object slowly shrinks into nothing over I-40.",
      "city": "knoxville",
      "shape": "other",
      "date": "2017-11-09T00:00:00",
      "story": "Irregularly shaped object slowly shrinks into nothing over I-40. Was driving home with my girlfriend and I spotted what I thought was a large flag on a strangely tall pole from interstate 40.   It was irregularly shaped, and had an orange hue from the city lights maybe.  We looked at it for about 15 seconds and decided it was just a cloud.  That was until it began to get smaller and smaller over the course of 10-15 seconds before disappearing completely.",
      "link": "http://www.nuforc.org/webreports/137/S137154.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c8c",
      "summary": "Orange light passing over Knoxville at 20:50, Sept 24.",
      "city": "knoxville",
      "shape": "sphere",
      "date": "2017-09-28T00:00:00",
      "story": "Orange light passing over Knoxville at 20:50, sept 24 Orange light appeared between the moon and Saturn in the southwest. It showed up about two minutes after the ISS passed over.  Intensity was a bit brighter than the ISS but was about twice as large and orange colored.  It moved at about the same speed to the northeast directly overhead and did not strobe or blink like an airplane might.  After about a minute or two, the light disappeared.  It did not slowly dim like the ISS arid but rather winked out.  Looking at the small amount of video I took, I could not see the same color but did see a slight flash as it disappeared from sight.",
      "link": "http://www.nuforc.org/webreports/136/S136366.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c55",
      "summary": "White Flashing Light in the Sky Not An Airplane.  ((anonymous report))",
      "city": "knoxville",
      "shape": "flash",
      "date": "2017-10-05T00:00:00",
      "story": "White Flashing Light in the Sky Not An Airplane At around 9 pm (EST)my husband left to go to the store, and my son and I went outside because it’s a beautiful night out.  I’m always looking up at the sky, and tonight I see this thing that looks like a star, but it’s blinking, on and off.  It’s not moving like an airplane. But it did move.  I went inside to get my camera and when I came back out I couldn’t find it.  My son spotted it.  It had move higher up, but it still was not moving like an airplane would do.  And it was still blinking, on and off.  Flashing.  Blink. Blink. Blink. And it’s not like the twinkling of a star.  This was brighter, and a more pronounced flash, with a pause between the flashes. We went in around 20 minutes after 9 and it was still up there flashing at that time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136478.html",
      "state": "TN",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7eaf",
      "summary": "Six orange pulsating spheres moving across horizon and then slowly disappearing",
      "city": "knoxville",
      "shape": "other",
      "date": "2018-05-10T00:00:00",
      "story": "Six orange pulsating spheres moving across horizon and then slowly disappearing Observed 6 to 7 orange pulsating lights on horizon.  I was facing north and they were moving southeast.  One started moving down and then slowly disintegrated.  One by one they all slowly disintegrated.  This lasted approximately 5 minutes.  Each one looked like 2 glowing orange spheres joined together and pulsating rhythmically.   I kept trying to make sense of what I was seeing.  I checked with the national weather service and the wind was traveling 3 mph in a southwest direction at that time.   Please let me know if others have reported a similar sighting or if it is determined what these are.",
      "link": "http://www.nuforc.org/webreports/139/S139737.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f2b",
      "summary": "Four triangular craft seen stationary in the sky over South Knoxville, TN",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2018-04-26T00:00:00",
      "story": "Four triangular craft seen stationary in the sky over South Knoxville, TN Disclosure begins with me, right?  Here’s what happened:  It was a little before 6:00 PM on June 08, 2016.  I was leaving the Chapman Highway Big Lots in South Knoxville, TN.  As I recall, the parking lot was nearly empty.  I was alone.  It was sunny.  As I approached my car, I saw four white, triangular craft stationary in the sky to my right.  They were identical.  They seemed equally spaced as if in formation. I would estimate the encounter was between five and ten seconds.  I had enough time to notice the craft, process that they weren’t normal, retrieve my phone, access the camera, and take two pictures.  Yes, this story is corroborated with pictures. I cannot speak to how the craft moved.  I was distracted by my cell phone.  I heard nothing.  The encounter was silent.  They disappeared as suddenly as they appeared.  In the photos, the craft are definitely on the move.  They went from 0-gone almost instantly.",
      "link": "http://www.nuforc.org/webreports/139/S139520.html",
      "state": "TN",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f4e",
      "summary": "Silver and oval shaped UFO, that stayed in the same spot but was spinning.  It was higher than a passing plane.",
      "city": "knoxville",
      "shape": "oval",
      "date": "2018-05-04T00:00:00",
      "story": "Silver and oval shaped UFO, that stayed in the same spot but was spinning.  It was higher than a passing plane.",
      "link": "http://www.nuforc.org/webreports/139/S139704.html",
      "state": "TN",
      "duration": "15-320 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8205",
      "summary": "I noticed that there was a very bright blue colored star that I had never seen before.  ((NUFORC Note:  Celestial body??  PD))",
      "city": "knoxville",
      "shape": "circle",
      "date": "2018-01-25T00:00:00",
      "story": "I was just sitting on my front porch smoking a cigarrette when I looked at the sky as I normally do and I noticed that there was a very bright blue colored star that I had never seen before.  The more I watched, i noticed that it was moving, but very little.  It's altitude stayed pretty much the same but it was bouncing from side to side as if to steady.  The blue light is not star blue, rather, it appears LED.  But it is only blue, a perfect circle of blue emitted light.  For the past hour it has changed altitude and position slightly, but still in relative proximity.  My wife came out to watch and noticed yet another light within a couple of miles of the other.  Focusing in with a camera reveals that the light is luminated by what appear to be hundreds of small lights of different colors, yet primarily blue.  I have see an oval and one cone in my lifetime.  They were both hauling some serious ass.  These ones un-nerve me, because they are so stationary, in what seems a strategic distance apart.   If i could elevate myself in my current position, I fear that I would see more of them in a line.  This has been going on for an hour now, and they have yet to break position.  Pictures are unfortunately on my camera because my phone will not zoom in to that altitude..  Which says A LOT because six days ago I was able to zoom in on the FEMA cargo carrier that landed at McGee Tyson, and be able to identify it from 15,000 feet.",
      "link": "http://www.nuforc.org/webreports/138/S138527.html",
      "state": "TN",
      "duration": ">1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ff9",
      "summary": "I was driving down Westland dr at around 10:45 on my way home from work when I saw a extremely bright singular light in the sky above m",
      "city": "knoxville",
      "shape": "circle",
      "date": "2019-10-04T00:00:00",
      "story": "I was driving down Westland dr at around 10:45 on my way home from work when I saw a extremely bright singular light in the sky above me. It did not move at all from when I saw to when I drove past it, it wasn't very high in the sky to be a plane or a planet.",
      "link": "http://www.nuforc.org/webreports/149/S149425.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c90d8",
      "summary": "Something spotted over cathedral",
      "city": "knoxville",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "Something spotted over cathedral I was on top of a parking garage in Downtown Knoxville moon gazing and taking photos of the moon. I do believe I photographed a UFO slightly above cathedral downtown. Photographs will be emailed.",
      "link": "http://www.nuforc.org/webreports/150/S150634.html",
      "state": "TN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c920c",
      "summary": "I was driving on Kingston Pike near Cedar Bluff and saw a Triangular object hovering very close in sky with red and green bright lights",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "I was driving on Kingston Pike near Cedar Bluff and saw a Triangular object hovering very close in sky with red and green bright lights. I saw it from a distance and thought it was a plane,but it caught my attention because it was hovering and it's shape was odd and was a perfect triangular shape",
      "link": "http://www.nuforc.org/webreports/149/S149778.html",
      "state": "TN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9280",
      "summary": "Seen 2 odd lights moving from the west heading east. When it became aligned with my location it was extremely clear as a triangle rear",
      "city": "knoxville",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "Seen 2 odd lights moving from the west heading east. When it became aligned with my location it was extremely clear as a triangle rear with two lights linear off the point of the triangle rear. one light allumanited in the center of the triangle and turned off while passing by. The large object was completely silent and flew by slightly faster then a helicopter. I snapped 4 pictures.",
      "link": "http://www.nuforc.org/webreports/149/S149940.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c92f4",
      "summary": "Standing outside, seen an light anomaly.",
      "city": "knoxville",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Standing outside, seen an light anomaly. Seen what looked like a star, but it was blinking different colors, and then completely off, then different colors, then off, and did so for about 3 minutes before just not coming back on after it stopped the last time.",
      "link": "http://www.nuforc.org/webreports/150/S150157.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c96fe",
      "summary": "Several star like craft in line following each other across Knoxville l.",
      "city": "knoxville",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Several star like craft in line following each other across Knoxville l. I walked outside to get in my truck about an hour before sunrise when I happened to look up and noticed what looked like several stars in a row spaced out evenly. After a second look I noticed they were moving in a straight line headed southeast. I noticed at least 15-20 craft in a line but there could have been more that were out of sight. They weren’t moving crazy fast but I didn’t hear any sound or see any lights flashing like a normal airplane. It looked exactly like a bunch of satellites in a row going across the sky. They seemed to be fairly high in altitude. This looked like a possible military exercise although that would be strange due to the number of craft and lack of major military base near Knoxville.",
      "link": "http://www.nuforc.org/webreports/151/S151500.html",
      "state": "TN",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c98b5",
      "summary": "Two bright strobing lights were stationary and just blinking wildly until they seemed to dim out and fade away very fast. It seemed to",
      "city": "knoxville",
      "shape": "light",
      "date": "",
      "story": "Two bright strobing lights were stationary and just blinking wildly until they seemed to dim out and fade away very fast.  It seemed to me like they were both moving in a circular pattern at times but it could’ve been my eyes, but thought I would mention it anyways!!",
      "link": "http://www.nuforc.org/webreports/151/S151013.html",
      "state": "TN",
      "duration": "10 minutes"
    }
  ]
}