{
  "city": "laredo",
  "fetch_timestamp": "2025-07-12T14:35:34.871851",
  "record_count": 9,
  "pages_fetched": 0,
  "api_calls": 1,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4960",
      "summary": "Bright orange and red sphere that streaked directly overhead for about a mile. No sound. Aproxmently one mile from the ground and flyin",
      "city": "laredo",
      "shape": "sphere",
      "date": "2019-07-25T00:00:00",
      "story": "Bright orange and red sphere that streaked directly overhead for about a mile.  No sound. Approxmently one mile from the ground and flying completely horizontal.  This was a dark cloudy night and was well below the clouds.  Lit up in a streak of light at an amazingly fast speed.",
      "link": "http://www.nuforc.org/webreports/147/S147677.html",
      "state": "TX",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b7241",
      "summary": "Large \"V\" shape object over Laredo,Tx. 02-08-08",
      "city": "laredo",
      "shape": "other",
      "date": "2008-02-14T00:00:00",
      "story": "Large \"V\" shape object over Laredo,Tx. 02-08-08 Last Friday,02-08-08, Me and my daughter were coming back, from a Walmart near our home, when suddenly I look up in the night sky and saw 5 lights in \"V\" shape, they were stationary on the north side of the city,and as fast as they showed up, they vanish, I park my truck and keep looking , but they did't show again, then I ask My child did you see that ,she said yes I did, she was very nervious, so we get back home, and thru one of our back windows I was keep looking to the place I saw the lights, and after 15 minutes I saw another solitary light that last like 10 seconds only.",
      "link": "http://www.nuforc.org/webreports/061/S61539.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b832b",
      "summary": "Laredo Texas sighting November 2006",
      "city": "laredo",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "Laredo Texas sighting November 2006 A friend and I were driving around the city when her sister called her, she just looked out the window and was looking into the sky and said \"there's something in the sky\". This is when she tells me that for a couple of day her family and herself had been seeing a lot of movement in the sky. She describes it as a star moving in different directions. This when I stop the car and look  out in the sky and that was what I saw, a star moving up and down. This when I suggest going to Kruger field, where we could probably have a clearer view. As we get there I do see it clear but still far a cicular object with purple,red,greenish lights turning. That was really strange, at this moment I am tring to make sense of what I was looking at, but I could not. my friend and I were in shock. I took pictures with my phone but the pictures were not clear. I did call several people and they were as surprised  to see what I saw. After that I tried to watch the news to see if anyone had seen anything, but nothing. A couple of months later as I was searching on the internet I found out that there was a UFO sighting on an airport in Chicago and Houston around the same time we saw this in Laredo. I have heard that several border patrol in Laredo have seen strange things in the sky. Its been 2 years since I saw this and I am very intrigued by the subject on UFO's. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66786.html",
      "state": "TX",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8dca",
      "summary": "Large object producing a large bright stream of light dissapear from the sky  like a flash !!!",
      "city": "laredo",
      "shape": "unknown",
      "date": "2009-03-19T00:00:00",
      "story": "Large object producing a large bright stream of light dissapear from the sky  like a flash !!! My daughter & I were driving home last night, 01/27/2009.  It was close to 10 pm in the north area of Laredo, TX.   As we turn south in one of the streets, we immediately noticed a very bright large stream of light ahead of us in the sky.  The stream of light was running horizontally illuminating the darkness east side of the sky.   We both looked trying to figure out what it was or where the light was coming from.  We realized that it was from a large object with dimmer light and haze floating in the sky.  The stream of light was like two huge lamps pointing east.   We can not precisely tell the form of the object producing the stream of light, but can definitely say it was moving and shortening the stream of light until both, object & light totally disappear instantly in front of our eyes like a flash!!!",
      "link": "http://www.nuforc.org/webreports/068/S68295.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba20c",
      "summary": "Four  white lights chasing each other inside a cloud.  ((NUFORC Note:  Possible advertising lights?  PD))",
      "city": "laredo",
      "shape": "other",
      "date": "2009-06-09T00:00:00",
      "story": "Four  white lights chasing each other inside a cloud. On Monday May 25,2009 at approximately 9:00 P.M. the National Weather Service out of Corpus Christi, Tx. issued a severe thunderstorm warning for the Laredo area with possible tornado's.  I happen to live on the Eastern side of the city or just outside loop 20. By 10:00 P.M. much of the lightning and thunder had passed us by and only a few sprinkles remained.  While observing the weather conditions outside, I noticed a white puffy cloud immediately to the west of my location.  As I stared at this cloud, I noticed four white lights chasing each other within the cloud itself.   I immediately called my wife so she could witness what I was looking at.  I also called my brother who happened to be visiting family in the vicinity of Nixon High which is located NW of loop 20 from where I was.  He was able to see the same lights inside the cloud going around in a circular pattern.   I tried to apply all logic as to the origin of the lights.  There were no airplanes in the vicinity nor was there any beams of light coming from the ground up. The airport beacon light is approximately 2 miles from where this cloud was.  The lights seem to be chasing each other and never collided with each other.  At some point, the lights would come to a complete stop and would begin rotating in a counterclockwise pattern.  The best way to describe the lights is by imagining that your inside the cloud with a flash light and moving the light around or inside the cloud.  I could see where the light was hitting inside but the beam never broke through the wall of the cloud itself.   This sighting went on for approximately 30 minutes until the cloud moved out towards the East.  I am a law enforcement officer and I have never seen anything like this in my 26 years of service. ((NUFORC Note:  We do not know what the witness observed.  We note that his description is not inconsistent with a four-element light advertising display, although we assume that the witness would have been witness to such a light display, during the course of his career in law enforcement.  We do not know what he witnessed.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70217.html",
      "state": "TX",
      "duration": "30 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bbb95",
      "summary": "In the fall of 1976, three of us saw a grayish oval ufo with lighted windows hovering very low above some trees.",
      "city": "laredo",
      "shape": "oval",
      "date": "2011-10-10T00:00:00",
      "story": "In the fall of 1976, three of us saw a grayish oval ufo with lighted windows hovering very low above some trees. This took place in October or November of 1976.  All three of us (my mother, my cousin and I) were born and raised in the Laredo. I had come to Laredo to visit my family, as I had been living in Mexico since 1956.   My cousins knew I was interested in UFOs and that I believed there was life in other planets.  They told me that there had been a lot of sightings recently in Laredo with people calling in to tv & radio stations etc. about it.  That afternoon, my cousin drove my mother and me to her house.  She parked her car on Davis St. looking north to let us out and then she started yelling, \"The thing! The thing!\" I looked at her and said, \"What thing?\"  She then pointed straight ahead and again repeated the same words.  I looked towards where she was pointing and a short distance away, hovering right above the trees was The  Thing.  It was dusk and I could see clearly the oval shaped ufo with lighted windows all around it.  As my cousing changed shifts to drive toward! s it, it zipped away in an instant.  One minute it was there, the next it was gone.  We were very excited about our experience which I have never forgotten and still tell people about it, especially because it was such a close encounter.  It wasn't like way up in the sky and is it or isn't it.  We know what we saw.   At that time it didn't occur to any of us to report it. Now I wish I had. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83412.html",
      "state": "TX",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc561",
      "summary": "Light traveling West to East across the sky.",
      "city": "laredo",
      "shape": "unknown",
      "date": "2012-01-24T00:00:00",
      "story": "Light traveling West to East across the sky. While star gazing during the evening, I saw an off-white dot, moving too fast to be a plane or jet, and too slow to be a meteorite.  It moved from West-SW to East-NE directly above us and its trajectory covered the whole sky dome.   I had my laser pointer and quickly pointed to it so my wife could verify with me what I was seeing. She confirmed the sighting.  A plane usually has accompanying intermittent lights and sound, which were not present.  A meteorite usually has a tail and fades as it enter the atmosphere; these features were not present.  Our location is 27 36 6 N 99 28 58 W.",
      "link": "http://www.nuforc.org/webreports/086/S86676.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4035",
      "summary": "Fiery object falling, breaks into 2 pieces, each dart toward opposite horizons",
      "city": "laredo",
      "shape": "changing",
      "date": "2015-05-08T00:00:00",
      "story": "Fiery object falling, breaks into 2 pieces, each dart toward opposite horizons. My dad and I were driving down Mines Rd toward the Columbia Bridge on our way to a hunting camp in Mexico.  While conversing, a bright fiery object appeared out of nowhere and seemed to be falling.  We asked one another, \"Are you seeing that?\"   After falling for about 7 seconds, it broke into two pieces, darting toward the horizon in opposite directions. To this day we still talk of this event and have no explanation for what was seen. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118801.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5133",
      "summary": "Last night, I was at my back yard and while in a phone call, I saw coming a bright orange sphere flying towards North. As its very com",
      "city": "laredo",
      "shape": "sphere",
      "date": "2016-02-11T00:00:00",
      "story": "Last night , I was at my back yard and while in a phone call, I saw coming a bright orange sphere flying towards North.  As its very common to hear and see planes because I live very close to the airport, this sphere and orange light wasn't noisy, just steady moving.   It got so much my attention that I tried to take a photo but as it was on motion it didn't come out right. The remarkable orange sphere moved in a single direction until it continued its flight until I lost sight. It was the first time I have seen that. I live in an area with clear sky and 2 weeks ago saw a shooting star.",
      "link": "http://www.nuforc.org/webreports/125/S125738.html",
      "state": "TX",
      "duration": "non stop"
    }
  ]
}