{
  "city": "lexington",
  "fetch_timestamp": "2025-07-12T14:33:58.474602",
  "record_count": 117,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4312",
      "summary": "flew really fast shape of an oval tight formation of flight large",
      "city": "lexington",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "flew really fast shape of an oval tight formation of flight large",
      "link": "http://www.nuforc.org/webreports/049/S49600.html",
      "state": "KY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4405",
      "summary": "STATIONARY FLASHING LIGHT.",
      "city": "lexington",
      "shape": "flash",
      "date": "2006-05-15T00:00:00",
      "story": "STATIONARY FLASHING LIGHT We were star gazing on the evening of Saturday April 1, 2006 when it dawned on us that there was a flash of light located south of the constellation Leo that was about the size of a typical star.  The flash of light had a frequency of between 15 to 30 seconds and appeared to be the same color of a strobe light.  It varied in magnitude from bright (like that of a magnitude -1 star) to dim (like that a magnitude +3 or higher star) and was generally stationary, displaying occaisional slight varience from time to time.  We observed this phenomenon for close to 25 minutes.  Although we were using both a pair of binoculars and a telescope in our stargazing, we could only sight the object in the pair of binoculars. ((NUFORC Note:  Over recent years, we have received a number of reports that are similar to this one.  We have no idea what the cause of the light",
      "link": "http://www.nuforc.org/webreports/049/S49919.html",
      "state": "NC",
      "duration": "25 mnutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4bc4",
      "summary": "Location: Lexington, NE; Dawson County Date: 6/21/19 Time: ~19:30  My son noticed what he thought was a balloon in the sky west of Lexi",
      "city": "lexington",
      "shape": "cigar",
      "date": "2019-06-27T00:00:00",
      "story": "Location:  Lexington, NE; Dawson County Date: 6/21/19 Time: ~19:30   My son noticed what he thought was a balloon in the sky west of Lexington.  My father and I couldn’t identify the object, initially assuming it was a blimp, but it was far too high.  It remained stationary for the ten minutes we observed it.  My mother and neighbor also witnessed the object, but they weren’t as intrigued.  I had to get my kids home to Kearney before their bedtime, so I drove away. Location: Lexington, NE; Dawson County Call received in: Kearney, NE; Buffalo County Date: 6/21/19 Time: ~21:12  I received a call from my father around 21:00 where he told me that the object was still hanging in the same location.  We spoke for about 10 minutes before he excitedly mentioned an object with a flaming tail moving toward the initial UFO.  He didn’t mention any sort of strike, but the second “flame-tail” object continued moving east.   Within a minute, I could see this second object above Kearney, flying surprisingly low.  It was streaking a pair of vapor trails as it flew east.  It was flying low enough that my phone could flicked in and out of focus on it as I trying taking snapshots.  What my dad assumed was a flaming tail, I figured was the reflection of the sunset on the lower-rear hull, as the sun was setting.  As low as the plane was, the wingspan seemed too narrow to be a commercial airliner.  It was also flying far faster than I recall my flight from Denver to Omaha ever going, as it flew into Kearney airspace and left it in what felt like less than a minute. As a strange coincidence, several sirens started going off near my house at the same time.  I couldn’t tell if they were police or ambulance sirens, but they faded before long.",
      "link": "http://www.nuforc.org/webreports/146/S146979.html",
      "state": "NE",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4dcc",
      "summary": "Hovering Light Over NC.",
      "city": "lexington",
      "shape": "egg",
      "date": "2019-04-25T00:00:00",
      "story": "Hovering Light Over NC I have seen a UFO before, but never one that moved like this one did. Around 11:00 PM, I was outside.  The night was clear, almost electric.  I could see stars twinkle, and then from the south, I noticed something moving, with no blinking lights.  It appeared almost to be on “autopilot “.  It moved slowly enough that I could keep my eye trained on it until it  went past the tree line in the distance to the north east.  No sound whatsoever.  It did, however, appear to emit a spotlight of sorts?  That’s the best way I can describe it.   After I’d lost sight of it, I noticed what were clearly man made aircraft traveling in the direction of the unknown craft; one man made craft on either side of the unknown craft.   Whatever it was, was in no hurry to get anywhere and was not afraid to be conspicuous.  It flew low enough that I could see a solid, white or yellow light on the belly of the craft.   Almost like a submarine, only flying.  All I know is that it was an unidentifiable flying aircraft to me.  I know it was something that other people have seen, as well.",
      "link": "http://www.nuforc.org/webreports/145/S145805.html",
      "state": "NC",
      "duration": "Intermittent activity for"
    },
    {
      "_id": "64d005f478aba2ec5a3b55bc",
      "summary": "A 2 hour sighting of fireball with orbiting mini fireballs and an array of white dots in the sky with unusual movements",
      "city": "lexington",
      "shape": "fireball",
      "date": "2008-03-04T00:00:00",
      "story": "A 2 hour sighting of fireball with orbiting mini fireballs and an array of white dots in the sky with unusual movements I was about 13 years old when I saw this event. I was lying in my bed, which was next to a window on the second story of my house. The window was facing southwest and across the street was another two-story house with trees to either side. I remember waking up in the middle of the night and seeing a bright red-orange fire ball in the sky above the house across the street. It was about the size of the full moon in the sky, but appeared to be much closer. It was bright, but it was lighting anything up on the ground, at least from where I was positioned. The fireball was shooting out small bits of fire, which would orbit the ball for a time leaving a trail behind them before plunging back into the main body of the ball. There were clearly flames on the surface of the ball, as well. It looked a lot like what you might imagine an atom with its orbiting electrons to look like. Small specks of fire swinging around the fire ball in all directions. Furthermore, to the right of the object I have just described was an array of white dots, larger than stars, but quite small. In the sky, this would be probably six times the diameter of the fireball in distance. These white dots would line up in two rows (there were probably 8 of them) and then one on the end would scoot through the sky, at first slowly and then with increasing speed, toward the fireball, then stop and turn down and head back to the main group ending up in the lower row, when it originally been in the upper. I watched for probably an hour and a half taking in the beauty of what I was seeing. I contemplated waking up my parents and nearly did so, but I was reluctant to take my eyes off the phenomenon in case I were to miss something. I never woke them up and eventually went back to sleep. The date I have proposed is approximate. I have only recently begun to share this story with people because in the past when I tried I was met only with skepticism, which is, I suppose, the right response. In any case, it seems to have stuck with me a! nd now I would like some answers. The only possibility I can think of, which does not rule one way or the other in terms of extraterrestrial activity or otherwise, is that it had something to do with the nearby Hanscom air force base. This air force base is in a pretty densely populated area, so it doesn't seem like it would be a good location for top-secret technology testing, although I have heard that some of the research on stealth fighter planes was carried out there. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61633.html",
      "state": "MA",
      "duration": "2hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b588b",
      "summary": "Large orange/red glowing cigar shaped object seen off Man O' War blvd.",
      "city": "lexington",
      "shape": "cigar",
      "date": "2007-08-07T00:00:00",
      "story": "Large orange/red glowing cigar shaped object seen off Man O' War blvd. This sighting happened approximately one year ago. I was driving down Man O'War Blvd one evening at around 7 or 8 pm, returning from my University.  I turned right onto Winchester Rd by the channel 36 news station headed towards Paris.  I love the scenery out in that area, and turned my head to look at one of the beautiful farms there.   Right above the horizon at a distance I cannot even begin to calculate was a very large cigar shaped object that was glowing a radiant reddish orange color.  It looked to me like a huge metallic blimp that was catching the setting sun or something.  The road, being heavy with traffic at that time was not to be ignored, so I looked back at the road as to not rear end someone.  I looked back over at the sky, and the object was no longer there.  This object was clearly and obviously there a few seconds earlier.  I have tried to justify every possible explanation....maybe the sun reflecting off of some kind of cloud.... Whatever it was it was very strange. I haven't told anyone about this because of fear of ridicule. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57499.html",
      "state": "KY",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b58a0",
      "summary": "disc over corn field",
      "city": "lexington",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "disc over corn field At 4;30 a.m. I went outside of the house and noticed a disc shaped obeject about 100 yards or so over the cornfield. I ran back inside and grabbed my camera and took twelve photo's. I got two that were pretty good. This thing made no noise at all. When it left it was so fast that it cant be described! I also got a picture of a stelth plane in the distance that seemed to be chasing it. The pink glow you see was only in two frames. I do not know what caused that. It was right next to me and scared me real bad. I was looking to the east of the house.These photo's were taken on a sony cyber-shot 3.2 mega pixels camera. The air felt like it was full of electricity. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58829.html",
      "state": "MO",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b62c2",
      "summary": "Huge black triangle heading north low and slow over Lexington, Kentucky",
      "city": "lexington",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "Huge black triangle heading north low and slow over Lexington, Kentucky Matte black triangle bigger than a football field heading north at an altitude of approximately 200ft. and travelling about 30-40mi. an hour until it slows to an almost complete stop.  At this point it makes a slight course correction east and then continues north until I lose sight of the craft.  Bright white lights on all corners and midway between each corner. Other lights on bottom and side as well.  Slight but interesting hum sound.  It was visible for 1-2 min. It was so awesome I lost track of time.",
      "link": "http://www.nuforc.org/webreports/056/S56306.html",
      "state": "KY",
      "duration": "1-2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6671",
      "summary": "laser lights in kentucky",
      "city": "lexington",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "laser lights in kentucky This was in the mid seventies.  I was about 8-9 years old.  My friend and I were on our way home from playing in the neighborhood.  We looked up and all we could see was what I believe now as the bottom of the craft...it was huge! There was one big circle and several small circles around the big circle...it was a circle of rotating colorful lights.  There was no sound. We were afraid and hid behind our neighbors camper. The neighbors had a row of bushes and we looked over to the bushes and from behind the bushes..what I would describe as a laser light was coming over the bush and disappearing before it hit the ground. The laser light looked like little red squares. This was way before I knew anything about laser's or anything like that. The craft was so big we could not see the sky...all we saw were rotating lights. We eventually took off and ran home. I remember running home crying and my dad made me draw exactly what I had saw. I know that UFO's exist because I know what I saw when I was a child. I've tried to find out if anyone else has seen the laser beam lights. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53796.html",
      "state": "KY",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b69a4",
      "summary": "silver disc, about 3-6 miles away, mabey 22 ft. in length, 13-16 ft. tall",
      "city": "lexington",
      "shape": "disk",
      "date": "2006-07-16T00:00:00",
      "story": "silver disc, about 3-6 miles away, mabey 22 ft. in length, 13-16 ft. tall i was watching television late one night when i noticed a radio tower next to my house was acting strange not like i have ever seen so when i looked outside to see what all the fast flashing and ruckus was i noticed a really low and bright light a large light not very far of in the distance (it is my personal opinon that the UFO was disrupting the radio tower and later noticed that i was taking pictures of it) my first immediate thought was to grab the digital camera my friend had let me borrow a few nights earlier so i zoomed in and started taking pictures as i snaped the first picture the object began to slowly or from my point of veiw slowly move to the right of were i was standing as it moved i continued to take another picture until it went behind a small tree for a short time only a few seconds when it came back into view i then took  another picture i reviewed the picture just taken and i was suprised to see that the object had seemed to break into 2 diffrent saucers or mabey another had joined the first craft i was so shocked at what i was seeing i stoped taking pictures for a while about 18 minutes later it begane to move faster feeling that was more than likely about to fly away i took one more photo and i seemed to have cought the last picture just as it was taking off it moved so fast it left a blur as a photo it was moving at around 800 mph from my prespective i have a brother who works on airplanes and i have been with him to watch many test flights of military fighter jets and stelth aircraft and by the time it had reanched full speed before it got to far away to see was moving much faster than any air craft currently available to civilian or military",
      "link": "http://www.nuforc.org/webreports/051/S51244.html",
      "state": "NC",
      "duration": "28 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d29",
      "summary": "Distant white luminous object with red and blue flashing lights; stationary for one hour, afterwards moving very slowly.",
      "city": "lexington",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Distant white luminous object with red and blue flashing lights; stationary for one hour, afterwards moving very slowly. \tAt about 9:30 PM today, my mother, brother, and myself went outside to admire Venus, which is quite brilliant tonight. We then saw something far more remarkable toward the south, about midway up in the sky from the horizon. It was much smaller and not at all as bright, but it was distinctly flashing. At first, we took it to be a plane, but we quickly realized that it was completely stationary. What on Earth could do that? \tWe looked at it through binoculars, and still could not figure it out. The lights were flashing very rapidly, with a blue one on one side and a red one on the other that alternated. Both were backed by a white light that did not seem to flash. Since it was so far away, we could not make out any real shape to it, though it seemed to me to be a bit narrow, like a grain of rice. \tI attempted to photograph it, but my camera is not good enough to pick up stars at all, let alone odd flashing things. At 10:20 PM, it was still out there in the exact same place. At 11:00, we checked again, and saw that it had moved far above and west of its previous position. Its lights were now flashing on a diagonal instead of being horizontally oriented toward the ground. The surrounding stars had not moved as much. It was hard to tell, but it seemed to be moving very gradually continuing in the same direction in which it had moved before. It is probably still out there. \tIt is highly uncharacteristic for any of us to go staring at the sky here (light pollution makes stargazing unfeasible), and we only did so because Venus was so irresistably bright. My brother in particular is a very pragmatic person and normally scoffs at anything fantastical, yet he stood out there watching this object longest of all. This is absolutely the first time any of us has ever seen anything inexplicable in the night sky, and we are not particularly interested in UFOs. I have never even heard the others mention them. However, we are now very interested in this one! Even if it turns out to be nothing, we hope to somehow find out more.",
      "link": "http://www.nuforc.org/webreports/056/S56566.html",
      "state": "KY",
      "duration": "Still out there at 23:00."
    },
    {
      "_id": "64d005f478aba2ec5a3b6dfe",
      "summary": "I was walking down the street with my dog, and I noticed my small dog that never barks started to growl and spasm uncontrollabley. Then",
      "city": "lexington",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "I was walking down the street with my dog, and I noticed my small dog that never barks started to growl and spasm uncontrollabley. Then a white light and a warm feeling came over me, and I was knocked to the ground and when I woke up I had several sore spots on my body and my anus hurt. The most puzzling thing would be that it was no longer early morning hours but more early afternoon. My location had changed and my clothes where tattered. I at first figured this could of been an accident by a veichle or possible mugging but much to my dismay my arms and legs had several various unrecogonizable burnt marks. This is very difficult for me to discuss.",
      "link": "http://www.nuforc.org/webreports/058/S58899.html",
      "state": "KY",
      "duration": "Several Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ec1",
      "summary": "Three blinking dots in the shape of a triangle...similar to the one sighted in pasco terxas on March 14",
      "city": "lexington",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "Three blinking dots in the shape of a triangle...similar to the one sighted in pasco terxas on March 14",
      "link": "http://www.nuforc.org/webreports/062/S62277.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7fca",
      "summary": "Metor zooming toward the ground then stops above the city and turns off all lights and moves in a straight line.",
      "city": "lexington",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "Metor zooming toward the ground then stops above the city and turns off all lights and moves in a straight line. Was sitting at a cafe table on the sidewalk talking with friends.  I leaned back in my chair and as I looked up and North a meteor shot down from high above and then to my surprise stopped dead above the Rupp Arena it had several lights but immediately turned them off and began to move in a straight line over the city towards Leestown Rd../ Georgetown Rd. area.  Could still see it from the city lights for just a few moments as it moved off but couldn't make out a clear shape.  Seen the same entry style with a triangular craft with orange lights on the bottom in Seattle a couple years ago.  I want to know what they are.",
      "link": "http://www.nuforc.org/webreports/072/S72192.html",
      "state": "KY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8647",
      "summary": "I thought it was a star until it moved quickly northward.",
      "city": "lexington",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "I thought it was a star until it moved quickly northward. I was looking out my bathroom window Sunday night about 10:45 pm and noticed a brightly twinkling \"star\" in the sky, it turned a bluish color and suddenly moved northward then returned to original position and then started moving slightly downward toward earth and then back to original position.  I was mezmarized and continued to watch for another 20 min or so, it began to slowly move south with circular patterns.  I stopped watching for about an hour and then returned to the window, it had moved much more southward but about the same height in the sky.  Whatever it was it was not a plane or helicopter, it could stay stationary for minutes then move quickly up down, and around, The light was very bright and was mostly bluish but occationally yellow. It didn't seem to be in a hurry like it was just \"there\" moving around. I stopped  watching about 12:30-1am and it was still out there moving around in the sky.  I'm in my 50's and have never seen anything quite like this, made me feel very uneasy.",
      "link": "http://www.nuforc.org/webreports/072/S72619.html",
      "state": "NC",
      "duration": "2 hours +"
    },
    {
      "_id": "64d005f478aba2ec5a3b86bc",
      "summary": "Bright light moves slowly, stops,  and all of a sudden shoots off into space.",
      "city": "lexington",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Bright light moves slowly, stops,  and all of a sudden shoots off into space. I have seen this on two consecutive nights.  Looking nearly straight up ( I suppose you could say in the ne sky ) my wife and I saw a light.  This appeared to be a star at first but was larger. It was between the size of a star and the moon from our vantage point.  The object floated gently from left to right, stopped, and within seconds faded out to nothing, as if it were to have shot off into space directly away from earth.  I tend to look up at the sky and find the unusual, the only problem is that almost everything I have seen can be explained fairly easily.  This...I have no clue. The strange thing is that I saw the exact same thing, in the same part of the sky the night before as well.  It acted the same both times.",
      "link": "http://www.nuforc.org/webreports/070/S70515.html",
      "state": "SC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8701",
      "summary": "A friend and I were driving past our local shopping center when we noticed some odd lights in the sky. We observed the lights created a",
      "city": "lexington",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "A friend and I were driving past our local shopping center when we noticed some odd lights in the sky. We observed the lights created a distinct boomerang shape. The UFO was flying overhead slowly until it came to a stop. The UFO then appeared to be lowering altitude towards us. It started moving away so we drove to try to keep it in view, but a building got in our way. When we finally saw the UFO again, it was already towards the horizon.",
      "link": "http://www.nuforc.org/webreports/068/S68022.html",
      "state": "KY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8865",
      "summary": "green oval shaped light over my local church,power lines down..",
      "city": "lexington",
      "shape": "oval",
      "date": "2010-02-14T00:00:00",
      "story": "green oval shaped light over my local church,power lines down.. it was saturday night in late in october i think.i was around 9 or 10 years old. me and my mom were headed to the church we attended to turn the heat on for the next mornings service. she had forgotten to earlier that day when we cleaned the church as we always did on saturdays. anyway,we pulled into the circle drive and noticed the power lines had been cut right in the middle of the driveway. as we pulled in to observe a oval shaped light green object went across the sky down behind some trees.it startled both of us and we left. the next morning before church we had no electricity either. the electric line had been cut at the house beside our house and laying across the neighbors driveway. the strange thing about it was that our neighbor was a preacher of another church a few miles down the road. the power line had been cut there as well. there were only 3 diffrent places that i am aware the lines had been cut. that was at my church,my neighbors who was a pastor,and the lines at his church. his church was a methodist and ours was a baptist. both churches had the same first name. one ended with methodist,the other with baptist. i don't know if this had anything to do with the light we saw,but it sure was weird for me as a child. i remember it as if it were yesterday. i am 47 now. this is a very true story. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74195.html",
      "state": "NC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8938",
      "summary": "Craft with multiple lights, 1 red blinking light, in a saucer type shape in flight and hovering near a main road.",
      "city": "lexington",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "A craft with multiple lights, 1 red blinking light, in a saucer type shape in flight and hovering near a main road. I was driving home from my dads house on New Circle when I saw a really bright light up in the sky, at first I thought it was a star. Then I saw it was in fact an object of some type, though I couldn't really make it out. I passed this figuring it was just some helicopter hovering perfectly above the road. Then, maybe 5 minutes later, I was still on New Circle between exit 5A and 5B (I was getting off at 5B, onto Versailles Rd.) when I saw a low flying object slowly come down at an angle towards the ground as if to land (though the airport is not over there and I don't know of any airstrip in that direction). I at first thought it was a plane but then the object stopped in mid-air, hovering. It had at least 3 bright white lights on it, and 1 red blinking light (thus I thought it to be a commercial plane at first). The shape of it seemed to be pretty thin, shaped kind of like a saucer. It looked to me like it had a flat top and the edges came out at slight diaganols pointing towards the ground. I was not able to get a very good look for long because I was driving and was literally just about at my exit, though I did brake to slow down and get a longer look. I have no clue if it made noise or not, I happened to be listening to my radio very loudly at the sighting. I believe that some others on the road saw it and thought it was something strange as well, as I noticed cars braking abnormally near the object.",
      "link": "http://www.nuforc.org/webreports/066/S66798.html",
      "state": "KY",
      "duration": "Several seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b4d",
      "summary": "Contrail of short length, abrupt begining and end in clear sky, black smoke, very small object separated from smoke trail, no aparent m",
      "city": "lexington",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "Contrail of short length, abrupt begining and end in clear sky, black smoke, very small object separated from smoke trail, no aparent m UFO Sighting June 27, 2009 Saturday 9:15 pm  206 722 3000  While taking an evening golf cart ride with his wife Anne, Floyd Coates, while northbound on CR 900 W, Lexington, IN, near the town of Kent, Indiana, observed part of what appeared to be a jet trail fragment in an irregular puffy pattern contrasted to a freshly-created jet vapor trail.  Interestingly was it seemed to have a well-defined start and end from a direction of WSW to ENE or a heading of 60 degrees from north.  A very small of indistinguishable shape object in the front seemed to be the source of the smokey emission. After the passing of a minute or so, the apparent emitting object was a visual one-inch at 20-inch arm’s length ahead of the trail. The trail appeared to be 4” long.  To observe better, we drove under a cross-country power line to give us good visual reference at distance to observe two more features, one of which was the trail and the object appeared not to move for about 2 minutes and contact was lost with the object either as darkness was approaching or just too small to see.  The trail after 5 minutes of observation seemed to begin to break up.  Its total length never appeared to be greater than 4 inches at the 20 inch arm length. The color of the trail was much darker than a jet would have been. My explaination.  The dispersion of the trail gave the appearance of something at altitudes between 5,000 and 50,000 feet running an internal combustion engine with piston that had just broken an oil ring or an oil leak in an engine causing a black smoke to come from the engine until the engine exhausted all its oil and locked up or shut down.  Though the sun had just set, the sky was well bright enough to distinguish this event from a standard jet trail by virtue of the darkness of the apparent smoke.  The other unique feature was the sudden start of the trail and the sudden end to the trail and the extremely small object continuing with a 060 heading after the smoke trail finished. Observer: Twin instrument pilot 2,000 hours BS Physics Engineer 85 employees 64 years old First UFO sighting",
      "link": "http://www.nuforc.org/webreports/070/S70739.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d28",
      "summary": "Flashes followed by white and red lights",
      "city": "lexington",
      "shape": "flash",
      "date": "2010-04-13T00:00:00",
      "story": "Flashes followed by white and red lights I had just stepped outside to walk my dog when I looked north and saw a bright orange boomerang flash in the sky. My first thought was that it was sunlight reflecting off a aircraft.Then it dawned on me that I could not see any aircraft anywhere in the sky. I then began to walk to the back of the property when I saw one and then a second flash a little to the west of where I saw the first flash. These two flashes where white instead of orange. I watched for a few minutes but saw nothing else and went back to the dog walking thing. After several minutes I turned around and looked at the spot where I had seen the flashes and saw a large ball of light that I at first thought was a star. Then it became clear this was not a star and was blinking. The blinking reminded me of a old rotating police light. The light was white and I could see flashes of blue or green in it. There was another smaller blinking light underneath and to the west of the larger light that wa! s moving very slowly as if it were searching for something. I walked back to the house and continued to watch the lights and got my mom to come outside and look. She agreed that the lights were odd and did not look like any aircraft. We then went back inside and due to the cold and I came back out a few minutes later and the lights were gone. I was never nervous while observing this, just curious as to what the light could be and how odd it was to be there. ((NUFORC NOTE:  Witness indicates that date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74590.html",
      "state": "IN",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f6e",
      "summary": "Slow moving White lights moving from north to south.",
      "city": "lexington",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "Slow moving White lights moving from north to south. Referencing the following report:  Occurred : 9/20/2009 22:45 (Entered as : 09/20/2009 22:45) Reported: 9/26/2009 4:42:31 PM 16:42 Posted: 12/12/2009 Location: Lexington, NC Shape: Circle Duration:2 hours + [Narrative excluded]  As a resident of Lexington, NC I have often seen similar objects that appear quite stationary in the sky, and then move ... in a specific direction .... Northeast to Southwest or reverse.   Depending upon atmospheric conditions the light may appear bright white or blue .. again also depending upon the aircraft. There is also a famous Vineyard in the area and the owner employs a Lear Jet in his travels - often flying low.  No noise is heard until the aircraft is close or passes overhead.  The local airport is nearby and low approach speed maintains an optical illusion of a non-moving object when approaching HEAD ON to the viewer.. Lexington also falls under a main sky route hub between Greensboro/Winston-Salem and Charlotte and it is not unusual for heavy air traffic .... the planes often employ landing strobes .. but the actual ONCOMING path makes it appear stationary until they get overhead and then one can see the FAA required aircraft lights (i.e. green/red .... varied blinking lights, wing lights, etc.) . Many others have seen similar objects and mistook them for ... Unidentified, until that typical jet noise \"catches up\". I am not sure if this applies to the above situation, but may be a possible explanation. This evening I have seen many .... heavy air traffic ... some small aircraft ... strobes are flashed when they are approximate to each other.  TWO in particular were unusual and did NOT follow the normal flight route; however I had assumed that they were the result of heavy inbound/outbound air traffic (Holiday) and may have been put on a \"holding\" pattern.  The night was very clear, the aircraft did NOT make noise, but assumed (again) the sound would follow.  It didn't; however the movement was consistent with usual flight speed with no deviations from a straight course, nor any change in speed.  Both objects moved from NORTH to SOUTH, EACH about ten minutes apart - EACH taking about ten minutes to cross.  The ONLY thing unusual were that there were NO FAA lights .. just a solid white light. Note:  Many dogs in the area were howling during this ... particular sighting. Nothing follows, nor is follow-up necessary.  Reported FYI only.",
      "link": "http://www.nuforc.org/webreports/073/S73772.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ac8",
      "summary": "Triangular craft observed in South Central Texas",
      "city": "lexington",
      "shape": "triangle",
      "date": "2010-06-23T00:00:00",
      "story": "Triangular craft observed in South Central Texas Looking for satellites to show my daughter, thought at first I was seeing a satellite but noticed it began changing direction, sometime rather jerky and sometimes smoothly.  At times it appeared to be displaying lights, red, green and maybe blue.  Watched it for approximately 20 minutes. It was approx 50 degrees above the Eastern horizon in a North Northeast location when first observed and last seen at almost 90 degrees.  To the younger eyes of my daughter it appeared to be triangular.  At one point we observed a very high, fast aircraft in the vicinity.  The plane was flying from a Northeastern to North Northeaster direction.   We heard no engines of any aircraft at any time.",
      "link": "http://www.nuforc.org/webreports/075/S75785.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b55",
      "summary": "Starlike object gives dazzling light show.",
      "city": "lexington",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Starlike object gives dazzling light show. I had walked out my front door to smoke a cigerette, when a what I thought at first was a very bright star caught my eye.  It was very bright, far brighter than the other stars but what I thought was odd was that there was fairly thick cloud cover that night and when the clouds thickened, it blotted out all the neighboring celestial bodies but not this star.  As I watched perpelexed it rapidly crossed the sky from East to West in a very rapid motion.   I ran inside and got my girlfriend and her digital camera.  We watched the light for about ten other minutes. It changed it's postion several times.  It lowered it's altitude and then would slowly raise back, it also slowly floated back and forth across the sky. Then a plane flew by and it dimmed itself rapidly, when the plane past it grew very bright.  I thought this was caused by the cloud cover but at that moment it was in a clear patch of sky.  It did this several times and them it dimmed itself and vanished.  I grew up watching planes and helicopters and I know that's not what this was,  I don't know what this was but it behaved differently than anything that I've ever seen.",
      "link": "http://www.nuforc.org/webreports/067/S67585.html",
      "state": "KY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c1b",
      "summary": "Black cigar shaped object hovering after storm over Red Bank in Lexington South Carolina",
      "city": "lexington",
      "shape": "cigar",
      "date": "2010-06-23T00:00:00",
      "story": "Black cigar shaped object hovering after storm over Red Bank in Lexington South Carolina In Red Bank, after the storms had passed through, my husband, daughter, and I were sitting on our porch enjoying the cooler temperature from the storms.  I glanced up into the haze of out-flowing clouds and inside of them I saw this dark, cigar shape just sitting in the thick haze.  I couldn't tell you how high up it was, but originally I thought maybe it was a goose about to land in the pond, but the object didn't get any closer.  It simply hovered and would vanish into the clouds and then back out again.  I told my husband to look because there isn't any towers or high trees like that around, I had to see if he saw it too.  Every time I would point the object would slowly fade into the hazy clouds, then back out.. it never once went higher or lower.  It would only fade out and in until eventually it was gone. ((NUFORC Note:  Witness, for some reason, indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75826.html",
      "state": "SC",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e9f",
      "summary": "large unknown object with red outer lights followed  uss in the night",
      "city": "lexington",
      "shape": "disk",
      "date": "2010-04-13T00:00:00",
      "story": "large unknown object with red outer lights followed  uss in the night It was  a normal night as usaul . . . . my aunt and my sister were in the car with me, we were going down some old country roads and came to a four way cross section .Mind we really didnt know were we were and hadent seen a house for miles alought a few barns.   As we stopped and  switched drivers i happend to mention how the stars looked that night, being a constain observer.  My sister happend to mention a red tower blinking and asked my aunt if it was a cell phone tower.  She stood up and looked and was a little confused as why there would be one out there.In curosity I looked too and as we all stood and tryied to figure out what it was, the object moved.  We all were a little freaked out  at first because it circled around in the sky and came toward in our direction.   At that point we were like \"oh its a ufo \" but as it came closer my aunt jumped back in the car and told us to get in.  Me and my sister started becoming a little nervous.  She pulled out in the ! middle of the four way secton and went right.  As we drove we could still see the object flying but it was hard to notice inbetween the trees .  We finallly arived at a friends and rushed inside telling them every thing  that had accurd only to be laughed at.  I have never in my have life seen anything like that before it was so weird it looked like a saucer and around the edges of the outer rim were bright red lights.  I have no doubts  today that it was a ufo but im very curious of what it was doing out there.",
      "link": "http://www.nuforc.org/webreports/074/S74959.html",
      "state": "OH",
      "duration": "4 or 5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba267",
      "summary": "White light witnessed from aircraft is seen traveling at an extremely high speed",
      "city": "lexington",
      "shape": "sphere",
      "date": "2008-08-12T00:00:00",
      "story": "White light witnessed from aircraft is seen traveling at an extremely high speed This sighting occurred on Sunday, July 27th 2008 at 10:39PM EST. The object was witnessed aboard a McDonnell Douglass MD-82 twin jet aircraft traveling eastbound at 33,000 feet and 497 knots. At the time of the sighting the aircraft was at latitude 37.87 and longitude -79.79, placing the aircraft between Covington and Lexington, VA. The aircraft was in radio contact with the Washington Air Route Traffic Control Center (ARTCC), and traveling between the waypoints ASBUR and DENNY on jet airway 42 (J42). The object was witnessed off of the left side of the aircraft traveling north (right to left) at an extremely high velocity. The object appeared spherical in shape and bright white and glowing in color. The object appeared to leave some sort of contrail, which may have been a distortion of light due to speed. The object contained no other sources of light typically found on civilian aircraft. The object disappeared from horizontal view within 2-3 seconds, moving at a speed much greater that that of an approaching opposite direction jet aircraft. The object had an apparent size of 1/4 the circumference of a full moon, and looked similar to a shooting star or meteorite. Size relative to the aircraft could not be determined. The object appeared to be between 35,000 and 38,000 feet, 2,000-5,000 feet above the aircraft. The trajectory of the object resembled an ascending arch. According to NASA’s website, the International Space Station was not in the area at the time of the sighting. Other aircraft were also in the vicinity at the time. The object was witnessed by a more than one person, including trained observers. ((NUFORC Note:  We spoke with this witness via telephone, and we deem him to be an exceptionally good witness.  Witness provides no contact information.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64834.html",
      "state": "VA",
      "duration": "2-3 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba757",
      "summary": "7 boomerang objects viewed flying in formation that had irregular flying pattern",
      "city": "lexington",
      "shape": "formation",
      "date": "2009-03-19T00:00:00",
      "story": "7 boomerang objects viewed flying in formation that had irregular flying pattern approximate   7 boomerang objects in sky no lights visible  on the aircraft  the objects were white on the underside  they flew in a formation an then a few  of them veered off to the right an the others followed",
      "link": "http://www.nuforc.org/webreports/069/S69263.html",
      "state": "NC",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba755",
      "summary": "Dark blue light moving sideways, but apparently suspended under something like a white parachute?",
      "city": "lexington",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "Dark blue light moving sideways, but apparently suspended under something like a white parachute? At about 23:15, March 17, 2009, I saw a bright dark blue light in the skies, about 100’ (rough estimate) in the sky over a wooded area next to the freeway in Lexington, Ky.  The light was not extremely bright, like a police light or the sun, but rather like a blue runway light at the airport.  The light was steady and there were no other lights, flashing or otherwise.  It appeared as though the light might have been suspended under a small, white parachute, but it did not seem like the movement of the light was consistent with a parachute.  I only got a short look at it, since I was driving on the busy roadway, and I did not see any indication that anyone else noticed.",
      "link": "http://www.nuforc.org/webreports/069/S69248.html",
      "state": "KY",
      "duration": "1 min (passing by in car)"
    },
    {
      "_id": "64d005f478aba2ec5a3ba840",
      "summary": "On June 29,2008 at approx. 8pm ,my 4 and 6 yr old girls asked what was an object in the sky was, if it was a shooting star? I told them",
      "city": "lexington",
      "shape": "other",
      "date": "2008-07-05T00:00:00",
      "story": "On June 29,2008 at approx. 8pm ,my 4 and 6 yr old girls asked what was an object in the sky was, if it was a shooting star? I told them no its too early for a shooting star its not dark yet its only 8pm. About 2 minutes later they said.. there's another one.. so I looked that time. It was a silver bullet shaped object going across the sky at a fast rate of speed, first I thought it was a plane, but then noticed it had no water vapor trails behind it. My 17 yr old girl went in the house to get the camera to take a picture. We tried to get a picture of several of them but for some reason they would not show up on camera, but we did get a picture of 11 of the 20 that came over the house all traveling in the same direction. The objects at first were only coming over about every 2 to 5 minutes then after about 10 of them, they were occurring about every 30 seconds to 1 minute. At times there were 2 of them in the sky above the house. Two of the objects were changing from red to black.  All of the objects were traveling from west to east. We live in a small town and in my years I have never seen this much air traffic in a 30 minute period. Only 2 planes came through and they both had water vapor behind them and they were not traveling in the same path as the other objects",
      "link": "http://www.nuforc.org/webreports/064/S64201.html",
      "state": "TN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba87f",
      "summary": "Transparent  cross shaped object  at high altitude caught glare from sun and vanished seconds later",
      "city": "lexington",
      "shape": "cross",
      "date": "2008-07-05T00:00:00",
      "story": "Transparent  cross shaped object  at high altitude caught glare from sun and vanished seconds later While working in the yard this afternoon I happened to look up at our second floor window, above which i seen an object in the sky that appeared semi transparent, its shape was similar to a small aircraft with no tail section but it looked as if it was made of glass. After sighting the object it moved in a way that caught glare from the sun making it more detailed for a second or two. I was able to see what appeared to be internal beams along the longer rectangular section and then it faded away and I lost sight of it. The object was very high up I would guess between 15 and 20 thousand feet up. The sky was perfectly clear not even high clouds. ((NUFORC Note:  Please see illustration on the NUFORC website.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64261.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3babe6",
      "summary": "Semi-length lights",
      "city": "lexington",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Semi-length lights It was right below Jupiter. I saw two lights that looked like the were on the ends of a semi truck ad it started moving to the right of Jupiter and then slowly the lights dimmed and went away.  There was no sound or anything.  I tried to take a video of it on my phone but my phone would shut off and it had a full battery.",
      "link": "http://www.nuforc.org/webreports/078/S78202.html",
      "state": "KY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bad9f",
      "summary": "Unidentified Red Glowing Object over south Lexington, KY",
      "city": "lexington",
      "shape": "sphere",
      "date": "2011-05-02T00:00:00",
      "story": "Unidentified Red Glowing Object over south Lexington, KY I was sitting on my balcony around 9:00pm yesterday working on Facebook on my android phone.  I noticed a light in the sky through my right eye.  So I looked up and at about a 70 degree angle from the horizon was a very bright red glowing abject of moderate size.  I sit on the balcony at night all the time because I smoke, but not in the house.  I have seen many airplanes and helicopters in the night sky and this was definitely not one of them.  I was amazed at what I was seeing so I took some video with my android phone.   The video can be found on my youtube page at  http://www.youtube.com/watch?v=99dmCinUt6Q  I live in south Lexington, Ky.  The object moved due east, then vanished approximately 10 degrees in the sky before reaching the horizon.",
      "link": "http://www.nuforc.org/webreports/080/S80811.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bafa8",
      "summary": "HAVE PICTURES",
      "city": "lexington",
      "shape": "fireball",
      "date": "2011-01-31T00:00:00",
      "story": "HAVE PICTURES MUST BE CHECKED ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We have no way of contacting the source of the report!  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79873.html",
      "state": "KY",
      "duration": "4 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3bb015",
      "summary": "orbs of light circling the moon.",
      "city": "lexington",
      "shape": "other",
      "date": "2011-04-03T00:00:00",
      "story": "orbs of light circling the moon. The first of four UFO sightings I have experienced happened in 2004.  I am not sure on any specific dates though I am sure about the month and that it was late July of my first sighting.  I was with two friends at the time. We were juniors in high school, thus for a long time I did not feel I was credible enough to come forth with the sightings, however, as I am now a college graduate, mind has not changed that what I saw were UFOs. The first two sightings both consisted of nothing more than orbs of light in the sky, to far and too small to distinguish much more than it was a ball.  I did not think these relevant for a long time until I recently saw a computer simulation made by UFO specialists to try to recreate something someone had seen.  It looked a lot like what we had seen. Lexington is a small resort town in Michigan.  There are lots of beaches, but we only night swim in the harbor as it is really sandy.  We face the east so see the sun and moon rise. On that particular night I was with two friends, all three of us were carelessly watching the sky for at least an hour or so, as it was an extremely bright night.  The beach is maybe a quarter of a mile from the road, with no nearby lights, so we were used to it being abnormally dark.  On that night, it was extremely bright, the moon was full and there were tons of stars shining.  The sky wasn’t even black, not even velvety, but a moonlit blue. It was because of the clear visibility that I believe there was more in the sky than what we specifically focused on.  The orbs looked very much like stars. When we first noticed one it seemed to be traveling towards the moon.  We’re not far from some airports and military bases, so we know what normal lights look like.  These were not normal.  They were just about the size of the stars, maybe just slightly bigger, and instead of having a golden hue on the edge like a star, they were white lights with blue hues on their edges. As we watched one travel towards the moon from the east, one of my friends spotted another coming from the northwest.  The one from the east was traveling much faster, and in a direction we could not attribute to any known flight path.  At that point we were still willing to dismiss the sighting as nothing more than planes but they were too high. The most intriguing part came when the orb from the east reached the moon. Instead of flying under it, as we expected the light to do, it began circling it, and not in a two-demential manner, but a three-demential one, where the orb actually disappeared behind the moon for a few minutes and returned to the side we could see only to go back around again. As the orb from the northwest came right up to the moon it too began circling it too, but in the opposite direction.  As that was happening several more orbs of light started heading towards the moon.  As one of my friends began to panic, I was out numbered on the vote to remain and though I kept my eyes on it the entire time by the time we got to the car the offending orbs never came back around from the other side of the moon, all the orbs had stopped moving and the sky looked still again. That was about it for that one. It lasted maybe ten minutes or so.  We were young, B+ and A students and though even writing it sounds strange I know what I saw.  When I later told another close friend about it, she too had seen the strange lights from her home in Croswell, Michigan, six miles away.  For the rest of the week we observed glimpses of these lights and more and more people came into the school talking about them.  The talk lasted a while, but everyone dismissed it as skeptical parents insisted we saw military jets.   I am sure that is not what it was.  My father, who’s twin brother is a pilot, agreed that this sighting along with my other three are legitimately unexplained. I have no photos of any of my sightings but will be sending a package of some maps and a few sketches with this story via mail. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80581.html",
      "state": "MI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb22c",
      "summary": "Cone shaped light that flickered before illumintating the sky in a cone shape way",
      "city": "lexington",
      "shape": "light",
      "date": "2011-03-10T00:00:00",
      "story": "Cone shaped light that flickered before illumintating the sky in a cone shape way Walking across the dam watching lighting strikes and we saw the lake light up on an island we thought it was a lighting striking a tree but there was no fire",
      "link": "http://www.nuforc.org/webreports/080/S80270.html",
      "state": "SC",
      "duration": "Lake Murray"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2e1",
      "summary": "Strange orange light over Lexington, KY",
      "city": "lexington",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Strange orange light over Lexington, KY When first spotted, it moved in fast motion from left to right across the sky.  At first, mistaken to be an airplane, but after observing for several seconds, appeared to be otherwise. Orange light, abruptly stopped and stayed in place.  Then slowly disappeared and was no longer visible.",
      "link": "http://www.nuforc.org/webreports/078/S78778.html",
      "state": "KY",
      "duration": "1:00 - 1:30"
    },
    {
      "_id": "64d005f478aba2ec5a3bb390",
      "summary": "Five objects, moving North and South with a rocket exhaust suddenly vanish",
      "city": "lexington",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "Five objects, moving North and South with a rocket exhaust suddenly vanish In a Walmart parking lot tonight I noticed what looked like plane on the horizon moving North.  It had what looked like a rocket exhaust, definitely not a contrail. Below that, moving South were two more of them, a little smaller but with the same look about them. Still lower was another moving North and finally a fifth object moving South. I kept watching them for over three minutes - they weren't moving that quickly.  Then they just vanished!  I left the parking lot in my vehicle and started driving home to the West.   I figured I'd see five planes eventually, explaining everything but never saw the objects again.",
      "link": "http://www.nuforc.org/webreports/078/S78815.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbc2d",
      "summary": "Orange orbs flying at 500 feet elevation in a formation.  Three in a line and a fourth trailing behind",
      "city": "lexington",
      "shape": "sphere",
      "date": "2011-10-10T00:00:00",
      "story": "Orange orbs flying at 500 feet elevation in a formation.  Three in a line and a fourth trailing behind I was upstairs in bed when my friend came up after viewing late nite news at approximately 11:50 pm on June 28, 2011.  He screamed at me from the other upstairs bedroom to come and see these objects.  They were four orange orbs flying in formation at a low altitude towards our home..about 500 feet above ground-helicopter flight space for our police helicopters..there were three in a line around 50 yards apart and one behind around 100 yards flying directly behind the middle orb.  We rushed downstairs and watched.  They executed a 45 degree turn and crossed our yard at a slow speed...never changing formation.  They were the size of the full moon about three quarters up in the sky and there was movement inside like moving crystals..sooo hard to describe and the air was disturbed around them..Very scary. There was absolutely no sound from the objects.  I went inside and got my camara.  I was very excited and fumbling with the camera.  I managed to get them in s! ight as they moved over the houses behind my home.  I was so upset I forgot to take the flash off.  When I took the picture the sky lit up and the back orb went out...just like that...Then as they moved on it came back on more dimly.  Unfortunately, the flash blackened out the sky and took a pic of my patio umbrella which was in the side forground of the pic.  We called the police, a tv station and I spoke with an air traffic controller at the airport, but at that time no one had reported these things.  We later checked chinese laterns, but these things were under control.  They stayed in formation and one extinguished the light in response to my camera flash!  We have sketches of what we saw.",
      "link": "http://www.nuforc.org/webreports/083/S83601.html",
      "state": "KY",
      "duration": "approx 2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc600",
      "summary": "Looked like the black triangle ufos.",
      "city": "lexington",
      "shape": "triangle",
      "date": "2011-08-07T00:00:00",
      "story": "Looked like the black triangle ufos. A triangle with a light on each corner like the black triangles that people have reported.  (I just saw the lights, not the actual shape)   Each light disappeared one by one within seconds.  It was also by fireworks, so I'm still not sure whether it was a firework or not. (even though it was a lot higher up)   And it was over the water of Lake Huron.   And I only saw it for a couple seconds, because it disapeared when i looked ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82564.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bca1d",
      "summary": "Flat, reflective object spotted at high speed along US 60. Enters small cloud, Does not exit.",
      "city": "lexington",
      "shape": "cylinder",
      "date": "2011-08-21T00:00:00",
      "story": "Flat, reflective object spotted at high speed along US 60. Enters small cloud, does not exit. Flat, reflective object spotted at high speed along US 60. Object was heading SW very quickly, entered into a small cloud formation, and did not exit.  No sign of object afterward. Entire sighting lasted about 5 seconds.  It caught my eye because I didn't see a tail fin, like a plane would have.  Object was flying very fast in a straight line.  Other traffic was on US 60 at the time, traveling in the same direction, so I don't know if others saw this or not. I know I did.",
      "link": "http://www.nuforc.org/webreports/083/S83205.html",
      "state": "KY",
      "duration": "5-6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9fd",
      "summary": "Close encounter of the really close kind?",
      "city": "lexington",
      "shape": "triangle",
      "date": "2011-08-21T00:00:00",
      "story": "Close encounter of the really close kind?  The craft was triangular.   I do not remember much this is really freaky.  I was laying in bed  after a long night of studying I heard something like crickets and a pulse sound then a blue light and a tunnel vortex type thing, and I couldn't move.  I do remember seeing a triangle craft that I was heading to,next thing I know it is 5:15 AM, and I am back in my bed.  I lost 2 hours, I remember a lot - electricity running through me as a blue light, I could hear it and \"see it\".    Maybe it is just a vivid dream but for some reason I feel it is not.",
      "link": "http://www.nuforc.org/webreports/083/S83192.html",
      "state": "KY",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bca69",
      "summary": "orange light",
      "city": "lexington",
      "shape": "circle",
      "date": "2011-08-07T00:00:00",
      "story": "I saw a bright orange light about size of softball and a tiny orange dot north of it. I then saw a blinking object, probably a plane fly out left from orange dot.  The orange dot then faded away.   I then looked around and saw another possible plane just like the other blinking light heading away in different direction.   Did planes collide or was a meteor shot down?!   Fireball in the sky and two other objects. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82821.html",
      "state": "KY",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc14",
      "summary": "Four orange balls flying very low with three in a line and a fourth behind moved slowly across sky with absloutely no noise.",
      "city": "lexington",
      "shape": "sphere",
      "date": "2011-07-04T00:00:00",
      "story": "Four orange balls flying very low with three in a line and a fourth behind moved slowly across sky with absloutely no noise. We observed four orange balls moving slowly at a very low altitude over our home at about 11:50 pm on June 28, 2011.   Three balls were in a line and a fourth was behind making a triangle appearance.  They were first observed out the bedroom window.  We ran outside our home and as they came by there was absolutely no sound.   Visibility in Lexington was very far and the sky was clear.  We could see airplanes high in the sky at the time.  These were very very low.  They moved off and disappeared in the distance.   Can't believe  we saw this.  We have no idea what they were.  I could not get a camera quick enough to take a picture.",
      "link": "http://www.nuforc.org/webreports/081/S81974.html",
      "state": "KY",
      "duration": "no more than 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcef4",
      "summary": "Triangular tumbling object with red grey shimmering light flying over highway 95 Lexington Mass morning May 6th 2011",
      "city": "lexington",
      "shape": "triangle",
      "date": "2011-05-12T00:00:00",
      "story": "Triangular tumbling object with red grey shimmering light flying over highway 95 Lexington Mass morning May 6th 2011 Flying along side of highway 95 in Lexington Massachusettes was a triangular shaped, and metallic in color UFO.  One side seemed stretched.  It had a shimmering red grey light.  Had a tumbling pattern of movement but straight motions.  It changed directions in a fast movement unlike a plane.  Was about 500 hundred feet above ground.  If you had put a softball up to the windshield of my vehicle looking through the glass was the approximate size is the best way I can describe it.  I lost site of it above the tree line along side of the highway.  It was traveling East at the time.  Was very visible, and would be impossible for anyone driving on the highway at that time to not see this object also.",
      "link": "http://www.nuforc.org/webreports/081/S81151.html",
      "state": "MA",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd351",
      "summary": "Two red lights seen moving near each other until disappearing.",
      "city": "lexington",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Two red lights seen moving near each other until disappearing. While watching fireworks I noticed two red lights that were stationary.  I asked if my friend could see them too, they confirmed.  I continued to watch for 30 seconds or so after noticing them to see if they were just lights or something else.  They both moved slowly, one moving upward the other down, confirming they were not just lights.  They came to a full stop then started to fade away.  I'm not sure if they were moving away or just faded out of the visible light spectrum.  The whole thing lasted roughly 2 minutes.",
      "link": "http://www.nuforc.org/webreports/090/S90507.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd397",
      "summary": "Spooky Near-Earth \"Space Station\"",
      "city": "lexington",
      "shape": "rectangle",
      "date": "2012-05-13T00:00:00",
      "story": "Spooky Near-Earth \"Space Station\" My wife's name is ((female name deleted)).  She has worked for the state previously, but now works at a daycare part time.  She would never fabricate a story intentionally and I have never heard her say anything else anywhere near as un-explained. UFO reported sighting in Lexington, SC June 2006 Sighted by ((female's name deleted)). Interviewed by ((husband's initials deleted)). This interview comes on account of a recent (in fact today) sighting by my wife.  Since she had seen a previous sighting some years before, I wanted to compile the two and submit them to the web.  This information below is about a sighting she had in the summer of 2006. Spooky, Near Earth Space Station  When my wife first told me about the sighting, she said, \"I think I saw the space station.  It was really weird!  I had no idea what to think back then, her description though fascinating, boggled my mind, so I basically ignored it.  Now I will document that sighting.  Today I interviewed her;  \"It looked like something you would see in a movie.  \"It was big.  I could see the \"person\" in it.\"  If you stretched out your arms straight out at length, in front of you, you would have to spread the fingers about 16-20 inches to equal the apparent length of it. How far away was it?  It was close?   “It WAS close!  I didn't look at it long at all, I simply gasped in shock, and turned around and shut the  door behind me quickly.  All I can say is that it was close!  I saw a “person” with “spiky hair” in it. What direction did it move?  “It was just above the row of “red-tips” (an evergreen shrub of the south U.S.) and it was either hovering or moving slightly to my left. What time of day was it?  “It was midnight.”  What time of the year?  “It was about 2 months after we moved here.”  So that would make it June 2006?  “Yes that sounds right.”  What happened?  “I was on the phone with my friend Melissa.  I didn't want to wake anyone else, so I headed outside.  I opened the side (deck) door, stepped out and there it was.  I said 'Uh-oh!' and turned right around back inside.  I told my friend that I was going to bed and hung the phone up on her right there and then.  I went to bed.” \t“Some days later when I explained to my friend what happened, she said “sometimes you can see the space station.  Maybe that was what you saw.”  But she didn't realize this thing was so near that I could see a 'person' inside it.  But it made absolutely no noise at all.  What was it?!?”  Description:  \tBased upon the witnesses description and testimony, the interviewers best guess at size would be approx 8 feet high by 20-25 feet long, rectangular about 2.5 to 3 times as long as it's height.  “It was white with two large windows directly facing me.”  (Based upon the drawing, these windows covered at least 50% of the exposed area.  There might be about 1.5 feet around the edges (and separating the two), all around the windows comprising the rest of the object.  There seemed to be two seating areas, and a “person with spiky hair” sat on the window to my left.\"  What was \"he\" doing?  \"There was a control panel that 'he' was 'guiding' the craft with.  Any lights?  There was a “regular” yellowish light on inside it, with no lights on the outside.” What was on the other (right) side?  \"Nothing.  It looked the same as the left side, but no-one was there.  I just saw the one “person.”  Conclusion:  \tMyself the interviewer (and husband) know that the story is either an apparition or completely true, but not a work of fiction.  My wife would never make something like this up.  So I wonder what would be the best cause for the sighting? The best match for a man made object would seem to be the cockpit of a large dirigible.  But Amanda saw NO dirigible along the top of the object, and this would have been a much larger portion of the object, but nothing like that was seen.  And the sited object was very low, and CLOSE and it made (she insisted time and again) absolutely NO noise.  Myself (and the family 3-4 years later) have witnessed the travels of a dirigible in the surrounding area about town, and that dirigible maintained at least 400-500 feet above the trees and moved very noisily at maybe 25-35 MPH.  It was flashing a red “billboard” advertisement.  I would have to estimate that the sited (UFO) object was only 200-250 feet above the ground, and only at most the same linear distance, as there was the view of a “person with spiky hair” at the “control panel.”  Unknown Flying Object. ((ADDENDUM FROM SAME WITNESS)) Rectangle with two large portals and a figure at the controls up VERY close. This is an amendment or addition to a previous report I submitted about 3 days ago.  I searched tonight online and found a drawn depiction of a UFO sighting that very closely matches that sighting that my Wife saw midnight 6-1-2006.  My wife said \"Yeah!  That's it!  Except that I didn't see any of the back part.\"   Here is the web-link to that photo:   http://1.bp.blogspot.com/_tlidr95gRew/TU6GTm-CIMI/AAAAAAAABoY/UC36IOfPBV8/s1600/Chile%2BUFO%2B2008%2Bwith%2BHumanoids.jpg   So what my wife saw was a white object very similar to the forward rectangular shape of that picture with a single figure on the LEFT.   She said a yellowish light shone from within.   The sighting lasted only a few seconds, and she fled back inside the house. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/087/S87839.html",
      "state": "SC",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3e4",
      "summary": "During firwork show in Lexinton Michigan I noticed a orange cirlce, getting bigger then smaller again.",
      "city": "lexington",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "During firwork show in Lexinton, Michigan, I noticed a orange cirlce, getting bigger then smaller again. It was doing this for about an hour, moving left from right while changing size.",
      "link": "http://www.nuforc.org/webreports/088/S88870.html",
      "state": "MI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bd592",
      "summary": "Strange flying lights in the nights sky",
      "city": "lexington",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "strange flying lights in the nights sky Last night in the shy a cigar shaped light with a trailing single light, traveling at south western horizon from left to right and turning around or down in what looked like an odd trajectory...  I am not a physics guy but I have seen quite a bit in the sky and that movement was not normal. The obect was no overhead but not far away and for some reason made no noise.",
      "link": "http://www.nuforc.org/webreports/093/S93360.html",
      "state": "MA",
      "duration": "30 seconds?"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc57",
      "summary": "Largest starlike object floats through sky and disappears into.space.  ((NUFORC Note:  Satellites??  PD))",
      "city": "lexington",
      "shape": "sphere",
      "date": "2012-10-30T00:00:00",
      "story": "largest starlike object floats through sky and disappears into.space I have been a sky watcher since my first encounter back in 1985 when I saw my first Ufo.  I see on almost a weekly basis a starlike object floating across the sky at nearly double the speed of a 747 that comes from the northeast and travels south west and disslappears into space within a few seconds. I live near a major airport and know what a plane looks like at 35000 feet.  This is more like 30000 feet to disappearance in a few seconds.  Not sure what I'm seeing but its not a plane.  Someone out there has the answers but I doubt I will find out in my lifetime.  Maybe I don't want to know.  I'm jaded with the whole subject due to the misinformation and lies. We know something is going on but no one is ready to man up with the answers.",
      "link": "http://www.nuforc.org/webreports/093/S93705.html",
      "state": "SC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bddea",
      "summary": "Silent orange balls of light in a straight line formation moving slowly for 5 minutes then dissapeared",
      "city": "lexington",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Silent orange balls of light in a straight line formation moving slowly for 5 minutes then dissapeared I noticed an orange ball of light in the sky and thought it was a meteor at first.  The light was coming from the west heading east too slow for a meteor.  Then I noticed 3 to 4 more orange balls of light spaced evenly like a formation one after the other and thought they could be helocopters.  The Orange balls had no strobe, red or green &quot;aircraft&quot; lights and they were silent.  The objects flew in a straight line in front of me going from my right to my left.  The lead light seem to make a slight turn then dissapeared in open sky.  Then one by one as the other orange objects reached the exact location of the lead object dissapearence they too turned and vanished.",
      "link": "http://www.nuforc.org/webreports/093/S93739.html",
      "state": "SC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf85",
      "summary": "Very small dimly lit object the size of a tennis/ racquetball silently flies a few feet over my house in the night sky.",
      "city": "lexington",
      "shape": "other",
      "date": "2012-11-19T00:00:00",
      "story": "Very small dimly lit object the size of a tennis/ racquetball silently flies a few feet over my house in the night sky. I was sitting in my backyard on a small patio petting my dog when a very dimly light object about the size of a tennis ball/racquetball flew in a straight line just a few feet over my rooftop through the backyard out of site into the trees.  The backyard is about a half acre deep to a fence line which adjoins to a cow pasture.   It is about 50 - 75 feet before the tree line begins in the cow pasture.  Not a bird as it had no wings and was utterly silent.  It did not lose any altitude and was so dimly lit that it disappeared as soon as it passed over.  It seemed to have a very fine, thin trail at least 25+ ft that also dissolved into thin air.  Very eerie experience. I have never seen anything that substantial in size fly in such a straight pattern so quietly in the dark.",
      "link": "http://www.nuforc.org/webreports/094/S94492.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be095",
      "summary": "Disk",
      "city": "lexington",
      "shape": "disk",
      "date": "2012-10-30T00:00:00",
      "story": "On Wednesday evening, I was coming out of my house onto my back porch.  As I came down two steps, I looked south beyond our neighbor's house and saw a disk-shaped object.  It looked like a big black oval in the failing evening light.  I did not see any lights on it.  It flew horizontally.  I only saw it for about 5 seconds before it disappeared into the tree line.  From our house, we can hear when the larger jets land and take off from Columbia Metropolitan Airport.  This object made no sound.",
      "link": "http://www.nuforc.org/webreports/093/S93881.html",
      "state": "SC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be105",
      "summary": "Bright light moving slowly, then stopping in mid air.  Bright green through binoculars.  Returns to same location.",
      "city": "lexington",
      "shape": "changing",
      "date": "2012-10-30T00:00:00",
      "story": "Bright light moving slowly, then stopping in mid air. Bright green through binoculars. Returns to same location. My husband and I go outside a lot at night. This week 3 nights we have seen the same bright light show up around the same location. It is a very bright light and low in the sky.  Through binoculars it is a bright glowing green color. It will move very slowly at times from side to side, up and down and back and forth. Sometimes it moves a little faster when moving.  The photographs I took show the object in colors of green, purple, pink and white and in different shapes. When I am outside it doesn't move as much. When I go inside and look at it from the window, it moves a lot more. This goes on for hours.",
      "link": "http://www.nuforc.org/webreports/093/S93860.html",
      "state": "SC",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3be58f",
      "summary": "Rectangle with two large portals and a figure at the controls up VERY close.",
      "city": "lexington",
      "shape": "rectangle",
      "date": "2012-04-18T00:00:00",
      "story": "Rectangle with two large portals and a figure at the controls up VERY close. This is an amendment or addition to a previous report I submitted about 3 days ago.  I searched tonight online and found a drawn depiction of a UFO sighting that very closely matches that sighting that my Wife saw midnight 6-1-2006.   My wife said \"Yeah!  That's it!  Except that I didn't see any of the back part.\"   Here is the web-link to that photo:   http://1.bp.blogspot.com/_tlidr95gRew/TU6GTm-CIMI/AAAAAAAABoY/UC36IOfPBV8/s1600/Chile%2BUFO%2B2008%2Bwith%2BHumanoids.jpg   So what my wife saw was a white object very similar to the forward rectangular shape of that picture with a single figure on the LEFT.   She said a yellowish light shone from within.   The sighting lasted only a few seconds, and she fled back inside the house.",
      "link": "http://www.nuforc.org/webreports/087/S87929.html",
      "state": "SC",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be714",
      "summary": "White flying object circling star, zipped off, chased by jets, then shot at jets.",
      "city": "lexington",
      "shape": "circle",
      "date": "2012-03-13T00:00:00",
      "story": "White flying object circling star, zipped off, chased by jets, then shot at jets. I was outside, when I noticed something moving up in the sky, I thought it was a plane, but when I looked up, it looked REALLY high up, looked like another star, and it was moving around another star, no blinking lights, after a few seconds,  It zipped off, Next thing I know, at least 5 jets/planes were going straight in its direction, in less than 30 seconds, about 10-15 planes were flying around. I was just watching, when next thing I know,  What looked like a shooting star came flying away from the direction the UFO came from, shot directly towards the planes/jets,  The object seemed to appear out of nowhere, and then disappear out of nowhere,  When the UFO Zipped off, from my perspective it looked to be going 100-150 MPH, and the object it shot seemed to be going twice that.   The UFO was Bluish/Whitish, and the object it shot was white.",
      "link": "http://www.nuforc.org/webreports/087/S87282.html",
      "state": "NC",
      "duration": "A few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be871",
      "summary": "Triangle shaped craft over lexington ky",
      "city": "lexington",
      "shape": "triangle",
      "date": "2012-04-18T00:00:00",
      "story": "triangle shaped craft over lexington ky Monday evening after the ball team won I was outside in my driveway. I could hear the entire town going crazy. Students were screaming and yelling. Sirens of every type was going off. I could smell a little smoke in the air, I knew they had started burning stuff. I could not see the crowd from where I was standing between two homes. The sky was clear no clouds. The moon was bright. I saw a helicopter circling downtown. Then two more joined the first one. I was watching them when I saw a feint shape over downtown. As my eyes focused in I could see a triangular shape. As I watched it I could see a large dark triangle. But you actually couldn’t see the dark part it matched the sky. The three points of the craft had a glow on the underside. May have been the city lights reflecting off it. Made it look like three smaller triangles. That had a slight really light gray shine on the bottom. All flying in a perfect triangle. As it went almost directly over me I could not hear any sound. It was like it was gliding across the sky. It was a little lower than the moon when it passed over. I could see what looked like the side but it was dark to. I never saw any type of light coming from the craft. As it passed over I could no longer see three small triangles. All I could see was two small triangles. I watched them until I could not see them anymore. It came in from the north east over downtown and headed toward the airport.",
      "link": "http://www.nuforc.org/webreports/088/S88337.html",
      "state": "KY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bec4e",
      "summary": "Trangle red light in center with three flashing lights on the back",
      "city": "lexington",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "trangle red light in center with three flashing lights on the back 7/2/13 It was me and my friends in the front of there house we seen a light that just all of a sudden was there and about 30mins later other light came from the ground up very fast and was beside the other light then the one that came from the ground went right over us no sound at all then it just shut off its lights and there was a blinking red light in the center and three flashing lights in the back at first I thought it was a plane but it had no sound and would move back and forth without turning a plane cant do that so I think what I saw was a ufo ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100708.html",
      "state": "KY",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed00",
      "summary": "Orange Fireball/Light seen in south Lexington /  Fayette County travelling from south to south east.",
      "city": "lexington",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Orange Fireball/Light seen in south Lexington/Fayette County travelling from south to south east. I went outside of my home in southern fayette county (Buckhorn Drive and Alumni Drive for a smoke. Noticed a very bright orange light at a medium altitude (about 1000 - 3000 feet) to the due south moving at About 200 MPH. (roughly speed of a helicopter or light aircraft, perhaps a bit slower)  I thought that , perhaps, was landing light from aircraft or helicopter however it was completely silent and completely wrong color.  Bright sodium orange.  I watched for any flashing anti-collision lights and navigation lights.  I saw none.  Nor did I hear ANY engine nose of any kind. Observed object as it made a gentle right hand turn to the east.  (southeast from my location) then flickered out just before I lost sight of it behind nearby treeline. I live just half a mile from the Fayette county area VOR navigation station and under a main approach to Bluegrass field Airport.  I see many many many aircraft in the skies at any given time ranging from Air National Guard C-130's and helicopters to local Medivac flights to the occasional WW2 Aircraft  .. this was NOT any of them.   NOR was this any form of hot air balloon (moved too fast and very light winds)    I am Prior Service Marine and Plane spotter..  I know aircraft.",
      "link": "http://www.nuforc.org/webreports/100/S100518.html",
      "state": "KY",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf167",
      "summary": "Two red/orange orbs moving south to north over east side of Lexington, KY; no sounds",
      "city": "lexington",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "Two red/orange orbs moving south to north over east side of Lexington, KY; no sounds At approximately 11:30 pm EDST (23.30) on the east side of Lexington, Kentucky, on March 29, 2013: My small dog was agitated at the back door, barking excitedly, which is uncharacteristic for her. When I went to see what the matter was, she was excitedly indicating that she wanted to go outside. Normally she will just sit at the door patiently waiting if she wants to go outside.  I let her out, and followed onto the back deck as she descended the steps into the back yard. It was at that point that I noticed a red orb hovering stationary slightly to the north of me, high in the sky. It was too large to be the red wing light of an airplane. It did not move as I observed it for perhaps 30 to 60 seconds. I went inside to get my iphone in order to take a picture, and it was still visible when I returned, but had started moving very slowly in a northerly direction.  I took pictures and a short video (or thought I did; this morning those pictures and video do not appear on my phone, but two others, taken later from the upstairs deck are on my phone.)  My wife had already gone to bed, so I went upstairs to our bedroom, woke her up and told her what I was seeing. There is a second floor deck off our bedroom, and we went there, where the object was still clearly visible, continuing to slowly move in a northerly direction.  I then saw a second identical object which was much closer to us, but about the same apparent altitude, moving south to north. This second object was slightly to the west of us, but nearly overhead. It was moving slowly toward the location of the first object. When we looked back to the last location of the first object, it was no longer visible.  We watched the second object move very slowly—much too slowly for a fixed wing aircraft—in the same south to north trajectory. Eventually the second object disappeared as we watched. It did not go off into the distance, it just disappeared. The apparent size of the objects was the same. My recollection is that at the first sighting of the second object it was about the size of a dime held at arm’s  length. My wife’s recollection is that it was larger, i.e. about the size of a quarter held at arm’s length. We agree that the apparent size was smaller than a full moon. The moon, at the time, was far east of these objects, which were high in the sky as opposed to near the horizon. Unquestionably these objects were not stars, both because of size and the fact that they moved.  As to color, I saw both objects as being red. My wife saw them as being orange, although she also saw what appeared to be a small red “dot” in the center of both objects. I did not observe this “dot”.  Regarding photographs: This morning I looked at the photos on my camera. To my great surprise, there was no video whatsoever, and only one still shot of one of the objects. It appears to be the second one, due to it’s apparent size in the photo. The photo was taken at full zoom on an iphone 5. When the photo itself is enlarged, the object does not appear to be an orb at all, but rather appears to have a crescent shape, with curve on the bottom, but with the top tilted slightly to the west. Upon closer inspection, we thought it appeared to have a “saucer” shape, with the bright crescent being at the bottom. It is also possible the impression appears because of something which may be the “red dot” appears above the crescent. I have not magnified the photo beyond what I can do by zooming into the photo with the iphone. The color of the crescent in the photo is much more white than the appearance of the color to our naked eyes. As I said, I would call it red, although tending toward an orange-ish red as opposed to bright red, while my wife says the color was orange with a “red dot”.  The other photo is completely black, as if only a picture of the night sky. I am baffled as to why there are only two still photos on my phone from last night, and no video whatsoever. I am certain I shot both, downstairs as well as upstairs. My wife thinks that I may have failed to properly take the shots due to my excitement, but I disagree. I clearly recall both the action the phone does after taking a still shot, as well as seeing the video icon active.  At no time was there any sound heard from these objects, at least by we humans. It may be that the dog heard something which caused her agitation.  Backgrounds of the observers: I am an attorney. My wife is a dental tech. I am in my early 60’s; my wife is in her late 50’s.",
      "link": "http://www.nuforc.org/webreports/096/S96834.html",
      "state": "KY",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf628",
      "summary": "Weird Unexplained events.",
      "city": "lexington",
      "shape": "triangle",
      "date": "2013-10-14T00:00:00",
      "story": "Weird Unexplained  events Let me start by saying that these events have accrued over a period of months; I’ll start from the beginning.   A few days after May 31, the release of the movie “After Earth”.  My friend, His Mother, and I were heading back from a local movie theater when we traveled down a back road, we hadn’t been on the road too long before we noticed something catching our eye off to the right of the vehicle, passing the object we paid no mind till breaking in the middle of the lane and reversing  (Please note we were the only ones in the lane or on that certain road)  The driver of the vehicle put it in park before exiting the driver’s side (My friend) His mother and I watch from the passenger seat and the back.  What we saw all of three of describe as;  a bright blinding chrome orb that was sitting stilly at tree top level before moving slowly to the right further across the sky leaving a trail behind it before dissipating into the night.  We had no clue what we had just seen but we all agreed it was not a normal aircraft or an aircraft at all.  We decided to call the local police department to report what we had seen earlier in the evening before feuding to keep it a secret. Over a various of months we had seen the orbs multiple more times it began to scare both my friend and I to the point we didn’t know what to do;  It would do what the first night did. It would move lightly leave a trail and vanish,  Still the same blinding chrome orb, but the freakiness had just began.  My friend and his mother have always lived in the woods, now he’s seen the orbs out there more than twice, but with added affects.  He knows what the sounds of the forest should sound like and look like.  When he steps out of his home late at night he begins to experience strange sounds unlike any he has heard before and has seen figures described as Humanoid, but not quite so.  I on the other hand have not had the “pleasure” of meeting or hearing such creatures, but I have, like him, seen the orbs on multiple occasions. We don’t personally know how to describe the next experience, but I’ll try to.  We don’t know whether to take this a ironic and unrelated dream, but my friend tents to stay with me in my home every now and again because I mostly live alone, one night whilst I was asleep,  He had said he woke up to the light from a street lamp we have in our front yard he moved my curtains to peer out into the yard seeing a sleek, slender, tall man standing motionlessly in the front yard by the lamp,  He said he closed the curtains before returning to peer again the creature closer than before,  He repeated the process till the creature was peering in back at him, he said he tried to wake me to no avail. Ironically he said it stared till day light which is when he “woke up”.  The creature’s facial features where described as boney thin very pale and solid black eyes. The most recent and most creepy and most disturbing one Friday, October 4, 2013 at 3:30am my friend had went outside by our pool to smoke before rushing back in calling my name and calling me outside I casually walk outside to seem him shaking almost dropping his cigarette and pale as a ghost he said he was looking to the stars before seeing a formation over the home that he had not noticed before he was shocked to see that he recognized the “stars” to be the orbs we’ve seen before but in a triangular formation and not emitting a trail as before.  He told me that it had hovered over the home for a few minutes before moving over our pond silently (At tree level) before disappearing and as this was happing he heard nothing it was completely silent till it disappeared.  Not long after dogs began to bark, then multiple whines and whimpers.  Strange sounds fallowed after words such as loud knocking and weird sounds indescribable.  He then went on to add that at the end of a small gate that leads to the dam of my pond he said he once again saw a Humanoid, but this one looked more human than creature despite the fact it was for only split second.",
      "link": "http://www.nuforc.org/webreports/102/S102932.html",
      "state": "SC",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8d5",
      "summary": "Black gliding air craft, blue and red light at the end of  wings, flying low.",
      "city": "lexington",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "Black gliding air craft, blue and red light at the end of  wings, flying low Object was flying very low, the only thing you could see about it however was blue and red lights that were on the ends of what are assumed to be wings.  It was wasn't flying, so much as it was gliding.  It was different then any aircraft I had ever seen.  It was also much quieter then any typical place, which also struck me as odd.",
      "link": "http://www.nuforc.org/webreports/097/S97334.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb82",
      "summary": "Coming home I witnesses 7 glowing orange balls in the sky above lakemurray, lexington sc, they were huge and standing g still.",
      "city": "lexington",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "Coming home I witnesses 7 glowing orange balls in the sky above lakemurray, lexington sc, they were huge and standing g still.  It definitely was not a plane or stars, I tried to take pic with cell phone but it was too dark, then they all disappeared except one.  When I got home and looked outcry my deck,the view was instructed by the trees.",
      "link": "http://www.nuforc.org/webreports/097/S97494.html",
      "state": "SC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc69",
      "summary": "Big star shaped light that went across the sky and went up till it disappeared.",
      "city": "lexington",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Big star shaped light that went across the sky and went up till it disappeared. Big star shape light going across and up into the sky.  No sound, no red lights like a plane or helicopter.  It went straight up and then the light just disappeared.",
      "link": "http://www.nuforc.org/webreports/101/S101577.html",
      "state": "KY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe80",
      "summary": "Orange-colored bright lights or dots high in SE sky; 8-10 pairs moving slowly, independently in Z formation",
      "city": "lexington",
      "shape": "sphere",
      "date": "2013-09-30T00:00:00",
      "story": "Orange-colored bright lights or dots high in SE sky; 8-10 pairs moving slowly, independently in Z formation I live on the southeastern outskirts of Lexington KY.  High in the southeastern sky around 10:25 pm, were 8 – 10 sets of orange/amber colored bright lights or dots.  In pairs of twos in a Z shaped formation, they moved slowly but not in unison (the pairs did not seem to be like headlights).  Some disappeared and reappeared, moving slowly up/down or sideways, but not down; others were constant.  By the time I pulled out of traffic, there were only two independent ones left, and they were fading.  They just faded out one by one. I observed all of this for about 8 minutes (while driving and stopping on road.  (The orange dots were already in the sky when I noticed them, so do not know how long they were totally visible).  When I first saw lights in the sky as making a 90 degree left turn, I thought it was fireworks up in the sky, but quickly realized nothing had been shot upward and nothing was falling back down, as in fireworks.  (Fireworks were a concern to me since my dog would keep me awake all night if she heard one firework.)  Personal demographics;  Very educated, professional Caucasian female, work in high-level technology and would never believe I would be filing a report like this.  Until you see something entirely unexplained, it is hard to fathom.  I am early sixties, working full time as a partner in a start-up nation-wide technology/cyber security business.  I will email a graphic separately.",
      "link": "http://www.nuforc.org/webreports/102/S102818.html",
      "state": "KY",
      "duration": "6-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bff19",
      "summary": "Star-like light followed by normal air-craft",
      "city": "lexington",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Star-like light followed by normal air-craft On 06/24/13 my wife and stepped outside at about 2100. We witnessed a singular light high in the sky, virtually silent traveling from the nw to the se.  Not on the normal flight path to the south of us for ABIA.  It didn't do anything weird or crazy just an oddly bright star-like light.  Much brighter than a satellite and no blinking lights like a plane.  Within 10 to 15 minutes two jets of a fighter type came traveling from the se to the nw at varying altitudes almost retracing the lights path.  I'm an OIF Army vet and my wife was a Navy MA, we both have experience with flight lines and various aircraft.  The star-like light seemed abnormal, the fighter craft did not. Then again on 06/25/13 we stepped outside and planted some chairs to watch. We again witness the star-like light to the east traveling in a more n to s flight path. Again abnormal without blinking lights nor any sound.  We again witnessed two regular type craft approximately 20 to 25 minutes later retracing the star-like lights path.  Too far away to tell if they were fighters or not, but had blinking lights as normal.  Going out again tomorrow and going to try to film it if able.",
      "link": "http://www.nuforc.org/webreports/098/S98927.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0165",
      "summary": "Two orange spheres seen travelling towards storm.",
      "city": "lexington",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "Two orange spheres seen travelling towards storm. I was driving Northeast in Lexington towards a very active lightning storm that was coming in over Columbia when I noticed two bright orange orbs.   They hovered parallel to one another for about 5 to 10 seconds then began moving very slowly towards the Northeast.   I lost sight of them when they passed beyond the top of the tree line.   It is possible they may have been some form of lightning I am unfamiliar with given the sever storm that was coming in from that direction, but the orbs seemed to be ahead of the storm moving towards it.   The entire event lasted about two minutes from the time I spotted them to the time they were out of my view.",
      "link": "http://www.nuforc.org/webreports/101/S101692.html",
      "state": "SC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0392",
      "summary": "15 to 25 orange round lights above Lexington in a formation.",
      "city": "lexington",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "15 to 25 orange round lights above Lexington in a formation We saw about 15 to 25 orange round lights following each other in a formation in kind of a straight line..some of the lights fading out of the formation.  We guessed that the lights could be about 1500 feet up.  The strange thing no sound like you would expect from an aircraft.  This was witnessed in the night sky above Lexington/Columbia SC.",
      "link": "http://www.nuforc.org/webreports/095/S95934.html",
      "state": "SC",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04de",
      "summary": "I looked up into the sky and saw two what I thought were stars.",
      "city": "lexington",
      "shape": "triangle",
      "date": "2013-02-28T00:00:00",
      "story": "I was outside looking for something in my car and I looked up into the sky and saw two what I thought were stars, but they were brighter than all the others which caught my attention.  So I stood there and studied them then they started moving to my right slowly,  As I watched them a third light appeared behind them which formed a triangular formation, which really baffeled me.  So the third light in the back which appeared disappeared about 2 seconds after it appeared.  Then the others disappeared with about a 2 second interval in between each.  The craft was a couple hundred feet above the treeline, was fairly big, made no noise, lights weren't blinking and the way it appeared were as if all the lights were in sync with each other.  I'm not sure if this was one craft or three seperate ones.  Note, As I said when the lights disappeared they didnt fade into the distance nor did they disappear simultaneously it was all at seperate times. They just disappeared where they were.",
      "link": "http://www.nuforc.org/webreports/096/S96397.html",
      "state": "SC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0be7",
      "summary": "Amber-colored lights in triangle formation.",
      "city": "lexington",
      "shape": "triangle",
      "date": "2013-11-11T00:00:00",
      "story": "Amber-colored lights in triangle formation. Three large amber-colored, round, glowing lights seen flying in perfect formation for total of 30-60 seconds before going out of sight range.  No sound noted, stayed in perfect triangle formation of either three individual craft, or one single craft.  Traveled behind building, three witnesses attempted to follow, but craft left range. These amber-colored lights have been seen three x's within this current year to date, only other sightings were single craft.  All sightings were witnessed by at least three individuals each time.",
      "link": "http://www.nuforc.org/webreports/103/S103712.html",
      "state": "KY",
      "duration": "30-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1150",
      "summary": "Disk with green & white plusing lights and shoots in air when approach.",
      "city": "lexington",
      "shape": "disk",
      "date": "2014-02-07T00:00:00",
      "story": "Disk with green & white plusing lights and shoots in air when approach. It was dark outside and on the way taking kids to school.  My nephew states look a cop plane and as we got closer it appeared to look like a UFO with green and white lights plusing.   I turned down old two notch road behind c-mart across from b-que resturant and when approaching the UFO it suddenly shot up in air  when I became close and as I passed the site where UFO was it dropped back down once I left the area.",
      "link": "http://www.nuforc.org/webreports/106/S106927.html",
      "state": "SC",
      "duration": "1-2"
    },
    {
      "_id": "64d005f478aba2ec5a3c14a9",
      "summary": "Orange lights.",
      "city": "lexington",
      "shape": "light",
      "date": "2013-12-02T00:00:00",
      "story": "Orange lights were silent and flying one behind the other then disappearing at the same place in the sky and were not flashing or blinking they were steady.   About two minutes later a plane came through on the same path of the orange lights were on looking for the lights but the lights were gone.",
      "link": "http://www.nuforc.org/webreports/104/S104925.html",
      "state": "SC",
      "duration": "10 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a90",
      "summary": "Amber-red diamond swarm of 4 succsessive sightings, each with infant trailing lights, seen over Lexington, KY.",
      "city": "lexington",
      "shape": "diamond",
      "date": "2014-07-11T00:00:00",
      "story": "Amber-red diamond swarm of 4 succsessive sightings, each with infant trailing lights, seen over Lexington, KY. The following sightings were observed by two individuals between 11:30 Est and 11:45 EST over Lexington, KY.  Four identical and unrecognized lights, amber-red in color and roughly diamond shaped, with the weight of the diamond pointing downward, appeared from the east, on a low approach, less than 90 seconds apart. These light configurations, shape, and behaviors were unlike anything either of the observers had previously seen.  The lights were at least three times the height of typical commercial air liner lights relative to the apparent altitude and distance, were only made up of one color, amber-red, and did not have any obvious flashing patterns.  We live less than 3 miles from LEX airport and are very familiar with mundane commercial aircraft, helicopter, and private general aviation light patterns, color, and flight paths in this area. All four diamond lights followed the same flight path.  The flight path approached Lexington from the east-south east and at a low angle over the tree line.  In all four instances, the lights seemed to move slowly over the north-east portion of the city before turning to the due north.  They followed the same accent, flying at an approximate 30 degree angle upward, relative to their approach angle.  All four diamond lights disappeared in succession, 30 seconds apart and in about one third of their approach time. In each case, and at a similar point over the city, a small red flash was seen to drop away from the parent lights.  These occurred in the same fashion with each parent light, with the exception of the last and fourth light. The Last and fourth light followed the same path and dropped a similar flash from the parent light and at the same location as the previous three, except, the fourth diamond shape dropped two additional small lights approximately 15 seconds apart for a total of 3 dropped infant lights before turning to the north and disappearing in the same fashion and direction as the previous three. The infant lights from all four sightings had a visible duration of less than two seconds before disappearing from view.  Each infant light was of the same or similar color and brightness as the parent lights, but about one-one hundredth the size.  All infant lights had the same angle of drop which was 90 degrees straight down relative to the earth. Approximately two minutes after these sightings, a commercial air liner made an approach to the Lexington Airport from the east-southeast.  This approach seemed  unusual, relative to the average airline approach, in that the airliner's approach was unusually shallow. Additional high level air traffic was observed for several minutes after, moving north-easterly from the south-west, due east from the west, and north-westerly from the south-east respectively, several minutes after the initial sightings. Both observers are male professionals in their early 50's and college educated.",
      "link": "http://www.nuforc.org/webreports/111/S111153.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d3e",
      "summary": "A very bright light that moved quickly and low across a large distance.",
      "city": "lexington",
      "shape": "circle",
      "date": "2014-07-11T00:00:00",
      "story": "A very bright light that moved quickly and low across a large distance. i was looking out my window when i noticed a large bright light to low for a star and to bright and fast to be a plane it moved at great speed and made very sharp turns in a zigzag pattern from side to side the light was not flashing either it was a steady bright white or very pale blue light.  i was not a ufo, alien believer or serious beliver until tonight, what i saw was very strange and a bit scary i have seen many planes in the sky before and this did not look like a plane what really gave it away was the turns and speed of turns",
      "link": "http://www.nuforc.org/webreports/111/S111368.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2109",
      "summary": "Streak of light across Mars.",
      "city": "lexington",
      "shape": "other",
      "date": "2014-04-24T00:00:00",
      "story": "Streak of light across Mars. At approximately 8:30 pm (04/19/14), I was sighting my telescope in on the planet mars.  The sun had set behind me (to the west) but the sky was still to bright to see anything in that direction, thus I was looking easterly.  At the time I was looking through a 40 mm lenses and using an 80mm telescope which gives approximately 10X magnification.  At this magnification mars fills about ½ the visual field. This is when something transited from right to left (south to north) through the field of view at what appears to be Mars’s equatorial region.  This is to say, it was observed in the field of view beyond Mars and passed somewhere between earth and Mars, exiting my field of view well past Mars.  Indicating it was NOT on Mars, but between Earth and Mars.  (Perhaps, this object was in Earth orbit?)  This pass lasted for only a fraction of a second and the object appeared white (I am color blind, but it appeared white to Mars’s red body with white polar caps as I see them.)  This object was tiny, almost appearing as a grain of sand. I immediately pulled my head back to see with my unaided eye, but saw only Mars.  (Note: no other planets nor stars were yet visible due to the fading sunset.)  My binoculars (25X70) were next to my telescope, so I grabbed them and scanned the area but saw nothing.  The object was gone. At this point, I ruled a lenses flair, the angle of the sun and my telescope was incorrect.  Due to the recent freezing temperatures, there were no insects flying around and insects have never been visible to me through that level of magnification.  I considered a satellite, but the orbit seems wrong and the app on my phone did not show any satellites in that vicinity. I am not entirely certain this was a craft…I do not know what it was, but if others saw this, I would like to validate their sighting.",
      "link": "http://www.nuforc.org/webreports/108/S108776.html",
      "state": "KY",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c22d1",
      "summary": "White light:  Fast and abrupt change of directions.",
      "city": "lexington",
      "shape": "light",
      "date": "2014-04-11T00:00:00",
      "story": "White light: Fast and abrupt change of directions. It almost appeared to be a plane in the distance, but it was dropping so quickly, as if on purpose.  Then it leveled out, began to fly straight for probably 2 seconds, then quickly dove towards the ground again as if to land.   It was moving way to quickly to be an air plane, and it's abrupt up and down movements could never be made by a man made aircraft.  It was just a white light.",
      "link": "http://www.nuforc.org/webreports/108/S108396.html",
      "state": "KY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c23fd",
      "summary": "8 Red-Orange Lights moving across the sky, then fading observed by several witnesses.",
      "city": "lexington",
      "shape": "formation",
      "date": "2014-03-27T00:00:00",
      "story": "8 Red-Orange Lights moving across the sky, then fading observed by several witnesses. Driving up Hwy Number 1 in Lexington, near Calks Ferry Road.  Saw weird arrangement of 3 red-orange lights above a cell tower.  After doing a double take I noticed the lights weren't as bright as the cell tower's lights and were much higher.  My fiancee then asked if I was seeing the 5 lights that were lined up in the sky.   I looked right and sure enough there were 5 more lights not to far from the original 3 I saw.  They were slowly moving across the sky to the West.   We then noticed several cars pulled over on the side of the road with people staring up and pointing.   I pulled over on Calks Ferry Rd. and my Fiancee got out of the car, another car coming the opposite direction pulled up and the driver and her friend asked if we were stopped because of the lights, which to me confirmed we weren't just seeing things. The lights that were lined up in a line started fading first, one after the other.   Then the 3 I originally saw in a triangle formation all faded at the same time.   They were clearly visible for at least 3 minutes.",
      "link": "http://www.nuforc.org/webreports/108/S108031.html",
      "state": "SC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c27ba",
      "summary": "Bright red-orange object that looked like a star.",
      "city": "lexington",
      "shape": "light",
      "date": "2014-11-21T00:00:00",
      "story": "Bright red-orange object that looked like a star. I came outside and saw a bright red light that looked like the north star except for color.  My first instinct was to go and get my camera.  But instead I just stood and watched it thinking maybe it’s just a plane, because it was moving slowly across the sky.  I thought that planes all have flashing lights and all I saw was this magnificent bright red light that appeared to be slightly orange in color like maybe it had a white light in the middle.   It moved from probably south to north and all of a sudden it just dimmed and went out.  I thought it may have went behind clouds.  I looked hard into the sky and all I could see was stars and even a jet with its flashing lights at a very high altitude.   What I saw appeared to be at a low to medium altitude and not obscured by any tree line.  So I had a clear view of it until it just disappeared.  I hate that I didn’t get my camera.   It’s the first time in my 50 + years that I have ever witnessed such a sight.  I guess that’s what I get for being skeptical and thinking it has to be a plane.",
      "link": "http://www.nuforc.org/webreports/115/S115400.html",
      "state": "SC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c27d3",
      "summary": "It was one light then many, and then one again.",
      "city": "lexington",
      "shape": "formation",
      "date": "2014-11-06T00:00:00",
      "story": "It was one light then many, and then one again. I was on my front porch when I saw a single light staying motionless but was blinking rapidly like a helicopter, but then numerous small craft, blinking just like the mothership, began ejecting from the larger craft and then they started to perform erratic movements around the mothership and then after maybe 8 minutes they disappeared and the mothership started moving at a slow but constant straight path away from the area until it was out of sight.",
      "link": "http://www.nuforc.org/webreports/114/S114680.html",
      "state": "KY",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a22",
      "summary": "Fast moving grey mass spherical not defined hot looking orange aura bottom edge no lights complete stop and direction change 3 times.",
      "city": "lexington",
      "shape": "sphere",
      "date": "2014-11-21T00:00:00",
      "story": "Fast moving grey mass spherical not defined hot looking orange aura bottom edge no lights complete stop and direction change 3 times. Stepped outside to watch the Leonid meteor shower for a while, was staring straight up towards the radiant in the constellation Leo, movement to the right of me SW.  Glanced over to my right and saw a fast moving object lightly orange like metal starting to get hot but not bright moving Southwest to South in direction.   I thought  we'll that's no Leonid meteor and did a double take because it never flared up or fireballed like I was seeing, plus it was moving in the wrong direction for the meteor shower.   So I continued to watch it move and noticed that it had shape, like a grey mass, spherical but not defined.  I thought maybe it was an owl, but it was orange hot on the bottom edge.  Then it stopped dead still in the sky, thats when the hair on my neck stood up.   It stopped, and made an immediate change in direction due South for about 1 second, then stopped again, changed direction again and moved East, stopped a third time and then just accelerated incredibly fast South out of sight.  If it was an owl, it had a hot rear end and had reason to move that fast.  Pretty incredible sighting. A first for me and I'm an amateur astomomer, I am always looking up at the night sky.",
      "link": "http://www.nuforc.org/webreports/115/S115440.html",
      "state": "KY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c32",
      "summary": "Saw several orange balls of light in the sky as I was driving down Limestone and turning onto Loudon Ave.",
      "city": "lexington",
      "shape": "light",
      "date": "2014-09-18T00:00:00",
      "story": "Saw several orange balls of light in the sky, as I was driving down Limestone and turning onto Loudon Ave. Lights seem to be surrounding a huge slow moving object. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113538.html",
      "state": "KY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c2ecc",
      "summary": "One circle shaped light in the sky, sat still for several seconds and then darted across the sky.",
      "city": "lexington",
      "shape": "light",
      "date": "2014-08-22T00:00:00",
      "story": "One circle shaped light in the sky, sat still for several seconds and then darted across the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112578.html",
      "state": "KY",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c30c1",
      "summary": "My family is visiting a small town on Lake Huron, just an hour north of Detroit. My grandparents own a small cottage in a semi-resident",
      "city": "lexington",
      "shape": "light",
      "date": "2014-08-15T00:00:00",
      "story": "My family is visiting a small town on Lake Huron, just an hour north of Detroit.  My grandparents own a small cottage in a semi-residential area with other small summer-houses around them.  The area is beautiful and serene, and every evening we enter the dirt roads of the farms across our main expressway to the town's center to spot deer.  This tradition has been carried down from generation to generation, as my family has lived in Michigan since the mid 17th century. The anomaly I witnessed tonight was strange and erie, yet fascinating; an orb of light darted and hovered about 19 miles to the side of of our car for about a minute or less. We had stopped to watch the sunset, a beautiful one at that, and watched the dazzling colors of maroon and orange descend to the east.   However, after the sun set, my grandmother noticed a single orange light hovering in place for about 10-15 seconds.   We watched it for a little bit, but as we started the car up, the engine made the usual raucus noise that it does.  It was at this time that I noticed the light darting up to the right of its former position.   I don't know if it was the engine or our presence that startled it, but as it flew away it began to morph colors to match the darkening sky, and within seconds was gone, camouflaged like a chameleon. I have alway believed in life beyond our solar system, and even intelligent life.  I would have never imagined to see something like this in my life. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112450.html",
      "state": "MI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3266",
      "summary": "Loud rumbling noise, 2 vertical white lights, smaller red ones, massive vehicle moving to northwest",
      "city": "lexington",
      "shape": "unknown",
      "date": "2015-03-06T00:00:00",
      "story": "Loud rumbling noise, 2 vertical white lights, smaller red ones, massive vehicle moving to northwest. Lexington, TX  At about 2 AM, January 7, 2015, my husband and I heard what sounded like a loud, rumbling engine noise going over our house.  (The noise was not as smooth as a jet, and it was much louder.) He ran out and called to me.  I went outside, too. We couldn't see anything at first. Then, to the northwest and moving in that direction, we saw two pulsing white lights arranged vertically with a lot of space between them. My husband said there were a lot of smaller red lights all around them.  (My night vision isn't too good.)  They were moving as if in a formation, but it wasn't an orderly formation.  It almost seemed like it was one huge vehicle, because all the lights were moving as one.  It would have been a massive vehicle, and indeed, it sounded huge.  All of the neighborhood dogs were barking loudly when this came over.",
      "link": "http://www.nuforc.org/webreports/117/S117499.html",
      "state": "TX",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3451",
      "summary": "I saw 3 sphere shaped fire orange colored objects in the sky.",
      "city": "lexington",
      "shape": "sphere",
      "date": "2015-03-06T00:00:00",
      "story": "I saw 3 sphere shaped fire orange colored objects in the sky. We were coming home from Myrtle Beach, SC, and when we were pulling into our home, I looked out of the window and saw what looked like orange and red fire maybe in a sphere shape.   I saw the first one and followed it and it disappeared,  I thought that was it and was very confused about what I had seen, I then saw another one and another.  It was glowing.",
      "link": "http://www.nuforc.org/webreports/117/S117478.html",
      "state": "SC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d0d",
      "summary": "Bright orange lit saucer going over Lexington, NE, north to south.",
      "city": "lexington",
      "shape": "disk",
      "date": "2015-07-03T00:00:00",
      "story": "Bright orange lit saucer going over Lexington, NE, north to south. We were just sitting out on the porch smoking a cigarette when i looked up and saw this huge orange light in the sky..  i immediately ran in the house and got everyone outside to look..  it approached from the north headed south and continued south till it disapeared..   at the point that it was just over us we could see that it was pretty large, saucer shaped... only one single light...  Orange... glowing for the top of the vessel. I DO have a video of the object but it is as it was further away and leaving the area, however my camera is very high quality...  if i am contacted further by an investigator I will share the video.",
      "link": "http://www.nuforc.org/webreports/119/S119793.html",
      "state": "NE",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e6a",
      "summary": "Strange light in the sky seen while camping",
      "city": "lexington",
      "shape": "light",
      "date": "2015-06-15T00:00:00",
      "story": "Strange light in the sky seen while camping I went out camping in the summer of 2005 with my scout troop.  We were camping on private property near Lexington, SC.  The event happened late at night while we were watching the fire and talking.  One of the troop leaders said that he had been watching a satellite that was crossing the sky, and then it had just stopped.  He pointed out to us where it was.  At first it just looked like a star in the sky.  It seemed a little odd because satellites usually blink and are not a constant light. After a while the light started to move around erratically.  This continued for some minutes then there was a small flash and the light split into two pieces.  After this happened one piece just stayed still and the other piece darted off across the sky.  I have no idea at the speed but it must have been pretty quick.  The other piece stayed there a while more and then it started to act erratically again.  After some time it then too darted off across the sky in the opposite direction. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119456.html",
      "state": "SC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4049",
      "summary": "Two extremely large red lights on a diagonal blinking simultaneously and moving very slowly for about 10 minutes.  No sound.",
      "city": "lexington",
      "shape": "light",
      "date": "2015-06-05T00:00:00",
      "story": "Two extremely large red lights on a diagonal blinking simultaneously and moving very slowly for about 10 minutes. No sound. I am a retired 64 year old woman, and not crazy!   I was walking the dogs at 10:30pm.  I noticed two very large red lights blinking simultaneously about 5-600 (maybe more) feet apart on a diagonal.   I quickly put the dogs in the house and grabbed my cell phone to film the unusual lights.  Nothing seemed to be showing up on my phone at all.  (Later, I was able to capture a section of the video that shows light streaks and not the two red orbs.)   I continued to watch them until they were out of sight - about 10 minutes.  There was no sound, and they were moving extremely slow.  They stayed in the same formation the entire time.   These lights were too large to be from any plane and the angle was like nothing I have seen before.  Had it been a plane, I would have heard some kind of sound and the lights would not have been on a diagonal or as large as they were.   I have never seen anything fly this slowly and still stay in the air. This is my second sighting in Lexington.  The last unusual sighting was a large white light - like a very large star - that moved very quickly with no sound.",
      "link": "http://www.nuforc.org/webreports/119/S119337.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c416c",
      "summary": "Single bright light the size of a large star moving faster than jet with no sound.",
      "city": "lexington",
      "shape": "light",
      "date": "2015-04-30T00:00:00",
      "story": "Single bright light the size of a large star moving faster than jet with no sound On Wed., 4/22, at 11:05pm, my 41 year old son (career military) and I were looking at the moon with a telescope.  There were scattered lower clouds.   While he was looking in the scope, I was looking at the sky.  Suddenly, I noticed a bright, white  light, about the size of a large star, pass from my right to left in an open, cloud free space in the sky.  I quickly got my son’s attention.  He looked up and saw it two seconds before it went behind a cloud.  I watched to see if it would come out the other side and it did not.   It was moving faster than a jet and made no sound.  There were no flashing lights.   The event lasted about 8 seconds.",
      "link": "http://www.nuforc.org/webreports/118/S118635.html",
      "state": "KY",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c507e",
      "summary": "Cylinder shaped flying object flying low with blue lights coming from bottom.",
      "city": "lexington",
      "shape": "cylinder",
      "date": "2016-03-04T00:00:00",
      "story": "cylander shaped flying object flying low with blue lights coming from bottom. I was driving home from work at about 10 P.M., when I saw a very bright, white light in the sky.  At first I thought it was a star or one of our planets in Earth’s view but then it started getting closer.  I rolled down my window and looked up as it was flying into my line of vision. It had a red light flashing every few seconds as a normal airplane would, and it sounded like a helicopter. I thought it was a helicopter until it passed directly over me and I was completely shocked. The flying object looked like a missile or a spaceship.  It was cylinder shaped with no wings, and appeared to have blue lights on the bottom. It was flying lower to the ground than an airplane would fly in a residential area.  I would estimate it was flying at about 150 to 200 mph.  (It was traveling slow enough to make the object out.  It wasn’t just a blur.)   I’m certain this unidentified flying object was not any commercial airplane or helicopter.",
      "link": "http://www.nuforc.org/webreports/126/S126176.html",
      "state": "KY",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c558e",
      "summary": "Heard a low flying loud helicopter while standing outside at 11pm, both my husband and myself walked out to look and saw red blinking l",
      "city": "lexington",
      "shape": "sphere",
      "date": "2016-07-08T00:00:00",
      "story": "Heard a low flying loud helicopter, while standing outside at 11pm, both my husband and myself walked out to look and saw red blinking lights from a low flying helicopter and two white orbs in front of it like and escort.  Did not see them when craft was approaching, only its red flashing lights, but as it went over the top and just past, I seen the two white orbs that looked equally spaced and almost uniform with the helicopter all where going slowly towards the east out of sight.  Not exactly sure what it was just that it was strange.  May have been a drone.  Not sure if military helicopters escort drones. ((NUFORC Note:  We doubt that drones are often accompanied by helicopters.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128062.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ebe",
      "summary": "Lexington, KY, Transparent ball shaped craft no noise and very large 10 minutes",
      "city": "lexington",
      "shape": "sphere",
      "date": "2016-10-21T00:00:00",
      "story": "Lexington Kentucky Transparent ball shaped craft no noise and very large 10 minutes Was out for a walk with my girlfriend we were in front of the itt school on man o war Blvd drive she said look and when I looked up I saw a huge  ball shaped transparent sphere and I could distinkly tell it was a perfect circle it made no noise nothing at all and it was really close like maybe four stories above the ground we both seen it and it saw us we waved at it we were both a little shaken and not wanting to believe what we have seen no lights it's like you could see the clouds behind it through its entire shape been scared to report it because we didn't want to be labeled two nuts who sees transparent flying craft it didn't make any noise at all to myself it wasn't anything I have ever seen before and in my belief it was of alien origin and I still believe that it was not from this planet. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130698.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c601f",
      "summary": "Three pairs of white fireballs with short contrails.  ((NUFORC Note:  We suspect six contrails.  PD))",
      "city": "lexington",
      "shape": "fireball",
      "date": "2016-10-21T00:00:00",
      "story": "Three pairs of white fireballs with short contrails. Seen three separate pairs of white fireballs with short contrails  slowly moving thru the sky.  Once behind the trees they were gone.",
      "link": "http://www.nuforc.org/webreports/130/S130679.html",
      "state": "SC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6394",
      "summary": "2 lights combined to become one and dissapeared.  ((anonymous report))",
      "city": "lexington",
      "shape": "unknown",
      "date": "2016-08-16T00:00:00",
      "story": "2 lights combined to become one and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129064.html",
      "state": "SC",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c69d9",
      "summary": "White, shimmery, oval, very large, hovering object.  ((anonymous report))",
      "city": "lexington",
      "shape": "oval",
      "date": "2017-03-10T00:00:00",
      "story": "White, Shimmery, Oval, very Large Hovering object Walked outside to unpack car, and suddenly felt as if I was being watched.  Looked up and saw a large bright white oval shape in the southern direction.   Stared at it for several seconds, but it didn't appear to move.  Bent down into car, then back up, and it was still there.   Then I pulled a few more things out of the car, and when I stood up it was gone.  It looked like a \"full moon\" that had been pushed into an oval disc.  It was very large and shimmery white. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133014.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a5d",
      "summary": "Oval appeared out of nowhere, green lights in front orange back with tracer, darted across sky, lights  off and black oval hoovered",
      "city": "lexington",
      "shape": "oval",
      "date": "2017-02-17T00:00:00",
      "story": "oval appeared out of nowhere, green lights in front orange back with tracer, darted across sky, lights  off and black oval hoovered I was outside of a house on the deck in Andover neighborhood. It was between 12am and 2am, I'm not certain the exact time.  I was staring into the sky when a oval shape appeared, in the front of the oval was fluorescent green and the back of the oval was fluorescent orange.  The orange could have been the tracer of a propulsion system.  The shape darted across the sky with speed I have never scene and in 3 seconds it stopped mid air and the lights went off.  After the lights went off I could see a black oval float in the air for about 8 seconds before vanishing.  If I hadn't been following the object while it was illuminated I would have never spotted it while it was black.  I have absolutely no explanation for what I saw but it was not a comet event though it had a tracer.  Comets don't light up then go dark and hover before disappearing altogether.  I will say this was perhaps the most extraordinary thing I have ever seen in my entire life.  The event left me aw! estruck.",
      "link": "http://www.nuforc.org/webreports/132/S132643.html",
      "state": "KY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f2c",
      "summary": "Bright green oval light with orange halo shoots across Lexington sky.  ((anonymous report))",
      "city": "lexington",
      "shape": "oval",
      "date": "2017-07-07T00:00:00",
      "story": "Bright green oval light with orange halo shoots across Lexington sky. Three friends and I were sitting on our back porch having a cigarette and two of us facing towards our left and their right jumped up and pointed it out.   Myself and the other friend quickly spun around to see a bright green oval shooting across the sky encompassed by an orange halo that quickly shot to the tree line to my left and out of sight. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134756.html",
      "state": "KY",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7093",
      "summary": "The object appeared to plummet out of the sky as a light blue light of some sort and was lower than a plane would fly. I know this beca",
      "city": "lexington",
      "shape": "triangle",
      "date": "2017-08-04T00:00:00",
      "story": "The object appeared to plummet out of the sky as a light blue light of some sort, and was lower than a plane would fly. I know this because I could see the edges of the craft. It had 3 bright lights located at each point of the triangle.  The object disappeared behind a cloud.  Within five minutes, I saw two helicopters, and quite a few planes (way more than normal), head into the same direction the craft or object disappeared",
      "link": "http://www.nuforc.org/webreports/135/S135419.html",
      "state": "NC",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c71b6",
      "summary": "4 strange unidentified lights over Lexington, KY.",
      "city": "lexington",
      "shape": "circle",
      "date": "2017-07-14T00:00:00",
      "story": "4 strange unidentified lights over Lexington, KY. 3 of us had just arrived back at my step-daughter's appartment, when I noticed 4 circle shaped obj cts traveling southward in the sky.  They appeared to be 3000 to 5000ft or maybe higher.  They were white in color and had no aircraft marker lights.  I estimate that they were moving around 90 knots.   I didn't have my phone handy but did have a pair of binoculars in my car.  I grabbed them and zoomed in to only see 4 white round lights, and as before mentioned, there were no type of any aircraft marker/navigational lights on the objects.   As they continued southward towards the horizon, a neighbor approached and asked what were we looking at.  Once we told her, we gave her the binoculars, and she witnessed them as well.   When we first observed these 4 lights, the formation was one in front, then some space, then two closer together, and more space, and finally the fourth following.   There was absolutely no sound emitted from these craft or objects. Final visual on these! objects before last seen, with binoculars, they were in the southern sky, but their formation had changed and appeared in a pyramid form from left to right.   I do not believe they were any type of convential or earthly aircraft.   These objects were white circle lights without proper navigational lighting and again, emitted no sound at all.",
      "link": "http://www.nuforc.org/webreports/135/S135047.html",
      "state": "KY",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7230",
      "summary": "Witnessed a pulsating green light in the sky, looked to be a plane.  Was consistently blinking. ((anonymous report))",
      "city": "lexington",
      "shape": "circle",
      "date": "2017-07-07T00:00:00",
      "story": "Witnessed a pulsating green light in the sky, looked to be a plane.  Was consistently blinking, when it moved straight down, about 10 miles in an instant.  Object then moved left almost 10 miles in less than a second.  Stayed for about 10-15 seconds, then head west at an intense speed.   Watched fireworks about 20 more minutes.  Object appeared tracking back to the original position east at an extreme speed.  Light still consistently pulsating, then traveled north and into clouds out of eyesight.  Almost seemed to be observing fireworks. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134957.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c722d",
      "summary": "Large, bright, orange constant light about 2000 ft up, traveling East to West over Lexington during fireworks with no sound.",
      "city": "lexington",
      "shape": "light",
      "date": "2017-07-07T00:00:00",
      "story": "Large, bright, orange constant light about 2000 ft up, traveling East to West over Lexington during fireworks, with no sound. I was sitting on the steps watching the kids shoot off fireworks. I notice a very large, bright, orange constant light about 2000 feet up moving East to West over us.  I yelled to the boys in the street to look up and said, \"Hey guys, what's that?\"   I watched it for 60 seconds.  The speed was faster than a single engine plane and made no sound.   Occurred at approximately 10:15pm.",
      "link": "http://www.nuforc.org/webreports/134/S134923.html",
      "state": "KY",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7586",
      "summary": "Last night 4-25-17 about 11:00 pm I was looking at the stars. I saw a round shaped object with white, yellow, red lights moving.",
      "city": "lexington",
      "shape": "circle",
      "date": "2017-04-28T00:00:00",
      "story": "Last night, 4-25-17, about 11:00 pm, I was looking at the stars.  I saw a round shaped object with white, yellow, red lights, moving not in a normal way an air craft would.  It moved up down and to the sides in seconds.   Next thing I know, it started moving close to my balcony has if it knew I was watching.  It got close to the street.  It was hovering, the birds on the tree scattered and I ran inside scared...  Couldn't believe what I had just witnessed.   Put me in a lie detector test.  I know what I saw.  It lasted about 12 minutes.  Try to capture with my cell, I just couldn't, it moved too fast.  Never thought this will happen to me.  The images are vivid in my mind.  I actually ran inside my house.  That's how scared I was. ((NUFORC Note:  We spoke via telephone with the witness, and she sounded to be quite sincere about the sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133831.html",
      "state": "KY",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7905",
      "summary": "A star-like object was seen during the day, before it changed to a bright red and vanished.  ((anonymous report))",
      "city": "lexington",
      "shape": "unknown",
      "date": "2017-12-04T00:00:00",
      "story": "A star-like object was seen during the day, before it changed to a bright red and vanished. I was on my way home from school at about 5:30 pm EST, when I saw what looked to be a star to the West of where I was.  This confused me, since the sun had not completely gone down yet, and the 'star' was as bright as Polaris on a dark night.   About 1 minute passed before a cloud covered the 'star'.  When it emerged about 1 minute later, it was glowing a bright red.  It had not moved from its position the entire time, so it didn't seem to be a plane or jet.   About 30 seconds passed before a cloud covered it again.  The cloud completely passed after around 10 seconds, but the 'star' had completely vanished.   I asked someone in the car if they saw it, but she didn't seem to notice it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137517.html",
      "state": "SC",
      "duration": "~3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ca2",
      "summary": "Loud, low-flying black rectangles.  ((anonymous report))",
      "city": "lexington",
      "shape": "rectangle",
      "date": "2017-10-05T00:00:00",
      "story": "Loud low flying black rectangles. Loud rumblings shook house, very large black rectangles blocking out stars heading north, no lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136567.html",
      "state": "TX",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c98",
      "summary": "Almond shaped UFO flying back and forth from apartment for at least 5 minutes.",
      "city": "lexington",
      "shape": "other",
      "date": "2017-09-21T00:00:00",
      "story": "Almond shaped UFO flying back and forth from apartment for at least 5 minutes. It was around august the 13th i want to say, the year was 2013.  Well one night i was in my apartment watching an episode of Scooby-Doo, i believe the one with the Harlem Globetrotters or the red bearded pirate guy.  Well anyway, i was watching scooby-doo and all of a sudden something outside caught my eye!  I got up to go and see what was out side and there i saw it! i saw this almost almond shaped thing flying probably a good 100-300 feet adjacent from my balcony.  At least that's what it looked like anyway.  It went back and forth and back and forth for about a good 5 minutes before going behind a tree and vanishing. We do get airplanes and helicopters that fly by allot though, but i know an airplane or helicopter when i see one! It made no noise or anything and airplanes can't go back and forth so easily with out major turns. It also had two sets of lights in three rows.  Blue, red and what i can only describe as moon light like color; almost yellow or peach even. ((NUFORC Note:  For some reason, witness indicates that the date above is approximate.  Hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136173.html",
      "state": "KY",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f1d",
      "summary": "Couple noted a black, triangular shape object hovering above her house.  ((NUFORC Note:  Case from MUFON Case Man. System.  PD))",
      "city": "lexington",
      "shape": "triangle",
      "date": "2018-04-26T00:00:00",
      "story": "Couple noted a black, triangular shape object hovering above her house. Witnesses were lounging in the grass of the backyard with their dogs when the lady noted a black, triangular shape object hovering above her house.  They were both laying on their backs and it was directly above them in the sky.   She looked at it for at least a minute before pointing it out to her boyfriend, who then also studied it...he confirmed that it was black (or at least dark) and triangular shaped.  It seemed to be pointing in an easterly direction...as they lay there discussing it for at least another minute.  They watched the object slowly rotate (as if on an axis) in the completely opposite direction (west) - making no noise and showing no fuel trails- and then it was just gone.  (MUFON 59404)",
      "link": "http://www.nuforc.org/webreports/139/S139593.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c829f",
      "summary": "((HOAX))  A humanoid data craft was seen near the classroom building on UK campus. It seemed to be exploring data.",
      "city": "lexington",
      "shape": "other",
      "date": "2018-09-27T00:00:00",
      "story": "A humanoid data craft was seen near the classroom building on UK campus.  It seemed to be exploring data",
      "link": "http://www.nuforc.org/webreports/143/S143185.html",
      "state": "KY",
      "duration": "50 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c89ee",
      "summary": "I run a Facebook news group and have had several people report seeing a blue light in the sky southeast of Lexington. They are also rep",
      "city": "lexington",
      "shape": "light",
      "date": "2019-09-06T00:00:00",
      "story": "I run a Facebook news group and have had several people report seeing a blue light in the sky southeast of Lexington.  They are also reporting their house lights vehicle lights dimmed or blocked off then back on during the sighting of the object.",
      "link": "http://www.nuforc.org/webreports/148/S148510.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b07",
      "summary": "I looked out kitchen window watching birds i feed when i saw small Silver disc flying fast from south Immediately I heard a chopper fly",
      "city": "lexington",
      "shape": "circle",
      "date": "2019-03-14T00:00:00",
      "story": "I looked out kitchen window watching birds i feed when i saw small Silver disc flying fast from south.  Immediately I heard a chopper fly around my house then saw it meet disc head-on and tilt downward to right as the disc just vanished.  My rental neighbor behind me was leaving her house with dog for a walk and both she and dog looked up at chopper also.  It was loud and low.  I tried to tell mufon but email won't go thru.  I have seen these silver disc before years ago flying around an air force plane in maneuvers maybe.  We watched them for 30 min. I've never seen this in the city tho.   On my phone now not sure if this will go thru.  Last time I talked to any of you, 3 men 6'8 or taller came upon me and my infant children in parking lot and another man dressed like Lord of yesteryear old outdated clothing came upon us and scared me to my knees grocery store.  They were mad I talked to Professor Jacobs",
      "link": "http://www.nuforc.org/webreports/145/S145146.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bbb",
      "summary": "Craft in Lexington, teardrop shaped, near University of Kentucky, appearing to children.",
      "city": "lexington",
      "shape": "teardrop",
      "date": "2019-02-22T00:00:00",
      "story": "Craft in Lexington, teardrop shaped, near University of Kentucky, appearing to children. Summer of 1993  Just after Lunch; 12 Noon – 1pm   Not sure how I feel about sharing my story but it happened and changed my life. I was only 10 years old, I was at my friend ((female friend's name deleted)) house and we were inside playing hide and go seek.  We were scolded for being to loud and were sent outside to play.  Seems like all summer long we sat drawing with sidewalk chalk, as we sit in the drive way a shadow came over us.  There were no large trees and it was a clear day.  We looked at each other and then looked up.  What we saw sounds crazy at best. It was a large tear drop shape craft.  It was about; 20-25 feet long, 12-15 feet wide, and I couldn’t tell the height but it would have been large enough for full grown adults.  It was like liquid metal, we couldn’t see ourselves in the reflection but it was a mirror like silver.  It also had a ripple like a stone tossed into water.  It didn’t make any noise.  There was no heat coming off it.  It just hung there; if we would have reached up, we could have touched it.  It was only 6-7 feet off the ground. We were kind of in a state of shock, I guess, because we didn’t move or say anything.  But to a kid, I guess it was confusing.  But then we snapped out of it and started screaming, we were so loud that ((female friend's name deleted)) parents ran out to see what was going on.  Just as we started screaming, the craft took off, high and fast, towards Nicholasville Rd, as we were on University Ave.  We were pointing and trying to explain what happened, but her parents couldn’t or didn’t see it and it seemed to stop and watch as we tried to explain what was happening.  We were pointing at it as it sat there for a moment; it was reflective so it matched the blue sky.  You could only see it if you knew what to look for I guess. We were scolded for scaring everyone and making up a story.  ((female friend's name deleted)) had to go inside, and I was sent home.  I ran back to my house on Crescent Ave. screaming for my mom.  She heard me and met me outside trying to calm me down.  My mom tried to calm me down and I didn’t know anything about UFO, but my mom actually said to me, “It was probably just a weather balloon.”  I remember thinking this wasn’t a balloon.  She got me inside, and she was cooking dinner but we had just had lunch.  I don’t know the time but it wasn’t normal.  I was confused and scared, for a long time.  ((female friend's name deleted)) and I were never allowed to play together again.  Her family thought that I was putting stories that gave her nightmares. I started having problems sleeping as well; I was sleep walking, having horrible dreams, and having sleep paralysis.  On several occasions my mom saw me trying to walk outside in my sleep, she had to put locks on the doors that I couldn’t reach.  When I couldn’t get out the doors, I actually tried to go out the window.  According to her she asked me why I was trying to get outside, and I said because the blimp is out there.  I was having dreams of blimps chasing me and of my neighbors back yard being on fire.  I couldn’t scream though I tried no sound would come out. I couldn’t move.  When I was finally able to I would start screaming out of control.  After I told my mom that she decided I needed to go to the doctor.  My primary care said I needed a therapist and a sleep study.  I started fearing everything; like shower curtains, heights, darkness, and I feared going to sleep so bad that I would stay awake for days.  I was awake so long that I would start seeing things and becoming mo! re fearful. I was taken to the Woodland Group in Lexington to see a therapist.  I really liked the guy, he had a labyrinth in his back yard.  The started doing hypnosis on me to see what got me so worked up.  He put headphones on my ears and the music would go back and forth left to right in my ears.  He also had me follow a light left to right until I got tired, not asleep just tired.  The only thing I remember him telling me to touch my face when I was scared and that it would relax me.  It worked and I got over my fears, sometimes I still catch myself touching my face in specific spots.  I also still have sleep paralysis, but it doesn’t scare me anymore. When I stop and think about that night, I feel at peace now.  I can’t remember something about a slender figure that opened his arms and seem to hold me.  It was like he cared about me and wanted me to know that.  I think I recall everything being white and sooth. Later in life I became a Deputy (law enforcement officer) and I worked with a Deputy that was stationed at Area 51 as a test piolet, in the 50s.  He has passed away now, but I always wonder why he decided to tell me about a missing aircraft that occurred when he was there.  I don’t know why this always occurs around me.  But it worries me that no one seems to understand this was real, it happened and I don’t know how to convince people to understand me.  My family jokes about it, one time I got real serious and spoke to my mom about it all as an adult.  Her story changed she said it was probably something the local University made and was flying.  If we had that technology then why hasn’t it come out yet, it’s not us.",
      "link": "http://www.nuforc.org/webreports/144/S144954.html",
      "state": "KY",
      "duration": "UKN"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d46",
      "summary": "Black chevron-shaped object with no lights observed over Lexington, Ky at night",
      "city": "lexington",
      "shape": "chevron",
      "date": "2019-01-24T00:00:00",
      "story": "Black chevron-shaped object with no lights observed over Lexington, Ky at night I was standing in front of my house watching the lunar eclipse when I became aware of a chevron shaped object in my peripheral vision, moving southwest to northeast.  It was black with no lights and I was only aware of it because it was a bit darker than the sky because of the full moon.  As it traveled across the sky, there was the faintest of sounds, but it wasn’t the sound of an engine or any thing like that.  It was the sound of air being pushed out of the way, like if you were spinning something heavy in a circle using a rope.  It traveled across the sky as far as I could see southwest to as far as I could see northeast before disappearing across the rooftops.  I have no idea about the size because I couldn’t judge altitude.  It appeared to be large and far away, not small and close.  It travelled about 3 miles in 8-10 seconds, which would mean a speed of over 1000mph, but there was no sonic boom.  I’m a 52 year old software developer with pilot training and good eyesight.  I have no idea what I saw.  Definitely not a plane, not a drone.  Not a flock of birds.",
      "link": "http://www.nuforc.org/webreports/144/S144605.html",
      "state": "KY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e97",
      "summary": "Glowing circular object with dark blue ring falling from the sky",
      "city": "lexington",
      "shape": "circle",
      "date": "2019-01-04T00:00:00",
      "story": "Glowing circular object with dark blue ring falling from the sky Driving on  I-85 North my husband and I saw a glowing blue circular object fall from the sky.  Not a shooting start.  I have seen one of those.  Hard to explain, of course, but it was glowing similar to the moon.  It had a bluish white center with a pretty darker blue ring.   Seemed to fall in a circular motion (like something being thrown) rather than straight out of the sky.",
      "link": "http://www.nuforc.org/webreports/144/S144190.html",
      "state": "NC",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c95de",
      "summary": "Size of a XL drone with a light bar that strobes red/white",
      "city": "lexington",
      "shape": "oval",
      "date": "2019-12-19T00:00:00",
      "story": "Size of a XL drone with a light bar that strobes red/white I was laying down looking out my window and I noticed a red & white light in the sky.  My window faces a hospital and I see heli's fly in and out but this one was different.  It was heading in a direction towards my view.  I still thought it was a heli but as it got closer the lights were FORSURE not of a helicopter.  It was 1 bar of lights that had the bent shape of a gibbons moon. The lights were red and white.  They were NOT blinking but flashed like a strobe. I jerked myself up out of bed and ran to my window and noticed that whatever was in the sky was making NO SOUND. ***it's important to know that sound is actually perceived louder at night. I barely got a good look at it before it swept by out of my view. It was hard to make out the shape around these lights.  It's even harder to remember even though I am typing this only 20 minutes after seeing it.  My best guess after I first saw it was a drone.",
      "link": "http://www.nuforc.org/webreports/151/S151320.html",
      "state": "KY",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9641",
      "summary": "Strange light in Lexington MI",
      "city": "lexington",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Strange light in Lexington MI My family saw a strange light coming from outside while I was about to sleep. Then all of a sudden I heard a quiet boom. A member of my family saw the craft go up and down many times and noticed it coming towards Canada at a fast speed.",
      "link": "http://www.nuforc.org/webreports/151/S151409.html",
      "state": "MI",
      "duration": "20s"
    },
    {
      "_id": "64d005f478aba2ec5a3c9673",
      "summary": "Fireball entering earths, slowed down and accelerated out of earths atmosphere",
      "city": "lexington",
      "shape": "fireball",
      "date": "2019-10-04T00:00:00",
      "story": "Fireball entering earths, slowed down and accelerated out of earths atmosphere Sighting 1 of 2.  On July 27th my wife and I were stargazing hoping to see some shooting stars in field just south of Clearfork Reservoir near Lexington, Ohio.  The location was perfect with very little light pollution along with clear skies.  At approximately 1:30 am I thought I saw what would have been the brightest shooting star I have ever seen entering Earth’s atmosphere, originating from the southwest on a bearing of 045 and 30 degrees above the horizon.  The object continued to get brighter and just as I was expecting it to flame out the speed immediately slowed to that of a commercial jetliner and the brightness of a normal star.  It continued along a straight line for 5-6 seconds before instantly accelerating to full speed and previous brightness as it left Earth’s atmosphere.  To be clear, the object flew in the same path and was visible for approximately 7 seconds in its entirety. I am a former pilot who from The Ohio State University flight school.  As a pilot, it is imperative to understand what you are seeing and normal phenomena.  I honestly thought this would be the only time I wouldn’t be able to explain a sighting only to be proven wrong, two months later.  2 0f 2 to follow",
      "link": "http://www.nuforc.org/webreports/149/S149480.html",
      "state": "OH",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9708",
      "summary": "((HOAX??))  my brother noticed some white little spheres in the sky.  ((anonymous report))",
      "city": "lexington",
      "shape": "sphere",
      "date": "2019-10-04T00:00:00",
      "story": "We were at Tyson to pick up my mom and then my brother noticed some white little spheres in the sky, I thought he was lying.  I checked it out and there was about 6 or 7 aircrafts, the thing is, they were flying about the height planes fly, and they looked the size of a commercial plane, I took a video if it and I fought about 4 flying objects, it was pretty scary.",
      "link": "http://www.nuforc.org/webreports/149/S149088.html",
      "state": "NE",
      "duration": "About 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9891",
      "summary": "My wife and I both saw a light in the sky fly by. Very bright and moved faster than any meteor or aircraft either of us had ever seen.",
      "city": "lexington",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "My wife and I both saw a light in the sky fly by.  Very bright and moved faster than any meteor or aircraft either of us had ever seen.  Both looked at each other and asked if we saw it.",
      "link": "http://www.nuforc.org/webreports/151/S151159.html",
      "state": "KY",
      "duration": "2 seconds"
    }
  ]
}