{
  "city": "lincoln",
  "fetch_timestamp": "2025-07-12T14:35:21.216625",
  "record_count": 112,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b43ad",
      "summary": "TWO LIGHTS CRUSING SOUTH ABOUT AIRCRAFT SPEED.",
      "city": "lincoln",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "TWO LIGHTS CRUSING SOUTH ABOUT AIRCRAFT SPEED. FIRST LIGHT DROPPED FLARE. FADED AWAY. SECOND LIGHT CUISED SOUTH. DROPPED FLARE. FADED AWAY.",
      "link": "http://www.nuforc.org/webreports/049/S49777.html",
      "state": "NE",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3b43ec",
      "summary": "It was at night so all that was visible were two yellow to orange lights that were side by side, the distance between them is unknown.",
      "city": "lincoln",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "It was at night so all that was visible were two yellow to orange lights that were side by side, the distance between them is unknown.  They seemed to be moving towards us north to south at about tree top level, it's difficult to tell how far away they were because it was dark and overcast and we had no perspective.  As they moved slowly towards us they began to move, as if they were  rotating so that eventually they were aligned one on the top of the other, they then started to move away from us and slowly moved back to their origional position.  Their movement was so in sync and smooth not jerky at all, that perhaps they were attached to one large object.  After a couple minutes of moving away from us they simply vanished.  One more point they or it was totally silent.",
      "link": "http://www.nuforc.org/webreports/049/S49935.html",
      "state": "NE",
      "duration": "10-15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b43fa",
      "summary": "Two yellow lights trailing dropping sparks seen heading slowly south over Lincoln, NE",
      "city": "lincoln",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Two yellow lights trailing dropping sparks seen heading slowly south over Lincoln, NE Leaving the mall toward the parking lot we witness two lights flying south about as fast as helicopters would fly. To us they appeared about the size and shape of a yellow street lamp seen from aobut 8 blocks away. They were tailing or dropping what ap[peared to be sparks. My wife saw this first as her eyes are much younger and better. The first craft was dropping these sparks first. Then I witnessed the second one dropping sparks. At first, I thought it was maybe a bomb, or perhaps parachutes. The sparks appeared for only about 2 seconds and then dissipated. It is hard to judge distance, but I would guess they crossed the sky about 2 miles away, maybe more. I called 911 and they checked it out for us. We called back later on a non emergency number and they had no radar records nor were there any military exercises.",
      "link": "http://www.nuforc.org/webreports/049/S49914.html",
      "state": "NE",
      "duration": "2 1/2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b46f4",
      "summary": "Bright light that changed in intensity and emitted flare-like objects as it traveled towards me.",
      "city": "lincoln",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Bright light that changed in intensity and emitted flare-like objects as it traveled towards me. Observed a bright light in the sky while taking my dog out just before bed.  The light was moving slowly and appeared to be an airplane, but what caught my attention was the way it was changing in intensity, not blinking like the normal airplane light does.  As it came nearer, it suddenly shot out to the rear what appeared to be a flare (it reminded me of a fighter jet spitting out chalf to defend against a heat seaking missile).  It did that three times as it approached, and then when it got directly over my house, the light split in two with the appearance of flares, and then was gone.  I realize that this could have possibly been a meteor, but it appeared to be moving to low and slow for a meteor, and the flares coming off traveled in the opposite direction and then dropped down before flaming out.  If it was a meteor, wouldn't all the pieces from the fragmentation keep traveling in the same direction as the main body?",
      "link": "http://www.nuforc.org/webreports/050/S50557.html",
      "state": "NE",
      "duration": "Approx 1-2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4736",
      "summary": "Was on way to test for probation at 625 am. As I headed down my normal route on state fair drive notice what looked like a plane with n",
      "city": "lincoln",
      "shape": "other",
      "date": "2019-08-23T00:00:00",
      "story": "Was on way to test for probation at 625 am.  As I headed down my normal route on state fair drive notice what looked like a plane with no tail shoot across sun rise.  As I headed west down road noticed it was closer then I realized it stopped and was floating about 200 feet above me and was a black v shape craft with 5 lights.  It stayed in one spot at I watched it.  No way this was a drone or plane.",
      "link": "http://www.nuforc.org/webreports/148/S148117.html",
      "state": "NE",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b47aa",
      "summary": "3 orange lit craft in v shape that appear to what seemed out of nowhere! Michigan",
      "city": "lincoln",
      "shape": "formation",
      "date": "2019-06-07T00:00:00",
      "story": "3 orange lit craft in v shape that appear to what seemed out of nowhere! Michigan I was looking out at a star but this star is somewhat odd because it seemed to have different color lights admitting from it.  I started seeing some oranges lights coming above the tree line.  What made me look out was the loud plane like sound but it didn’t last long like usual.  Then all of a sudden 3 quote large spot light orange lights, very low in a v like shape appeared right out of no where!  The three lights looked like they were right over our house.  They stayed in the v for about 10 seconds.  I grabbed my phone and flashed a picture and they then started moving in a fast circler way and just disappeared completely after about 30-45 seconds.  It was like they just came out of the stars. Afterwards tons of planes started roaming the same area.  It’s calmed down, but you can still hear craft outside.",
      "link": "http://www.nuforc.org/webreports/146/S146210.html",
      "state": "MI",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4aed",
      "summary": "Looked like a dark bird floating still.  Started moving lower.  Slowed down passed over the street it seemed.  ((anonymous report))",
      "city": "lincoln",
      "shape": "diamond",
      "date": "2019-06-27T00:00:00",
      "story": "Looked like a dark bird floating still.  Started moving lower.  Slowed down passed over the street it seemed.  Dark diamond like.  Would rotate or spin in its path moving up in a straight line.  When on its side it was shiny from the sun.  When flat it was shiny blackish.  Then sped into the clouds and went up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146975.html",
      "state": "NE",
      "duration": "00:05"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d6f",
      "summary": "Standing outside my mum's house and saw two very bright orbs dancing around the brightest light body in the S sky. ((anonymous source))",
      "city": "lincoln",
      "shape": "light",
      "date": "2019-06-07T00:00:00",
      "story": "Standing outside my mum's house and saw two very bright orbs dancing around the brightest light body in the south sky.  They remained very bright and stilled before disappearing into the night sky.  I almost mistook it for Orion's belt then quickly realized it was the incorrect sky location for that ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146621.html",
      "state": "NE",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ded",
      "summary": "Sphere shaped craft disappears in the sky",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2019-04-25T00:00:00",
      "story": "Sphere shaped craft disappears in the sky. Location On the top of the Kancamangus Highway, NH, at the height of the land Lincoln side.  My friend and I were watching the sunset over the mountains when we noticed a sphere shaped objects that was over the mountains.  According to the map that was at the lookout we where in the object was floating above the East Pond trail.   At first we thought the objects could’ve been a planet until a plane was starting to get closer to it.  At that moment it appeared that the object started to pulse, then fade.  The pulse moved on the object in a constant rhythmic pattern from one side to the other.  The fad away also started on the same side and moved in such a way.  After the event I made sure to get a photo of the location with a time stamp of 19:41.  Unfortunately, the object was to far away for me to get a photo of it, but this event will always be remembered.",
      "link": "http://www.nuforc.org/webreports/145/S145864.html",
      "state": "NH",
      "duration": "A couple of minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e1b",
      "summary": "Strange light in distance mysteriously vanished",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2019-05-09T00:00:00",
      "story": "Strange light in distance mysteriously vanished So me and my buddy ((male name deleted)) we’re sitting at this road pulloff in the Kancamagus Highway at about a quarter to eight.  I’m pretty sure it was the highest point on the way up the mountain.  Out of nowhere we see this light in the distance that just looks like a normal light in the distance.  I give an assumption that it’s either a planet or just a really bright star.  However, as we look an just talk about what possible planet it might be we see an aircraft with a pretty obvious chemtrail goin in the direction of the light.  As that aircraft grew closer to the light it started to do something strange. The closer the aircraft got to the light it started to do a weird shift in brightness.  As if though the light saw what was approaching.  The light started to shift in some sort of pattern like a kind of blinking.  That’s when me and my friend thought something was strange.  We were joking around because we thought it was normal but then it started to pulsate an slowly vanished. The longer I looked to the sky the less I could believe what just happened.  As quickly as we realized the light was there it vanished.  The only thing I could think of that may have obstructed our view was a very small cloud.  However even then I waited to see if this light may return. It did not.  My eyes couldn’t believe what happened.  The light was there one second and as if it was spinning it faded slowly away. It honestly frightened me to the point where I need to reassure myself multiple times that I was not the only person who saw it.  I’m an avid hiker an I’ve seen the skies many times to know the difference between a normality and a anomaly. But I hope you can maybe figure out what this may have been because that’s the weirdest thing I’ve ever seen in the sky.  I believe this may have been an extraterrestrial.",
      "link": "http://www.nuforc.org/webreports/145/S145869.html",
      "state": "NH",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5130",
      "summary": "Large Object hovering at low altitude in sky in Lincoln Nebraska",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2006-10-30T00:00:00",
      "story": "Large Object hovering at low altitude in sky in Lincoln Nebraska This episode has bothered me for years.  I just found this site and decided to relay information on what I saw this evening.   Over the years, I have forgotten the exact date, but it's as close as I remember it.   My dad was diagnosed with cancer just a couple of days before this and was a patient at what was then St. Elizabeth's Hospital (I believe on South 70th St.).   My husband and I lived in South Lincoln South of Old Cheney Road between 27th & 40th St.  As we were driving home from the hospital we saw what looked like a monstrous round spaceship.  I actually feel silly putting this into writing, as most everyone I know would write me off a kook.   We spotted it about 5,000 - 8,000 feet up in the air over South Lincoln near 48th St.  It was in the air long enough for us to come home and watch it literally \"hover\" in the air without a single sound (other than a dull hum) from the time we spotted it at approx 48th & O St. to our home.   My husband and I were literally frozen.  We don't remember hearing each other talk, although I know I was speaking.   The next day we asked people at work and found just one person who witnessed the same object hovering in the air that night before.  The best way to describe this object was that it was very similar in size & shape as the \"Mother Ship\" in \"Close Encounters.\"   I would swear under oath about this experience.",
      "link": "http://www.nuforc.org/webreports/051/S51729.html",
      "state": "NE",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5200",
      "summary": "orange v formation over lincoln, NE",
      "city": "lincoln",
      "shape": "formation",
      "date": "2006-10-30T00:00:00",
      "story": "orange v formation over lincoln, NE I was a child of 10 when I saw this with my friend. The two of us and my mother were walking to a nearby friend's house a few blocks away at anywhere between 9-10 because it was a dark summer night so it was quite late. Me and him were looking up at the sky and we noticed a v formation of orange objects. They were very hard to see since they were so high up. We had problems just trying to follow them. They didn't keep a strict v formation though. It was very much like birds migrating. They tend to stick in a v but every now and then one would move over to the side or so. We knew they weren't birds since the formations were so extremely high up and glowing orange. My mother couldn't see them most likely since she shrugged it off as child play. We watched the slow moving objects as closely as we could until we got to our destination. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52700.html",
      "state": "NE",
      "duration": "10 minutes approximately"
    },
    {
      "_id": "64d005f478aba2ec5a3b5298",
      "summary": "Lights over Lincoln, NE 5-21-06",
      "city": "lincoln",
      "shape": "changing",
      "date": "2006-10-30T00:00:00",
      "story": "Lights over Lincoln, NE 5-21-06 I had to consult my journal to be sure of the time and date of the occurrence.  A little background information: me and a former friend of mine went to Lincoln to do some work for a few weeks and we stopped by the apartment of a girl I was fooling around with. (She lived a few blocks east of the capital building, a huge art deco skyscraper.)  Come midnight, the lights went down on the Capital and we sat out on her porch gazing up at the sky. I noticed a couple of points of light moving slowly across the sky towards each other (as airplanes would if they aimed for each other) except that the lights approached each other and danced around each other and sped away, like a satellite using gravity as a slingshot. They did this dance for a while, this happened for about ten or fifteen mintues, the lights would fade in intensity and suddenly brighten (although this change in luminosity seemed to be a separate phenomenon from the speed of the \"craft.\") For about 15 minutes we observed 2, sometimes three lights (although one light would always be fainter in this case) doing an impossible tango in the sky.  My buddy thought it was fighter jets, and my former girl mentioned that the lights were well above the feathery cirrus clouds, and I'm pretty sure commercial aircraft don't fly that high. One guess of mine is that the lights were caused by craft skimming on the edge of the atmosphere (hte bright bursts of light caused much in the same way as the splashes caused by a water skier bouncing on the surface of the ocean.) Also the lights would travel below the skyline of Lincoln to almost directly overhead within seconds. We could not hear any engines of jets.  We debated this for probably 15 minutes before the lights faded off. As we were about to go inside I spotted a light again. (It was moving parallel to the power lines above where we sat.)  Suddenly the light brightened, and forked apart into seven or eight lights which for about two seconds moved in tandem with each other (horizontally?) before they began to swarm around and forward (like the flying machines moving en masse in the Matrix 3 or the meteors at the end of Contact moving in one direction) and shot up into the sky. (I called Lincoln 911 afterwards, feeling rather foolish when the woman who answered laughed at me.)  Even now I can believe what I saw; yet I can't. I am a skeptic through and through (I do not believe in the spiritual, I trust in science) and for me to see something with my own two eyes that not only defies the current laws of physics (or maybe it doesn't, not my field of expertise); for me to actually get a fundamental answer to the question of are we alone was something I never expected. I figured I'd die without answers to anything (or at least the big questions.)  Earlier today, a few of my friends and I got to talking UFOs and someone said I should document what I saw so . . .  Well, not much of a story, but when I looked on here to see if anyone reported anything about it and I saw nothing from 2005, I decided better late than never.",
      "link": "http://www.nuforc.org/webreports/053/S53137.html",
      "state": "NE",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b55f4",
      "summary": "Bright, bluish-white glowing oval shoots rapidly and silently across the night sky",
      "city": "lincoln",
      "shape": "oval",
      "date": "2006-10-30T00:00:00",
      "story": "Bright, bluish-white glowing oval shoots rapidly and silently across the night sky The strange coincidences surrounding this sighting necessitate a rather long report.  I have never before seen a ufo, and have always been skeptical of them, having felt that there must be mainly psychological forces involved in such experiences, rather than technological ones.  I recently moved back to Lincoln, and have been staying with my parents while looking for a place of my own.  Some weeks ago I had a dream in which an otherworldly craft flew over the house while I was alone on the front porch.  In the dream I called my mother out to witness the thing with me so that at least someone would believe what I had seen.  Then, several nights before the sighting described below, I stumbled upon a video of a 2001 press conference given at the National Press Club in Washington, DC by Dr. Greer and The Disclosure Project, and was stunned by the information presented there by him and his 21 government, military, intelligence community, and corporate witnesses.  This testimony shattered my preconceived notions about ufos--indeed my entire worldview--and forced me to admit that I likely have been a victim of disinformation my entire life.  I was still reeling from what I had learned from this video, and was weighing telling my parents about it as we sat on their front porch on the night of July 21, when my father said \"there's a ufo.\"  He is a level-headed retired journalist who coincidentally spent years as a member of the National Press Club working as an award-winning White House Press Photographer under the Nixon administration.  I saw that he was joking about an airplane flying nearby, but his comment gave me the opportunity to broach the subject of The Disclosure Project press conference and tell the two of them that I thought it likely that we world citizens had been lied to for generations about the reality of extraterrestrial visitation.  It was a difficult thing for me to do, as I am a rational person and was risking my credibility, but I feel that this is supremely important information that everyone needs to hear.  The three of us had an interesting conversation in which my parents expressed their own doubt about the official ufo story, and generally we all just soaked up this astounding revelation without waxing overly dramatic about it.  Some time later my mother went up to bed and my father and I stayed up talking.  Just after 11 pm, as if it had been summoned as verification of my earlier assertions, a glowing, bluish-white object about the apparent size of a pea held at arm's length, brighter than anything else in the sky, appeared about 20 degrees above the horizon (below the clouds) almost due south of us, glowing brightly and streaking rapidly westward at a 30 degree downward angle.  I said \"do you see that?\" and my father replied \"I'm looking at it\" in a stupefied tone.  The object (I call it an object rather than a light because it was a sharply-defined ovoid shape with no flames, rays, or tail) shot in a straight line toward the horizon and disappeared behind the buildings a few hundred feet south of us, absolutely soundlessly.  It seemed to be about a half-mile or so distant, though it was difficult to tell with certainty.  There was no explosion or flash of light at the time the object should have hit the ground, had it been a meteor, comet, or other sort of space debris.  I asked my dad if we shouldn't call the local papers and tv stations the next day to see if anyone had reported anything.  The veteran journalist replied \"why would we do that?  They wouldn't tell us anything we don't already know.\"  A man of few words, he paused for a second or two and then said \"that was what you would call 'a classic ufo'.\"  He later admitted he'd never seen anything like it before.  The next day he joked, \"the ufo people were listening to our conversation,\" with his typical dry humor, but who knows--is that so unlikely?  Just two or three minutes after the sighting I took out my PDA and recorded detailed notes, which formed the basis of this report.  By the way, the animation on your site provided by a witness to a March 19 sighting in Seattle is very similar to what my father and I saw. ((NUFORC Note:  Witness elects to remain semi-anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51760.html",
      "state": "NE",
      "duration": "4-6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b668f",
      "summary": "I tracked a brilliant orange pulsating light moving slowly and silently for a minute, then saw it disappear.",
      "city": "lincoln",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "I tracked a brilliant orange pulsating light moving slowly and silently for a minute, then saw it disappear. Leaving the Gere Public Library at 8:35 pm, I saw what seemed at first to be a brilliant orange star in the lower eastern sky.  At that time, only the moon and a few of the brightest stars were visible (the moon was in the western sky opposite from this anomalous light). What caught my eye at first was the unusual orange tint, and as I trained my eyes on it, I saw it was moving slowly westward in my general direction. I wondered whether it could be a plane on a landing approach, but there was no noise and instead of having blinking navigational lights, the light intensity fluctuated (growing gradually brighter and then gradually dimmer every second or two). I continued to watch this pulsating orange light for about a minute, then it suddenly dimmed and disappeared completely. That struck me as very odd, since the sky was without a cloud that evening. I searched that area of the sky for another couple of minutes but the object didn't re-appear. Several other people were nearby, but apparently I was the only one there who noticed this anomolous light. As the light periodically brightened, it would become several times brighter than any star or planet in the sky at that time, including Sirius and Venus, which were also visible during this sighting.  I am a research scientist and medical writer (50 years of age).  I've been skeptical of UFOs most of my life. This is the first time that I've ever seen an unidentied flying object.",
      "link": "http://www.nuforc.org/webreports/052/S52259.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b673d",
      "summary": "I noticed a white circle moving slowly at a constant speed in the sky.  It's possible that it could have been an oval.  It was fairly s",
      "city": "lincoln",
      "shape": "circle",
      "date": "2007-10-08T00:00:00",
      "story": "I noticed a white circle moving slowly at a constant speed in the sky.  It's possible that it could have been an oval.  It was fairly small, but not too small.  I definately saw something.  At first it seemed to me that it could be something normal, but then after it moved slowly for about 10 seconds it faded quickly into the sky.  Judging by how far away it must have been, that ship must have been very large.  I think it went back into space quickly.",
      "link": "http://www.nuforc.org/webreports/058/S58709.html",
      "state": "NE",
      "duration": "10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6994",
      "summary": "Quickly Growing White Light in Rhode Island",
      "city": "lincoln",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Quickly Growing White Light in Rhode Island Facing NNW about 55-degrees above horizon. Small very dim light traveling at a steady pace from west to east. About ten seconds into my observing its travel, it stopped and suddenly became very bright and white. It started growing into about the size of a quarter held at arms length. This lasted about 5 seconds. It then receded in brightness and returned to its dim state and continued traveling at its previous pace. Eventually it disappeared about 20 seconds later because of city light pollution I couldn't follow it any more. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57508.html",
      "state": "RI",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b28",
      "summary": "2 sphere type yellow objs SE to NW with no streaks or flashing lights and fast moving in one dir..  ((NUFORC Note:  ISS & Shuttle?  PD)",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2007-11-28T00:00:00",
      "story": "Two sphere type yellow objects Southeast to Northwest with no streaks or flashing lights and fast moving in one direction. It was a clear early morning sky with Mars nearby last quarter of the moon in the eastern southern positioned.  The two fast moving yellow objects resembling the moon in color were traveling southeast to northeast. One trailing the other in perfect sequence.  As to the size of the objects in question it would take two plus or minus of these for the size of the middle of the quarter moon.  No flashing lights, no trail, no other movement but straight forward in direction. We considered this a serious sighting of  (2) sphere’s round and yellow in color objects on November 6th, 2007 at 06:00am. ((NUFORC Note:  If the sighting occurred on November 05, as indicated above, then we suspect the witnesses observed the ISS and Space Shuttle, just after they undocked before the Shuttle returned to Earth.  PD)) Date Mag Starts Max. altitude Ends  Time Alt. Az. Time Alt. Az. Time Alt. Az.  5 Nov -2.2 05:54:40 10 SW  05:57:31 74 SE  06:00:23 10 NE   6 Nov 0.3 04:44:51 18 SSE 04:45:34 19 SE  04:47:42 10 E   7 Nov -2.3 05:07:55 59 SSW 05:08:18 72 SE  05:11:09 10 NE   8 Nov -1.5 05:30:40 30 WNW 05:31:13 33 NNW 05:33:52 10 NE   9 Nov -0.3 05:53:11 13 NW  05:54:18 15 NNW 05:56:06 10 NNE  10 Nov 0.6 04:44:06 12 NNE 04:44:06 12 NNE 04:44:25 10 NE   11 Nov 0.4 05:06:15 11 N  05:06:15 11 N  05:06:35 10 NNE",
      "link": "http://www.nuforc.org/webreports/060/S60063.html",
      "state": "CA",
      "duration": "5 min. + -"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d36",
      "summary": "Unknown lights and unexplained observation on Lewis and Clark Pass, MT 11 July 2007",
      "city": "lincoln",
      "shape": "unknown",
      "date": "2007-08-07T00:00:00",
      "story": "Unknown lights and unexplained observation on Lewis and Clark Pass, MT 11 July 2007 At approximately 23:30 July 11, two of us continental divide hikers were preparing dinner at Lewis and Clark Pass which is about 20 miles East of Lincoln, MT.  At some point we realized we were under observation by two set of light reflective eyes which refused to move despite our attempts to scare them away.   Initially we believed them to be moose or bear, but we were unable to discern the shape of their bodies, and they were soon joined by two more observers.   This had been quite an unsettling experience, however, we are each educated and not one a believer in, I guess others.   However, shortly the aura borealis spanned the northern sky in a manner I have not seen since childhood (can someone confirm this? and is there any association?) and there was an amber light at an in determinant distance which was impossibly of terrestrial origin.   Almost immediately, it was joined by a second and the lights commenced in a searching pattern.   We were quite alone and very concerned for our safety.  We immediately stopped all our light and attempted to calm one of our party members, since it seemed that it would be impossible to escape the searching lights.   We checked each of the party the next day to insure there were no marks that hadn't been previously.  I can't say any of us believe in UFOs, but really we just want to know if any one else experienced or saw anything strange on July 11th around Rogers Pass, MT.",
      "link": "http://www.nuforc.org/webreports/057/S57710.html",
      "state": "MT",
      "duration": "25 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7100",
      "summary": "Bright white light that change formation, had a limited duration.",
      "city": "lincoln",
      "shape": "changing",
      "date": "2007-11-28T00:00:00",
      "story": "Bright white light that change formation, had a limited duration. On this day something told me to keep looking in the sky. Looking up in the sky while driving east. I say maybe 700 ft. in the sky. Seen a bright white light, that almost looked like a diamond then my brother said it looked silver to him. then it must of have some type of cloaking device. It looked to have some type of radiation or something and dissappeared.  My brother and I were so amazed by what we saw. I kept asking him if he seen it and he told me yes.",
      "link": "http://www.nuforc.org/webreports/059/S59893.html",
      "state": "NE",
      "duration": "less than 2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ace",
      "summary": "2 large amber lights, 1 blinking light. Hovering & moving rapidly and erratically.",
      "city": "lincoln",
      "shape": "light",
      "date": "2007-02-24T00:00:00",
      "story": "2 large amber lights, 1 blinking light. Hovering & moving rapidly and erratically. Looked at first like airplane landing lights.  Then it moved rapidly in random directions.  Moved laterally and up and down in a way an airplane could not move.  Moved much too fast to be a helicopter.  Was in the Northwest sky about 35 degrees above the horizon.  Upon inspection with binoculars, craft had one large amber light that had constant brightness.  Another large amber light had varying degrees of brigtness.  Craft also had a red blinking light.  It would hover for a few minutes and then rapidly dart about and hover again.  It gradually seemed to be moving away from our vantage point, disappearing behind the tree line after about 45 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55223.html",
      "state": "RI",
      "duration": "35 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8076",
      "summary": "Bright star flashing different colors in western sky.  ((NUFORC Note:  Probably a twinkling star.  PD))",
      "city": "lincoln",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Bright star flashing different colors in western sky. I was just arriving home from the store about 10:15PM on 9-8-2009 when I noticed my two neighbors sitting outside on the stoop of our apartment complex staring up at the sky.  As I walked up to them I asked, \"What are you looking at, a UFO?\"   To my surprise, the gentleman said, \"I don't know, maybe!\"    I then proceeded to look up in the western sky and noticed what looked to be a bright star.  The \"star\" then started \"blinking/flashing\" different colors like red, blue and silver/white.  The thing that was weird was it was flashing these colors all at once like red on top, blue on bottom but flashing very fast sometimes in a steady pattern.  It would flash and strobe red, blue, red, blue, then blue on top, then red on bottom and all of a sudden it would be a solid silver/white light for like 3 seconds, then go back to the red, blue flashing!  At first I thought it maybe could be a satellite but I thought they could reflect the sunlight in such a pattern.  I have NEVER seen anything like this in my life!   I ran inside and grabbed my digital camera to snap a few pictures and by the time I got back outside, two more of my neighbors were also out looking at the \"star\".  What I thought was weird was that every picture I took the \"star\" showed up in the LCD screen on the camera but not in the actual photos! (Just my luck!) We continued to watch the weird object for another 25 minutes or so and I noticed that it had been moving away ever so slightly WNW in the sky until it finally was out of our view from the apartment complex stoop.  I started to tell my friends about it over the next few days and I think they thought I was crazy or something.  A few days later, on of those friends came over to visit and told me that they had seen the exact same \"star\" that I had described to them earlier that week!!!",
      "link": "http://www.nuforc.org/webreports/072/S72348.html",
      "state": "NE",
      "duration": "40-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b839f",
      "summary": "triangle craft",
      "city": "lincoln",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "triangle craft well my friend and i were at a party and we were stading on the back deck of the house i looked and saw what looked like three lights but the didnt go further or closer apart they were very extremely far away like they could have been in another state recently i have been getting into ufo and the paranormal and i have been seeing that people have sighted the same thing i did a number of times and it was the exact same thing ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68954.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b84b5",
      "summary": "Orange fireball looking object moving very slowely in the sky.",
      "city": "lincoln",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "Orange fireball looking object moving very slowely in the sky. I saw on orange object, which looked like a fireball, moving very slowly from east to west.  The object very quickly rose to a much higher altitude, then moved very slowly again from east to west.    I finally lost site of it.",
      "link": "http://www.nuforc.org/webreports/072/S72440.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8507",
      "summary": "The UFO had blue and yellow alternating lights, cigar shaped, and suddenly changed directions.",
      "city": "lincoln",
      "shape": "cigar",
      "date": "2009-01-10T00:00:00",
      "story": "The UFO had blue and yellow alternating lights, cigar shaped, and suddenly changed directions. We were walking in a park at 5:30 and we looked up at the darkening sky when my friend pointed out that there were 3 mysterious flashing cigar shaped objects in the distance. They were headed Southeast and then suddenly changed directions and headed North. The lights flashed yellow and blue alternating every 2 or so seconds. We stood there in amazement knowing that it was a UFO. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67481.html",
      "state": "NE",
      "duration": "23 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b895e",
      "summary": "Bright red light surrounded by light red translucent red halo",
      "city": "lincoln",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Bright red light surrounded by light red translucent red halo Craft (light) moving north west at approx. 500 feet bright solid red light with halo or ring of a light translucent red. The object was about dime sized as if held out at arms length.  Object turned due north after flying directly over head.  Object then climbed to a very high altitude and was witnessed to be about the brightness of Venus.  Light then faded out.  The object made absolutely no sound.  This is the second sighting of this object.  First appeared on 8/18/08 but did not get as close as this one.",
      "link": "http://www.nuforc.org/webreports/065/S65458.html",
      "state": "NE",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d4d",
      "summary": "Cylindrical object with bright orange light.",
      "city": "lincoln",
      "shape": "cylinder",
      "date": "2009-08-05T00:00:00",
      "story": "Cylindrical object with bright orange light. While relaxing on my patio at about 2115 hours I saw a cylindrical object in the sky.  It was about 9’ tall and 5’ wide.  It had a bright orange light that changed colors at the bottom and made no noise.  It traveled from east to west near the Lincoln municipal airport.  It traveled very slowly in a steady non changing course.  It was dusk and there were fireworks in the vicinity.",
      "link": "http://www.nuforc.org/webreports/070/S70808.html",
      "state": "NE",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ecd",
      "summary": "blinking lights, silent, moved rather quickly.",
      "city": "lincoln",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "blinking lights, silent, moved rather quickly. I was called outside by a family member of mine, he told me to look at these lights in the sky, we were on the back step when i first saw them, I thought they were planets because they shine bright in the sky, but there was two lights, and they were relatively close to each other, after looking at them they also were blinking like a camera flash, and some time passed and one went to the left, and the other light almost looked like it started to rise up for about five seconds, the light that had went to the left was a good way in front of the rising light, I watched to see where they were going because they were out of my view once they went over the house (silently) and they were both going in the same direction one behind the other in almost a straight line. I went out maybe ten minutes later and saw maybe three more of these lights, all blinking in the sky, they also were going in the direction the others had went.  While all of this had happened there were three planes (clearly planes) that had went through my view also, two in the opposite direction and one went in the direction the blinking lights had went.",
      "link": "http://www.nuforc.org/webreports/067/S67053.html",
      "state": "DE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b90e5",
      "summary": "Flaming tear-shaped object flying over southwest Lincoln, Nebraska on July 4th.",
      "city": "lincoln",
      "shape": "teardrop",
      "date": "2008-08-12T00:00:00",
      "story": "Flaming tear-shaped object flying over southwest Lincoln, Nebraska on July 4th. While watching the fireworks show over Lincoln, Nebraska from our balcony on the third floor, we noticed a large tear shaped object flying across the sky from south southwest to north northeast. The object was moving rapidly and at approximately 10,000 to 15,000 feet altitude.  The object appeared either to be on fire or have orange glow emanating from rear.  At first, we thought it may have been part of the fireworks display, but the object was much too high and moving purposefully, with clear direction and even speed. There were no erratic movements, simply a straight line in the direction indicated previously. One of the witnesses is an avionics technician, and was completely certain that the object could not have been an airplane.",
      "link": "http://www.nuforc.org/webreports/064/S64332.html",
      "state": "NE",
      "duration": "1 minute appx"
    },
    {
      "_id": "64d005f478aba2ec5a3b91a2",
      "summary": "Looked like a star moving very rapidly across the sky, too fast for a satellite.",
      "city": "lincoln",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Looked like a star moving very rapidly across the sky, too fast for a satellite. Me and my parents saw a light that looked very much like a star moving quickly across the sky, it had to be low and may have been within the atmosphere, but was not an airplane. It took about 5 minutes for it to cross the sky last night, and tonight we spotted it halfway through the sky - and it took maybe three minutes to cross the horizon.",
      "link": "http://www.nuforc.org/webreports/070/S70959.html",
      "state": "NE",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b91c4",
      "summary": "Red/orange glowing ball low on the horizen then climbed untill out of sight",
      "city": "lincoln",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "Red/orange glowing ball low on the horizen then climbed until out of sight This is my second email and third sighting of red light. Object was witnessed by myself and 2 other adults. Object again came from the SE moving NW. What was witnessed at first looked like a full moon behind trees but was a very bright reddish orange color. At this time I ran inside to get my camera and my wife stayed outside and watched. I was inside for no more than 15 seconds to get the camera. When I returned outside the object had gone from approximately 100 - 200 feet to about 500 feet and had lost it's glow but was now a bright light about as brighter than Jupiter appears in the sky. The object then moved north and climbed to about 1000 feet. sat there for about 2 minutes then climbed until it winked out. This is the third sighting of the object. First was 8/18/08/. second was 8/29/08. and tonight 11/26/08. The pattern I have noticed if you are to take the first two sightings they were 11 days apart. Counting on a calendar by 11's, 11/26/08 fell on an 11th day. The craft again made no noise. My son living 3 blocks away on a third floor apartment was out on his balcony and called me to tell me he was seeing the object. I didn't have my cell phone on me and he left me a voice mail saying what he was seeing. The time the message was left was 8:45pm (CST). He saw it before I did because he was higher up and didn't have an obstructed view as I did with it behind trees. He described it the same as I saw it. The were Three others with him at the time and they also witnessed it.",
      "link": "http://www.nuforc.org/webreports/067/S67185.html",
      "state": "NE",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b92ba",
      "summary": "A light stretching out and then retracting disappears suddenly.",
      "city": "lincoln",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "A light stretching out and then retracting disappears suddenly. While getting into my car with two friends outside of a theatre, I looked up and saw a bright light in the distance.  One friend tried to say it was Venus, but it was MUCH too close to the ground for that. After a minute of observing the object, it stretched itself and then retracted.  After driving one friend home, it was still in the sky, looking closer than before.  After driving another friend home, it appeared to be moving away.  On the drive home, it was still there.  I picked up two roomates to go look at it with me as I had observed it not 1 minute before, and when we went back 1 minute later, it was gone.",
      "link": "http://www.nuforc.org/webreports/068/S68612.html",
      "state": "NE",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9beb",
      "summary": "((NUFORC Note:  Student report. PD)) I am a firm believer in aliens, being 16 years old, I know people usually don't take me seriously.",
      "city": "lincoln",
      "shape": "disk",
      "date": "2010-02-14T00:00:00",
      "story": "I am a firm believer in aliens.  Me being 16 years old, I know people usually don't take me seriously.  But, there are those who do.   I was in the countryside of Lincoln riding with a group of kids to the school I went to at this time.   While in the middle seat of the sixteen seater of the van, I was looking out at the window, something I just about always do when riding in a vehicle.   The UFO I saw was, from a side view, cigar shaped, but from my vantage point, I saw it was a disk shape.  It was... moving. I do not know of any U.S. craft that can move like this craft did.  Nor do I know of any disk shaped craft made by the U.S. or any other country.  It was spinning, then it was doing dips, flips, and turns at incredible speeds.  Then, it just seemed to vanish. Like I said, I do not know of any craft from any country that is not just shaped like it or can do what it did. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Student report.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74333.html",
      "state": "NE",
      "duration": "about 15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9bb2",
      "summary": "Two glowing orange balls of light traveling in a southern direction dropping \"flares\" and continuing south.",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2008-10-31T00:00:00",
      "story": "Two glowing orange balls of light traveling in a southern direction dropping \"flares\" and continuing south. North of our Apartment in the sky about 1500 feet in the air 2 orange glowing balls of light were traveling towards us.  They both seemed to flicker orange and brighter on the outside and darker on the inside.  As they came directly over the top of our Apt. they made no noise so my girlfriend and I knew it wasn't a plane or helicopter.  The 2nd orange ball seemed to actually speed up a little to catch the ball in front of it just for a moment.  Then it appeared that both of them started shooting \"flares\" several at a time out of the orange balls.  The lead ball started with maybe 2-3 balls and then the 2nd ball did the same.  It seemed as the \"flares\" were falling from the orange balls that the orange glow became dimmer and also it appeared that they were brighter from the \"front\" of the ball then the back side.  As they continued in the sky towards the south they seemed to keep the same altitude but eventually left our field of vision. The sky was clear with no clouds on a brisk cool night.  Between 50-60 degrees out.  We both stood there in disbelief as to what we actually just witnessed.",
      "link": "http://www.nuforc.org/webreports/066/S66107.html",
      "state": "NE",
      "duration": "2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c4b",
      "summary": "I witnessed a some sort of octagon or circular shape shoot a beam of light in my backyard",
      "city": "lincoln",
      "shape": "other",
      "date": "2010-05-12T00:00:00",
      "story": "I witnessed a some sort of octagon or circular shape shoot a beam of light in my backyard   I was standing in my backyard because I had to let my dog out. All of a sudden I seen some sort of beam of light. At first I thought it was lightening, but then I seen something strange, some sort of circlular or octagon shape.  I glanced at the first light, rubbed my eyes and seen the shape kind of light up and it just hovered there.  After about 15 seconds it flashed again and disappeared.  I waited there for probably 20 minutes for something else but nothing showed up.",
      "link": "http://www.nuforc.org/webreports/075/S75247.html",
      "state": "NE",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba241",
      "summary": "my neighbors and i saw the bright red light coming out of the north then turning to the east then coming back around to the north takin",
      "city": "lincoln",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "my neighbors and i saw the bright red light coming out of the north then turning to the east then coming back around to the north takin red light in sky circling the city was chased off by three military planes",
      "link": "http://www.nuforc.org/webreports/071/S71346.html",
      "state": "NE",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba28e",
      "summary": "On the morning of Tuesday the 05/26/09, I was in my bedroom and looked out my bedroom window and saw a very shinny object, very high in",
      "city": "lincoln",
      "shape": "other",
      "date": "2009-06-09T00:00:00",
      "story": "On the morning of Tuesday the 05/26/09, I was in my bedroom and looked out my bedroom window and saw a very shinny object, very high in the sky.  I grabbed my binoculars and went outside and zoomed in on the object in the sky.   I observed the object as it went east, then turned and went north, at which time and then it turned and went west.   And after a moment it turned direction again and went south.  I continued watching it, I zoomed in on the object as best I could and what I saw was either a horse shoe or a lazy triangle, and it had white round circles kind of like cloudy circles on the bottom. Because it was so shinny that is all I could make out, and it looked like it was going higher and higher as it moved, and then continued south until it disappeared.  My self and my wife and daughter in law all observed the object and the same movements.  Called the local newspaper and reported it, and went to your website and reported it.  Duration was 25 minutes. It made no sounds , no vapor trails, as a commercial airline would.  We also observed in the duration of the time we saw the metallic object in the air , we also seen 5 commercial air planes and they were way below this object we observed . This happened in Lincoln, Ca. 95648 ( Tuesday, 26,09 )",
      "link": "http://www.nuforc.org/webreports/070/S70202.html",
      "state": "CA",
      "duration": "33 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba397",
      "summary": "New Mexico  bright light and many pods flying about",
      "city": "lincoln",
      "shape": "oval",
      "date": "2009-08-05T00:00:00",
      "story": "New Mexico  bright light and many pods flying about It was around 12:40 am. There was a bright light sitting (not moving at all) in the sky but seemed very far and then it scattered into many peaces, and  Then the show started. They shot forward and back, left and right and Made u turns at speeds that boggled my mind. I thought they were army  Activities at first but the speed and turns are just out of this world fast  Im not sure how many I seen as there were so many. I called a friend 50mi away and she called me the next morning and told me she had also seen them. Nice show I say. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71395.html",
      "state": "NM",
      "duration": "40 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bac55",
      "summary": "Flashing light circles over Lincoln CA for at least an hour.",
      "city": "lincoln",
      "shape": "flash",
      "date": "2010-11-21T00:00:00",
      "story": "Flashing light circles over Lincoln CA for at least an hour My wife and I where sitting on our balcony a few minutes before 8:00 pm PST when a small flashing object object caught my peripheral vision.  Normally this would be of no concern or significance as we live in an area less than 2 miles from our municipal airport and between Beal AFB and Sac IAP, but the strobe of the light was a bit odd, a white light strobing at a pace of slightly slower than 1 sec per flash.   I casually followed the path of the object as it traveled south east then made a long turn that eventually became a large counter-clockwise circle several miles in diameter.  Once again this would not be unusual as planes often circle around waiting for an open runway to land on, but the arc took a long time to complete and the object was at an abnormally high altitude for a plane waiting to land.   I brought this to the attention of my wife then called my two daughters and my mother in law to observe and see if they found it odd.  As we watched the object continued to circle around at the same altitude and speed with each lap taking approximately 10 minutes.   On one lap the object passed directly overhead and we could see that it was two distinct lights of the same size one in front of the other with a small red light that did not strobe joining the two lights.   When the lights would fade out between strobes there did not appear to be any discernible shape to the object and there was no noise.   Also, faint lights or reflective objects appeared to fall away from the object from time to time and proceeded in every direction, but were observable for only a very short time, a second or two at the most.   This continued until 9:00 pm PST the object then took a path directly north east till we could no longer see it.",
      "link": "http://www.nuforc.org/webreports/078/S78377.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bb271",
      "summary": "Trail of light behind a brighter circle of light at front of steam which was brighter",
      "city": "lincoln",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "Trail of light behind a brighter circle of light at front of steam which was brighter What appeared to be a shooting star but moved through clouds leaving trail of light behind moving at speed.  The object moved with no sound only causing a light steam.  It was over in 2-3 seconds and did not return.  The trail of light was bright and the front of the trail was a bright circle.  The trail was a great deal of length based on size of front object.",
      "link": "http://www.nuforc.org/webreports/079/S79256.html",
      "state": "",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb7d2",
      "summary": "Light(s) near a hot air balloon during a balloon festival at Logan Co. Airport.  ((NUFORC Note:  Possible lens flares?  PD))",
      "city": "lincoln",
      "shape": "light",
      "date": "2010-08-30T00:00:00",
      "story": "Light(s) near a hot air balloon during a balloon festival at Logan County Airport, Lincoln, IL I took the photographs of the possible UFO on Friday, August 27, 2010.  I was at the hot air balloon festival at Logan County Airport at Lincoln, Illinois.  The two photos were at 6:27 p.m. less than one second apart (probably consecutively).  The shutter speed was one 200th of a second.  I was facing east or southeast as I was taking the photographs.  The sky was very clear and the weather was good.  I did not see the object(s) when I photographed them. ((NUFORC Note:  Possible lens flares, but we cannot be certain.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77524.html",
      "state": "IL",
      "duration": "at least 1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb981",
      "summary": "unexplainable bright light hovering at treetop level off highway",
      "city": "lincoln",
      "shape": "light",
      "date": "2010-07-28T00:00:00",
      "story": "unexplainable bright light hovering at treetop level off highway    I was driving south of the town of lincolton  on Hwy 321 business approx 4 miles south of Lincolnton when I and spotted a bright orb  that appeared to cover both sides of the road as it remained stationary at treetop level.  It took off in flight at a phenomenal speed, grew smaller in the sky as it disappeared. My brother was a passenger in my vehicle and is the only other witness that I'm aware of.",
      "link": "http://www.nuforc.org/webreports/076/S76782.html",
      "state": "NC",
      "duration": "ten minutes not sure"
    },
    {
      "_id": "64d005f478aba2ec5a3bbaa8",
      "summary": "I saw an orange light almost directly above my house, in east Lincoln.  It was a little bigger than a star.",
      "city": "lincoln",
      "shape": "light",
      "date": "2010-07-06T00:00:00",
      "story": "I saw an orange light almost directly above my house, in east Lincoln.  It was a little bigger than a star. I stepped outside to take my dog out and looked at the sky as I always do.  This time though, I saw an orange light almost directly above my house, in east Lincoln.  It was a little bigger than a star and moving very slowly.  It took approximately 8 minutes for it to get 2 houses down from mine.   Shortly after, it seemed to move directly away from me very quickly as I could see the light getting smaller and fading out.  It didn’t blink like the lights on a plane, nor did it move like a plane or helicopter.  It also made no sound.",
      "link": "http://www.nuforc.org/webreports/076/S76021.html",
      "state": "NE",
      "duration": "About 8 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bbb39",
      "summary": "5 orange lights in sky create triangle formation, than morph and \"fade out\". Entire neighborhood witnessed.",
      "city": "lincoln",
      "shape": "unknown",
      "date": "2010-07-06T00:00:00",
      "story": "5 orange lights in sky create triangle formation, than morph and \"fade out\".  Entire neighborhood witnessed. We were finishing up our 4th of july celebration and my fiance and I was getting ready to go to work.  We witnessed 2 orange lights which were very bright in the sky, moving slowly and hovering over some residentials east of us.  This was right over 21st & Superior.  My fiance' and I than went inside to get dressed and my father yelled down the stairs to come up if I wanted to see a \"ufo\". When I got outside, I saw 5 orange lights in a perfect horizontal line in the same area where we saw the 2 a few minutes earlier.  The 2 end lights faded out and than the 3 remaining formed a very large triangle in the sky.  Many people must have noticed because at this point, fireworks in that area completely stopped.  The triangle formation than stretched out and got longer.  The top one than faded away and the 2 remaining \"lights\" on the bottom looked as if they began shifting.  It truely looked like the circle lights were almost \"morphing\" into a crescent moon shaped light.  Than quickly faded away. My father was snapping pictures as we watched.  I have to wait for him to upload them, but if you email me I can send them to you asap.  :)",
      "link": "http://www.nuforc.org/webreports/076/S76132.html",
      "state": "NE",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbccf",
      "summary": "Clear day,large cigar shaped object",
      "city": "lincoln",
      "shape": "cigar",
      "date": "2011-12-12T00:00:00",
      "story": "Clear day,large cigar shaped object Hello Mr. Davenport  Its been 3 years since i first reported to your site, I’m pretty sure it  was yours, and at the time i didn’t have a scanner and probably did a poor job filling out the form.  I want another try. It's something you don't forget.  What actually got me thinking about it again, surfing channels,there was a show on Discovery channel and they talked about possible energy forms, mercury being one. My story;  It was a clear day, a few high cumulus clouds and at least 6 airliners at different altitudes, 20-30 thousand feet.  We get a lot of air traffic. I was driving north on interstate 95,exit227 I travel this road occasionally.  I happened to be looking at a cloud when I saw this cigar shaped object moving through the cloud, I might have seen it for 5 seconds It was moving east to west, about the same speed of the aircraft  around it.I thought,how can all these aircraft not see this?I’d say it was 20-30thousand ft high, may be 20 miles out. The airliners were barely visible other than a con trail. This object was a lot bigger,maybe as big as 6 greyhound buses, big enough to see in detail It seemed to be 1 dimension,there were 3 separate  rotating screens[blue like the sky with small clouds inside ringed by this flowing silver[that's where the mercury comes in] I was alone [unfortunately] I only saw one. I mentioned  it to my son afterwards and  he found a picture  on u-tube, they called it a helix. A grainy picture  but the same shape. I’ve thought about going back to that spot ,under the same conditions and looking for it .The experience has been both exciting and a little scary.Was it some sort of craft or a portal?I’v often looked into the night sky and wondered are we alone?Now I know we’re not.One odd thought I did have, the other day my wife and I were headed south on I 95,got to this exit and I wondered aloud,where did that saying every cloud has a silver lining originate?  I’v been married  33yrs,raised two sons, I do have a web site mrcanoe.com.I would be happy to answer any questions.  ((name deleted)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85290.html",
      "state": "ME",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc06d",
      "summary": "At approximately 11:20pm on September 10, 2011 there was a UFO flying parallel to highway 65 towards Lincoln this craft was flying low",
      "city": "lincoln",
      "shape": "unknown",
      "date": "2011-10-10T00:00:00",
      "story": "At approximately 11:20pm on September 10, 2011 there was a UFO flying parallel to highway 65 towards Lincoln this craft was flying low and very fast.   We lost it over trees towards down town Lincoln.   This UFO looked like 3 balls of orange lights going around each other slowly.",
      "link": "http://www.nuforc.org/webreports/083/S83854.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2b3",
      "summary": "Seen a craft, lots details; windows panels etc.",
      "city": "lincoln",
      "shape": "circle",
      "date": "2012-01-24T00:00:00",
      "story": "seen a craft, lots details; windows panels etc. Hello, incident occurred in the spring of 1988 (we were married in the fall) I had gotten out of the Marine Corps (January of 1988) we were out in a field in my pickup, I don’t remember when we first seen the object but we watched as it came closer it was HUGE,  you could see details panels / sections & lots of windows  (not a lot unlike a cruise ship) at one point I got out & just watched in awe of what was happening ,  I don’t know if awe is right word because there was no panic, no fear, perhaps wonder is the better word, I watched the windows hoping to see someone in there but never did,   You could make out corridors / halls inside I said it was huge so big I couldn’t make out a shape, round maybe the best description, didn’t glow but was bright sort of like a full moon,  (It was close right above us)  Anyway we watched it for a while I don’t remember how long we were there but finally we decided to leave didn’t drive far before we looked & it was gone (didn’t see it leave)  We got back to Lincoln (3-4 mile away) no one was around I took ((woman's name deleted)) home to her mother’s we never told anyone or talked of what happened (except next day, radio said there was an active Meteor shower the night before) wife & I just shook our heads looked at each other said it was no Meteor shower then never talked about it again for like 15 or more yrs. That’s what is strange no Panic or fear & no feeling of a need to tell anyone Now believe us or not, we don’t do drugs (drink moderately)we are not nut cases,  Both are professionals in the community, ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86729.html",
      "state": "MO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bc5ea",
      "summary": "i saw blinking lights in the sky, & think it was hovercrafts.",
      "city": "lincoln",
      "shape": "light",
      "date": "2012-01-24T00:00:00",
      "story": "i saw blinking lights in the sky, & think it was hovercrafts. I went to take my dogs outside when I noticed 3 blinkings lights in the sky.  They looked like they were far away and I assumed they were planes... that is until I realized they weren't moving, just hovering. I ran inside and got my littler brother who came and had a look for himself. The lights appeared to be moving just a tiny bit but not too much. One went dark then came back on..  then After a few minutes both of them stopped blinking and it looked like they disappeared. -  By the way they were changing from red to white in color.",
      "link": "http://www.nuforc.org/webreports/086/S86669.html",
      "state": "DE",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbda",
      "summary": "I saw a bright orange light rise up from near ground-level, hover a minute, and then ascend up into the sky.",
      "city": "lincoln",
      "shape": "light",
      "date": "2011-07-06T00:00:00",
      "story": "I saw a bright orange light rise up from near ground-level, hover a minute, and then ascend up into the sky. I was just thinking back to a year ago when a UFO was seen over Lincoln, and looking out my window, thinking that the only way I would see one tonight is if one was to appear right outside my window.   At that moment, I saw a bright orange light ascending slowly in the sky, as if it just arose from near ground-level.   I couldn't see it clearly through my bedroom window as it rose higher, so I dashed over to my porch, which offers only a small patch of clear sky to view.  The object hovered right in the small patch of sky at about 15 degrees over the horizon, while fireworks were going off far below it.  It was a bright orange light that was mostly steady but occasionally would pulsate.   As I thought about going inside to get a camera, the object began to move away and within a minute or less, it rose up into the sky and disappeared.   During the entire sighting, I could hear no sound from the object, even when I went out on my porch to view it.",
      "link": "http://www.nuforc.org/webreports/082/S82161.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbd9",
      "summary": "Sorry - false alarm; the bright orange light I saw was just a flare.",
      "city": "lincoln",
      "shape": "light",
      "date": "2011-07-06T00:00:00",
      "story": "Sorry - false alarm; the bright orange light I saw was just a flare. Sorry, but what I reported earlier tonight (within 30 minutes of the event) was apparently just a very steady-burning flare.   I saw another bright orange light later that evening and the second one had a visible parachute that took it drifting in the same general direction as the first light.  The first event occurred at dusk and I guess the lighting was such that a parachute couldn't be seen at that time.",
      "link": "http://www.nuforc.org/webreports/082/S82186.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bce43",
      "summary": "grapefruit sized blue globe!!",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2011-05-29T00:00:00",
      "story": "grapefruit sized blue globe!! we were driving our car down the street at 45 MPH when i looked up and saw a wierd fluttering blue globe, about the size of a grapefruit maybe 40 feet in the air.   when i turned to tell my fiancee to look she was already staring at it.  it flew very slowly across the front of our view and as i slowed to stop the car it flew off probably around 5 mph off to the right and just hovered away.",
      "link": "http://www.nuforc.org/webreports/081/S81330.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bce6a",
      "summary": "Two planes flying very close together , one with a contrail , the other had no contrail and just dissipated in a few seconds .",
      "city": "lincoln",
      "shape": "unknown",
      "date": "2011-05-29T00:00:00",
      "story": "Two planes flying very close together , one with a contrail , the other had no contrail and just dissipated in a few seconds . standing in my yard looking due west as the sun was 30 min from setting I noticed two planes heading east .. you could see the contrails from one plane but the other object had no contrail .. the object seemed to be a plane flying maybe 1000 ft to the right side of the plane and maybe 1000ft in front ..  but looked very close to the plane that had the contrail ...   suddenly it dispersed and was no longer seen from my position.  I watched the plane fly east all the way and the sun was still reflecting it .. the other object was not seen ...  in a way it  upset me as I don't know how to explain what it was ...   both the plane and object were shiny like a reflection off the plane .. I am a unemployed musician at this time ..  I have been in bands all over the world and have seen some pretty bazaar things over time ..  I do have almost a hour of missing time that still creeps me out when I think of it .. that event happened about 15 years ago ...  I would like for someone to try to help me with what I saw today ..",
      "link": "http://www.nuforc.org/webreports/081/S81467.html",
      "state": "AL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4ee",
      "summary": "Three single lighted aircraft that changed colors perform Close Encounter like night flight ballet over Rocklin, Ca.",
      "city": "lincoln",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Three single lighted aircraft that changed colors perform Close Encounter like night flight ballet over Rocklin, Ca. Traveling east bound on Hwy. 65 looking due south at appx. 20:15 hrs just passing Sunset Blvd. Still looking south just behind William Jessup College observed two single lighted aircraft rising from horizon level into the night sky to an altitude of appx. 100 to 150 feet. Both aircraft seperated in formation to begin areial manouvers of independent origin.  At first these manouvers seemed to be something that could only be achieved by a smaller remote control aircraft, tight and close quarter turns, loops and various synchronized aerobatics. As I was traveling at a rate of sixty-five miles an hour, I had to concentrate on driving while still trying to observe the aircrafts. Leaving the boundries of Rocklin and heading east towards Lincoln, I turned right onto Sterling Parkway and made the first right into a stripmall parking lot with a fairly unobstructed view to the southeast where I could observe the crafts. I watched as the aircraft which only appeared as ! a single color of white then turning to red was joined by a third craft now engaging ib the same acrobatic flight patterns as the other two.  Other observerers pulled into the stripmall parking areas but observed from different vantage points.  Another vehichle pulled up by my car and we observed the air-ballet together. We both noted that crafts each only had a single light that changed colors at intermitten intervals. ( Which were compared to other aircraft  that would randomly pass overhead  with traditional blinking red and white lights found on todays aircraft. We noted we did not know of anytype of aircraft that could make those sort of manouvers short of an Apache or AH-6 Littlebird yet even though they were at a guesstimated five miles or further away, no sounds were heard. After twenty minutes observing the crafts, they dropped below the horizon not to be seen again. After waiting a short period to see if they would return, they did not and the woman and her daughter! said they were returning to their home in Paradise to watch t! he late news to see of any reportings as I said I would also do. KCRA channel 3 news reported nothing of the sightings.",
      "link": "http://www.nuforc.org/webreports/092/S92395.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be542",
      "summary": "Greenish large circle with six same colored circles equally spaced around center circle",
      "city": "lincoln",
      "shape": "formation",
      "date": "2012-08-05T00:00:00",
      "story": "greenish larg circle with six same colored circles equally spaced around center circle hi,  I am a 17 year old, SANE, healthy, mother, and wife.   Earlier this morning I was talking to my husband, and behind him through my living room window I saw a UFO.  This UFO was a teal/green-ish color.  It had a big circle in the center with about six smaller green circles equally spaced around the larger, center circle.  There was no visivle connection, so I don't know if it was one UFO, or seven of them with one mother ship sort of thing. When I stood up to show my husband, his mother, and two sibilings the object vanished.  I nearly began to cry from the shock I was in.",
      "link": "http://www.nuforc.org/webreports/091/S91454.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3be662",
      "summary": "Star like object appears next to Big Dipper and flies toward northern California';s Sierra Nevada mountains..",
      "city": "lincoln",
      "shape": "other",
      "date": "2012-06-20T00:00:00",
      "story": "Star like object appears next to Big Dipper and flies toward northern California';s Sierra Nevada mountains.. I saw a second light adjacent to the lower right star of the Big Dipper's bucket appear at exactly midnight.  The new light or star was just below and very close to Big Dipper's lower right side star, top outside of the bucket star.  The Big Dipper is in the northwest sky to my position.  As soon as I saw this new star adjacent to Big Dipper, I focused and watched intently.  For approximately three to five seconds   It appeared stationary then started moving toward me in a south easterly direction.  It was the same brightness and size of the other Big Dipper stars.  It flew relatively slowly across the sky and was easy to track.  I watched it for 30 seconds and watched it fade out after it crossed California's central valley and approached Sierra Nevada mountains or above Auburn, California.  I noticed It had some bulk to it as It got closer and overhead, like a square with rounded corners but still looking like a star.  Looked at my watch after fade out, 12:01 AM June 18, 2012.",
      "link": "http://www.nuforc.org/webreports/089/S89695.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf398",
      "summary": "Triangular red, green and blue glowing & flashing object in Lincoln, CA, night sky.",
      "city": "lincoln",
      "shape": "triangle",
      "date": "2013-08-30T00:00:00",
      "story": "Triangular red, green and blue glowing & flashing object in Lincoln, CA, night sky. My Husband and I were cruising around town on August 12, 2013 around 9:30PM when we noticed a flashing red, blue and green object in the sky over a small section of town called Sun City.  It would fly up, hover for a bit and then fall.  When I witnessed the first “fall” of the object, I thought for sure it was a plane crashing. However, after its’ rapid descent, the object returned back into the sky.  My Husband and I followed the object, where it passed over into the Twelve Bridges section of Lincoln, CA.   We stopped the car and got out… the object slowly came towards our car, then hovered right above us.  I am unsure how high in the sky it was, all I know is it had very vibrant red, blue and green glow to it.  When I say it was flashing colors, there were not just a few lights, the entire object was glowing the colors. I stood there staring at the object for about 10 minutes as it just hovered above me, a car approached over the hill and I looked away from the object for a minute.  When I turned back I noticed it rapidly moving away from us back towards the original sighting area where it ultimately disappeared . I attempted to chase the object again in my car, however, my attempts to find it again failed.",
      "link": "http://www.nuforc.org/webreports/101/S101132.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf644",
      "summary": "Small orange glowing circular objects floating during the fireworks show.",
      "city": "lincoln",
      "shape": "circle",
      "date": "2013-07-14T00:00:00",
      "story": "Small orange glowing circular objects floating during the fireworks show. There were many circular objects floating from south to north during fireworks.  They were glowing an orange shade and were moving quickly and silently. We recorded the shapes on a cell phone and a small camera.  They would pop up from trees in the distance and simply fly away. Beforehand there was a small airplane flying directly over my building several times.  We did not see the plane during the orange lights. One orange circle floated very close to us but was still far enough away that we couldnt determine what it was.  It was unlike anything we had seen before.",
      "link": "http://www.nuforc.org/webreports/099/S99856.html",
      "state": "NE",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7ed",
      "summary": "5 red lights hovering low two dissappeared and remaining 3 formed triangle pattern.",
      "city": "lincoln",
      "shape": "formation",
      "date": "2013-02-04T00:00:00",
      "story": "5 red lights hovering low two dissappeared and remaining 3 formed triangle pattern Observed two balls of reddish orange color flying low parallel to another then dissappear.  Two of the same objects followed behind flying parallel with one single light following behind that pair.  The three objects remained in the sky for 3-5minutes forming tringular pattern.",
      "link": "http://www.nuforc.org/webreports/095/S95567.html",
      "state": "DE",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf878",
      "summary": "West to east in the midwest",
      "city": "lincoln",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "west to east in the midwest My husband and I were walking through southwestern Nebraska streets when I was compelled to turn around and look up. There was a bright, gold, asterisk-looking light moving from west to east across the night sky.  This was last Monday June 17th between 10:00pm and 12:30am central time.   I pointed out the light to my husband and we stopped for a bit to “let it catch up to us” as we were walking in an easterly direction. It moved very fast across the sky; too high and irregular to have been a satellite or asteroid. I began talking to it; telling the beautiful light that “we're trying to be in peace; we know it looks bad with all the war and whatnot, but we really have peace in our hearts.”  Then it stopped and descended very fast and the glow was brighter, with the scatter pattern of light getting bigger and brighter.  I continued talking to this thing/entity/ship/etc.  It moved from east to west; every once in a while along its flight path it would wiggle from south to north a tiny bit, and then continue along a very definable straight course. It lasted about 3 minutes, and we have been looking up around that time periodically throughout the last week and they appear to be showing up between the hours of 11:30pm and 12:30 am CST in the southeastern Nebraska area. Unfortunately, our camera is not fancy enough to catch these things; anyone have stills or even a video? Please share. Coincidentally, we saw a youtube video tonight of a similar occurrence in Brazil:  https://www.youtube.com/watch?v=mmpj7MqBAAk&list=FL02hH42H4ErIA4OQ1twIdpQ&index=1  The one we saw did not come as close, but appears to be similar in presentation, technology and design.  Anyone else seeing these in the midwest over the past 2 weeks?   On that night we also saw 2 lights hover, and then the one nearest to the horizon shot out an orangish-reddish blinking light, or drone, or plane of some sort which then traveled in a southwesterly direction.  It appeared to be cloaking itself as an everyday plane, but we saw where it came out of: the light that at first appeared to be a very bright star.  Over the course of that night, we saw many star ships.  It was unlike anything else I've ever seen.",
      "link": "http://www.nuforc.org/webreports/098/S98917.html",
      "state": "NE",
      "duration": "2.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8c0",
      "summary": "First seen in broad daylight.",
      "city": "lincoln",
      "shape": "triangle",
      "date": "2013-10-14T00:00:00",
      "story": "First seen in broad daylight. October 6, 2013 -Metallic triangle shaped object over Lincoln Nebraska.  Spotted at 5:00 pm and is still in the sky as of 8:23 pm.  Red, blue, white and green colors can be seen with binoculars.",
      "link": "http://www.nuforc.org/webreports/103/S103010.html",
      "state": "NE",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bf970",
      "summary": "Bright light over SE Lincoln, 19Jun13 dimmed and flew away.",
      "city": "lincoln",
      "shape": "circle",
      "date": "2013-07-03T00:00:00",
      "story": "Bright light over SE Lincoln, 19 Jun13 dimmed and flew away A Bright light approached from the N NW in the sky moving towards the S SE of the sky. Could tell it was in atmosphere. Movement was strange, moved from side to side in little movements like a feather in the wind.  Was round and bright like a light bulb. It flew above our house.  Was as high up as a small crop duster plane would be at max height. After it passed the house, I shined a powerful flashlight towards it.  Though I doubt it saw it, the object dimmed and became just a round (appeared to be) metal ball, until it flew out of the reach of my vision into the darkness of the night.  It didn't blink at all and made no sound.",
      "link": "http://www.nuforc.org/webreports/098/S98759.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfdb6",
      "summary": "Hovered in the sky with flashing lights.",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2013-09-09T00:00:00",
      "story": "Hovered in the sky with flashing lights. Ran across this story on the local news. https://sphotos-b-dfw.xx.fbcdn.net/hphotos-prn2/p480x480/1236243_627997693899348_919149187_n.jpg",
      "link": "http://www.nuforc.org/webreports/101/S101982.html",
      "state": "NE",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bfee5",
      "summary": "Round bright white light, moving slowly and effortlessly to the west, hovered in one area for 45min left in opposite direction.",
      "city": "lincoln",
      "shape": "unknown",
      "date": "2013-09-09T00:00:00",
      "story": "Round bright white light, moving slowly and effortlessly to the west, hovered in one area for 45min left in opposite direction At approximately 210 am, a few thousand feet up in the sky, a round non-flashing bright light (no other colors noted besides white) was moving at a slow pace towards the western sky (slower than a one pilot plane).  No other bright stars were present at this time.  The object seemed to hover around that area only to move only back and forth maybe 100ft?  It would move discretely from north and then move again to the south but never making any big move.  It made no sense when it would get dim or brighter either?  It could be stationary for a time and get dimmer then all of a sudden get brighter. (Like when a plane puts its landing gear light on.)  It appeared to be poised effortlessly for 45minutes in that same area only it would dim and then brighten again.  At one point in time there seemed to be a series of flashes taking place outside the object, this lasted only a couple seconds (like picture flashes from a camera).  Also, when the object was dim the shape seeme! d like a teardrop shape?  At approximately 250am the object had moved eastward and was out of sight from my standpoint.",
      "link": "http://www.nuforc.org/webreports/101/S101983.html",
      "state": "NE",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bff85",
      "summary": "Two white dots crossing paths around Lincoln and Providence RI.",
      "city": "lincoln",
      "shape": "light",
      "date": "2013-10-03T00:00:00",
      "story": "Two white dots crossing paths around Lincoln and Providence RI. I was driving along Route 146 going South near the exit for the Lincoln Mall.   Two small, bright lights were low in the sky, heading on a path to cross each other at an angle.   One going up at a 45 degree angle, one going down at a 45 degree angle.  After they passed each other it took about 1 second for them to disappear.",
      "link": "http://www.nuforc.org/webreports/102/S102866.html",
      "state": "RI",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c00fa",
      "summary": "Color changing and flashing light over Lincoln, CA.",
      "city": "lincoln",
      "shape": "flash",
      "date": "2013-09-09T00:00:00",
      "story": "Color changing and flashing light over Lincoln, CA. A color changing and flashing object that moved in a circular motion as if tethered to the ground by a wire.  This flight pattern occurred for about 20 seconds and then the object flew off in a North East direction and continued to change color and flash.  It was moving very quickly, faster then a passing plane.",
      "link": "http://www.nuforc.org/webreports/102/S102040.html",
      "state": "CA",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0346",
      "summary": "I looked directly overhead and saw large asterix * shaped yellow large light move horizontally",
      "city": "lincoln",
      "shape": "other",
      "date": "2013-07-05T00:00:00",
      "story": "I looked directly overhead and saw large asterix * shaped yellow large light move horizontally I was looking straight up into the night sky and it was black ..then I had this overwhelming feeling of love coming over me--a large asterix * type of yellowish light came out of nowhere and began traveling west from where I am.  It made no noise but was twinklng somewhat.  It was very large and it moved horizontally.   It lasted about 4minutes and faded into the distance.",
      "link": "http://www.nuforc.org/webreports/099/S99644.html",
      "state": "NE",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c12e4",
      "summary": "Boomerang object over 100 feet long and silently glided past my house; no lights; no sounds.",
      "city": "lincoln",
      "shape": "unknown",
      "date": "2013-12-02T00:00:00",
      "story": "Boomarang object over 100 feet long and silently glided past my house;no lights;no sounds Got out of my car and looked up at the stars and noticed a dark shadow from the corner of my eye and when I looked straight at it I could hear no sound or lights, but as it was going by I could see a little relection of city lights on it and it appeared to be between 1 and 3 thousand feet up and it resembled a sort of boom a rang and it appeared to be over 100 feet long.  I could not believe what I was seeing and I seriously was freaking the ((deleted)) out!   As it glided thru the sky it made no noise and I followed it for about 15 seconds and it went beyond the big trees in my back yard.  and I lost it in my sights.  I dont know what it was and I dont think the Air Force would be testing any new planes in a populated area, at least we hope that thats all it was! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104833.html",
      "state": "NE",
      "duration": "15  seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1497",
      "summary": "Red, blue green lights of one unit observed in patterns back and forth and large circles.",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2013-11-20T00:00:00",
      "story": "Red, blue green lights of one unit observed in patterns back and forth and large circles. Lights green, red, blue in color seemingly floating back and forth and in a circle pattern.  Moved to right, made patterns, back to the left, made circular pattern and then slowly went out of sight and low in the sky.  We observed this ufo for approximately 5 minutes before it slowly moved to the right.    I am a resident of Sun City Lincoln Calif and have a college degree and am a retired teacher.  My friend is also a resident and former business owner.  We observed the object that seemed to be at a height of 3000 feet.",
      "link": "http://www.nuforc.org/webreports/104/S104500.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1849",
      "summary": "Blueish green sphere moving back an forth on top of Mountain.",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2014-07-20T00:00:00",
      "story": "Blueish green sphere moving back an forth on top of Mountain. Blueish sphere on top of mountain moving slowly back and forth.  Sphere moved to the right roughly 100 yards then began to move back and forth again.   The light moved down the mountain about 75 yards then back to the top.   The sphere was changing from blue to green to blue it then shot down the mountain just above the tree line and sped off to the right at an tremendous speed.",
      "link": "http://www.nuforc.org/webreports/111/S111574.html",
      "state": "NH",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c19b7",
      "summary": "Bright flashing followed by red glowing pairs.",
      "city": "lincoln",
      "shape": "light",
      "date": "2014-07-20T00:00:00",
      "story": "Bright flashing followed by red glowing pairs At around 11:00 pm, I noticed some bright, white flashing lights coming from inside the forest behind my grandparent's home.   After looking harder, I observed 3 glowing pairs of red lights just beyond the tree line.   The flashing was not lightning, as it was dead silent, with almost no clouds in the sky.   When I tried to capture the event on camera, nothing would show up and the screen would go black. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111532.html",
      "state": "NE",
      "duration": "120 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d40",
      "summary": "The craft was hovering above the tree line circling the area, going back and forth. The craft then shot down the mountain at a speed t",
      "city": "lincoln",
      "shape": "oval",
      "date": "2014-07-11T00:00:00",
      "story": "The craft was hovering above the tree line circling the area, going back and forth .  The craft then shot down the mountain at a speed that was unlike anything I've seen , then did like a check mark looking maneuver and disappeared.   The oval object  was changing from a greenish color to a blue",
      "link": "http://www.nuforc.org/webreports/111/S111388.html",
      "state": "NH",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e98",
      "summary": "Three lights in south Lincoln sky,two of which sped off in opposite directions right before my eyes.",
      "city": "lincoln",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "Three lights in south Lincoln sky, two of which sped off in opposite directions right before my eyes. I witnessed three spheres of dingy white light traveling at incredible speed south of my home.   At first the three lights were still as though they were stars then the one light furthest to the east began moving eastbound at an amazing speed.  I thought maybe a satellite could be what i was seeing but no way, the object was moving way to fast (to my knowledge).   Then the light furthest to the west did the exact opposite in the other direction but then curved straight up and disappeared into the sky.   The third light remained stationary as if it were a star then nothing after that.I stopped watching and returned inside my home not knowing if what i had seen was ufo or something perfectly explainable. ((NUFORC Note:  We suspect an evening sighting, and have amended the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109808.html",
      "state": "NE",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f40",
      "summary": "Low alt. flyover of red turning to blue then back to red sphere. Rapid departure.  ((NUFORC Note:  Model airplane??  PD))",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2014-05-02T00:00:00",
      "story": "Low altitude neighborhood flyover of red turning to blue then back to red sphere.  Rapid departure. A deep red sphere was seen hovering over the Hoit District neighborhood approximately 200 ft above the ground.  My friend and I were on bicycles returning home 1/4 - 1/2 mile west of object.  While watching the object slowly move southward, approx. 3/10 mile as a deep ruby red color, it tuned into a deep blue color, still spherical or circular shape.  It was larger than a car and smaller than a house.  It was blue for approx. 10 seconds then turned completely deep red again.  It seemed to climb slowly to perhaps 300 - 350 ft., hover about 5 - 6 seconds then darted horizontally toward the northeast for a very short distance then quickly descended or dipped toward the ground toward Virginia Town Rd. and Fruitvale Rd. and out of sight.  We waited a while and did not see it again.  My friend thought it might be a RC helicopter but I know it was too big to be a model and moved to fast to be a model during the departure from the area. Flying a model requires line of sight and there are too many trees and power lines to fly in that area.  The red and blue colored light were bright and soft, a unique wavelength.   We rode through the neighborhood looking for anyone who might be flying a model.  No neighbors sighted outside.",
      "link": "http://www.nuforc.org/webreports/108/S108920.html",
      "state": "CA",
      "duration": "25-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c23b2",
      "summary": "I left my apartment around 9:15 PM.  It was dark out.  I walked toward my car in the parking lot of the apartment complex.  To the east",
      "city": "lincoln",
      "shape": "circle",
      "date": "2014-03-27T00:00:00",
      "story": "I left my apartment around 9:15 PM.  It was dark out.   I walked toward my car in the parking lot of the apartment complex.  To the east (or right of me) was the biggest, brightest white circular light I have ever seen.   The object looked like an intense light with an aura of  lighter light around it.  It was coming right towards me like it was going to land in the parking lot.   The object got bigger and bigger until it was around fifty yards in diameter and fifty yards away from me.    I then went inside my apartment scared and looked out the widow.  It was still hovering in the same place and was the same size.   It then unnaturally stopped and shot straight up in the air super fast and then disappeared in less than a second.    After a few minutes, I decided to go outside again and got in my car.  My neighbor was driving into the parking lot at that time.  As I was telling her what happened from my car, the object reappeared again.   I got out of my car.  The circular white light then moved towards us in the same manner it did before until it appeared it was around fifty yards away from us.   A third witness also viewed the object from his balcony.   The object stopped again and shot up into the sky in the same manner it had before.   We waited a few hours for it to come back but it never did.",
      "link": "http://www.nuforc.org/webreports/108/S108041.html",
      "state": "NE",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2658",
      "summary": "3 orange orbs about 100 yards away in sky. hovering and moving in formation. mesmerizing. orange, not overly bright. other drivers saw.",
      "city": "lincoln",
      "shape": "fireball",
      "date": "2014-10-03T00:00:00",
      "story": "3 orange orbs about 100 yards away in sky.  hovering and moving in formation. mesmerizing. orange, not overly bright. other drivers saw 3 orange orbs about 100 yards away in sky. hovering and moving in formation. mesmerizing. orange and not overly bright.   other drivers pulled over to witness orbs. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114085.html",
      "state": "MA",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3c297f",
      "summary": "While driving i seen what looked like something falling from the sky and before i could find my phone to try and get it on camera if fl",
      "city": "lincoln",
      "shape": "flash",
      "date": "2014-11-21T00:00:00",
      "story": "While driving i seen what looked like something falling from the sky, and before i could find my phone to try and get it on camera it flashed one last time and was gone.  ((NUFORC Note:  Possible meteor from the Leonid Meteor shower, although meteors rarely, or never, are visible for as long as one minute.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115412.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c2972",
      "summary": "((NUFORC Note:  No information provided by source of report.  PD))",
      "city": "lincoln",
      "shape": "light",
      "date": "2014-11-14T00:00:00",
      "story": "((NUFORC Note:  No information provided by source of report.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115268.html",
      "state": "NE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29d3",
      "summary": "Red/green light shooting in Lincoln, NE, night sky 11/17/14.  ((NUFORC Note:  Possible Leonid meteor??  PD))",
      "city": "lincoln",
      "shape": "circle",
      "date": "2014-11-21T00:00:00",
      "story": "Red/green light shooting in Lincoln, Ne, night sky 11/17/14. I looked up to the sky as I was pulling out of a parking space in a parking lot of an empty lot. and it looked like a hooting star.   It appeared red and as it shot into the sky it turned green and disappeared the way a shooting star would.  It was only for a a couple seconds.  It was a small round shape.   The area we were in was empty with few cars.  There was a school across the street from the store and and another store across the parking lot.  The lot was empty.  A few cars parked. No traffic.  Semi well lit area. ((NUFORC Note:  Possible Leonid meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115425.html",
      "state": "NE",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d69",
      "summary": "Sky lighting up, ball of light shot towards ground.",
      "city": "lincoln",
      "shape": "light",
      "date": "2014-08-29T00:00:00",
      "story": "Sky lighting up, ball of light shot towards ground. Sky lit up like lightning, but no clouds anywhere.  Looked out the window to see what was up and saw a comet like ball of light shooting straight towards the ground, then disappeared.",
      "link": "http://www.nuforc.org/webreports/112/S112822.html",
      "state": "NE",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c32a0",
      "summary": "Low orbit orb in western sky.",
      "city": "lincoln",
      "shape": "light",
      "date": "2015-04-03T00:00:00",
      "story": "Low orbit orb in western sky. One low orbit orb was viewed in western sky.  When first viewed it was following a normal trajectory then abruptly vanished.  The orb was light blue and bright.  The light was viewed for 1 minute before disappearing.",
      "link": "http://www.nuforc.org/webreports/118/S118080.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3670",
      "summary": "Bright object in the night sky, changing from blue to green to red.  ((NUFORC Note:  Possibly \"Sirius?\"  PD))",
      "city": "lincoln",
      "shape": "unknown",
      "date": "2015-02-06T00:00:00",
      "story": "Bright object in the night sky, changing from blue to green to red. Husband and wife saw bright blinking light in the night sky, changing from red to green to red.   May be moving very slowly, hard to tell. ((NUFORC Note:  We strongly suspect the sighting of a star, but cannot be certain.  Witness elects to remain totally anonymous, and provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117081.html",
      "state": "CA",
      "duration": "still going"
    },
    {
      "_id": "64d005f478aba2ec5a3c38fb",
      "summary": "Four green lights appeared over the new construction behind the grocery store as we were driving home from dinner. They were in line wi",
      "city": "lincoln",
      "shape": "changing",
      "date": "2015-01-09T00:00:00",
      "story": "Four green lights appeared over the new construction behind the grocery store as we were driving home from dinner.  They were in line with each other and appeared to be maybe 1 mile above ground.   They began to slowly disappear starting from the right side to the left until they all faded away. My daughter and I were together and didn't say anything to each other about what we saw until the last light started to fade out and as we shared what we had seen, it was exactly the same.",
      "link": "http://www.nuforc.org/webreports/116/S116570.html",
      "state": "NH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a56",
      "summary": "Three red glowing lights viewed by three individuals.",
      "city": "lincoln",
      "shape": "light",
      "date": "2015-08-06T00:00:00",
      "story": "Three red glowing lights viewed by three individuals. Three red lights came from the south, two in front, one shortly after.   The first two took off in opposite directions, one going east the other northwest.  The trailing one I watched flying, not over the horizon out of sight, but it flew directly into space until no longer visible.",
      "link": "http://www.nuforc.org/webreports/120/S120872.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3bb1",
      "summary": "3 large, fast and bright turquoise ovals circling each other, 15min, 2 witnesses. Lincoln, VT.",
      "city": "lincoln",
      "shape": "oval",
      "date": "2015-08-06T00:00:00",
      "story": "3 large, fast and bright turquoise ovals circling each other, 15min, 2 witnesses. Lincoln Vt At 23:11, August 3, 2015, in South Lincoln, VT, clear night with a few spotted clouds after a day of thunderstorms.   I went out to pet the dog, and was looking due west, when I spotted 3 large and bright, turquoise, oval lights.  They appeared as though the light was blocked by a cloud, the color was foggy and diluted.  They where very large and bouncing about darting across the sky in an irregular and excessively speedy flight pattern.  The three lights appeared to be  all the same and very close to me.  The visible aspects where only the large (dime sized) turquoise balls of fading light.  The three always staying close to each other making irregular circles around each other.   I went inside to freak out (the dog was unfazed) and grabbed my boyfriend and told him to come look.  He was convinced they where drones, but I'm not convinced at all.  I went inside and brought my iPhone out and took a video, but the ovals where not bright enough.  As I took this video, a plane was flying directly overhead, much higher in the sky and clearly and airplane, you can hear it in the recording.  This only showed a greater and obvious comparison between the two, I compared them on my video.  I also witnessed a strange phenomenon of light reflecting off of the plane passing over head, very high above, and much higher than the 3 ovals.  As the plane passed over my roof top directly next to me, a bright white light reflected off my house-I think it was unrelated but also something I had never seen before.  I tried again with to video it with my Canon rebel, same struggle with a dark image.   I then went back inside to ask my boyfriend to check them out again at about 23:26 and they where gone and the sky had gone dark.",
      "link": "http://www.nuforc.org/webreports/120/S120856.html",
      "state": "VT",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c8f",
      "summary": "Red, green, and yellow flashing lights moving in ninety degree angles.",
      "city": "lincoln",
      "shape": "light",
      "date": "2015-07-31T00:00:00",
      "story": "Red, green, and yellow flashing lights moving in ninety degree angles I saw a stationary object in the the eastern sky outside my bedroom window in the far distance (like an airplane distance).   At first I thought it was a plane or helicopter but noticed it did not move for about a minute despite having very bright yellow and red lights.  I went to get my mother and when we returned to my window it had moved and remained stationary until it went straight down 45 seconds after returning to the window.   We left, and when I returned, the second time it had gone to its position before, but was now flashing a green and yellow light and moved quite suddenly to to the left and descended a second time.   It has remained out of sight since but it only moved in 90 degree angles.",
      "link": "http://www.nuforc.org/webreports/120/S120750.html",
      "state": "NE",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c463a",
      "summary": "Object resembling shooting star made 90 degree angle turn in broad daylight (3:45 pm).",
      "city": "lincoln",
      "shape": "flash",
      "date": "2015-11-06T00:00:00",
      "story": "Object resembling shooting star made 90 degree angle turn in broad daylight (3:45 pm). Driving N-N/E on interstate I-80, nearing Omaha, coming from Lincoln about 3:45 pm.  I witnessed a glimmer in the sky off to the right of the interstate to the east travel northbound leaving a trail, then after 10-12 seconds made an immediate right angle turn due east and disappeared after 3-4 seconds behind a cloud.  Resembled a bright shooting star but in broad daylight and made a 90 degree angle turn immediately. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123289.html",
      "state": "NE",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c47a0",
      "summary": "Strange lights changing colors, moving slowly and hovering with no noise.",
      "city": "lincoln",
      "shape": "light",
      "date": "2015-10-16T00:00:00",
      "story": "Strange lights changing colors, moving slowly and hovering with no noise. Sitting in my backyard with family.  Saw an alternating blue and red light flashing.  No noise at and moving straight up. It then stopped mid air and hovered then slowly moved to the right. My four year old got scared so I brought her inside.  I was saying goodbye to the family at the front door a few minutes later and saw past them up into the sky and object up higher in the sky, again no noise, moving slowly to the left then stopping and hovering.  His one flashed all colors of light-blue, into violet, into red, orange, yellow, green and so on. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122748.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4799",
      "summary": "I can't believe this craft went undetected for so long!",
      "city": "lincoln",
      "shape": "triangle",
      "date": "2015-10-09T00:00:00",
      "story": "I can't believe this craft went undetected for so long! On the night of the Lunar Eclipse, I went outside about half past midnight to get some cool air.  I lit a cigarette and proceeded to scan the sky to see the moon.  The moon was bright in the western sky.  However I looked up to the east and I saw red, green, and white lights blinking in the sky in a triangle shape.   As there is a Skunk Works base not too far south from here I thought it might be a stealth bomber coming in, because it was much larger than say a 727.. which is usally the biggest passenger jet to land in Lincoln.   Once I put my glasses on, I could see a Triangle Craft hovering over the southeast.  I watched it for around 30 minutes before I came inside.  About an hour to an hour and a half later I went back outside... and to my surprise it was still there.",
      "link": "http://www.nuforc.org/webreports/122/S122499.html",
      "state": "NE",
      "duration": "~2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b89",
      "summary": "A triangle shaped craft with blinking red and blue lights flew at 90 degree angles with stationary lights on the bottom.",
      "city": "lincoln",
      "shape": "triangle",
      "date": "2015-09-29T00:00:00",
      "story": "A triangle shaped craft with blinking red and blue lights flew at 90 degree angles with stationary lights on the bottom. My wife and I were sitting on the back deck with our children watching the Supermoon/Lunar Eclipse.  At 9:43, the kids had just gone inside when my wife and I saw a triangular craft directly in the sight of the moon.  The craft had blue and red lights blinking rapidly, and there were stationary lights shining on the bottom.  While in sight of the moon, the craft maneuvered with 90 degree angles and what seemed like sharp figure 8 motions.  A few seconds after moving sporadically, the craft stabilized and flew in a straight line out of sight.  Besides the impressive maneuvering, the triangular craft moved at a rate of speed seeming faster than what a jet would.  The craft looked solid with its triangular shape.",
      "link": "http://www.nuforc.org/webreports/122/S122347.html",
      "state": "AR",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4efb",
      "summary": "Bright light shooting straight down toward the airport.  ((NUFORC Note:  Possible meteor??  PD))",
      "city": "lincoln",
      "shape": "light",
      "date": "2016-03-18T00:00:00",
      "story": "Bright light shooting straight down toward the airport. Large, round, green tinted, very bright light.  Shot straight down over the airport and light faded before hitting the ground.  Very fast, all happened within seconds.  I'm skeptical, because of its proximity to the airport, but I'm not aware of any aircraft that can fall straight to the ground at such a high speed. ((NUFORC Note:  Possible meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126328.html",
      "state": "NE",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5098",
      "summary": "Waiting in a empty parking lot with my freind in his car I observed a blue and white light appear out of pitch black sky and completely",
      "city": "lincoln",
      "shape": "light",
      "date": "2016-03-04T00:00:00",
      "story": "Waiting in a empty parking lot with my friend in his car, I observed a blue and white light appear out of pitch black sky and completely take off towards the North Attleboro/Cumberland area at an amazing speed.  Only saw it for maybe a sec.  Until it was too far away.   What makes me think about and even report this is that me and my father were working earlier during the day maybe around 11:00 and 4 us fighter jets came extremely low in formation over my house and that is the first time it has ever happened.  They were going almost in the exact direction that I saw the light originate from.   Never posted before but this was real.  I know what it was I have seen many comets and shooting stars this was no where even close to that.",
      "link": "http://www.nuforc.org/webreports/126/S126169.html",
      "state": "RI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c552a",
      "summary": "V-shaped lights, which turned red when I stopped to watch it, then flared brilliant white and moved toward me.",
      "city": "lincoln",
      "shape": "diamond",
      "date": "2015-12-04T00:00:00",
      "story": "Vee shaped lights, which turned red when I stopped to watch it, then flared brilliant white and moved toward me. Just at 18:00 hours, I left my place of work and started to my car.  There were only 2 cars in the parking lot, and it was already quite dark.  I looked to the north over the building across the street and saw one V shaped group of white lights (I believe there were 5 lights.  It looked like the object was only a couple hundred feet in the air.  I could also see a larger outline off to the left, which made it a large, horizontal diamond shape. I stopped and watched, and when I stopped, the light immediately changed to red and then quickly flared into an amazingly bright light.  I was able to get a photo with my cell phone, and then it started moving toward me very slowly.  It then began moving toward me faster, and I walked to my car and got in, instantly turned the key and turned the lights on with no problem, looked out the window, and it was simply gone.  I got out of the car to check, and except for stars and planets, the sky was completely empty.",
      "link": "http://www.nuforc.org/webreports/124/S124486.html",
      "state": "NE",
      "duration": "~8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c73",
      "summary": "Large triangle shape, defined by a series of dim lights moving silently and fast.  South to north over Lincoln, Nebraska.",
      "city": "lincoln",
      "shape": "triangle",
      "date": "2016-03-24T00:00:00",
      "story": "Large triangle shape, defined by a series of dim lights moving silently and fast.  South to north over Lincoln, Nebraska. I was sitting outside at the patio table with my dog sitting next to me.  The night was clear, and the stars where bright.  I looked down at my dog, her ears were perked up,and she was focused on something in the sky off to the south.  Very strange to see her follow what ever it was until she was looking straight up.  This caught my attention because it's strange for  Dogs, or cats to follow flying objects like airplanes, and helicopters.  I followed my dogs gaze, and directly over me I saw a series of dim lights that clearly defined a huge Triangle, and it was moving North very quietly and very fast.  There were no red or green identifiers or strobes.  The lights did not appear to be on the outside of the object, but more like the dim  light you would expect coming from windows.  My sense was that its altitude was in the hundreds not the thousands because there was a halo effect around the lights due to the moist air.  The Object was perfectly silent. From the time I noticed my dogs ears perk up to the time it vanished off to the north...6 seconds at the most. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126448.html",
      "state": "NE",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d9b",
      "summary": "Silver aircraft hovered over city then vanished.",
      "city": "lincoln",
      "shape": "oval",
      "date": "2016-12-05T00:00:00",
      "story": "Silver aircraft hovered over city then vanished. Silver metallic object hovered over the city for about 2 minutes and then just vanished. I was driving East towards the city on West O at 11am on Sunday morning when I noticed an object in the sky, probably just a plane I thought.  I kept looking up and noticed it was hovering and thought it may be a military aircraft but it was too far to make out.  All of a sudden it vanished!  I pulled over to see if I could see the path of the aircraft outside of the car, but nothing.  Weird. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131357.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6557",
      "summary": "Observed Bizarre UFO Hovering over Trees-Lake- & then Flew right over our head while watching the meteor shower.",
      "city": "lincoln",
      "shape": "triangle",
      "date": "2016-08-16T00:00:00",
      "story": "Observed Bizarre UFO Hovering over Trees-Lake, & then Flew right over our head while watching the meteor shower I went with 4 friends to watch the meteor shower at Lincoln Woods in Lincoln, RI,.  We parked in a neighborhood, and walked through the woods, until we got to a large dirt square opening with benches.  The area was overlooking a lake/pond.  We all were just chillin/hanging out, looking for meteors.. which I had never seen before, so it was very cool.  I was laying on the ground on my back, and I had two friends on the bench and the others were just standing around at the time. my friend was saying there was this super bright light that was rising across the lake.  I got off the ground to see what she was talking about, because she was trying to figure out if it was actually rising or if it was a meteor or what. so we all started watching this bright light and at first it kind of looked like it could belong to a tower or something... but then it started rising way more over the trees... same size same brightness... and we were just like what is that... and then it start! ed coming toward us...like it all of a sudden was hovering over the middle of the lake it came from being the bright light rising then all of sudden was right over the lake:.. I was saying holy **** like we are going to get sucked up, like I didn't know what we were going to do, it was very low to the ground compared to how you see objects fly.... but then it just flew right over our heads .... it was a triangle and had green red and white lights or something along those lines... they were verryyy bright and they had a few different colors which I think was green red and white but maybe was plus or minus a color ... anyways I couldn't stop thinking about this and like what the heck was that so I googled if anyone else has seen anything like that and found this website",
      "link": "http://www.nuforc.org/webreports/129/S129258.html",
      "state": "RI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6577",
      "summary": "2 lights seen on horizon in Lincoln Nebraska.",
      "city": "lincoln",
      "shape": "light",
      "date": "2016-08-02T00:00:00",
      "story": "2 lights seen on horizon in Lincoln Nebraska. Was seen looking to the north-northeast, completely overcast skies, looked to be a fair distance off. 2 balls, one red and flickering white, and one blue flickering white slowly moved across the sky, for some time I thought they were planes, but they continued to move around each other, one plunged to the ground before the two appeared to fuse, one may have just moved away,  as I took time to tell someone and ask them to come look. The ball then became solid white and moved with high speed.  Before about ten minutes after the event started, the object seemed to move closer at high speed, before turning around and staying in near the same location for around 5 minutes.  It also caused my cats to become distressed and worried, one of them constantly looking out the northeast facing windows of my house. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128716.html",
      "state": "NE",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6614",
      "summary": "Orange orb traveling north/west.",
      "city": "lincoln",
      "shape": "circle",
      "date": "2016-08-02T00:00:00",
      "story": "Orange orb traveling north/west Around 10:20 Pm, I looked out my sons window and saw what I thought was an orange drone flying north.  It isn't uncommon to see drones because Beale AFB is 10 miles north of my house.  But something about this one was different.  This one seemed to be higher up in the sky than normal.  It wasn't flying in a straight line like every one I've seen.  It seemed like it had short burst of speed and would veer to the west when it had a burst.  I decided it was worth watching and so I went out front and watched it until it disappeared.  This one ended up heading North West and ended up heading over the Sierra Nevada mountain range.   There was two times I though I saw a faint blue orb flying next to it.  It might of been a satalight but it never once dimmed like the ones I usually see.  I saw the object for about 5 minutes.   My dad was a pilot and I am obsessed with planes. ((NUFORC Note:  We have changed the date.  PD",
      "link": "http://www.nuforc.org/webreports/128/S128786.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b76",
      "summary": "500 orbs being chased by a jet.  ((NUFORC Note:  We would welcome additional reports.  PD))",
      "city": "lincoln",
      "shape": "fireball",
      "date": "2017-01-26T00:00:00",
      "story": "500  orbs being chased by a jet. Around 18:00, I and another were sitting inside, and started to hear the sound of possible two jet plans.  As the noise grew louder so did our suspision and we proceeded outside.  As we looked up we were unable to see any jets in the sky as they sounded directly above us.   Looking towards the south-east a glow of several orbs appeard very faint roughly 12.  Over the next few minutes the orbs grew in intensity as more appeared.  Roughly 500-1000 appeared and disappeared as we watched.  There seemed to be no more then 50 at a time.  Movement was slow and looked at first to fall but then recover and fly higher as the light would fade then repeate.  The lights continued but our view was interrupted by the mountain.  My feeling was that the lights were very high in the atmosphere compared to the low flying jet or jets. ((NUFORC Note:  We have not spoken yet with the source of this report, but we hope to do so.  Also, we plan to contact the local press in the vicinity of Lincon, NM, to attempt to verify the claims above.  PD)) ((NUFORC Note:  We finally spoke with the source of the report, and he assured us that it is legitimate.  We would welcome additional reports, in order to corroborate the alleged sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132237.html",
      "state": "NM",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f5b",
      "summary": "Balls of light flying high in the sky from Sacramento to Reno West to East.  ((anonymous report))",
      "city": "lincoln",
      "shape": "sphere",
      "date": "2017-07-07T00:00:00",
      "story": "Balls of light flying high in the sky from Sacramento to Reno West to East …. I witnessed them every night for the last week Every night at 10 PM sit on my back porch watch the sky and sure enough from west to east heading toward Reno, NV, from Sacramento these balls of light fly  across the sky,  sometimes changing direction this particular night it was approaching and let off a bright white piercing light shot forward and repeated that bright flash and cont' east towards Reno Nv … you can see these do this every night, balls of light.  Cruising across the night sky towards Reno and sometimes on the return from East to west towards Frisco. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134749.html",
      "state": "CA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6fdb",
      "summary": "We were staring at the stars when a bright light flashed for approximately 2 seconds before disappearing, It seemed to have a spin to t",
      "city": "lincoln",
      "shape": "light",
      "date": "2017-08-04T00:00:00",
      "story": "We were staring at the stars, when a bright light flashed for approximately 2 seconds, before disappearing,  It seemed to have a spin to the movement, and flash then saw another slightly less bright in a similar area in the sky they were about 45 seconds apart.",
      "link": "http://www.nuforc.org/webreports/135/S135392.html",
      "state": "NE",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7164",
      "summary": "White flashing lights on one mile long disk hovering and moving above and along the lake.",
      "city": "lincoln",
      "shape": "disk",
      "date": "2017-08-04T00:00:00",
      "story": "White flashing lights on one mile long disk hovering and moving above and along the lake. My Mom lives in Lincoln, WA, sometimes shown as Creston, Wa, on the web.  We are about half a mile from a boat launch on Lake Roosevelt.   My mom and I were watching tv at 23:55 or 11:55pm, when my step dad walks inside the house from the porch.  He says to my mom, “Come listen to this noise, I have never heard anything like it.”   So my mom goes outside with him on the porch.  I do not follow him at first because he was so calm.  Then my mom opens the door and frantically calls out to me, “Come out here as fast as you can!”   I run out to the porch and instantly see this long string of lights in the sky, and there is this loud, ominous, deep vibrating sound that I can feel vibrating though my feet on the deck.  The only way I would be able to describe this sound would be if there was a giant wine glass with a mile wide rim, and a wet finger continuously rubbing along the rim to make this deep low hum. The string of lights are white and flashing or pulsating in what appeared to be a sequence running around the perimeter of a disk.  We could not see the definite outline of the craft because it was dark and also very smoky from recent fires.  But we could tell by the pattern that the lights were moving that it was most likely a disk or ring shape.  The craft looked like it was about a mile long, and maybe 1,000 feet above lake Roosevelt.   We first saw the craft to the east, moving very very slowly.  Its path appeared to be following the curves of lake Roosevelt, headed north, then north west.  We could still hear the hum or vibration from the craft about three or four minutes after it was out of view.  I was in such shock that I could not stop crying my eyes out.   My mom tried to calm me down by reminding me that the day before this event, or maybe two days before, the local news station gave a statement from the local air force base, Fairchild Air Force Base, saying that people should expect to see strange aircraft maybe even foreign crafts.  But the broadcast was almost in a joking manner.   This changed my mood from scared and sad to scared and mad.  If this was indeed secret military aircraft, how dare they mock our fear when we discover their dark secret of bizarre advanced technology. ((NUFORC Note:  We spoke via telephone with the young woman who submitted this report, and she sounded to us to be quite eloquent, and quite sincere.  Please see other similar reports from Oakesdale, WA.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135534.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c73a5",
      "summary": "I saw what I initially thought was a satellite, but then it disappeared and reappeared multiple times.. It appeared for approximately 5",
      "city": "lincoln",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "I saw what I initially thought was a satellite, but then it disappeared and reappeared multiple times..  It appeared for approximately 5 seconds before it faded to disappear then reappear 5-10 seconds later in the same line, but after it disappeared behind a house it reappeared in the spot that I originally saw it and move in a 90 degree direction that it was going the first time..",
      "link": "http://www.nuforc.org/webreports/134/S134197.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7451",
      "summary": "2 Lights, one wobbling, one stationary. 150 degrees SE for ten minutes. Gone after 30. ((anonymous report))",
      "city": "lincoln",
      "shape": "light",
      "date": "2017-05-15T00:00:00",
      "story": "2 Lights, one wobbling, one stationary. 150 degrees SE for ten minutes. Gone after 30. A friend, his girlfriend, and myself were standing outside talking, and he pointed the lights out to me at about 02:30.  They were in the southeastern sky (approximately 150 degrees on the compass).   The right and left lights were only very slightly one above the other with the left one being a tad higher.  The left light would wobble back and forth and up and down but the right light was as steady as a rock.  It seemed to be getting closer as we headed inside after watching them for a good ten minutes.   We did not hear any planes passing with in hearing distance.  When we returned outside 30 minutes later we could no longer see the lights.  The right hand light was fairly steady, the left hand light seemed to get a tad brighter and then darker.   I look at stars fairly frequently.  I checked my astrolabe app to ensure the lights weren't stars or planets.  I'm skeptical of it being a ufo, but I couldn't really come up with a good explanation for it.   I wish I had gotten it on camera, but I figured my camera would ((not work well)) in the dark. ((NUFORC Note:  Source of the report elects to remain anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134086.html",
      "state": "NE",
      "duration": "10 minutes+"
    },
    {
      "_id": "64d005f478aba2ec5a3c783c",
      "summary": "I was outside and look around. The i look up and at first i thought it was a a drone but then I realized it was clear and had redish ye",
      "city": "lincoln",
      "shape": "other",
      "date": "2017-12-14T00:00:00",
      "story": "I was outside and look around.  The i look up and at first i thought it was a a drone but then I realized it was clear and had redish yellow lit circles and it looked kind of like clear jelly . I'm not really sure but it flew and it kind of moved in a way that a drone wouldn't move I just kind of flew over my house and head south",
      "link": "http://www.nuforc.org/webreports/137/S137720.html",
      "state": "NE",
      "duration": "I was outside and look ar"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a07",
      "summary": "Large Bright round orange lights with  Bright white connecting lights in some triangle or pyramid shape that hovered and disappeared",
      "city": "lincoln",
      "shape": "other",
      "date": "2017-11-03T00:00:00",
      "story": "Large Bright round orange lights with  Bright white connecting lights in some triangle or pyramid shape that hovered and disappeared It was a very dark night, we had just turned south on to Highway 14 from X Road and approximately 2-3 miles down the road the driver said \"look at that ufo in the sky\".  I saw numerous (what I think were 5 or 6 at minimum) large bright orange lights with what seemed to be bright LED like what \"long\" connecting lights.  It was a pattern similar to a triangle or pyramid or similar and it was LARGE.   We were all immediately talking at once and everyone saying \"what is that\" etc.  I watched for possibly approximately 60 seconds  as  were ascending a large hill.   I thought and it \"appeared\" as if once we came to the top of the hill I could see it better, but when we crested the hill it was completely gone.  Literally within seconds.  We could see for miles and miles from the top of this hill and there was NO sign of anything in any direction we had just seen.",
      "link": "http://www.nuforc.org/webreports/136/S136969.html",
      "state": "KS",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7af4",
      "summary": "Three lights spinning in circles. kind of looked like the lights of a movie threatre.((NUFORC Note:  Possibly advertising lights?  PD))",
      "city": "lincoln",
      "shape": "light",
      "date": "2017-10-19T00:00:00",
      "story": "three lights spinning in circles.  kind of looked like the lights of a movie theatre, but there was no beams the illumination was coming from above the clouds and they didnt move around at an exact timing like a machine.   Took out my phone to take a video and they stopped.  Over the sky toward Boston MA. Fuzzy oval white lights. ((NUFORC Note:  Possibly advertising lights?  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136709.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7dd3",
      "summary": "Four short spurts across the sky until it hit the horizon.  ((anonymous report))",
      "city": "lincoln",
      "shape": "flash",
      "date": "2018-06-07T00:00:00",
      "story": "Four short spurts across the sky until it hit the horizon. My friends and I were stargazing and suddenly a flash starts to fly across the sky.  It seemed as if it flew in short visible spurts, we saw four, until it flew into the horizon where we couldn’t see any farther.   My friend I looked at each other and we both agreed it could be a UFO. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141743.html",
      "state": "NE",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c81a0",
      "summary": "Stationary, circular, metallic, flat object in sky for over an hour.",
      "city": "lincoln",
      "shape": "circle",
      "date": "2018-01-25T00:00:00",
      "story": "Stationary, circular, metallic, flat object in sky for over an hour. NOTE: I am not certain that the year is even correct for this incident.  I was living in Lincoln Nebraska at the time.  I do recall it was winter and I was headed to the mall so I'm assuming it was before Christmas. The skies in the Midwest during the winter are different than the skies in the PNW.  They are always clear and the sun shines, regardless of the deepness of the snow and ice or how low the freezing temps are. Anyway, I was headed to the mall on a flat and very open stretch of road. The area had not been completely developed yet.  I looked up, I saw something circular and metallic looking in the sky...what I'm assuming to be VERY far up there.  I really have no way to judge its distance.  I followed the bend in the road which made it to where I'd be on the \"side\" of the object...the object had vanished.  Continued following the road which lead to another bend which put me back in \"front\" of the object and there it was.  It appeared to me that it was as thin as a piece of paper to completely vanish when looking at it from the side. I made it to the mall, did shopping and left.  I'm assuming I was there 90 minutes to 2 hours. I took the same path home.  The same round, metallic, flat object was there again.  I'm sure I ended up telling everyone I know the next couple of days and continue to tell people.  I only just found this website this evening or I would have reported it years ago. Truth is I lean more to the notion that it was a portal or wormhole if you will, and with science recently discovering their existence, short appearance and unpredictability, I'm certain that's what it was...but maybe not.",
      "link": "http://www.nuforc.org/webreports/138/S138463.html",
      "state": "NE",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8360",
      "summary": "Daylight, clear blue sky, 7 to 8 white cigar/winged shaped objects at high altitude,observed 3 min circular flying pattern, then disapp",
      "city": "lincoln",
      "shape": "formation",
      "date": "2018-09-27T00:00:00",
      "story": "daylight, clear blue sky, 7 to 8 white cigar/winged shaped objects at high altitude, observed 3 min circular flying pattern, then disappeared.",
      "link": "http://www.nuforc.org/webreports/143/S143137.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d27",
      "summary": "Bright full moon making a ring light in the snow,&I saw a craft w/ blue,red&white lights hovering to the RT of the moon + 2 more Later.",
      "city": "lincoln",
      "shape": "circle",
      "date": "2019-01-24T00:00:00",
      "story": "Bright full moon making a ring light in the snow, & I saw a craft w/ blue, red & white lights hovering to the RT of the moon + 2 more Later. Tonight, around 8:30pm, I had this urge to look out our back sliding glass door, and to my surprise, I saw the full moon and it seemed bigger/closer than usual and extremely bright!  So bright that it not only gave more light into the sky, but it also produced a ring shape light onto the ground and the middle was shadowed.  I told my mom & step dad then returned to the door to admire the strangeness to it.  I glanced up to the right of the moon and that’s when I saw the first craft.  It was very close at first, there was no sound from it, I could see 3 different color lights that appeared to be spinning in a circle, most were white but there was at least 1 blue and 1 red light,  I yelled for my step dad to come see it because it was just hovering in the air.  It didn’t appear to be moving at first and a few minutes later you could see it gradually moving farther away and upward into the sky.  It would also move slightly right or left.  It wasn’t going fast like it had a des! tination to get to but seemed to be scanning the area.  Once it was too far to see all three lights as well as when it was close another aircraft showed up from the right.  This one did have a faint sound and was going quite fast.  It only had a white light, the light would flash once disappear and then flash again when it got some distance away.  It went right in front of the first craft slightly turned flying left under the moon & right above the tree line.  It then stayed in one area but going upwards and downwards until it just disappeared.  A few minutes later i saw the same flashing light craft much farther left, it was going slow at first, but sped up to disappear around the side of the house.  During all of this the other one was still just hovering in the same spot, it would get a little closer and then go back farther/higher again.  It continued to do this, around 10 I had to stop looking to put my son to bed.  I kept checking until 10:30pm or 11 and that’s when it was fin! ally out of sight.  This sighting was the most amazing for me because t his craft didn’t seem to mind that it was seen and it stayed hovering around the same area the longest amount of time I’ve ever seen any kind of craft do..  while the others seemed to make sure it was not in any danger.  Myself, my mom, step dad and 3 year old all got a great look at this amazing sighting & were all amazed by it.  My puppy also broke off his chain around the time this first occurred, we usually hear him barking or running around the house when this happens but he was extremely calm and was drawn to the ring light & would look toward the craft.",
      "link": "http://www.nuforc.org/webreports/144/S144595.html",
      "state": "MI",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c8eef",
      "summary": "Purple/pink disk shape moving around the sky",
      "city": "lincoln",
      "shape": "changing",
      "date": "2018-12-14T00:00:00",
      "story": "Purple/pink disk shape moving around the sky Pink and purple changing light in the sky seeming to change shape.  Formed a near perfect disk shape and a persistant purplish color seeming to dance around.",
      "link": "http://www.nuforc.org/webreports/144/S144013.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9917",
      "summary": "I observed two boomerang shaped objects in the sky, they both had a orange neon glow and dissapeared in the sky after about 15 sec.",
      "city": "lincoln",
      "shape": "other",
      "date": "2019-10-04T00:00:00",
      "story": "I observed two boomerang shaped objects in the sky, they both had a orange neon glow and dissapeared in the sky after about 15 sec. UFO Sighting 9/28/19 2130hrs  Last night as I was walking my dog I was looking to the sky and observed a strange object.  I was looking in a Northeast direction.  There appeared on the horizon a large boomerang shape ascending in the sky. It had a neon orange glow and slowly ascended.  Once it rose into the sky another identical object appeared on the horizon, it was several hundred feet behind the first and was traveling along the same path.  I followed both visually until the first one reached straight overhead when it disappeared.  I continued to follow the second object until it reached the point where the first disappeared.  At the same point in the sky this second object disappeared.  There was no sound at any time and they were traveling at about the same speed as an airliner would.  The image below is not of the object but looks very similar.",
      "link": "http://www.nuforc.org/webreports/149/S149309.html",
      "state": "AL",
      "duration": "15 seconds"
    }
  ]
}