{
  "city": "littlerock",
  "fetch_timestamp": "2025-07-12T14:36:43.656195",
  "record_count": 51,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b450b",
      "summary": "The four of us were stargazing after closing up the bookstore. When from the west we notice a object coming towards us at first we thou",
      "city": "littlerock",
      "shape": "fireball",
      "date": "2006-05-15T00:00:00",
      "story": "The four of us were stargazing after closing up the bookstore. When from the west we notice a object coming towards us at first we thought it was a star but then we realized stars dont move and come down that close it slowed down from a medium speed to really slow it passed directly over us speed up and continued in a northeast direction until it disappeared.",
      "link": "http://www.nuforc.org/webreports/050/S50522.html",
      "state": "AR",
      "duration": "45-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b44b5",
      "summary": "Bright light",
      "city": "littlerock",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Bright light moving North for 1 min or so at relative elivation of 25,000 ft. Upon intercep with comercial aircraft moving Norht East the light disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50075.html",
      "state": "AR",
      "duration": "1-2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b46d1",
      "summary": "Well i was standing in my back yard when i saw the object approach from the south traveling north at a very high rate of speed. The thi",
      "city": "littlerock",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "Well i was standing in my back yard when i saw the object approach from the south traveling north at a very high rate of speed.  The thing passed right in front of an airplane commerical jet liner traveling west. it went into a cloud and i did'nt see it anymore!",
      "link": "http://www.nuforc.org/webreports/050/S50521.html",
      "state": "AR",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b495b",
      "summary": "Flying Giant Red Ball of Light.",
      "city": "littlerock",
      "shape": "light",
      "date": "2019-07-25T00:00:00",
      "story": "Flying Giant Red Ball of Light. Walking home last night from my job in the SOMA district, the moon was big, bright and beautiful.  Zipping back and forth past the moonscape appeared what I believe was a helicopter.  It seemed to be following this gigantic bright red ball of light.   At first sight, I thought it was a planet, like Venus, or even a traffic light.  Oddly enough, the ball of light’s starting position was to the west side of the moon and gradually moved to the east side and then back again.   Maybe there’s an obvious and logical explanation for this phenomenon, but for the life of me, I could not think of one.",
      "link": "http://www.nuforc.org/webreports/147/S147644.html",
      "state": "AR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d46",
      "summary": "Black triangle with red and white lights, silent, slow flying, low to ground.",
      "city": "littlerock",
      "shape": "triangle",
      "date": "2019-06-07T00:00:00",
      "story": "Black triangle with red and white lights, silent, slow flying, low to ground Me and my friend were swimming at night.  My friend looked over at the radio tower across the street.  He saw what he thought was an airplane but then took a closer look and saw what was flying mid-level in the shape of a triangle.  It was silent and had white and red lights.  I looked at it and we started freaking out.  It rose up a little bit and then flew at a semi-slow speed and it dropped a white ball of light.  It was so low that we could see the details and we know it wasn't a plane.  After that it flew right above the trees and disappeared.  Then, we saw it again in the distance and it was flying slow and then 10 seconds or less later it was higher in the sky than an airplane would be.",
      "link": "http://www.nuforc.org/webreports/146/S146580.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b53cd",
      "summary": "blueish green triangular object 0230 little rock ia going north then suddenly south lasted 30+ secs",
      "city": "littlerock",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "blueish green triangular object 0230 little rock ia going north then suddenly south lasted 30+ secs i was driving around 0230 am and was with my daughter.  i deliver paper bundles to carriers in minnesota and iowa as a part time job.  i am a police officer full time in minnesota and an emt/firefighter.  i was heading east away from little rock ia on county road nine when i saw a brittiant triangular shaped bluish green object come out of now where.  my daughter screamed and yelled at me but i had already seen it.  it was heading really fast in a northerly direction and like it hit something it changed direction now going south.  it disapeared over the horizen and that was it, it lasted about 30 secs or so.  the speed was increadible and it changeing directions was awsome and creepy.",
      "link": "http://www.nuforc.org/webreports/062/S62891.html",
      "state": "IA",
      "duration": "35 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ded",
      "summary": "Green lights above West Little Rock.",
      "city": "littlerock",
      "shape": "changing",
      "date": "2007-11-28T00:00:00",
      "story": "Green lights above West Little Rock. On Sunday night, October 14,2007, I was driving home after visiting a friend near Perryville (where I have seen numerous craft before) and was headed south on 430, about to merge onto 630 when I saw a small green light speedily heading towards the ground over what looked like the Walnut Valley area of W. Little Rock. Before disappearing into the trees (or disappearing completely?)the green light broke into approximately 4 pieces. At arms length, this craft or light would have been about as big (or as thick) as a #2 pencil and about 4 inches long. At first siting, it was located approx. 50-75 feet above the ground and when it disappeared was just at the tree-line.",
      "link": "http://www.nuforc.org/webreports/059/S59304.html",
      "state": "AR",
      "duration": "15 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6008",
      "summary": "White object moving with the wind",
      "city": "littlerock",
      "shape": "rectangle",
      "date": "2007-10-08T00:00:00",
      "story": "White object moving with the wind This sighting was on 8/31/07 from near the Pulaski County line in SW Little Rock. The time was 2:24 PM CDT, the sky was unusually clear, and the wind was from the NNE. I had an unobstructed view of the sky. Looking to the NNE, I saw something approaching in the sky, about 20 degrees above the horizon, that I thought was a piece of paper blowing in the wind. It was bright white. I noticed what I thought was a jet and contrail behind it in the far distance when I first saw it, but could not resolve it.  It did not tumble, except once or twice it dimmed as if it might be tumbling. I thought it might be a bird, but it was clearly not acting like a bird, in that it was not dimming and brightening regularly like a bird would do flapping its wings. It seemed to be simply blowing in the wind. Fortunately, I had a camera, and took some pictures of it. The photos do not clear up what it is, however. It moved overhead and I lost it in the sun. I only saw it for a couple of minutes. It appeared to be far up, at least 2000 feet. I also took a photo of a jet with the same camera settings for comparison.",
      "link": "http://www.nuforc.org/webreports/058/S58495.html",
      "state": "AR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b600b",
      "summary": "I saw a bright light in  the evening sky that emitted approximately 6 other smaller lights and they all left at high speed.",
      "city": "littlerock",
      "shape": "circle",
      "date": "2007-10-08T00:00:00",
      "story": "I saw a bright light in  the evening sky that emitted approximately 6 other smaller lights and they all left at high speed. At approximately 7:45 PM (19:45 hrs.) on the afternoon of August 31st, 2007 my wife and I walked out into our back yard.  As we were standing there I looked up into the sky and saw a rather bright glowing object in the sky.  I at first thought it was one of the planets, but realized it was still too early and not yet dark enough to see any stars.  I told my wife I thought it was something reflecting light from the sun but it was stationary and rather large.  I told her I thought maybe it might be the International Space station but I frankly do not know if that is ever visible to the naked eye.  I just sensed it was unusual so I went into the house to retrieve a pair of binoculars. I returned to the backyard and looked up at the object and could see then what looked like red glowing lights around the bright center circular object.  We could also see a jetliner moving through the sky and it too was reflecting some light.   My wife looked at the object through the binoculars also but did not try to adjust the lenses to her eyes and did not see the detail I did.  She said she could only see that it was a bright object.  This is when it got very interesting.  I got the binoculars back from her and as I was looking at object I saw approximately six smaller bright looking circular lights move away from  the brighter object we had first seen.  They moved away slowly from the center object at first and paused in a pattern around it.  They then suddenly took off at high speed and simply disappeared from view.  The center glowing object disappeared also.  As I was telling my wife what I was seeing she looked back only to see the original object was gone and the sky was now empty in the area.  I can’t say these objects were craft but I saw what I just described and have no logical explanation for it.",
      "link": "http://www.nuforc.org/webreports/058/S58508.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a68",
      "summary": "Horizontal row of lights seen from a bridge over the Arkansas river, which changed configuration to a vertical column and disappeared",
      "city": "littlerock",
      "shape": "unknown",
      "date": "2008-03-31T00:00:00",
      "story": "Horizontal row of lights seen from a bridge over the Arkansas river, which changed configuration to a vertical column and disappeared I was driving on I-430 northbound across the bridge over the Arkansas river when I noticed a horizontal group of lights several hundred, perhaps as much as two thousand, feet in the sky above some trees on the right side (relative to the freeway I was driving on) of the northern coast.  All the lights were the same color, a bright white with a tinge of yellow.  They were four or five circular-shaped lights very close together so they almost appeared as one bar of light.  None of the lights blinked or changed color.  I was watching it for a little less than a minute when suddenly all the lights disappeared and a new set appeared in a vertical formation, bisecting the horizontal set of lights if they had remained visible.  The change occurred while I was watching and there was no smooth transition: the horizontal lights simply disappeared as the vertical lights appeared.  The vertical lights were the same color, intensity, and spacing as the horizontal lights, with each light just far enough apart from the next that they did not appear to be a solid bar of light like a fluorescent or neon tube.  Shortly after the vertical lights appeared, within a second or two, the top light quickly became much brighter.  A few seconds later, the vertical lights disappeared leaving only blackness.  The vertical lights were only visible for about five seconds before disappearing.  The entire time the lights were visible, just over a minute, they were completely stationary.  Had the lights been on at the same time, they would have resembled a cross (+).  There's no way the lights could have been attached to a radio tower or any other antenna.  I've made the same commute from Little Rock to Jacksonville almost every night for several years and am very familiar with all stationary land beacons.  Partially due to my familiarity with the drive and the fact that the bridge across the river is completely straight, I could devote a lot of attention to the lights.  It was too dark to make out a shape of whatever the lights were attached to.  Unfortunately, the night was too black and the lights too bright for me to make out any kind of shape the lights may have been attached to.  I never heard any sounds from the lights as I was driving on the freeway around 65 Mph in a cheap, poorly sealed car.  Because of this, it was impossible for me to conclude if the lights made any sound at all.  Note that for number of craft seen, I've selected 1-10: as few as one if the lights were all connected to one craft, and as many as 10 if each light was attached to its own craft.  I remain unsure of if there were four or five lights comprising the horizontal row and vertical column as I could barely make out the shape of each light.  However, I'm positive one of the numbers is correct.",
      "link": "http://www.nuforc.org/webreports/062/S62207.html",
      "state": "AR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ffa",
      "summary": "It came out of the east traveling north the object was bright orange but had some white light and the craft seemed to pulsate.",
      "city": "littlerock",
      "shape": "light",
      "date": "2006-07-16T00:00:00",
      "story": "It came out of the east traveling north the object was bright orange but had some white light and the craft seemed to pulsate.",
      "link": "http://www.nuforc.org/webreports/050/S50681.html",
      "state": "AR",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b762b",
      "summary": "HTRUFOR's spotted everywhere.  ((NUFORC Note:  We, too, wish that the quality of many of the reports we receive were higher.  PD))",
      "city": "littlerock",
      "shape": "unknown",
      "date": "2006-12-07T00:00:00",
      "story": "HTRUFOR's spotted everywhere I keep seeing HTRUFOR's on your site (Hard To Read UFO Reports). I am amazed at the number of morons and idiots that post stuff here that DO EVERYTHING IN CAPITALS.  I get a headache trying to read this nonsense.  Do all of us a favor... stop posting this crap and maybe these morons will get the message. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  We are grateful for his comments.  PD)) ((NUFORC Note:  We, too, wish that the quality of many of the reports we receive were higher.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53330.html",
      "state": "AR",
      "duration": "Too Long"
    },
    {
      "_id": "64d005f478aba2ec5a3b7945",
      "summary": "The cover up is over these were ships from another galaxie!!!",
      "city": "littlerock",
      "shape": "circle",
      "date": "2007-03-08T00:00:00",
      "story": "The cover up is over these were ships from another galaxie!!! at about 14:00 hours i witnessed first one object come from behind a cloud and it had a white tail one it while standing in the yard this object traveled west having a white tail it went along for awhile then dissappeared. As i continued trying to see where it went the object i saw came from thw est raveling southeast and passed overhead it was circular or shaped like a crown and was changing colors from silver to gold it went into a cloud and came back from the south traveling north to which it slowed down and hovered over the houses directly behind my house at which time aother came out of the north travelin south to which they just hovered above the houses a bit above tree top level then the crafts crossed each other in the skies as they hovered and then took off out of sight.",
      "link": "http://www.nuforc.org/webreports/055/S55506.html",
      "state": "AR",
      "duration": "5:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b18",
      "summary": "Well at 16:00 hours i came out of the house looking up at an  airplane spreading chem trails as i watched this airplane that came out o",
      "city": "littlerock",
      "shape": "cigar",
      "date": "2007-03-08T00:00:00",
      "story": "Well at 16:00 hours i came out of the house looking up at an  airplane spreading chem trails as i watched this airplane that came out of the west traveling east i noticed slow moving cigar shaped craft traveling really slow over city this object was coming out of the north traveling southeast.  The airplane which i saw pulled up and travel above it.  This craft continued on for awhile still moving slow at this point my ssiter came out of the house and i showed the object to her as well....",
      "link": "http://www.nuforc.org/webreports/055/S55505.html",
      "state": "AR",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ae5",
      "summary": "The first object was shaped like an oval and appeared coming out the southwest traveling in an eastern direction this object appeared t",
      "city": "littlerock",
      "shape": "oval",
      "date": "2006-10-30T00:00:00",
      "story": "The first object was shaped like an oval and appeared coming out the southwest traveling in an eastern direction this object appeared to the right of the moon it was metallic in appearence.  The second object appeared out of the east traveling west it was oval in shape metallic looking also, i noticed several airplanes around at the time and all of them were steering out of the direction of these crafts or whatever these objects were.",
      "link": "http://www.nuforc.org/webreports/052/S52886.html",
      "state": "AR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8041",
      "summary": "Non noise, no reflection, cylindar object",
      "city": "littlerock",
      "shape": "cylinder",
      "date": "",
      "story": "Non noise, no reflection, cylindar object Was practicing running at football field at Henderson Junior High. observed over Rock Creek an object about 1000 feet above ground slowly taking shape. It was not fling into eyesight but like it was materalizing. There was no noise or lights upon this object and it did not reflect sunlight. there as three cyliner tubes about 400 feet each joined by same but smaller in diameter. There were no lights, window type opening or sound from object. I observed for 3 minutes and then ran home to have my daddy bring 8 MM camera to captuer object on film. it was about 10 minutes by the time we both arrived to film. Object was gone. There were no reported sightings around neighborhood as well as Little Rock Airforce base said there were no object seen on radar.",
      "link": "http://www.nuforc.org/webreports/066/S66377.html",
      "state": "AR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bad",
      "summary": "a see through triangle that dissapeared into thin air.",
      "city": "littlerock",
      "shape": "triangle",
      "date": "2010-02-14T00:00:00",
      "story": "a see through triangle that dissapeared into thin air. it was around 630am me and my mother were on my way to skool as for i had armed drill practice in the morning. we were driving on an open road ahead of us in the sky about 2-3 miles away we saw a light we thought of it as a plain or helicopter but then it stopped out of nowhere. im guessing it turned sideways becuase we saw the tip of it as a very bright rectangle it was completly white. behind it it left a trail of that was like a tringle but i was able to se throught the conected triangle trail. the triangle was like a see throw jello as it was connected to the rectangle small part of the ship but still see through we kept looking at it. i tried to record it on my phone but it was to far away to show up on my video lens. it was easily rising 1000ft up and down and seemed like gravity was no problem for this device. as we aproached a full 130 seconds of the viewing me and my mom both witnissed it just dissapear into thin air. i noticed it didnt fly away bec! uase it was like a ghost going invisible i slowly saw it dissapear. the only explanation i might have is that edwards afb that is like 10 miles from my city has struck it gold in technology. but i truly believe that it wasnt from this planet becuase we do not have the technology to make an object just dissapear ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74277.html",
      "state": "CA",
      "duration": "2min."
    },
    {
      "_id": "64d005f478aba2ec5a3b9701",
      "summary": "My son saw a craft with 8 white lights under it as it flew right over our car about 150 feet  above  us .",
      "city": "littlerock",
      "shape": "disk",
      "date": "2009-05-12T00:00:00",
      "story": "My son saw a craft with 8 white lights under it as it flew right over our car about 150 feet  above  us . While driving in my car with my wife and son on interstate 40 going east about 1 hour or so before Memphis, Tennessee, at about 12:30 am in the morning, April 10th, 1997.   My son saw a large round craft about the diameter of 100-150 feet with 8 round evenly spaced white lights under the craft that were about 2 to 3 feet in diameter each.  This craft was flying from the north to south direction and only just above the tree tops about 150 to 200 feet altitude. This craft also flew over our car and stay with us for a couple of seconds as we were traveling east.   My son also noticed that when this craft flew over us, it blocked out the stars above it, indicating it was a solid mass.  And it made no sound of any kind.  Its speed was about 50 to 60 M.P.H.   It continued to fly in the southern direction over the tree tops until my son could not see it any more because the trees were in the way.   We are all ok and the craft did not harm us. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69691.html",
      "state": "AR",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e4a",
      "summary": "Large/Slow Moving/Quiet /Low AltitudeTriangular Aircraft - Little Rock",
      "city": "littlerock",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "Large/Slow Moving/Quiet /Low AltitudeTriangular Aircraft - Little Rock Large slow moving triangular shaped craft. first appeared out of western sky at approximately 2300. moved slowly in a southeastern direction with an extremely bright white light (venus intensity on horizon growing progressively larger and brighter as it approached). altitude about 1000 feet. silent running until directly overhead. three tail lights in triangle pattern (constant no strobing). engine sound was military, low pitch turbine, but very faint. Seen on a cloudless night with excellent moonlight. thought at first was an approaching airline with landing lights...no way...moving way too slow/too low/too quiet wingspan ~100-150 feet. almost looked as though it were surveying. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66157.html",
      "state": "AR",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fbe",
      "summary": "unknown craft in Ak as seen on weather camera",
      "city": "littlerock",
      "shape": "triangle",
      "date": "2008-07-05T00:00:00",
      "story": "unknown craft in Ak as seen on weather camera I am somewhat a weatherbuff so I was on http://weather.weatherbug.com checking out 30 day elapsed video and caught sight of something I cannot explian, a triangular shape came into view at the top of the screen. Cannot identify as any known aircraft.  Go onto weatherbug.com view camera for Little rock AK date is 5-28-2008 Eyes to the sky people",
      "link": "http://www.nuforc.org/webreports/064/S64108.html",
      "state": "AR",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bab80",
      "summary": "A ball of light moving very quickly.",
      "city": "littlerock",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "A ball of light moving very quickly. I’m not even sure if it was a UFO.   I was looking out at the western sky and I thought I saw a shooting star, because it was going so fast.  Then the object suddenly stopped and spun around in a circle about 3 times and quickly flew off in the direction that it came.   This object seemed fairly close.  I would say about 500-1000 ft. easy.  It seemed to be getting bigger as it circled around.   This is about as much information that I can provide.  The object was moving very fast.  I could hardly keep up with its movements.  It took off toward the northern sky section.",
      "link": "http://www.nuforc.org/webreports/078/S78049.html",
      "state": "AR",
      "duration": "about 5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bae13",
      "summary": "Beware.",
      "city": "littlerock",
      "shape": "egg",
      "date": "2011-01-05T00:00:00",
      "story": "Beware. It was about eleven at night and me and my friend were going home from our office. we were walking down the street about to grab a bite to eat when we looked up and SAW IT. it was a egg shapped figure in the sky. ther were lights that showed no reflection in the sky. it came from the east to the west and it seemed to stop in the dead center of the sky. when we went to get out our cellphones to take pictures the egg shaped aircraft zoomed away at lightning speed and we sat there dumbfounded.  beware this could happen to you.",
      "link": "http://www.nuforc.org/webreports/079/S79023.html",
      "state": "AR",
      "duration": "5-10"
    },
    {
      "_id": "64d005f478aba2ec5a3bafb0",
      "summary": "saw a bright light and looked up and noticed a cyliner shaped or retegular object flying. The light as very bright and appeared to lumi",
      "city": "littlerock",
      "shape": "rectangle",
      "date": "2011-01-05T00:00:00",
      "story": "saw a bright light and looked up and noticed a cyliner shaped or retegular object flying. The light as very bright and appeared to luminate around the craft with 2 on one side and 2 on the other. It had no sound. Have never seen anything like that bedfore. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79122.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb302",
      "summary": "Round black silent object",
      "city": "littlerock",
      "shape": "circle",
      "date": "2011-01-31T00:00:00",
      "story": "Round black silent object Stuck on I-30 west bound; highway shut down at mile marker 124.   People stuck on interstate due to snow and ice with multiple accidents.   I was facing directly west sitting in the front seat of my vehicle with my husband.   Snow had stopped and the night was brighter with the lights reflecting between the low cloud cover and the snow on the ground.  There is an Indian springs business sign on the opposite side of the interstate that is facing towards the westbound traffic.    All the sudden our eyes caught a circular object that appeared to be black in the night with no lights, no noise, and no signs of engine; gently but steadily move across the interstate from north to south right above the indian springs sign.  Approx 40 feet above the ground.  Object slightly hovered over the sign and then disappeared into the trees.  Approx. 30 seconds later, object steadily but quickly appeared above the trees and went out of sight towards the southwest.  Not sure what it w! as.  Temperature was at 28 degrees.  It didn't act like a balloon.  Not sure what it was that is why I am reporting it.  If someone else sees anything else like this hopefully they can add more information. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79614.html",
      "state": "AR",
      "duration": "2 or 3 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bb376",
      "summary": "unexplained lights",
      "city": "littlerock",
      "shape": "unknown",
      "date": "2011-03-10T00:00:00",
      "story": "unexplained lights looking to the west from Littlerock we saw what looked like a red/orange mylar baloon floating about 6 feet off the ground in the distance.  The object became brighter and slowley gained elevation.  The object began to emmit a long orange tail but the actual craft was unseen.  The object continued to gain elevation traveling to the east eventually leaving a cont trail.  At a very slow speed the the object turned south and disappeared only to re appear a short time later still emmiting a long orange trail and second cont trail. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80319.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd85",
      "summary": "two huge amber, orange orbs flew over my house.",
      "city": "littlerock",
      "shape": "sphere",
      "date": "2011-12-12T00:00:00",
      "story": "two huge amber, orange orbs flew over my house. Ever night  at 8:00  I go out in my back to take my dog out.. I am a stargazier, so I looked up, as I do every night. I saw to the southwest of me, two huge glowing amber, orange orbs. The orbs were very low, not much higher than trees.  I was so shocked. The orbs were the same size, the same width apart.  They were flying together like the were on the back of a craft. I could not see a craft.  The orbs went behind a tree and I ran to the end of my yard, and watched the orbs gain speed and height, until they were out if sight.  This sighting could not be mistaken for any manmade craft that we have. Their was no sound at all.  The orbs did not shine any light on the trees.  One other weird thing.  Every dog in the neighborhood was going crazy.  My dog was running around in circles, completely out of control. Later that night I found out that other people reported seeing the orbs also.  Their were several planes and hhelocopers.  Chasing after the orbs.",
      "link": "http://www.nuforc.org/webreports/085/S85558.html",
      "state": "AR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bce39",
      "summary": "We saw a star that was moving in many different directions for a long period of time.",
      "city": "littlerock",
      "shape": "unknown",
      "date": "2011-06-03T00:00:00",
      "story": "We saw a star that was moving in many different directions for a long period of time. On June 1rst at about 10 pm I was outside smoking when I looked up at the stars and noticed that one was moving.  It was part of the constilation \"the big dipper.\"  The very tail end of it.   I called out several friends to see it and they all saw it as well.  One of my friends called your agency and was told to send in a report through this website. The object was moving in many different directions.  It would all of a sudden take off and go very quickly in one direction and then all of a sudden stop.  It also move in zig zag motions, in circles and in figure 8 motions.   We watched it for a good long while.  It was still moving when we came in. ((NUFORC Note:  We spoke via telephone with this witness, and he sounded quite credible to us.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81623.html",
      "state": "AR",
      "duration": "still accuring after abou"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfcf",
      "summary": "Triangular arrangements of lights appearing to begin to land on freeway, miltary-ish cars mobilze around it",
      "city": "littlerock",
      "shape": "triangle",
      "date": "2012-08-05T00:00:00",
      "story": "Triangular arrangements of lights appearing to begin to land on freeway, miltary-ish cars mobilze around it First of all, the documentary that is out there about Belgium sightings in 1991 - the depictions on that show are exactly what I saw. I was driving home from work from Little Rock to conway in normal evening traffic.  It was dark.  I was driving north on a 4 lane hwy with a large grass median in between and up ahead of me there appeared to be a 747 (my impression) coming towards me about to land on the freeway.  What I saw was a triangular arrangement of lights covering the expanse of the freeway slowly floating down towards the road, about half a mile ahead.  My impression was this was a landing aircraft with its nose in the air, coming directly towards me.  As it got closer it moved off to the side of the road and as I crossed the Arkansas river, it had stopped over the dam to my right and was just sitting there.  All I could see was three bright lights that weren't really illuminating anything.  About this time, all these cars around me lit up with these strange red lights in their dashboards - they didn't go round and round like a normal emergency light, they went side to side, were all red, and were i! n MANY cars ( don't know an exact number ) coming the other way and even driving right next to me, in front of me and behind me.  They all sped off the freeway on the dam exit towards where this thing was floating, probably ten cars in total.  Before the red lights turned on, on these cars, I had slowed down and rolled the windows down and couldn't hear a thing coming from whatever this thing was. I never heard a word about it from anyone, not in the news or television.  Years later I was watching a Discover channel UFO special about events in Belgium in 1989-1991 and there it was, exactly what I saw.  Granted, I never saw a distinct outline but if they said all this happened the night I saw what I saw, I would say, &quot;I saw that too&quot;.",
      "link": "http://www.nuforc.org/webreports/091/S91295.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc79",
      "summary": "Bright green wing with two 'engines' headed eastward at a very fast slip in a 20 degrees angle downward",
      "city": "littlerock",
      "shape": "other",
      "date": "2012-05-13T00:00:00",
      "story": "bright green wing with two 'engines' headed eastward at a very fast slip in a 20 degrees angle downward I was looking north; saw a glowing green object shaped like a wing with two ‘engines’.  The engines were brighter than the wing.  It was heading in a downward slant toward the east at a rapid clip at about 20 degrees; this all happened at 10:45 pm.  No trail and no sound.",
      "link": "http://www.nuforc.org/webreports/088/S88132.html",
      "state": "CA",
      "duration": "3 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3be0b7",
      "summary": "3 white blinking lights in triangle formation the size of multipe football fields.",
      "city": "littlerock",
      "shape": "triangle",
      "date": "2012-11-04T00:00:00",
      "story": "3 white blinking lights in triangle formation the size of multipe football fields. Driving West on 630 threw Little Rock,  Ar, we observed 3 white lights flashing to the north. It was moving parallel with us. It looked to be hundreds of yards long, a few thousand feet up in the air.  We were traveling at 70 mph, and the lights stayed in formation as it moved to the west.  At the location where IS 630 ends at IS 430 the object was no longer to the north, but due west in front of us.  It made no noise, and seemed to be a triangle that covered a large area in the sky.",
      "link": "http://www.nuforc.org/webreports/094/S94010.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf429",
      "summary": "Floating orange dianganol rows of lights",
      "city": "littlerock",
      "shape": "oval",
      "date": "2013-05-15T00:00:00",
      "story": "Floating orange dianganol rows of lights There where a series of lights crossing the sky in diagonal lines, orange in color and oval/circular in shape.  it moved very slowly and the lines kept showing up going across (trees where blocking a full view) Looked like this:  .                         . .                  .                         . .                 .                          .",
      "link": "http://www.nuforc.org/webreports/097/S97184.html",
      "state": "AR",
      "duration": "NOt sure"
    },
    {
      "_id": "64d005f478aba2ec5a3bf415",
      "summary": "THE CRAFT WAS A SAUCER SHAPE WITH THE OUTER CIRCLE BEING LIT WITH A PROMINENT LIGHTING.   THERE WAS A WHISTLE NOISE WHICH CAUGHT MY REA",
      "city": "littlerock",
      "shape": "disk",
      "date": "2013-07-03T00:00:00",
      "story": "THE CRAFT WAS A SAUCER SHAPE WITH THE OUTER CIRCLE BEING LIT WITH A PROMINENT LIGHTING.   THERE WAS A WHISTLE NOISE WHICH CAUGHT MY REACTION TO LOOK UP JUST IN TIME TO SEE THE SWIFT LITE MAKE AN S SWOOP.",
      "link": "http://www.nuforc.org/webreports/098/S98509.html",
      "state": "AR",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c036c",
      "summary": "Cigar shaped light bulbs in the sky.",
      "city": "littlerock",
      "shape": "cigar",
      "date": "2012-12-20T00:00:00",
      "story": "Cigar shaped light bulbs in the sky My son and I were in the backyard starting up the grill when I noticed 2 cigar shaped items moving from East to West.  They did not appear to have wings and both were really close to each other.   Also both bodies on the crafts were lit up like a light bulb (I don't mean some of the body but the whole body).  They both looked like two cigar shaped light bulbs flying threw the sky. I'm not sure what they were but I've never seen anything like them.   They were extremely visible from my house yet I heard no noise.",
      "link": "http://www.nuforc.org/webreports/094/S94949.html",
      "state": "AR",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c089c",
      "summary": "Large white cigar shaped ufo.",
      "city": "littlerock",
      "shape": "cigar",
      "date": "2014-01-10T00:00:00",
      "story": "Large white cigar shaped ufo. We were on the highway going through littlerock to memphis  When i saw it, it was hovering, and then slowly flew towards the ground .. I lost site of it after that. It was very huge and amazing..",
      "link": "http://www.nuforc.org/webreports/105/S105644.html",
      "state": "AR",
      "duration": "3:00 min."
    },
    {
      "_id": "64d005f478aba2ec5a3c0eb2",
      "summary": "Pulsating light streaks across the night sky.",
      "city": "littlerock",
      "shape": "circle",
      "date": "2014-02-21T00:00:00",
      "story": "Pulsating light streaks across the night sky. From southwest going northeast high rate ofspeed pulsating light to become completely black and once again to pulsate as a brillant light.   Four times as rasing across the sky then vanishing out of site without a sound.",
      "link": "http://www.nuforc.org/webreports/107/S107214.html",
      "state": "",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1613",
      "summary": "Two amber lights moving in sync but too far apart to be connected. no sound.",
      "city": "littlerock",
      "shape": "",
      "date": "2013-11-11T00:00:00",
      "story": "Two amber lights moving in sync but too far apart to be connected. no sound. Saw two amber lights moving through sky, too far apart to be connected to any known aircraft, but moving in perfect sync.  no sounds.  Saw them move across sky and then disappear into clouds.",
      "link": "http://www.nuforc.org/webreports/104/S104295.html",
      "state": "AR",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c193a",
      "summary": "Huge moon shaped object appears during or before and during power outage.",
      "city": "littlerock",
      "shape": "circle",
      "date": "2014-07-11T00:00:00",
      "story": "Huge moon shaped object appears during or before and during power outage On July 5th, the power went out, and I just happened to look out at the sky.  There were no lights as far as I could see, no street lights either.   Saw what I thought was the moon but it seemed 3 to four times larger than normal and had a much more yellow tint.  Thought it was odd. Went out 20 or so minutes later and what I thought had been the moon had changed position drastically and in my perspective was now behind the tree line.  This really confused me.   About 30 minutes later I looked for the object again and it was completely gone.  The object looked like a full moon and upon checking i found it was only a quarter moon on the 5th and i have never seen the moon so large or to change place in the sky so quickly and drastically and then disappear.   I checked several more times that night and it never re appeared. I also wonder if whatever it was caused the power outage for there were no storms or even any rain that night here.",
      "link": "http://www.nuforc.org/webreports/111/S111396.html",
      "state": "AR",
      "duration": "30-60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c262b",
      "summary": "NON-REFLECTING, SOUNDLESS, MOTIONLESS, AND TOTALLY NON-MOVING CYLINDRICAL CRAFT.",
      "city": "littlerock",
      "shape": "cylinder",
      "date": "2014-12-05T00:00:00",
      "story": "NON-REFLECTING, SOUNDLESS, MOTIONLESS, AND TOTALLY NON-MOVING CYLINDRICAL CRAFT. THE CRAFT WAS OBSERVED WHILE I WAS PRACTICING MY 440 YARD RUNNING PRACTICES AT HENDERSON JUNIOR HIGH.   I OBSERVED THE CRAFT SLOWLY APPEAR AS IF IT WAS INVISIBLE AND SLOWLY MATERIALIZED OVER A PERIOD OF ABOUT 2 MINUTES.  THERE WAS NO MOVEMENT OF THE CRAFT AND THE HEIGHT ABOVE THE GROUND WAS ABOUT 1000 FEET.   THE CRAFT WAS CYLINDER SHAPED AND WAS ABOUT 50 FEET IN DIAMETER AND ABOUT 100 YARDS LONG.  THERE WERE NO PORT LIKE WINDOWS OR DOORS AND NO SOUND FROM THE OBJECT.  IT NEVER MOVED ANY DIRECTION AND BELOW THE CRAFT WAS A SMALL STREAM AND WOODED AREA AND EVEN THE BIRD CONTINUED TO CHIRP AWAY AS IF NOTHING WAS HAPPENING TO DISTURB THEM.   NO NOISE, NO LIGHTS, NO REFLECTION OF SUNLIGHT OFF THE CRAFT WAS OBSERVED AT ALL.  IT HAD A DULL METALLIC DULL GREY COLOR.  THERE WERE NO LIGHTS, SOUND OR MOVEMENT AT ANY TIME.   I CONTINUED TO WATCH THE CRAFT AND OBSERVED EVEN THE TRAFFIC DRIVING BY ON THE ROADWAY NEVER SLOWED OR STOPPED TO VIEW WHAT I WAS SEEING.  SO, NO ONE TO MY KNOWLEDGE EVER SEEN WHAT I WAS SEEING.  THERE IS NO ONE ELSE THAT SEEN WHAT I SEEN.   I REALLY WOULD LIKE TO KNOW BY EMAIL WHAT OR HOW MANY HAVE SEEN WHAT I HAVE SEEN.  I KNOW THAT WHAT I SEEN WAS REAL AS I AM NOT PRONE TO VISUAL PROBLEMS AND WAS ONLY 13 YEARS OLD WHEN I SEEN THIS.  I KNOW WHAT I SEEN WAS REAL AND NOT SOME MIRAGE OR SUCH.   I HAVE WALKED A LOT IN THE DESERT AFTER GETTING OUT OF THE MARINE CORPS TO GET MY MIND SORT OF RELAXED AFTER DISCHARGE FROM THE SERVICES.  I HAVE SEEN A MIRAGE IN SUCH A PLACE AND UNDERSTAND THE WAY LIGHT AND HEAT WAVES PLAY UPON VISION.  I HAVE SEEN A MIRAGE ONCE AS WELL.  I KNOW THAT THIS WAS A CRAFT. I JUST WOULD LIKE TO KNOW HOW MANY PEOPLE HAVE SEEN SUCH BEFORE.  I DO NOT CONSIDER ANY UFO THAT WAS TO VISIT THIS EARTH TO NEED ANTI-COLLISION LIGHTS, AND IF SUCH WAS TO OCCUR FOR REAL I REALLY DON'T THINK SUCH WOULD HAVE SOUND OR SMOKE LIKE OUR ROCKETS PRODUCE AS DISTANCE TO TRAVEL SPACE WOULD REQUIRE A SPECIAL ENGINE AND NOT CHEMICALS AS WE USE.   THANK YOU FOR! ANY INFORMATION YOU MAY SEND BY EMAIL.",
      "link": "http://www.nuforc.org/webreports/115/S115701.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c282d",
      "summary": "White circle reddish/orange outline with falling lights downwards to earth",
      "city": "littlerock",
      "shape": "circle",
      "date": "2014-10-10T00:00:00",
      "story": "white circle reddish/orange outline with falling lights downwards to earth It was a circle shape with the colors of white and orange/reddish outlining it. There was showering lights falling downwards to the earth those falling lights were white it looked as if multiple white fireworks shooting it the sky but coming down from the object not going up  it made long streaking lights falling from it and fading away.  By the time my husband saw it he saw the object and then it made an erupt noise and disappeared. I've never been real sure if I believe in alien ufo's but that may be because I've never seen anything that could be one.  This was the first time I've even witnessed anything like this and I can not explain it and it was unusal.  I believe it was a ufo",
      "link": "http://www.nuforc.org/webreports/114/S114302.html",
      "state": "",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e8e",
      "summary": "A low-flying UFO spotted 1 mile north of Little Rock and heading SE towards Sibley.  Circular in shape with many flashing white lights.",
      "city": "littlerock",
      "shape": "circle",
      "date": "2015-06-15T00:00:00",
      "story": "A low-flying UFO spotted one mile north of Little Rock, and heading southeast towards Sibley.   Circular in shape with many flashing white lights.   Was flying low to the ground and moving with great speed.",
      "link": "http://www.nuforc.org/webreports/119/S119363.html",
      "state": "IA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c467a",
      "summary": "Looked up and a bright light was shinning for 10 seconds, when it stopped I was able to track it across the sky like a satellite. Small",
      "city": "littlerock",
      "shape": "other",
      "date": "2015-11-12T00:00:00",
      "story": "Looked up and a bright light was shinning for 10 seconds, when it stopped I was able to track it across the sky like a satellite.  Small dot similar to ISS.  I looked up to see if ISS was passing that night but it passed on the 6th and 8th but not the 7th.",
      "link": "http://www.nuforc.org/webreports/123/S123792.html",
      "state": "AR",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6455",
      "summary": "Large white spiraling light traveling at incredible speed.",
      "city": "littlerock",
      "shape": "unknown",
      "date": "2016-08-25T00:00:00",
      "story": "Large white spiraling light traveling at incredible speed I was driving west on Lindsey Rd. at 1:01 A.M. after getting off of work.  In the curve of the road, right around the FedEx facility, I saw something out my driver's side window, at about 45 degrees south/southwest.  It was a fairly large, super-intense white light, circular in shape, moving at an incredible speed, coming from the northwest and moving southeast.  When people count by saying \"1 Mississippi\", this would have been more like \"1 M\" in duration.  The best way I can describe the object is, it looked like a rotating, flat spiral of white light.  In the dimmer arms of the spiral I may have detected a very faint yellow.  Picture the rotating spiral of Hitchcock's 'Vertigo'.  The location I saw this object in is immediately south of Little Rock Airport  (Clinton Airport).  I checked the flight schedules when I got home, and while departures were not listed, the last arrival was at least a couple of hours before my sighting.  This is not an airport that has much late night airplane activity.  I also looked up types of commercial aircraft lights when I got home, but didn't see anything similar to what I had seen.  I do know that Little Rock Air Force Base does practice maneuvers using Little Rock Airport runways and airspace, but they are a C-130 base.  The object I saw was at least as fast as a jet fighter, if not faster.  Obviously LRAFB could have jets from other places on occasion, but I don't know.  If this object came from the airport, it seems it would have been departing based on its direction of travel. I don't rule out any possibility.  I just would really like to know what I saw.  I have never in my life experienced or seen anything like that.  I have traveled this road for the past eight years. An investigator may contact me at my subitted email address.",
      "link": "http://www.nuforc.org/webreports/129/S129422.html",
      "state": "AR",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ded",
      "summary": "Never have seen anything like it before...or since.",
      "city": "littlerock",
      "shape": "circle",
      "date": "2017-07-07T00:00:00",
      "story": "Never have seen anything like it before...or since. My dad and I were on our way home from watching a movie in Little Rock.  It was dark, and the stars were bright.  We were driving on Hwy 10 (Cantrell Rd) and were coming up on our turn.  And, then we saw it. It had a circular shape, and there were three lights on the bottom that pointed down (the primary colors) moving in some sort of a pattern.  Around the edge of it there were lights that moved counter to the pattern and direction of the big lights.  All it did was hover above the house at the intersection of Hwy 10 and Ferndale Cutoff Rd.  It continued to hover for about 5 seconds as we slowed to a stop. Our stopping must have startled it, as it then stopped the colored lights pattern and very quickly took off. It took off and was going faster than my dad's 1978 Cadillac Coup Deville could muster.  He told me to buckle my seat belt as he buried the needle until it was no longer visible. And then it stopped.  It stopped so amazingly accurate and sudden that we couldn't do anything but shoot past where it had stopped and was hovering.  We turned around and were now headed back towards Little Rock.  It flew and flew and we all but lost sight of it until when it changed its path and flew upwards at a swooping 45° angle and was gone. We drove home in silence.  That was 30 years ago.  My dad and I have talked about that experience one time only since.  By the way...that house had been demolished or something as it's now longer there. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134772.html",
      "state": "AR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7617",
      "summary": "Saw large dark triangular object near ground in front and above me 3 minutes, 3 lights underneath, hovered, no sound.",
      "city": "littlerock",
      "shape": "triangle",
      "date": "2018-01-12T00:00:00",
      "story": "Saw large dark triangular object near ground in front and above me 3 minutes, 3 lights underneath, hovered, no sound. I was in my yard and it was dark, I saw something in back of tree line moving slowing, coming from the North.  It came to a stop in a clear area close to where I was, had 3 large lights underneath, I believe.  It hovered approximately 3 minutes and then made a slight angle and went a different direction.  It seemed stopped at the edge of our property.  Very strange.  It was not a 'perfect' triangle, the back edge of the triangle seemed to have some indentations (it was hard to see as it was dark outside).  It then flew East more quickly down the edge of our property and turned to right (South).  I watched it behind tall pine and oak trees in our 20 acres of land.  It then seemed to turn East and I could see no longer.  It did not make any noise.   I have never seen anything like it in my life.  It seemed quite large and near the top of pine trees on our property. I don't think it was military vehicle. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138177.html",
      "state": "AR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c4c",
      "summary": "Fireball type flying at am incline.",
      "city": "littlerock",
      "shape": "fireball",
      "date": "2017-10-19T00:00:00",
      "story": "Fireball type flying at am incline I was traveling southbound on Interstate 530, near Exit 3 when I saw three unknown objects traveling from East to West.  They looked like giant sparklers and they had an orange color.   They were really close to each other.  I thought they were meteors falling, but they were at a slight incline.  Two of the three disappeared.  Just a few seconds later I lost sight, due to a tree line.",
      "link": "http://www.nuforc.org/webreports/136/S136839.html",
      "state": "AR",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e4e",
      "summary": "cone-shaped craft fell silently to the ground 5/28/2018",
      "city": "littlerock",
      "shape": "cone",
      "date": "2018-05-31T00:00:00",
      "story": "cone-shaped craft fell silently to the ground 5/28/2018 Little Rock, AR  My friends and I have been watching this cone or triangular shaped craft for over a month.  For quite a while it seemed to be an unfamiliar constellation...very high in the sky. Over the days it has become more and more visible. Tonight 5/28/2018, at approx 8:25 it was very low in the sky when it suddenly began to drop straight to the ground without making a sound. I happened to be looking at it when this took place. I was completely speechless and unable to call out to my friends. When it was higher it seemed more Christmas tree shaped wih several big lights or craft at each corner and in between points. Tonight as it fell the shape was completely visible. Cone shaped top then straight sides with numerous lights or craft. There was complete silence as it fell. It seemed to be extremely close to us. As it fell past the trees I could no longer see it. I had no was of getting to it so I immediately googled for similar sightings. I expect to hear something on the news tonight. I can't describe my feelings. Whatever it was has been one of the most amazing, overwhelming things that I've witnessed in my life. I hope to see more recent sightings here. the sightings in Mena AR and Fort Smith sound very similar. CC N",
      "link": "http://www.nuforc.org/webreports/141/S141663.html",
      "state": "AR",
      "duration": "approx 20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8088",
      "summary": "((HOAX))  Time dilation one hour lost.  ((NUFORC Note:  A reference to Daylight Savings Time?  PD))((anonymous report))",
      "city": "littlerock",
      "shape": "other",
      "date": "2018-03-23T00:00:00",
      "story": "Time dilation one hour lost. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139136.html",
      "state": "AR",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c861f",
      "summary": "Alien ship moving at a high rate of speed but very silent across Little Rock Arkansas",
      "city": "littlerock",
      "shape": "cigar",
      "date": "2018-08-31T00:00:00",
      "story": "Alien ship moving at a high rate of speed but very silent across Little Rock Arkansas I was standing outside talking with a friend in the neighborhood an I just so happen to look up at the sky an I seen a cigar white object flying silently at a High rate of speed about 10,000 feet in the air for about 10 or 15 seconds an then it just vanished.  So I ask my friend if he seen what I saw an he said yea I seen it to so I know it was real. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142927.html",
      "state": "AR",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c86ea",
      "summary": "Large oval/diamond shaped object spotted moving at high speed above lake surface. No sound or wake produced. ((anonymous report))",
      "city": "littlerock",
      "shape": "other",
      "date": "2018-08-17T00:00:00",
      "story": "Large oval/diamond shaped object spotted moving at high speed above lake surface.  No sound or wake produced.   Object observed switching directions from east to west until it disappeared from sight behind a peninsula's treeline. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142730.html",
      "state": "AR",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f88",
      "summary": "Strange lights in the sky shooting down everyone should of seen this on the freeway.  ((anonymous report))",
      "city": "littlerock",
      "shape": "fireball",
      "date": "2018-11-30T00:00:00",
      "story": "Strange lights in the sky shooting down everyone should of seen this on the freeway ..",
      "link": "http://www.nuforc.org/webreports/143/S143847.html",
      "state": "AR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fe5",
      "summary": "As I drove on I-30, it was still light, getting to dusk.  The orange sunset as the background around my 2:30 position.",
      "city": "littlerock",
      "shape": "fireball",
      "date": "2018-11-24T00:00:00",
      "story": "As I drove on the I-30, it was still light, getting to dusk.  The orange sunset as the background around my 2:30 position.  And I started noticing streams of light falling from the sky.  It was beautiful just like the movies, strange shape lights, orange, I thought meteors, but having read this, it could not be.  Different directions.  I counted around 12 at one time small to very large.",
      "link": "http://www.nuforc.org/webreports/143/S143848.html",
      "state": "AR",
      "duration": "15 minutes"
    }
  ]
}