{
  "city": "longbeach",
  "fetch_timestamp": "2025-07-12T14:32:05.890672",
  "record_count": 129,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4393",
      "summary": "orange light drips in LONG BEACH CA",
      "city": "longbeach",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "orange light drips in LONG BEACH CA i live on the second floor so i have a pretty good veiw of the sky.i live near the long beach airport and see planes fly by from there and LAX and sometimes the police helicopters. well anyway, iwent out to smoke about 11:15 pm i took a few drags and noticed an orange light coming from the north and i thought it was weird cause it didnt have any safty flashers on it and it didnt make any noise!at first it just looked like a round light in the sky but as it got closer it looked like an oval saucer type of light.i didnt want to say it was a UFO right away but when i saw it drip  thats when i knew some thing wasnt right! it dripped twice.it looked like it was goning to drip again but the drip paused right under it so it looked like two lights. right after that it switched directions it started to move west at a slower speed, so i ran in the house and got my girlfriend, by the time we got out there it looked the same as when i first saw it but not so clear cause it went through a thin cloud and i shouted in exicitement \"do you see it,do you see it\"she said \"yeah but it s just an orange light.\" i said \"can you hear it?\" she said \"no.\" i showed her my goose bumps and we went in the house. i told her the whole story.5 min later a helicopter flew by, 20 min after that a second flew by. i dont know if its because of the UFO though. i know i couldnt  have been the only one that saw it!!! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49764.html",
      "state": "CA",
      "duration": "5min"
    },
    {
      "_id": "64d005f478aba2ec5a3b46b4",
      "summary": "Fast-moving glowing, gyrating shpere.",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2006-05-15T00:00:00",
      "story": "Fast-moving glowing, gyrating shpere. My friends and I were out  boating when we saw a gyrating sphereical object. It was  as far up in the sky as a commercial flight craft. It was glowing very brightly and was visible in broad daylight. White lined with a red tint around the edges. It was utterly silent and everything seemed to get silenced as it came by as if some out of humanly detectible pitch was drounding out all othher noise",
      "link": "http://www.nuforc.org/webreports/050/S50517.html",
      "state": "WA",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4de0",
      "summary": "A bright green light came from the east qnd went down in the west",
      "city": "longbeach",
      "shape": "light",
      "date": "2019-04-25T00:00:00",
      "story": "A bright green light came from the east qnd went down in the west",
      "link": "http://www.nuforc.org/webreports/145/S145849.html",
      "state": "MS",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5853",
      "summary": "many red orbs arranged in a trinangle",
      "city": "longbeach",
      "shape": "formation",
      "date": "2007-10-08T00:00:00",
      "story": "many red orbs arranged in a trinangle I was waiting for a meteor shower and then I saw these bright red objects moving together at a extremely fast speed in a triangular arrangement. There were around six on each side and one in the middle. I was more than sure that they weren't meteor but I hadn't seen a meteor but I saw pictures of one and it looked nothing like what I saw.  They moved so fast that my mom that was standing right next to me didn't have time to look up and see them.",
      "link": "http://www.nuforc.org/webreports/058/S58455.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b614e",
      "summary": "9/17/1960 -21:10 hours-Terminal Island, Califronia, Four  Crescent over LBNSY- observed 4-5 seconds above broken clouds",
      "city": "longbeach",
      "shape": "other",
      "date": "",
      "story": "9/17/1960 -21:10 hours-Terminal Island, Califronia, Four  Crescent over LBNSY- observed 4-5 seconds above broken clouds I was working the Swing Shift as a shipfitter at the Long Beach Naval Shipyard.  At lunch time (20:30 hours) most of us shipfitters and welders would go to our main shop (Building 128) for lunch, card playing, naps or whatever we could do in only half an hour. This was the week after Echo I had been launched and was scheduled to be visible over the Los Angeles area.  I think it was Tuesday the 16th when lunch ended and one of the welders called for us out to the front (South side) of the shop to watch Echo I pass overhead.  It was a very clear night and was easily seen as a silver dot (about the size of a pencil lead held at arm's length).  It's orbit from West to East was easily tracked and we all felt thankful to have had an opportunity to see it on one of the few nights it would be seen in our area. The next night there were scattered clouds and as I left the shop building after lunch and walked toward Dry Dock 2 I looked up at the clouds and thought to myself, \"Much too cloudy to see Echo tonight\". Then from above the clouds on a Southerly course I saw four crescent shaped objects \"flying\" in a reverse \"V\" formation.  Being crescent shaped and not too long after sunset I first surmised it was the sun (now over our horizon) that was reflecting off of some type of aircraft like the Vought V-173 \"Flying Pancake\".  I could only see them for about 4 or 5 seconds before they disappeared above another cloud.  I tried to listen for a sound of aircraft engines but heard nothing except for the leaking air from low pressure air manifolds down in the Dry Dock.  If they were the Vought aircraft, I would certainly have heard their twin propeller engines. I checked my glasses for dust, backed up and stepped forward again to see if they were a reflection of something on the ground off my glasses.  I did this for one or two minutes without being able to duplicate the apparent sighting.  In size, and if circular or \"saucer\" shaped with the reflecting sun on their West edges, they would be the size of a pencil eraser held at arm's length (as opposed to a pencil lead in my description of Echo I). When I mentioned this to a couple of my fellow workers they just laughed and said I've been reading too many Science Fiction books (actually I was reading Harold Lamb's historical novels at that time). I have modified an historical map of the shipyard (that no longer exists) that I reconstructed from old maps and aerial photos for a book I am writing on the history of the Shipyard, Naval Base and attached Naval Air Station.  In accordance with your instructions of electronically uploading images, I am emailing this map both as an insert and as an attachment for your study. Because I transferred over to the Design Division 4 years later and eventually was the structural configuration manager of the 1980's reactivation of the Iowa Class Battleships I kept the story to myself - except with friends who like stories like that.  I retired in 1994 but did not decide to file an official report until now when I realized the accuracy of my shipyard map may be of value.",
      "link": "http://www.nuforc.org/webreports/062/S62169.html",
      "state": "CA",
      "duration": "4-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b69fc",
      "summary": "BRIGHT STATIONARY LIGHTS  WITH PORT HOLES SOUTH OF LONG BEACH CA",
      "city": "longbeach",
      "shape": "other",
      "date": "2007-04-27T00:00:00",
      "story": "BRIGHT STATIONARY LIGHTS WITH PORT HOLES SOUTH OF LONG BEACH CA ON FRIDAY MARCH 16, 2007 AT 2130 HOURS I LOOKED OUT A SOUTH FACING 2ND FLOOR WINDOW AND SAW WHAT I ASSUMED TO BE LANDING LIGHTS OF A LARGE AIRCRAFT APPROACHING TO LAND ON RUNWAY 30 AT LONG BEACH AIRPORT. I WATCHED FOR ABOUT 10 MINS. THERE WAS NO MOVEMENT. IT LOOKED LIKE A CLUSTER OF THREE BRIGHT WHITE LIGHTS. I THEN USED CHEAP, REALLY POOR QUALITY BINOCULARS AND WAS ABLE TO SEE TWO HORIZONTAL ROWS OF WHITE LIT PORTHOLES, ONE ROW ON TOP OF THE OTHER. I CAN’T SAY IF THE BINOCULARS PRODUCED A DOUBLE IMAGE. THEY ARE REALLY WORTHLESS. I DID MAKE A POINT TO CONFIRM THE ROW/S OF PORT HOLES. THE OBJECT APPEARED TO BE VERTICALLY CYLINDRICAL WITH DOMED ENDS (TOP AND BOTTOM) I’M GUESSING ON THE SHAPE IT JUST WASN’T CLEAR ENOUGH FOR ME TO BE POSITIVE. THERE WAS SO MUCH BINOCULAR INTERNAL REFLECTION THAT I COULDN’T SEE ANY FURTHER DETAILS. (HORIZONTAL LIGHT STREAKING) WHATEVER IT WAS IT MUST HAVE BEEN SEEN BY MULTIPLE PEOPLE, I SUSPECT YOU HAVE RECEIVED OTHER REPORTS OF THIS OBJECT. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55797.html",
      "state": "CA",
      "duration": "UNK >10 MIN."
    },
    {
      "_id": "64d005f478aba2ec5a3b6da2",
      "summary": "fireballs in a triangle   ((NUFORC Note:  Student report.  PD))",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2008-04-17T00:00:00",
      "story": "fireballs in a triangle i was getting home and looked up at the sky. it was clear. and then i saw about 13 fireball type red objects. they are arranged in a wide triangular formation. they were  about 100 yards above the ground. they were emitting rays of red light from them making them look like they were glowing. they were moving from north to south. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  Student report.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62507.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b716f",
      "summary": "White colored upside down V shaped light/craft.",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "White colored upside down V shaped light/craft. I saw one upside down v shaped light/craft. It was white in color. It appeared for  I'd say 3 to 5 seconds it moved downward in the sky and then completely disappeared. There were no blinking lights it was one color only in a upside down V shape. The ends of the light/craft were hazy. There was no sound. The only other object I saw in the sky was a hellocopter whitch was far in the distance no where near where I saw the light/craft.",
      "link": "http://www.nuforc.org/webreports/061/S61946.html",
      "state": "CA",
      "duration": "3 to 5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b729b",
      "summary": "strange object's shapped somewhat  like the number 8 sideways",
      "city": "longbeach",
      "shape": "other",
      "date": "2008-01-21T00:00:00",
      "story": "strange object's shapped somewhat  like the number 8 sideways I was sitting on the porch  smoking a cigarette facing  the east. I live across the street from the ocean and I was just  sitting there enjoying the beautiful warm evening looking around and up in the sky which I always do. I am always looking up. The object that I seen  looked almost like the number 8 turned sideways but slightly squared at the top and bottom and rounded at the ends. I would estimate that it was about 5,000 ft up and pure, and solid white with no wings, numbers, or markings whatsoever. It was not a plane, helicopter, blimp, or kite, or anything that I have ever seen before. As I was sitting there thinking what the heck was that, along came another one much closer about 2,000 ft. up and on the same path going southeast as the first one. I don’t know what is going on because I’ve seen a few strange things looking out over the ocean in the last year. I have to say that we sure are living in a fast changing, strange world lately!",
      "link": "http://www.nuforc.org/webreports/060/S60810.html",
      "state": "CA",
      "duration": "11/2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7474",
      "summary": "Two Lights",
      "city": "longbeach",
      "shape": "light",
      "date": "2008-01-21T00:00:00",
      "story": "Two Lights My boyfriend (web designer) and I (linguistics grad student) were driving down the 405 South highway to an emergency vet with our cat who had a UTI.  We were having casual conversation and then out of the corner of my eye I saw a bright light in the sky moving very fast then suddenly the sky went completely black.  At the same time we both gasped.  I did not get as good a look at it  as my boyfriend did.  He saw two bright white lights next to each other (like this -----> * *  ) flying very low (no flashing no blinking), and faster then we have ever seen any thing move.  Then instantly it was gone.  It looked like it flew into a black piece of felt and there was no trace of light anywhere it was just gone.  We were the only car on the road at that time and all of the street lights on the highway were out which we thought was quite odd.  Additionally we were well past Long beach airport and quite a ways from the orange county airport so we don't believe it was a plane.  Any insight into this sighting would be appreciated Thanks!",
      "link": "http://www.nuforc.org/webreports/060/S60896.html",
      "state": "CA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7486",
      "summary": "Chrome Disk motionless over ocean at sunset in Long Beach, CA 3/3/08 5:45 pm",
      "city": "longbeach",
      "shape": "oval",
      "date": "2008-03-04T00:00:00",
      "story": "Chrome Disk motionless over ocean at sunset in Long Beach, CA 3/3/08 5:45 pm Ocean Blvd westbound toward Redondo Ave. over the ocean attention to the sky due to jet stream of probably military aircraft which is common in that area jet flying away from me northwest intersecting jet stream another smaller jet stream of object heading toward ground pulled over to see if something was going to crash object stopped mid-air no movement or fading out of jet stream, as if frozen in a photo sun not set yet, so light reflecting on chrome-like metallic object viewing object from what appeared to be a side angle of a disk possibly oval in shape pulled back into traffic looked up possibly another jet with jet stream passing, but object gone first experience of this type too amazed to think to use cell phone for photo or video",
      "link": "http://www.nuforc.org/webreports/062/S62052.html",
      "state": "CA",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7561",
      "summary": "2 oval shaped lights in the sky.  Moved quickly, following each other in circles and various directions then vanished very rapidly when",
      "city": "longbeach",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "2 oval shaped lights in the sky.  Moved quickly, following each other in circles and various directions then vanished very rapidly when airplane approached.  Reappeared about 15 minutes later, but lights were much fainter then dissappeared quickly again.",
      "link": "http://www.nuforc.org/webreports/052/S52718.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b76fd",
      "summary": "Orange fireball drips small ball",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2006-12-07T00:00:00",
      "story": "Orange fireball drips small ball The sky has been clear with a few clouds recently.  for the last two nights, I have been looking at the stars be cause they were bright and clear. I was cehcking out the skyline of the city when I noticed this bright flickering object which seemed to be over the ocean.  It looked to be about 10 miles away pretty low on the horizon.  I pulled over and stopped my car to get a better look.  It didn't look like an airplane, it seemed to be hovering and not really moving.  It was an organge color and look kind of like it was on fire.  After about a minute of observing this thing a small peice of it dripped down and both objects dissapread in the clouds.  I couldn't believe my eyes for a secoond.  I am not sure what that thing was.",
      "link": "http://www.nuforc.org/webreports/053/S53373.html",
      "state": "CA",
      "duration": "about 1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b774e",
      "summary": "Sliver  and Red Spheres Over Long Beach California",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2007-10-08T00:00:00",
      "story": "Sliver  and Red Spheres Over Long Beach California I was down at the beach in Long Beach, CA flying a kite. The wind was blowing out of the WSW so we were looking ENE when a spherical silver object flying at a high altitude (higher than the planes) from the North to the Southern sky and then stopped and hovered for a few minutes.  After a minute or so we noticed another sphere that was hovering in the sky just north of the first object. This object was spherical as well but gave off a redish reflection. The silver one then moved north and the red one moved NW at which point they faded away. Over the next hour about 5 more objects appeared over the bluffs from the NNE and flew into the corona of the sun, SW, where we couldn't see them anymore. I called LBPD who refered me to Marina Police, who transfered me to Local Lifeguards, who then came out but by that time they were gone. That call was made at 17:11. I called the FSS that told me over LB at 17:00 the wind aloft was out of NW at 15 knots for 3000 ft and out of the NNE at 10 knots for 5000 ft.",
      "link": "http://www.nuforc.org/webreports/059/S59144.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b7768",
      "summary": "Bright Green Shooting Star?  (NUFORC Note:  Possible meteor?  PD))",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2006-12-07T00:00:00",
      "story": "Bright Green Shooting Star? I was driving with my friend in a northbound direction and saw a large bright green object fall/shoot from the sky.  I was headed in the direction of a green signal light so it didn't register immediately but it was fairly large for a shooting star and low.  My friend and I both saw it and both saw it as a green shooting star (?)  I have never seen anything like this. ((NUFORC Note:  Witness elects to remain semi-anonymous.  Possible meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53384.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b776f",
      "summary": "V shaped light formation",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2006-12-07T00:00:00",
      "story": "V shaped light formation A V shaped craft traveling in a S.E direction. It looked exactly like the image submitted to your site by the couple from Hutchinson, KS on 10/30/2006. It was a large silent fast moving formation of large dimmed lights. The object flow almost straight overhead. I live close to the Long Beach airport and I see aircraft all the time. This was not any aircraft I’ve ever seen before nor was it on any normal flight pattern for the airport. I could not tell if it was a solid triangle or a V. Living where I do you can’t really see a lot of stars so as it traveled it didn’t pass in front of anything that would define it as a solid triangle or a V.  But there were around 11 to 13 large lights all the same size, color, and brightness. A single light in front and pairs trailing behind spreading apart to complete the V shape. It’s hard to say how high the object was or how big. But if compared to a normal passenger jet, then it was only a few thousand feet.",
      "link": "http://www.nuforc.org/webreports/053/S53387.html",
      "state": "CA",
      "duration": "4 to 5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b79dd",
      "summary": "Giant craft? with random red blinking lights.",
      "city": "longbeach",
      "shape": "formation",
      "date": "2006-12-07T00:00:00",
      "story": "Giant craft? with random red blinking lights. I had seen something strange in the sky a week earlier.  I saw this ball of light or fire drip a small ball of fire or something.  You can see my report filed on 11-12-06.  Earlier today whole playing baseball I saw an f-15 jet fly pretty low over Long Beach.  I had a feeling something was up.  I had a feeling the last thing I saw was military.  Around 6pm I went out on the balcony to get some fresh air.  I noticed the normal air traffic coming and going near LAX.  I then saw these red lights flashing unlike the other planes.  I called my roommate to take a look and he also agreed that it was not an airplane.  We saw a group of lights moving about the speed of an airplane moving in a NW direction.  It seemed like it was flying along the coastline.  The lights would flash in random intervals. There where no other lights but about 4 red lights.  It could have been one craft, the lights moved as if it where one.  The size would have been huge, maybe miles wide! It was about as wide a 4 finger width, if you put your hand in front of you. We saw this thing continue north and finally disappeared in the horizon.  I went inside for a few minutes.  When I cam back out it had come back a bit like it turned around but was heading in he same direction again.  The lights would flash in random order.  It seems there where two on the outside and two closer to the middle.  The light flash was very bright and precise. These were not normal lights.  I would also guess the craft was in a v shape bcuase of the way the lights moved. I kept looking in the sky after it had gone.  I noticed some flashing lights again but this time it seems like an airplane.  I thought it could have been a military jet because the way the lights flashed where different than the other airplanes.  Later I saw a bright light approaching outside of the normal flight path.  Then the light turned off and I saw the same type of airplane lights that I saw after the red lights passed by.  I really think this was a military jet escorting ! or looki ng fir the craft.  This is my second sighting of something strange in the sky within 2 weeks.  I have never seen anything strange before in my life.  I am college educated.  I also have really good eyesight.  I am glad my roommate was there.   I think he finally believed me about the thing I saw earlier in the week.  It seems like there has been a lot of activity going on in the LA area recently. I hope other people saw this thing. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53514.html",
      "state": "CA",
      "duration": "about 5 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b7acf",
      "summary": "Green Flash seen during Long Beach Black Out",
      "city": "longbeach",
      "shape": "flash",
      "date": "2007-02-24T00:00:00",
      "story": "Green Flash seen during Long Beach Black Out there was a black out tonight around 2:00am on thursday february 8 (just right now). The only problem was that only one side of the city or street I don't really know was blacked out. But the other side had light. The weird part was when I opened my blinds to see outside, I saw this green light in the sky just flash. Sort of like a lightning bolt but faster. It was pretty weird. Nothing like I have seen before. I thought it might have something to do with the blackout. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55212.html",
      "state": "CA",
      "duration": "second"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bb2",
      "summary": "Let me first say that I have been a pilot since I was 17 years old, flew helicopters in the Army and logged over 3600 hours of flight t",
      "city": "longbeach",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "Let me first say that I have been a pilot since I was 17 years old, flew helicopters in the Army and logged over 3600 hours of flight time.  I have very good depth perception and can judge altitudes pretty accurately.  This particular incident is the second unexplained sighting I have had in 40 plus years.  My 2 children, 12 and 8 years old, and I were sitting on a grassy knoll in a local park watching radio controlled gliders.  I heard an approaching airplane and layed on my back to looked up at the sky to watch the plane begin its' landing approach to the local airport.   As it passed overhead I noticed a small round, very bright, solid white object at a very high altitude, directly above me.  It was slowly moving westward when it stopped.  When this happened, I asked my 12 year old if she could see the object.  She said she did and asked what it was.   I then asked my 8 year old if he could see it.  After 5 seconds or so, he also saw it.  Just as my 8 year old spotted the object, it slowly started to move in a north direction for maybe 10 seconds, then stopped.  Within a few more seconds, it changed direction and moved south east to a spot directly over us again.  The white round object had completed a triangle pattern.  After about 3 or 4 minutes, we saw the object seem to tilt down towards the east and it now appeared to have a faint outline of chrome or silver to it.  It stayed like this for only 3 or 4 seconds, then appeared to rotate back up to its' original horizontal (?) position.  This day was fairly windy - 10-15 mph surface winds with a much faster high altitude wind due to a cold front system moving in.  The white object never gained altitude or drifted in any direction other than the original 3 directions mentioned. My estimate was that it was at or above 40k feet as there were 2 high altitude jets passing through the area that created vapor trails and the white object appeared at this altitude or higher.  My children and I watched this object for over five minutes - I had checked my watch.",
      "link": "http://www.nuforc.org/webreports/053/S53677.html",
      "state": "CA",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f27",
      "summary": "Rainbow harbor UFOs",
      "city": "longbeach",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "Rainbow harbor UFOs On this morning the cloud formations were particularly nice and I went to the beach, across the street, to take some images of them.  I didn't notice that there were some things in them until today when I offload them to my computer. Images will follow to the provided email adress. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72312.html",
      "state": "CA",
      "duration": "5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b84e6",
      "summary": "This object had no where to go but up ,It used this this mist cloud to cloak itself((NUFORC Note:  Missile launch.  PD))",
      "city": "longbeach",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "This object had no where to go but up ,It used this this mist cloud to cloak itself On the clearest night in months,full off stars, no clouds, we were in a roof top hot tub, when we saw a beam of light, which was paning left and right then a light mist appeared around the beam as it faded away.The fog cloud lasted about 2 minutes after the light faded away.There was no objects in the area to the left or right of this event when it was gone .It had to of went straight up out of sight.At first we thought it was a helicopter , But like I said there was no visual evidence once this light went out. Truley unexplainable. ((NUFORC Note:  Missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72524.html",
      "state": "NJ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b85fe",
      "summary": "3 bright dots in a form of a triangle pointing south.",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2009-08-05T00:00:00",
      "story": "3 bright dots in a form of a triangle pointing south. On Monday evening we were driving on the 5 South heading towards the 605 south freeway. We looked up on our left hand side it was 3 little bright dots, in the form of a triangle and the tip of it was slightly point lower than the rest and pointing toward 5 south. It was there for awhile even as we exited we still saw it in the distant. There was also an airplane close to it.",
      "link": "http://www.nuforc.org/webreports/070/S70952.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8605",
      "summary": "Second fireball moves across sky.  Likely flare afloat.",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Second fireball moves across sky.  Likely flare afloat. Same thing as previous post.  This time it seemed to flicker considerably more, like a flare.  Then it flickered out.  It followed the same pattern as the one reported a week ago by me.  This is most likely a flare, though it really seems to move faster than that...a fast drfit.  If it is a flare, it isn't too wise, given the wildfires here.  Saw object in sky, watched it drift at good rate of speed and flicker, then flicker out for a solid four or five minutes.  Snapped picture with video camera.  I will photograph the next object with a digital camera to enhance any more resolution out of the image.",
      "link": "http://www.nuforc.org/webreports/067/S67121.html",
      "state": "CA",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3b876a",
      "summary": "Three orange circular objects flying in a triangular formation.",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "We saw three orange circular objects flying in a triangular formation.  Together, they moved in an \"L\" shape.  Then they disappeared.  It was a bright star-filled evening.",
      "link": "http://www.nuforc.org/webreports/068/S68019.html",
      "state": "CA",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b879d",
      "summary": "Unexplained Lights in the sky over Long Beach, CA",
      "city": "longbeach",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "Unexplained Lights in the sky over Long Beach, CA I have been viewing the object for over 1 hour now, From my Balcony in Long Beach, CA. It appears to be a round object very bright and changing colors in a pulsing motion. Camera does not pic it up well, however banoculars are working and viewed the change of color pattern. Object is over the Long Beach Harbor area, I live close to Broadway and Linden and am looking out towards the marina. Its not moving and staying in a stationary position, with pulsing multiple color lights",
      "link": "http://www.nuforc.org/webreports/068/S68031.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b87ac",
      "summary": "Perfect pulsating triangle over the freeway near the airport.",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "Perfect pulsating triangle over the freeway near the airport. First noticed the objects while I was driving on the 405 Freeway, north bound, just passing the Long Beach Airport. I was on the phone with my girlfriend as I watched what I originally thought was a plane “pulsate” its front lights as it flew in the direction of the ocean. As I got closer I realized that the object was not in fact moving but hovering just over the path of the freeway.  Immediately I realized that I was not looking an airplane (due to the absence of the blue and red lights normally seen on the wings of the plane) and as the objects came into view I was able to make out three distinct lights forming a perfect triangle. The entire time I was just saying, “Oh my God, oh my God, what am I looking at?!”  This continued for about 3 minutes until the freeway began to bend in another direction of the lights, and at this point the other two lights began to pulsate in unison. I watched this go on as I made the left bend on the freeway, and the last I could see of the lights is that they began to change colors to a deep blue.  I did not stop because I was honestly too afraid to and still am shaken up by the whole experience.  Other then myself I do not know the other observers because we were all on the freeway, I do know that others did notice the lights because traffic was beginning to slow down and people next to me were pointing. At this point of entrée I have not contacted my local news groups to put them on alert, but I will after summiting this UFO encounter description.",
      "link": "http://www.nuforc.org/webreports/065/S65353.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a88",
      "summary": "Fireball moves slowly across the sky, puses, then changes directions - Long Beach, CA",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Fireball moves slowly across the sky, puses, then changes directions - Long Beach, CA Object moved slowly from approximately 45 degrees above the SE horizon toward the NW.  It paused at about 80 degrees to the S for approximately 4 minutes.  I called for my wife to get our 1000x video camera and the binoculars.  Binoculars were too shaky.  It moved S to N, again slowly.  I was able to video it for a few seconds because of the shakes.  It was a very bright red with white center fireball but I couldn’t make out any distinctive features of it.  After it had passed over head to the Northern sky it faded out of sight at about 45 degrees to the horizon.  If I would have to say it was something for certain I would say a flare attached under a bag or something.  The altitude, however, was very high.  When it appeared to not be moving it could very well have been moving up instead of directionally horizontal.  I don’t really know.  I did video it briefly but the video isn’t clear enough to determine what it was.  I do live right in the flight path of an airport (within 2 miles).  I know how they move through the sky.  This object had no FAA lighting.  A few planes flew W to E near and what appeared to be under the object.  They didn’t seem to take note of it.",
      "link": "http://www.nuforc.org/webreports/066/S66871.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a8e",
      "summary": "green light travelling at light speed",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "green light travelling at light speed a bright green light appeared from nowhere in the sky as we were driving along the 605 going north, it appeared to be the same size as a green light you would see on a traffic light, it accelerated off at what seemed to be light speed right through the flight path of all the airplanes that were landing at the airport, and seemed like it would of hit the ground  it was way bigger then a commet and an airplane and going way way way faster  the people in the car next to us saw it too and they kind of swerved and pulled over  very strange ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66887.html",
      "state": "CA",
      "duration": "2seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c52",
      "summary": "Confirming sphere siting",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2010-02-14T00:00:00",
      "story": "Confirming sphere siting I was outside Long Beach City college waiting for my 6:30 class. I was talking with a classmate when I spotted two lights in the sky following each other. The were fliing from the northwest to the southeast at a high altitude and moving very fast. At first I thought they were planes but they didn't exihibit any flashing collision lights. After I saw them I pointed them out to my classmate. We watched as they flew and then just disappeared in the same spot. Later I realized that they had no lights on them but were reflecting the light from the sun, that by then had set, and that the reason they disappeared was because they flew into the shadow of the earth. It sould be noted that I didn't report this until now because I read someones account that confirmed mine. http://www.nuforc.org/webreports/073/S73462.html",
      "link": "http://www.nuforc.org/webreports/073/S73719.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d3e",
      "summary": "White or reflective object at high altitude displays unusual flying behavior, disappears straight up.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "White or reflective object at high altitude displays unusual flying behavior, disappears straight up. Wednesday September 10th I was visiting my sister at her cottage on Lake Erie, at Long Beach, Ontario. At around 4:30 in the afternoon, as we relaxed overlooking the beach, my sister looked up and said \"what is that?\". She pointed out what she saw in the mostly clear blue sky. At high altitude was a small round object. It was so high as to be difficult to say if it had any shape other than round, or any distinguishing markings. A high flying airliner was nearby and was below this object which in my estimation had to make the object we saw at least as large as the passenger jet. The object was moving in a strange sort of s-pattern, changing directions a number of times in a short distance. Next it seemed to go straight up, as it became suddenly smaller and then disappeared. We observed the object for less than one minute. Neither of us had ever seen anything in the sky behave in this manner before. At first we thought it could be a balloon but if so it would have had to be some miles up and very large.",
      "link": "http://www.nuforc.org/webreports/065/S65796.html",
      "state": "ON",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d5f",
      "summary": "12/12/09 between 22:30 and 23:00 numerous moving bright lights 50 - 60 in the sky moving in an easterly direction with bursts of speed",
      "city": "longbeach",
      "shape": "unknown",
      "date": "2010-02-14T00:00:00",
      "story": "12/12/09 between 22:30 and 23:00 numerous moving bright lights 50 - 60 in the sky moving in an easterly direction with bursts of speed I was looking up into the sky after some rain and we had.  The sky was intermitinly clouded, mostly small clouds passing by. carried by a swift upper wind. at first I thought they were stars, but they were brighter than venus. then I thougth it was one airplane, but there were no flashing lights, then I noticed more of them too many to be airplanes. 50 to 60 all moving in the same direction from the eastern horizon to the west.  Some were in formations other were not.  There would be bursts of speed then very slow as if trying to pass for stars should anyone look up.  I had to ask others there if they were seeing what i was seeing and like me the first explanation was that they were planes, but the altitude was too high and their light to bright for anything conventional and the speed to great, not to mention the size they must have been to cast such a light at that altitude.  After they passed there was a brief period where the sky was just black then the stars! were all there in their normal  locations I stood there in disbelief while other said to call the police or someone.  Some of the women there even started to cry saying it was armegedon.  I just could not believe what I saw and so many and not one of our jets was in the sky?  \"I live near a flight path\".",
      "link": "http://www.nuforc.org/webreports/073/S73694.html",
      "state": "CA",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e8b",
      "summary": "UFO sighting Long Beach, CA - Small spherical bright light reflective object remaining perfectly stationary",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2010-04-13T00:00:00",
      "story": "UFO sighting Long Beach, CA - Small spherical bright light reflective object remaining perfectly stationary I live on the third story of my apartment, facing East. I noticed something small, bright (reflecting light) and spherical in the sky outside my window.  It remained in a stationary position just inland of the coast. From my position I estimated it was pretty high, as the Long Beach air traffic was flying well below it.  Yet for ten minutes it did not move, so I ruled out balloon and blimp.  I tried to record it with my video camera, but the reflectivity of the object and the distance of it made recording impossible, it simply wasn't registering in my view finder...  As I put my camera down it began moving slowly toward Seal Beach (Naval Weapons Station) direction.  By 16:15 pst it was out of my visual range.  There was only one object. My background is irrelevant to the sighting.  I am not ex-military or law enforcement, and I have only seen a UFO one other time, with two friends in 1994.  Turned out to be a prototype for a DRONE the military was testing over the neighborhoods of Lakewood, CA. So this could be anything.  I am simply reporting it.  Hope someone else out there got a better look at it than i did.  Perhaps the pilots passing underneath it? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74387.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b933f",
      "summary": "I saw blinking lights which at first looked like an aircraft except for irregularities in the sequence.  The craft looked like it was j",
      "city": "longbeach",
      "shape": "",
      "date": "2009-12-12T00:00:00",
      "story": "I saw blinking lights which at first looked like an aircraft except for irregularities in the sequence.  The craft looked like it was jumpy rather than flying smooth near the Long Beach Airport and then it stopped and disappeared, or at least the lights were gone from mid air to no where.",
      "link": "http://www.nuforc.org/webreports/073/S73237.html",
      "state": "CA",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9644",
      "summary": "Triangular object seen in Long Beach, CA",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2010-04-13T00:00:00",
      "story": "Triangular object seen in Long Beach, CA I was sitting in the backyard on March 16th, of 2010. I was looking at the constellation Orion, when I noticed a dark, triangular shaped object moving across the sky. The object was dark, but the lights of the city below reflected off the \"belly\" of the craft. There were also 5 lights, that seemed to line the outside of the object. It was silent, and moved smoothly, but quickly across the sky. I work in the entertainment industry, and part of my job is to be observant, and to notice things that are out of place. This was definitly something I had never seen before, and, in my opinion, was not a conventional aircraft.",
      "link": "http://www.nuforc.org/webreports/074/S74713.html",
      "state": "CA",
      "duration": "15 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b9973",
      "summary": "Two reddish lights following one another at a very high rate of speed,following the mississippi coast line.",
      "city": "longbeach",
      "shape": "oval",
      "date": "2009-06-09T00:00:00",
      "story": "Two reddish lights following one another at a very high rate of speed,following the mississippi coast line. I have 7 years military,4 years on a air craft carrier exp. While sitting in my hot tub{alone}at 23:45 hours,I saw two lights,a dull redish in color. Its quit possable it was one craft.Moving possably mock 2 or faster. Guessing maybe 2000 feet up.The lights were moving together at the same speed following the coast line heading West.There was no sound before or after i seen the lights.Ive never seen anything like it before.I know jet aircraft.It was like no Military craft i have seen before.I live on the Mississippi gulf coast in Long Beach,one mile from the ocean.Ive always believed there is life elsewhere in our Universe.And after tonight i believe even more........I KNOW WHAT I SAW.",
      "link": "http://www.nuforc.org/webreports/070/S70023.html",
      "state": "MS",
      "duration": "30 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b993a",
      "summary": "Long Beach California red/purple/pink fireball falling from the sky for about 15-20 seconds",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2008-08-12T00:00:00",
      "story": "Long Beach California red/purple/pink fireball falling from the sky for about 15-20 seconds A red/purple/pinkish round fireball object falling straight down from the sky with a lot of smoke trailing after it. I expected to hear a crash but I didn't. I also am expecting something on the news, but I've seen nothing yet. This happened in the middle of the city, a very large city, so I am sure there will be a report(s) from others. I am not into UFO's, have never seen one. No idea what this was. I thought it may be a helicopter crashing or something or a meteor. I live on the fourth floor of a building downtown and saw several people on the ground also watching it.",
      "link": "http://www.nuforc.org/webreports/064/S64579.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9937",
      "summary": "Loud cycling noise followed by multiple helicopters",
      "city": "longbeach",
      "shape": "unknown",
      "date": "2010-02-14T00:00:00",
      "story": "Loud cycling noise followed by multiple helicopters I was just outside and heard a strange noise from above.  I looked up but could not see whatever was making the noise because of low clouds.  It sounded kind of like a car alarm but a lower pitch.  The noise was cycling and constant as it passed overhead and to the south.  Minutes after, I heard a helicopter pass overhead, then two more off in the distance to the east and a finally fourth coming from the north.  They formed up in a line abreast and began what seemed like a \"sweep\" in a northwest direction and turned southeast.  They are probably visible in the sky as I type this.  The helicopters have to be related to what I heard.  The only other time I saw so many helicopters was durning coverage of OJ Simpson in the Ford Bronco speeding down the 91 fwy.  They were media copters getting the scoop. Going to check the TV and see if there is a car chase or something.",
      "link": "http://www.nuforc.org/webreports/074/S74097.html",
      "state": "CA",
      "duration": "5 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3b9aae",
      "summary": "Large white circle flew over Long Beach at a low elevation.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "Large white circle flew over Long Beach at a low elevation. I was driving south on the 605 freeway in Long Beach CA when a large white circle appeared out of no where, flew horizontally across the sky at a tremendous speed for 1 second then vanish.  It had no tail and seemed to fly at the same elevation that police helicopters fly at.  The object looked to be about 2 centimeters in diameter from where I was. I know there was a meteor shower that night but this didn’t look like the typical meteor we see in Southern California.  Usually meteors are tiny dots flying way up in the sky with a tail dragging behind it.  This was a large light with no tail flying not so high up in our airspace. I wasn’t the only person to see it.  There were 8 cars around me that all hit the brakes at the same time as me when I saw it.  I thought maybe it was a plane or a jet since there is an airport and an air force base near by but I’ve never seen a commercial jet fly so fast or a military jet vanish.",
      "link": "http://www.nuforc.org/webreports/067/S67476.html",
      "state": "CA",
      "duration": "1 Second"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0c9",
      "summary": "I know of no object  that could  do it.",
      "city": "longbeach",
      "shape": "light",
      "date": "2009-05-12T00:00:00",
      "story": "I know of no object  that could  do it. Looking out my window, over the pacific beach.  I saw a light and thought it was star.  Except it moved (moving a short distance) then stopping and doing that again. The light was white, a big light in the front and a small light in the back.  It finally just went lights out and gone.   Time duration- 25 minutes.  It was high in the sky and way out in the pacific ocean",
      "link": "http://www.nuforc.org/webreports/069/S69805.html",
      "state": "CA",
      "duration": "25 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1ca",
      "summary": "Very bright, star-like object making loopy or jerky motions.",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2009-04-14T00:00:00",
      "story": "Very bright, star-like object making loopy or jerky motions. First, let me say that I have seen this type of incident many times in my life, but this is the first time I am reporting it. I got up at approx. 4 am, because of a bad dream.   I walked into my living room which is all glass, and the night sky was exceptionally clear, no clouds.  In between some palm fronds I noticed something that was EXTREMELY bright, like a planet, but upon further inspection, I noticed it had a somewhat strange shape, somewhat of a triangle, with a larger flat top and pointed bottom.  It seemed to be \" pulsing\" bright, dimmer,brighter, dimmer, AND was moving in a jerky side to side motion, while very slowly moving upward, I lined my head up with the wall of the sliding glass door to make sure I wasn't moving and I watched this thing making a weird, loopy motion, sort of wobbling here and there, but always slowly moving upwards, while it still kept getting VERY bright, then dimming, and getting bright, over and over.  I know it wasn't a plane, or a helicopter, or a satellite, or a star, etc........ and as I said, I have seen this same type of \" star like\" object, ( MANY times through my life from the time I was a teenager, and I am now 56) that if you were to just glance at it, would seem like a planet or star, but if you start to stare at it, you notice it is doing very bizarre things, just subtlely, as you study it. I once observed an object like this on a beach in Oxnard, Calif. at 5 am. which was just above the horizon of the ocean.  Some surfers were in the ocean, and the sun was just barely starting to come up.  The object went directly into the ocean !!!!!   I was STUNNED, and apparently the surfers were too because they started yelling and screaming and going wild !!!! We had all witnessed something of the most bizarre nature, not knowing what to think.   I witnessed the object I am reporting now, for about 30-40 min. before I noticed it started waning in intensity, and it just \" went out\" and vanished in a perfectly clear night sky............ ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69369.html",
      "state": "CA",
      "duration": "40 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3ba3c6",
      "summary": "They were moving to fast not to make a shock wave sound",
      "city": "longbeach",
      "shape": "",
      "date": "2009-03-19T00:00:00",
      "story": "They were moving to fast not to make a shock wave sound I was looking at the sky in a west to north direction and saw 2 lights going from south to north moving at a rapid speed. the most western light seemed to twist in a northern direction ubtil they dissapeared from my sight.  There was no noise and the lights seemed to be less then 2 miles high. They seemed to be going at mock 3.  There was no noise.  I thought it was a little strange but dismissed it at first as a trick of light when the lights seemed to twist. Less then 10 minutes later 2 lights came from north to south going at more then mock 6 but like before there was no noise.  Then I was sure that what I was looking at and seeing was not normal.  I don't want to speculate other then to say that was not any kind of technolory I've ever seen or heard of.    Wheather it is our tech or someone elses I dare not speculate.",
      "link": "http://www.nuforc.org/webreports/069/S69080.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba487",
      "summary": "A formation of lights hovering above the Long Beach Harbor.",
      "city": "longbeach",
      "shape": "formation",
      "date": "2009-01-10T00:00:00",
      "story": "A formation of lights hovering above the Long Beach Harbor. We saw a formation of lights that consisted of 4 white lights in the shape of a square and 1 red light centered in the middle of the 4 white lights.  This formation hovered, completely silent, and completely still, above the Long Beach Harbor for about 20 minutes. We were witnessing this sighting from our balcony in Downtown Long Beach and once we left to go get the camera and came back, it was GONE!  Our other 6 neighbors witnessed this as well.  We all immediately thought UFO.  There was no explanation for what we were seeing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67769.html",
      "state": "CA",
      "duration": "20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba700",
      "summary": "An oval brilliantly bright/white object with a trailing tail moving east to west over the ocean in 3-4  seconds.",
      "city": "longbeach",
      "shape": "oval",
      "date": "2008-08-12T00:00:00",
      "story": "An oval brilliantly bright/white object with a trailing tail moving east to west over the ocean in 3-4  seconds. The object was bright oval with a trailing tail behind it. The size is hard to determine but if I were to put 75-100 stars together, it might approximate the size if it.  It was heading across the sky from east to west at approximately 10:00pm last night, Sunday night. It arked slightly, seeming to hesitate, as if to drop into the ocean, but then as if \"restarting\" it zoomed across the night sky, with a tail of lesser light trailing behind it. It took about 3 seconds for the whole thing and I was sure that there were reports of it but when I called the police station, no one had mentioned anything.  It was not a shooting star.",
      "link": "http://www.nuforc.org/webreports/064/S64990.html",
      "state": "NY",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba74f",
      "summary": "UFO seen in Long Beach California; Air traffic rerouted, helicopters search and no word in the media!",
      "city": "longbeach",
      "shape": "changing",
      "date": "2009-03-19T00:00:00",
      "story": "UFO seen in Long Beach California; Air traffic rerouted, helicopters search and no word in the media! From 7:59 to 8:25pm on March 17th, 2009, (please excuse my ignorance in forgetting to reset the time in my camera for DST!) my sons and I saw another UFO in the skies over Long Beach, California.  We were in the backyard of our home taking pictures of whatever might look interesting, as sky-watching is our hobby.  We do it at least 5 days a week to relax after a long day and I've been teaching them the constellations.   I then noticed something that didn't fit what we've come to know as a terrestrial craft, whether a jet, prop or experimental aircraft.  There was an object that was going from the west to the east and there was no red light visible (FAA REG) as with ALL OTHER AIRCRAFT taking off from the airport. Then it started to hover and immediately changed direction and again... did not have the FAA green light on its opposite side. I have almost 60 photos of this sighting... you really must see them all to be able to appreciate what is going on here. From my vantage point of about a mile off of the Pacific coast, this craft was hovering on the southern horizon - probably above the electric company at the corner of Studebaker and 2nd Street/Westminster.  After hovering, the craft would then make 160-180 degree turns going east, then west, then repeating while slowly drifting further south - over the Pacific Ocean - towards the famed \"Redondo Trench\".  This went on, as can be seen in the properties of my photos, for 26 full minutes. At the time of our sighting this time, it was not clear what shape the object actually was until the photos were analyzed upon download to my computer, and even then, it seemed only the lights were visible.  As far as structure and the apparent \"shape-shifting abilities\", this was one spectacular sighting! However it didn't beat the Triangle \"Mothership\" we all saw last November 12th, and I don't think anything else could!  That was reported the same day on UFO NorthWest, if you are interested. Anyway, I took a few \"real-time\" photos of the craft, but didn't want to \"waste\" the pictures and knew the only way to be sure to \"get proof\" was to take timed shots, so - as a result - most of the almost 60 photos I shot were 8 second exposures at a F 2.5 setting with an exposure value at +2.00 (the highest my camera goes) and certainly showing the true colors of the crafts lights and its flight pattern/path.  I used a high-pixel, Sony Cybershot digital camera and did not alter the originals AT ALL! I have kept their integrity to help you to prove or disprove whatever it was that caused more than ten helicopters to be in the air after it disappeared, and caused them to refuel and return to the search for the next 2 hours or so.  The light appeared to be of whitish/yellow color with a bit of red from time to time, and what got my attention was that the lights and colors did not match the FAA regulations with regards to Red on the left and green on the right and white lights that blink 40x per minute.  This thing pulsed and then stayed lit.  Then it blinked white lights fast and then went back to pulsing again only to follow it with another blast of bright, solid light for another thirty to sixty seconds.  From where I was, it looked like a saucer, then looked like 2 doing maneuvers together.  Then it looked like two orbs that were connected somehow, then \"shape-shifting\" into something else... more square-round. I would also like to mention that based on the photos I have taken, I have reason to believe their may have been more than one craft in the sky last night, too.  Several shots seem to show what could be mistaken for stars, but upon closer inspection, can be seen to have the same color coding/ shading as the inital craft and in two of my photos, it looks as if their are 2 saucers of another shape that might even be a couple of boomerangs, but on a timed photo, it is hard to tell. You are the experts and I do hope that my final disclosure to you will help figure out what is happening on our planet! Well, this was absolutely incredible, but did not come close to others I and my family have had and would like to talk with an investigator about. Last night, there were a total of 7 of us and an 8th joined in at the last minute, that witnessed this sighting and the after-effects. Only three of us saw it for the first 20 minutes or so, because I was getting pictures while the boys watched and tried to get neighbors out to see it, too. What else is interesting is that on March 11th, 2009, there was little to no usual traffic going into or out of Long Beach Airport and around 8:18pm, seven military and police/civilian helicopters flew over our house, seeming to be looking for something on the ground. They flew rather slowly, from west to east and then took a more southerly direction when above Seal Beach, moving towards the Huntington Beach Area. Scary thing? I took photos of them, too as soon as I heard them coming and watched them go... and the first shot set off the flash which seemingly caused one of the helicopters to turn on and shine a searchlight on us! I had the kids shut off the lights in and outside of the house, got to my computer and downloaded them as soon as I could - just in case I got something I wasn't supposed to have! I would most certainly like to speak with an investigator, especially since I've had multiple sightings (as has my eldest son) over the last many years and would like to finally share some of them with anyone willing to listen. I am beginning to fear whatever the heck is going on... and there IS something going on. Especially here in Long Beach, California.",
      "link": "http://www.nuforc.org/webreports/069/S69269.html",
      "state": "CA",
      "duration": "26 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb255",
      "summary": "Saw bright green flash & streak, no accompanying sound, suspected copper/thallium-containing iron meteorite.",
      "city": "longbeach",
      "shape": "light",
      "date": "2010-08-24T00:00:00",
      "story": "Saw bright green flash & streak, no accompanying sound, suspected copper/thallium-containing iron meteorite. At approximately 12:50 AM, I and four friends were standing outside and witnessed a flash of neon-green light which brightly lit the entire sky. I was looking in the direction that the flash appeared to originate from, in the southwest portion of the sky near Douglas Park, (a new commercial and housing development near the Long Beach Airport) and saw a vibrant but undiscernible arc or point of green light low in the sky, slightly above the rooftop level of a house across the street. One friend of mine, who was facing the other direction, also saw the flash but observed that it lower in intensity and appeared to have come from behind him. Several friends of mine living in an area in the general direction of the flash--in the Lakewood Country Club--reported having lost power at the time, several minutes later via facebook. The flash event lasted only a brief second, and neither I nor my companions heard any sort of noise in the seconds following the anomaly. I suspect that the flash was caused by a copper or thallium-containing iron meteorite, which would explain the green color of the flash, the lack of accompanying sound, and EMP which knocked out power.  I am an entering college student with an above-average scientific background.  I wrote this report to provide a coherent, detailed explanation of the event that occurred in anticipation that other reports would be made.",
      "link": "http://www.nuforc.org/webreports/076/S76925.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2f6",
      "summary": "Very fast Oblong crescent shaped object streaking through sky above Long Beach/Seal Beach, CA",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2010-08-24T00:00:00",
      "story": "Very fast Oblong crescent shaped object streaking through sky above Long Beach/Seal Beach, CA Just saw something very large streak across the sky in my back yard at approx. 2:14-2:15 AM. Not a distant object like a shooting star or comet.  Definitely lower atmosphere, larger than any commercial or military plane (c-17), No sound, very (very very very) fast, oblong crescent shaped light like a fireball travelling SouthEast. Note, there are no commercial craft flying that altitude above Long Beach, CA after 10pm. Also, in opposite direction of Long Beach Airports landing approach.",
      "link": "http://www.nuforc.org/webreports/076/S76960.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb643",
      "summary": "Saw 3 bright lights flying and then they stopped, forming a triangle.",
      "city": "longbeach",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "Saw 3 bright lights flying and then they stopped, forming a triangle. Saw 3 bright reddish orange lights silently flying west in the form of a triangle and then slowed to a hover in which they went into a line formation.  The light in front slowly moved to the right and the one that was in that position moved to the middle and the one on the left slid outward making it seem effortless in all.  The one in the middle then moved up and they all moved together going back to triangle formation.  The one on the left then vanished like a light loosing battery then the one up front followed and vanished and next it was over when the last one to the right slowly vanished like so.",
      "link": "http://www.nuforc.org/webreports/079/S79449.html",
      "state": "CA",
      "duration": "4 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd60",
      "summary": "Two throbbing extremely bright pulsating orbs the size of grapefruits outside bedroom window in Long Beach, CA",
      "city": "longbeach",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "Two throbbing extremely bright pulsating orbs the size of grapefruits outside bedroom window in Long Beach, CA Around 4am on August 18, 2011. I was awaken by my child's baby monitor going absolutely berserk like we've never heard it before. The way I sleep in bed I face our bedroom window( we only have one) which is covered with a thin piece of fabric. I was so tired, so I just opened my eyes to stare out the window when I noticed to BRIGHT( throbbing) lights about the size of a grapefruit at the base of our window. I lay still to make sure I saw what I just thought I saw, then the lights \"throbbed\" or pulsated again. Me being a skeptic, immediately thought that it was an intruder on the side of our house. I immediately sat up and sat STILL waiting to perhaps see the shadow of a human pass by.   I then got up to check on my toddler who was fast asleep.  I dare not look out the window, in fact it was like the event didn't even happen because I acted like I didn't see what I just saw. I tried to go back to sleep but felt CHARGED as if I had 10 cups of espresso.   Later that! day in Long Beach, we had a small earthquake too.  I felt it because I was laying in the bed, if fact the earthquake centered in Signal Hill, which is just 4 blocks north of where we live ( not sure if it's related) the earthquake was a 3.2 if I remember correctly.  Anyhow, when my husband came home from work, and started running errands together, I finally brought it up about these two strange lights outside our window, come to find out he saw them too!  But he was trying to rationalize what he saw as well. At the time I saw the lights and thought it was an intruder I completely forgot about the motion sensor that would have come on if it had been a person or animal.  The sensor didn't go off. I am so spooked. I don't think I'll ever sleep the same again.  I have feelings of dread going to bed now.  My nerves are frayed every time the baby monitor experiences even a little static.   Now I see why people remain quiet or go crazy or commit suicide or something, the range of emotions are over whelming.  I have NEVER had any interest/beliefs in ! extra terrestrial phenomenon nor have I ever wanted to see ANYTHING.   I'd probably be dead if I had see a space craft or actually alien...",
      "link": "http://www.nuforc.org/webreports/084/S84857.html",
      "state": "CA",
      "duration": "5min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe23",
      "summary": "UFO sighting in Long Beach, one drops from the sky, the other remained",
      "city": "longbeach",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "UFO sighting in Long Beach, one drops from the sky, the other remained While driving on the 405 fwy, in the distance saw two barely moving exteremely bright ights in the clear eastern sky.  The light one the right side rappidly decended out of the sky.  I mean straight down as if it were dropped.  Minutes later the one bright light was still in the sky, I got my cousins and there friends and we watched the object for 20 minutes.  I called some friends who also saw the object. We tried to take a camera phone photo and video, but the only thing that showed up on the video and photos were planes.  The remainig object object slowly pulsed light and would occasionally dim. It appeared to be slightly turning. A friend of mine who was closer to this object said there were multiple lights on the object, from my vantage point it was just a big bright light.  The brightest light I have seen in the night sky.  The eastern sky was clear of any clouds and stars. The object slowly moved upward and down, but did not drop as the other object did. Regrettably we stopped watching it after 1 & 1/2 hours.  When I went to look again around 2am it was gone. A few other people have told me that they too saw it that night. On a side note I do not believe in aliens or none of that, so there has to be a logical explaination for what we saw. I have not seen any news reports on this occurance.  We are fairly disturbed by this, hopefully you have some answers for us. Thank You",
      "link": "http://www.nuforc.org/webreports/083/S83670.html",
      "state": "CA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2b6",
      "summary": "I observed the Craft at a close enough distance to know it was not anything man made",
      "city": "longbeach",
      "shape": "oval",
      "date": "2012-01-24T00:00:00",
      "story": "I observed the Craft at a close enough distance to know it was not anything man made 05/07/1994 Walnut Ave & E 8th St Long Beach, CA 90813    \tI was standing next to my friend’s car smoking a cigarette it was a clear night,around 8:00 pm. approximately ¼ mile from my location in all directions were a lot of helicopters and I was wondering why they were just hovering. What caught my attention the house to my right in their back yard; behind this large tree, I noticed a light. At first, I thought another helicopter. Then I thought the rotors would be slamming into the tree. I started walking to get a better view, at that moment this craft slowly came around, was hovering above me, and slightly descended no higher then between the telephone polls “maybe 10 feet above”. From what I was observing this craft designs had no propellers, emitted a slight hum, “NO WIND AT ALL”. At first I was afraid because I was thinking why can’t I clearly see the being looking at me through that thick glass; then I remembered a saying of mine “to see /think clearly one must get past their technology.” Being a Mechanic I focused my thoughts observing the crafts structure then I looked again and at that moment this being kind of leaned back with an almost surprised expression. At that moment, I pointed my hand to him then I pointed to the sky, the being tilted its head to one side with a little smile. My feeble attempt to describe what this being looked like I determined it was male because we guys have a strength within our movements, I could only see from his “chest up” I didn’t see any hair, his face was little longer then ours and I must say was quit attractive. One interesting  aspect I noticed the “eyes/expression/personality” characteristics that of a cat or as plainly as I can describe picture a house cat but without the hair, fangs, claws that walks and looks not to different then us humans… \t I have wanted to share my encounter Therefore, who ever are reading this and feel the need to contact me through email. All I can say is “I am not one to bullshit! There is much more to my story is and is truest every word.”   \t\t\t\t\t\tThank You, ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86758.html",
      "state": "CA",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc37f",
      "summary": "VANTAGE POINT AND SIGHTING DIRECTION Standing at GPS coordinates (per Google Maps) 33.778603,-118.198761, if you face north and then tu",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2011-12-12T00:00:00",
      "story": "VANTAGE POINT AND SIGHTING DIRECTION Standing at GPS coordinates (per Google Maps) 33.778603,-118.198761, if you face north and then turn eastward approximately 65 degrees, that is the direction we were facing. If you view this direction with Google Maps Street View, you see the power lines going above the apartments, garages and alley – the object we saw was hovering above the highest power line. DESCRIPTION My daughter and granddaughter had gone out my building’s back door into the alley and called my phone to come out and look. It looked like a burning object, and I thought maybe it was an aircraft or a meteor, but it did not appear to be moving and there was no contrail. Then we saw a big burning piece fall straight down from the main object. This piece was smaller than the main object, left a trail of sparks and embers, and seemed to burn out and disappear before it traveled a quarter of the way from the object toward earth. This happened two or three more times, additional chunks falling in similar fashion from the main object while the main object continued to burn brightly - I say “burn” because it seemed to change shape and flare the way a fire does, and it was bright reddish orange and yellow like flames. DURATION This went on for 2-5 minutes (it is difficult to estimate the time since we were so stunned by this – it was unlike anything we’d ever seen before), and then the main object’s “flame” seemed to suddenly go out, although we could still see the object, now looking like a very dim star. The dim spot remained stationery for another 30 seconds to a minute, then started very slowly moving downward. As it got below (from our vantage point) the highest power line, it appeared to start moving south as it also gradually sank lower – the southward motion seemed faster than the downward motion and we lost sight of it after 2-5 minutes when the building across the alley (east) from us blocked our view.",
      "link": "http://www.nuforc.org/webreports/085/S85492.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3d8",
      "summary": "Big, extremely bright, bluish-white, silent light that changed shape in the sky over the ocean in Long Beach, CA.",
      "city": "longbeach",
      "shape": "changing",
      "date": "2011-10-10T00:00:00",
      "story": "Big, extremely bright, bluish-white, silent light that changed shape in the sky over the ocean in Long Beach, CA. I saw something unusual in the sky while letting my dog out to urinate at 5:00 in the morning on September 29, 2011.  I was the only person in my house to see it see it, but I am reporting it in hopes that maybe someone else saw it too and can corroborate what I saw. Because I was a bit afraid of what I saw, I did take a picture. I just rushed my dog back in the house, locked my door, and got back in to bed close to my spouse. In retrospect I wish I would have taken a picture so that I would have some proof of what I saw, but the thing really creeped me out and I did not want to even look at it again. I live across the street from the beach. From my front yard, looking southwest, there was a big, bright light in the sky. The sky was very clear and the morning was very quiet.  The light I saw is the brightest thing I have ever seen, except for the sun. It was so bright and seemed to be bluish-white in color. It was brighter than the moon. I don’t think that it was as bright as the sun because it did not hurt my eyes to look at it. It wasn’t a glowing light and it wasn’t blurry, just clear and bright white light. The light did not move and distance or make any noise at all. The shape of the light was like a vertically-oriented oval. At one point the light shifted from being an oval shape to being a crescent shape and then back again to an oval or round shape. It appeared to be very large in the sky. From the ground it did not look as big as the moon, but it looked way bigger than stars or planes look. Because the light seems strange to me, I started trying to figure out what it was. I know that is was not the moon because it was too bright and didn’t have that glowing, reflective quality of the moon.  It also did not have any of the man-on-the- moon shapes on it.  It was just a solid bright light. I know it was not a helicopter because it did not make any noise or have to typical little lights that helicopters have. I know it was not a plane because it did not move or go anywhere.  I know it was not a street light because the lights in my neighborhood are orange colored and this was much higher. I know it was not a meteor because it did not move.  I know it was not a star because it was too big and because there is usually too much light pollution in Long Beach to really see starts clearly. I know it wasn’t a planet because it was too big.  I also know that I was not dreaming this because I stayed awake after putting my dog out.  I know it was not a blimp because it was vertic! ally oriented and did not move. I of course know it was not a bird because it was a bright light. I know it was not a flare because flares fall and leave a smoke trail that you can see in the dark.  I know it was not a firework, because it did not fall of make noise. And I know it was not a spotlight or lighthouse light because it was far too bright.  I know it was not from a boar because it was too high up in the sky.  I know it was not a light on a tall building because there are not any tall buildings over the ocean. Maybe this was a piece of the NASA space shuttle still falling down? I don't know.",
      "link": "http://www.nuforc.org/webreports/084/S84237.html",
      "state": "CA",
      "duration": "at least six minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3f3",
      "summary": "5 dull red lights in V formation cruising over the coast of Long Beach",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2011-08-07T00:00:00",
      "story": "5 dull red lights in V formation cruising over the coast of Long Beach I have been thinking about this for years and, due to some recent TV shows, I have decided I should report what I saw. The event occurred in either 1980 or 1981.  It has been so long ago I don't really remember.  I do know where I was living at that particular time so that is how I got the year.  I was also in the presence of a friend when the event occurred. It was sometime around the winter of 1980/81.  I was living in Belmont Shores California.  The evening was cold and very clear with an unusual amount of starts out.  A friend of mine and I decided to walk a couple of blocks down to the beach to look at the stars.  I'm not sure how long we were there when we saw the object. I first notice the lights in the South West.  The beach we were at faces South.  The object was actually 5 lights; I think.  They were in the formation of a gigantic \"V\".   My friend and I watched until we lost it in the bright lights of the Ports of Long Beach and Los Angeles.   We did not observe any type of body associated with the lights.  As we were watching we were screaming out for others to see but no one was around.  It must have been 10-15 seconds we watched.  I distinctly remember saying it wasn't making any noise because we could see commercial airplanes high up and hear their engines.  The lights were moving much faster than the aircraft but no noise and it seemed it was just lights.   What was really weird at the time is that the lights did not shine.  I never knew how to explain it but now I think they might have been like a LED light similar to the red ones indicating an electrical device is on. The only reason I am writing now is because I have recently seen a couple of UFO shows where people have seen the same thing we did.  The only difference is that we could not make out any shape or object and could only see the 5 lights. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82994.html",
      "state": "CA",
      "duration": "10-15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc6a7",
      "summary": "Bright green light over north Long Beach CA.",
      "city": "longbeach",
      "shape": "light",
      "date": "2011-08-21T00:00:00",
      "story": "Bright green light over north Long Beach CA. On Friday August 5, 2011, at approximately 10:15pm, my girlfriend and I were walking to our car after having dinner at ((name deleted)) Restaurant in Long Beach (XXXXX) East 2nd Street, Long Beach, CA 90803-5308)  As we were walking across the parking lot I noticed a bright green light moving in the sky. I thought it was a skyrocket at first so I kept looking at it, waiting for it to explode.  I was facing northeast. My girlfriend was right behind me but was fumbling with her purse, looking either for her phone or for cigarettes.  I can't remember which. Fireworks are a common sight during the summer in Southern California, and I thought this was part of a fireworks show being put on by an amusement park or maybe even the Orange County Fair.  But there was no explosion.  The bright green light appeared to just hover over North Long Beach. I should note that we were a few blocks from a south facing beach and that we were walking in an eastward direction through the parking lot.  The lights we saw did not appear directly above us but rather appeared about five or maybe even ten miles northeast of our location. The distance itself is a bit of a guess.  It was a clear night but I didn't notice any type of landmark that would help to determine how close or how far the lights really were, though it's possible that they were near the Long Beach Airport, as it is in the general direction of where we saw the lights. My girlfriend hadn’t noticed it yet so I asked her, \"Hey, what is that?\"   I pointed to the green light that I’d been observing and she thought it was a plane, but I pointed out to her that it couldn’t be a plane or helicopter because there were no blinking lights on this object.  It remained one solid color throughout the entire sighting, bright green. As we were watching this thing we could see that the normal air traffic one sees every night was still happening.  There were helicopters in the distance and we could see planes in the sky, probably making their way to Long Beach Airport or LAX. The other thing we noticed was that the green light was the brightest light in the sky at that time. We watched it move back and forth (east to west then back again) for a few minutes. It’s difficult to say how fast it was moving but I would say its speed seemed similar to that of a commercial airliner moving across the horizon. Approximately two minutes into the sighting we noticed a second bright green light appear below the first green light.  This light appeared to be west of the original light we’d spotted.  We didn’t notice any movement with the second light.  It appeared to just be hovering in the sky. The second light appeared in the sky for about thirty seconds and then vanished. After the second light had vanished we noticed a third light appear below the original bright green one.  This light was east of the green light and was red in color. This third light’s movement was similar to that of a helicopter.  I actually thought it was a helicopter at first but noticed that there were no blinking lights on that object either. The light was a solid red. No blinking or anything else that one would associate with a typical helicopter flying over a large city with an airport nearby. This red light moved faster than the first light we'd spotted.  Not freakishly fast but more like a helicopter than anything else.  It looked like it was moving toward the green light but then it stopped and appeared to just hover near where the green light was. At this point my girlfriend and I noticed that the bright green light we’d originally noticed looked like it was starting to fade.  It disappeared momentarily and then reappeared in the same spot we’d last seen it. As this was happening the red light began to fade and disappeared completely.  This left the green light as the only light we could see hovering in the sky. It remained in the sky for another twenty seconds (approx) until it too disappeared completely. Seconds after the lights vanished we noticed two helicopters flying (circling?) around the area where we had seen the three mystery lights. The entire sighting lasted about five or six minutes.",
      "link": "http://www.nuforc.org/webreports/083/S83004.html",
      "state": "CA",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc6d6",
      "summary": "V-formaton of 3 large crafts",
      "city": "longbeach",
      "shape": "formation",
      "date": "2011-12-17T00:00:00",
      "story": "V-formaton of 3 large crafts flying low and fast from northeast to southwest, v formation large crafts no noises. it was still light out approaching sunset.",
      "link": "http://www.nuforc.org/webreports/085/S85885.html",
      "state": "CA",
      "duration": "5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb42",
      "summary": "The Aircraft was a circle it white lights surrounding it with one on top of it.",
      "city": "longbeach",
      "shape": "cone",
      "date": "2011-08-07T00:00:00",
      "story": "The Aircraft was a circle it white lights surrounding it with one on top of it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  However, this may be a report from a young man, with whom we spoke over the telephone.  We requested a detailed report from him, and from his younger brother and grandmother.  We do not know what the witnesses observed, but based on their oral description, we wonder whether it might have been a model aircraft with LED lights on it.  Just a possibility, we feel.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82983.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd431",
      "summary": "Three disks stationary in a triangle formation during the day surrounded by a mirage effect seemingly caused by heat.",
      "city": "longbeach",
      "shape": "disk",
      "date": "",
      "story": "Three disks stationary in a triangle formation during the day surrounded by a mirage effect seemingly caused by heat. After listening to George Noory and Peter Davenport last  night encouraging listeners to report past UFO sightings, I finally felt compelled to tell my story.  I was 14 years old in the summer of 1957; a very hot day in Long Beach, California at about 3:00 p.m.. I was resting while sitting on my bike after I finished my daily paper route.  I looked almost straight up and saw three disks in a close triangle formation, metallic silver or shiny aluminum colored. They were not moving. Although the sky was clear blue, the air around the formation shimmered, much as you would see the mirage effect in the distance on a hot highway.  I watched them for a moment, trying to figure out what I was seeing, Seconds later, all three disks went straight up very quickly in formation and disappeared. The mirage effect lingred in the sky for a few seconds after the disks were not visible.  I have not told this to anyone, even my parents. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89857.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd766",
      "summary": "Aircraft with white flashing headlights, no other lights, no discernible sound",
      "city": "longbeach",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Aircraft with white flashing headlights, no other lights, no discernible sound Okay, this starts out as a pretty boring story, but bear with me – it has an interesting ending. I was standing in our driveway stargazing as I often do. The sky was mostly clear. We're 4 miles south of Long Beach Airport, and the sky was busy as usual with air traffic. One plane caught my attention as it flew south toward the general area of downtown Long Beach about 3 or 4 miles to my west. The only light I could make out was a bright white headlight that flashed every second-and-a-half to 2 seconds. When it reached my latitude, it banked east toward me. Now I could make out 2 white headlights which continued flashing in unison at the same interval. No green lights. No red lights. No other lights. Just 2 flashing white headlights.  It was much higher than the altitude police helicopters fly. The 2 lights were about a pinky width at arm's length apart. At this point I was figuring that it was a plane, and that there was a logical explanation for the missing identification lights. So I took a look at it through my binoculars, and I could make out 2 lights, but before I could bring it in focus it vanished. So then I looked without my binoculars, and after about 4 seconds it flashed once or twice more and then it vanished altogether.  The sky was clear. I watched for about 10 seconds.  By this time there was a tree blocking my view of where it would be if the plane reappeared, but I was satisfied at that point that it was gone, and that it was a plane with malfunctioning lights or maybe something else.  As for its sound, there were several planes in the area at the time and to tell you the truth I wasn’t even focusing on its sound, but I don’t remember any sound coming from it. So I’m not 100% sure. If it made a sound, it didn’t stand out.  So I spent the next 15 seconds watching planes, just kind of looking around, and then ! I surveyed the area right above me. Okay, now here’s where it gets weird. The plane reappears flying the opposite direction. At least I assume it was the same plane. Same size, same 2 flashing white headlights.  I had never seen a plane with that light configuration (I’m 56), so logic told me it was the same aircraft. Then about 2 flash sequences later, when it was directly overhead, poof! Gone. In all my years of stargazing, I’ve never seen a plane make a 180 degree turn in 15 seconds and then disappear.  So I thought that was a little strange. In the next hour, I saw 2 unusual aircraft, or maybe it was the same aircraft, in the north sky from around Cassiopeia westward.  The first of these 2 sightings began as a flash of white light, like a star, in the constellation Cassiopeia. I could make out a dark object either losing altitude or flying NE which flashed again about 3 seconds after the first flash. Then about 3 seconds later it flashed again, and then I lost it behind trees.  It travelled about a width of my fist at arm length between flashes. Then about 15 minutes later, an aircraft with the same description appeared in the NW flying south about 2 miles to my west.  It flashed twice, about a 3 second interval, and sometime before the third flash it turned east and flashed about 2 or 3 more times at 3 second intervals and then it vanished. As for sounds, again there were planes in the area but I can’t remember any sound coming from them. So if they made a noise, it didn’t stand out.  When it was flying east to west, it looked to be about a mile to my north.  Neither of the aircraft appeared to be much more than a thousand feet high. These sightings happened 5 nights ago. I’ve been watching the skies almost every night since and I haven’t seen anything out of the ordinary, just the usual planes and helicopters.  And I had never seen anything like that in my life prior to that night. ((ADDENDUM TO ORIGINAL REPORT)) Aircraft with white flashing headlights, no other lights, no discernible sound This is a correction to the report I submitted Sunday, October 14, 2012 at 00:51:43  Near the end of my report, it should read:  When it was flying west to east, it looked to be about a mile to my north. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/093/S93550.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd8a7",
      "summary": "Orange Sphere dripping &quot;embers&quot;",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2012-07-04T00:00:00",
      "story": "Orange Sphere dripping &quot;embers&quot; My boyfriend and I saw an unidentified flying object on approximately January 21, 2012 at around 12:30 p.m. in Long Beach, CA. We were in the car traveling west on along 7th Street and directly ahead, a large very bright orange globe was in the sky about as high as a helicopter and hovering in one place. It was not a helicopter. I continued to watch it as we turned North on Long Beach Blvd. and it was still visible as we stopped at a Chevron Gas Station on the Corner of Long Beach Blvd. and PCH. As we got out of the car I continued to watch it as my boyfriend pumped gas. Then all of a sudden, about 3 smaller orange lights “fell” from the large orange globe. (Unsure if the falling lights were other craft or not.) I exclaimed in surprise to my boyfriend and he came over to watch. Then another several lights fell from it again, bringing to mind an image of embers falling or liquid metal dripping as the smaller lights fell and faded as they fell below our line of vision. Then the main orange orb disappeared. It did not fade into the distance as a plane would. It was just GONE. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89826.html",
      "state": "CA",
      "duration": "15-20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb82",
      "summary": "2 white star-like objects moving in tandem, synchronized turn, no plane lights",
      "city": "longbeach",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "2 white star-like objects moving in tandem, synchronized turn, no plane lights Once in a while I like to sit in the back yard and gaze at the stars.  Tonight was one such night.  To the south I saw what I thought might be the Pleiades, but after my son and I examined it through binoculars, we could see that it was a single star. Remembering that the Pleiades was higher in the sky, we walked around to the front of the house where we had a wider view of the sky, and as soon as I started searching for the star cluster, a bright white light suddenly appeared high in the southern sky.  My son saw it, too. It lasted for about a second or two, and got about as bright as Venus gets when it’s at its brightest before it faded. I quickly grabbed my binoculars which were hanging from my neck and focused on the area where we saw the bright light. My son was also searching the area.  Then both of us noticed that there were two star-like objects moving vertically in tandem, pretty much due north, about two thumb widths apart, arms fully extended (my son later told me).  They maintained precisely the same distance apart.  As I was tracking them with my binoculars, I was explaining to my son that they were probably satellites because the lights weren’t blinking and they were moving about the right speed for satellites, although I was thinking that they were moving a tad too fast to be satellites.  But that seemed like the most logical explanation. Then he asked me why there would be two satellites, and while I was thinking of an explanation, the two objects suddenly banked about ten degrees to the east, still moving north.  They started the turn at precisely the same moment.  It wasn’t a sharp-cornered turn, but the radius was fairly tight.  What amazed me was how precisely they maintained their distance apart.  Then we both lost them around the constellation Cygnus.  My son later told me that the trailing object was the one that got bright. One explanation is that they were military jets, and the bright light was one of the jets reflecting the sun which had set three hours earlier.  And I suppose that the pilots could have been able to maintain a precise distance apart.  What didn’t seem right, though, is that they didn’t have any blinking or colored lights. They were single white lights, like medium-faint stars. I’m 55, amateur astronomer, been sky-gazing since I was a kid, and besides one strange object I witnessed from a plane a few years ago, which I reported here (it’s possible it may have been a Mylar balloon), I’ve always been able to explain everything I’ve seen.  Although the best explanation might be that they were military jets, the absence of blinking or colored lights or contrails (we couldn’t hear any engines, either, but they seemed to be way up there and we wouldn’t necessarily have heard them) seems to place that theory in question.  And I don’t have any other explanation.",
      "link": "http://www.nuforc.org/webreports/091/S91075.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be04a",
      "summary": "Flaming/Sparkling trails with following helicopter over Long Beach, CA",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2012-11-19T00:00:00",
      "story": "Flaming/Sparkling trails with following helicopter over Long Beach, CA It was approximately 8pm, my wife and I were in the parking lot of a local CVS about a mile inland, and in the southern sky, likely just past the port of Long Beach were (2) flaming/sparking objects flying around criss crossing each other.  They were moving slower than planes would move and in a very unusual manner, snaking left and right and crossing back and forth. Each one had a solid goldish colored light that would stay on the entire time, as well as a trail that looked like a comets trails.  Almost like a giant sparkler had been lit and was flying through the sky.  The sparkling trail would come on for roughly 10 seconds and then go out on each one.  This happened for about 2 minutes as the objects continued to fly south until both the solid gold light and the sparkling trail of each of the two extinguished. For the entire incident we could see a helicopter a few miles away to the north which appeared to be following the objects, and continued to follow them south until all 3 craft were out of sight. I spent all night trying to think of what the objects might be as well as search the internet and it appears others saw similar craft, but within the last week.",
      "link": "http://www.nuforc.org/webreports/094/S94568.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be04b",
      "summary": "Long Beach California November 16, 2012, appeared to be 2 large comets or fireballs over ocean.",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2012-11-19T00:00:00",
      "story": "Long Beach California November 16, 2012, appeared to be 2 large comets or fireballs over ocean. Just saw 2 big objects in sky over ocean in Long Beach California. They looked just like comets except very big and very close.  Flying in odd patterns.  It really looked like falling stars to me, except very big and very close.",
      "link": "http://www.nuforc.org/webreports/094/S94537.html",
      "state": "CA",
      "duration": "10 seconds?"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0eb",
      "summary": "I still have trouble believing this myself.",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "I still have trouble believing this myself While driving north along the western boarder of a city park near our house, we saw an object that was completely unidentifiable.   I was seated in the passenger seat and had a relatively unobstructed view.  The object sat motionless in the east.  It seemed to be an orb of yellow/orangish light but the color was somewhat muted, similar to the way a Chinese lantern looks.   We could clearly see the stars in the background and trees in the foreground.   We made a right turn and travelled by the object along the northern portion of the park.  This revealed the objects proximity and elevation, to a certain extent.  It was silent, motionless, and the l light intensity remained perfectly constant for nearly a minute. ...weird. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98575.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf96c",
      "summary": "White round object seen in Long Beach, California.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2013-07-03T00:00:00",
      "story": "White round object seen in Long Beach, California Around 22:15 Pacific time, I was at home with my family, and my sister was looking out the dining room window when she noticed a circular, white object in the sky.  She turned around and called me over to see it but by the time i got there, it was gone.  I then began to ask her questions. The first question I asked was what it looked like.  She described it as a white circlular object. She said it looked like a full moon, but smaller.  She told me it was no star. It couldnt have disappeard like that if it were any planet. I then began to do some research right away.  I looked for ufo sighting with in the same city and the same month.  I then came across a video of a sighting in my city that happened 4 days prior to today.  I showed my sister the video and she said it looked exactly like the one she saw. My heart literally sunk thats when i knew i had to report it.  I need answers.  I want to know what is going on.  I just think it's very frightening because the same object was seen in the same city and state 4 days earlier.",
      "link": "http://www.nuforc.org/webreports/098/S98760.html",
      "state": "CA",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd8b",
      "summary": "Multiple red/orange orbs forming triangle and hovered slowly.",
      "city": "longbeach",
      "shape": "formation",
      "date": "2013-02-04T00:00:00",
      "story": "Multiple red/orange orbs forming triangle and hovered slowly. There were around 9 red/orange orbs sort of combining together forming a triangle, then a few just hovered around the formation.  They dissipated as they headed north, right next to the 405 freeway.",
      "link": "http://www.nuforc.org/webreports/095/S95688.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c03e5",
      "summary": "Orange light slowly moving through sky then disappearing",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2013-04-12T00:00:00",
      "story": "Orange light slowly moving through sky then disappearing Saw an orange glowing light in the sky northeast of Long Beach.  Light appeared to move upward (relatively from observing position) then dim and slowly move downward.   Eventually disappeared, followed by another light that had the same pattern.   Was much brighter than other aircraft in the sky (helicopters and planes).  Most closely resembled a spotlight shining down or an orange flare. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96602.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c061d",
      "summary": "3 Whitish-yellow lights in the shape of a triangle at 1st glance i thought it was a shooting star but it kept going fast and silent.",
      "city": "longbeach",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "3 Whitish -yellow lights in the shape of a triangle at 1st glance i thought it was a shooting star but it kept going fast and silent. At approximately 11:40 pm I thought I was seeing a shooting star. It was not because it kept going and it wasn't bright enough.  It looked like 3 whitish -yellow lights.  I now realize that they were dim because it was so far away.  It was moving fast and it was silent.  These lights were some kind of craft. I have never seen anything like it before in my life. I am 44 years old and I have seen ufo's on two other occasions.  One here in long beach and one in upstate New York. There were no flashing or blinking lights like an airplane has and the lights were like the color of a light amber.  This ufo that I saw was far away it was in space.  I was very lucky to look up when I did.  This wasn't some close encounters of the 3rd kind or anything but it was a ufo.  The way it looked and the silence.  The 3 lights were in the shape of a triangle.   I am sitting outside hoping to see it again but it's too cold.  I'm going in the house.",
      "link": "http://www.nuforc.org/webreports/096/S96126.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c06c5",
      "summary": "Reddish orange ovalish objects. silent. moving up fro behind a big church and then moving north west.",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "Redish orange ovalish objects. silent. moving up fro behind a big church and then moving north west I went outside at 4:00 am because my husband was yelling at me to get outside.  I saw 3-4 oval in shape but a reddish orange color ufo's in the sky.  The glow was more like the light a candle would put off but of course much larger but that kind of a glow not like the light from a headlight or electric light bulb.  There is a large church a block to the east of me.  The church has a large steeple. the objectscame up from behind the church straight up and then moved at a slowish speed up about what I would say is maybe a half a mile and moved in a north west direction.  The objects came up one at a time and followed the exact pattern of the craft in front of it.   They stopped overhead of us and they just sat in the sky for several minutes.  Then they disappeared one at a time. the first one up dissapearing first then the second and then the third and so on.  If I had to compare the size I would say about the size of a vw bug.  It's hard to say because of the distance and the bright glow and of course I was very excited.   I was waving my arms at them and there was just one left in the sky and just before it disappered it flashed. and my husband/ boyfriend said wow it flashed at you.  I was so tripping on it .  I tell you,  it was great. There is no way this was a lantern or anything like that. the movments were percise and intentional.  There was no sound from these crafts at all. silent.  It was raining outside not very hard at the time.",
      "link": "http://www.nuforc.org/webreports/095/S95304.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1284",
      "summary": "LONG BEACH, CA.. interacted with a UFO while stargazing and using a Green high output laser beam.",
      "city": "longbeach",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "LONG BEACH, CA.. interacted with a UFO while stargazing and using a Green high output laser beam. so i was star gazing in my back yard as i normally do and i come across a star i think is moving that may just be a.  i recently purchased a green laser which emits a visible beam 5miles, like what you see in the military.  i come across what i think is a satellite . so i point my laser at it and it seems to have moved away from it,  i thought i was tripping or maybe had shaky hands so i position myself against my step fathers truck to get a posture while pointing and using my 2 hands instead of one. Here comes the crazy part.  As i start pointing my laser at this object i notice that it is moving and not moving in a single direction as you would see with a satellite.  this thing starts moving left, right, side to side almost trying get out of my beam as i point at it, i do this for about 2 mins until i start feeling like i should tell some one but know one at my home was home and nor where any of my neighbors in their backyards . So what do i do ? well, i thought since i am seeing this and i cant tell know one nor video tape it i get the idea to start circling the object as to attract people to looking at it instead of me pointing a laser directly on it.  i want to add that this idea came because i live along side the 710 fwy and i know for a fact people can see my beam from far so i new i can maybe get some people in traffic to see it and i hopefully was successful with that cause what happen next gave me the chills up and down my spine and i still have the chills as i write this. also i want to add that this isn't the first time i seen something i cant identify, but it is the first time i ever interacted with one . As i start circling the object it get more aggressive to moving away from the light as if knowing i am circling it and in doing so giving up its position , i continue to do so and it keeps trying get out of the circle i put it in, i then notice that when ever the beam would be in front of its direction it will quickly move away from it as if it was scared of crossing it as weird as it sounds.  i know this wasn't a satellite nor a plan cause planes cant move that fast nor in the aggressive manner this object moved.  I then start to notice that this object is positioning itself over my house , pretty much right over me so at this point i am pointing straight up with my neck looking straight up to the point my neck hurts . i got kinda freaked out at that point even more and start thinking about all abduction movies and thinking maybe this thing is position itself over me to know my location, i don't know but it really freaked me out . now my laser starts dying which emits a le! ss visible beam that can bee seen , at this same time i notice the object starts to also fade but still remains over what looks to me like its directly over me but just in the heavens with the stars pretty much hanging out flying around. my laser then dies and honestly i felt alone at that moment cause i was in complete darkness and it hit me that what i was seeing was real and was interacting with me and my laser beam . i stare at it for a couple mins more , noticing that its not really moving anymore but staying directly above me where it positioned itself in the heavens.  my lasers off,i am in darkness, i start getting more freaked out thinking that maybe its gonna get me , beam me up , i just start thinking of all the movies i seen with people interacting with ufo's which never end well. i wont lie i start feeling fear in me and something telling me go inside the house and recharge my laser. i do so , and decide to report for the first time an experience i have with a ufo that to me is the scariest encounter i have ever had the privilege of seeing . since a kid i have star gazed, i am 29. i have seen many weird things in the skies i cant explain to this day which i am sure allot of people have seen things many times also if they star gaze frequently thru their life . what i saw was real and i really cant explain any more into detail about it but what i explained . i haven't gone back outside my house yet and do plan to after i finish this sighting description . honestly i am kinda scared to go back out and look at the sky and or see if its s! till in the same spot but i am only because of my curiosity and faith that nothing bad will happen to me .  it looked exactly like a dim star or satellite that moves in a single continues lane that many people i am sure have seen . it didn't make any different colors it just stayed white like the stars , it moved quick, it moved away from my laser as if it were scared of it or didn't want to be seen or pointed out. i don't know what it was but know it wasn't a plane . i really wish i had someone over tonight to be my witness . i actually bought the laser because i would frequently see things through out my life in the skies, that i just wanted to finally point them out when star gazing and hopefully show other people . sadly i was alone and still am , my report is done and i hope who ever reads this maybe gets the same idea with the laser pointer and or someone saw a green beam pointing along the 710 fwy at an object moving away from my beam in the skies high above the heavens , at 9:00 pm . this is is not a hoax. hopefully some one has seen something similar or interacted with a ! ufo as i have with a high output green laser beam .",
      "link": "http://www.nuforc.org/webreports/106/S106050.html",
      "state": "CA",
      "duration": "7:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c134b",
      "summary": "Witnessed two objects in sky during two different occasions flying unnaturally.",
      "city": "longbeach",
      "shape": "disk",
      "date": "2013-11-20T00:00:00",
      "story": "Witnessed two objects in sky during two different occasions flying unnaturally. Firs: Father driving me to my university (CSULB) when we noticed an object in the sky.  Object stayed stationary and began to move in various directions (Ex.back and fourth. We drove ahead and object appeared to move far away in choppy movements. Second:  After witnessing the first, we began entering my university's parking lot, we noticed another object in the sky and this time much closer.  Surprisingly the object seemed metallic since it reflected the sun.  We passed a few buildings/tress and the object just disappeared.  This objected appeared stationary before its disappearance. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104394.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c185c",
      "summary": "Fireball appears streaking from nowhere; starts to smoke stops then disappear, leaving the the short exhaust  trail.",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2014-07-20T00:00:00",
      "story": "File ball apears streaking from nowhere  starts to smoke stops then disapear leaving the the short  exhaust  trail ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111426.html",
      "state": "NY",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2367",
      "summary": "Motionless silver triangle high in the atmosphere.",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2014-04-04T00:00:00",
      "story": "Motionless silver triangle high in the atmosphere. Saw something strange the other day while standing in my driveway.  A friend of my son's had stopped by to see him, however he wasn't home and his friend and I began talking about U.F.O.'s/aliens.  She brought up the subject out of the blue which is even stranger since I had never met her before until that moment.   I looked up in the sky while we were talking and saw a silver triangle high up in the atmosphere.  I suppose you could say it was the size of a penny considering the distance.  I pointed up toward the sky and said: \"What's that?'  She looked up and said she didn't know__then this object 'faded' out.   Further away from where this object appeared, a jet was passing. I wonder if anyone on this jet saw what we did? Guess this is another mystery we'll never find the answer to.   The sky was cloudy that day so I don't know if it just 'disappeared'' or if the cloud cover was the reason it faded.  Nevertheless it wasn't another jet because it was motionless.",
      "link": "http://www.nuforc.org/webreports/108/S108268.html",
      "state": "MS",
      "duration": "~10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2477",
      "summary": "06/14/14 Strange light, amazing speed, changed locations",
      "city": "longbeach",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "06/14/14 Strange light, amazing speed, changed locations Approx. 10:30 in the eve I stepped outside to smoke a cigarette, I normally see air traffic from the airport and view the skies often, this eve I was looking up toward the ocean beach are and noticed an odd light, it wasn't a helicopter or plane of any type. What brought my attention, it was abnormal in color and flickering and standing still just above the horizon. I watched for a few moments then at an unbelievable speed it zipped to the left and stopped, I knew because of the speed it moved it was something to watch. it sat there for a few moments then zipped again this time towards my location, that's when I thought to myself this thing has amazing speed, then all of a sudden it zipped up at an angle again towards my location traveling so fast it disappeared to what must have been the upper atmosphere, it wasn't falling it was climbing at such a speed, that nothing I have ever seen before compared to it. Then 2 days later the local news stations reported! UFO's spotted on or around that same time frame",
      "link": "http://www.nuforc.org/webreports/114/S114642.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c272a",
      "summary": "I observed a bright yellow orange fireball with red tinge traveling from the northeast to the southwest.",
      "city": "longbeach",
      "shape": "changing",
      "date": "2014-10-10T00:00:00",
      "story": "I observed a bright yellow orange fireball with red tinge traveling from the northeast to the southwest. I walked out into my backyard and I looked up to the east to see a bright yellow orange fireball with red tinge traveling from the northeast to the southwest at a moderate speed in relation to its size and distance from my standpoint. I witnessed the object for 25 to 30 seconds. The fireball then flickered out to reveal a white pulsating light on a dark metal looking object which flashed 3 times and then extinguished all while the object turned course toward the south east and  appeared to accelerate at a high rate of speed. I thought what I was looking at could possibly have been Chinese lantern but there were no real true signs of fire and the lantern would have been traveling against any wind currents present from the south.  Also, when the object burnt out, it did not fall to earth but accelerated away holding its altitude until it disappeared out of view just as an aircraft in level flight would. I attempted to video the object with the camera on my pho! ne for about 20 seconds zooming in on the object at the midpoint of the filming. The video actually recorded was only two seconds.  I was able to get a few good stills out of the 2 seconds of video that I did capture. I have witnessed the approaching fire ball which seems to drop its cargo and run once before on 09/30/09 at around 22:50 hours. The first sighting was far more dramatic and I had two witnesses with me who to this day, still do not believe what they saw.",
      "link": "http://www.nuforc.org/webreports/114/S114291.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e5e",
      "summary": "Morphing objects playing with lights over Los Angeles orange county.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2014-08-29T00:00:00",
      "story": "Morphing objects playing with lights over Los Angeles orange county Looking south east at night over towards Huntington beach.. I'm on the roof at 6 th floor level. The big balls or round objects were not much higher in the sky.. Not much neck strain! I first saw two yellowish light orangish objects side by side... They then moved above and below each other. That was about five minutes in the first position. After they formed above and below, another same looking object appeared to the right of the two above and below two! Now there was three. The new third object split and become two..  Now there was four in total. The two newer ones also changed position and were disappearing and reappearing as well as the two others. One would fade then come back on..  This went on for a half hour. The four objects joined to make a side by side symmetrical formation one above and one below it was like a mirror image of each other. Then two disappeared two stayed for a half hour then disappeared  They were huge.  Never in 17 years have I seen such big objects and I always sky view!  Not sure if it was a huge singular ship doing a light sow or four separate objects!  Thank you",
      "link": "http://www.nuforc.org/webreports/112/S112910.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c326c",
      "summary": "A black rectangular object was seen in the NE direction from Long Beach, CA.",
      "city": "longbeach",
      "shape": "rectangle",
      "date": "2015-03-13T00:00:00",
      "story": "A black rectangular object was seen in the NE direction from Long Beach CA. From a Long Beach office on the fourth floor, looking in the NE direction, my co-worker and I saw a black rectangular object.  It was moving in an east to west direction.  It turned in such a way that it seemed to have disappeared. It reappeared for a moment heading in the opposite direction.  It made one last turn where it seemed to disappear again.  I estimate it was over the cities of Covina or San Dimas.",
      "link": "http://www.nuforc.org/webreports/117/S117627.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c339d",
      "summary": "Loud military jet precedes 2 fast-moving yellow-orange orbs.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2015-03-26T00:00:00",
      "story": "Loud military jet precedes 2 fast-moving yellow-orange orbs My wife and I had a spectacular UFO sighting tonight. We were all settled in for an episode of Vice (HBO), when I heard a loud whoosh, but I thought it was part of the soundtrack of Vice.  My wife exclaimed, \"What the hell was that?\" So she's looking out the window behind the couch explaining to me that the sound was coming from outside.  I followed her as she dashed out the front door. I could still hear the trademark military jet-type whooshing sound in the distance.  It's sort of an irregular pulsating whoosh that starts suddenly and ends as suddenly as it started, and then repeats that maybe five or six times afterwards, the sound fading off. So we're standing out front looking at the cloudless sky, and I'm telling her \"You know, sometimes when military jets are sent low over areas they don't usually don't fly over, it means there was a UFO spotted in the area.\"  And not 30 seconds later, out of my left eye I see a light-orange-yellow spherical-shaped light moving NNE to SSW high in the SSW sky moving SSW through the constellation Orion.   About a second later, as I'm alerting my wife to what I'm seeing, a second light that looked just like the first light appeared about 3\" at arm's length to the west, moving exactly parallel with the first light.  A second later, the second light faded out, and the first light continued on with its SSW trajectory a couple more seconds and quickly faded out. I've seen probably 100 meteors, including 2 fireballs, 6 or so comets, satellites.  And I've seen some unidentified stuff, too.  But this was by far my most spectacular and unusual sighting.  I'm 58. They moved slower than a meteor but much faster than any jet I've seen at that apparent distance. We both got the sense that the lights were at least 10,000 feet up. They certainly weren't real close. I got a real good look at the lights.  They weren't steady, like light bulbs. Nor did they strobe.  They were distinctly round, but diffuse, and they gave the appearance that they were moving behind a sheet of water, or slightly translucent film with an irregular surface. At the point of fade they were maybe 40% of the diameter of a full Moon. Some years ago when I spent a lot of time during the day at home, quite a few times I'd hear the same identical sound of a military jet overhead or nearby.  They're tremendously loud.  Only once did I catch a glimpse of it.  It was flying north to south towards or maybe past downtown Long Beach, which is due west.  I didn't know about the UFO connection back then.  I wonder if some (all?) of those incidents were UFO related. By far the most unusual \"object\" I've ever seen in the sky. And I kinda-sorta predicted it.  ;) ((ADDENUM FROM WITNESS)) This is a better and more detailed synopsis than the one I submitted to NUFORC a little while ago.    *** On the evening of March 20th, my wife and I had an incredible UFO sighting that I posted about here. Last night we had another UFO sighting.  Same part of the sky - south of Long Beach, CA over the Pacific. At about 10:05 PM, I went outside to sky-gaze as I often do.  It was fairly overcast.  The Moon, which sat high in the WSW sky, was shrouded by the low clouds and cast a diffuse glow.  A couple of minutes later, due south and about 30 degrees above the horizon, another diffuse light appeared behind the clouds.  It was white and looked similar to how the Moon looked, but not as diffuse.  It gradually grew brighter, and as it did, two other similar looking diffuse white circles of light appeared, forming an equilateral triangle.  They were all about a third to half the diameter of a full Moon and two to three finger widths apart at arm's length.  At this point I yelled for my wife, called her on my cell, and knocked on the pane glass living room window to get her attention.  She came running out with her i-phone and saw the triangular formation just before it faded out.  As those three lights faded out, a brighter light appeared in between where the other three lights were, and grew brighter, casting a bright glow against the surrounding clouds.  We could make out a fairly well-defined bright star-like light at the center and the surrounding glow it cast was about three-quarters the diameter of a full Moon.  She managed to catch that final light on video before it faded about 30 seconds later.  All of these lights were perfectly stationary. I stayed out for another hour, but I didn't see any more. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/117/S117950.html",
      "state": "CA",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c34af",
      "summary": "Independence Day in Long Beach, CA.",
      "city": "longbeach",
      "shape": "disk",
      "date": "2015-01-26T00:00:00",
      "story": "Independence Day in LongBeach Ca. As I was driving South.  On Paramount Blvd, I was distracted by a strange looking object in the air.  When I arived at the corner of Paramount and Market St.  In the city of North Long Beach Ca. The best discription that I can give, is that it looked not much diffrent than the vessels portrayed in the movie INDEPENDENCE DAY.  Staring Will Smith.  But much smaller.  The ones in the movie that hovered over the cities. So, I pulled over to look and video this vessel with my cell phone.  It did not move but a little. it kind of bobbled very slightly.  I did not hear any sounds from this ship.  All I could pick up in my camara view is the lights flickering. I did not stay to see the outcome of the event.  Because I thought that I could get a better view from my up stairs window.  Since I lived about a half mile away.  Which would I figured would have put me in a direct line of site with the vessel.",
      "link": "http://www.nuforc.org/webreports/116/S116819.html",
      "state": "CA",
      "duration": "17 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a74",
      "summary": "Walking and saw it over the ocean fixed then they were gone at once.",
      "city": "longbeach",
      "shape": "triangle",
      "date": "2015-08-06T00:00:00",
      "story": "Walking and saw it over the ocean fixed then they were gone at once. ((ADDENDUM FROM WITNESS)) I was waking from my house to Ralph's ices about 1/3 mile from my house with my 3 cousins on beech street when we stopped to look at 2 fixated lights hovering over the ocean.  They were horizontal and triangular, and appeared to me to be at least 1/8 over the oceanfront part of the  beech given my proximity.  They never moved. . 40 seconds from the time I decided to film it.  I snapped one shot across the street, and one  second before I confirmed what my first thought was. I was  perhaps 2 blocks from the ocean on beech st on and fumbled for video mode.  I was able to get the  .40 second shot before I saw a direct plane or such pale out or muffle my video.   The occurance of moment left us perplexed  discussing coincidence and chance ...  After the fact.  One of my troupe who is witness is an actuary and is perhaps the best possible person I would have as witness testify On behalf my/our claim.  ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/120/S120777.html",
      "state": "NY",
      "duration": ".67"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c33",
      "summary": "Double egg shape with gold like mid section.  ((NUFORC Note:  Image in video looks to us to be a jet aircraft, at mid altitude.  PD))",
      "city": "longbeach",
      "shape": "egg",
      "date": "2015-07-03T00:00:00",
      "story": "Double egg shape with gold like mid section. Seen a strange flying/floating object.  I'm used to airplanes flying around here but this was different. It moved very slow.  It looked like two eggs separated by a gold mid section. I wasn't sure what it was so I did take a video. ((NUFORC Note:  Image in video looks to us to be a jet aircraft, at mid altitude.  We have corrected the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119753.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c34",
      "summary": "White double egg like shaped object with a gold midsection.",
      "city": "longbeach",
      "shape": "",
      "date": "2015-07-03T00:00:00",
      "story": "White double egg like shaped object with a gold midsection. A low flying object was floating northbound along the Los Angeles River in Long Beach California. I could only describe the features an white egg shape in the front, a gold color midsection, and white Egg shape rear. I took a video to watch later.  When I viewed it, I knew it was not normal from the way it reversed slightly, before continuing the original path.  I feel whatever I was recording knew I was. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119781.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d33",
      "summary": "Equilateral triangle of diffuse, stationary white lights off coast.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2015-07-03T00:00:00",
      "story": "Equilateral triangle of diffuse, stationary white lights off coast On the evening of March 20th, my wife and I had an incredible UFO sighting that I posted about here. Last night we had another UFO sighting.  Same part of the sky - south of Long Beach, CA, over the Pacific. At about 10:05 PM, I went outside to sky-gaze as I often do.  It was fairly overcast. The Moon, which sat high in the WSW sky, was shrouded by the low clouds and cast a diffuse glow.   A couple of minutes later, due south and about 30 degrees above the horizon, another diffuse light appeared behind the clouds.  It was white and looked similar to how the Moon looked, but it was a little smaller in diameter.  It gradually grew brighter, and as it did, two other similar looking diffuse white circles of light appeared, forming an equilateral triangle. At this point I yelled for my wife, called her on my cell, and knocked on the pane glass living room window to get her attention.  She came running out with her i-phone and saw the triangular formation just before it faded out.  As those three lights faded out, a brighter and less diffuse white light between where the other three lights were appeared and grew brighter, casting a bright glow against the surrounding clouds.  All of the lights were perfectly stationary.  She managed to catch that final light on video before it faded about 30 seconds later. All of these lights were perfectly stationary. I stayed out for another hour, but I didn't see any more.",
      "link": "http://www.nuforc.org/webreports/119/S119814.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e16",
      "summary": "7+ UFOs seen on KTLA News 5 weather video",
      "city": "longbeach",
      "shape": "oval",
      "date": "2015-07-03T00:00:00",
      "story": "7+ UFOs seen on KTLA News 5 weather video. While watching an article on news.yahoo.com about some unusual lighting strikes/weather in California, there are several lights in a grid formation in the clouds from time index 0:29 to 0:41 in the KTLA news video.  Refer to.... http://news.yahoo.com/video/unseasonable-thunderstorms-rain-expected-hit-124239590.html ((NUFORC Note:  We cannot rule out the possibility that the video may have been taken through a plate glass window, and that the lights in the video may be a reflection of ceiling lights behind the camera.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119930.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4205",
      "summary": "Cluster of orange lights in the western sky, toward NYC.",
      "city": "longbeach",
      "shape": "formation",
      "date": "2015-04-23T00:00:00",
      "story": "Cluster of orange lights in the western sky, toward NYC. To whom it may concern , on 4/13/15 looking south westerly around 9 pm at the night sky in Long Beach, NY, I witnessed a very spectacular unidentifiable event that I have never seen in my 48 yrs of life.   This was without question, something that must be from another world.  The orange lights looked as if it was a huge fountain of the largest fireworks ever that were stopped, (freeze framed) for 10-15 seconds.   Suddenly they started moving forming a not so perfect circle, then forming a v-shape, then a not so perfect line.  Then one by one disappeared.  I have never witnessed a ufo before but now I have.  I am true believer and their were several witnesses around me.   BTW, the Long Beach Herald investigated and assured that there were no Chinese lanterns sent up anywhere that night.  Even if there was, this way too far and were controlled.... ((ADDENDUM FROM WITNESS)) Yes Peter it was 100% the 14th. I just went back and checked my records because it was right after my coaches meeting.  Yes, you may use my videos just leave my full name out please. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/118/S118594.html",
      "state": "NY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c43c4",
      "summary": "Green/blue flash over the sky of Long Beach/Los Angeles.  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "longbeach",
      "shape": "unknown",
      "date": "2015-11-19T00:00:00",
      "story": "Green/blue flash over the sky of Long Beach/Los Angeles. Green/Blue flash over night sky of Los Angeles. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123755.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c43b8",
      "summary": "Brightest light in the western clear sky as big as the moon.  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "longbeach",
      "shape": "circle",
      "date": "2015-11-19T00:00:00",
      "story": "Brightest light in the western clear sky as big as the moon. ((NUFORC Note:  U. S. Navy missile launch.  PD)) On 11/07/2015 @ 18:10 in the western skies of southern California. I noticed a strange unusually , brightest light than anything normally seen in the skies. When I noticed it , I thought it as the moon, it was as big as the moon if not larger, it lasted for approx. 30-40 seconds before it faded from a dark sky blue to the normal shade of blue sky. When it disappeared it was as if it went behind a cloud but, there was no clouds in the sky at all. Very strange & weird! My roommate has a picture of the mysterious bright light. I will  share if interested contact me.",
      "link": "http://www.nuforc.org/webreports/123/S123605.html",
      "state": "CA",
      "duration": "30 seconds +"
    },
    {
      "_id": "64d005f478aba2ec5a3c4611",
      "summary": "A large orange flash light coming from the back ( maybe a propulser?) of an unknow flying object. Flash was then kind of absorbed back",
      "city": "longbeach",
      "shape": "unknown",
      "date": "2015-11-12T00:00:00",
      "story": "A large orange flash light coming from the back (maybe a propulser?) of an unknow flying object.  Flash was then kind of absorbed back into flying object.  A sphere-like bright white light ingolfed flying object then dim out and a bright lazer like blue/green flash of light came out of object that shortly after seemed to disappear in the distance.",
      "link": "http://www.nuforc.org/webreports/123/S123580.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c49da",
      "summary": "Last night my wife had noticed 3 flashes of lights with 2 consecutive split second flashes within one of each of those flashes. I know",
      "city": "longbeach",
      "shape": "flash",
      "date": "2015-10-16T00:00:00",
      "story": "Last night my wife had noticed 3 flashes of lights with 2 consecutive split second flashes within one of each of those flashes.  I know it was not lightening because the sky was very clear 10/14/15 night.   I went to work this morning and I noticed my co worker speaking about it and then my boss agreed to seeing those lights as well that night.   Not sure if anyone else noticed?",
      "link": "http://www.nuforc.org/webreports/122/S122842.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b1e",
      "summary": "2 blinking blue lights high in sky not moving. Then headed west extremely fast, stopped again then moved west.",
      "city": "longbeach",
      "shape": "light",
      "date": "2015-09-29T00:00:00",
      "story": "2 blinking blue lights high in sky not moving. Then headed west extremely fast, stopped again then moved west. I was looking at the moon, I noticed what looked liked 2 blinking blue lights high in the sky not moving, then it started moving east to west exteremly fast, it stopped again for a few seconds and then took off again moving west and was out of view in a couple seconds ..  It was over head then out of view in about 20 seconds.",
      "link": "http://www.nuforc.org/webreports/122/S122341.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b56",
      "summary": "High altitude bright white light strobe, multidirectional and stationary.",
      "city": "longbeach",
      "shape": "light",
      "date": "2015-10-02T00:00:00",
      "story": "High altitude bright white light strobe, multidirectional and stationary. Again tonight, saw a very high-altitude craft which presents a bright white light like a strobe every minute or so.  Moving about in the sky just north of me and eventually moved off north-east.  Slow strobe of white light approximately 2-3 seconds duration with magnitude similar to Jupiter.   Faster strobe follows in approximately 15 seconds after the first, is of less than 1/2 second duration and significantly brighter than the slow strobe.   This craft may remain in one position for a time or it may move in different directions.  I cannot tell if it is in our atmosphere or beyond.  It makes no sound.  I know of know aircraft, or space craft that behaves as this does.   Have been seeing this phenomenon for over 2 years now, every couple of months or so.",
      "link": "http://www.nuforc.org/webreports/122/S122452.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b82",
      "summary": "Two strange lights (similar to satellites) following eachother and varying in brightness.",
      "city": "longbeach",
      "shape": "formation",
      "date": "2015-08-27T00:00:00",
      "story": "Two strange lights (similar to satellites) following eachother and varying in brightness. We were stargazing and looking for meteors in the early morning hours.  We had seen a couple satellites pass over, when suddenly in the distance there were two lights that were very dim, then grew in brightness.  They moved like a satellite, as you could tell they were very far away, but they had no blinking lights of any kind.  I'm an avid stargazer and have no trouble whatsoever telling the difference between satellites and anything else.  They appeared in the north.  They were two lights, perfectly in sync, about a thumbs distance apart when you hold your arm out in front of you.  They were so synced I began to think it was part of the same object-if so, it would have had to be HUGE.  The leading light stayed the same amount of brightness for about 15 seconds, but the second light became VERY bright.  Easily the brightest thing in the sky.  The other two in my group all stood up to try to get a better view.  And the.  It was gone.  The second light went out completely! , and the first gradually dimmed until it was out of our field of view.  It was not an Iridium Flare, and two satellites do not follow that close together in perfect sync in orbit.  I've never seen anything like it, and stil can't figure out what it was.",
      "link": "http://www.nuforc.org/webreports/121/S121106.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c51e9",
      "summary": "Large bright orange circle, rapidly ascending from sea level straight up in to the stars.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2016-01-29T00:00:00",
      "story": "Large bright orange circle, rapidly ascending from sea level straight up in to the stars My condo is right on the beach.  From my window I can see out in to the ocean and the brightly lit loading docs just east of the Queen Mary.  Last night, approx 9:20pm PST, I was watching TV and noticed a bright orange circle from my window, moving towards me just above those loading docs. I looked closely to see if there were any flashing red or white safety lights (like normal man-made airplane) but it was just a solid orange light with somewhat of a fog around it.. (note the night sky was crystal clear a few minutes earlier).. and it was approaching me fast!  I grabbed my phone and BOLTED downstairs to the end of street (which sits right on the sand) to get a video.  By the time I got there, what was once just hundreds of feet away was now thousands of feet up and same altitude as other airplanes (which you could differentiate by the flashing white and red safety lights).  The bright orange light continued to to move southeast and vertical *extremely* fast towards the stars until it shifted direction, dropped down super fast then faded away. I captured the whole incident on video..  It's very obvious no man made craft can move that fast.   Video submitted to ufocntr@nwlink.com.  You can also see it here:  https://youtu.be/9754jYFGsEE  (hopefully link doesn't get removed)",
      "link": "http://www.nuforc.org/webreports/125/S125436.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c55b5",
      "summary": "Cluster of pulsing, shiny orbs viewed before sunset.",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2016-07-08T00:00:00",
      "story": "Cluster of pulsing, shiny orbs viewed before sunset. It was approx. 6:30 pm and we were sitting on our patio when we both spotted 2 shiny orbs traveling together, then three, four and then six all appeared to be pulsing a white light, they would cluster together closely, then a couple started moving away.  They seemed to get brighter and then fade, then brighter again, one moved away from the group but was still visible.  We watched them as they moved in different directions and at one point two of them seemed like they \" merged \", but then separated again.  After observing this for about 30 mins, they all just simply VANISHED all at the same time, as if someone turned off a switch.........they were there and then they were gone instantly.",
      "link": "http://www.nuforc.org/webreports/128/S128161.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5886",
      "summary": "Fireballs in the SoCal night sky.",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2016-06-10T00:00:00",
      "story": "Fireballs in the SoCal night sky. As seen from Long Beach, Ca 90804 looking NE on 6/7/16 between 21:38-21:41. Moving from the N.E. in the South direction, stalled out then moved directly East. These 2 objects both had nose profiles (aka wings) as a result of subsonic pressure coefficients.  From our vantage point, there was clearly fire engulfing these objects in our fist visible time frame. Once stalled, there was a direct turn to the East, fire subsided then object faded after an average of 15 seconds of flight time but was still visible with what could been taken as a very high altitude aircraft. Someone had to of seen these objects, and has photos, or an explanation of what they saw. I am looking for anyone that was on American Airlines 1116 flight out of LAX on 6/7/2016 as they had to of seen this from their flight..... There was an “U.F.O.” of sorts just off of your port side wing tip and above the aircraft.  AA1116 was passing thru 8000' at the time of the spotting.",
      "link": "http://www.nuforc.org/webreports/127/S127772.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a0f",
      "summary": "One orange/red stationary fireball like object in the sky looking south from Bixby Knolls area of Long Beach. ((anonymous rept.))",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2016-05-10T00:00:00",
      "story": "One orange/red stationary fireball like object in the sky looking south from Bixby Knolls area of Long Beach. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127260.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a2f",
      "summary": "Ball shaped, green fluorescent blob in Long Beach at the Pike.",
      "city": "longbeach",
      "shape": "",
      "date": "2016-04-29T00:00:00",
      "story": "Ball shaped, green fluorescent blob in Long Beach at the Pike. This was a ball shaped, fluorescent green light (about the size of a tennis ball).  It looked like it was liquid and I saw it roll down the inset corner (where two walls meet) of the Hyatt Hotel building  at the Pike.  It \"rolled\" down the outside of the building and I haven't seen it before or since then.  Did anyone else see it?",
      "link": "http://www.nuforc.org/webreports/126/S126988.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c600c",
      "summary": "Hovering flickering lights.  ((NUFORC Note:  We suspect \"twinkling\" stars.  PD))",
      "city": "longbeach",
      "shape": "light",
      "date": "2016-10-11T00:00:00",
      "story": "Hovering flickering lights. I went to close the back-door of the house and felt a random need to look outside as I closed the door as I've seen objects in the sky in the past at night, and sure enough, I see the lights I've seen countless times.  These very bright lights consist of a constant white dot with flickering red and green lights occurring very close to the white light.  The flickering is similar to seeing a single star that flickers at night.  All the lights are so bright as though you're staring into an LED bulb from afar.  These lights hover in one place and will slowly move up and down and side to side making figure \"8\" motions, sometimes moving horizontal and or vertical, and sometimes they will simply disappear as though someone turned off the switch.  I have been observing these lights since 2013 and they're consistent with their behavior.  I have nicknamed this phenomenon as the \"alien planet or Alien Star.\"  I have seen this happen countless times to the eastern horizon from Long Beach and Bolsa Chika State Beach, both in California.  The movement of the lights are so slow and smooth they cannot be a helicopter, and the lights are so bright and unique they're not a common known drone.",
      "link": "http://www.nuforc.org/webreports/130/S130483.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6117",
      "summary": "Hovering and flickering red and green lights.  ((NUFORC Note:  Sighting of \"twinkling\" star??  PD))",
      "city": "longbeach",
      "shape": "light",
      "date": "2016-10-11T00:00:00",
      "story": "Hovering and Flickering red and green lights. Looking South East I find my \"alien star\" I've been observing since 2013.  Normally this object has a constant white light for but this time just the flickering red and green lights were visible.  The lights appear to be a pet of a single object but the object cannot be seen.  The lights always hover and move around the same way a hovering bee or dragon fly would hover, very short but quick sudden movements, starting and stopping on a dime. ((NUFORC Note:  We suspect \"twinkling\" stars.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130482.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c612b",
      "summary": "Three very bright lights in triangle formation moving slowly across sky, slightly rotating in formation",
      "city": "longbeach",
      "shape": "formation",
      "date": "2016-09-30T00:00:00",
      "story": "Three very bright lights in triangle formation moving slowly across sky, slightly rotating in formation I was driving over what is known as Signal Hill, within the city limits of Long Beach, CA. I noticed a strange object with multiple lights blinking in sequence flying past about a quarter mile away.  As i proceeded over the top of the hill and began to drive down the other side I saw that it was suddenly at least 2-3 miles away but still shone very very bright.  About two blocks further down the hill i looked south and saw three VERY bright lights in an isoceles triangle formation.  I made a sudden Uturn to head back to higher ground and pulled over to take some pictures.  As minutes passed the lights moved across the horizon but stayed in the formation.  I then noticed as i scanned the skyline, of which i had about 180 degree field of vision i took notice of an inordinate amount of other aircraft and helicopters flying around rapidly.  From where i stood i could see clear for at least 20 miles. When i would unfocus my eyes on a darker area of the sky, other faint! lights throughout the sky became visible, some moving slowly, others staying in place.  After a few minutes i got back in the car to head home.  On the 10 minute drive from the hill to my house I saw four helicopters and what i belive to be a military jet, all moving quickly and at varying altitudes. I captured some very clear shots of what i saw and upon returning home pulled them up on my laptop to adjust contrast and other photo settings.  This revealed many more lights than i was aware of as well as showed that the three main lights I was trying to photograph were all in the shape of a triangle/delta.",
      "link": "http://www.nuforc.org/webreports/130/S130186.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6143",
      "summary": "Orange orb.",
      "city": "longbeach",
      "shape": "other",
      "date": "2016-09-22T00:00:00",
      "story": "Last night I saw a roundish orange light come up from the west behind our neighbor's tree.  It was probably 100-200 feet up and steadily moved horizontally to the southeast out over the ocean before it blinked out.  I got a good look at it through my binoculars.   Sad to say, I was disappointed; I immediately recognized it as some kind of lantern.  I saw a burning flame surrounded by an egg-shaped transparent \"plastic bag\" and I could even see a few strings dangling from the bottom.   I called my wife out to take a look at it and she reached the same verdict.  No other orbs followed. This is not to say that I think all orange orb sightings are lanterns.  There have been numerous truly puzzling orb sightings that don't seem to match the description of something that was human-made.",
      "link": "http://www.nuforc.org/webreports/130/S130004.html",
      "state": "CA",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c61c0",
      "summary": "Impossably fast moving light following plane and evading persuit.  ((anonymous report))",
      "city": "longbeach",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "Impossably fast moving light following plane and evading persuit. at approximately 5:00 am 5:10 am PDT I observed a bright white light over head at about 70 degrees south, south west moving erratically and periodically flashing on and off light. the object appeared to be right at or just above the atmosphere.  In the span of about 6in in my field of vision the object at extreme rate of speed traveled that distance and immediately stopped with out any distance to decelerate.  It did the several times over the course of the sighting. it moved in straight lines and in a tight circular motion and it appeared to hop like in motion quickly accelerating and stopping moving in a circular motion as well as quick straight lines.  At approximately 5:30 - 5:45 a high altitude aircraft traveling east passed by the object that was frozen in motion, after aircraft passed by the object it followed behind at about a half inch distance for 6-7in until the object broke away and traveled back to its original position.  Continued to move erratical! ly until 6:10 - 6:11 am it abruptly stopped and froze in place, when a second dimly lit smaller light quickly moved from the north to the south and met the first light and stopped at about 9 in away and moved from left to right maintaining the same distance away.  About 20 min later the second approaching object moved closer to the first. the first object quickly accelerated away and put about 12in of distance between them in an instant and then flashed out lights. they continued this same patter until I lost sight of both objects with the rising sun. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130214.html",
      "state": "CA",
      "duration": "~1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c654f",
      "summary": "Orange orb, then 22 minutes later, a blue light that disappeared in <2 seconds.",
      "city": "longbeach",
      "shape": "light",
      "date": "2016-08-19T00:00:00",
      "story": "Orange orb, then 22 minutes later, a blue light that disappeared in <2 seconds. An avid sky-watcher and amateur astronomer, I've seen meteors, fireballs, comets, and satellites, as well as things that are frequently reported as UFOs, such as aircraft, birds, bugs, and advertising lights.  I spend a lot of time sky-watching, and hadn't seen anything unusual in over a year, until last night. At 8:23PM, I noticed a bright glowing orange light a few degrees east of due north and about 20 degrees above the horizon.  At first I thought it was a plane, because it seemed to be near Long Beach International Airport, but the color wasn't typical of aircraft lights.  Through my binoculars, it looked slightly vertically elongated, as opposed to round.  I noticed no other lights on it.   I also couldn't bring it into focus and the upper portion was fuzzier than the bottom portion.  It slowly moved upwards and then slightly eastward, and then it moved slightly erratically and quickly faded out without a trace.  Having read numerous reports about the propensity of orange orbs to travel in groups, I watched for more, but no more appeared. Then, at about 8:45 PM, I was looking towards the SSE at a light that was probably a high altitude jet, and in the same general area a bright blue light appeared about 20 degrees above the horizon.  It was about as bright as Venus when it's at its brightest.  Then less than two seconds later it disappeared without a trace.",
      "link": "http://www.nuforc.org/webreports/129/S129369.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6831",
      "summary": "Dark round disc with bright steady orange light over Long Beach CA 02/25/2017",
      "city": "longbeach",
      "shape": "oval",
      "date": "2017-03-10T00:00:00",
      "story": "Dark round disc with bright steady orange light over Long Beach, CA. 02/25/2017 I saw one steady and quite bright orange light about the magnitude of Venus or brighter moving rapidly from southwest over the harbor in a northerly direction over the city of Long Beach, California.  Weather  conditions were clear – no rain or clouds.  It emitted no sound.  I could not estimate its altitude.  As it passed overhead there was enough ambient light form the setting sun to back light it so that I could see that the light was attached to a colorless or black object with a more or less round or oval shape. It was the size of a dime held at arm’s length.  I watched it until it disappeared behind the house I was stand next to.   My first conclusion was that it could have been a drone, but it didn’t have the characteristic kind of movements usually displayed by drones.  Neither did it display any flashing lights characteristic of most drones that I have seen.",
      "link": "http://www.nuforc.org/webreports/132/S132835.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c683a",
      "summary": "Green oval turns colors, hovers, moves around fast, then disappears.",
      "city": "longbeach",
      "shape": "oval",
      "date": "2017-04-20T00:00:00",
      "story": "Green oval turns colors, hovers, moves around fast, then disappears. We saw a green oval shape traveling town ward at an angle.  It was very bright and hovered.  Too bright.  It was listening to us and changed colors every time we spoke. It was too quiet.  It made no noise.  It seemed to follow us.  We went for our nightly run, and my wife said we were gone over an hour.  It moved too fast when I pulled out my phone.  It came down very close a few feet away.  Then moved slowly away.  It turned purple and disappeared in thin air.  It scared me and my son to death.  It went in and out of trees when we turned around.  The neighborhood was eerily silent.",
      "link": "http://www.nuforc.org/webreports/133/S133695.html",
      "state": "MS",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6950",
      "summary": "((HOAX??))After a strange noise, a bright ball crossed the sky and leave the neighborhood in a blackout for 1 min. ((anonymous report))",
      "city": "longbeach",
      "shape": "flash",
      "date": "2017-03-17T00:00:00",
      "story": "After a strange noise a bright ball crossed the sky and leave the neighborhood in a blackout for a minute. A strange noise started and a bright ball in the sky flew past above our house, and then all of the lights went out in the neighborhood. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133140.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c69d7",
      "summary": "Satellites, drones or something else?",
      "city": "longbeach",
      "shape": "light",
      "date": "2017-02-22T00:00:00",
      "story": "Were they satellites, drones or something else?  This morning, around 5:45 a.m., when my son and I were standing in my driveway and we were about to get in my truck, so I could take him to work, he said \"Look.....there's a satellite .\"  I looked up and sure enough we could see a light above us that was about the size of Venus  It was moving slowly, but then it stopped nearly right above us.   Then I noticed another light moving, however much, much smaller and it stopped as well.  Then both began moving again.  We couldn't continue to watch them since he would have been late for work.  This isn't the first time some kind of object 'hovered' above my property.  The last time it was daylight and there was a witness standing beside me this time too.  The object was triangle in shape, the right and left side the same length and the bottom shorter than the 2 sides.  It also appeared to be somewhat transparent...kind of a silver / grey color.  I turned my eyes away fr! om it for a moment, and when I looked back up, it had disappeared.  I guess we had watched it for about 2-3 minutes.  Kind of makes you think someone is spying on you.",
      "link": "http://www.nuforc.org/webreports/132/S132693.html",
      "state": "MS",
      "duration": "Few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c69e4",
      "summary": "Circle I. Sky  ((NUFORC Note:  Witness provides minimum of information.  Looks like missile launch.  PD))",
      "city": "longbeach",
      "shape": "",
      "date": "2017-02-17T00:00:00",
      "story": "Circle I. Sky ((NUFORC Note:  Witness provides minimum of information.  Looks like missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132544.html",
      "state": "NY",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b74",
      "summary": "Obj. was going down fast like a shooting star, but with a frontal metallic circle, and it disappeared in mid air.((anonymous report))",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2017-01-26T00:00:00",
      "story": "Object was going down really fast like a shooting star, but with a frontal metallic circle, and it disappeared in mid air. It looked like a shooting star going down really fast, but with a frontal metallic circle, and it disappeared completely mid air.   I was driving on the 710 South freeway heading home towards PCH.  Didn't have time to capture but open my eyes and observe.   Then 2 drones appeared and hovered over the area the UFO disappeared to, either to investigate/confuse whoever had viewed it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132238.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f26",
      "summary": "Bright Venus-like stationary light appears in late evening sky and abruptly dims and fades in place.((NUFORC Note:  Iridium flare? PD))",
      "city": "longbeach",
      "shape": "light",
      "date": "2017-07-07T00:00:00",
      "story": "Bright Venus-like stationary light appears in late evening sky and abruptly dims and fades in place In the SSW about 45 degrees up, I noticed a white light about as bright as Venus appears in the morning sky right now, which is very bright.  I'm not sure exactly how long it had been there, but the last time I looked at that part of the sky was about 15 seconds prior to when I noticed it.  It was about 1 1/2 hand widths to the left of Jupiter and a little higher up. Perfectly stationary.   As soon as I trained my binoculars on it, it dimmed to a faint star-like light, and through the binoculars it looked just like a star and continued dimming until it was no longer visible.  I continued watching that area of the sky for another 10 minutes and didn't see anything else that was unusual.",
      "link": "http://www.nuforc.org/webreports/134/S134751.html",
      "state": "CA",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c734a",
      "summary": "At least 25 UFO floating in the sky.",
      "city": "longbeach",
      "shape": "",
      "date": "2017-06-15T00:00:00",
      "story": "At least 25 UFO floating in the sky. At least 25 UFO floating in the air.  Seem to stay float in a still position and about 2 of them seem to \"dance\" around.",
      "link": "http://www.nuforc.org/webreports/134/S134523.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7333",
      "summary": "One ufo.",
      "city": "longbeach",
      "shape": "light",
      "date": "2017-06-02T00:00:00",
      "story": "One ufo. I repeat just right before this report one from day before.  We went to park on Lo my beach and I really wanted to see ufo again but this time take least a photo.  Because the first time I was just watching.  And for my luck I really before we went back to the car we saw the same object as day before.   I have video and also photo. I am 99 porcent sure it was the same as the day before.  But the day before, I am 100000 % sure it was aliens.  This one was up in  the sky and it wasn't moving ..it was just staying at the same place and was it like very shining circle and again was lighting up and off.  I will send a video.  And after a few minutes, went down.. behind  my horizon.",
      "link": "http://www.nuforc.org/webreports/134/S134208.html",
      "state": "CA",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3c7316",
      "summary": "6 objects around the Pacific Coast.",
      "city": "longbeach",
      "shape": "light",
      "date": "2017-06-02T00:00:00",
      "story": "6 objects around the Pacific Coast. Hi. We were celebrating kids b day party.  And around 7pm (still was light, very beautiful weather).  We (about 20 people) saw about 6 or 7 flying objects maybe more then 3 miles away from us.  I'm absolutely sure it was not nothing I know or I ever saw before, the same the other people say.  We saw round shape light objects.  Was flying not so fast around the cost of city of long beach.  First object seems as leader, because was as first and was most high, then was a little space and then was other I guess 5 objects behind flying the same speed.  And they were randomly first one high the other one behind was a little under but behind still.  Third one being agaIn different hight.  But all was very close.  And all these object were something like no like light blink but it was more like white bright shine light slowly up and off and just like this they were flying around the coast.  We saw them until one house was in front of us.  Some man record it.  But I can't connect with him.  But I hope I will.  Cuz I don't know him.  I was just watching them with happy feelings ND fear at the same time.",
      "link": "http://www.nuforc.org/webreports/134/S134209.html",
      "state": "CA",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3c737c",
      "summary": "Bright oval shape in sky, seemed to change shapes,looked as if some very dark almost black rectangle shape came to this oval l",
      "city": "longbeach",
      "shape": "oval",
      "date": "2017-06-09T00:00:00",
      "story": "Bright oval shape in sky,seemed to change shapes at times, looked as if some very dark, almost black, rectangle shape came to this oval light.  The light would get brighter and fade away at times, taking on a face look.   I was amazed.  It disappeared in about an hour. ((NUFORC Note:  Source of the report elects to remain anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134408.html",
      "state": "MS",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7483",
      "summary": "Small yellow orange red ball floating in sky for about 3 minutes after it disappeared.",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2017-05-15T00:00:00",
      "story": "Small yellow orange red ball floating in sky for about 3 minutes; after, it disappeared. I was sleeping, but my mom went out to get her phone in our car and she woke me and my sister up.  It looked kinda like a fireball in the sky or a light,  My mom and sister said it was bigger before I came out.   After I came out it sorta just looked like a small ball in the sky.  An orange and reddish color.  It started to blink, and then it just turned off completely.  It was still visible afterwards but then it got lost in the clouds.  I'm not sure if it's a UFO or a plane.  But I looked up orange and yellow lights and the pictures that came up looked similar to what I saw.",
      "link": "http://www.nuforc.org/webreports/134/S134123.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c76e0",
      "summary": "UFO releases over 30 Orbs.  ((anonymous report))",
      "city": "longbeach",
      "shape": "unknown",
      "date": "2017-12-21T00:00:00",
      "story": "UFO releases over 30 Orbs. I saw a huge white orb over my house in Long Beach, CA, on October 21, 2017.  At first I spotted two objects crossing path's with each other then focused on the larger one.  As I zoomed in on my camera the UFO started ejecting smaller spheres into the atmosphere.    The first ejection formed a triangular formation!  As I kept filming the object started emitting tons of orbs falling in a steady stream from the main object.  There were at least 40 smaller spheres emitted from the main UFO.  Interestingly the smaller orbs were only visible through my infrared camera.  This was recorded with my full spectrum Canon SX60 with a monopod in my backyard in Long Beach CA. The first part of the video shows the raw footage and the analysis of the capture is presented in the end of the video. https://www.youtube.com/watch?v=TCldZk3oBWY&feature=youtu.be&t=1s ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137919.html",
      "state": "CA",
      "duration": "11 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c79e6",
      "summary": "As usual during my late night walk, I looked up and saw a medium lit light. Moving slowing opposite of the LBG airport. I thought nothi",
      "city": "longbeach",
      "shape": "egg",
      "date": "2017-11-22T00:00:00",
      "story": "As usual during my late night walk, I looked up and saw a medium lit light.  Moving slowing opposite of the LBG airport.  I thought nothing at the moment seeing many aircraft come and go.  All of a sudden the object lit up green.  Like a fire balls and moves slowly west.  The green fire ball alarmed and and I took my phone out to film the object.  It was on camera for several seconds before disappearing.",
      "link": "http://www.nuforc.org/webreports/137/S137316.html",
      "state": "CA",
      "duration": "23 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a1b",
      "summary": "White star light object is jumps across the sky lighting up green then stops momentarily then moves slowly across the sky then disapear",
      "city": "longbeach",
      "shape": "circle",
      "date": "2017-11-22T00:00:00",
      "story": "White star light object is jumps across the sky lighting up green then stops momentarily then moves slowly across the sky then disapear I was walking home (West) after watching a movie, there was a marine layer over head so I could not see any stars.  Out of the right corner of my eye there was a what appeared to be a street light high about.  I didn't think much other then a helicopter was approaching.  As the light started to get bigger.   As soon as I focused in the light jumped a crossed the sky under the marine layer about a mile in 1 second.  In the process what actually caught my attention was when it moved across it lit up bright green, what appeared to be green flames with small sparks at the bottom.   I could not make out a shape of the craft other then an orb. It then stopped becoming stationary, that's when my mind was trying to figure out what had just happened.  I pulled my iPhone out and filmed.  The object was no longer green but yellowish/white moving slowly south west.  When it suddenly vaporized as if it went behind a curtain in the sky.",
      "link": "http://www.nuforc.org/webreports/137/S137359.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b06",
      "summary": "Slow and low flying no sound big dark circluar object with lights.  ((anonymous report))",
      "city": "longbeach",
      "shape": "circle",
      "date": "2017-11-09T00:00:00",
      "story": "Slow and low flying no sound big dark circluar object with lights. Slow moving cirlcular dark object with diferent color lights.  Low flying.  No sound. Larger than a commercial plane.  Taller than a blimp. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137136.html",
      "state": "CA",
      "duration": "2-3min"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d59",
      "summary": "Immobile, white dot, not shiny and appeared to be very high in altitude.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2017-09-12T00:00:00",
      "story": "Immobile, white dot, not shiny and appeared to be very high in altitude. I was at the soccer field at California State University/Long Beach, when I noticed a small white dot in the sky not moving at all.  It looked like it was very high up and did not look like anything I have ever seen before in the sky, as it was very still and was not shiny.   It was next to a crescent shaped cloud (within the crest, south east from where I was), which I found interesting because I found video footage online of the same object I saw, sitting in the crest of a cloud that looked just like the one that I had seen, which also occurred in Long Beach. I spotted the object while doing sit-ups, and stared at it for about 45 seconds.  I switched positions to do a different exercise and took my eyes off the object for about 5 seconds, when I looked back the object was no where to be seen.  And that's when I started to actually digest what I may had just seen.   I stopped my workout and scanned the area of sky I originally saw the object, for about 5-10 minutes.  I was baffled that it had just disappeared so quickly after I looked away for a brief moment.",
      "link": "http://www.nuforc.org/webreports/136/S136114.html",
      "state": "CA",
      "duration": ":45"
    },
    {
      "_id": "64d005f478aba2ec5a3c814b",
      "summary": "Rolling sphere across sky.",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2018-03-02T00:00:00",
      "story": "Rolling Sphere Across Sky At approximately 18:38 on February 24, 2018, while walking to my apartment, I happened to be looking up at the stars which were nice and bright (for urban Long Beach, anyway) . My attention was drawn to the west by a steady orange light in the sky.  It caught my attention because of its orange color and lack of any apparent strobe or beacon that normally would be seen on an aircraft.  I caught a brief glance of it as I was walking and then a tree came between me and the light so that I temporarily lost sight of it.  When I cleared the tree a second or two later, I noticed that the light was either climbing in altitude, or coming towards me (or both), and that it was a steady orange glow, almost like a landing light on an aircraft but way more orange.  I was kind of fixated on this light, expecting at anytime to see a beacon or navigation lights which would have given it away as an aircraft when it started to fade and then disappeared completely.  Not behind a clou! d or anything, but just faded out within the span of about a second or two at most.  There might have been a second light behind (closer to the horizon) the first light, but, as I stated, I was transfixed on the brightest light, and only noticed a second light that disappeared along with the first light at the same time.  That second light might have been an aircraft, as LAX outbound traffic is frequently in that vicinity of the sky, but I can’t be certain as I was only half aware of that light. Anyway, as I was contemplating what I had just witnessed (I was stopped a few doors down from my apartment at this point, staring up at the sky), an object came “tumbling” by at, what seemed to me, just above treetop-level! It was moving in an easterly direction and, for lack of a better word, tumbling.  It remind me of a semi-translucent, roughly spherical object with a very dim, orangey glow.  There seemed to be a darker patch on the object that rotated with it’s apparent tumble, this is how I could see it’s rotation. It moved at a steady, quick pace; I’m bad at estimating speed, but I’d say maybe between 20 to 35 mph.  It made no noise and was visible to me for approximately 5 to 8 seconds, I’d say.  It moved eastward and looked to be descending as it crossed my field of view, but I could be wrong.  It had a steady glow, no flickering like a candle or anything.  I thought initially that maybe it was a bag with a candle or something in it, but I’ve seen flying lanterns before, and this didn’t look or move like the lanterns I’ve seen in the past.  It had been a windy day in Long Beach, but when I saw this object, there was no wind that I could detect. One other thing--as I was driving home about 10 to 15 minutes before my initial sighting of the original light, I had noticed a couple looking up at the sky rather intently on the sidewalk of the street I was driving down.  Now I wish I had stopped and asked them what they were looking at.  Maybe it was related to what i saw…",
      "link": "http://www.nuforc.org/webreports/138/S138947.html",
      "state": "CA",
      "duration": "2 minutes total"
    },
    {
      "_id": "64d005f478aba2ec5a3c8351",
      "summary": "Strange to see an aircraft travel that fast, low altitude with no sound report.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2018-10-25T00:00:00",
      "story": "Strange to see an aircraft travel that fast, low altitude with no sound report. Witnessed a bright solid white light at a lower altitude (5000 feet or less) streaking across the sky from east to west approximately over Cerritos heading towards the west (south bay cities) at a high rate of speed at about 9:25pm oct 19th 2018...no sound whatsoever…",
      "link": "http://www.nuforc.org/webreports/143/S143537.html",
      "state": "CA",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c839d",
      "summary": "I saw at least a dozen people pointing up to the sky; pointing and gasping.  ((NUFORC Note:  Launch of the Falcon 9 rocket.  PD))",
      "city": "longbeach",
      "shape": "light",
      "date": "2018-10-12T00:00:00",
      "story": "I walked out of Trader Joe's to the parking lot and saw at least a dozen people pointing up to the sky; pointing and gasping looking due north toward/above Palos Verdes from Long Beach.  I have never made any such report before but this was truly a strange event.  The sky was cloudless but for only a few miles square in this northern part of the sky; and in the middle of this \"clearing\" there was a large spotlight- like a flashlight around 1/2 the size of the moon shining eastward.  The power of this perfectly focused and precise light was extremely intense and appeared to cover at least 50 miles shining parallel to the ground at, and I'm guessing of course, a height of around 20,000 feet?  This enormous spotlight/flashlight was not moving whatsoever; it was transfixed in the night sky.  Witnesses were absolutely freaked out, and although I am not too excited about much of anything, I will admit that this was quite creepy and without obvious, logic! al explanation.  My 9 yr old daughter will not stop talking about it.  We took photos. It lasted full strength for around 20 minutes and then abruptly tapered off, and close shut, in around 15 seconds.  Then all the witnesses started talking together, comparing notes, trying to figure out what we'd seen.  It was a professional crowd and yes there was some anxiety among everyone.  I cannot find a single report anywhere of this event but then again I am not part of the UFO community.",
      "link": "http://www.nuforc.org/webreports/143/S143394.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8581",
      "summary": "Additonal witness to Peter Davenport report of ufo from Long Beach, Wa.",
      "city": "longbeach",
      "shape": "unknown",
      "date": "2018-08-31T00:00:00",
      "story": "additonal witness to Peter Davenport report of ufo from Long Beach Wa Last night (8.22.18) while listening to Coast to Coast, I heard Peter davenport mention the witness' at Long beach that spotted a UFO.  I live about 2 miles south of the reported incident.  It was already dark out, due to the smoke from British Columbia and the marine air that pushed the fog onto the shore.   I was outside on my deck talking to my wife on the cell phone when I saw the craft moving north to south at about 60 degrees above the horizon.  There was no sound---just what appeared to be 4 red lights in a tight circular and or square pattern.  It didn't look like the typical lights pattern of a commercial or private aircraft.   I wasn't able to get my phone switched to video mode fast enough but did get one photo taken, which sadly doesn't do much justice to  what I way ((NUFORC Note:  My report on Coast to Coast on August 22, 2018, addressed a sighting in Long Beach, California, no Washington.",
      "link": "http://www.nuforc.org/webreports/142/S142912.html",
      "state": "WA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8636",
      "summary": "Orange bright light turned off into a sphere kept going.",
      "city": "longbeach",
      "shape": "sphere",
      "date": "2018-08-22T00:00:00",
      "story": "Orange bright light turned off into a sphere kept going. I saw a bright orange light in the sky traveling slowly south and it made a right turn towards west then the light started turning off slowly and a large sphere object kept going and spinning.",
      "link": "http://www.nuforc.org/webreports/142/S142775.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8805",
      "summary": "Fireball.  With flames.",
      "city": "longbeach",
      "shape": "fireball",
      "date": "2018-07-05T00:00:00",
      "story": "Fireball.  With flames Moving across the sky then disappeared. ((NUFORC Note:  We attempted to contact the source of the report, but were unsuccessful in doing so.  We wonder whether this is a serious report.  The photograph submitted by the witness is not very convincing.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142067.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8879",
      "summary": "Two white circular lights chasing each other back and forth at fast speed.",
      "city": "longbeach",
      "shape": "circle",
      "date": "2018-06-28T00:00:00",
      "story": "Two white circular lights chasing each other back and forth at fast speed. Last night at around 10pm I was laying in bed staring out the window with a view of the east end canal in Long Beach and saw two large white circular lights chasing each other back and forth at a quick speed.  They were hidden within the clouds but the shape and light color were easy to see.  The clouds seemed low last night because the orbs looked large.  Saw them 3 times in a matter of a minute before they went away.  Then about 5 minutes later just saw one traveling a bit slower and a bit farther away.",
      "link": "http://www.nuforc.org/webreports/141/S141926.html",
      "state": "NY",
      "duration": "1-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a8c",
      "summary": "Bright light passed overhead silently and descended half a mile away from my view",
      "city": "longbeach",
      "shape": "light",
      "date": "2019-09-06T00:00:00",
      "story": "Bright light passed overhead silently and descended half a mile away from my view I was out on my usual patrol.  I exit a building, specifically, a small gym, here at my worksite. I then quickly look up and right over my head a very bright but silent light passed right above me and descended about half a mile away making no noise whatsoever.  It looked very similar to a meteor shower although I don't recall meteor showers flying very close to ground level, below a normal aircraft would fly.",
      "link": "http://www.nuforc.org/webreports/148/S148606.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c8aee",
      "summary": "Formation of lights.  ((anonymous report))",
      "city": "longbeach",
      "shape": "formation",
      "date": "2019-09-06T00:00:00",
      "story": "Formation of lights I was laying in bed about to go to sleep.  When I see a dim greenish blue light on top of a tree canopy about 30 yards away and it proceeds to get brighter and then flash off.  Then it does it again but turns the faintest bit of red at the very end.   Immediately after it turns into a formation of white tiny lights, about 8 or 9 llights spread out over 35 yards in total, now 40 yards or so above the tree canopy then disappear but then they light up again about 20 yards from where they initially lit up and do a  swirl like speeding off pattern astonishly and creepily fast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148632.html",
      "state": "CA",
      "duration": "11 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c95b5",
      "summary": "7 \"PEARLESCENT\" HIGH ALTITUDE CRAFT IN V FORMATION MOVE HORIZON-TO-HORIZON IN TEN SECONDS",
      "city": "longbeach",
      "shape": "circle",
      "date": "2019-10-04T00:00:00",
      "story": "7 \"PEARLESCENT\" HIGH ALTITUDE CRAFT IN V FORMATION MOVE HORIZON-TO-HORIZON IN TEN SECONDS. At that time, I was standing outside talking to a friend, who also witnessed this.  It was the day after a Chinese above ground nuclear test.  We were standing on a hill, with Long Beach spreading out below us.  Weather clear, near midday.  7 opalescent craft, minute of angle relative size appeared equivalent to the size of our moon, flying in V formation at hypersonic speeds at a very high altitude (50,000' +) from south to north, horizon to horizon in ten seconds.  One of these craft returned briefly, to the zenith above us, turned sideways to exhibit the object's rounded edge and wafer/lozenge shape, which paused briefly, and then shot directly vertical and disappeared at lightning speed.  This reporter was 21 at the  time, (I.Q. Was 139) a former ROTC cadet (a trained observer) and had been an amateur astronomer and astrophotographer since age 12.  My father was a senior aerospace executive engineer.",
      "link": "http://www.nuforc.org/webreports/149/S149389.html",
      "state": "CA",
      "duration": "20 seconds"
    }
  ]
}