{
  "city": "louisville",
  "fetch_timestamp": "2025-07-12T14:26:38.252138",
  "record_count": 176,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4167",
      "summary": "Unknown light/object moving perpendicular/horizontal in seconds and disappearing then reappearing",
      "city": "louisville",
      "shape": "unknown",
      "date": "",
      "story": "Unknown light/object moving perpendicular/horizontal in seconds and disappearing then reappearing At about 5PM in June, 1968, I was in the car with my mother driving east on River Knolls Drive.  As we reached the crest of the hill that led down to our home, I noticed a white/silvery light in the distance over the trees as we looked almost due east (or barely southeast). There was nothing else in sky as it was a clear summer day and I called attention to this unknown light to my mother.  She was surprised at the light and pulled the car over to the side of the road and we began watching the light in the distance(it was off in the distance but I can only guess 10-20 miles away.  When I first spotted this light what caught my attention was the fact that it was at times stationary but would then move up in a direct perpendicular line and would then sometomes move sideways in a direct horizontal line. These movements were in the blink of an eye and guessing at the distance I would say these horizontal and perpendicular movements were many miles in seconds.  We watched this movement for about 15 minutes and the mental image I have is of this unknown light/object making a cross or plus sign in the sky.  As we watched this movement we both commented and agreed that there was nothing we knew of on this earth that could move and change directions so quickly and stop in an an instant.  As we were watching this movement for about 15 minutes all of a sudden the light blinked out. This surprised us and we were going to proceed on home when the light blinked back on and reappeared in about the same spot as we originally saw it.  It made a few more horizontal/perpendicular movements and blinked out again and did not reappear. The total duration of this event was about 20 minutes.  My mother and I were perplexed at this event because we had no explanation for what we had seen.   I was 16 years old at the time and never forgot those amazing 20 minutes. I do know that reporting this 38 years later I can recall the incident as if it had happened 5 minutes ago. ((NUFORC Note:  Date in June 1968 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50150.html",
      "state": "KY",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b42f6",
      "summary": "AS ME AND A FRIEND WERE DRIVING ON THE INTERSTATE WE SAW THESE UFOS.",
      "city": "louisville",
      "shape": "changing",
      "date": "2006-05-15T00:00:00",
      "story": "AS ME AND A FRIEND WERE DRIVING ON THE INTERSTATE WE SAW THESE UFOS. Me and a friend were on INTERSTATE 64 at EXIT 128 and we looked up and saw a circle UFO it had red, yellow, and brown lights on the inside of the bottom, then it had on the inside of the bottom all blue and purple lights and emitted red and yellow beams. And then it changed into a triangler UFO it was all red lighted with blue lights on the corner. And then it changed back into a circle UFO. It had again on the inside of the bottom red, yellow, and brown lights. And it emitted two more circle UFOS. They all had on the inside of the bottom red and yellow lights and emitted blue and purple beams. We sat off the INTERSTATE and watched these objects as they hovered over the car. Then we saw these UFOS get lower then higher and then we lost sight of them and couldn't see them no more. This was on November 22, 2005 on a Tuesday night at 9:45 P.M. It was very clear outside we didn't hear no sound we first saw these objects as we were driving on the INTERSTATE and we got off to watch these objects.",
      "link": "http://www.nuforc.org/webreports/050/S50420.html",
      "state": "KY",
      "duration": "20 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b468f",
      "summary": "Looked like a flaming ball shooting fireballs off it then it turned and sped off to the South, no way it was a plane or meteor",
      "city": "louisville",
      "shape": "fireball",
      "date": "2019-08-23T00:00:00",
      "story": "Looked like a flaming ball shooting fireballs off it then it turned and sped off to the South, no way it was a plane or meteor",
      "link": "http://www.nuforc.org/webreports/148/S148016.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4aa1",
      "summary": "Me my brother my sister and my neighbors were outside we saw a egg shaped tin looking object that had a bright light that looked like s",
      "city": "louisville",
      "shape": "egg",
      "date": "2019-07-25T00:00:00",
      "story": "Me my brother my sister and my neighbors were outside we saw a egg shaped tin looking object that had a bright light that looked like super bright fleurescent white lights I went inside to get my mom and when I came back they said it disappeared",
      "link": "http://www.nuforc.org/webreports/147/S147790.html",
      "state": "KY",
      "duration": "2min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ad6",
      "summary": "Fireball like light on unknown craft over Louisville.",
      "city": "louisville",
      "shape": "disk",
      "date": "2019-07-05T00:00:00",
      "story": "Fireball like light on unknown craft over Louisville. Bright light like a fireball that continued to stay lit for about 5 minutes until it suddenly became dim and the craft disappeared into the upper atmosphere.  Small lights could still be seen as the craft continued upward into the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147158.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f55",
      "summary": "I was at ny parents' house, sitting on the porch swing out in the county (country-side), talking on the phone when an object that looke",
      "city": "louisville",
      "shape": "sphere",
      "date": "2019-04-18T00:00:00",
      "story": "I was at ny parents' house, sitting on the porch swing out in the county (country-side), talking on the phone, when an object that looked like the sun (yellow) came into my view, traveling at an average jet-airplane speed, coming from the SW and heading NE.",
      "link": "http://www.nuforc.org/webreports/145/S145683.html",
      "state": "KY",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b529b",
      "summary": "3 friends watched by a bluish light that moved with incredible speed 100 ft away.",
      "city": "louisville",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "3 friends watched by a bluish light that moved with incredible speed 100 ft away. Me and two of my friends were walking down Columbia AVE. to go to an overpass around 10:30 PM to 11:00 PM and while looking at the dark pavement as we walked we noticed what we thought was a spot light coming from a police helicopter behind us. I knew from the color of the light that this was no ordinary spotlight, it was a blueish color that reminded me of the new headlights on some cars but casted no shadow. Curious as to what it was coming from we all looked back at the same time and seen a bright bluish white light hovering (no sound) above the last house on Virginia AVE. which was less than 75 yards away. Before anyone could even think of something to say the spotlight flashed toward the sky and faded out as if it knew we had spotted it but the craft remained glowing. About 2 seconds later still baffled we watched the craft dart off to the north with unbelievable speed (literally the blink of an eye) and was gone. about 2 to 3 seconds later we heard a very loud boom like thunder although there wasn't a cloud in the sky. Now I've never heard a sonic boom before but im willing to bet that is what it sounds like.  To this day my friends are reluctant to talk about this with other people for fear of ridicule, and we have no explaination as to what it was we saw that night. All I can say is there is no man made vehicle that can move like this that I know of, I have never seen anything like it before in my life and I doubt I ever will agian. I remember this like it was yesterday and it will always stay fresh in my mind. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51702.html",
      "state": "KY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5403",
      "summary": "orbs out my window came together and flew away",
      "city": "louisville",
      "shape": "sphere",
      "date": "2008-06-12T00:00:00",
      "story": "orbs out my window came together and flew away I went to bed just before 1:00am and as I was laying in bed watching TV when all electronics in my room went off suddenly after my cable box went blank and began to display static. This was no more than 20-30 min after I laid down. A bright blue-white light came bursting through my window. I jumped to the end of my bed and opened my blinds expecting to see a helicopter. To my surprise there were 3 orbs out my window. They were all a red purple color, about 2 ft wide, yet they didn’t seem to illuminate any light. The light seemed to be almost internal rather than radiating. The objects were stationary for probably about 10 seconds when they all moved together in line. They seemed to now form one object with the center orb now becoming a blue oval. As soon as the objects merged together the one object moved slowly away and seemed to just \"blink\" away. The power only went off in my room of the house. No other room was effected. Only the clocks and other electronics in my room were effected. This experience completely baffled me. I researched everything I could find. My family thought it was a dream until the next day there were, and still are, circular areas of dead vegetation about 2.5’ wide. I cant explain what happened but whatever it was, it was real I have dead spots surrounded by healthy green plants. I want to know if anyone else out there has had a similar experience.",
      "link": "http://www.nuforc.org/webreports/062/S62846.html",
      "state": "KY",
      "duration": "45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b5441",
      "summary": "UFO Sighted Thursday June 30, 1988 at about 23:15 N of Elizabethtown and S of Louiseville on I-65 close to State Park",
      "city": "louisville",
      "shape": "circle",
      "date": "2007-10-08T00:00:00",
      "story": "UFO Sighted Thursday June 30, 1988 at about 23:15 N of Elizabethtown and S of Louiseville on I-65 close to State Park The date was Thursday June 30th, 1988 shortly after 11 PM. I was moving from Houston TX to Metro Detroit MI. I was traveling alone in a huge 26' Ryder Rental Truck while towing my 1985 Cavelier on a tow dolly behind.  I was heading North out of Elizabethtown, KY but was still well South of Lousville, KY on I-65. I saw a State Park sign coming up so I decided to pull over at that exit and just sleep on the shoulder on the side of the road near the highway so I could get an early start with out getting lost in the morning, plus I was not very acclimated with the procedures needed to back this monster mobile up.  Anyway I merged into the exit lane and turned right onto this road (name forgotten).  I proceeded probably a mile or more down this road so I was far enough away to not hear the noise of the occaisonal semi going up the hills on the Interstate.  I pulled off on the right shoulder, went over a hill and stopped near the bottom of the grade.  I engaged the emergency brake and cut the truck motor.  I was smoking a cig and just getting ready lay down on the bench seat and try to get a couple hours sleep before continuing.  Suddenly, I noticed that the interior of the cab was gradually getting lighter.  Mind you, I am out in the middle of nowhere parked by the exterior boundaries of a state park.  Of course I figured it was a car or vehicle of some kind.  Damn if wasn't a vehicle of some kind!  The interior of the truck cab continued to get brighter seeming from behind, but I could not see a vehicle on the road behind me.  The lights go so bright it was kind of freaking me out a little.  I looked out the passenger window and could see some kind of multi-colored lights on what appeared to be some type of flying saucer. I could not see the whole thing, but it was slowing moving over a hill south of me with an approach that seemed to be coming towards me.  I could not take this suspense.  This was a moment when I realized that whatever this was, it was a lot more powerful than I was.  I got out of the truck and stood between the truck and trailer watching this thing approach me.  I made such an effort to hear something as it came closer but I heard not a sound.  Not a single sound.  No wildlife, no bugs, no flying saucer.  But I could see it!  It was not shing a light on me as it was just illuminating the darkness.  It continued to move slowly never varying its speed.  The object appeared to be huge.  My perception was that it was roughly 200 feet across.  I walked to the back of the trailer giving up my false refuge because I really couldn't believe what I was seeing.  The object continued north and went over the next hill seemingly to flew just over the tree tops.  When the lights faded I got back in the truck ane locked the doors. I played the radio for about 5 minutes to help myself calm down.  I decided I really was exhausted even though I had just witnessed an amazing thing.  I turned off the radio, double checked the door locks, and fell asleep.  The next morning about 4:30 I woke up and thought about what I saw.  I actually tried to rationalize that I did not see what I thought I did. I went to start the truck, and the battery was dead.  Last night I only ran the radio for about 5 minutes before I turned it off.  As luck would have it.  I had parked on a slight incline so I release the emergecy brake, put it in neutral and we started rolling downhill.  I pushed in the clutch, put it in 1st and popped the Clutch.  She started right up.  Just coincidence I thought.  I found the entrance to the park further down the road on the right and made a wide U-turn to go back towards I-65 North.  Hours Later I picked up a station from LIMA Ohio that said there had been multiple UFO sightings the night before.  They even gave out a phone number to call if you had seen it. It was probably just their number they were giving out and not an official number, but I was just excited that somebody had seen something last evening and they were describing similar sightings.  I know these areas are 250 miles apart, but it seemed to give my version credability again.  I know it was a UFO because I could not IDENTIFY if. Nor have I seen anything like it since.  I told this story a lot at first, but based on the looks people give you, I very rarely tell it anymore. ((NUFORC Note:  Date of the event may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58701.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5638",
      "summary": "very loud sound ,round shape object in Louisville,Ky  Southend",
      "city": "louisville",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "very loud sound ,round shape object in Louisville,Ky  Southend It had to be around or close to fourth of july because i remember us playing with glo sticks when this round shape object appeared it was very loud ,it glided over us almost hitting the apartment building thats how low it was we thought it was gonna crash,it was so big we only seen underneith it ,it had multible lights it was like layers of circles with lights around edges. As it glided around the building we ran behind tring to chase it but it was gone. The only place it could have went was navel ordance it is a millatary place thats beside the apartments,I dont no it vanished so fast. Anyone can give all six people a lie-detector test and all will pass with flying colors. There were so many people out there,when I tell people this story they think im crazy ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57124.html",
      "state": "KY",
      "duration": "1-2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b57ae",
      "summary": "flying discs and rectangles in clouds.",
      "city": "louisville",
      "shape": "disk",
      "date": "2008-03-04T00:00:00",
      "story": "flying discs and rectangles in clouds. Me and some friends were looking out the window when we saw a little bird come flying out of a cloud, but after about ten seconds we realized this was no bird. there where about 7 and most where discs and one was a large rectangle.  They seemed to just be flying around in a group of clouds but then all of a sudden one of the discs went red and a few seconds later they were all gone. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60464.html",
      "state": "KY",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b58de",
      "summary": "baseball size bright blue flying glow, approached me made a noise and left quickly (KY)",
      "city": "louisville",
      "shape": "fireball",
      "date": "2007-08-07T00:00:00",
      "story": "baseball size bright blue flying glow, approached me made a noise and left quickly (KY) siting on stairs outside, two afternoon, blue fire ball about size of baseball landed on pack of cigs and bounced over to cell phone, bounced up and down a few times heard some sound coming from it, when i moved it flew away. it was truely awsome sight",
      "link": "http://www.nuforc.org/webreports/057/S57522.html",
      "state": "KY",
      "duration": "14:01"
    },
    {
      "_id": "64d005f478aba2ec5a3b5996",
      "summary": "Two metallic shperes hovering in broad daylight then vanishing",
      "city": "louisville",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "Two metallic shperes hovering in broad daylight then vanishing It was a clear and mild Sunday afternoon around 4:30pm when myself and a friend were standing in an alley way in front of his garage talking. As we talked I was glancing down the alley and up into the sky and thinking about what a nice day it was when I noticed object in the sky about 45 degrees up from the horizon. It was something I have never seen before or since with my own eyes. I mentioned to my friend the object and he saw it and then noticed a second similar object almost directly above us. The one above us appeared to be closer so we focused on that. I immediately got my binoculars out to have a closer look. The object was metallic and appeared to be circular, or an orb. I would have to say the object was a bit larger than a BB if you held one an arms length away. The objects did not drift or move. They were stationary in their positions for at least two minutes then they just vanished.",
      "link": "http://www.nuforc.org/webreports/061/S61652.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5999",
      "summary": "Two metallic spheres hovering in sky then vanishing as jet plane passes nearby.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "Two metallic spheres hovering in sky then vanishing as jet plane passes nearby. We were standing in the alley at the garage of a friends house in Old Louisville on a sunny, cloudless Sunday afternoon. I happen to look north down the alley and up into the sky and noticed an object hovering about 45 degrees from the horizon. I asked my friend what he thought it might be and he said he didnt know and there was another one just like it directly above us. The one above us appeared to be larger. I immediately got my binoculars from my truck and had another look. It was a dull metallic sphere and appeared to be getting smaller or it was going straight up. About this time there was what appeared to be a jet plane flying between the objects and as it passed, the objects just simply vanished. The objects did not drift or move from thier position. I could not tell how big they were or the distance from us. However the jet plane I estimated to be around 30,000 feet up. My friend and I are middle aged and just regular guys. I was returning his ladder I had borrowed and we had just put it away in his garage and just hanging out in the alley talking when the event occurred.",
      "link": "http://www.nuforc.org/webreports/060/S60354.html",
      "state": "KY",
      "duration": "5 mintues"
    },
    {
      "_id": "64d005f478aba2ec5a3b59a6",
      "summary": "Flame looking object south of Louisville, KY airport in 2000",
      "city": "louisville",
      "shape": "teardrop",
      "date": "2007-02-01T00:00:00",
      "story": "Flame looking object south of Louisville, KY airport in 2000 On a very clear morning. I was coming back from the second shop to get a part.  I glanced up to see something I have never seen in my life that stopped me in my tracks and totally speechless.  It was tear drop shaped but the sides were straight not concave and rounded at the front.  It was an orange, red and yellow distinctive but blend of these colors.  Kind of looked like it was on fire or flaming but was not pulsing or flickering.  It seemed like a cut out picture that was suspended in the sky but I knew this was NOT the case. I stood and watched it for a few minutes as it seemed to be heading straight for the ground maybe 1,000 feet or so up.  I caught myself watching in an almost trance-like state I kind of snapped myself out of and thought, \"I HAVE to get someone else to confirm what I am seeing is just that!\".  I knew I wasn't having dillusions, was well rested, not hung over OR on ANY medication. (legal or otherwise)  I briskly headed for the main shop to get the shop foreman because we were the only ones there at the moment.  I went into the office and asked him with much firmness in my voice he needs to come here to see this.  He asked what it was but I just blurted out, \"Just come here. You have to see this!\".   He followed me with out question as I quick stepped it the spot I was standing earlier.  I stopped at the same spot and pointed backwards to the object and replied, \"WHAT THE HELL IS THAT?!\".  He turned in the southern direction I pointed and froze solid...speechless as well.  Blank stare on his face. After a couple minutes I asked him again. \"What the hell is that?\" He said,  \"Charlie, I really don't know\" in an awe stricken fashion. So, we just stood there for a few minutes more then the object seemed to turn due south very gradually but it didn't bend, flex or change its looks when it did.  It was smaller looking after the turn south and seemed to slowly continue until it got too small to see any more.  It left no trail, residue and had no evidence of being a \"made\" or \"built\" thing.  No lights or anything that people typically report with ufos. This all took place maybe 1 mile south of the Louisville, KY, international airport.  About 1/2 mile west of I-65 and about 1/2 mile south of I-265.  So close to the air port and never heard anything about it on the news or from others.  It seemed to be bigger than the good year blimp.  I can't even be sure it was a craft but it seemed to move with a definite purpose. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54725.html",
      "state": "KY",
      "duration": "10-12 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ad7",
      "summary": "Black silent, fairly slow moving craft slowly passed over downtown Louisville Ky.",
      "city": "louisville",
      "shape": "changing",
      "date": "2008-06-12T00:00:00",
      "story": "Black silent, fairly slow moving craft slowly passed over downtown Louisville Ky. Was outside w/ coworker downtown when I noticed what appeared to be a helicopter.  Was still daylight and no other objects were around it.  As object drew closer no sound was heard.  We both witnessed it.  It appeared to be near the height commercial aircraft fly, yet made no sound and had no visible markings or lights.  Flew in a direct path most airplanes take when coming and going to the airport.  It passed over a building and we lost sight of it.  It didn’t float up like a balloon, it moved across the sky in a horizontal fashion.  As it passed over it turned on its side and had an appearance similar to a stealth bomber while making a sharp turn.  However it was slow moving and had no lights or sounds associated w/ it.  It also was more akin to a boomerang and more rounded than traditional stealth aircraft.  Initially I thought it was a helicopter, as it came and passed it’s appearance was clearer.  The black slow moving triangular and rectangular w/ no lights/sounds reported by others was the closest thing to a matching description I could find.  I live near the commercial/passenger airport.  This craft was different than the ones that fly overhead almost constantly.  Not sure if it’s terrestrial or not though.",
      "link": "http://www.nuforc.org/webreports/062/S62924.html",
      "state": "KY",
      "duration": "30- 45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f6b",
      "summary": "Two silent and very high flying objects moving southeast over Louisville, KY.((NUFORC Note:  Space Shuttle w/ ISS??  PD))",
      "city": "louisville",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Two silent and very high flying objects moving southeast over Louisville, KY. At the Starbucks Coffee, 4200 Shelbyville Road, Louisville, KY, I looked up in the clear night sky and happened to see two lighted objects, each about the size of a star or planet, and one trailing the other and seperated by some distance. They were both moving in the same direction, approximately southeast. There was no sound associated with the objects. I looked closely and saw no other colored lights, such as red or green that I have seen with high flying aircraft, with the two lighted objects. The visibility of the two lighted objects faded and was lost while the objects were still high in the sky. I of course am very curious concerning what I was looking at. I am no nonsense person. I only report the facts. I am a 17 year employee of the federal government. ((NUFORC Note:  Space Shuttle w/ ISS??  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57210.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6131",
      "summary": "MY SISTER,MY YOUNG DAUGHTER AND I WAS DRIVING ON I 64 GOING WEST WHEN I LOOKED UP AND SAW THIS CRAFT HOVERING OVER THE LEFT FENDER OF M",
      "city": "louisville",
      "shape": "circle",
      "date": "2006-07-16T00:00:00",
      "story": "MY SISTER,MY YOUNG DAUGHTER AND I WAS DRIVING ON I 64 GOING WEST WHEN I LOOKED UP AND SAW THIS CRAFT HOVERING OVER THE LEFT FENDER OF MY CAR. I AT FIRST THOUGHT IT WAS A HELICOPER BUT THEN REALIZED THAT IT WAS ROUND AND COLORED LIGHT WERE FLASHING GOING AROUND IT. THEN THE COLORED LIGHTS WENT OUT AND FROM THE BOTTOM ONE BRIGHT BEAM OF LIGHT WAS SHINNING LIKE A SPOT LIGHT. THEN THE CRAFT JUMPED TO THE PASSENGER SIDE WHERE MY SISTER WAS RIDING AND THE CRAFT HOVERED THERE AND THEN LIKE A FLASH IT WAS ACROSS THE OTHER LANES GOING EAST AND OVER THE FIELD OUT OF SIGHT.WHEN I GOT HOME I TOLD MY HUSBAND AND HE SAID HE JUST SAW A REPORT OF SIGHTINGS ON THE NEWS. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51056.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6303",
      "summary": "Daylight Cigar shaped UFO sighting, with Witness!",
      "city": "louisville",
      "shape": "cigar",
      "date": "2006-07-16T00:00:00",
      "story": "Daylight Cigar shaped UFO sighting, with Witness! What you are about to read is quite unbelieveable. But I swear on my familys life that what I say is true and even have a witness whom saw exactly what I did.. And it changed my life forevermore...  The year was 86.  I was 17. My friend and I were driving on a rural country road/hwy, just outside the town of Louisville KY on a fine clear summer day. The time was about 4:30pm. I was riding shotgun and enjoying the nice country drive when something caught my attention through the corner of my eye off to the left of the highway.  I noticed something large hovering over a wooded area about a quarter mile away.  At first I thought \"what in the world is that?\"  It was a silvery metallic cigar shaped craft that was probably at least a hundred feet long.  It was in a vertical position, just hanging there motionless maybe a hundred feet above the treetops. I pointed this curiosity out to my friend who was just as puzzeled as I. I figured it must be a weather ballon or something like that. But...I have never seen anything even re similar in appearance in my 17 years of life. There were no appendages, wings, motors, rotors, windows, Nothing! It was a solid metallic shape that reflected the suns rays brilliantly. My friend and I were looking at the object trying to figure out what it was, when, in the blink of an eye it was gone!  I was quite excited and scared. Eagerly we scanned the skies around where it had been, looking for it, but it was nowhere to be found.  Maybe 30 seconds later, while looking on the OTHER side of the expressway from where it had been, I saw it hanging there motionless again. Yelling \"there it is!\"  I pointed to my friend where it was, and we both watched it for several seconds.  Then, right before our very eyes, it disappeared slowly, as if it was cloaking, or dematerializing. It just faded out to nothing.  It did not move away.  It just disappeared. We were speechless.  I told family and friends but no one believed me, even with my friend as witness. I cannot describe how I felt, but know that this event convinced me to research what I saw, and over the years I have found much. Having seen this firsthand, I have opened my eyes to accept what others cannot. Many people have seen exactly what I have, all over the world. I don't know what it was that I saw, but it was broad daylight when we saw it, so there is no questionable night time issues here. In my opinion this was no government secret project/craft. 1. The technology was far too advanced. 2.  The speed used would have broken a humans neck, or the G forces involved would have been impossible for a human to withstand. 3.  As far as I know , no government on earth has craft cloaking/dematerializing abilities.  This has bothered the hell out of me for 20 years. It could be a government project, but I seriously doubt it. Having seen what I have, I honestly believe we are being visted by beings from another world.  Before I die, my one wish in this world is to truly know what I saw. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50993.html",
      "state": "KY",
      "duration": "1 or 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6398",
      "summary": "6 orbs moving in formation high above the atmosphere",
      "city": "louisville",
      "shape": "sphere",
      "date": "2006-10-30T00:00:00",
      "story": "6 orbs moving in formation high above the atmosphere I was looking up at the sky, I noticed a new set of stars, I thought it was because the new solstice was comming or something and the constalations were changing. As i looked at these \"stars\" they began to move irraticaly, the main formation was one sphere in the center surrounded by 5 other Spheres evenly but they were all pretty much moving in sync. Judging by the speed of the objects and the distance they traveld (which wasnt a long distance) i would say these objects were atleast 3 miles above the atmosphere. I went to check on these \"stars\" the next night and they wernt there.( i looked at the same time)",
      "link": "http://www.nuforc.org/webreports/052/S52202.html",
      "state": "KY",
      "duration": "3 Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a98",
      "summary": "this is a ball of round lights forming a large circle, changed shaped to a disc then back to a round circle, saw this at 6:30 am still",
      "city": "louisville",
      "shape": "sphere",
      "date": "2007-11-28T00:00:00",
      "story": "this is a ball of round lights forming a large circle, changed shaped to a disc then back to a round circle, saw this at 6:30 am still there at 7:15 am in the eastern sky, to the left of the moon there was also a pink color beam that crossed the sky to the right of it thru the clouds",
      "link": "http://www.nuforc.org/webreports/059/S59635.html",
      "state": "KY",
      "duration": "still there"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b29",
      "summary": "Saw a craft by the moon that had many lights and changed shape in the morning sky.  ((NUFORC Note:  Celestial body??  PD))",
      "city": "louisville",
      "shape": "changing",
      "date": "2007-11-28T00:00:00",
      "story": "Saw a craft by the moon that had many lights and changed shape in the morning sky. My mother called me outside in the backyard this morning to observe something unusal in the sky. While I was in the shower she saw a strange object near the moon in the sky, which at first looked like a star. After looking through binoculars she relaized that it wasn't a star. She saw the craft change shape from a circular one to a longer ship in length. The craft was a series of lights, so it may have been 1 craft of many just in a formation. ((NUFORC Note:  Celestial body??  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59640.html",
      "state": "KY",
      "duration": "45+"
    },
    {
      "_id": "64d005f478aba2ec5a3b6bc3",
      "summary": "Louisville, Ky. 6 am. Two lights moving across the sky from horizon to horizon in about 2 min..  ((NUFORC Note:  ISS & Shuttle.  PD))",
      "city": "louisville",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "((NUFORC Note:  ISS & Shuttle.  PD)) Louisville, Ky. 6 am. Two lights moving across the sky from horizon to horizon in about 2 minutes. I first noticed the light above the SW horizon. In appearance the light was similar to the appearance of Venus in the morning sky that morning both in intensity and color.  The light was moving across the sky in a northeasterly direction. About 10 seconds after I noticed the first light a second light appeared over the horizon. The second light was following the same path as the first – both in position and direction.  I watched the lights move across the sky. I didn’t have a watch, but I anticipate it took about two minutes for the lights to move from the western horizon to above the eastern horizon.  While I viewed the lights, they were consistent in speed and direction. The distance between the first and second light remained consistent – with one caveat. When I last looked at the lights, now above the eastern horizon, the second light appeared above the first light – as if it were higher.  What I did not do… I did not follow the lights until they were out of sight. When last I looked, the bottom light was 10 – 15 degrees above the eastern horizon with the second light a few degrees above the first.",
      "link": "http://www.nuforc.org/webreports/059/S59670.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ef1",
      "summary": "Siting over Loiville, Ky",
      "city": "louisville",
      "shape": "formation",
      "date": "2008-04-17T00:00:00",
      "story": "Siting over Loiville, Ky On the night of the 13th of march I was driving through Kentucky.  As I approached the city I could see lights in the sky.  There were 3 lights on each object 2 white and 1 green.  There were a lot of objects in the sky.  Aprox. 20 objects.  I looked all around and they were in a grid formation in the sky. They were spaced about 3 miles from each other.  They all sat about 900ft up and didn't move.  I was in the Air Force and I've seen aircraft before.  As I drove more and more showed up. None of them moved.  As I drove further 1 object moved in formation to line up with the others.  Same light pattern as the others. It stopped and I drove out of the city. I called my wife to tell her what happened from the road. I am not crazy. I've driven truck for 5 years.  I was in the Air Force for 8 years.  Something was over Loiville, Kentucky that night.",
      "link": "http://www.nuforc.org/webreports/062/S62582.html",
      "state": "KY",
      "duration": "30min"
    },
    {
      "_id": "64d005f478aba2ec5a3b70c0",
      "summary": "Bright white light, dissapearing and reappearing in different locations in the night sky, eventually dissapearing, fading away.",
      "city": "louisville",
      "shape": "light",
      "date": "2008-01-21T00:00:00",
      "story": "Bright white light, dissapearing and reappearing in different locations in the night sky, eventually dissapearing, fading away. I was smoking a cigarette outside, and usually i star gaze when i am outside at night. Then a bright light caught my eye at high altitude, and it would disappear on and off and re appear in a different location. It was a solid white light that jumped all over the sky and after about 2 minutes it started to fade in and out till it was gone, I really did not know what it was. Planes don't do that kind of stuff nor any thing els that i am aware of. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60834.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b71de",
      "summary": "My 6 year old took a picture which he then discovered had a ufo in it.",
      "city": "louisville",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "My 6 year old took a picture which he then discovered had a ufo in it. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  We have no way to contact the individual, in order to request a copy of the photo.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52621.html",
      "state": "CO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7366",
      "summary": "White light viewed South of Louisville AR, East of HW 29.  Light came on for a few seconds at a time.",
      "city": "louisville",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "White light viewed South of Louisville AR, East of HW 29.  Light came on for a few seconds at a time. As we were driving South on HW29 out of Louisville a light from the East caught our eye.  The light was large and white.  It only came on for a few seconds but we kept an eye out for it and viewed it a total of three times over the next 15 minutes.  We were traveling 60 MPH so it appeared to have been moving South with us.  This is the first sighting for any of us.",
      "link": "http://www.nuforc.org/webreports/054/S54687.html",
      "state": "AR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d92",
      "summary": "As we turned the saucer shaped thing disappeared. It blinked out and was gone.",
      "city": "louisville",
      "shape": "disk",
      "date": "2006-12-07T00:00:00",
      "story": "My husband and I were traveling north in our vehicle on Blankenbaker Pkwy.  As we were talking I observed something in the sky.  The sky was clear with very few clouds so I had an unobstructed view of it.  It was northwest in relation to where we were and approximately 1 mile in distance from us. The object was charcoal in color and motionless. I watched the saucer shaped object for about 2 minutes while we were driving.  We came to a stop at a red light so we could turn left and possibly travel closer to the object.  As we turned the saucer shaped thing disappeared.  It blinked out and was gone.  I've never seen anything like this before and can't understand how this thing could have been stationary for so long and then just disappear. ((NUFORC Note:  We spoke with this witness via telephone, and she sounded quite serious-minded to us.  We suspect that she is a quite credible witness.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53834.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b84d0",
      "summary": "I was  at  my friend's house playing in her back yard when I saw a strange metallic object painted red in most areas.  The shape was un",
      "city": "louisville",
      "shape": "other",
      "date": "2009-01-10T00:00:00",
      "story": "I was  at  my friend's house playing in her back yard when I saw a strange metallic object painted red in most areas.  The shape was unexplainable though kind of heart shaped. (NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67061.html",
      "state": "CO",
      "duration": "20  seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b84bc",
      "summary": "Multiple witnesses observe moving light.  ((NUFORC Note:  Possible sighting of ISS.  PD))",
      "city": "louisville",
      "shape": "fireball",
      "date": "2008-10-31T00:00:00",
      "story": "ON 8-08-08 I CHECK THE PLANETS ALIGNMENT IN MY COMPUTER AND FOUND THAT THEY WERE IN A STRAIGHT LINE FROM THE SUN THROUGH THE MOON,WHICH I THOUGHT WAS UNUSUAL. I WENT OUTSIDE TO CHECK OUT PLANETS TO SEE IF I COULD SET UP MY TELESCOPE AND FOUND THE MOON WAS TOO BRIGHT.JUPITER WAS IN PLAIN SIGHT.MY WIFE AND A NEIGHBER JOINED ME IN THE DRIVEWAY. NEXT I SPOTTED WHAT I THOUGHT WAS A SATELITE BUT IT APPEARED AS BRIGHT AS JUPITER AND MOVING WEST TO EAST.IT ALSO PASSED A COMMERCIAL AIRLINE WHICH GAVE US A CLUE AS TO ITS SIZE IT WAS HUGE.IT APPEARED TO WOBBLE AS FLEW AND IT DIDNT FADE OUT AS A SATELITE DOES ON THE HORIZON. MY NEIGHBER COMMENTED THAT WE HAD JUST SEEN A UFO. ((NUFORC Note:  Possible sighting of ISS.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65215.html",
      "state": "KY",
      "duration": "1 MINUTE"
    },
    {
      "_id": "64d005f478aba2ec5a3b8737",
      "summary": "Rapid traveling balloon-shaped object  travels up wind, and flies off after a 30-45 second show.",
      "city": "louisville",
      "shape": "egg",
      "date": "2009-03-19T00:00:00",
      "story": "Rapid traveling balloon-shaped object  travels up wind, and flies off after a 30-45 second show. My daughter was driving us to a drive-in fast food chain for dinner after we were moving her into an apartment on the east / northeast side of Louisville, Kentucky. I looked to my right from the passenger seat and viewed what i thought a balloon someone had just let loose. The sun had set and the sky was almost dark but still had a slight glow to the sky. The balloon object; no lights,  was flying away from my position like a knuckle ball at about the 2:00 o'clock position, but the wind was blowing into my face from the north. Than without a noise, the balloon object went straight up about 12:00 o'clock position, dove straight down to the left, came right at us over another fast food place and grew to about 10'-14' in diameter. I told my daughter to look at the object when i pointed over the buildings horizon. She saw the tear dropped balloon looking object and within a second it darted up and out to the left and was gone in 1 sec. It shrank in size as if traveling at a very very high rate of speed. Again no noise. If it were a balloon, how could the balloon travel seem to go against the wind about 1/4 mile and hover perfectly still, move again very quickly, hover, and take off like it was shot out of cannon?  I am not a true beliver in UFO's but this was a very curious encounter, and after watching your show for the first time this past Saturday, I thought I would pass this info to you. All the best. D.T. Louisville, KY",
      "link": "http://www.nuforc.org/webreports/068/S68657.html",
      "state": "KY",
      "duration": "30-45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b875b",
      "summary": "Star like object appeared to move in circular paths",
      "city": "louisville",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Star like object appeared to move in circular paths At approximately 9:00PM I noticed a star approximately 10 degrees south of vertical move in an erratic circular path about 2 degrees from its original position and return to its original position.  As it moved, the object had a sort of twinkling effect.  I observed this object over the course of 2 hours.  It would remain stationary for several minutes then it would move in the erratic circular pattern.  The objects motion over time was in a westerly direction but its progress was more rapid than the other stars.  I phoned a friend who verified what I was seeing.  He lives about 12 miles west of me and saw the object in the same relative position in the sky as me so I would say the object was at a high altitude.  My friend tried to look through his telescope at the object but could only resolve the object as a point source of light.  The object has repeated these maneuvers dozens of times and at the time I am submitting this report it is continuing to do so.",
      "link": "http://www.nuforc.org/webreports/066/S66633.html",
      "state": "KY",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b87f6",
      "summary": "Bright object pulsing and dissapearing stationary in the sky",
      "city": "louisville",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Bright object pulsing and dissapearing stationary in the sky On November 23rd we were driving, on seventh street in Louisville Kentucky, traveling southwest towards Berry Blvd when we noticed an object in the sky.  At first we thought it might be a bright star, but the object appeared to pulse, which was quite abnormal. Continuing to examine the object I noticed that it appeared to pulse slightly into a haze, as if the object were having some sort of lensing effect applied to it, so I rolled down the vehicle window and looked at the object in the clear, and sure enough the hazing was not an effect of the windshield or any other glass or reflection. While I was observing the object it pulsed and winked out.  I would have thought nothing more of it except that it returned about 4-seconds later.  Upon further observance as we approached berry blvd, the object again pulsed but the effect seemed longer and brighter with angular stabbing lights extending from it briefly.  I looked and noted it was not a plane, had no running lights of any kind and as I was checking to see if it was mounted on a tower, the object disappeared again.  4 seconds or thereabouts later, it re-appeared. It was certainly not the moon, it wasn’t a plane and the object didn’t move, nor was it mounted on a tower.  I’m not aware of any object that can dead hover, produce no sound, and pulse and disappear and reappear staying roughly two to three hundred feet in the sky.  I’m not sure what it was. ((NUFORC Note:  We believe the correct date to be November 02, 2008.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66756.html",
      "state": "KY",
      "duration": "20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b87d0",
      "summary": "Disk shaped object sighted during Kentucky ice storm.",
      "city": "louisville",
      "shape": "disk",
      "date": "2009-03-19T00:00:00",
      "story": "Disk shaped object sighted during Kentucky ice storm. I spotted a craft during the recent ice storm we had.  I was out on the porch watching all the trees fall down because of the ice.  I had just finished my cig and was waiting for the tree across the street to fall and noticed this object floating across the sky.  It was in between some trees, but I watched it for about 30 seconds before it went behind the trees.  I ran in to get my boyfriend to come see it but it never came back into view.  It was silver and disked shaped.  When it was moving it kind of wobbled back and forth and you could only tell it was a saucer when it wobbled.  It wasn't moving very fast but it was nothing I have ever seen before.  I really think it had something to do with the ice storm as it was a state of emergency. ((NUFORC Note:  We have responded to the witness, requesting a date for the sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68594.html",
      "state": "KY",
      "duration": "30 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b88ee",
      "summary": "I did not know how to report so i found this sight i am now 52 and most passegers are in there 68 -70.",
      "city": "louisville",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "I did not know how to report so i found this sight i am now 52 and most passegers are in there 68 -70. I was the pilot of a piper lance we departed from Shawnee Oklahoma about 16:00 inrout to Louvile Kentucky.  As we arrived in Louvile  approch airspace they lost me on there radar so they had me recicile my transponder it did no good we were on top of scatered cloud layer i had my autopilot on at the moment as i was talking to the controller i looked to my right wing and i saw a red and geen light changing and my passingers were seeing it to and they were gitting concerned.  I normaly let them listen to me talking to the controler but they were getting nervice so I truned the intercom of and I let them know that it was ok , I had the aircraft in sight and that I was talking to air trafic control.  I called trafic control they said that they had no one in my sector and they still did not have me on radar,I tolled them that i had a craft of my right wing and it would get close to me and then it would pull up front then back and the lights would change from red and gre! en my passanger were so unset that the one of me was tapping my back i told them to make sure there seat bealts were on and not to worry i have thing in controll something told me  to take my aircraft of autopilot the controller asked again about what i was seeing it allthe sudden came straight at us from my 2 Oclock I had to pullmy aircraft up with full power and rolled left we saw the craft hit the ground and it was round with a fire or flame around it,I had to settel my passingger down,i called controller he wonted me to go back and take better look i told him negitve that i did not have the full and i had to get my passengers down he said he was checking if there were any aircraft reported late and check for ELT i also checket and told him negitive on ELT.  controller finally had me on radar and gave victor to runway 17L we taxid and let my passenger of and into the terminal I had a conrtoller that meet me in terminal and asked questions my passengers just wonted to go to the bathroom . ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74175.html",
      "state": "KY",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a57",
      "summary": "strange object photographed over Louisville, Kentucky October 11, 2009",
      "city": "louisville",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "strange object photographed over Louisville, Kentucky October 11, 2009 between 5:45 and 6:00 pm sunday october 11 I and three others witnessed an object that appeared to change shapes from a sphere to a disc shape. the object was dark in color and at one time flashed the color red. It was first seen moving from the east/south east,to the northwest before it disappeared.It then appeared again in a the southern sky and seemed to move to the west then back to the east before moving south and disappeared completely. At one time it seemed to appeared and disappeared over and over again,but one of the people with me had a very good camera and snapped several shots of the object,and after looking over the picture it was noticed that the object wasn't disappearing at all, it was moving away at super high rates of speed and then moving back towards us. would like to know who to contact with these pictures because there are some really good ones that show the actual structure of the object.",
      "link": "http://www.nuforc.org/webreports/072/S72878.html",
      "state": "KY",
      "duration": "several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b15",
      "summary": "((HOAX??))  I was at a park at about 1 PM. I was on the swings. I looked up and saw three bright lights.",
      "city": "louisville",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "I was at a park at about 1 PM. I was on the swings. I looked up and saw three bright lights. They were slowly moving up and down. They were not planes or helicopters because they kept moving up and down. I looked away for a minute. When I looked back one had disappeared. This kept happening until the last one disappeared. ((NUFORC Note:  Witness indicates that date is approximate.  Possible hoax, we believe.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74374.html",
      "state": "CO",
      "duration": "10 minuts"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e20",
      "summary": "Black cone seen in broad daylight in Louisville, KY",
      "city": "louisville",
      "shape": "cone",
      "date": "2009-03-19T00:00:00",
      "story": "Black cone seen in broad daylight in Louisville, KY I was coming back from lunch and saw a black object in the sky to my right.  I watched it as I drove and then pulled off the road to get a better view and determine its speed, size, etc.  It was cone-shaped, with the open part up, but very nearly an isosceles triangle from my vantage point. It had what appeared to be a thin rod projecting from the bottom point of the cone.  At the end of the rod there appeared to be a shiny sphere. I watched it as it floated in a stationary position.  After about 3 minutes, a C130 took off from SDF, flew by the UFO, and then headed west.  The UFO then almost immediatly headed east and increased its altitude.  The craft appeared to move at about the speed of a helicopter, but remained perfectly vertical from what I could tell. This craft was completely black except for the shiny sphere at the end of the rod.  My theory is that its visual stealthing wasn't working properly.  I did not take a photo because I was concerned about getting in trouble.  My assumption at that point was that it was a US military stealth drone of some sort.  Now I'm not so sure and wish I had a picture so that I would know that I didn't halucinate. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68999.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b91ee",
      "summary": "what i saw is not of this planet .",
      "city": "louisville",
      "shape": "diamond",
      "date": "2009-12-12T00:00:00",
      "story": "what i saw is not of this planet . i was outside and i like to look up at the stars and i live close to the airport and i see planes flying over where i live on their way to the airport alot.well i seen this aircrart that was able to fly and stop in mid air, at any speed. it was bright then it would dim its light all the way out. it was dimond shape. ((NUFORC Note:  We have assigned an arbitrary time for the sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73209.html",
      "state": "MS",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b92bc",
      "summary": "the object moving erratically lasting for approximately 10 seconds near airport  500 Lights On Object0: Yes",
      "city": "louisville",
      "shape": "oval",
      "date": "2009-03-19T00:00:00",
      "story": "the object moving erratically lasting for approximately 10 seconds near airport  I work in the aviation business in Louisville, KY. On February 7, 2009, I was on ramp #1 of SDF airport watching the sunrise from my vehicle. It was around 7:40 in the morning. As the sun rose above the horizon, it quickly ascended into the blanket of clouds reaching beyond me. I proceeded to drive away, then I remembered I needed to go pick up some paperwork. I immediately turned back around and drove past where I was parked. After I drove for quarter of mile I was facing the security entrance which faces the southeast. As I was driving, I something caught my eye just above the security entrance below the blanket of clouds. I said to myself \"I have never seen a cloud that round before\". The round object stayed there for five to ten seconds and then it went up into the blanket of clouds. I saw a shadow of the object moving erratically lasting for approximately 10 seconds. The shadow then disappeared.  The conditions of the day were mostly cloudy. The ceiling was 3100 feet, winds were 18 mph from the Southwest and wind gust 26 mph. Temperature was 54 degrees and visibility of 10 miles.",
      "link": "http://www.nuforc.org/webreports/069/S69117.html",
      "state": "KY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b94a3",
      "summary": "Lights South of Louisville, KY.  ((NUFORC Note:  Jupiter and Venus.  PD))",
      "city": "louisville",
      "shape": "unknown",
      "date": "2009-01-10T00:00:00",
      "story": "Lights South of Louisville, KY Two bluish white lights in the southern sky due south of I-265 and Johnson School road.  Lights are hovering one looks like there might be a smaller blinking light on it.  No sound no disernable shape too low to be stars event has been ongoing for over 15 minutes these lights were not there last night. ((NUFORC Note:  Jupiter and Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67281.html",
      "state": "KY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b99a3",
      "summary": "A silver sphere spotted in Louisville Kentucky.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2010-05-12T00:00:00",
      "story": "A silver sphere spotted in Louisville Kentucky. On Greenbelt Highway after a thunderstorm, I stepped into a McDonalds restaraunt, looked out the window, and coming right down into the sky about 4 miles away was a white, almost silver or even copper, sphere came dropping down at a fast rate.  No one else seemed to see the object, and when I asked someone, they thought I was bonkers.",
      "link": "http://www.nuforc.org/webreports/075/S75176.html",
      "state": "KY",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b99bc",
      "summary": "Black Triangle over Louisville Ford plant.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2009-08-27T00:00:00",
      "story": "Black Triangle over Louisville Ford plant. I was driving along LaGrange Road, between I-265 and the watterson, when to my left there appeared to be a triangular shaped aircraft traveling very slowly. It appeared to be moving over the Ford plant. The craft seemed to be about 300 feet off the ground, judging by the trees. It was an equilateral triangle, made up of 3 white lights with another in the center. Two other flashing lights that switched from red to white were between 2 of the points of the triangle. It appeared to be moving left to right. I was unable to judge the size because of a lack of reference points. I am an 18 year old college student, I was driving alone that night, but it is in a densely populated area.",
      "link": "http://www.nuforc.org/webreports/071/S71647.html",
      "state": "KY",
      "duration": "10-15 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9bbc",
      "summary": "2 sighting of UFO over Ford Plant in a week, Being trailed by another aircraft.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2009-08-27T00:00:00",
      "story": "2 sighting of UFO over Ford Plant in a week, Being trailed by another aircraft. This is the second UFO I have seen in a week.  It was the same type of craft as before, in the same location, with a few differences. It was between I-265 and the watterson. I was observing it from LaGrange Road, in front of the Kroger, while stopped at a light.  It was again, an equilateral triangle of white lights, surrounding a red flashing light.  There were no other visible lights. This craft was heading right to left from my perspective. It appeared to be flying higher, or farther away, probably 500-750 feet. It was hard to judge because it was night. But this time, there was another craft following it, by my estimates, way to close to be 2 planes. It was closing the entire time until the disappeared behind some trees. The following craft could easily have been a small terrestrial aircraft. There appeared to be 2 other aircraft in the sky, but at a glace, they appeared terrestrial, and my attention was on the seemingly extra-terrestrial aircraft. I am an ! 18 year old college student, with a lifelong interest in aircraft. In High School I graduated with an over 4.0 weighted GPA. I have always been extremely skeptical of UFOs, and am searching for answers.",
      "link": "http://www.nuforc.org/webreports/071/S71648.html",
      "state": "KY",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d91",
      "summary": "Bright objects and flashes over Louisville,Kentucky.",
      "city": "louisville",
      "shape": "changing",
      "date": "2010-05-12T00:00:00",
      "story": "Bright objects and flashes over Louisville,Kentucky. At aproximately 9:30 pm Est I went out on the porch to smoke a cigarette when I noticed a really extremely bright light in the sky. It was unusual in its shape and size. The light was very very bright and seemed to be unstable as if beams were shooting out from all over it. A I watched this object, just to the left of it what at first I thought was a plane flew right into it.  I looked to the right thinking it was going fly past it and it did not. That is when I jumped up and told my son something is not right with that object I think it is a UFO. As we watched it within 3-4 minutes two white bullet  shapes objects came out of it,one on the left and one on the right. I ran in and grabbed my video camera and started filming it. We watched as its movements were irratic at times and at one time before it completely disappeared it came closer and then backed away and then disappeared. Within about 5 minutes it reappeared in the same area and to the right of it a red object appeared in the sky. The red object moved faster than any jet we had ever seen. It was if it was encircling the the white object. Then all of a sudden they disappear and we see flashes of white light as if someone was taking a picture and the flash was so bright. By now our neighbors were outside watching the activity and we noticed all the planes coming into our airport were circling away and we noticed jets taking off in the direction of the ufos. All of a sudden we hear a sonic boom and we look at the traces in the sky from the jets heading in that direction. I tried to video tape the red object and the happenings afterwards but for some odd reason I could not get it to film, all I got was static across my screen as I tried to film it. Witnesses: 1. I am self employed and a paranormal investigator. 2.Truck Driver 3.Caregiver 4.Student 5.Cook",
      "link": "http://www.nuforc.org/webreports/075/S75289.html",
      "state": "KY",
      "duration": "22:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d85",
      "summary": "Two crafts Hover over Neighborhoods",
      "city": "louisville",
      "shape": "changing",
      "date": "2010-06-03T00:00:00",
      "story": "Two crafts Hover over Neighborhoods It looks like a full moon, out.. and, as soon as I walked out my door, 'both' crafts caught my eye, immediately. Although, located in different parts of the sky, both craft seem to be fixed & hovering. Silently. One of the crafts, look to be triangular in shape, w/ a large solitary light (fixed to the bottom.)  The second craft, shapeshifted, almost immediately after i first saw it.  (It went from a large cigarshaped light, right to a ball of light) and its been pulsating in colors, wildly.",
      "link": "http://www.nuforc.org/webreports/075/S75553.html",
      "state": "KY",
      "duration": "its still in the sky"
    },
    {
      "_id": "64d005f478aba2ec5a3b9eeb",
      "summary": "Neon green burning light",
      "city": "louisville",
      "shape": "light",
      "date": "2010-06-10T00:00:00",
      "story": "Neon green burning light It was a cylinder shape bright green burning light, like you see when military jets turn on the after burners.  Only this was neon green and flying at an incredible speed, and didn't make a sound.  It was flying southwest approx 5000 feet when after around five seconds of seeing it vanished.",
      "link": "http://www.nuforc.org/webreports/075/S75679.html",
      "state": "KY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f71",
      "summary": "I witnessed what appeared to be a faint star moving at a high rate of speed.  Then after the first one left our sight we witnessed two",
      "city": "louisville",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "I witnessed what appeared to be a faint star moving at a high rate of speed.  Then after the first one left our sight we witnessed two more with the same characterisitcs.  At first I thought it may have been a high altitude jet, but when the others appeared that scenario lessend.  Then we saw two moving towards each other finally coming together.  When they came together there was a bright flash about 6-10 times brighter than they previously were, after the flash there was only one left and it continued on until it left our sight.",
      "link": "http://www.nuforc.org/webreports/070/S70146.html",
      "state": "KY",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba224",
      "summary": "Fast moving object with flashing red light near Louisville, Kentucky.",
      "city": "louisville",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "Fast moving object with flashing red light near Louisville, Kentucky. A few minutes after 10 p.m. on Tuesday, October 14, 2008, I was sitting on the deck in my backyard in Louisville, Kentucky when I observed a small round object with a red flashing light and a white light which was not flashing moving from north to south across a clear sky.    The object appeared to be spinning.   I was lying on a lounge chair facing west and looking toward the sky when I first observed the object coming from the north.   The northern horizon is not visible from our house due to large trees in the neighborhood.   I observed the object first as it came into view in the sky above the trees obstructing my view of the northern horizon. I am not good at judging altitude, but I would guess that the object was at least a couple thousand feet in the air.  We live eight miles southeast of the Louisville International Airport.   The object did not come from the airport and was not going there-it was not in any kind of a holding pattern, and it was moving too fast to be a plane.   It was too high to have taken off from or to be landing at the Louisville International Airport.    I could not hear any noise from the object, but due to the constant drone of the traffic on my street and on nearby Bardstown Road, it is likely that any noise the object was making was drowned out. The sky was completely clear, and the moon was full.  Visibility of the nighttime sky is never good in my neighborhood.  We live two blocks from a major Louisville thoroughfare, Bardstown Road, and the city lights make spotting even any of the constellations difficult.  Despite the completely clear sky, few stars were visible. As I was watching the object move across the sky, my wife opened the kitchen window and asked me what I was doing.  I asked her to come outside.  She and my 15 year old daughter came out on the deck as the object was nearing the southern horizon.  They also observed the object and were unable to identify what it was. I would be interested to learn if anyone else in the Louisville area observed this object.",
      "link": "http://www.nuforc.org/webreports/066/S66229.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba41b",
      "summary": "White Light Object appears in the sky and speeds away below the horizon",
      "city": "louisville",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "White Light Object appears in the sky and speeds away below the horizon While driving south on Interstate 65, a bright light in the sky off to the left and up from the horizon about 25 degrees appeared.   The light was very distinct and vivid against the clear blue sky and no more than a mile away.  It appeared to be hovering or just stationary.  There was no movement for at least 4 to 5 minutes before it accelerated incredibly fast to the south, where it suddenly made a 45 degree turn toward the east.   It disappeared below the horizon.",
      "link": "http://www.nuforc.org/webreports/067/S67822.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba49d",
      "summary": "white sphere three other spheres seperated from first sphere.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2009-06-09T00:00:00",
      "story": "white sphere three other spheres seperated from first sphere. saw white sphere traveling south went over head and three other spheres split or shot out of first sphere",
      "link": "http://www.nuforc.org/webreports/070/S70290.html",
      "state": "KY",
      "duration": "30-60 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3ba4e7",
      "summary": "several lighted triangular shaped objects hovering in the sky",
      "city": "louisville",
      "shape": "triangle",
      "date": "2009-04-14T00:00:00",
      "story": "several lighted triangular shaped objects hovering in the sky At about 11:25PM I was driving home from work down a main road and I noticed an object slowly going across the road in the distance. There where at least 2 extremely bright lights visible and 1 red light. The object was at least 3 miles from me down the road. I slowed down as I got closer and happened to look to the left and I saw another object not more than 40 feet from me. I could almost clearly see this object. It was shaped like a triangle with a dent in the middle, like a mouse pointer. There were a row of white lights from the tip to the end and a red light at the very end. I could tell that it was dark grey at the top and light grey on the underneath. As I slowed down to watch and to try to get a picture, the object moved behind a row of houses and some trees then it hovered over one houses roof about a foot from it. None of the houses had lights on. I turned down a side street to try to get closer and watched another object with similar bright lights fly very quickly across the sky far in the distance for about 50 seconds. I turned back down the main road from before and onto the same side street and another object was flying directly above my car. It was shaped exactly like the object from before, triangular and with a row of white lights with one red light at the end. There was no noise, as with an airplane and the object flew very quickly as I guess it realized I was there and took off to quickly for me to see or follow. I continued down the road and parked in front of my house when I saw at least 3 more objects. When I finally came inside it was about 11:40PM. After coming inside, I have seen at least 5 normal planes flying across the vicinity in the past 5 minutes.",
      "link": "http://www.nuforc.org/webreports/069/S69463.html",
      "state": "KY",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8ed",
      "summary": "bright orange ,very high in space,going from south to the north--going a a fast speed!",
      "city": "louisville",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "bright orange ,very high in space,going from south to the north--going a a fast speed! The color was orange and it was high as the space shuttle orbit, it came out of the south going north at a fairly fast pace, it never moved from its path, it went out of sight to the north!  It was not an air plane because it was flying at a very high distance in space like the shuttle flys today!!! It was the size of a pea to my eye sight because of its height i could not tell what the ufo was but i think it was not one of ours!!!1 ((NUFORC Note:  Date of sighting in December 1975 appears to be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78001.html",
      "state": "KY",
      "duration": "4mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bab05",
      "summary": "A smear of bright multi-colored lights in the sky, lasting for only an instant.",
      "city": "louisville",
      "shape": "flash",
      "date": "2010-11-21T00:00:00",
      "story": "A smear of bright multi-colored lights in the sky, lasting for only an instant. I stepped out of my car and saw a flash of light above the roofline of my neighbor's house.  At first I believed someone had set off a firework display, but immediately realized something was odd about it.  For one, there was no sound at all, no pop or boom that would accompany a firework going off.  Also it lasted only a split second and it was very condensed. It did not expand and then slowly fade out as a firework would.  This was simply there and then it was gone as if it winked out or it was moving very fast.  I only saw it for literally a second, but i remember there were multiple bright colors of lights. I would describe it as a smear in the sky of bright pink, green, blue, maybe others.  Individual points of colored lights of various brightness. I just kind of stood there a few moments waiting to see if i could see it again.  I got in and out of the car a couple times to make sure i wasn't just seeing a reflection or something.  The sky was clear and there w! as no lightning or any weather effect that I could determine.  I realize a split second sighting is essentially useless, unless somebody else happened to see something odd last night, but whatever it was, it struck me as odd.",
      "link": "http://www.nuforc.org/webreports/077/S77887.html",
      "state": "KY",
      "duration": "1 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bab11",
      "summary": "I seen about 12 objects that were in the shape of a triangle, that had lights on them. Some looked as if they were burning. There was n",
      "city": "louisville",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "I seen about 12 objects that were in the shape of a triangle, that had lights on them. Some looked as if they were burning.  There was no sound, and I could not make out the color due to the night sky. The sky was clear and the stars were out but these things moved very slow and was in pairs.  They were moving north toward downtown area. Several times they disappeared and then reappeared again with the same shape and lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77895.html",
      "state": "KY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bad38",
      "summary": "Blk Triangle craft mimics aircraft in Metro louisville.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "Blk Triangle craft mimics aircraft in Metro louisville. This is no hoax. I swear to you. For the past year I've seen odd things in a certain area in Louisville. It is craft that are mimicing normal aircraft, kinda.  It sort of looks like an airplane, but it's not.  I have lived near an airport for 16 years so I know aircraft! The lights are weird, and it makes no sound, and hovers, and goes fast real quick. I have saw it 4 times in a year. I'm going to tell you about the most important sighting. In July of 2010 at 11pm a friend and myself was driving on I-64 heading one into Louisville. Up on my left I noticed some bright lights, three or four whites & one larger red at an unusually low altitude. At first, I thought maybe it was from a tower of some kind, but it was too big and was definitely some sort of craft. It looked like plane lights kinda, but it wasn't moving at all.  It hovered at about 700 to 1100 feet. I could not see the shape because of the brightness of the object.  Then it started moving and turning/rotating, and for a moment I saw it outlined against the sky. It was a black triangle probably about 30 to 40 feet long. It hovered/turned to where the wings were facing the ground as if turning a tight turn. Then it moved out of sight VERY quickly. Probably a mile in 15 to 30 seconds!   Then it came back just as fast!  Needless to say, we were shaken as we drove out of ! view. This was right off the freeway. I have seen these lights other times as well. Something is up with this certain location. Want to see what it looks like? Look up Oxicarian Ufo on youtube.com and you will see what I saw. To the Tee!!! I researched what we saw and me & the other witness agree that that was it. And yes, this is 100% the truth!!!! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79487.html",
      "state": "KY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bae57",
      "summary": "leaving work at the city's airport when i observed a bright white sphere traveling at high rate of speed moving north to south at appro",
      "city": "louisville",
      "shape": "sphere",
      "date": "2011-05-02T00:00:00",
      "story": "leaving work at the city's airport when i observed a bright white sphere traveling at high rate of speed moving north to south at approx. 800-100 feet.   It flew directly over my car and i was able to observe object thourgh my open sunroof as it sped overhead silently.   Object moved into the distance and suddenly disappeared.   I dont suspect it to be a meteor as it had no tail and did not illuminate the night sky, as well as airport/city lights make star and meteor gazing difficult.  I've also worked around aircraft for 17 years so im familiar with the coming and goings of planes, helicopters, police search lights etc..",
      "link": "http://www.nuforc.org/webreports/080/S80872.html",
      "state": "KY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2db",
      "summary": "Red flashing light headed south/southwest over Louisville, KY, clear sky, no clouds.",
      "city": "louisville",
      "shape": "light",
      "date": "2011-03-23T00:00:00",
      "story": "Red flashing light headed south/southwest over Louisville, KY, clear sky, no clouds. I was heading West on I-265 in Louisville, KY at about 9:35 pm March 16,2011.  I saw a flashing red light heading south/southwest in a clear sky with no clouds.   Object disappeared just before 9:45.",
      "link": "http://www.nuforc.org/webreports/080/S80497.html",
      "state": "KY",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb10",
      "summary": "3 orange fireball crafts traveling at an enormous speed but very high, meeting up and vanishing.",
      "city": "louisville",
      "shape": "fireball",
      "date": "2010-07-06T00:00:00",
      "story": "3 orange fireball crafts traveling at an enormous speed but very high, meeting up and vanishing. I was on the waterfont (Ohio River) of Louisville, Kentucky on 2010 4th of July.   A concert was going on and fireworks were to be expected later.   I happened to look up and noticed a craft that was unexplainable.  I studied harder and harder, as did my boyfriend and human aircraft was not coming up as a logical option.  It was traveling very fast but you could tell it was so high that it wasn't going from point A to B in a snap, as others describe sightings often.  It was the type of thing that when you looked away for a few seconds, and tried again to sight it, it would be much further east.  (Kentucky facing Indiana).   Eventually it got to be at such an elevation, it was hard to keep up with and make out anymore.  Moments later, I noticed even further southeast, it seemed to have two other identical objects waiting for it.  As my boyfriend and I were making our way to the port-o-john's, also in their direction, we looked up and all three were gone.  He said others around us were pointing and had also noticed.  This would have been a great time to discuss it with others had it not been for the loud music.   I was so perturbed, I came home and \"googled\" it instantly and found that someone else on www.godlikeproductions.com had witnessed the same thing as well as his wife.  He remains anonymous, but I suggested that it is okay, I saw the exact same thing, and he and I both captured it with camera.  I had seven still photos, and am regretting not video taping it.   I have always been intrigued by extra-terrestrials as well as government cover up and am excited and feel betrayed at the same time.  I am so desperate to know more.   Please contact me back.",
      "link": "http://www.nuforc.org/webreports/076/S76136.html",
      "state": "KY",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb12",
      "summary": "red light, flying above the fireworks but under the clouds.....",
      "city": "louisville",
      "shape": "light",
      "date": "2010-07-06T00:00:00",
      "story": "red light, flying above the fireworks but under the clouds..... In the night sky on the 4 of July in Louisville, KY, just above the fireworks and below the clouds there was a light, it was red with some yellow to it.  I live by Louisville international airport and this is was no plane.   It had only one \"running\" light as where the planes have at least two on each wing, where as this light just looked liked a ball.  The light made two or three different passes.  Each time it would go south and disappear into the clouds and then appear to be moving east to north kinda like it was circling around and then back to the south where it disappeared into the clouds.  The police did have their helicopter out but the helicopter lights were blue and white.  This red light looked like it was to high in the sky to be a regular civilian helicopter.",
      "link": "http://www.nuforc.org/webreports/076/S76142.html",
      "state": "KY",
      "duration": "30 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bbb65",
      "summary": "In 1953, at the age of 3 years old I was Contacted by what is described as a \"GREY\".  This happened in Ky in 1953.",
      "city": "louisville",
      "shape": "other",
      "date": "",
      "story": "In 1953, at the age of 3 years old  I was Contacted by what is described as a \"GREY\".  This happened in Ky in 1953.  Now, as to why I was there since I am from Indiana,  My mother and Father and I was living out of a car since my dad did not have a job and we lived basically out of a car.  We were somewhat like gypsy's and mom and dad would get work with Carnivals.  Tv was almost NONE EXISTENT since we had no home most of the time.  Now, I mentioned this because I was NOT influenced by any tv program that might have made me \"DREAM\" what happened to me.  I am entirely SERIOUS about what happened to me!!!  Make no mistake about it.It has perplexed me for years, and only recently I found out that there are places like this to report things of this nature.  I think this might intriuge you as what was said to me by my Mother only about three years ago, SHE TOLD ME that at the age of nine or ten she was ABDUCTED and taken up into a ship that had NO CORNER'S in it!  This is important since mom had NO WAY of knowing that reports given by OTHER abductee's reported the SAME THING! I almost fell out of my chair when she related her experience to me. I NEVER knew about it till three years ago!!!!!  I was telling her of my experience, and that is when it came into the conversation about mom.  Now, my EXPERIENCE as I call it. My Grandmother and Grandfather had to come to Ky to retreive me since my mom anmd dad were about to go away to prison for an extended period of time.  They brought a travel trailer with them for us to stay in till the end of mom and dad's trial.  This, is where the CONTACT came to me. Grandma had made a palete on the floor beside there bed in the back of the trailer.  I was sleeping and awoke abruptly and had the distinct feeling before opening my eyes something was LOOKING at me, and, IT WAS! Standing over me was an odd looking creature THIN in nature with an oval looking head with large dark eyes.When it saw that I was aware of it b! eing there, it raised up straight, turned to the right and in ! a Jerky strobe light looking way, turned to the hallway, and about half the way down the hall simply VANISHED into what I call \"THIN AIR\", or disapeared or whatever you want to call it. I remember this event as if it was yesterday, and can remember every aspect of it. I have had other instances in my life and in one instanse even had a wittness to it that scared the crap out of him so much so he ran into the house because tyhings outside during this event was \"NOT RIGHT\". That would be another story another time. I am a Nam Vet and also had experiences with that too. As if I was being informed of danger ahead of time. I was a Pointman with the 173rd Airborne Brigade. This is important to me to know there are other's out here that KNOW of there existence, and KNOW what I have gone through all these years. This is NO JOKE! And, I do not take lightly, ANYONE taking what I relate to them LIGHTLY either! I want answers and I will do whatever it take s to find out the \"WHY\".   I thank you for your time. Kenny ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84502.html",
      "state": "KY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc354",
      "summary": "Very large red orb, changing to green. Silent and hovering, then making unnatural maneuver.",
      "city": "louisville",
      "shape": "oval",
      "date": "2011-12-12T00:00:00",
      "story": "Very large red orb, changing to green. Silent and hovering, then making unnatural maneuver. During the morning of November 25th 2011 at 4:55 am I witnessed a bright red orb in the northeastern sky.  The object continued to hover in the same spot for some 12 minutes.  It was unlike anything that I've ever witnessed and at one point changed to a very bright blue/green color.  After realizing that this could not have been a helicopter because it made no sound whatsoever yet was within 1/2 a mile from my location, my concern prompted me to wake my roommate.  We were both in amazement because again, we had both never seen this type of foreign abject before. Quoting my roommate \"I've been looking my whole life to spot a ufo and as much as I've wanted to see one, I can truly say that until this moment I never have\"   We both cannot believe that this object can in any way be of this world. After observing for about 12 minutes the object suddenly moved vertically at a medium speed, then in a flash moved horizontally to the west and disappeared.",
      "link": "http://www.nuforc.org/webreports/085/S85494.html",
      "state": "KY",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc36a",
      "summary": "Red/Orange fireballs over Louisville, KY, USA on New Year's 2012",
      "city": "louisville",
      "shape": "fireball",
      "date": "2012-01-12T00:00:00",
      "story": "Red/Orange fireballs over Louisville, KY, USA on New Year's 2012 Right after midnight on New Years Eve, I witnessed strange lights in the sky near Shenanigans Pub (Corner of Norris and Deerwood) in Louisville. Several other patrons saw the lights and I was able to snap a few photos (attached) and my friend was able to record some video. The lights were orange glowing balls and travelled generally south to north and appeared to be powered. Ambient noise from the bar was loud so I couldn't hear if the lights made any noise. They travelled one after another along the same path at erratic intervals, although usually around twenty or thirty seconds apart. They travelled in a straight flight path and that path generally drifted and changed to the northwest as the event took place. They were below the cloud cover, but one did go through the lowest clouds. I estimate I saw around twenty and that the whole event lasted 10 or 20 minutes. To recap, they travelled at approximately the same altitude and along the same path. They glowed a dark orange and didn’t seem to flash. When viewing them through my camera phone they seemed to flash at a constant rate. My friend who also witnessed the event is a pilot and called Standiford Field air traffic control (Louisville International Airport) and they said they had nothing flying in the area. Both of us called the police and the dispatcher said we were the only people to call it in. And we called a local news station tip line who told us we were the only callers to report the event. I also emailed all four local news stations with the facts and photos on January 1st and received no response. Finally, in one of the photos some non-glowing spots are visible. I’m didn’t see those during the event so I’m not sure if they are due to reflections or some other camera error, or if they are related to the event.",
      "link": "http://www.nuforc.org/webreports/086/S86293.html",
      "state": "KY",
      "duration": "15-20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc4b6",
      "summary": "Bright UFO lights over louisville sky",
      "city": "louisville",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "bright UFO lights over louisville sky after returning home at 7:00pm in my driveway,I notice nine very bright lights in the clear night sky,  Four lights straight across and the other five lights zig zag all the lights move slowly across the sky from the south to the north about 1min. and a half.  Then all the lights slowly move upward and out of sight.",
      "link": "http://www.nuforc.org/webreports/085/S85698.html",
      "state": "KY",
      "duration": "1 min and half"
    },
    {
      "_id": "64d005f478aba2ec5a3bc63d",
      "summary": "green glowing craft moving very fast across entire sky.",
      "city": "louisville",
      "shape": "light",
      "date": "2011-10-25T00:00:00",
      "story": "green glowing craft moving very fast across entire sky. I was about 10:15 p.m. oct 19 2011 when i was walking to my car outside on the corner of south boulder road and Mcaslin Blvd. in louisville co. at one point i glanced up to the horizon and immediately noticed a bright lime green object flying across the sky north to west. the object appeared to be a small cigar shaped craft emitting a bright green luminescence leaving a long trail behind it that was just a bright as the craft it self. this UFO was moving at an amazing speed. it seemed to cross the entire span of distance that the eye can see in a matter of about 3 seconds. it made no noise and seemed to be flying only a few miles above the ground.",
      "link": "http://www.nuforc.org/webreports/084/S84678.html",
      "state": "CO",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc6c0",
      "summary": "Louisville, Kentucky 5 minutes",
      "city": "louisville",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "Louisville, Kentucky 5 minutes At 9:00 pm, 10-15 total red circular objects each faded or went completely dark in from the east heading west, as 2-3 formed a straight line more came in behind to line up, up to 10 in a matter of 30 secs.  Moving very slow, no sound, as they got over the house they red light faded, till they just disappeared.  However, you could see the circle outline as they passed over the city horizon almost transparent. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84391.html",
      "state": "KY",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3bc73b",
      "summary": "Redish Orange shift changing object in the sky that shot up to the stars and vanished",
      "city": "louisville",
      "shape": "changing",
      "date": "2011-10-25T00:00:00",
      "story": "Redish Orange shift changing object in the sky that shot up to the stars and vanished As I was getting in my car I looked up and it was dark out, I looked at this orange/red square that changed into a weird shaped egg-corn, I saw something inside liek the shadow of a being in form, of a human shape.  It suddenly shifted and went stright into the sky between two stars, I have pictures",
      "link": "http://www.nuforc.org/webreports/084/S84693.html",
      "state": "KY",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc89b",
      "summary": "We have been seeing the same shaped object over a certain area for a few weeks now. Numerous people have seen it.  ((Star or planet??))",
      "city": "louisville",
      "shape": "circle",
      "date": "2011-10-25T00:00:00",
      "story": "We have been seeing the same shaped object over a certain area for a few weeks now.  Numerous people have seen it and also have contacted the local news. We also ahve some video and pictures of the objects.",
      "link": "http://www.nuforc.org/webreports/084/S84771.html",
      "state": "KY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bcb62",
      "summary": "At approximately 21:45 me and a friend saw a strange orange ball in the sky making a series of irradic moves. It was hard to say how bi",
      "city": "louisville",
      "shape": "light",
      "date": "2011-07-06T00:00:00",
      "story": "At approximately 21:45 me and a friend saw a strange orange ball in the sky making a series of irradic moves.   It was hard to say how big it wad because of darkness but it was moving all over the place it hovered and sped up and made moves no helicopter or plane or even firework could make after about 3 or 4 minutes it started moving east north east and finally disappeared.   We still have no idea what it was but I've heard from several people who saw the same thing around the same time",
      "link": "http://www.nuforc.org/webreports/082/S82192.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb64",
      "summary": "Orange bright ball of light going across the sky",
      "city": "louisville",
      "shape": "fireball",
      "date": "2011-07-06T00:00:00",
      "story": "Orange bright ball  of light going across the sky A goup of us were standing out in drive way and saw over a tree line what appeared to be a bright ball of light going across the sky and then was gone.",
      "link": "http://www.nuforc.org/webreports/082/S82234.html",
      "state": "KY",
      "duration": "30 sec-1min"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbf6",
      "summary": "Small fireball object in the sky that moved real slow, stopped  a few seconds and then was gone.",
      "city": "louisville",
      "shape": "circle",
      "date": "2011-07-06T00:00:00",
      "story": "small fireball object in the sky that moved real slow, stopped  a few seconds and then was gone. My husband and I were on our back deck watching fire works.   We looked to the right of us and noticed a small round object that looked like a small fire ball in the sky.  The object was moving very slow, stopped for a few seconds and then was gone.",
      "link": "http://www.nuforc.org/webreports/082/S82236.html",
      "state": "KY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bccf5",
      "summary": "White light grew in size and disappeared.  ((NUFORC Note:  Possible flare from Iridium satellite??  PD))",
      "city": "louisville",
      "shape": "light",
      "date": "2011-06-27T00:00:00",
      "story": "White light grew in size and disappeared. I was taking my dog out before bed when I heard this loud airplane roaring above, so I looked up in the sky and saw this solid white light passing near the plane.  All of a sudden it grew about 5 times in size for about 2 seconds, turned a light bluish color and then shrank until I couldn’t see it anymore.  The strange thing is it appeared to be traveling away from earth not north, south, east or west. It was a clear night sky and lots of stars were out. ((NUFORC Note:  Possible flare from Iridium satellite??  We have amended the date above, in order to reflect a nighttime sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81897.html",
      "state": "CO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcdcd",
      "summary": "Yellow Light with trail of sparks arcing across the sky",
      "city": "louisville",
      "shape": "fireball",
      "date": "2011-06-12T00:00:00",
      "story": "Yellow Light with trail of sparks arcing across the sky Me and my friend were driving to my house, and along the road, I had looked up, and i saw what looked like a plane with a trail.  But the trail could have been my bad vision blurring the light into something else.  But then it started shooting a trail of sparks like a firework, and i turned to my friend and I told him to look up and see it too.  and he did and he saw it as well.  It was a more yellow light, rather than a white light.  And we thought it could have just been a firework, but then it started making a perfect arc in one direction, then turned and went upwards making another perfect ark.   We then got out of the house, and the sky sounded completely silent. At this point we started freaking out and considering our options.  Was it a jet that caught fire and was crashing? A new type of fire work?  But it looked like it was directly above Denver. We drove past a few houses and trees that blocked our sight from it.  And before i knew it it was gone. The trail coming off of the light was maybe seven sparks long at first, but then it grew in length to about possibly twenty sparks.  It almost looked like something was cutting a hole in the sky with an angle grinder.  But obviously it wasn't.  Hope this information is useful.",
      "link": "http://www.nuforc.org/webreports/081/S81727.html",
      "state": "CO",
      "duration": "30 seconds or so"
    },
    {
      "_id": "64d005f478aba2ec5a3bd280",
      "summary": "Glowing orange ball traveled across the sky in Fern Creek area",
      "city": "louisville",
      "shape": "disk",
      "date": "2012-08-05T00:00:00",
      "story": "Glowing orange ball traveled across the sky in Fern Creek area My family and I gathered on the deck behind our house in the Fern Creek area of Louisville, Kentucky around 10 pm eastern time to watch the neighborhood fireworks being lit on 4th of July.  I, my wife, and 2 teen aged daughters were present. At 10:11 pm, a glowing orange object appeared in the northeastern sky.  The object was traveling very quickly in a southeast direction, and it disappeared in the southern sky about 30 seconds later.  The object was flying at an altitude lower than airplanes in the area travel.  The object did not make any sound.  It was evident from both the altitude of the object, the distance it traveled, its size, and the fact that it made no sound that it was not fireworks. The fireworks being lit in the neighborhood were of the consumer variety, not the kind used by professional fireworks show producers. One witness, my 19 year old daughter, described the object at \"a  round orange ball.\"   She also described it as looking like \"a crown.\"   My wife described it as \"glowing,\" and appearing to look like \"a hot air balloon.\" My 14 year old daughter described it as \"red, glowing, pentagon of fire.\" Due to the area’s proximity to the Louisville International Airport approximately 8 miles away and Bowman Field airport about 5 miles away, there is a lot of aircraft in the area at all hours of the day and night.  However, it was evident to all of us this was not a commercial or private aircraft.",
      "link": "http://www.nuforc.org/webreports/090/S90404.html",
      "state": "KY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd2a0",
      "summary": "Bright orange objects over Louisville, KY",
      "city": "louisville",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Bright orange objects over Louisville, KY I stepped outside with a friend to get some air and noticed a round orange &quot;fireball&quot; object going from the northwest to the southeast approximately 1000 to 1500 feet above the ground.  The light was moving about the same speed as a small plane, and was moving steadily and in a different direction than the wind. At first, we thought it might be some type of Chinese lantern, but the object did not flicker and was moving slightly against the wind.  The object finally drifted into a hazy cloud bank and dissappeared. About 2 minutes later we spotted another object going in the same direction and speed but higher up and a little south of the first object.  We watched this object until it was obscured by some trees. The third onject was about a mile north of the first object and was only in view for a few seconds before being obscured by trees. The fourth object appeared about 3 minutes later, and was almost overhead.  The object was also going in the same general direction, but a little lower.   We watched it cross the sky for almost a minute before it just seemed to fade out. We waited for another 20 minutes but saw nothing further. These objects were a bright orange color, solidly lit, and moved in a steady speed and direction.  They did not flicker, and were not affected by the wind. We were both a little freaked out, and tried to rationalize the sightings with prosaic explanations like small planes, Chinese lanterns, balloons etc.  But there was no noise, and if they were balloons or lanterns, they would have to have been released a mile or two from each other, and at different times rather than from the same place and all at once. I sincerely hope someone else in the area noticed these objects too!   Although this was on the fourth of July, it had nothing to do with fireworks",
      "link": "http://www.nuforc.org/webreports/090/S90518.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bde10",
      "summary": "Blue light reversing direction at high speed",
      "city": "louisville",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "Blue light reversing direction at high speed A blue light about the size of a large star was moving thru some clouds at a high speed then suddenly reversed direction and angled upward and out of the clouds at a high speed.",
      "link": "http://www.nuforc.org/webreports/091/S91752.html",
      "state": "KY",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be07c",
      "summary": "Dimly",
      "city": "louisville",
      "shape": "fireball",
      "date": "2012-08-19T00:00:00",
      "story": "Dimly Traveling home from a family dinner, we were just a few minutes from our house turning into the neighborhood adjacent to our own when a strange light caught my attention in the sky.  The reason it caught my attention was because it wasn't very high in the sky and it was a dim orange color, almost like a dull overhead highway light.  It was pretty still so I had time to notify my family in the car and the odd nature of it's position in the sky.  It wasn't high enough to be a plane (plus it wasn't moving) nor was it low enough to be a street light.  My wife reminded us that when we left there were several hot air balloons in the area, however it was pretty dark and it was unlikely they were still floating around. As we continued to drive we were now moving in a different direction so we were watching from the side window and now the object appeared to be almost like a fireball but we knew it wasn't because if it were an actual fireball it would have been much brighter however we thought it might be possible of it was a leftover hot air balloon in terrible distress.  We took another turn now heading towatds the object and were expecting to get a better view oit the front windshield when the object appeared further away even though we knew we were moving closer to it.  At this point the object gradually moved directly up and out of sight leading all of us to conclude that this was something very different.  We don't normally believe in such happenings but this occurrence doesn't leave a whole lot of other explanations that we are aware of which lead us to the iternet when we got home.  Most surprising from our internet research was reading other descriptions of sightings that included fireball like observations further validating what we know we observed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91772.html",
      "state": "OH",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be364",
      "summary": "Brightly lit object flys slowly over treeline and vanishes",
      "city": "louisville",
      "shape": "disk",
      "date": "2012-05-29T00:00:00",
      "story": "Brightly lit object flys slowly over treeline and vanishes At about 24:45 I came out onto my patio, facing NW and across the street I saw a disc like object directly above the treeline.  It caught my attention because there were 3 flashing lights, 2 red on the outside and a white one in the middle.  The outer red lights were blinking as it began going to the right.  Then making no visible turn stopped and began going to the left.  The outer red lights then flickered out one a time and the white light seemed to get brighter.  At this time I could no longer make out the shape of the craft, just see the bright white light.  There was no sound. It looked like a star, very low, directly above the treeline and it moved to my left (West) very slowly across the sky.  Then it faded like it was never there.  Directly after the light faded 2 planes flew in the same direction from the same distance and I could visibly see all the lights on the planes.  They did not fade out as the previous object had.",
      "link": "http://www.nuforc.org/webreports/088/S88983.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be7a9",
      "summary": "One was very bright, cylinder shape, other two less bright not sure of shape.",
      "city": "louisville",
      "shape": "cylinder",
      "date": "2012-06-14T00:00:00",
      "story": "One was very bright, cylinder shape, other two less bright not sure of shape. This is the second time seen lights from Kroger in fern creek parking lot.   Hovering over an area near seatonville rd.(or what looks like it) not sure how long they were hovering.  Noticed a helicopter or airplane of some sort nearby.",
      "link": "http://www.nuforc.org/webreports/089/S89571.html",
      "state": "KY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3beaef",
      "summary": "Orange colored light with aura zig zagging in a westwardly fashion",
      "city": "louisville",
      "shape": "sphere",
      "date": "2012-02-10T00:00:00",
      "story": "Orange colored light with aura zig zagging in a westwardly fashion ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86998.html",
      "state": "KY",
      "duration": "<1min"
    },
    {
      "_id": "64d005f478aba2ec5a3bef22",
      "summary": "3 hovering triangular shaped craft.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "3 hovering triangular shaped crafts In direction of Louisville Standiford field airport.  3 triangular shapes hovering for some minutes--one large and 2 smaller, same configuration of redlight on top and lower white lights.  2 smaller moved horizontally and then dropped out of sight.  Larger one still hovering as I write this report after viewing about 10 minutes.",
      "link": "http://www.nuforc.org/webreports/096/S96704.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf4ec",
      "summary": "A group of at least 100 lights in the sky on Sunday night, June 30, 2013 at 11 p.m.",
      "city": "louisville",
      "shape": "unknown",
      "date": "2013-07-14T00:00:00",
      "story": "A group of at least 100 lights in the sky on Sunday night, June 30, 2013 at 11 p.m. 06/30/13 Sunday Night at 11 p.m. My husband and I saw a group of at least 100 lights in the sky on Sunday night, June 30, 2013. This happened at 11 p.m.  The lights traveled east to west and were gone in a matter of 2 to 3 minutes. They may have been traveling along the Ohio River. These lights were fairly high in the sky, upper cloud level, and moved at a fast past. The group seemed to swarm across the sky.  There were some near the edges of the group, the group was traveling in a rather loose round or ball shape.  Near the edges of the circle there were lights that were moving in and out of the group. There were also stragglers that quickly caught up with the group as they moved across the sky.  These lights appeared smallish and they had blinking red, blue, green, yellow lights.  These color-changing lights appeared to be like an LED light. I have lived near the airport almost all my life and have never seen or experience anything like I saw that night.  There was no nose.  There was no wind, at least at the ground level on that evening. I was so shaken; I placed a call to 911 and sent an email to the local television station.  I thought for sure someone else would have seen the phenomenon but I cannot find any other report online.",
      "link": "http://www.nuforc.org/webreports/099/S99868.html",
      "state": "KY",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf52c",
      "summary": "Orange illuminating round object.  Kept level altitude.",
      "city": "louisville",
      "shape": "light",
      "date": "2013-07-14T00:00:00",
      "story": "Orange illuminating round object.  Kept level altitude. Was traveling southwest on Cane Run road near the Greenbelt and saw an orange light that appeared to be fairly low in the sky.   It looked roundish and seemed to be solid.  It did not appear to be a firework of any sort but kept an even altitude.   Saw the same object on 7/6/13 on Robbs Lane with the same witnesses-two adults a teenager and a 10 yr old.   Please see that report also on this forum.",
      "link": "http://www.nuforc.org/webreports/099/S99929.html",
      "state": "KY",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5ab",
      "summary": "My girlfriend and I saw moving lights this morning that looked piloted by humans, but they areas  far away as a star!",
      "city": "louisville",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "My girlfriend and I saw moving lights this morning that looked piloted by humans, but they areas  far away as a star! My girlfriend and I had gone outside to check her vehicle before she headed home to get ready for work.  The sky is very clear and looks beautiful.  To our amazement we see four tiny lighted circles so far away that they look like stars.  However they are moving at a fast rate, in a straight line, one behind the other.  One set is moving South West towards North East of our location.  The other pair North to South of our location.  They did not fly as if programmed by computer, but as if piloted by a person from inside the craft.  I have never seen anything like it before.   P.S. We went outside around 3:30 this morning and the lights had been visible for about five minutes.",
      "link": "http://www.nuforc.org/webreports/097/S97207.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf658",
      "summary": "Red/orange lights flyng thru sky the fading over General Electric Factory, no sound",
      "city": "louisville",
      "shape": "light",
      "date": "2013-09-30T00:00:00",
      "story": "Red/orange lights flyng thru sky the fading over General Electric Factory, no sound Red/orange lights flyng thru sky the fading over General Electric Factory ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102533.html",
      "state": "KY",
      "duration": "10-15"
    },
    {
      "_id": "64d005f478aba2ec5a3bf98e",
      "summary": "Low flying, slow moving triangular shape with red pulsing lights at corners flew over Louisville, Ky.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2012-12-20T00:00:00",
      "story": "low flying, slow moving triangular shape with red pulsing lights at corners flew over Louisville, Ky I was in the kitchen preparing dinner when I felt the vibration and rumble of a low flying aircraft.  It was right on top of this house.  I continued cooking, but realized that it persisted and seemed to be hovering above my house.  I opened the kitchen door to the garage and could see flashes of white light in the alley coming through spaces on the overhead door.  I assumed it was our local police helicopter circling in search of a suspect.  This is not unusual.  This is a ranch style house and the path the craft was flying meant it flew slowly over the length of the house.  The rumbling lasted so long that I went to the deck in the backyard and noticed a large object which was apparently triangular in shape because there were pulsing red lights at each of its 3 corners.  I didn't have my glasses on and am near sighted, but I could determine that the object was slowly moving northward and was crossing a busy east/west street heading towards Portland. I had time to run and get my glasses.  Then I observed a car, headed eastward had pulled over and was watching this thing cross over the street.  The craft was likely following the path of the river which is to our west.  I watched in disbelief because although it was dusk, it was only dinner time and this thing flew right over a densely populated neighborhood with lots of people still out.",
      "link": "http://www.nuforc.org/webreports/094/S94684.html",
      "state": "KY",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa17",
      "summary": "Bright Orange Light...",
      "city": "louisville",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "Bright Orange Light... Noticed an unusual colored light in South West sky, bright orange light was moving slowly just above low cloud cover, slowing down and speeding up, then light moved slightly northward and became smaller, yet brighter and the bright light eventually stopped shining.  There were no noises during the event, and from my perspective, the light looked low as the current cloud elevation is 5000 to 6000 feet.  There seemed to be a very small light near the bigger light very briefly...",
      "link": "http://www.nuforc.org/webreports/095/S95632.html",
      "state": "KY",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfacf",
      "summary": "Orange illuminated round object. hung in sky then ascended as it traveled away in straight line then disappeared..",
      "city": "louisville",
      "shape": "light",
      "date": "2013-07-14T00:00:00",
      "story": "orange illuminated round object. hung in sky then ascended as it traveled away in straight line then disappeared.. Was getting into parked vehicle when my daughter said “there’s that light again”. We had seen it three nights prior at a different location.  It was the same color and shape: orange and roundish.  It was night so it was very illuminated.   It hung in the sky and then it appeared to be going in a slight ascending straight line away from me at a north east direction then disappeared. It did not look like fireworks.  The location was on Robbs Lane near the Outer Loop in Louisville, KY.   There were several adult witnesses as well as teenagers and children.",
      "link": "http://www.nuforc.org/webreports/099/S99927.html",
      "state": "KY",
      "duration": "70 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc9b",
      "summary": "A circular bright white light flickering with a red light in the center in the northwest sky.",
      "city": "louisville",
      "shape": "circle",
      "date": "2013-07-22T00:00:00",
      "story": "A circular bright white light flickering with a red light in the center in the northwest sky. I was watching TV with my daughter when I was distracted by an unusually bright white and red flickering light out the northwest window of my home.  I said to my daughter to look and we both asked, \"WHAT IS THAT?\"   It was larger than a plane that we're use to seeing in the area as we live close to a UPS hub.  The object was circular and flickering with a white light and a red light in the middle.   It seemed to have a life of its own and was only visible for about 30 to 40 seconds before disappearing.  There was no sound coming from it.   I am 63 years old and my daughter is 27.  We are still puzzled but both of us are of sound mind and agree that we saw something very unusual.",
      "link": "http://www.nuforc.org/webreports/100/S100276.html",
      "state": "KY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bff11",
      "summary": "Driving home from work, about midnight going down highway 71southbound.  the weather was clear, moon was visible, normal air traffic fl",
      "city": "louisville",
      "shape": "oval",
      "date": "2013-07-03T00:00:00",
      "story": "Driving home from work, about midnight going down highway 71 southbound.  the weather was clear, moon was visible, normal air traffic flying as usual, visibility was far.  I had my cruise control set at 60m.ph, radio turned off, and windows partially down.   Around the zorn avenue exit, right outside of downtown Louisville.  I noticed about a half a mile ahead of me and on the other side of the highway, a object above the tree line. (TREE LINE RUNS DOWN BOTH SIDES OF ENTIRE HIGHWAY)   My first thought was wow that helicopter, plane is flying low.  Thats when the cruise control came off and i slowed to around 45m.p.h.  The object started moving across the highway, at a northwestern fashion.  This object was about 200 feet above the ground, about the size of a mini van or large car, and made no noise.  What made me notice this object was the lights, it had a series of bright green and extremely vivid colored lights on the bottom or belly in a V shape or triangl! e.  With the green lights at the corners.  There was also one red light in the middle that pulsed slowly, almost like a heartbeat.    I watched this thing fly directly over top of my car.  Looking through my windshield and up over my steering wheel, i noticed the silouette only because of the close by downtown city lights.  The object had round edges   almost like a football but wider, that made up the entire craft.  It was really strange,  the whole time i couldn't see the object only the lights, but they were so bright i dont understand how they didnt light up any part of this object, they should have, but this was black or cloaked is best described.  I continued to watch as it flew over and past me above the tree line on my side of highway.  I was able to see this object from the front, from its side, and from its rear.  No other lights were on this object at all, and living by Louisville you know what planes, helicopters, commercial and even some military aircraft look an! d sound like.  F.A.A requires all aircraft to use a red light ! on one s ide or wing, a green on the other and a white flashing light at the rear.  This object had only  lights on the bottom, nowhere else.   This is by far probably the strangest thing ive ever seen, and would really love to know what it was.   It wasnt a helicopter, it wasnt a plane, it wasnt a toy or R.c because it was too big, and think to myself would military be flying some drone or black ops over a highway with bright green lights, it doesnt make sense to me.  I hope someone else saw this thing because for right now im sleepin with my pistol close by.",
      "link": "http://www.nuforc.org/webreports/099/S99079.html",
      "state": "KY",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0081",
      "summary": "It was a saucer shape and had white lights circling on the outside and a red light in the center. Also it had a Blue spotlight going do",
      "city": "louisville",
      "shape": "circle",
      "date": "2013-07-22T00:00:00",
      "story": "It was a saucer shape and had white lights circling on the outside and a red light in the center.  Also it had a Blue spotlight going down from the bottom of the craft.  Another thing is when I went to take a picture it didn't show up on my screen but it was there and my Dog was barking at it.",
      "link": "http://www.nuforc.org/webreports/100/S100259.html",
      "state": "KY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c0133",
      "summary": "Very bright, whitish light with long yellowish tail",
      "city": "louisville",
      "shape": "other",
      "date": "2013-07-14T00:00:00",
      "story": "I was driving east on I-265 in just south of Louisville, KY between 12:20 and 12:30 AM eastern standard time. In the eastern sky was an object in the sky.   It appeared to be falling straight down. It was very bright, whitish light with long yellowish tail.",
      "link": "http://www.nuforc.org/webreports/100/S100089.html",
      "state": "KY",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0562",
      "summary": "I was driving to work and saw a bright orange light high in the sky. I initially thought airplane but it was only orange light no red.",
      "city": "louisville",
      "shape": "circle",
      "date": "2013-02-04T00:00:00",
      "story": "I was driving to work and saw a bright orange light high in the sky.  I initially thought airplane but it was only orange light no red or white then it just disappeared.",
      "link": "http://www.nuforc.org/webreports/096/S96071.html",
      "state": "OH",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0687",
      "summary": "Perfect formation of 4 triangular crafts sighted in PRP, Louisville, Ky seen twice in two days.",
      "city": "louisville",
      "shape": "formation",
      "date": "2012-12-20T00:00:00",
      "story": "Perfect formation of 4 triangular crafts sighted in PRP, Louisville, Ky seen twice in two days. Four bright lights hovered over treeline, each spaced perfect equal distance apart. The first light began to glow brighter than the three behind it.  Then the light began to move slowly towards the east.  It flew directly over our heads.  It was triangular shaped, silent and had three thrusts at the end of it.  The lights within the craft appeared to run like chaser lights on a christmas tree, however, the light on one wing blinked red and the light on the other wing blinked. Green. As the craft flew away, the second one in line began to fire up the same way, then repeated the exact same flight pattern as the first, looking and sounding the exact same. As the second one began to get further from our sight, the third and fourth repeated the pattern. Today is 12/15/12 at 1:49 am. The same formation was witnessed by my son and I, in the same location. There were only three this time.",
      "link": "http://www.nuforc.org/webreports/095/S95262.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0830",
      "summary": "Single bright light-orange orb moving from southwest to northeast at 9:15 PM on 12/31/13 in the 40207 ZIP Code of Louisville, KY.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2014-03-18T00:00:00",
      "story": "Single bright light-orange orb moving from southwest to northeast at 9:15 PM on 12/31/13 in the 40207 ZIP Code of Louisville, KY. I walked outside to my back patio about 9:15 PM on 12/31/13 (New Year’s Eve) and looked up at the sky.  I immediately spotted a single light-orange orb in the southwest part of the sky moving northeast at a moderate rate of speed.  It didn’t appear to be at a high altitude –maybe a couple of hundred feet above the ground (although I’m certainly not the best judge of distances).  If I were to have held up my thumb, it would have been just a bit smaller than the size of my thumbnail.  It passed to the west of me and I followed its path as it headed northeast until it disappeared. It was extremely bright.  I saw no blinking lights around it, as you see on planes. It had no form, like a plane, simply a brilliant ball of light.  And, what struck me as the strangest thing of all, was that it was completely silent. My husband and I spend many nights outside on the patio star-gazing.  Since we are very close to the flight path of Louisville International Airport, Bowman Field, and a TV station that has a helicopter landing pad, my husband and I are very familiar with all types of aircraft at all levels of altitude.  Even though we live relatively close to the city and the light pollution can sometimes be a problem, we can also spot satellites as they pass overhead. Despite our familiarity with the aircraft/spacecraft that fly over our home (we’ve lived here for 8 years), I couldn’t identify this as anything I’d ever seen in the past.  I remember asking myself, “What IS that?”  When it had disappeared (after being visible to me for about 45 seconds), I walked back inside and mentioned to my husband that I’d just seen something that I’d never seen before in my life.  I wondered silently to myself if I’d seen a UFO. A few days later, while checking the Internet, I found reports of people in California on New Year’s Eve spotting light orange orbs of light that were completely silent.  I was stunned.  I believe I saw exactly the same thing in Louisville, KY. (END)",
      "link": "http://www.nuforc.org/webreports/107/S107583.html",
      "state": "KY",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0840",
      "summary": "Three large orange spheres traveling, then turning independently of one another in night sky.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2014-03-18T00:00:00",
      "story": "Three large orange spheres traveling, then turning independently of one another in night sky At approximately 8:00 p.m. January 1st, 2014, my husband and I observed three large glowing orange orbs in the western sky traveling at a moderate speed north.  They glided silently as we observed them for approximately 4 to 5 minutes, then each independently made a slight left turn towards the northwest. We watched them for an additional minute before they one by one just seemingly vanished. Throughout the duration of our sighting the brightness and size of the three objects remained consistent until the moment they disappeared. Not long after the objects had disappeared, we heard the rotors of a helicopter.  The helicopter was traveling at a high rate of speed from the south, and appeared to be in pursuit of the objects as it flew over our home headed toward the exact point in the sky the objects had disappeared from our sight.",
      "link": "http://www.nuforc.org/webreports/107/S107784.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c08c2",
      "summary": "Several Unexplained Objects Flying Low in the Night Sky.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2013-11-11T00:00:00",
      "story": "Several Unexplained Objects Flying Low in the Night Sky My wife and I were driving home from celebrating Valentines Day dinner in Downtown Louisville, KY on 02/16/2013.  At approximately 10:20pm while driving northeast on Hurstbourne Lane towards I-64, we witnessed at least 20 glowing red orbs in the eastern sky towards the town of Shelbyville, KY.  The sky was overcast, with high winds, low cloud cover, and probably less than ten miles visibility. I hold a private pilot certificate and have worked several years in the aviation industry.  I know these were not manned aircraft for several reasons:   1.  \tThe bad weather/visibility would have prevented a large group of aircraft from flying in close formation at such low altitude. 2.\t  There were no position lights.  U.S. powered aircraft always have a red light on the left wing, a green light on the right wing, and a white light on the tail.  Prudent pilots will always fly with a flashing omnidirectional beacon. 3.\t  The orbs of light mostly stayed stationary in the sky and did not seem affected by the high winds. Occasionally the orbs would move vertically (both up and down) at high rates of speed. The sky was overcast, these were not stars. 4.\t  They were bright red orbs. The intensity was strong and the light didn’t waver. 5.\t  They were in a strange formation, some were higher/lower than others. They didn’t seem to be organized in any sensible pattern either horizontally or vertically. 6.\t  They suddenly disappeared.  This video is very similar to what we saw, though there were many of them all at the same time:  http://www.youtube.com/watch?v=Zi-6DFe2fEg&list=PL4D428923123EF286   Possible explanations/problems with our sighting:   1.  \tI thought they could have been sky lanterns (like those used in eastern cultures).  They seemed to be flying over part of the U of L extension campus. It’s possible that a group of students launched a bunch of them to celebrate Valentines Day weekend.  However, as stated before, there were really high winds that night and the orbs appeared to be relatively stationary in the sky.  The orbs also moved vertically at high rates of speed.  I have also scoured the internet to find news of celebrations involving sky lanterns.  I haven’t found anything.  We do not live in Louisville so we do not have ready access to their news outlets. 2.  \tThey could be helicopters flying in a rough formation.  The problem is: no position lights, it was overcast, very dark, with high winds, and really what would be the point?  I don’t see a bunch of pilots participating in a potentially dangerous flight at night with low visibility. 3.  \tThey could have been stars.  It was overcast, the orbs moved, and stars don’t shine red. 4.\t  The only exasperating part of our experience is that I can find no evidence on the internet that anyone else witnessed what we saw!!  These were high enough in the sky that thousands of people could have potentially seen them.  It was a Saturday night on a holiday weekend. I would love to have an explanation for what we saw, or at least hear that someone else also witnessed this! If you have any information I would definitely be interested in hearing it. This was not my first experience with a UFO sighting in Louisville, KY. In 2000 I was working at Standiford Field (the Louisville Airport SDF) for the summer.  It was a warm night and the skies were crystal clear.  Several airline agents and I witnessed a large white lens shaped object seemingly floating in the night sky to the northwest.   We thought it might have been an advertising dirigible flying over Papa John’s Stadium.  However, it seemed to just suddenly appear.  We could not hear any engines (to indicate that it was powered). It was not present the night before, or the night after our sighting.  It did not move at all.   We contacted the control tower to ask what it was and they had no explanation.  There was nothing on their radar.  We had to work an inbound flight, but when we were done, the object in the sky was gone.  A possible explanation is that it might have been a large balloon tethered to the nearby stadium.  However I have several problems with this:   (1)  It was huge; it appeared to be the size of the good year blimp. (2)  It had no top: there were clear skies and its top seemed to just fade into nothing. (3)  It did not move. (4)  There was no visible advertising on the side.  It seemed to be illuminated by the city lights below. (5)  It disappeared   (6) ATC (air traffic control) did not know what it was  (7) Standiford is a busy airport, and is a major hub for UPS. Huge cargo aircraft are constantly flying in and out of SDF all of the time (especially at night).  I do not see the FAA allowing such a huge balloon (if it was a ballon) to be tethered so close to the airport, especially at night. I would love to hear more information on this one as well.  We do not live in Louisville, but we do live in another major city nearby.  I find it ironic that both of my sightings have been in Louisville.  I’m still very skeptical, but just a little excited too.  I hope this information helps in some way.",
      "link": "http://www.nuforc.org/webreports/103/S103776.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0eaa",
      "summary": "Isn’t the first time we have seen these. Moved West to East. Red/Orange colored lights. They stopped and hover for a few minutes.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2014-02-14T00:00:00",
      "story": "Isn’t the first time we have seen these.  Moved West to East. Red/Orange colored lights.  They stopped and hover for a few minutes.  Then they always disappear when we take our eyes off of them.  We have seen them over 5 times since Summer of 2013.",
      "link": "http://www.nuforc.org/webreports/106/S106993.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c14dd",
      "summary": "4 Glowing Orbs/Fireballs in NE Louisville.",
      "city": "louisville",
      "shape": "fireball",
      "date": "2013-12-05T00:00:00",
      "story": "4 Glowing Orbs/Fireballs in NE Louisville. I was out walking my dogs in the back yard when I saw 2 strange lights in the west sky (I live in North Eastern Louisville).  They were travelling in the same direction and one was in front of the other.  I can’t say how large they were or how far apart they were due to the distance.  However, they appeared to be travelling over the Indian Hills area in North Eastern Jefferson County. At first I thought they were floating Chinese lanterns, but I determined that they could not be lanterns due to the speed at which they were travelling.  They seemed to glow orange/gold and flicker sporadically.  I immediately took out my iPhone camera and videotaped the lights, but they were so small in the video.  I then noticed that there was another light in front of the other two, also travelling the same direction.  As I ran up to the house, the first light faded into the cloud cover. When I reached the house, my daughter joined me outside and she also captured video of the two remaining objects.  As the 2 closest ones were starting to fade into the clouds, one final light appeared through the trees, following the previous three.  We both agreed that these were not a normal aircraft that we are familiar with;  UFOs by definition.  The area where the objects appeared is close to the flight path that passenger jets use as they round into their landing pattern at the Louisville airport.  However, these lights appeared much lower than any jet would travel, and there was no sound.  There were no blinking lights on the objects, just the occasional flickering.  The objects appeared as if they were completely illuminated; glowing.  They were close enough to see that they had some mass, not just a light in the sky.  But I couldn’t determine how large they were.  And they all had the same steady pace and straight flight.  I wouldn’t say they were speeding across the sky, but they were travelling faster than wind would carry the objects.  Also, the wind was travelling ESE (1 mph) and these objects were travelling NW.  I could submit my video, but you can only see 2 pinpoints of light, not any of the details that I described.  I haven't seen my daughter's video yet.  I’ve seen comets, meteors and satellites and I know these objects were none of those things. I’ve never been a big believer in UFOs but I didn’t disbelieve either.  What we saw tonight isn’t something that would make me say that we definitely saw alien craft, but I can say it was very strange and unlike anything that I've ever seen.",
      "link": "http://www.nuforc.org/webreports/105/S105023.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1580",
      "summary": "Black Triangle hanging in place over louisville street.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2013-12-02T00:00:00",
      "story": "Black Triangle hanging in place over louisville street I was driving down East St Catherine St, heading towards Floyd st.  As I crossed South Preston St, I happened to look to my right and saw three orb like white lights, diffuse but big, less than a two blocks away.  The night was bright enough to easily see that these lights (as big as beach balls would look sitting in a chair next to you) were steady and connected by a black triangular structure. I noticed no other lights and no noise of any kind beyond normal traffic and ground noises. I checked again to make sure I wasn't mistaking it for a plane, and there it sat, exactly the same way that bricks don't, in place in the air, maybe four to 5 stories off the ground if the surrounding buildings went up that high.  No other lights or markings or sound. It wasn't doing anything, just sitting there and not moving and not making a sound. Swung by about 6 minutes later, and it was gone.  On way home we saw some aircraft seeming to be searching the area and you could hear them miles off.. which helped confirm for me that there was no way that black triangle was a plane or a helicopter..  I would have heard it and it probably would have smacked into the buildings downtown at the height it was at. I can't say how big it was for sure, but it looked to be about 50-75 ft across.. but there was a tip of the triangle over both buildings on either side of the street, so.. it was big enough.",
      "link": "http://www.nuforc.org/webreports/104/S104966.html",
      "state": "KY",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c18cf",
      "summary": "Bright red glowing sphere over louisville on the 4th of July - 2014.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2014-07-11T00:00:00",
      "story": "Bright red glowing sphere over louisville on the 4th of July - 2014 I was outside watching the fireworks on the 4th, and I looked up at the sky to my right to see a extremely bright red light.  The light was so bright that it surrounded the entire craft.  I was not able to see any shape of the craft because the light was so bright so I am going to say it was a sphere.  It did not flash, it was a static light.   The craft was relatively high up in the sky, but still below the cloud line.  It flew straight across from the right all the way past our front yard and off to the left.  Because of the height I did not hear any sound, but I still found that a bit odd because other craft around that altitude usually make some sort of noise.   The craft would pivot slightly to the left and right.  Sort of like a boat in rough seas.  Do not mistake this for the normal \"zipping across the sky\"  this looked more like wind was effecting it because it was moving at a relatively slow speed. There were no other lights other than the red.  No white lights, no strobes, etc... Having said that, I have to take an educated approach to this sighting.  Even though I might belive in something like this, there is always a possibility that there is a simple explination to this.   I thought to myself, well the slow speed and subtle pivoting, and bright red light... it could have been a helicopter.  But not a commercial one because of the bright red light, so then maybe a military helicopter.  But the fact that the light was so bright and no other strobing lights were on it, and there was no sound I am having a hard time accepting my own answer to this.  I have seen other military helicopters in the area and they are extremely loud.  And just to rule it out, it was moving way too fast to be a hot air balloon. We live near a small airfield (Bowman Field) and I see aircraft all the time, and am quite familiar with the lights on crafts.  I look in the sky several times a day waiting to find something, and sure enough I did!   This is honestly the first time I have been unable to explain this sighting and it is all I have been able to think about for days now.  I have seen everything from military helicopters, small planes, news helicopters, drones (about once a month) and now this. I have a very short video that I took of it, though my phone was low battery and shut off shortly after i started to record so I was unable to take any still images.  (go figure, just my luck).",
      "link": "http://www.nuforc.org/webreports/111/S111365.html",
      "state": "KY",
      "duration": "Several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c192f",
      "summary": "White orb outside of plane on flight from Atlanta to Chicago.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2014-07-26T00:00:00",
      "story": "White Orb outside of plane on flight from Atlanta to Chicago. I was on a flight to Chicago (O’Hare) from Atlanta.  The city is a best guess based off of the time of the sighting and my guess as to our place in our flight trajectory.  I was sitting in a window seat, row 10 of the plane.  I was looking out the window at some of the city lights and suddenly a white orb showed up, at approximately the same altitude of the plane.   From my vantage point, it looked to be slightly in front of the plane and a short distance away on the left side of the plane (the side I was sitting on).  It was hard to gauge the distance being that it was partly cloudy and flying at night.   I was able to observe the light/orb for about 30-40 minutes.  The object would move farther away and then back, which was observable by seeing it fly through the clouds and then back into the open nearer the plane.  Every so often, it would make quick movements moving up and down, like almost mocking the plane and yet flying with us at the same time.   I wanted to take a picture of the object, but my phone was in my carry-on bag in the overhead bin and being an evening flight, a vast majority of the passengers were sleeping.   The object flew away and disappeared approximately 15 minutes before our landing in Chicago.",
      "link": "http://www.nuforc.org/webreports/111/S111820.html",
      "state": "IN",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c198c",
      "summary": "We were out watching some fireworks and they had stopped when we noticed a large red object moving north to south across a totally clea",
      "city": "louisville",
      "shape": "circle",
      "date": "2014-07-05T00:00:00",
      "story": "We were out watching some fireworks and they had stopped when we noticed a large red object moving north to south across a totally clear sky.   At first I thought it was a firework, but when it didn't explode or do anything I knew it wasn't.   Then people began to say what is that.   It moved at a slow pace with sort of a pulse no sound and we watched it stay on track in its direction, then all of a sudden it simply vanished.",
      "link": "http://www.nuforc.org/webreports/111/S111017.html",
      "state": "KY",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a34",
      "summary": "Silent black triangle over Louisville, KY.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2014-07-05T00:00:00",
      "story": "Silent black triangle over Louisville KY At approximately 9:00pm we saw a red light in the sky moving from the northeast to the southwest.  When it first appeared it was low in the horizon at around 10,000 feet in altitude.   The light on the aircraft went out and we could see a triangular aircraft that was totally black with no running lights.   It was totally silent and moved out of our sight into the horizon.   This area is near the Louisville International Airport and seeing aircraft at all hours of the day is common, however this was very different because it flew across the normal flight path with no lights and no sound.",
      "link": "http://www.nuforc.org/webreports/110/S110966.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b62",
      "summary": "Single flash of light, point light source, very bright, like a wink, straight overhead.",
      "city": "louisville",
      "shape": "flash",
      "date": "2014-07-26T00:00:00",
      "story": "Single flash of light, point light source, very bright, like a wink, straight overhead. Directly overhead a single very strong bright white flash the size of an average star but very bright and distinct.  Only one flash, a point of light, not the whole sky, waited a decent amount of time to make sure it was not an aircraft or rotating space junk satellite.   Perfectly clear sky, no haze, no clouds, not lightning.   This is the fourth time I have seen this.  Last three sightings were 3 weeks ago at approximately the same time, all the same night within 60 seconds there were 3 flashes.  Perfectly clear sky, no haze, no clouds, not lightning. 2 witnesses on the previous sighting.",
      "link": "http://www.nuforc.org/webreports/111/S111789.html",
      "state": "CO",
      "duration": "Flash"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d0e",
      "summary": "Mutable aircraft flying in somewhat of a formation radiating a orange glow. No beacon lights nor any white lights at all was noted. The",
      "city": "louisville",
      "shape": "unknown",
      "date": "2014-07-05T00:00:00",
      "story": "Mutable aircraft flying in somewhat of a formation radiating a orange glow. No beacon lights nor any white lights at all was noted.  The craft seem to fly a circular pattern for about 15-20 minutes each time as they speed away from my house the craft disappeared totally.  At times, there were some that appeared to stop and erratically move, and other times look to be normal for a aircraft. There were no noise at all all the time they were in site.",
      "link": "http://www.nuforc.org/webreports/110/S110946.html",
      "state": "KY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d0c",
      "summary": "It was three fire ball looking things that all came from different directions n then all the sudden went. N disapared in same spot but",
      "city": "louisville",
      "shape": "fireball",
      "date": "2014-07-05T00:00:00",
      "story": "It was three fire ball looking things that all came from different directions n then all the sudden went.   N disappeared in same spot but as one passed over me it formed a line light n then zoomed away",
      "link": "http://www.nuforc.org/webreports/110/S110948.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f68",
      "summary": "Multiple Yellow/Orange Lights near college campus.",
      "city": "louisville",
      "shape": "formation",
      "date": "2014-05-08T00:00:00",
      "story": "Multiple Yellow/Orange Lights near college campus. Driving home from work around midnight. Pulled up to a stop light. Looked out drivers side window and saw 10-15 yellow/orangish lights in a sort of trapezoid formation over the local college campus, with one light following from behind at a distance. They moved slowly across the sky, but did not pass overhead, just stayed in the same general area for about 2 minutes. Then, one by one, they started to fade, then blinked out until they were all gone.",
      "link": "http://www.nuforc.org/webreports/109/S109231.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c207a",
      "summary": "Balls of fire zig zag down from the sky then disappeared behind a tree after turning blue.",
      "city": "louisville",
      "shape": "fireball",
      "date": "2014-05-02T00:00:00",
      "story": "Balls of fire zig zag down from the sky then disappeared behind a tree after turning blue. 2 balls of fire zig zag down from the sky and another one appeared beside them we tried to record but when we did they went behind a tree turned blue and disappeared.   After the disappearance it set off the lights from the airport like they seen it on their radar. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108947.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c210d",
      "summary": "6 round orange lights seen with one dropping quickly.",
      "city": "louisville",
      "shape": "circle",
      "date": "2014-04-24T00:00:00",
      "story": "6 round orange lights seen with one dropping quickly. I saw six orange steady burning lights in the night sky.  The sighting was at approx. 9:20p.m est.   The first light was well ahead of four lights that were in a diamond pattern as a sixth light followed far behind them all.   As I watched them for a couple of minutes the last light in the diamond formation dropped quickly and then leveled out.  Shortly after that the lights turned off except the last light which was still far behind.   As the last light approached the vicinity were the other lights had turned off, it as well turned off at that point.  I was able to take a couple of pictures on my phone.",
      "link": "http://www.nuforc.org/webreports/108/S108786.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c21bf",
      "summary": "Orange triangle shaped objects seen over neighborhood.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2014-04-24T00:00:00",
      "story": "Orange triangle shaped objects seen over neighborhood At 21:20 PM Eastern standard time two sailboat shaped objects, each with bright, slightly-pulsing orange lights, moved slowly over the neighborhood, coming from the southwest direction towards the north east.  The event took place over the course of ten minutes, and was witnessed by at least four people.  This neighborhood is in the flight path of an airport with a UPS hub where jets fly every two minutes during nightime hours; no planes have gone over for about fifteen minutes.",
      "link": "http://www.nuforc.org/webreports/108/S108808.html",
      "state": "KY",
      "duration": "Ten minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2372",
      "summary": "Ufo:  Louisville, 4/11/2014.",
      "city": "louisville",
      "shape": "light",
      "date": "2014-04-11T00:00:00",
      "story": "Ufo louisville 4/11/2014 saw a tree lights (1 white and 2 amber) ufo hovering over a house today at 4:30 am when i was returning to the restroom to bed, from my window,  the object have a ray of light pointing the ground, a car passed and flew away very fast.",
      "link": "http://www.nuforc.org/webreports/108/S108523.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24ba",
      "summary": "At 6:22 am, saw a ufo over the Brooks Exit, going to Shephersville, KY.  It was v shaped blue lights.",
      "city": "louisville",
      "shape": "other",
      "date": "2014-11-06T00:00:00",
      "story": "At 6:22 am, saw a ufo over the Brooks Exit, going to Shephersville, KY.  It was v shaped blue lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114429.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24bb",
      "summary": "V-shaped ufo blue lights.",
      "city": "louisville",
      "shape": "other",
      "date": "2014-11-06T00:00:00",
      "story": "v sheped ufo blue lights Saw a v shaped ufo heading north from 65south.  It had blue lights not flashing in a \"v\" pattern.  Did not fly like a commercial aircraft.  It moved forward and stop moved in reverse back in the clouds did few maneuvers and it was gone went south bound.",
      "link": "http://www.nuforc.org/webreports/114/S114443.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c259f",
      "summary": "Ball of green light.",
      "city": "louisville",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "ball of green light At about 9PM, I saw a ball of bright green light appear to fly in an arc across the treetops at Cherokee Park towards Bardstown Rd.  It lasted about a minute.",
      "link": "http://www.nuforc.org/webreports/114/S114945.html",
      "state": "",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c2974",
      "summary": "Going around in circle and then coming togather, as if the were dancing over and over same.  ((NUFORC Note:  Advertising light?  PD))",
      "city": "louisville",
      "shape": "circle",
      "date": "2014-11-14T00:00:00",
      "story": "going around in circle and then coming togather in circle as if the were dancing over and over same. ((NUFORC Note:  Possible sighting of advertising lights, we suspect.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115247.html",
      "state": "KY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c2e8e",
      "summary": "I saw a bright light light of enormous intensity above the tree line.",
      "city": "louisville",
      "shape": "circle",
      "date": "2014-09-18T00:00:00",
      "story": "I saw a bright light light of enormous intensity above the tree line. I saw a bright intense round light that  was above the tree line about 100 ft in the air.  It appeared for 3-5 seconds.   It dropped behind the trees with no sound.  It was brighter than any light but had no halo. ((ADDENDUM FROM WITNESS)) It was 10:00 pm. It look like the ball went straight down behind the 50 ft tall trees but as my 15 year old son pointed out , it probably headed north  away from me which looked like it headed down because of it's relationship to the trees. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/113/S113638.html",
      "state": "TN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c33ec",
      "summary": "Attached is the rendering of the UFO we saw last night on HWY 64 traveling east near exit 113.",
      "city": "louisville",
      "shape": "",
      "date": "2015-04-03T00:00:00",
      "story": "Director Davenport:  Attached is the rendering of the UFO we saw last night on HWY 64 traveling east near exit 113.   My wife ((name deleted)) was reaching back in the back seat to help my daughter so she heard me yell and then turned around but it was already gone before she could see it.   It was at an arc of about 45 degrees up from my horizontal view.  It moved across the sky line in about less than 3 seconds, maybe less.  It was moving faster than anything I have ever seen, and it disappeared from my sight instantly, just at it had appeared.   It was 1.5 – 2X the size of a full moon.  ((name and title of witness deleted)) ((NUFORC Note:  We spoke via telephone with the witness, and he seemed to us to be exceptionally objective and sober-minded person.  He works as a medical professional.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118202.html",
      "state": "KY",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3413",
      "summary": "This object was spherical, almost looked like a circular disk with a bright glint on the edge of this disk seen thru a 8\" Dobsonian.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2015-03-26T00:00:00",
      "story": "This object was spherical, almost looked like a circular disk with a bright glint on the edge of this disk seen thru a 8\" Dobsonian. i am a amateur astronomer.  On the 21st of March, 2015, I was in my backyard with my telescope trained on Venus, Comet Lovejoy in Cassiopie, etc., in the western/northern sky.  I use a Telrad reflex sight makes it easy for me to quickly find and train my 8\" Dobsonian on any object in the sky, including aircrafts, ISS, Iridium satellites etc.   I saw this low flying red light moving towards my observing position from the West.  I trained my Telrad at this object, quickly moved to the erect image finder scope with a 8x magnification-widefield.  To my surprise, no blinking lights (no sound) and the object looked lower than a traditional sattelite in the twilight sky.  Went back to the Telrad realigned it in the bulls eye and looked at it thru the main telescope this time.  I was awestruck by what I saw.  This object was spherical almost looked like a circular disk with a bright glint on the edge of this disk (observing time 1 to 2 seconds thru main telescope) moved qui! ckly thru my field of view.  I tried to locate it again but it was gone.   Never seen anything like this in the last 20 odd years i have been observing.  Has anybody else seen it? ((ADDENDUM FROM WITNESS)) **I accidentally entered the wrong date on the previous report**i am a amateur astronomer. On the 21st of march 2015 (**03/21/2015 correct date**) i was in my backyard with my telescope trained on Venus, Comet Lovejoy in Cassiopie, etc in the western/ Northern sky.  I use a Telrad reflex sight; makes it easy for me to quickly find and train my 8\" Dobsonian on any object in the sky including aircrafts, ISS, Iridium satellites etc.  I saw this low flying red light moving towards my observing position from the West.  I trained my Telrad at this object, quickly moved to the erect image finder scope with a 8x magnification-widefield.  To my surprise no blinking lights (no sound) and the object looked lower than a traditional satellite in the twilight sky.   Went back to the Telrad re-aligned it in the bulls eye and looked at it thru the main telescope this time.  I was awestruck by what I saw.  This object was spherical almost looked like a circular disk with a bright! glint on the edge of this disk (observing time 1 to 2 seconds thru main telescope) moved quickly thru my field of view.  I tried to locate it again but it was gone.  Never seen anything like this in the last 20 odd years i have been observing.  Has anybody else seen it ?",
      "link": "http://www.nuforc.org/webreports/117/S117974.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3935",
      "summary": "Large pale yellow ball of light seen over Louisville Kentucky.",
      "city": "louisville",
      "shape": "fireball",
      "date": "2014-12-22T00:00:00",
      "story": "Large pale yellow ball of light seen over Louisville Kentucky On or about February 2012, in Louisville, Kentucky, I was driving home from work.  It was around 5:00pm and I was traveling in a northerly direction. I was just about to take my exit from one expressway to another when I noticed to my left an odd little cloud that was lit up from behind and was displaying rainbow colors.  I kept looking at it trying to figure out what it was. In addition, right in front of me was a huge ball of beautiful pale yellow light, not moving at all, just hanging there in the sky.  At the time I thought was the sun.  It was massive and it didn’t hurt the eyes to look directly at it.  It was like looking at the sun through a gauzy haze. The oddly colorful and brightly lit cloud to my left captured my attention.  As I continued to drive, I was looking from the ball of light in front of me, to the anomaly on my left.  I was observing other drivers to see if anyone else noticed anything out of the ordinary and no one seemed to.  Unfortunately, I was unable to pull over to examine it more closely due to heavy traffic and the lack of a safe place to do so. It was the next day while traveling home at the same time of day and the same route that I realized that the anomaly to my left I had witnessed the day before was actually the sun shining through a cloud; and that the large ball of light was the true anomaly.   I still marvel to this day about what it could have been; and I regret not pulling off the highway to get a better look.",
      "link": "http://www.nuforc.org/webreports/116/S116114.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ae4",
      "summary": "Me and my brother was outside last Friday early morning we saw a blue sphere light orb the same size a carrier, it was gliding while pu",
      "city": "louisville",
      "shape": "light",
      "date": "2015-07-31T00:00:00",
      "story": "Me and my brother was outside last Friday early morning we saw a blue sphere light orb the same size a carrier, it was gliding while pulsating a blue hue light  blue,  it had shape but didnt have a form, well it had a form, its weird to explain, IT was semi transparent, the light orb looked solid, but like a hazy light,o t faded in and out twice, like disappeared and then reappeared.  then finally disappeared, it was a very clear night that night,  and a plane followed behind it, but it was 15 mins later.",
      "link": "http://www.nuforc.org/webreports/120/S120694.html",
      "state": "KY",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d65",
      "summary": "Me and girlfriend were out on the deck and this large triangle shaped craft flew right over the top of us flying below the clouds.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2015-07-23T00:00:00",
      "story": "me and girlfriend were out on the deck and this large triangle shaped craft flew right over the top of us, flying below the clouds.  8 to 9 hundred feet.  2 bands of lights in the front, and 2 white lights on the rear. ((NUFORC Note:  This report was first posted on July 23rd, with a time indicating a daytime sighting.  We suspect the sighting occurred four minutes past midnight, and we have changed the time to reflect that fact.  We noted the error, only after we had first posted the report.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120552.html",
      "state": "KY",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d8d",
      "summary": "5 Triangular objects with bright orange lights of over St. Matthews, KY.  One stopped as if facing me for 10 seconds.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2015-07-06T00:00:00",
      "story": "5 Triangular objects with bright orange lights of over St. Matthews, KY.  One stopped as if facing me for 10 seconds. I saw two bright orange/red triangular objects fly through the night sky...like a plane from Bowman Field airport except coming from the opposite direction, lower, and silent.  These disappeared as a plane would then another launched with two following yet the first stopped as I walked toward it.   It was as if we were looking at each other for about 10 seconds before it left.   The other two slowed then dissolved into the sky.   Very, very strange. ((NUFORC Note:  This report was originally posted on July 5th, indicating a time of 11:00 a.m..  We have amended the time, and will re-post.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120075.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c41b9",
      "summary": "My husband (now deceased) and I were watching tv in separate rooms. His room overlooked the back yard (west) and my room overlooked the",
      "city": "louisville",
      "shape": "triangle",
      "date": "2015-04-17T00:00:00",
      "story": "My husband (now deceased) and I were watching tv in separate rooms.  His room overlooked the back yard (west) and my room overlooked the front yard.(east)  All of a sudden my husband runs into my room and jerks open the front door and freezes in a stance blocking the open door looking up.  By that time I have chased after him to the door and see a black triangle craft slowly clearing my roof line (I have a roof overhang) into the open part of my front yard. (1/2 acre) I could see the bottom of the  craft and saw lights at the points of the triangle but there was no sound.  Our pine trees were 29 yrs old at that time and the craft was just above them moving very very slow. I tried to get out into the front yard but my husband was rigid in the doorway and blocked me from leaving the house. We watched it moved east crossing the street over a heavily wooded 4 acres of land until we could not see it any more. My husband tells me that he could see an object moving toward our house from way off and watched it til it moved over our roof and ran for the front door.  We were so stunned by this event that all I remember was that he went back to his tv room and we never discuss this again.  I wanted to but he did not!  The sky was clear and not black like there was some moon light. We lived next to the Ford truck plant property line and thats where it had to fly next. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118463.html",
      "state": "KY",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42cc",
      "summary": "Bright green orb near Lyndon Lane while riding in the car with a friend.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2015-04-17T00:00:00",
      "story": "Bright green orb near Lyndon Lane while riding in the car with a friend. Driving west on Shelbyville Road and noticed a bright light in the sky.  When I took a picture with my iPad I saw the bright green orb near street light.",
      "link": "http://www.nuforc.org/webreports/118/S118353.html",
      "state": "KY",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c444b",
      "summary": "Two rotating hazy green spheres with what looked like  fire in the middle or like a jet engine burn.",
      "city": "louisville",
      "shape": "formation",
      "date": "2015-11-19T00:00:00",
      "story": "two rotating hazy green spheres with what looked like  fire in the middle or like a jet engine burn. At first I thought they were birds flying at High altitude until I got my binoculars.  They were rotating so that you would only see one sphere and then two and then one, etc..... from the visible eye it appeared white and moved at the pace of a satellite across the sky maybe a little slower. I am assuming 5 minutes but I wasn't timing.  The two spheres through binoculars were a round hazy green with what looked like  fire in the middle or like a jet engine burn.  It was unusual and not like the usual balloon you see sometimes and definitely not like the migrating birds I watch for.  It was different which is why I'm writing this.",
      "link": "http://www.nuforc.org/webreports/123/S123858.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c449e",
      "summary": "10/16/15 20:40 EST a sphere caused two bright flashes in the northern sky. It moved south, swelled brightly. It moved south until gone.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2015-10-29T00:00:00",
      "story": "10/16/15 20:40 EST a sphere caused two bright flashes in the northern sky.  It moved south, swelled brightly. It moved south until gone. At approximately 20:40 EST 10-16-15 a bright sphere in the sky was observed.  North 25° moving South 195° +45° to +43° upward bubble.  No sound.  No triangulation.  Two flashes in the northern sky were observed.  The two observed flashes were very bright.  Shortly after the flashes, the bright sphere started moving across the sky from north to south.  The event lasted about three minutes.  As the sphere came across the area it swelled, became very bright.  The sphere dimmed and continued southward until gone from sight. Not the ISS.",
      "link": "http://www.nuforc.org/webreports/122/S122869.html",
      "state": "KY",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c45fb",
      "summary": "6 reddish/white spheres following in the exact same direction in a clear night sky secs and minutes apart.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2015-10-29T00:00:00",
      "story": "6 reddish/white spheres following in the exact same direction in a clear night sky secs and minutes apart. Was cleaning the gutters and notice several unidentified flying spears with mostly reddish and white like whole bodies in the night sky coming and leaving at a steady slow pace.  My mother also was outside on the ground and saw the same 6 mysterious spears following behind one another. 2 or 3 spears came 2 mins after the first siting.  Note that they did not blink red, white or blue lights for the entire sighting.",
      "link": "http://www.nuforc.org/webreports/123/S123000.html",
      "state": "KY",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4623",
      "summary": "Glowing orange/red fireballs, 17 in all, floating quietly in pairs or alone, over 15 minutes.",
      "city": "louisville",
      "shape": "fireball",
      "date": "2015-12-03T00:00:00",
      "story": "Glowing orange/red fireballs, 17 in all, floating quietly in pairs or alone, over 15 minutes. A total of 17 orange/red glowing fireballs moving in the same pattern.  Each going north, in approx. 60 second intervals, sometimes two at a time, all at a constant speed.   They were all moving slowly through the sky, with some flying lower than others.",
      "link": "http://www.nuforc.org/webreports/124/S124379.html",
      "state": "KY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c48fa",
      "summary": "In the easter sky, a green object appeared in Orion's belt.  The object appeared to be far away, but  from our perspective had the same",
      "city": "louisville",
      "shape": "circle",
      "date": "2015-11-12T00:00:00",
      "story": "In the easter sky, a green object appeared in Orion's belt.  The object appeared to be far away, but  from our perspective had the same diamter as the moon.  It hovered briefly and then shot toward the north horizon.  The object was circular in shape and did not leave a trail.  There were two visible aircraft in the vicinity of the green object.",
      "link": "http://www.nuforc.org/webreports/123/S123889.html",
      "state": "KY",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4948",
      "summary": "Bright white orb moving steadily cross the sky slowly until it swelled, retracted, and moved away at a high rate of speed.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2015-10-09T00:00:00",
      "story": "Bright white orb moving steadily cross the sky slowly until it swelled, retracted, and moved away at a high rate of speed. On 10/4/15, at approximately 20:30 EST, a bright white orb moving to slow to be an aircraft was observed in the area.  At first observation the object looked to be the ISS in orbit but as it moved closer to the area it became very obvious it was too low to be orbiting.  The object was inside the atmosphere and much lower to ground.   The object made no sound.  The object was observed to be twice the size of the ISS at closer range comparatively.  The object was observed to be at a range of approximately 1/2 mile away and an approximate altitude of 3000 feet but no more than 4000 feet.  The object was observe at an angle of approximately +40° to +42° traveling from the southwest at approximately 230° moving north at approximately 21°.  These numbers are based on a positive upward bubble.  The event could not be triangulated. After 1 minute of straight steady movement in the sky toward the area it came into clear sight.  The object covered the same distance moving away as it did coming toward the area.  After it cleared the area moving away it maintained its steady speed and altitude for approximately 30 seconds.  The event seemed to last less than 2 minutes. As the object was moving away from the area it swelled, retracted, maneuvered and moved away at an extreme high rate of speed.  The object left a short black streak in its wake before leaving the Earth's deep orbit. The object achieved greater than light speed due to an observable black streak or absence of light. The event did not cause silence of animals nor insects.  The event did not cause a feeling of emptiness or parole.  Only the fiery spheres cause this type of event on the ground. Based on this observation, it was a different species than the red fiery orbs.  The red fiery orbs move at an altitude of approximately 1000 to 2000 feet and much slower. I have observed 4 of the red fiery orbs over the past 2 years.  I only include that because you are most interested in the red fiery orbs.  The silence on the ground and the feeling of emptiness and/or parole seems to be a natural defense.  I have watched the trail of sightings of these red fiery orbs reported so I felt it not necessary to do so. The fact that this seems to be a different species, I felt more compelled to report the event. I felt as if it was looking for something very specific.  On a most personal note, I felt compelled to stay with it and keep watching.  I actually ran to clear the trees to keep watching.  I experienced a feeling of extreme enthusiasm and deep curiosity like a child would.  When I observed the object moving away from the area at an extreme high rate of speed I had a feeling of almost sadness.  Something close to abandonment.  The feeling was almost opposite the red fiery orbs. I have also observed other objects maneuvering in the sky in different states in the US.  The past 20 to 25 years I have observed several objects but in the past 2 years I have observed almost as many.  Activity of these objects has increased almost exponentially.",
      "link": "http://www.nuforc.org/webreports/122/S122578.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d73",
      "summary": "Driving home from work and I saw a pinkish light above the tree line over the Trump ave exit in Canton, heading towards Louisville.  Th",
      "city": "louisville",
      "shape": "triangle",
      "date": "2015-09-02T00:00:00",
      "story": "Driving home from work and I saw a pinkish light above the tree line over the Trump ave exit in Canton, heading towards Louisville.  The light wasn't very high in the sky and as i watched it it went from one light to two to three in a very distinct triangle formation.  It stayed that way for maybe two minutes and then went back to one light and stayed above the tree line.",
      "link": "http://www.nuforc.org/webreports/121/S121571.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5761",
      "summary": "((HOAX??))  Triangular aircraft off side of I-264.  ((anonymous report))",
      "city": "louisville",
      "shape": "triangle",
      "date": "2016-06-24T00:00:00",
      "story": "Triangular aircraft off side of I-264. Was driving on I-264, when I saw a light off the left side of the road, as I become closer I could tell the aircraft was hovering.  There was lights on each corner of triangle and one close to middle. Aircraft also made no noise.  No possible way it was a plane or helicopter. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127941.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5864",
      "summary": "Wife and I saw a circle obj. that looked like a star moving NW.  As it moved across the sky, it got really bright. ((anonymous report))",
      "city": "louisville",
      "shape": "circle",
      "date": "2016-06-10T00:00:00",
      "story": "My wife and I saw a circle object that looked like a star moving northwest.  As it moved across the sky it got really bright two different times.  Then it looked like it stopped and then just disappeared.   We have no idea what it was.   On another night, about a month ago, we saw two objects in the same area of the sky that looked like stars but they were moving really fast then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127727.html",
      "state": "CO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c597c",
      "summary": "@Approx,10:19pm/May 13-2016.  Saw from r/side of sky, star like object, began going across sky to left. Behind had bluish green trail.",
      "city": "louisville",
      "shape": "other",
      "date": "2016-05-20T00:00:00",
      "story": "@Approx,10:19pm/May 13-2016.  Saw from r/side of sky, star like object, began going across sky to left.  Behind had bluish green trail.  As I followed it, it began wobbling left to rt, then vanished!   My daughter & I were on phone talking, she said, \"What's that\"?  Simultaneously!  She said she heard noises, sounded like interference, going \"Yua yua..yua yua\".   Soon as object disappears so did phone interference!  It was as if this \"star\" had a fuel-trail/light-trail, that stretched across entire sky.  Just before it vanished, began wobbling left to rt, as if it lost control?  Wow!!",
      "link": "http://www.nuforc.org/webreports/127/S127364.html",
      "state": "KY",
      "duration": "~10-12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bcf",
      "summary": "Approx 21:40 4/13/2016 bright white/clear orb.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2016-04-15T00:00:00",
      "story": "Approx 21:40 4/13/2016 bright white/clear orb.  Object was about 42° upward.  About a few mile high.  Object traveling SE 136°.  Observation of the object from NE 32°. Unable to determine speed.  Aircraft began to come into sight,  Object maneuvered and quickly lost sight.  Unable to triangulate.  Object was not ISS.",
      "link": "http://www.nuforc.org/webreports/126/S126840.html",
      "state": "KY",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cb0",
      "summary": "Perfect triangular formation of fireballs to a thirty degree angle.",
      "city": "louisville",
      "shape": "fireball",
      "date": "2016-12-05T00:00:00",
      "story": "Perfect triangular formation of fireballs to a thirty degree angle. They were bright orange-blue color and were formed in an perfect triangle tilted to a thirty degree angle.  There were three, as if they were three vertices.  They were like fireballs, circular in nature.  One of the ufos split to the left, moving slower than a plane.  The two remaining ones moved closer together but stayed stationary until after we left the gas station and they were gone.",
      "link": "http://www.nuforc.org/webreports/131/S131183.html",
      "state": "KY",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d8a",
      "summary": "Strange straight white light with V shape turned onit's side tail with a red light seen in the same spot not moving for about a hour .",
      "city": "louisville",
      "shape": "other",
      "date": "2016-12-05T00:00:00",
      "story": "Strange straight white light with V shape turned on it's side tail with a red light seen in the same spot not moving for about a hour . For about the last week I have seen a strange light in the sky at the same time at night on every night for the past week starting back from 11/19/16 .                                                                              The strange light looks like a straight line that is a bright white light with a V shape tail at the end of it on the right side if you were looking at it from the east .                                                                                  It almost looks like and arrow , a straight line with a V shape turned on its side with the open part of the V facing away from the straight line . But doesn't have a point on the front of it unless it has a small point on the top only .                                                                                  And there is a red round light on the bottom side of the V shape tail that changes colors . All of it is a bright white color except the red light at tail section that chan! ges colors. But the red round light isn't at the end of the V shape tail . It's at the point where the bottom of the V shape starts .                                                                                It has been in the southwest area of the sky . Closer to south . At the same time at night and every night for a week at least . And it stays there in the same spot for at least a hour . But it could be more than a hour I will time it tonight if it comes back .                                                                                  It doesn't move at all it just stays in the same spot and it gives you a feeling like it is watching you . Don't know how to describe it . It just feels like it is watching you as soon as you start to look at it .                                                                                    I have showed it to a couple of people to make sure I wasn't seeing something normal in the sky . And they have all agreed with me on what it looks like and that it isn't moving .                  !  I will report back with more information tomorrow .",
      "link": "http://www.nuforc.org/webreports/131/S131255.html",
      "state": "KY",
      "duration": "1-2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c601e",
      "summary": "Approximately 21:04 on Tuesday 9/20/2016 two objects were observed approximately 224° southwest at approximately +38° the 2 silver whit",
      "city": "louisville",
      "shape": "sphere",
      "date": "2016-09-30T00:00:00",
      "story": "Approximately 21:04 on Tuesday, 9/20/2016, two objects were observed approximately 224° southwest at approximately +38° the 2 silver white shining orbs hovered for about 15 seconds.  They seemed to just disappear.  There was a large orb and a small orb.",
      "link": "http://www.nuforc.org/webreports/130/S130136.html",
      "state": "KY",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6035",
      "summary": "Triangular UFO with one bright light at the point.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2016-10-27T00:00:00",
      "story": "Triangular UFO with one bright light at the point. I went outside to walk my dogs, and noticed a very bright star.  I live ten miles from town, so I never have street lights preventing me from seeing stars.  The brightly lit star suddenly turned orange and then red.  I quickly yelled for my mother to come out. As we are watching, it changed back to white, but dimmer.  Then a beam of white light appeared diagonally.  At that point, we were looking at a single bright light, and a beam coming down and angled to the right.  Next, a second beam came down diagonally to the left. So, it is a bright light with two beams coming down to form a triangle.  A bottom beam never appeared.  You could compare it to an upside down letter \"V\" with the bright light at the point.  We watched as it reduced back to a single light and faded out of sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130792.html",
      "state": "MS",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c627d",
      "summary": "Approximately 20:44 on Wednesday 9/28/2016 one object observed moving from Approximately 224° SW toward 44° NE moving too slow to be a",
      "city": "louisville",
      "shape": "sphere",
      "date": "2016-09-30T00:00:00",
      "story": "Approximately 20:44 on Wednesday 9/28/2016 one object observed moving from Approximately 224° SW toward 44° NE moving too slow to be a conventional aircraft, too fast and steady to be a balloon.  The object appeared to emit a clear and hazy white/silver shimmering light.  The object was appeared to be orb shaped.  Not ISS.  Event lasted approximately 15 to 20 seconds.  The object faded slowly but too soon to be out of sight.   The object did not increase speed.  The object appeared to simply disappear.",
      "link": "http://www.nuforc.org/webreports/130/S130308.html",
      "state": "KY",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c67f4",
      "summary": "Erratic moving craft seen apx 2:00, unlike any common aircraft i see on a daily basis..",
      "city": "louisville",
      "shape": "light",
      "date": "2017-04-20T00:00:00",
      "story": "Errractic moving craft seen apx 2:00, unlike any common aircraft i see on a daily basis.. I am a 21 year old male.  I do not take any medications other than lisinipril for blood pressure.  And have been declared competitent by my peers.   I was sitting outside last night, enjoying the cool night air, when a slow pulsing light caught my attention.  It wasnt blinking red or green such as a normal aircraft would be.  I see planes cross the sky every hour or more where there is an airport close to me.   But this light moved in such an erratic pattern that I have never seen any airplane or helicopter do.  Almost as if it skipped sections of the sky.  It was completely silent.  And my best explanation of the color would be almost an neon bluish purple.  It gave me the creeps.",
      "link": "http://www.nuforc.org/webreports/133/S133682.html",
      "state": "KY",
      "duration": "<1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ac1",
      "summary": "Bright round orb in sky appeared to be moving slow.  Carefully watched and the light dimmed and lowed in sky then brightened and rose b",
      "city": "louisville",
      "shape": "circle",
      "date": "2017-02-10T00:00:00",
      "story": "Bright round orb in sky appeared to be moving slow.  Carefully watched and the light dimmed and lowed in sky then brightened and rose back up quickly then after a couple more minutes it disappeared.",
      "link": "http://www.nuforc.org/webreports/132/S132460.html",
      "state": "KY",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d4f",
      "summary": "Multiple craft ascending from north of Shelbyville road, very bright and very quiet in comparison to passenger planes seen in the sky a",
      "city": "louisville",
      "shape": "unknown",
      "date": "2016-12-21T00:00:00",
      "story": "Multiple craft ascending from north of Shelbyville road, very bright and very quiet in comparison to passenger planes seen in the sky a I was looking north from my back porch while smoking a cigarette right around midnight.  I noticed a very bright light that I first thought was just a bright star.  After comparing it to other stars, I could tell it was way too bright.  I continued to watch and finally noticed that the object was moving.  The first object moved to the east before it completely disappeared from sight.  Intrigued I continued watching and yet another ascended from the same area.  I started recording from my phone as more and more objects followed the same routine.  All objects took different routes, going either east or west and then disappearing. If I had to guess I would say these were some type of military stealth aircraft or something.  What I find strange though is that none of the airports in Louisville are north of Shelbyville road.  The closest airport to the north is about 100 miles away.  If these craft were to come from that far, their lights wouldn't be visible.  In fact other passenger planes from Standiford Airport in Louisville were going over at the same time, and they were barely visible.",
      "link": "http://www.nuforc.org/webreports/131/S131823.html",
      "state": "KY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ea0",
      "summary": "Evening of Aug. 10, 2017, at approx. 10:00 p.m. Eastern Time I observed an unusually bright light flashing at irregular int",
      "city": "louisville",
      "shape": "light",
      "date": "2017-08-17T00:00:00",
      "story": "On the evening of Aug. 10, 2017, at approximately 10:00 p.m. Eastern Time, I observed an unusually bright light flashing at irregular intervals.  This light was much larger than surrounding stars, brighter than two observable aircraft that we operating with navigation  lights.   The UFO was first observed just above the North star.  It the moved slowly to the south east.",
      "link": "http://www.nuforc.org/webreports/135/S135657.html",
      "state": "KY",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f67",
      "summary": "My husband and I were outside and could see planes coming in to the airport for the UPS sort.  The UPS planes were traveling E to W.",
      "city": "louisville",
      "shape": "circle",
      "date": "2017-08-11T00:00:00",
      "story": "My husband and I were outside and could see planes coming in to the airport for the UPS sort.  The UPS planes were traveling East to West, then I saw an object traveling South to North, moving across the sky at about 100 ft above the ground and it was moving about the speed of a helicopter.  There were red moving lights on the back in a circle and it looked like a ferris wheel.  It moved across the sky and disappeared.   This happens off Hurstbourne and Taylorsville Rd Friday 8-4-17 @ 10:00 pm.",
      "link": "http://www.nuforc.org/webreports/135/S135585.html",
      "state": "KY",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f8a",
      "summary": "Slow moving dark colored triangular object with no lights or sound moving west and low in night sky.",
      "city": "louisville",
      "shape": "triangle",
      "date": "2017-07-07T00:00:00",
      "story": "Slow moving dark colored triangular object with no lights or sound moving west and low in night sky. I work as a security officer at a building in Louisville.  I was outside driving the parking lot in the patrol vehicle, when I happened to look up and spot an object, triangular in shape, but rounded at the corners, moving across the sky very slowly.  There was no noise from the object, nor any lights emitting from it.  It was 11:45pm and the sky was partly cloudy.  I could see a few small clouds in the sky near the object, and could determine that the object was not a cloud as it was moving slightly faster than the surrounding clouds.  At night in the city, clouds have an orange color at the bottoms as the street lights of the city reflect off of them.  The object however didn’t have the same coloration at the bottom.  It was of a darker grey color at the bottom, with a lighter gray color on the top.  I was viewing this object at its left side.   My patrol vehicle was facing west, and the object was moving east along with the clouds.  The object did not ! have a shiny surface from what I could see.  As far as the size of the object, it was at least the size of 5 school buses, maybe a bit larger.  It was very low in the sky and I could tell it was big.  I asked our camera operator in the dispatch office to see if they could get the object on camera, unfortunately they were not looking at the same direction as I was, and therefore I was the only witness.  The entire sighting lasted somewhere between 30 to 60 seconds.  It continued to head west until out of view.  I am still excited over this sighting even after nearly 90 minutes after the fact.   I truly hope someone else in the area saw this thing.  I have seen plenty of helicopters, planes, and satellites in the sky at night move across the sky.  This thing was none of those.",
      "link": "http://www.nuforc.org/webreports/134/S134738.html",
      "state": "KY",
      "duration": "30-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6fe3",
      "summary": "I heard a noise like a large machine getting louder and louder and then I saw an it come right over my house very low on a staight line",
      "city": "louisville",
      "shape": "triangle",
      "date": "2017-08-24T00:00:00",
      "story": "I heard a noise like a large machine getting louder and louder, and then I saw an it come right over my house very low on a staight line Northeast to Southwest.  It had lots of lights on underside unlike any plane or helicopter I've ever seen.  Too slow to be a plane and did not sound like helicopter at all.",
      "link": "http://www.nuforc.org/webreports/135/S135851.html",
      "state": "KY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c77cc",
      "summary": "2 UFOs. High altitude surveillance or intelligent plasma balls?",
      "city": "louisville",
      "shape": "changing",
      "date": "2017-11-03T00:00:00",
      "story": "2 UFOs. High altitude surveillance or intelligent plasma balls? I noticed two small objects at a very high altitude, slightly east of where I was standing in Louisville, KY.  I was facing northeast and looking directly up while recording video on my iphone.  When the objects began moving closer overhead, they gained altitude.   I ran in to get my phone and recorded for a couple minutes, then I got binoculars and watched them remain overhead for about an additional 6-7 minutes.  Viewing with the naked eye they appear to twinkle very brightly, as though someone were reflecting the sun with a mirror; much brighter than the reflection off an airplane, and not like a flashing light but more of a shaky erratic effect and far brighter.   Through the binoculars they were very different.  They didn't appear to be reflecting light, they were just a bright citrusy yellow, like a tennis ball.  They were spherical with no wings.   The reason they appeared to twinkle is because they each seemed to be made of two spheres attached to each other, but rolling around each other in a rapid undulating and random orbit with no space in between the two parts.  This effect caused them to look elongated for short moments as the two spheres that made the individual objects were sometimes next to each other instead one on top of the other.   I tried to search for other reports of similar objects, but most were at night.  Some web sites talked about plasma orbs but I am not sure because the color was consistent.  Whatever they were, they seemed to be intelligently driven, because they stayed together and once they were overhead they didn't leave, as though they were looking back! (no voice to skull technology or other communication used on me, sorry)  This is not the first time (I assume by the naked eye view) I have seen one of these.  A few months ago, also during bright daylight, I saw one while walking into a gas station.  I watched it for 3-4 minutes, twinkling brightly but not moving at all, until a cloud covered it.  The two on the recent occasion disappeared behind chemtrails that were drifting.  A cold front had just moved through and we had surprisingly clear skies (still have today).  The chemtrails have been very heavy here for months, lessening on most weekends.  I also captured an excellent shot of a sun halo, which I have seen many times in the last couple months.  If you have any information or insight, please respond.  If I'm going to keep seeing these things I'd like to understand their nature better.",
      "link": "http://www.nuforc.org/webreports/136/S136872.html",
      "state": "KY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c790e",
      "summary": "Watched at least 15 bright orange-red objects rise above tree line and traveled independently from S to NE.  ((anonymous report))",
      "city": "louisville",
      "shape": "circle",
      "date": "2017-11-03T00:00:00",
      "story": "Watched at least 15 bright orange-red objects rise above tree line and traveled independently from south to north east.  No formation, but grouped together.   They did strobe randomly and moved slowly for 3 minutes as they disappeared in the northeast night sky. ((NUFORC Note:  Source does not indicate date of sighting, so we have assigned an arbitrary date.  Source of report remains anonymous, and provides no contact information, so we cannot contact him/her in order to confirm the date.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136910.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d15",
      "summary": "Hot white light over Louisville.",
      "city": "louisville",
      "shape": "diamond",
      "date": "2017-09-21T00:00:00",
      "story": "Hot white light over Louisville. I went outside to smoke and caught a light pass my field of vision and then it was gone. I thought I caught it again out of my perfrial but turned and it was gone.   I turned and the light was a very bright white dipped down like it was falling, but then came back up, and then went back down over the tree line and it did not come back.   It was brighter in the middle and the shape was not totally solid.  No tracers like a meteorite and very white.   The house with no light was at my back and most lights in all the neighborhood were out or minimal.   The sky was cloudy and few visible stars.   I'm not sure what it was, but it wasn't anything I've seen before.",
      "link": "http://www.nuforc.org/webreports/136/S136216.html",
      "state": "KY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cf4",
      "summary": "1 light became 2 lights that surrounded a bigger light.  ((anonymous report))",
      "city": "louisville",
      "shape": "light",
      "date": "2017-09-28T00:00:00",
      "story": "1 light became 2 lights that surrounded a bigger light. my wife and i went for a night walk and we saw a triangle formation of lights. then about a minute latter one of the lights split into 2 lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136417.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e48",
      "summary": "Ciriclar craft seen less 2 miles from the ground",
      "city": "louisville",
      "shape": "circle",
      "date": "2018-05-31T00:00:00",
      "story": "Ciriclar craft seen less 2 miles from the ground Whilst smoking a cigarette a craft was seen ascending from the ground.  First it was assumed to be medical personal or military in origin.  Craft materialized from a bright light, and was not at first identified as the object in question.  Then the object, over the course of several minutes, worked its way over head of the observer/narrator.  The object was easily 50 feet in length with different color lights on the ends of red blue and green.  It was circular except for the north and south ends of the object having a jagged and horizontal edges.  Object stayed straight moving right passed the observer, until it faded into the distance. No upwards movement was observed, and the object quickly faded from view.  It did have a noise, and was not silent.  However the object did move awkwardly for a b52/757 style craft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141659.html",
      "state": "KY",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f4d",
      "summary": "I saw a strange object in the sky over my house in Louisville, KY.  It happened around 1:30 pm and lasted maybe a total of 1 minute.",
      "city": "louisville",
      "shape": "changing",
      "date": "2018-05-04T00:00:00",
      "story": "I saw a strange object in the sky over my house in Louisville, Kentucky.  It happened around 1:30 pm and lasted maybe a total of 1 minute all together. At first it almost looked like a black line in the sky.  It went over a tree and I caught a glimpse out of the corner of my eye.  I didn't think to much of it and just thought it was a plane, until the object did a complete turn without turning.  It turned on the dot and started going back in the other direction, coming back towards my house as a glowing ball or orb of bright whitish/yellow light.  It was moving at a steady pace.  It then went straight up into the rays of the sun and disappeared.  There was absolutely no sound whatsoever. Clearly it was not an airplane as I live close to an airport and there were 2 planes in the sky around the same time.  Since I live so close to the airport, most of the planes are taking off or landing so they are pretty close to the ground and quite distinguishable. The strangest part to me was that it was in the middle of the day and yet it was so brightly glowing. I was able to take a few photos of the object; however, my cell phone camera isn't the best so it just looks like a bright light in the sky.",
      "link": "http://www.nuforc.org/webreports/139/S139723.html",
      "state": "KY",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8106",
      "summary": "Driving home and saw a very bright white star in an odd spot in the sky. It blinked 3 times then moved quickly to the left in a perfect",
      "city": "louisville",
      "shape": "light",
      "date": "2018-03-23T00:00:00",
      "story": "Driving home and saw a very bright white star in an odd spot in the sky.  It blinked 3 times then moved quickly to the left in a perfectly smooth straight line then completely disappeared.  It didn’t drop out of the sky or reappear anywhere else.   My boyfriend was driving separately and saw the exact same thing a few cars back.  It was not a drone.  We were driving on I-265 South...   It was the strangest thing I’ve ever seen.  The way it moved was so strange.  And the blinking did not resemble that of a plane.  There were no clouds and it didn’t disappear into any trees.",
      "link": "http://www.nuforc.org/webreports/139/S139241.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c828a",
      "summary": "Eclipse UFO, 3,000 mph and no noise",
      "city": "louisville",
      "shape": "diamond",
      "date": "2018-09-27T00:00:00",
      "story": "Eclipse UFO, 3,000 mph and no noise I was taking video of the Sun during the eclipse that happened about a year ago.  Later that evening while I was  reviewing the video,  I was astounded to see something fly past in only 3 or 4 frames of video.  I think the video frame rate was 30 fps.  My calculations show that the object was moving at around 3,000 mph, yet no noise came from it at all.  Also, there is a cell tower about 100 feet away from where I was video taping.",
      "link": "http://www.nuforc.org/webreports/143/S143095.html",
      "state": "KY",
      "duration": "<1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c8422",
      "summary": "My son woke me up around 4am crying. I got him back to sleep and stepped outside for a cigarette. The moment I stepped outside my patio",
      "city": "louisville",
      "shape": "light",
      "date": "2018-09-13T00:00:00",
      "story": "My son woke me up around 4am, crying.  I got him back to sleep and stepped outside for a cigarette.  The moment I stepped outside my patio door, something in the night sky caught my eye. I look up and notice one very bright unusually placed 'star' in the sky. It was very low, just above the horizon line.  It was flashing.  And I don't mean twinkle twinkle, it was flashing brightly what seemed to be blue-ish/ yellowish colored lights.  So I took out my phone and started recording.  At this time I noticed 2 other stars doing the exact same thing only they were further away, higher in the sky and not flashing as brightly as the one low to the horizon.  The shape was triangular with the brightest 'star' at the bottom or tip.  It did not move across the sky however I did hear a far away humming sound.  My dog kept looking out the window with her tail down between her legs crying. I have video footage. I have been noticing a lot of strange things in our skys recently. I have a weird feeling that something bigger than us is coming. And I am not one of those creepy end of the world is nearing people.",
      "link": "http://www.nuforc.org/webreports/142/S142995.html",
      "state": "KY",
      "duration": "Until sunrise"
    },
    {
      "_id": "64d005f478aba2ec5a3c8441",
      "summary": "White Object Constantly Changes then Vanishes Instantly.",
      "city": "louisville",
      "shape": "changing",
      "date": "2018-08-10T00:00:00",
      "story": "White Object Constantly Changes then Vanishes Instantly. This sighting happened during the summer and a few years after the passing of my father, which would put it in July or August of 1997.  I'm thinking it was August because my initial thought, when I saw this UFO, was that it must be a bundle of helium balloons that must have gotten away from someone at the Kentucky State Fair (KSF).  The KSF normally begins in mid August and last about eleven days.  The sighting happened about four miles to the east from the KSF, which would put it down wind.  I wanted to take a picture of it so I ran in our house and grabbed a 35mm disposable camera.  Fortunately, the object was still there when I got back, and I was able to get a photo of it. The object appeared to \"Boil\" in slow motion or constantly changed shape.  It continually drifted east as I watched it, and after a minute or two a jet airliner flew past and at that moment the object instantly vanished.  The closest thing I can compare it to was the \"Nellis AFB UFO\" video that's out there on YouTube.  The object seemed to be about 1,000 to 2,000 feet in altitude.   I'm starting to get older and just wanted to share this with the world.  I'm e-mailing a photo image called \"UFO1.jpg\". ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142539.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c84b8",
      "summary": "Walked outside to smoke a cigarette at, a little after 11pm. Looked up in the sky, and seen a large sphere.",
      "city": "louisville",
      "shape": "sphere",
      "date": "2018-08-10T00:00:00",
      "story": "Walked outside to smoke a cigarette at, a little after 11pm.  Looked up in the sky, and seen a large sphere. The sphere had lights rotating around the edge.  Was headed eastward through downtown.  Once it passed town, it casually veered dorectly north, till it disappeared out of view.  The object made no sound. When i first seen the object it was so low to the ground I thought for sure it was going to land.  But it never did.  It definitely was not a helicopter, or a airplane.",
      "link": "http://www.nuforc.org/webreports/142/S142342.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c84a8",
      "summary": "Saucer shaped ship seen in recording of meteor over Louisville, KY.",
      "city": "louisville",
      "shape": "disk",
      "date": "2018-09-13T00:00:00",
      "story": "Saucer shaped ship seen in recording of meteor over Louisville, KY. The following is a testimonial of my UFO sighting that occurred in Louisville, KY on Tuesday, September 28th, 2018, between 8:26 PM and 8:30 PM (timestamp on video). I had just exited I-264E, Exit 5A towards Campground road.  While traveling on Ralph Ave, I noticed what appeared to be a meteor falling in the sky.  It was traveling at roughly the same speed as the jets that fly by.  To give perspective, if I were standing (I’m 6’1”) and reached my hand out, its tail would measure ~1.5-2” from thumb to pointer finger and it would take ~6-8 seconds to travel that same ~1.5-2”. I pulled my SUV over at the employee entrance to the Dow Chemical Plant (at 4300 Camp Ground Road) to shoot the video clip.  While recording the video, I start to receive a call (and thus stop recording), I accept the call in the car and drive off, heading south-west on Camp Ground Road.  Interestingly enough, I see what appears to be another meteor quite a distance off in the NW direction that seemed to be leaving its tail in a curve up or spiral-like formation.  I could see both simultaneously.  I did not catch this on film but wanted to bring it up regardless. When I arrived at my friend’s house, I began telling him about the meteor and was trying to describe it’s fiery tail.  I was zoomed in to the meteor when I noticed it.  A black dot blazes by the meteor at impossible speeds, in comparison to fighter jets like those that appear at Thunder Over Louisville.  Slowing the video down and panning back and forth I actually discover another UFO that crosses above the meteor a second before the other.  This was shot on an iPhone X, and you can’t really see it unless you zoom in—but it appears to be a saucer-shaped vessel. I was previously a skeptic, but since I recorded this video myself?  I’m a believer now.",
      "link": "http://www.nuforc.org/webreports/142/S142964.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8765",
      "summary": "Four white very small lights (stars?) moving in sync across sky making a diamond shape on July 4th, 2018, 10pm  ((anonymous report))",
      "city": "louisville",
      "shape": "diamond",
      "date": "2018-07-13T00:00:00",
      "story": "Four white very small lights (stars?) moving in sync across sky making a diamond shape on July 4th, 2018, around 10pm My husband and I were watching the neighbors' fireworks down the street, when we noticed what appeared like 4 stars in a diamond shape that were moving quite quickly across the sky.  We assumed the fireworks were causing the illusion, but when the fireworks stopped the stars kept moving for around 3-5 min. until out of sight.  Oddly enough, 4 planes went over us in that time period some close, some very far away an we were able to compare.   These lights were very small lights that looked like stars, and appeared very far away.  We thought maybe they were satelites, but moved a little slower than satellites I've seen.  Not sure if any sattellites move in sync?  I've never been able to see satellites in the city, but it's possible they were.  They would've been far enough apart that if it was a craft, it would have been huge. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142102.html",
      "state": "KY",
      "duration": "<5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8837",
      "summary": "went outside to smoke and seen them they faded very quickly not sure how they were there.  ((anonymous report))",
      "city": "louisville",
      "shape": "light",
      "date": "2018-07-05T00:00:00",
      "story": "went outside to smoke and seen them they faded very quickly not sure how they were there 2 very bright craft white light then faded away ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142014.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c88c5",
      "summary": "KY Fireball shoots across at tree tops",
      "city": "louisville",
      "shape": "fireball",
      "date": "2018-06-21T00:00:00",
      "story": "KY Fireball shoots across at tree tops While outside on the back porch in Southeast Louisville, my wife saw what looked like a fireball shoot across the top of a large tree and disappear about 50 yards away behind another equally tall tree.  The light looked yellow in color and looked to be about 50-70 feet in the air.  It moved from East to West in the sky and could only be seen for about 3-5 seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141885.html",
      "state": "KY",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bee",
      "summary": "Lightening storm with possible UFO at top left of screen.",
      "city": "louisville",
      "shape": "unknown",
      "date": "2019-02-14T00:00:00",
      "story": "Lightening storm with possible UFO at top left of screen. I was video recording a thunderstorm in slo-motion last year.  I didn’t notice the strange lights towards the end of the video until a month or go.  If you scroll through the video frame by frame the traffic lights randomly go completely dark but say red.  These are not flashing lights and the lightening doesn’t seem to be directly striking the poles.  Towards the end 2 lights appear at the top left of the video then appear to take off vertically.  You must scroll screen to screen to see what’s going on.  I don’t think it is a light reflection because no other vehicles pull up to the lights.  Just curious.  Strange that the red lights are flashing totally off and on.",
      "link": "http://www.nuforc.org/webreports/144/S144830.html",
      "state": "KY",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8cc6",
      "summary": "Very bright ball of light in sky",
      "city": "louisville",
      "shape": "circle",
      "date": "2019-02-01T00:00:00",
      "story": "Very bright ball of light in sky Walked outside to smoke a cigerette with my husband before work and we seen 2 balls of light, one very bright and bigger than the other just hovering in the sky which seemed to be close to us you could see them moving around put staying in same spot a plane flew right passed them and they still stayed moving around in a circlular motion.",
      "link": "http://www.nuforc.org/webreports/144/S144682.html",
      "state": "KY",
      "duration": "Light"
    },
    {
      "_id": "64d005f478aba2ec5a3c8cd9",
      "summary": "It was round with blue lights.  It hovered in the same spot for several minutes before descending straight down.",
      "city": "louisville",
      "shape": "circle",
      "date": "2019-02-01T00:00:00",
      "story": "It was round with blue lights.  It hovered in the same spot for several minutes before descending straight down. I was pulling out of my driveway at approximately 8 pm when I looked up and saw a round craft hovering above in the distance.  It had blue lights and I could not tell if they were strobing or if they were going around.  I knew I was looking at something out of the ordinary.   I made a couple of short videos on the phone to document it even though you couldn’t pick up the blue lights.  I then called my husband to tell him and as I hung up it descended straight down and disappeared out of my view..",
      "link": "http://www.nuforc.org/webreports/144/S144695.html",
      "state": "KY",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e1d",
      "summary": "We observed 9 orange spheres traveling south to north over the city.  All in the same direction and at different altitudes.  Formation",
      "city": "louisville",
      "shape": "sphere",
      "date": "2019-01-04T00:00:00",
      "story": "We observed 9 orange spheres traveling south to north over the city.  All in the same direction and at different altitudes.  Formation was 2 further ahead, 4 in the middle, and 3 strung out behind.  I'm a pilot and these were not airplanes.  Just a steady burning orange light.  Too fast to be Japanese lanterns.  Video was also captured.",
      "link": "http://www.nuforc.org/webreports/144/S144176.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8eea",
      "summary": "3 fast moving lights chased by black helicopters, flight tracking app had no helicopters in area.  ((anonymous report))",
      "city": "louisville",
      "shape": "light",
      "date": "2018-12-14T00:00:00",
      "story": "3 fast moving lights chased by black helicopters, flight tracking app had no helicopters in area. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143997.html",
      "state": "KY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fe2",
      "summary": "Helicopter chased by UFO.  ((anonymous source))",
      "city": "louisville",
      "shape": "disk",
      "date": "2018-11-24T00:00:00",
      "story": "Helicopter chased by UFO Saw a high speed helicopter flying low being chased by a large black saucer-like object. The chopper was flying northbound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143841.html",
      "state": "KY",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c901c",
      "summary": "Metallic egg shaped object vanished in front of our eyes!",
      "city": "louisville",
      "shape": "egg",
      "date": "2019-12-01T00:00:00",
      "story": "Metallic egg shaped object vanished in front of our eyes! Object was seen over the Ohio river running parallel to Dixie Highway between Highway 44 and West Point.  Object was egg shaped and metallic.  It flashed bright light as if the sun were reflecting off of it.  The light dulled and the object disappeared as we watched it.",
      "link": "http://www.nuforc.org/webreports/149/S149805.html",
      "state": "KY",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c91bb",
      "summary": "Driving thru Valley Station myself and my daughter seen 3 lights above a tree. The lights were green with small white lights to the sid",
      "city": "louisville",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Driving thru Valley Station myself and my daughter seen 3 lights above a tree.  The lights were green with small white lights to the sides.  They shot off and disappeared.",
      "link": "http://www.nuforc.org/webreports/149/S149645.html",
      "state": "KY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9428",
      "summary": "Luminous streak of light descend then sped off at rapid speed",
      "city": "louisville",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Luminous streak of light descend then sped off at rapid speed In Heritage Creek of Louisville facing North Sky we just saw a flash of light.  To me this light was luminous and soft white with some pink/purple light and appeared to be falling/descending so I at first thought it was a firework but realized it was not.  And I watched as it just disappeared in the sky.  My partner saw same light but to him he saw the light fall as I saw it do, but he said he saw it spiral after it “fell” then shoot off into the distance (away from us) at a rapid speed.  We didn’t feel the earth quake so nothing hit the ground.",
      "link": "http://www.nuforc.org/webreports/150/S150512.html",
      "state": "KY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9589",
      "summary": "Thought it was a plane at first but it was moving back and forth, left and right. Then it disappeared into thin air. Shortly after a la",
      "city": "louisville",
      "shape": "light",
      "date": "",
      "story": "Thought it was a plane at first, but it was moving back and forth, left and right.  Then it disappeared into thin air.  Shortly after a large plane with a huge spotlight followed the object.  This is the first of two sightings.",
      "link": "http://www.nuforc.org/webreports/149/S149042.html",
      "state": "KY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c95d0",
      "summary": "Helicopter beng chase by ufo.",
      "city": "louisville",
      "shape": "light",
      "date": "2019-10-04T00:00:00",
      "story": "helicopter beng chase by ufo There was show on TV about two pilots that was chased by a ufo it was around the morning hours.  I had taken my husband to work he drove a truck and he want to leave early to miss the morning traffic.  I took my to work and when I came back I saw the  helicopter and something behind it chasing it.  it scared me so I shut my car down to watch didn't want it to see my head lights.  It was chasing the helio at high speed. it went for to minutes or so and the it went into town. I felt that being ex military and navy I needed to back them. show stated that if saw report it.  I am not looking for glory or anything.  Just wanted to say that I witness the event.",
      "link": "http://www.nuforc.org/webreports/149/S149039.html",
      "state": "KY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9734",
      "summary": "I thought it was a star, but there was lights and it kept doing circular loops in the sky.",
      "city": "louisville",
      "shape": "fireball",
      "date": "2019-12-19T00:00:00",
      "story": "I thought it was a star, but there was lights and it kept doing circular loops in the sky. I’m a sixteen year old female.",
      "link": "http://www.nuforc.org/webreports/151/S151512.html",
      "state": "KY",
      "duration": "An hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c9873",
      "summary": "oblong shiny silver aircraft with no wings flying slowly and relativity low.",
      "city": "louisville",
      "shape": "rectangle",
      "date": "2019-10-04T00:00:00",
      "story": "oblong shiny silver aircraft with no wings flying slowly and relativity low. Oblong shape flying aircraft.  A bright silver color that was very shiny.  Clear skies.  Moving relatively slowly.  Saw it going southwest approximately 180 degrees to 210 degrees.  No sound at all could not hear the object.  It was after dinner in the evening. Looked like it was smoothly flying with no exhaust trails, even though low normal flying aircraft don’t have contrails. No wings, no lights that I could see because it was very shiny.  This happened in September 2019.  The day was either the 23rd or 24th of September.  Only saw it for 10 seconds to 15 seconds because I could not see it over the tree.  2 witness.",
      "link": "http://www.nuforc.org/webreports/149/S149322.html",
      "state": "KY",
      "duration": "10 seconds"
    }
  ]
}