{
  "city": "lubbock",
  "fetch_timestamp": "2025-07-12T14:35:47.813951",
  "record_count": 38,
  "pages_fetched": 1,
  "api_calls": 2,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b43bb",
      "summary": "Lubbock, TX: saw an illuminated object moving quickly from the south to the north at a high altitude and was being followed by a plane.",
      "city": "lubbock",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "Lubbock, TX: saw an illuminated object moving quickly from the south to the north at a high altitude and was being followed by a plane. At around 10:30 pm I was in my back yard and saw a swift moving lighted circular object that was about 35 degrees above the horizon at what seemed a high altitude.  My house faces north and the back door into the back yard faces south.  I was standing in the middle of my yard and noticed the object in the south sky moving north-north west.  One block south of my house there is a brightly lit car lot and birds and bats can be illuminated up to about 100 feet above the lot.  I first I thought it was an illuminated bird as it moved across the sky but as it moved very quickly (approximately 10 times the speed of a jet airliner at cruising altitude)from a south-south west, to west position it became obvious that it was it was not being illuminated from the ground because it never waivered in brightness and appeared to be at a high altitude.  The light was not brilliant more of solid off white illumination.  The light did not blink nor did I see it change color (I am red-green color blind and therefore might not of noticed subtle color changes).  Once it was approaching a due west position I called my wife out to see.  She saw it to and first thought it was a plane but I pointed out the velocity and she agreed that it was moving very fast and could not make out what it could be.  It appeared to very slightly lower in altitude as it moved.  We tracked it from the back yard until my sight line was blocked by my neighbors house.  I then walked quickly to the front yard and saw it in the northwest sky for about 5 more seconds before it again moved out of my sight line by the roofs of houses across the street.  At the point that my sight line was blocked it was only about 15 degrees above the horizon.  I then walked back into my house and back into the back yard.  I then noticed a plane in the southwest sky that was approaching from the south west then changed direction moving north along a very similar path that was taken by the object.  The lights on this plane were a yellowish color and it had a blinking light.  It was moving much slower than the object that had just passed.",
      "link": "http://www.nuforc.org/webreports/049/S49814.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b47d4",
      "summary": "I was watching a clip I filmed, I was actually filming small clips as I drove of an industrial area of Lubbock for an art reference as",
      "city": "lubbock",
      "shape": "other",
      "date": "2019-08-23T00:00:00",
      "story": "I was watching a clip I filmed, I was actually filming small clips as I drove of an industrial area of Lubbock for an art reference as I was driving back home with my family to Abernathy (just north of Lubbock).  It seems normal, like as if plane tracers.  Then it seems like something is flying side by side, then behind the FIRST trail at the top something starts flowing brighter (as if it's being fired on or speeding up possibly?)  Then flashing sequence lights seem to come out of ...well nowhere but around in proximity to the first trail O-o.  Honestly, I am stumped.",
      "link": "http://www.nuforc.org/webreports/148/S148195.html",
      "state": "TX",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b542d",
      "summary": "Cigar shaped cloud and left very fast.",
      "city": "lubbock",
      "shape": "cigar",
      "date": "",
      "story": "Cigar shaped cloud and left very fast. I was very young at the time.  I was playing outside with my friends.  There were no clouds in the sky.   We heard a whirling noise and looked up.  I saw a cigar shaped object above us.  I thought it was a cloud.  I told the kids that there where no clouds in the sky.  It sat over us for a few minutes and when, I looked up, it was gone. I still remember that time. This was in the 50s and Lubbock had the unidentified lights going on.  I think it had to do with Reese Airforce Base.   I talked to a gentleman at Roswell and he thinks I may have seen something at my young age. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59458.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d29",
      "summary": "cylinder shaped object floating in the sky and then drifting off",
      "city": "lubbock",
      "shape": "cylinder",
      "date": "2007-08-07T00:00:00",
      "story": "cylinder shaped object floating in the sky and then drifting off I was walking outside and just happened to look up at the moon toward the west and saw a very dark object with a cylinder shape overall. At first I thought it might be some balloons in the sky, but they did not bob and weave like balloons I've watched float away. It sat still for about 3-4 minutes, then began moving very slowly to the south. It had no lights, and as it very slowly moved it seemed to also be moving up and away so that it became smaller and smaller. I was franticly trying to get my digital camera to work, but the batteries were dead, and every time I looked down at it, I could barely find the object again against the darkening sky. Finally it just drift completely out of sight.",
      "link": "http://www.nuforc.org/webreports/057/S57240.html",
      "state": "TX",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a94",
      "summary": "SINGLE OVAL-TEARDROP SHAPE RED IN COLOR. COMING DOWN AT 30 DEGREE ANGLE FROM THE SOUTHWEST. LOST SITE AFTER PASSING BEHIND TREES. OBJEC",
      "city": "lubbock",
      "shape": "teardrop",
      "date": "2007-11-28T00:00:00",
      "story": "SINGLE OVAL-TEARDROP SHAPE RED IN COLOR. COMING DOWN AT 30 DEGREE ANGLE FROM THE SOUTHWEST. LOST SITE AFTER PASSING BEHIND TREES. OBJECT APPEARED TO BE ABOUT HALF THE SIZE OF A DIME FROM WHERE I STOOD. MUST HAVE BEEN AT LEAST A MILE AWAY BASED ON THE TREES IN AREA IT WENT BEHIND WENT I LOST SITE. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59629.html",
      "state": "TX",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b79a8",
      "summary": "((HOAX??))  Elliptical craft sighted on serpentine path in Lubbock, Texas.",
      "city": "lubbock",
      "shape": "oval",
      "date": "2007-03-08T00:00:00",
      "story": "Elliptical craft sighted on serpentine path in Lubbock, Texas. Sitting watching TV when out the window my mother and I both saw this unidentified aircraft.  We ran outside to see the elliptical shape that had six light around its perimeter and three blinking red lights at the center.  It seemed to be pulsating and I heard a slight buzzing sound.  It was taking a serpentine path throught the night sky about 150 feet above the ground.  At first, it went over our house and curved along several blocks.  A few seconds later it was curving more slowly and disappeared behind a tree.  We attempted to resight the craft while running down the sidewalk.While running to the seen i noticed several car lights come on in the vacinity. ((NUFORC Note:  Student report.  Possible hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55428.html",
      "state": "TX",
      "duration": "0:56"
    },
    {
      "_id": "64d005f478aba2ec5a3b81fb",
      "summary": "March 1997 Lubbock, Texas a large triangular shaped, lighted object with instruments showing hovered for 15m+...shot away",
      "city": "lubbock",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "March 1997 Lubbock, Texas a large triangular shaped, lighted object with instruments showing hovered for 15m+...shot away My daughter and I were walking back from the neighbor's house. We live across the street from a golf course.  We were watching the sky for the Hale- Bopp Comet and we suddenly saw a triangular shaped object hovering over the entire area.  It was large, we could see lights all around flickering with a bright yellow green color.  We were in shock at first and then began to study the object.  It was low to the ground but not so low it would hit a wire.  I could see into its systems.  This craft had a lot of new mechanisms.  I could see things flashing inside that appeared to be advanced technology.  Having grown up overseas in the tropics with a father who was a flight simulator instructor, I have seen many things in the skies.  This resembled nothing I had ever seen before or ever again.   There was no noise whatsoever.  The craft maintained it's position for what seemed to me to be a couple of minutes.  It then shot out of the area in a blink of an eye. I have never seen anything move  so quickly.  I returned into the house to get my husband. He was worried about me because we had been gone for over 25 minutes. Time had escaped both of us. When the entire family returned outside it was gone, much to their dismay.  I called Reese AFB and asked if they were conducting anything unusual and they replied no flight out. I called the University of Texas Tech to inquire what it could have been. They blew me off with some cooky \"it was the comets tail\".  Well I have seen my share of comets and their tails and this was no tail.  I watched a special about Arizona Lights and it resembled quite closely to what I had seen. That is why I wrote to you. ((NUFORC Note:  Witness indicates that date of incident is approximate.  Given the similarity of this report to what was reported from Phoenix, and surrounding communities, on March 13, 1997, we have assigned that date here.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67435.html",
      "state": "TX",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c37",
      "summary": "I was comming out of the hospital after an emergency visit for my son. Upon leaving the hospital I noticed a ball of light in the sky.",
      "city": "lubbock",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "I was comming out of the hospital after an emergency visit for my son. Upon leaving the hospital I noticed a ball of light in the sky. You can see by the time I entered that it was about 7:35 pm or so just before day turns to night. I observed the object fixed in the sky. There was no sound or movement which is what struck me the most. It was a blue color that did shine very bright the starts had not yet appeared in the sky so I could dismiss that very quickly. I stared at the object for many moments till I finally had to leave to go fill a rx for my son.  I ended up at the pharmacy with the object in sight the whole time while at the pharmacy I allowed my wife to go fill it for me so I could watch this object. Moments later the light seemed to have released a 2nd light from the initial craft that was much smaller than the first. It seemed to be lowering it down from the primary craft. It was also glowing but more so a clear light. Then off in the distance I noticed a plane moving toward the object. Then glanced back to the ufo and both lights began to dim until they were no longer visible to the eye.  Local news would have us beleive this to be a weather baloon but it did not move at all or change its position and this does not explain the 2nd object I viewed either. there were many photos taken and many eye witnesses to this event including the ones I named along with my supervisor and co-workers. I have a photo I can text message to you if you like. THANK YOU FOR YOUR TIME",
      "link": "http://www.nuforc.org/webreports/072/S72956.html",
      "state": "TX",
      "duration": "8-10minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c36",
      "summary": "Large circular steady intense light and smaller less intense mobile companion light.",
      "city": "lubbock",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Large circular steady intense light and smaller less intense mobile companion light. From a location of appx +33 degrees 35' 9.14\" and -101 degrees 51' 49.89\" an object was seen at an angle of 25 to 30 degrees from horizon. If the center of a clock were our location, and 12 O'clock was dead north, the object was north northwest in appx the 11 O'clock direction. The object was quite large for a distant object, roughly 4mm of size in appearance and circular. Incredibly bright and white, it was more intense in brightness than the intensity of the streetlamps on the street below. It gave off no amount of light to the ground or area, the idea is simply to describe the relative brightness and intensity of the light. The object appeared to be at a great distance, and was no more than white light. There was no way to determine any sort of object detail with the amount of distance, but the size and brightness was utterly striking. It was holding dead still relative to a building's roofline below it (simply used to reference). It initially appeared to be an incredibly large and bright star to the observers, however it then began acting very strangely. While continuing its perfectly dead hold, a small light resembling the size and intensity of an aircraft warning light (viewed at great distance), left it. The smaller light exited perfectly from the center and bottom of the large light and had appx 1/2 the intensity of brightness and only a small dot of size, much smaller than the first object. This small light moved slowly and perfectly downward with zero flashing from either object and perfectly steady light and movement (no stuttering or jumping). It had the appearance of a falling flare on a parachute in descent speed, however over the 10 or so seconds of fall there was zero lateral movement. From the original object to its lowest point, the distance was likely 2 or 3 degrees between objects. The smaller light then stopped perfectly still and hung dead still. The total journey down lasted appx 10 - 15 seconds of travel time. The object then hung for 5 - 10 seconds dead still below the first one. At this point the upper object became very slowly less intense, until it reached appx 1/2 original brightness. This made the two objects the same intensity at this point. The small lower object then began to traverse upwards and to the right slightly at the same rate it had used on the descent but now at a relative diagonal. Eventually it passed the original large object on the right by appx 1/2 of a degree and continued until it reached appx 1/2 to 1 degree of distance upwards and to the right of the original object. Using the clock analogy again, with the larger object at the center of the clock, the smaller object was located at appx the 1 o'clock position. During this ascent the large original object began again another very gradual fade and size shift until it was smaller in appearance and eventually equal in appearance to the smaller second object. Eventually the original object became so dim and small that it was unable to be seen at all. The second object remained visible and dead steady for appx another 5 - 10 seconds before it too dimmed slowly until disappearance.  The entire encounter lasted likely 1 or 2 minutes total. The objects were both white light and circular / dot like. No defining shape or features could be seen. No flashing. No flickering. No trails or tails. No other movement in any directions or traversing of the sky in even the most minute amount unless otherwise described above. Zero chance of confusion with aircraft. Only possibilities could be orbital objects. Researched \"Iridium flare\" objects, wrong coloration, intensity, and timing entirely. Smaller secondary object is utterly confounding in movements. Cannot explain the utter lack of movement for larger object. Appeared almost perfectly like a star expect for extreme intensity and size.  Thank you",
      "link": "http://www.nuforc.org/webreports/072/S72890.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b0a",
      "summary": "Green spherical object with no trails of light behind it suggesting that it could have been a shooting star.",
      "city": "lubbock",
      "shape": "sphere",
      "date": "2008-10-31T00:00:00",
      "story": "Green spherical object with no trails of light behind it suggesting that it could have been a shooting star. The object that was sighted was neon green in color, spherical, and traveled in a straight line at an angle to the ground. The object was roughly the size of a BB when held at arms length relative to the surrounding environment. It behaved like a shooting star but the shape stayed too consistent and there were no trails of light behind it suggesting that it could be some kind of \"shooting star\". The light was sharp neon green in color and we were traveling northbound on Slide road toward the mall right before the intersection for loop 289 when we sighted the object. I could not have confused this with any other color and the green light was even glowing through street lights and I could clearly distinguish between the white street lamp and the green object.",
      "link": "http://www.nuforc.org/webreports/066/S66088.html",
      "state": "TX",
      "duration": "3.8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c55",
      "summary": "My wife and I were photographing area cotton gins for a local business calendar.  It was 12;40 in the afternoon of October 8th.   The g",
      "city": "lubbock",
      "shape": "cylinder",
      "date": "2008-10-31T00:00:00",
      "story": "My wife and I were photographing area cotton gins for a local business calendar.  It was 12;40 in the afternoon of October 8th.   The gin we photographed is located just east of Lubbock, Texas. There were no clouds in the sky when we took the picture.  We were using a Canon 5D camera with a 24-70 L lens.  We did not observe anything out of the ordinary until the images were downloaded to the computer.  The object in question was then observed.  Images were taken 10 seconds before and twenty seconds after the picture submitted was taken and no questionable objects were seen.  The  image has not been altered in any way.",
      "link": "http://www.nuforc.org/webreports/066/S66481.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba321",
      "summary": "UFO LUBBOCK TX",
      "city": "lubbock",
      "shape": "other",
      "date": "2009-08-27T00:00:00",
      "story": "UFO LUBBOCK TX It was about 10:40 tx time when i started to take out the trash i happen to see what i thought was a helicopter with its spotlight on in the distance i was facing north looking west so i walked back in to get more trash as i got done throwing it away as i was walking back i heard a light engine noise and out from behind my house over a feild it passes i was facing south it was heading east it was ppbly 200 to 300 ft in the air . it looked like it had an long flat ovel shape in the front and the back look like a triangle of space shuttle exhausts but had no fire or anything coming out...it had 2 big spot lights that were moving around on the side and two flashing white lights that would turn on and off one after the other one was on the front and the other on the right rear end \"kinda highter thand the craft its self\" the whole craft was black so i couldnt see anything better in detail..i also saw a shooting star after it passed it shot right obove it..and i did see two jets hiigh in the sky after it passed going in the same dirction .. .but i do know that it was to quite to be a jet or a helicoper it was ppbly twice the size of a jet twice as wide to it was ppbly as big as an acer. ((NUFORC Note:  We believe that both time and date were flawed above, and we have corrected both, reflecting what we believe are correct information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71808.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba987",
      "summary": "That was no falling  star!!",
      "city": "lubbock",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "That was no falling  star!! I was driving southwest on a calm clear night,coming on to an overpass.The overpass gave me good sight,because it was a high bridge,due to going over train tracks.While at the top ,I noticed a bright blue,I thought it was a falling star or peace of meteor.but the speed of it falling gave me a good look,as it looked to be slower than a usual falling star.                                                                        This blue glowing triangle ,the color of plasma sparkles coming off of it.As it caught my attention, I remember saying wow!!! But what it did next,really blew me away.From wow to what the hell!!!                                                                 This was not a falling star. It looked large .In the glow ,I could make out the outline of a triangle.But with the corners being rounded.                                       I thought I was  going to see it crash into the earth. But it did an L shape move .A perfect stop and lets go t! his way.But real fast,like the shape of a carpenters level .Direction toward the west.Disappeared into the darkness.Toward New Mexico.",
      "link": "http://www.nuforc.org/webreports/078/S78592.html",
      "state": "TX",
      "duration": "5 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3bb7f5",
      "summary": "See-thru UFO's?",
      "city": "lubbock",
      "shape": "other",
      "date": "2010-07-28T00:00:00",
      "story": "See-thru UFO's? My \"sighting\" if you want to call it that, happened 12 years ago.  I just recently found this website and thought I would post the experience.  Again I'm not sure what I saw but I know it wasn't anything that could be explained at the time. One night I decided to go outside and cool off on the patio.  I looked up and started to star gaze to pass the time when I noticed that the stars' pattern flickered in and out almost like someone was moving a huge rectangle of glass across the sky.  The size of the anomaly was pretty decent, about the size of a large passenger air plane.  The weird thing about this is that there was no sound distortion in the air, so I knew it wasn't a plane or big helicopter, and there was no wind so it wasn't as if there was some strange item blowing across the sky. I watched the glass-rectangle thing start to cross the horizon, it looked almost as if it paused, then moved again in stops and starts.  I decided then to go inside to grab something to assist in viewing it better like my binoculars or video camera, but when I came out the pattern was gone.  There were no lights, no oblong shapes, no sudden heat, and no repeat of what I saw.  Just thought I'd send this up in case anyone had ever seen something like this before. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76691.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbeae",
      "summary": "White Light over Lubbock Texas 23:00 Sept. 2, 20111",
      "city": "lubbock",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "White Light over Lubbock Texas 23:00 Sept. 2, 20111 My wife and I saw 1 white light appear in the Northwest and move to the Southwest at a seady speed no sound are other lights.  The light was white no other lights no sound.   After it passed over Lubbock it paushed for a split second and then went up in a corkscrew style and was gone in about 1 1/2 seconds.  This happened at about 9:30 P.M. Firday Septmenber 2, 2011. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83748.html",
      "state": "TX",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc27e",
      "summary": "2 Bright Lights in the West Texas",
      "city": "lubbock",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "2 Bright Lights in the West Texas Friday, September 23, 2011 I was on facebook when I saw someone posted something in Levelland, Texas on 'Facebook' referring for everyone to go outside and look into the northern sky. So I did, and I saw 2 bright objects. They looked circular in shape, and look like they were just sitting there in the sky, noy moving, not flying, not blinking nothing. Just one bright light and another bright light. At first they sort of resembled stars, but way brighter. So I looked around it was pretty bright out when these two lights were in the sky, and there were absolutely no stars in the sky. But I still thought maybe they were stars or planets maybe glowing in the sky from the sun. I eventually watched these two objects until the sun started to set. This is where I could determine if these two objects were. As I saw this I realized this was unique, a maybe once in a lifetime chance to see something like this. So I grab my cellphone for my camera because my actual came! ra is broken, and I took two pictures along with a video. As the sun set, the darkness started to take over and eventually the first light would just dim away, as would the second. That is how I knew they were not stars.",
      "link": "http://www.nuforc.org/webreports/084/S84302.html",
      "state": "TX",
      "duration": "2 hours roughly"
    },
    {
      "_id": "64d005f478aba2ec5a3bc77f",
      "summary": "Circle shape turned triangle (T) shape produced bright color in night sky then disappeared.",
      "city": "lubbock",
      "shape": "circle",
      "date": "2012-01-24T00:00:00",
      "story": "Circle shape turned triangle (T) shape produced bright color in night sky then disappeared. I walked outside on my front porch to let my 3 dogs out, my sister was with me and we had thought  it was the north star until we looked up further in the sky and saw the actual north star.  I continued to watch while my sister went for the brand new sony dcr-sx45 handycam.  Then I started to film and use the 70x zoom, It was then that we realized what we were witnessing a ufo, our first sighting. It was a circle almost plate like and continued to more almost like spinning in place.  To the naked eye you could not see the movement but it continued to spin and dark back and forth, getting closer and further from us with-in the blink of an eye.  Then it started to change color producing a dark but bright purple light, almost like a small flash.  Then it changed into what at first seemed like a cross and then a triangle, at the end of the recording u can see it almost like wings flapping and within a blink it disappeared.  About 15 to 25 minutes around 7:15 pm January 22, 2012",
      "link": "http://www.nuforc.org/webreports/086/S86777.html",
      "state": "TX",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9a9",
      "summary": "The enormous craft over lubbock texas.",
      "city": "lubbock",
      "shape": "oval",
      "date": "2011-07-17T00:00:00",
      "story": "the enourmous craft over lubbock texas me and my brother were driving around one night and we no noticed two lights floating above the city in perfect synchronization, never moving closer together or farther apart from one another.  upon closer inspection we could both clearly see a misty oval shaped outline connecting the two lights.   this was puzzling because we could still see the stars in the middle of the craft which i myself have come to interpret as some sort of cloaking mechanism.  the most amazing features were the smoothness of its flight and its sheer size, it seemed to glide effortlessly with no need for high velocity,  it never left a single tracer as far as we could see,  must have been using a truly uncomprehendable propulsion system.  regardless of how high up the craft was exactly it was apparent that it was enormous where as a plane looks like a speck in the sky this thing was impressive in size it must have been half a mile long.  we didn't report it to the local authorities because if! they hadn't disregarded it as a hoax they would have had a tough time finding it,   i feel truly lucky to have witnessed such a thing and i truly believe that one day all the people who have been laughed at or made out to be pranksters and liars will be the ones laughing in the end.   the universe is indescribably huge and still expanding, i find it an ignorant thought process to think we are the only ones living in this space time continuum.   whether or not this craft was extra terrestrial or not cant be known, my assumptions lead me to believe it was.  thank you for reading. ((NUFORC Note:  We spoke via telephone with the source of this report, and he assured us that is was intended as a serious-minded report, despite his lack of use of capital letters in the text of his statement.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82449.html",
      "state": "TX",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bdaa2",
      "summary": "Green Light in the sky over Lubbock, TX.",
      "city": "lubbock",
      "shape": "other",
      "date": "2012-08-19T00:00:00",
      "story": "Green Light in the sky over Lubbock, TX. I went outside to smoke in my backyard.  I looked at the moon and nearby was a BRIGHT green star.  Then it dissapeared for about 5 seconds.  And suddenly re-appeared in a different spot. The light then moved from left to right.. side to side randomly and faster than you would expect of a plane.  I called my parents out of bed and they came out and watched it for the next 5-10 minutes as it moved about the sky blinking on and off.  The blinking was completely random... sometimes staying on for 20 seconds.. sometimes just 2 seconds.  It eventually went behind some trees and we could not see it anymore.",
      "link": "http://www.nuforc.org/webreports/091/S91527.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb14",
      "summary": "Fireballs seen in the sky",
      "city": "lubbock",
      "shape": "fireball",
      "date": "2012-02-10T00:00:00",
      "story": "fire balls seen in the sky Four bright lights in the north west section of the sky.  They were static for appx one min then one headed straight up into the sky until we lost sight of it.  The other three headed west at a high rate of speed.  No sounds or shapes were seen or heard.",
      "link": "http://www.nuforc.org/webreports/087/S87048.html",
      "state": "TX",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3beb13",
      "summary": "Hovering glowing objects, strategically line up and travel west.",
      "city": "lubbock",
      "shape": "sphere",
      "date": "2012-02-10T00:00:00",
      "story": "hovering glowing objects, strategically line up and travel west. About 21:15 my family and I came outside to leave to our respective homes and my brother started yelling to look up in the sky just above the house at 4 large glowing round shapes in the sky.   We all looked and saw theses objects.  They were as high up as a small plane or helicopter would fly but the lights were much much larger in comparison to actual plane or helicopter lights.  They were just hanging out in a V line for about a minute, then the point positioned object took off straight up in the sky, the remaing objects lined up and traveled from east to west at a fast speed then disappeared.   We had 3 iphones out video taping andtaking pictures as best we could.  We also had a friend that lives about 30 miles south call and tell us he saw a hovering object west of his home.  Then disappear.",
      "link": "http://www.nuforc.org/webreports/087/S87051.html",
      "state": "TX",
      "duration": "5-10 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc61",
      "summary": "Yellow lights on a triangle loud noises.",
      "city": "lubbock",
      "shape": "triangle",
      "date": "2013-06-02T00:00:00",
      "story": "Yellow lights on a triangle loud noises. There where 8 yellow lights on a trangle in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97961.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc60",
      "summary": "8 yellow lights",
      "city": "lubbock",
      "shape": "triangle",
      "date": "2013-06-02T00:00:00",
      "story": "8 yellow lights ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97811.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c029c",
      "summary": "Sighting over Lubbock",
      "city": "lubbock",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Sighting over Lubbock I was on my balcony smoking a cigarette when I was looking up at the sky.  I saw one white light being followed closely behind by what to me looked like an aircraft with a blinking red light.  Further behind the two ufos was another white light moving in the same direction as the other two.  They were all three headed from NE to SW.   As the objects moved a little further away the two white lights slowly faded out and dissappeared while the red flashing light remained on and continued on the same path.  The lights didn't fade because of distance but just faded out.  This is the third time I have seen this same occurrence.",
      "link": "http://www.nuforc.org/webreports/097/S97647.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c08",
      "summary": "Star that moves, fades, changes into multiple lights.",
      "city": "lubbock",
      "shape": "light",
      "date": "2014-02-07T00:00:00",
      "story": "star that moves, fades, changes into multiple lights I have seen this many times.  First time, I thought it was a star, then realized it was a little too low, too bright, and was moving, floating alongside my car.  When I stopped, it came to a stop in front of me.  When I made a right turn, and stopped and looked in front of me, there it was again.  I would return to the spot I saw it the first time, and it was gone; then return to the spot it was the second time and it was gone.  Sometimes I saw it vaporize like a cigarette ash, an orange/brown fading light, in an arc that fades.  Sometimes, I see in the place it was before it disappeared, and not moving, appx 4 lights, 2 red and 2 white.  So...it looks like a star that moves ... then changes to appear like an airplane that doesn't move.  Once, it flew directly over me when I was standing outdoors, no sound.  This started appx june 2013.  The star was in the same place nightly, usually appeared before dusk, and slowly sunk below the horizon around 10 pm.  I noticed it t! he first time when it first 'followed' my car and stopped in front of me when I stopped in june 2013.  It was in the north west sky, same spot, until recently.  I noticed around end of december it wasnt there anymore.  Then, a few days ago, as I was driving, there it was in a different direction.  I turned right into a parking lot and got out, looked up, and saw, in front of me, again, as if it was changing direction to stay in front of me, what was 2 red and 2 white lights, hovering, not moving, as if it had morphed into an airplane camoflage, then faded away.  It hasn't been in the NW sky since end of december 2013. This sounds like same thing Ive read in several other posts ... has there been an explanation posted anywhere? ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106906.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1297",
      "summary": "Strange lights sighted and then airplane with no lights sighted.",
      "city": "lubbock",
      "shape": "unknown",
      "date": "2013-12-02T00:00:00",
      "story": "Strange lights sighted and then airplane with no lights sighted. I spotted this with my naked eyes while looking for ison.  It was east south east of the city.  At first I chalked it off as an aircraft but I got my binoculars and upon further examination I could see many colors.  Sort of like a cops lights on but there are many more colors. I set my binocs on the side of my truck to steady them and could still see many colors.  Blue, red, green, violet, amber and possibly yellow all rotating around a central point. I'm watching it now and it is not moving.  Other than the lights.   It has maintained its position for a few hours now. Also their is a blacked out airplane flying circles overhead. The local airport is across town maybe 20 miles. I thought it was a helicopter but it is an airplane.",
      "link": "http://www.nuforc.org/webreports/104/S104802.html",
      "state": "TX",
      "duration": "Ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c27a0",
      "summary": "Bright light over Lubbock TX  ((NUFORC Note:  Reported by local news to be a balloon.  PD))",
      "city": "lubbock",
      "shape": "light",
      "date": "2014-10-03T00:00:00",
      "story": "Bright light over Lubbock, TX Large bright object to the west of Lubbock, TX.   Very bright light that didn't move but faded in brightness.  The sun was almost down, so it wasn't a reflection.  I got pictures, but they are not great.   Called to get my retired school teacher mother on the line, and she saw it from 5 miles south of my location.  It didn't twinkle or have any other colored lights.  Object slowly faded on a perfectly clear night. ((NUFORC Note:  Reported by local news to be a balloon.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113938.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c27e0",
      "summary": "A craft seen to the northwest of lubbock.  ((NUFORC Note:  Reported by local news to be a balloon.  PD))",
      "city": "lubbock",
      "shape": "unknown",
      "date": "2014-10-03T00:00:00",
      "story": "A craft seen to the northwest of lubbock To the north west.  A single unmoving spot.  Larger than a star and seams to be rotating.  The color is changing steadily. ((NUFORC Note:  Witness corrects time to 2026 hrs.  Also, he comments that the local news reported the object to be a helium-filled balloon, possibly a weather balloon.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113939.html",
      "state": "TX",
      "duration": "Still accuring"
    },
    {
      "_id": "64d005f478aba2ec5a3c28c2",
      "summary": "White shaped chevron turning in the sky.",
      "city": "lubbock",
      "shape": "chevron",
      "date": "2014-10-10T00:00:00",
      "story": "White shaped chevron turning in the sky. On October 5th, 2014, three people sighted a white looking chevron in the sky above Lubbock , Texas.....It seemed to be about 40,000 miles up, at least.  It appeared to move back and forth in the sky and had a bright circular light in the center of the chevron object. It was witnessed for 15-20 minutes in the sky,,turning back and forth..We had never seen anything like it before in the sky. I am a 58 year old, retired heavy equipment operator.  My wife is a 48 year old housewife and mother.  Our son is 10 years old and attends school here in Lubbock. Thank you very much, Sincerely, Mr. Perrin",
      "link": "http://www.nuforc.org/webreports/114/S114249.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3cd1",
      "summary": "Looking north in Lubbock sky and saw green light fall from sky...",
      "city": "lubbock",
      "shape": "",
      "date": "2015-07-23T00:00:00",
      "story": "Looking north in Lubbock sky and saw green light fall from sky... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120505.html",
      "state": "",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c49e4",
      "summary": "Black triangle with three solid white lights and a forth blinking light in the center of the other three solid lights.",
      "city": "lubbock",
      "shape": "triangle",
      "date": "2015-09-11T00:00:00",
      "story": "Black triangle with three solid white lights and a forth blinking light in the center of the other three solid lights. I was working at a grocery store as a grocery sacker at the time of the sighting.  The grocery store that I worked at had a parking lot in the front of the store and an secondary parking lot on the side of the building.   As I was taking a customer's groceries too their car in the secondary parking lot, I looked up and saw three solid lights in triangle formation with a fourth blinking light in the center of the three solid lights.  It seemed to be a solid craft because it blocked out the stars behind it.   It moved too slow to be an airplane or a helicopter and it was completely silent.  It seemed to move off to the east from my location very slowly.   As I would carry out more groceries, I would look to the east and see it moving slowly out of sight.   After about thirty minutes, it was out of sight.  I told no one what I saw, save one of my fellow sacker, who immediately began mocking (playfully) the whole event. ((NUFORC Note:  Source of report indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121644.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c49e6",
      "summary": "One large orange/amber fuzzy blob with hundreds of small fuzzy orange/amber colored spheres.",
      "city": "lubbock",
      "shape": "fireball",
      "date": "2015-09-11T00:00:00",
      "story": "One large orange/amber fuzzy blob with hundreds of small fuzzy orange/amber colored spheres. On the night of July 26, 2000, I was at a Bible study with 8 other friends.  We had finished the discussion and questions portion of the study and were outside in the backyard of the house we were at.  We were engaged in small talk when one of the girls asked, \"What is that?\"   We all looked up at what she was looking at.  It seemed to be a large white blob in the sky that was moving fast against the background of stars.  It seemed to have color separation like a rainbow on its edges.  The effect seemed to wear off and the blob changed to an orange/amber color and it slowed down to a crawl.  When it did this, we were able to see smaller orange/amber colored glowing spheres fallowing it.   There were hundreds of the small fuzzy spheres that followed the large fuzzy glowing blob.  As we were looking at this event we saw a bright blue flash of light that seemed to light up the eastern sky.   We then turned our attention back to the objects in the sky.  They just moved slowly to the western sky from the eastern sky.  We could see, as the moved father away, that they were very high in altitude.   We began talking to each other about what they might be.  And of course this was a group of Bible belt Christians, so the discussion about what we saw lead of into them being signs and wonders from heaven(I never believed that).   A few minutes later we saw one of the fuzzy spheres flying to the south of where we were at the altitude of an airplane.  We watched it move off out of sight.   When I left the house where the Bible study took place I drove my car down the street to the east were we saw the blue flash.  I saw a local electrical company truck in the alley way working on a transformer.  So that might be where the bright blue flash came from.   The next day the girl who first saw the event spoke to her father about it over the phone about what we saw.  Her father worked as an executive of some kind at NASA.  He immediately told her to stop talking to him about the matter, and to never talk to him about it ever aga! in.  He then hung up on her.   She said that this scared her because not only did he never talk to her or their family members like that, but also he also taught them to never do such things.  So this, according to her, was completely out of character for him to do.   We never spoke of the event after that day.  I always felt uneasy about what her father did giving his position at NASA.  I thought someone like him would be excited about such a thing.",
      "link": "http://www.nuforc.org/webreports/121/S121645.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5926",
      "summary": "I was aiming my mini-camcorder, which I had purchased just days earlier, at the moon.  ((NUFORC Note:  Object in lens of camera?  PD))",
      "city": "lubbock",
      "shape": "rectangle",
      "date": "2016-05-26T00:00:00",
      "story": "On Jan 24, 2013, @ 10:17 PM, I was aiming my mini camcorder, which I had purchased just days earlier, at the moon.  When I focused on the moon, at about 20X zoom, there was an object hovering in the lower left quadrant of the moon.  The length was about 1/8 to 1/6 of the moon diameter. I first thought it was a speck of dust in or on the lens.  Later inspection did not confirm that. The distance from my camcorder to the object was unknown.  If it  was close to the moon, the size must have been gigantic. If it was close to Earth, there would likely have been a greater relative movement to the moon, but not necessarily true. My video clip is 55 sec long.  Check out my two screen shots (still pics) from the clip. ((NUFORC Note:  We will request a copy of the video.  The object appears to us to be some kind of foreign object in the lens assembly, but that is pure conjecture, at this stage.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127515.html",
      "state": "TX",
      "duration": "55 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c1d",
      "summary": "Wired objects in West Texas.",
      "city": "lubbock",
      "shape": "rectangle",
      "date": "2016-04-01T00:00:00",
      "story": "wired objects in West Texas On this day, at first one object caught my eye.  That shined and hovered in place for about a 5 mins.  Then it moves the opposite direction and fade away and a few minutes latter two show in formation and hovered also above this another object much higher was a very large air craft which it held it position.  and accented ((sic.  Ascended??)) higher till no longer to see but the two turned to three.  Then headed south for about two miles then west for 20 mins. and headed up and disappeared.  I know that these were not airliners or bombers.  cause the shape and also other aircrafts flying for east to west.. and  his objects were heading in a different direction. very bizarre.",
      "link": "http://www.nuforc.org/webreports/126/S126595.html",
      "state": "TX",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c72e6",
      "summary": "Strange flashing lights.  ((NUFORC Note:  Possible sighting of a \"twinkling\" star??  PD))",
      "city": "lubbock",
      "shape": "light",
      "date": "2017-06-02T00:00:00",
      "story": "Strange flashing lights. looking north west of Lubbock see flashing green white and red lights every night after sunset cannot identify what craft is in same location every night. ((NUFORC Note:  Possible sighting of a \"twinkling\" star??  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134281.html",
      "state": "TX",
      "duration": "constant"
    },
    {
      "_id": "64d005f478aba2ec5a3c7dc0",
      "summary": "Triangle object with blinking red, green, and white lights seen in telescope.",
      "city": "lubbock",
      "shape": "triangle",
      "date": "2018-06-07T00:00:00",
      "story": "Triangle object with blinking red, green, and white lights seen in telescope. At 12:25AM I was using my small spotting scope to look at objects such as Saturn and Jupiter in the night sky.  I first saw the object east of Saturn at the time.  Object could just be seen as three blinking/strobing lights that were red, green, and white.   At first glance I thought it was a airplane with strobing lights.  I soon became aware this was not the case. As an amateur astronomer I had clear reference points to track the object and knowledge of satellite activity and meteors.  The speed in which the object was traveling was comparable to the speed of the International Space Station.  Faster than any plane I have ever seen.  It also did not travel in a straight line as most aircraft would, instead it traveled closely to the ecliptic line in the sky that night first passing Saturn and then passing Jupiter at relatively proportional distance as it did Saturn.  Object was first spotted in the SE and “set” in the west.  Its lights were rapid blinking at ten times the rate as most aircraft strobe lights do.  One would think it would be a satellite however this was not the case.   When I first spotted the object and made the deduction that it was not an aircraft I trained my spotting scope (one powerful enough to see the lines of Jupiter) on the object.  At minimal magnification it was clear the object was triangular (sketch of object will be included in the report).  I followed the object for about thirty seconds zooming in magnification to get a clear representation of what the craft’s outline looked like.  As I stated it was clearly triangular with lights on the edges of the triangle.  If this were to be a satellite with my scopes magnification (one I have tested on the International Space Station before) if the object was at the altitude of the space station would be easily twenty times the size of it.  I lost the object from my scope around the time it was passing Jupiter and used the naked eye for the rest of the viewing.  I cannot explain what this object was, but am 90% sure it was not a satellite or aircraft.",
      "link": "http://www.nuforc.org/webreports/141/S141735.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9369",
      "summary": "Object with lights seen flying low above area experiencing total power loss.",
      "city": "lubbock",
      "shape": "disk",
      "date": "2019-12-01T00:00:00",
      "story": "Object with lights seen flying low above area experiencing total power loss. At 7:49 I received a text from my friend saying something about experiencing about a power outage at a volunteer health clinic he was working at. When I received this text I was driving east on 50th Street toward the direction of this clinic, which was about a mile away. I notice a bright white light directly above the location of where the clinic would be. Upon first glance, being about a mile away, it appeared to be a star but the light began to move erratically in a diagonal path. But the movement was not linear. After some movement it appeared to just hover in one location. As I approached the area more closely, the object might have been mistaken for a drone but it was clear that it was larger and no more than 75  feet in the air. The object is now Northeast of my position so I make a left into the neighborhood to my left. I was able to distinguish multiple lights on the object before losing sight of it as it moved diagonally Northeast. As I navigate th! rough this neighborhood I notice that entire streets are missing power. In a hasty attempt to regain sight of the object I cut through a street with clear visibility but the object has disappeared. As I make a U turn to exit the neighborhood, the power abruptly returns. I couldn’t capture more than a shaky 2 second video of the object that I took while driving which you can barely make out the object if you play in slow motion. You can see that there are two lights visible as it moves.",
      "link": "http://www.nuforc.org/webreports/149/S149969.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c975b",
      "summary": "Three objects orange/pink .traveling due south . Sky background was constellation  formation bright star orion.zig zagged then lined up",
      "city": "lubbock",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "Three objects orange/pink .traveling due south . Sky background was constellation  formation bright star orion.zig zagged then lined up and vanished in the sky headed due south at 1: 30 am  nov 24th big dipper faceing down",
      "link": "http://www.nuforc.org/webreports/150/S150977.html",
      "state": "TX",
      "duration": "Seconds"
    }
  ]
}