{
  "city": "madison",
  "fetch_timestamp": "2025-07-12T14:35:56.507532",
  "record_count": 152,
  "pages_fetched": 7,
  "api_calls": 8,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4845",
      "summary": " I looked up at the moon and just to the right of it there were 3 lights in line.  ((anonymous report))",
      "city": "madison",
      "shape": "light",
      "date": "2019-07-25T00:00:00",
      "story": "I was just cleaning up and coming inside from having a fire.  And I looked up at the moon and just to the right of it there were 3 lights in a straight line moving from west to east crossing infront of my view of the moon.  These lights did not look like any aircraft I've seen, it did not have any blinking lights and it was moving considerably faster then the airplanes I typically see overhead.  These lights were also really bright and from what I was seeing the lights had almost a bluish green tint to them.  The whole thing lasted only a few minutes and they were out of view.  Certainly peaked my interest!",
      "link": "http://www.nuforc.org/webreports/147/S147581.html",
      "state": "OH",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b48a3",
      "summary": "4 red lights in a tight diamond shape, later to split into 2 sets of 4 Red lights in a diamond shape.",
      "city": "madison",
      "shape": "diamond",
      "date": "2019-07-25T00:00:00",
      "story": "4 red lights in a tight diamond shape, later to split into 2 sets of 4 Red lights in a diamond shape. I work as a food delivery driver in Madison, Wisconsin, and on July 13th, at approximately 21:35 hours  I had a delivery to make and I happened to glance up into the night sky to the south.  I’m used to seeing various aircraft, both Civilian, military and commercial come and go through Truax field.  But this didn’t have the typical aircraft light set up with the Red and green navigation lights, nor was there typical landing lights.  Plus growing up near Davis Monthan AFB, I knew my aircraft well. This was 4 red lights in a vertical diamond formation, in an up and down diamond, not a horizontal layout.  Rather close to each other with no real space in between the lights as an aircraft would have between the wings.  The object was hovering in the air, not moving at all. I was at first thinking it was possibly a drone since it was just hovering.  It also made no noise whatsoever, unlike a typical light aircraft or commercial aircraft.  And it certainly wasn’t a F-16 thats stationed here.  Compared to the near full moon, it was maybe a quarter the size of the moon.  I continued watching, pulling my car over to watch it more.  Two bicyclists peddling past also looked up, but continued peddling north. At that point the object was moving north,  and I lost sight of it through some tall trees blocking my view.  I moved further south  and looked back to see the object heading north.  Then stop again.  And then  it split into two objects, both of 4 red lights.  And quickly both sets of lights left the area.  One heading north, the other west.  It took just a few seconds to lose sight of both.  I had viewed the object/objects at most a full 2 minutes.",
      "link": "http://www.nuforc.org/webreports/147/S147547.html",
      "state": "WI",
      "duration": "2 minutes tops"
    },
    {
      "_id": "64d005f478aba2ec5a3b4913",
      "summary": "Saw 2 bright white lights flashing (left, then right, then left, then right) in distance, much higher than the tree line, but in a stat",
      "city": "madison",
      "shape": "light",
      "date": "2019-06-07T00:00:00",
      "story": "Saw 2 bright white lights flashing (left, then right, then left, then right) in distance, much higher than the tree line, but in a stationary location.  It suddenly disappeared.",
      "link": "http://www.nuforc.org/webreports/146/S146373.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4af5",
      "summary": "Rectangular very bright and big green object seen over Madison, Alabama",
      "city": "madison",
      "shape": "rectangle",
      "date": "2019-06-27T00:00:00",
      "story": "Rectangular very bright and big green object seen over Madison, Alabama On the night of June 15, 2019, I went to my backyard and walk to the middle and something like a very far, distant noise made me to turn my head to the sky, completely over my head. As I was looking, I realize it was a very bright and intense green light coming from an big object or whatever it was.  I looked at intervals during 1 or 2 minutes, and then suddenly, I understood that something was not right, because it was big, kind of square and it didn’t move. So I continued looking, went inside, came back, and it was still there, just over me.  I went inside again and thought that I should take a picture, but I didn’t want to leave it alone and loose it maybe.  So I came back again to the backyard and it was still there, not moving.  I could feel some kind of energy. This time I went inside and grabbed my iPhone, and I focused over my head looking directly to the “object”.  In the instant I took the picture the “big object” moved in a fraction of second to the right and just disappeared. I am a retired Biologist and Full Professor of Cellular biology graduated in Venezuela.  I lived 13 years in Atlanta, GA and 3 years in Alabama.",
      "link": "http://www.nuforc.org/webreports/146/S146969.html",
      "state": "AL",
      "duration": "~6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b09",
      "summary": "Straight line of lights moving E over L Erie, middle light would be dim then be really bright. ((Satellites.  PD)) ((anonymous source))",
      "city": "madison",
      "shape": "other",
      "date": "2019-06-07T00:00:00",
      "story": "straight line of lights moving east over lake erie, middle light would be dim then be really bright. line of lights moving west to east less than a quarter mile from lake erie. in under one minute there was about 20 or less lights in a row moving in a straight line heading towards lake erie. The middle light would get really dim then get bright and kept doing that. ((NUFORC Note:  Space Link satellites.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146296.html",
      "state": "OH",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4bc6",
      "summary": "While standing outside noticed a white light similar to plane going across sky and then it stopped and looked like a star. Went in to t",
      "city": "madison",
      "shape": "light",
      "date": "2019-06-27T00:00:00",
      "story": "While standing outside noticed a white light similar to plane going across sky and then it stopped and looked like a star.   Went in to tell my wife and when I went out a minute later it was gone.",
      "link": "http://www.nuforc.org/webreports/146/S146984.html",
      "state": "ME",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fb3",
      "summary": "Bright green fireball in sky.",
      "city": "madison",
      "shape": "fireball",
      "date": "2019-03-29T00:00:00",
      "story": "Bright green fireball in sky. Green fireball brightly lit in sky.  It was so bright, we thought it was fireworks, but it was a Tuesday night and not holiday.",
      "link": "http://www.nuforc.org/webreports/145/S145343.html",
      "state": "MS",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5804",
      "summary": "Green light in the sky around Madison, AL area Nov. 28th 2006",
      "city": "madison",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "Green light in the sky around Madison, AL area Nov. 28th 2006 On November 28th, 2007 around the time of 6:00pm central (not sure of the approximant time)  My family (Dad, step-Mom, and I) saw a green light shooting through the sky.  We were driving NE towards Huntsville, AL.  It was going the same direction to the left of us along interstate 565.   There were really low clouds that night and the object came down from the clouds, flew about 5 seconds, and went back up.  I’ve never seen anything fly this fast in my life.  I couldn’t get a really good look at the shape, but it was glowing green.  It did not have a green streak behind it either.   It was flying too low to be a meteor or “space junk” as it was reported here in the Decatur Daily.",
      "link": "http://www.nuforc.org/webreports/060/S60358.html",
      "state": "AL",
      "duration": "about 5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b97",
      "summary": "star-like shape in sky moved in triangular patterns for about 15 minutes before stopping-2 witnesses",
      "city": "madison",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "star-like shape in sky moved in triangular patterns for about 15 minutes before stopping-2 witnesses I hesitated to even report this because I didn't want anyone to think I was crazy, but I saw the event with my housemate, so I have someone to corroborate.   It's not much to report as far as a craft goes, because it was so far away it looked like a star; however , it's movements made it a craft of some kind.  It moved in a triangular pattern for quite awhile.   I mostly wanted to know if there were other reports from the same time.   Please contact me if so.  I tried to film it on my digital camera, but because it was night, I'm not sure how well it came out yet.   It's location was approximately 40 degrees up into the northern sky",
      "link": "http://www.nuforc.org/webreports/059/S59184.html",
      "state": "VA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5bf0",
      "summary": "Orange lights appearing one at a time in a circular motion at a stand still.",
      "city": "madison",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "Orange lights appearing one at a time in a circular motion at a stand still. At first it was just two orange lights in the distance then as we were driving closer to our home it appeared agian but this time closer and low.  The lights lite one at a time in a circular motion, the object was at a stand still, then it went away. It was nothing i had seen before but my father has seen it three times now within the last 6 years and he has experience as a pilot and there were no strobe lights or the ablity for a craft to move at that type of distance in such short time without hearing it.  It was the most shocking thing I had ever seen or been through, personally I cried I was so scared, I just got this really bad feeling in the pit of my stomach.It was just west of Madison Kansas.",
      "link": "http://www.nuforc.org/webreports/059/S59170.html",
      "state": "KS",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d40",
      "summary": "Madison Sighting  8/25/07",
      "city": "madison",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "Madison Sighting  8/25/07 I would like to report to NUFORC a sighting which occurred last night, 25 August 2007 at about 2248 Central time just north of Madison,WI.  At that time,my fiancee (who was driving) and I had just passed Madison on our way home to the Twin Cities from Chicago on I-94.  I noticed a bright object moving from north of us to the south, which I initially took to be the ISS (space station).  The first glimpse put this object at the 1100 position (assuming the hood of our car is the 1200 position, and it was to the west of us about 35 degrees off the horizon.  As I am a former member of the military (16 Tango - ADA) I was extensively trained in visual identification of both man made and naturally occuring atmospheric phenomena.  I quickly deduced that this was in fact not the ISS due to its increasingly fast speed.  This object did not have any visible navigational lighting, nor strobes.  I watched the object traverse the entire expanse of sky from the 1100 position to our front, to about the 630 position behind us all in about 10 seconds before it disappeared into nothing. Within a few minutes I contacted the Columbia County Sheriff to describe the incident, and left my name and number. I am very interested in knowing what this object was, and if anyone else sighted this very fast thing near Madison last night.",
      "link": "http://www.nuforc.org/webreports/058/S58399.html",
      "state": "WI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b60ba",
      "summary": "Disc with 4 blue lights.",
      "city": "madison",
      "shape": "disk",
      "date": "2008-03-04T00:00:00",
      "story": "Disc with 4 blue lights. Travelling on Old Madison Pike Road heading East at the intersection of Hughes Road I witnessed a disc with neon/flourescent blue lighting travel slowly across my field of vision, and then come to a complete stop.  I stopped the car and continued to view the object which would move slowly and then stop and then move again in a different direction.  I began to take pictures with my camera phone, when it came directly above me.  I leaned out of the car and listened and heard what i thought might be a slight whirring noise.  As the object moved to directly above me, I noticed that there were 4 lights on the bottom, and very intense. They were in the shape of a square, as if they were on the 4 points of a square.  That was the array of the lighting, although the lights appeared to be circular or cone shaped and were very bright.  I observed for a while, and took a few pictures with my phone although you can only see lights in the pictures because the camera isn't very good and it was dark.  I figured it was some sort of surveillance drone. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60334.html",
      "state": "AL",
      "duration": "5 mintues"
    },
    {
      "_id": "64d005f478aba2ec5a3b60b9",
      "summary": "Small , violet-blue, quiet u.f.o. moves and hovers around grocery store parking lot in Madison, Alabama.",
      "city": "madison",
      "shape": "circle",
      "date": "2008-03-04T00:00:00",
      "story": "Small , violet-blue, quiet u.f.o. moves and hovers around grocery store parking lot in Madison, Alabama. I noticed a small violet-blue light slowly moving above the parking lot of Kroger's grocery where I was standing. It quietly and playfully moved around the perimeter of the parking lot and store with intervals of hovering. All of this was at very low altitude although it did change that as well. At onr point, it was not that much higher than the store. It looked round shaped to me with the violet-blue light outlining the roundness with 4 smaller circles on the the bottom of it. When it moved around, it tilted some making it look more like a slender disk. I am not sure how long this had been going on before I arrived but people were standing in the parking lot looking up in amazement. One guy was filming it. It was around nine at night when I saw it and, just before 10 minutes had gone by, it all of the sudden tilted and took a sharp abrupt dive behind the store which would be a field. A few of us, myself included, looked behind the store and it was just dark. There was never at anytime a sound.",
      "link": "http://www.nuforc.org/webreports/060/S60325.html",
      "state": "AL",
      "duration": "9 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b63e6",
      "summary": "Roundish light traveling in a horizontal loop",
      "city": "madison",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Roundish light traveling in a horizontal loop Just saw a UFO.. 9:55pm Monday 5/19/08. I'm south of Lake Monona and it was in the north-east sky. It's cloudy tonite so the light was kinda blurred. It was a roundish light that was going in a horizontal circle/loop. The speed was fairly fast but wasn't consistent.. the loop it did was also not a perfect circle. The light was not being beamed from the ground but could see a light beam at the same level as the object. Not sure how high up it was... about the same level as a plane when it flies this way coming into the airport.",
      "link": "http://www.nuforc.org/webreports/063/S63296.html",
      "state": "WI",
      "duration": "45 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3b65e6",
      "summary": "A formation of four to five lights that for at least an hour would circle around each other, then dash off in different directions.",
      "city": "madison",
      "shape": "formation",
      "date": "2006-10-30T00:00:00",
      "story": "A formation of four to five lights that for at least an hour would circle around each other, then dash off in different directions. We saw four to five lights that would circle around each other then dart off in different directions.  Nothing man made can move that fast in the sky!  They would move up, down, circle around, move left or right and then dash out of sight.  At times they would all disappear only to reappear slowly one at a time, but always appear in the same general area.  From my terrace on a hill, I could see them dance about very clearly.  My husband and sister also witnessed this. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52205.html",
      "state": "AL",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b6854",
      "summary": "This is my second  report , I'm still watching this bright star like ufo.",
      "city": "madison",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "This is my second  report , I'm still watching this bright star like ufo. This is my second report ,I\"m still watching this bright star like ufo, slowly come down from high in the sky to below tree level, and slowly move toward palmer Rd. There is also another ufo that stays high in the sky until about 10:45pm. Then in makes its slow desent down. I have also seen orbs flying right above the trees, with blinking lights. I know that military planes have been checking out this bright light. I\"m sure they had to be taking pictures of this ufo. Please let me know anything you find out about this sighting. I sent my last report on the 14th or 15th of April.",
      "link": "http://www.nuforc.org/webreports/056/S56439.html",
      "state": "AL",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e8e",
      "summary": "Four orange objects in formation followed by another.",
      "city": "madison",
      "shape": "formation",
      "date": "2007-08-07T00:00:00",
      "story": "Four orange objects in formation followed by another. I went out at night and looked up, and I saw four uniformly lit orangish lights in formation accelerating westwards, and then another slightly larger light to the north following it.  The objects were appoximately egg-shaped, although it was hard to tell because of their speed, and their brightness was approximately one-third of the moon.  They were about a third of the size of the moon, and the four were in a paralellogram formation, with the long ends facing east to west.  They resembled fighter planes flying in formation because of the relative movement to each other when they traveled, but the accelerated so quickly that no plane could ever go this fast.  The formation was about two times as long as the moon, and about one moon or less wide.  The objects were silent and appeared to be at a very high altitude, yet they accelerated very quickly and uniformly.  As soon as I looked up they began accelerating and in about 2 seconds they went from directly overhead to close to the horizon and out of sight.  A second later the other object to the north followed with the same acceleration and speed.  This other object seemed to take off from kind of a small curve, and then it followed a straight line.  The sky was completely clear so I know these couldn't have been reflections.  I know what meteors look like and I am certain these were not them.  Also, I have seen some of the fastest planes in the world flying overhead at low altitudes, and they were nowhere near as fast as the objects I saw on this night.  Furthermore, I saw almost exactly the same thing in the same city approximately eight or nine years ago and remember it vividly.  I figured since I saw the same thing again I would report it.",
      "link": "http://www.nuforc.org/webreports/057/S57716.html",
      "state": "WI",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b706c",
      "summary": "Black object flying with no lights at night",
      "city": "madison",
      "shape": "chevron",
      "date": "2008-02-14T00:00:00",
      "story": "Black object flying with no lights at night I was standing on my porch at approximately 22:30. I see air traffic from the Nashville airport at night all the time, but this object had no lights. It was solid black, and it traveled much slower than any other air traffic. In fact, a jet flew past at the same time the object was in the sky, and the jet had several lights. They had to have been less than a quarter of a mile away from each other. I had time to get my brother from inside to come see it. We both watched it for about 20 seconds. I am an illustrator that is well educated, and I will remember this sighting for the rest of my life.",
      "link": "http://www.nuforc.org/webreports/061/S61407.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b708a",
      "summary": "brilliant white, red, blue, green light hovering for 20 minutes, then droping in elevation w3/ out the light ever geting dimmer",
      "city": "madison",
      "shape": "unknown",
      "date": "2007-06-12T00:00:00",
      "story": "brilliant white, red, blue, green light hovering for 20 minutes, then droping in elevation w3/ out the light ever geting dimmer We wre smoking on the back deck of mt girlfriend's apt, and I noticed a \"very bright star\" and mentioned it to her. She said that its a plane, and I was very doubtfull that was the case due to the brightness of the light and the elvation. The only light on a plane that is that bright is the taxi light, and the elvation was not coducive to a landing pattern. This object was not mooving as fast as a plane would if it was landing, flying towards or away from us. My reference was the fact that this object's light was equally intense through the whole sighting, the light did dissapear then returned several times while keeping the same position in the night sky. It was just hanging in the skly several hudred feet above and few miles southwest of the dane county airport. My girlfriend and I were watching the light and I'd begun to think that this was just A low flying plne traveling away from us at an angle that made it appear to not move at all. I was in the navy for a while in the late 90's as an A.E. stationed in Lemoore Ca., and have seen alot of aircraft flying at night. This was like nothing I've ever seen. The object would dim out then come back just as bright as before, when looking at it through my girlfriend's digital camera \" the stillframe side and magnified it appeared to change color as aposed to the white light shutting off, it would change to deep red, blue, and green. The object would also shoot multi colored beams of light out of the top of the object. The \"beams\" gave me the impression that ther was more to the object than we could see in the night. The object started to move lower in elevation not losing any brilliance to the light, and it would move side to side, we went outside to see more, watching for about 1 half of an hour.",
      "link": "http://www.nuforc.org/webreports/056/S56647.html",
      "state": "WI",
      "duration": "15-20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b73ae",
      "summary": "Two separate observations of the same UFO object/behavior with blind verification.  Close proximity.",
      "city": "madison",
      "shape": "disk",
      "date": "2007-08-07T00:00:00",
      "story": "Two separate observations of the same UFO object/behavior with blind verification.  Close proximity. July 21, 2007 Approx. 21:00 Central Time Northwest of Madison WI Traveling Southeast on RT 12 and while turning East onto RT 19. Partly cloudy skies, dusk light, slight breeze.  My wife, son and I were driving home from a walk in the woods.  It was dusk.   I was driving, my wife was in the front passenger seat and our 3 ½ year old son was in the back child seat (not a very reliable witness, I'm afraid.)   While heading southeast on rt 12 shortly after crossing the Wisconsin River we were driving up the hill leading out of the river valley.  My attention was on the street in front of me when I “felt” something trigger in my peripheral vision vertically above my line of sight.  My gaze moved strait up and I found myself seeing a saucer shaped object with a high dome centered on top.  The object appeared to be relatively close and at a low altitude.  Between the visible horizon  and our location.  If I were to guess a diameter based on the perceived distance of the object I would say it was similar to that of a medium size commercial airplane, but that's really a shot in the dark.  The object radiated it's own light, which appeared similar to the Sun.  A high energy orange-ish yellow, but did not appear to be flickering or com busting, appeared very stable.  As soon as my direct vision registered this object it promptly disappeared.  Just sort of blinked out of existence.  I barely acknowledged it.  Although it did seem extraordinary, it was so quick and I was the only observer so it seemed almost useless to talk about and I promptly stuffed it to the back of my head. In addition to the above reasons for not dwelling on it is that I have been doing some fairly in depth research into the ufo disclosure culture recently and it could easily be interpreted that it was what I *wanted* to see.  It would have been left at that, except about 3 – 4 minutes later I was making a left hand turn onto WI HW 19 east and out of the left edge of my peripheral vision I saw the same color in the sky.  But before  I even had the time to turn my head and look at it my wife GASPED.  “Did you see it too!!?” *Now* I was excited.  Before explaining at all what “it” was or indicating my observation, she described the same object, color, including it blinking out of visual perception as soon as her attention was drawn to it. She actually got a better view of it than I did.  It's possible this was a second object separate from the one I witnessed, but I doubt it.  It seemed like it had been stationary relative to our change in location.  When we got home she drew what she saw and her drawing matched up perfectly with the shape I saw.  The most curious part of all of this is that it's only been for the last few weeks that she and I (to a greater extent, me) have been researching available data on the web pertaining to ufos/technology, attempting to find only the most credible sources and hard data.  It's amazing how much is out there, buried in disinformation, noise and junk claims, but the credible stuff is mind blowing and almost incomprehensibly important.  Regardless of what we saw tonight, it does feel like we are on the verge of something trans-formative as a species.   We better be, or else we'll just been a sedimentary layer of interesting archaeological artifacts soon enough.  I'm interested in speaking with other rational people about these topics.  I will see if the site admin here is willing to connect other with me without publicly disclosing my information.  Otherwise check out Craigslist or myspace for “madison wi exo-politics” in some form or fashion.  +m",
      "link": "http://www.nuforc.org/webreports/057/S57785.html",
      "state": "WI",
      "duration": "Under 2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7581",
      "summary": "While on Greenhill Road in Madison, Connecticut, coming from Killingworth, Connecticut, at approximately 7:40 P.M. last night, on Frida",
      "city": "madison",
      "shape": "",
      "date": "2008-01-21T00:00:00",
      "story": "While on Greenhill Road in Madison, Connecticut, coming from Killingworth, Connecticut, at approximately 7:40 P.M. last night, on Friday, January 18, 2008, I saw a round light fall from the sky.  The light was not colored.  It did not blink or make any noise.  If the sun were a basketball, this object was the size of a baseball.  My first thought was the object was a shooting star.  But the sky was dark last night. And, I honestly do not know what a shooting star is.  My second thought was that I saw a meteor or some debris from an airplane Then, as I watched the trajectory of the object, the object moved northward, toward North Madison. I watched this object move for about ten to fifteen seconds. What bothered me was that the object did not fall straight downward.    The arc created was at least 1000 arms in length – perhaps even some several thousand arms in length.  (I am a terrible judge of distance).  I pulled my car over to the side of the road and waited for a crash:  the object just disappeared out of my sight.  I’ve never seen anything like it.   The object was not an airplane or helicopter.  It was moving way too fast to be either.  Nor was the light source originating from the ground:  there was no light beneath it.  More specifically, if someone had beamed a flashlight or advertising light into the air, there would have been traces of light underneath this beam.  There were none.  I probably would have just shrugged the entire incident off as being a shooting star or meteor – and it’s entirely possible that’s what I saw.  However, when I turned on the TV at 9:00 PM EST, to the Larry King Live episode regarding the sightings in Texas, I figured at a minimum, I needed to report this.",
      "link": "http://www.nuforc.org/webreports/061/S61001.html",
      "state": "CT",
      "duration": "10 - 15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b767e",
      "summary": "Star like ufo decends down slowly from high in the sky until it gets about tree top level.  ((NUFORC Note:  Venus sighting.  PD))",
      "city": "madison",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "Star like ufo decends down slowly from high in the sky until it gets about tree top level. I have been watching this star like ufo every night just after sunset, for the past four months. It desends down slowly from high in the sky. As it comes closer its lights get brighter. It will sit still for a while, then slowly move down more and more in a zig-zag movement. It will come down to tree top level, sometimes lower. We live a half a mile from airport, airplanes come in for a landing and go right past this ufo, they have to see this bright light. I watch this for 2 hours or more every night, with the exception of when thunderstorms or in the area. My daughter has also watched this with me. It has also dimmed or faded its lights and it would be invisible. I now know for sure that ufo,s really are out there, and its amazing and exciting to be able to watch this night after night.",
      "link": "http://www.nuforc.org/webreports/056/S56221.html",
      "state": "AL",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a90",
      "summary": "Two Triangular Craft over Madison Alabama",
      "city": "madison",
      "shape": "triangle",
      "date": "2007-03-08T00:00:00",
      "story": "Two Triangular Craft over Madison Alabama Around 8:00p.m. I was driving home heading east on hwy 72 in Madison, Alabama. As I drove toward Wall Triana Hwy I noticed two bright lights above a field that was located next to a Grocery Store.  Normally I wouldn’t have paid any attention, except there were no flashing lights and they were very low to the ground I’d say close to three hundred feet off the ground.   They were very still and seemed to be motionless. I decided to pull into the parking lot of the grocery store so I could get a better view.  I pulled to the side where the field was and sat facing the field so I could observe this.  The whole time I was speaking on the phone to my boyfriend.  When I finally parked the car I could see that these were not just two big lights rather they were a multitude of lights arranged in a triangular shape. I rolled down my window and the only sound was that from the hwy behind me, no noise as that of a plane could be heard. The first craft began to move south at a slow pace. I’d say at a maximum speed of 10mph. Then a moment later the second craft followed. The first craft had a row of four white lights, then a row of three, the middle light on this row was red. Then a row of two lights and one light to complete a triangle. The red light in the center of the craft was blinking, but all other white lights remained solid and consistent. The second craft was exactly the same as the first one, however it lacked the red light, only white lights in the shape of a triangle. As the crafts moved over head you could make out a faint shape around the triangle, the only way you could even notice was that it would block out stars as it moved even though the triangle part wasn’t over the star yet. Both craft continued at this slow pace until I could not see them from the front anymore and then they became invisible in the night sky. I didn’t have anyone else in the car, nor did I have a camera. Believe me I wish I had both! Where I live is close to Red Stone Arsenal (military base) and Huntsville used to be headquarters for NASA. So I can’t say that it wasn’t a military plane, but it sure wasn’t a plane as we know it today. Either way UFO or secret plane I have never seen anything like it in my life!",
      "link": "http://www.nuforc.org/webreports/055/S55488.html",
      "state": "AL",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ec9",
      "summary": "A black, parallelogram shaped object was seen on May 30, 2008.",
      "city": "madison",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "A black, parallelogram shaped object was seen on May 30, 2008. My sister and I had just picked up my daughter from a birthday party.  As we were driving into the neighborhood, we saw a large black object in the sky.  It was shaped kind of like a parallelogram.  It was completely still, no wavering, wind movement, etc.  When we got to my house we stood in the driveway and watched it for a few minutes.   Then it gradually moved out of our vision, behind a house high up on a hill.  It moved so slowly that it didn’t seem like it was moving, until the house was in the way.  We didn’t hear any sounds.  This was late in the afternoon, shortly before sunset.   We are still puzzled by what we saw.",
      "link": "http://www.nuforc.org/webreports/072/S72556.html",
      "state": "WI",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8409",
      "summary": "Eight to ten circular objects in triangular formation near high cumulus cloud in daytime.",
      "city": "madison",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "Eight to ten circular objects in triangular formation near high cumulus cloud in daytime. Friday,  November 16,  2007 at around 1:30 p.m., I’m standing in a field in Madison County, Virginia as my daughter is riding her horse. Staring up at a beautiful isolated puffy white cloud in a northwest direction I spot something unusual. The sky was perfect blue and it was a bit windy. I stare through my polarizing glasses, which allowed me to see the clouds and sky clearly, at 8 to 10 small round shaped white objects moving in formation similar to Canadian geese forming and reforming a triangular shape. My immediate reaction was that it was a flock flying as you always see them. As I watched, I realized they were up by the clouds some 5,000 to 8,000 feet or more, and were colored white, not the usual dark color of geese, and staying very close to the cloud at that high altitude. I watched for some 15 to 20 seconds until all of a sudden they disappeared into the cloud. I kept watching for another 2 minutes or so until the powerful winds quickly swept the cloud away. I kept searching the blue sky for the objects, but saw nothing. Later I was kicking myself for not getting my camera, which was in the car about 300 feet away and taking a shot of the interesting sight, but my mind was too busy at the time trying to make sense of what I was seeing. Fortunately, I am a computer artist and illustrator and was able to recreate the event soon after the sighting in Photoshop. The more I thought about the event the more I realized I’d never seen anything like that before.",
      "link": "http://www.nuforc.org/webreports/068/S68284.html",
      "state": "VA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b84f1",
      "summary": "Gold ring shaped UFO, silent.",
      "city": "madison",
      "shape": "other",
      "date": "2008-10-31T00:00:00",
      "story": "Gold ring shaped UFO, silent. Images here:   http://picasaweb.google.com/MichelleGsPhotos/WhatIs This  Friend saw this and followed it for quite a while. Took some great pictures of it. It looks like a perfect gold ring. I will updated when I get more information from him, but was genuinely curious. Thank you.",
      "link": "http://www.nuforc.org/webreports/065/S65281.html",
      "state": "WI",
      "duration": "Several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8aae",
      "summary": "Amber orange light moving very slowly, dimming out, shooting away.",
      "city": "madison",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Amber orange light moving very slowly, dimming out, shooting away. I was in my second story bedroom, when a bright light caught my eye. Our house is quite close to the local airport and is almost directly under a common flight path taken by incoming airplanes. It is therefore extremely common to observe planes with bright, white flight lights approaching from the south. For a number of reasons, however, this was different:  1. Even indoors with the windows closed, you can always hear approaching passenger planes. They are very loud, because they are very low. This object made no sound audible from inside the house. 2. The path taken by planes on their approach is completely predictable (essentially, they go over our neighbor's house to the east). This went over our neighbor's house to the west. 3. It was moving very slowly. Because it was a light in the sky, I feel it's hard to say how far up it was; it seemed like it wasn't much higher than 2 or 3 times the height of the tall, mature trees in our neighborhood. Could be wrong about the height. Regardless, it appeared to be making the progress of a car going around 5mph (if it was as close as it appeared). 4. The light was bright amberish orange, unlike the lights of the passenger jets that pass overhead ... bright white at first and then red and blue flashing lights as they get closer. Because it looked odd, I went outside to our porch to get a better look. I found it in the sky again outside. I could still hear no sound. Again, it seemed strange because it was moving so slowly. Its path was completely straight and it moved from roughly south to north. I tried to film it with my cheap digital camera, but the camera was unable to pick up the small light. After a minute of observation, it had finally reached a point parallel with our house. Then, the light dimmed out completely. As I turned to go back inside, a speck of light shot very quickly upwards from the point where the light had dimmed. This final observation, of sudden insanely fast movement, is what really spooked me. I've seen plenty of lights in the sky that have seemed odd, but I always felt that my impression could be a misinterpretation of something mundane. This event seemed truly weird.",
      "link": "http://www.nuforc.org/webreports/072/S72804.html",
      "state": "WI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bbe",
      "summary": "Fireball seen by power plant",
      "city": "madison",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Fireball seen by power plant Fireball seen by 2 people in Madison Township Ohio. This caused a mass search for the object some thought could of been a ultralite plane.  But after searching the area with help from choppers in the sky as many more folk searched the area on the ground for 4 or more hours they found nuthing.  This area is very close to a nuclear power plant.you can see more here ((NUFORC Note:  Witness elects to remain totally anonymous;  provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67191.html",
      "state": "OH",
      "duration": "11/15/08"
    },
    {
      "_id": "64d005f478aba2ec5a3b8eda",
      "summary": "((HOAX??))  air force story",
      "city": "madison",
      "shape": "cylinder",
      "date": "2009-03-19T00:00:00",
      "story": "air force story my firend works for the air force has been there 20 yrs and i was out with him one night at a place eating with a older man who retired from the air force i joking asked are there ufo's the old man got quite and looked at me and stated \"no one will belive you anway so ill tell you ive seen them\" them he later added the \"grey\" and talked about a peice of metal he personal held that was like tin foil thickness and when you crushed it the tin foil returned back to it normal shape.. this man eyes never left mine he spoke straight out not thinking just spoke. i was numb and freaked out.. then i asked about area 51 and he wouldnt admit to it and also changed the story very quick.. but assured me that all \"things we have now came from them\" and we still dont know everything yet.. i have no reason to lie on this site just wanted to share my story ((NUFORC Note:  Witness elects to remain anonymous; provides no contact information.  Possible hoax, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68358.html",
      "state": "WI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9045",
      "summary": "Unexplainable movements attached to light unidentifed object in night sky.",
      "city": "madison",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Unexplainable movements attached to light unidentifed object in night sky. Object was seen by the naked eye from a skylight in a condo.  Looked like a very bright star at first, but made significant quick movement indicating it was not.  Object was very bright and difficult to make out shape.  It bounced back and forth across the sky in small increments and then would move in various directions at a quicker rate and longer distance.  At times it would change position and appear to have a red light on one end.  Could have been circular or rectangular depending on the angle.  At one point a second light object entered the area, disappeared, then reappeared and shot off to the right of the other-leaving a light trail.  This continued for at least one hour.",
      "link": "http://www.nuforc.org/webreports/068/S68404.html",
      "state": "WI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b90b1",
      "summary": "I saw a triangle craft hovering up close",
      "city": "madison",
      "shape": "triangle",
      "date": "2009-12-12T00:00:00",
      "story": "I saw a triangle craft hovering up close in the past i have seen many unexplainable lights in the sky but never saw anything i was as sure of. while driving home with my brother and sister, i saw a triangle craft fly overhead at a very fast speed very low to the ground, mayber 200ft in the air. it had 3 lights like a plane, 2 white, 1 red. I continued on my way home in the direction it was flying and came to a big field near my house. there i saw the craft again hovering in place above the field. I had now turned off the 3 lights and turned on a large green light which was mounted on the back. after hovering in the same place for seconds it flew away at a very high speed. after that i just went home. Later i called my parents who werent home and told them of what had happened. as i was standing on my porch gazing at a star an orange orb appeared in the sky. it began to fly towards my house. my brother immediatly got the camera and i began taking pictures. as it flew overhead it was silent and you c! ould clearly tell it was a triangle shape. soon after black suv's began driving past my house, and i ran inside and called the police.",
      "link": "http://www.nuforc.org/webreports/073/S73117.html",
      "state": "OH",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b91d6",
      "summary": "Plane hoovering over Heritage Elementary School on County Line Rd.",
      "city": "madison",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "Plane hoovering over Heritage Elementary School on County Line Rd. Around 5:15p.m. on 02/05/09 I was driving north down County Line Rd. to the Cat Hospital to pick up my cat. I noticed a plane with 3 lights in the shape of a triangle, something about it intrigued me and I could not stop looking at it. As I was driving I noticed the plane was not moving and coming towards me as it should have been. So, I keep my eye on the plane and when I got to Heritage Elementary I saw that the plane was hoovering over the school about 5 to 10 feet above tree line. I could not understand how a plane could do this with out falling out of the sky. I noticed it was a gray military plane with no markings on it. I was so weirded out by this I literally had my head over the steering wheel looking at the plane and was wondering if I was the only person that saw this plane hoovering. After leaving the vet I was not thinking about it and drove right past the school and then I thought to myself I wonder if the plane is still there after seeing a smaller plane flying in front of me. As I looked in my rear view mirror I saw that the plane was now flying and going south down County Line Rd. towards the airport. I keep watching the plane the whole time and felt like it was following me, it stayed 15 feet behind me the whole way. As I turned East on Palmer Rd. I thought the plane would fly over me, but no it proceeded to go down Palmer Rd. with me and the weird part is the plane did not turn left like I did, it stayed facing South but flew side ways down Palmer. At this point I was terrified and thought my mind had to be playing tricks on me. I speed up and after passing the Palmer park I came into the group of trees and the plane seemed to have stopped, almost like it couldn't see me anymore. At this point I slammed on my breaks next to the Madison Water Dept. and watched the plane. It proceeded to start flying \"normal\" and going South towards the airport. I keep my eye on the plane as I drove towards Sullivan \"Wall Triana\" and once I turned going South on Sullivan I could not see the plane. A plane this big would still be visible from Sullivan, but it disappeared and was no longer in sight.",
      "link": "http://www.nuforc.org/webreports/068/S68489.html",
      "state": "AL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b94d9",
      "summary": "We thought the object was star, it was a white light which moved across the north north-eastern sky heading south and then faded away.",
      "city": "madison",
      "shape": "sphere",
      "date": "2010-06-03T00:00:00",
      "story": "We thought the object was star, it was a white light which moved across the north north-eastern sky heading south and then faded away. This was actually the first of two times I have seen this strange light. Both times there were other witnesses besides myself with me. We were eating pizza outside in my front yard.  We live in an area where there isn’t much light pollution, so we were looking at stars.  We were trying to find constellations we knew, when two of us (myself and one of my friends) saw the light.  We told them to look as we watched it. The object first appeared to be star, which we then noticed was slowly moving.  It had been fairly faint, but still noticeable.  We hadn’t been paying attention until it started moving.  It was in the north north-eastern sky and was slowly moving towards the south east.  As it moved it got somewhat faster, but also significantly brighter.  It got bright enough that it rivaled some of the other stars, but I wouldn’t say it :lit up the sky,\" or anything that significantly.  As it continued to travel, it started getting dimmer and dimmer until it couldn’t be seen.  I wouldn’t say it traveled very fast, and it never got far enough to be parallel with us/over us (though its path wouldn’t have allowed it go over us).  It was a clear enough night that had it been a plane we could have seen something as it continued further.  There was no flashing or sound; the light was white like any other star. There were three guys (counting myself) and two girls.  We were in high school. Nobody had been drinking, or doing any drugs of any sort.  Everybody saw it clearly and agreed that we couldn’t figure out what it was.  (We are good students too; one of the guys is our class’s valedictorian in a class of over 250) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75545.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b95db",
      "summary": "This is a definate government cover-up",
      "city": "madison",
      "shape": "disk",
      "date": "2009-05-12T00:00:00",
      "story": "This is a definate government cover-up UFO 2nd Incident:   Around May 14 of 73 the three of us ((name #1 deleted)), ((name #2 deleted)), ((name #3 deleted)) and I were in military Radar school at Redstone Arsenal in Huntsville Alabama. ((name deleted)) was living with his family in Madison just north of the base so I would go there often.  Around 8pm ((deleted)) said come outside as he saw something so I grabbed some binoculars and the camera and we climbed on the roof of the house.  We could see over treetop level to the secret part of the base where was hovering just above the trees a saucer shaped object with spaced flashing red lights on the rim.   After about fifteen minutes two large jet aircraft (possibly C134) circled around and one would dive at the UFO continuously for several minutes until the UFO shot a white pencil beam of light like a lazer at the nose of the jet.  The jet flew directly over us and I saw the jet numbers but figured I better forget and the jet left.   Five minutes later a jet fighter came in diving at the UFO.  I noticed that the width of the saucer was about the length of the fighter about 60 feet.  I didn’t take any pictures this whole time for certain reasons but we could see clearly especially with the binoculars. Finally the UFO must of got the hint and settled down below the trees.  The two jets circled for about 45 minutes then left.   During this whole time the Huntsville airport is usually busy but not one plane was heard until around 2am as we could see it from the top of the house.  Since I have space I’ll mention the first incident. Can’t remember if it was the same night or the night before at ((name 1)) house we heard on the radio that the spacelab was launched and would fly over us about 8pm and that part of it was built at Redstone.  We stood outside and saw it going by from west to east like a moving star.  Then from the north another object intersected with the spacelab, followed it shortly then went south. We thought we don’t have anything that can do that.  Later we heard on the radio that the meteor shielding was ripped off the skylab but that it happened during launch. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69696.html",
      "state": "AL",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a13",
      "summary": "For the 3rd time, blinking red lights seen in Morris County.",
      "city": "madison",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "For the 3rd time, blinking red lights seen in Morris County. For the third time in one month in Madison, New Jersey red lights were scene blinking in the sky.   First event, Jan 8, 2009, had a total of 5 red lights blinking in the sky, coming together and one by one dropping and disappearing.   The second event, exactly three weeks, Jan 29, 2009, had a very similar scene with 5 red lights blinking in the sky.  This most recent event, on Feb 17, 2009, just before the three-week mark, 9 red blinking lights could be found scene in the sky.  When someone informed the local police they were told it was nothing but \"balloons.\"  These red blinking lights can be found videotaped on several websites and have been recorded by not only people within the Morris county area but also by NASA.  Freaky stuff. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68745.html",
      "state": "NJ",
      "duration": "10 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c98",
      "summary": "i was driving north on hwy 12 towards middleton. i saw at least 6 to 8 red lights off in the distant sky in a V shape that seemed to be",
      "city": "madison",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "i was driving north on hwy 12 towards middleton. i saw at least 6 to 8 red lights off in the distant sky in a V shape that seemed to be north of middleton. from where i was it seemed as though the lights were about 15 degrees above horizon. i could see all the lights briefly and then they turned off fairly quickly but they turned off individually starting from the right and then to the left. they did not turn off at the same time. there is a small airport west of middleton. but i knew it was not a plane, nor could it have been planes in formation...i have never seen anything like it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67508.html",
      "state": "WI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e5c",
      "summary": "object in back groung.",
      "city": "madison",
      "shape": "sphere",
      "date": "2008-07-05T00:00:00",
      "story": "object in back groung. I was taking a picture of 1 of my customers and didn't realize what was in picture untill I had it developed.",
      "link": "http://www.nuforc.org/webreports/064/S64077.html",
      "state": "AL",
      "duration": "1 PHOTO"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f01",
      "summary": "Tanslucent orange/yellow UFO in Madison WI",
      "city": "madison",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "Tanslucent orange/yellow UFO in Madison WI   My wife and I were driving on John Nolen drive around 9:30 PM and observed 1 translucent orange/yellow circle UFO move down from the sky slow then came at an angle and made insanely fast \"maneuvers\" in a triangle pattern and then disappear into the sky. The object was very close to us I would say around 500 feet. Also on a side not my wife has observed this same type of UFO 3 time before this in a 2 year span. She saw it twice near HWY 30 near Fair Oaks and the other time was in Cottage Grove. We just thought it was a jet or something but after I saw it myself and didn't hear anything or see any blinking lights and as fast as the UFO moved it made me a believer and i still don't know what to think. I surprised no one else saw anything on John Nolen. I thought it would be in the news it was so obvious. The event took about 20-30 seconds and just vanished. I cant describe it well but if i were to take a laser pointer on \"scribble\" on the wall thats how fast it moved.  If anyone else saw this please post! so i know my wife and I are not going crazy!",
      "link": "http://www.nuforc.org/webreports/066/S66204.html",
      "state": "WI",
      "duration": "20 Secounds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba204",
      "summary": "Madison,NJ Disk in the sky for half hour",
      "city": "madison",
      "shape": "disk",
      "date": "2009-06-09T00:00:00",
      "story": "Madison,NJ Disk in the sky for half hour At approx. 2:00-2 .30pm on Monday afternoon,location  Madison, NJ, four people in family observed a ufo disk hovering in the sky in the direction of the city of Morristown. It was silver in color,and was blinking in the sunlight as if there was a electric wave around the craft. It stay in one spot for around a half a hour. A small plane departing from Morristown airport flew way under this ufo  craft as it went by.It later disappeared into the clouds.",
      "link": "http://www.nuforc.org/webreports/070/S70199.html",
      "state": "NJ",
      "duration": "Half/Hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba72c",
      "summary": "White oval floating over treetops near Madison, Wisconsin airport",
      "city": "madison",
      "shape": "oval",
      "date": "2008-07-05T00:00:00",
      "story": "White oval floating over treetops near Madison, Wisconsin airport From my office window, on the East side of Madison, Wisconsin, I had just watched a flight of F-16 fighter jets make their landing approaches to the Madison Airport when I looked around to see if any other aircraft were approaching.  I saw, to the North, a white, but slightly yellowish oval approaching the airport just above the treetops. The oval was horizontal to the horizon. From the size, I judged it to be an approaching airliner a long way off, but one that seemed too far away to have been on it’s glide path that early. It wavered laterally and vertically just slightly, as it approached (these changes in position were slow and gradual). I estimate it was about a half mile out from the runway when it appeared to slow down. As it grew darker- to a grayish color – and very slowly shrunk in size, I realized that it had changed course and was traveling almost due West. I could still see it bob and weave – but very faintly as it drifted off. I was on the phone with a Dane County Sheriff as the object finally dropped below the treetops and I could see it no more. The object reminded me of a 20 – 30 foot Mylar balloon mimicking an ultra light aircraft in a moderate wind. The dispatcher said she would notify the Sheriff’s Office in DeForest – the town over which I estimated it was when I lost sight of it. A coworker was the only other witness.",
      "link": "http://www.nuforc.org/webreports/064/S64079.html",
      "state": "WI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba72b",
      "summary": "White oval above treetops in Madison, WI - changed direction and color",
      "city": "madison",
      "shape": "oval",
      "date": "2008-07-05T00:00:00",
      "story": "White oval above treetops in Madison, WI - changed direction and color From my office window, on the East side of Madison, Wisconsin, I had just watched a flight of F-16 fighter jets make their landing approaches to the Dane County Regional Airport when I looked around to see if any other aircraft were approaching.  Less than 2 minutes later, I saw, to the North, a white, but slightly yellowish oval approaching the airport just above the treetops. The oval was horizontal to the horizon. From the size, I judged it to be an approaching airliner a long way off, but one that seemed too far away to have been on its glide path that early. It wavered laterally and vertically just slightly, as it approached (these changes in position were slow and gradual). I estimate it was about a half mile out from the runway when it appeared to slow down. As it grew darker- to a grayish color – and very slowly shrunk in size, I realized that it had changed course and was traveling almost due Northwest. I could still see it bob and weave – but very faintly as it drifted off. I was on the phone with a Dane County Sheriff’s dispatcher as the object finally dropped below the treetops and I could see it no more. The object reminded me of a 20 – 30 foot Mylar balloon mimicking an ultra light aircraft in a moderate wind. The dispatcher said she would notify the Sheriff’s Office in DeForest – the town over which I estimated it was when I lost sight of it. A coworker was the only other witness.",
      "link": "http://www.nuforc.org/webreports/064/S64116.html",
      "state": "WI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba94f",
      "summary": "i have pictures of brilliant streaks of light, by the fastest moving object i ve ever seen.",
      "city": "madison",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "i have pictures of brilliant streaks of light, by the fastest moving object i ve ever seen. I was driving into town and saw light flashes across the sky. Went around the curve and 2 other cars were pulled over watching. I got my camera out and took some great photos of the brilliant streaks of light in the sky...going in all different directions.",
      "link": "http://www.nuforc.org/webreports/078/S78810.html",
      "state": "WI",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3babe1",
      "summary": "3 high altitude redish purple lights that moved oddly across the nights sky.",
      "city": "madison",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "3 high altitude redish purple lights that moved oddly across the nights sky. Talking with a friend, standing outside looking up.  Out of the corner of my eye, I thought I saw a search light streatch up from behind the top of a large tree. Upon looking directly, I realized it was 3 oval redish purplish lights in a straight line up and down but instantly they took a 45 deg.  Turn, but maintained their distance and relation to each other and sped off quickly to the east & disapeared into the sky.",
      "link": "http://www.nuforc.org/webreports/078/S78212.html",
      "state": "WI",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bad31",
      "summary": "Triangle shaped craft with orange-yellow lights that hovered very low near Redstone Arsenal in Madison, Al",
      "city": "madison",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "Triangle shaped craft with orange-yellow lights that hovered very low near Redstone Arsenal in Madison, Al Triangular shaped craft with orange-yellow lights hovering very low about 5 miles from Redstone Arsenal in Madison, Al.  We turned the car around to take a picture and craft vanished.  We could not see it anywhere.  My husband and I both saw it, and asked each other, \"What is that?\"   It was almost right over our car and very low.  It did not appear to be moving.  We pulled onto the next side road to stop and get a picture and could not see it anymore.   This was about a half mile from our home and very close to the arsenal in Madison, AL.",
      "link": "http://www.nuforc.org/webreports/079/S79499.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb308",
      "summary": "hovering object with bright lights in sky- suddenly disappears",
      "city": "madison",
      "shape": "oval",
      "date": "2011-01-31T00:00:00",
      "story": "hovering object with bright lights in sky- suddenly disappears Riding in car with 17 year old daughter, turned corner and my daughter said \"do you see what I see\"  I had seen lights out of the corner of my eye, I looked up and in the sky right in front of us was an aircraft with green and white lights in an oval shape.  I suddenly sped up because I started thinking in was something stuck in the power lines cuz it made no logical sense the way it was hovering.  I felt like something was going to fall on us or suck us up.   I drove past 2 or 3 houses on the street and pulled into a driveway  to look back at it and it was gone.  I turned and drove back under where it was because I couldn't believe it and there was nothing in the sky",
      "link": "http://www.nuforc.org/webreports/079/S79620.html",
      "state": "WI",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb7fa",
      "summary": "Pulsating Diamond",
      "city": "madison",
      "shape": "diamond",
      "date": "2010-08-30T00:00:00",
      "story": "Pulsating Diamond On the night of Friday 27-Aug-2010 at 2217hrs my wife and I along with another couple and the children were setting up our campsite at the Hammonasset State Park in Madison CT. My wife said to everyone \"look at that!\" we all turned to the southeast and witnessed a diamond shaped object pulsating red/orange moving slowly to the northeast, I was able to take a compass bearing on the object of 150*. I referenced the object with two pine trees at a range of approximatley 100m across a flat open field the object was situated at an elevation equivelant to two horizontal fingerwidths above the two pine trees the object steadily moved to a bearing of 120* paused for approximatley 2 seconds and then rapidly ascended to the east at a high angle of ascent and disapeared out of site. The weather was as follows: Skies-clear with abundent stars visible and the moon was a wanning gibbous providing significant lighting, enough so that I would expect an exhaust/vapor trail t! o be visible , Winds-Calm, Temperature-Approximatlety 60*F, Humidity-Low. The object made no noise, there was no trail of exhaust/vapor visible. I did not notice any aircraft in the area at the time of the sighting. I called the NUFORC hotline to report shortly after the incident occured. As we were in the process of setting up camp a camera was not readily accessible and I did not want to take my eyes off of the object. My exact location at the time of the incident was 41* 16'21.7N 72* 35'51.1W.",
      "link": "http://www.nuforc.org/webreports/077/S77519.html",
      "state": "CT",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe4e",
      "summary": "Triangular craft over Madison, WI",
      "city": "madison",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "Triangular craft over Madison, WI I was playing fetch with my dog in Central park in Madison, WI around 11:30 p.m. when I saw a light out of the corner of my eye.  I thought at first that I was witnessing a shooting star.  I looked to my left and saw what was a triangular shaped craft with dim white-blue light along the front two edges with a brighter headlight at the front.  The craft was completely silent, headed away from my location toward the horizon. The sky was mostly clear but hazy to about 40 degrees off the horizon. When the craft was over the clear sky it was completely transparent and when it entered hazy portions of the sky I could clearly see it.  My estimation would bee that it was flying 1000-3000ft in the sky.  I have never in my life seen an aircraft like this.",
      "link": "http://www.nuforc.org/webreports/084/S84963.html",
      "state": "WI",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc333",
      "summary": "Witnessed three bright orange lights in triangle formation that stood steady and unflickering approx.10 minutes then disapeared.",
      "city": "madison",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "Witnessed three bright orange lights in triangle formation that stood steady and unflickering approx.10 minutes then disapeared. Witnessed three bright orange lights to the West of Madison that were in a perfect triangle formation.  Lights were steady - unmoving and unflickering.  Lights were visible for about 10 minutes then vanished.",
      "link": "http://www.nuforc.org/webreports/085/S85578.html",
      "state": "MS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc5bb",
      "summary": "Object darted across the sky and would stop on a dime and dart in another direction",
      "city": "madison",
      "shape": "light",
      "date": "2011-08-07T00:00:00",
      "story": "Object darted across the sky and would stop on a dime and dart in another direction On July 4th, ~9:30 pm, while watching a fireworks show in Madison,  Alabama, my sister, my mother, I myself along with a few other people all noticed a moving object in the sky.  It appeared to look like any other star in the sky, but this object darted, danced, and even went in circles. I am not aware of any aircraft that could make such movements in the sky as this object did.    We watched this object dart back and forth across the sky for over an hour.   It was still darting and zig zagging around when I left to go home so for how long this object actually appeared I really do not know.  I have never witnessed anything like this before.",
      "link": "http://www.nuforc.org/webreports/082/S82873.html",
      "state": "AL",
      "duration": "1 Hour +"
    },
    {
      "_id": "64d005f478aba2ec5a3bd08c",
      "summary": "Five neon-orange fire-like orbs floating in a steady northeast to south direction in the sky over residential houses in Madison (Town o",
      "city": "madison",
      "shape": "cylinder",
      "date": "2012-09-24T00:00:00",
      "story": "Five neon-orange fire-like orbs floating in a steady northeast to south direction in the sky over residential houses in Madison (Town of Westport), WI.  I have Video and posted on Facebook and YouTube. For Youtube, Search Madison WI Fire in the sky. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92120.html",
      "state": "WI",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd057",
      "summary": "Extremely bright red light in NW night sky. No defined shape. Slowly traveled eastward. Light dimmed and disappeared.",
      "city": "madison",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Extremely bright red light in NW night sky. No defined shape. Slowly traveled eastward. Light dimmed and disappeared. My husband and I had just walked outside to get in the car around 8:30pm.  It was a clear, calm night with no wind. I looked up, above our apartment complex, and directly overhead I saw an extremely bright red light.  It was not an airplane (my husband is an airplane buff) because there was no defined shaped or night lights, nor was it a meteor or comet because it had no tail, nor firework debris because it did not descend.  We stood on the sidewalk and watched this strange light travel slowly eastward.  At one point it seemed to hover and then turned to the east.  As it traveled eastward, the light dimmed and then total blackness.  No sign of it anywhere.",
      "link": "http://www.nuforc.org/webreports/091/S91988.html",
      "state": "WI",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd106",
      "summary": "Luminous oval in evening sky over Madison, SD.",
      "city": "madison",
      "shape": "oval",
      "date": "2012-09-24T00:00:00",
      "story": "Luminous oval in evening sky over Madison, SD. At approximately 8:40 I observed a UFO in the western sky, as high as the clouds but not close enough to figure out size, exact distance away not known.  Could not be a cloud because it was completely luminous. The sun was blocked out by a few clouds on the horizon.No visible exhaust trails. Oval shaped. Color was white. I do not know when it exactly appeared, but from my observation the sighting lasted about two minutes. It moved so slowly it was hard to tell it was moving, and at one point it just faded into the sky.  I saw it for a minute and brought three others to its attention.  All three and I are young and related.  I have interest in UFOs already, the second witness has a little less, the third has some minor interest, and fourth hardly at all. Could possibly  be some odd reflection of the sun, I doubt it was our imagination.",
      "link": "http://www.nuforc.org/webreports/092/S92081.html",
      "state": "SD",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd17f",
      "summary": "Triangular light drifting high over Madison, AL in full daylight.",
      "city": "madison",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Triangular light drifting high over Madison, AL in full daylight. At approximately 1:10pm I was letting my dog out when I looked up at the partly cloudy sky and saw what I first thought was a piece of paper drifting on the breeze a few hundred feet up and and away from me.  At first it seemed to be drifting with the wind current, but it kept performing little circular, round-about motions and twirling both down and up.  I was about to dismiss it as just what I had initially thought it was, when it turned into the wind and rose in altitude, starting performing circling aerobatics and headed towards a particularly large bank of clouds extremely high in the sky.  Right as it started heading higher I ran inside to get my camera, but when I had returned just a few seconds later it was already out of sight.",
      "link": "http://www.nuforc.org/webreports/092/S92052.html",
      "state": "AL",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd456",
      "summary": "2 fireball like spheres from the West head east over Madison, same as 08/18/12",
      "city": "madison",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "2 fireball like spheres from the West head east over Madison, same as 08/18/12 So, first off I want to say that this is my first time to ever research &quot;UFO's&quot;.  Once as a kid I thought maybe I taken a picture of one, but the picture was in fact a bead of water on my camera lens. I say that because I have also seen the fireballs that were previously talked about on the 18, same characteristics and everything.  Where I live, to be vague, is about an hour and a half from where the other group saw the same UFO's. Heading from the West towards the East, the first fireball came from the corner of my eye and looked as if it were a plane on fire, I freaked out thinking a plane was going down but there was no sound. I questioned what I saw.  Like the other group I thought chinese fire lamp, but this was to high for the brightness, then the second appeared.  Same direction the second ball of light came, the thought of a plane still was going, maybe a plane in half but again no sound. I got online and researched 'red light over wisconsin'. I found this site and to my findings I feel that the two of us saw the same thing.  Whether its extraterrestrial, I don't know, but take this entry as a validation that I too saw the same thing within 90 miles of the last viewing, heading back from the direction they (on 08/18/12) saw it going. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92339.html",
      "state": "WI",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6d9",
      "summary": "Strange object with red and white lights appears from behind my woods.",
      "city": "madison",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Strange object with red and white lights appears from behind my woods. Me and my son in law went outside to sit on our back deck when we noticed a strange red glowing infrared light coming from the back of my woods.  We stared at it for about 15 seconds trying to figure out what it was since we have no homes behind our little bit of woods.  All that’s behind them is a field of power lines that run for miles.  We were thinking maybe its an animal of some sort looking at us when all of the sudden we hear a very strange but loud noise coming from that area. We instantly in fear ran in the house.  The first thing I did was run to get my  flash light to shine in the back of my yard. It took me several seconds to grab it and go back outside.  As I shined it to the area where the light and noise was coming from.  We didn’t see anything so I figured what I saw needed no flashlight so I turned it off in hopes we could see the light when all of the sudden right behind the trees we were facing we saw these intense lights radiating through our tops of the tree line coming into a visible view for us to see.  It was a small craft with very bright red a white lights flashing around it in a circular motion.  This object was laying low right along our tree and power lines as it moved off out of our sight. There was no noise at all coming from it.  It just flew away in a sort of slow quiet motion.  It was flying so low that it could stay below the tree tops in the field we were facing where our view was limited.   As soon as it was out of our sight we ran down the road to look down the field in hopes we could still see it but it was gone. There was no time at all to even catch it on camera..  We were not expecting to see this since we originally thought it was something else in the woods and couldn’t believe my eyes. I’m 100% confident that I saw a UFO. The next day we went out to the area where we saw this strange light coming from and there is an imprint in the tall grass.  The grass is smashed down as if something was presse! d on it. This confirmed to me that what we saw in the sky was ! first si tting in my yard.  I’m frightened by this  and never in my life experienced anything like this.  I feel I needed to report this bizarre incident in fear this craft could come back.  Why was it in my back yard?  Creepy!",
      "link": "http://www.nuforc.org/webreports/090/S90920.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd85d",
      "summary": "Large L-shaped object with 9 red lights, not blinking,  moving slowly and silent from North to South very low in sky",
      "city": "madison",
      "shape": "other",
      "date": "2012-07-04T00:00:00",
      "story": "Large L-shaped object with 9 red lights, not blinking,  moving slowly and silent from North to South very low in sky Report of UFO Sighting on Saturday, October 29, 2011 at 9:30 p.m. in Madison, WI. I was driving home heading East on University Avenue on the West side of Madison.  I had my sunroof open.  I am a birder so I always have a pair of binoculars on my dash.   As a was coming down the road on a slight hill just before the state office building (Hill Farms) on the right, and the golf course (Blackhawk CC)  that begins on the left I saw a large object very low in the sky just ahead and to my left about where the Pyre Square Building and McDonalds are located.   At first I thought some helicopters were probably moving some large item but as I got closer it was not.  It was totally silent.  I quickly cross over three lanes of traffic to turn right onto Segoe Road to pull over and watch the object.  I grabbed my binoculars to look at it through my open sunroof.  As I was looking at one of the red lights the entire object just plain disappeared, no light , no anything.   I then spent the next 45 minutes driving around the west side of Madison trying to find it again and ! to find a good unobstructed viewing area.  It was so obvious that I saw something that when I got home I turned the news on since I assumed everyone would have seen it.  There was nothing on the news, nothing in the newspapers - I kept checking for a week or so. What the object looked like was a very large L-shaped thing with red lights on each of the corners.  I assume the reason most people did not see it is that just down the road a mile are many, many red lights on top of the building cranes at the construction sight by University Hospital, in addition to the red lights on top of University Hospital for the helicopter pad (Med-Flight).  So there are twenty plus red lights ahead in the sky as you drive down this road.  But all the red lights there on the hospital and on the cranes blink!   I am always looking up in the sky since I often see owls in flight at night..  I also spend many hours star gazing with either my binoculars or my spotting scope.  I always can see satellites crossing in the sky.  Recently I have been seeing movement in the sky that I do not think are satellites.  These star like objects are much brighter and move way more quickly and straighter that the satellites.  They have been moving from north-east to south, south-west.  I regularly spend many hours at night watch the stars.  About 13 years ago I was up in the Apostle Islands when star gazing one night I found three very small bright star like objects that were arranged in a triangular shape and kept moving around in perfect sequence in the triangular shape.  I kept viewing this sighting for over an hour.  They were very, very far away.  I know other people have seen this kind of sighting.",
      "link": "http://www.nuforc.org/webreports/090/S90273.html",
      "state": "WI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd9b3",
      "summary": "Box shaped object witnessed hovering above Madison connector.",
      "city": "madison",
      "shape": "rectangle",
      "date": "2012-07-04T00:00:00",
      "story": "Box shaped object witnessed hovering above Madison connector. While driving north on the Madison connector, just outside of Hammonassett State Park, a box shaped object was seen hovering over the road approximately 25-30ft.  While passing underneath the object two read lights were observed on either side of the box.(like a set of red eyes)   After passing under the object it could then be seen in the rearview mirror of the witnesses vehicle.  The witness continued to watch it hover for about 2 more seconds before it swiftly moved up and disappeared into the sky. No sound could be heard coming from the object, nor was there any other like but the two read dots. Note: the object seemed to move slightly up and down as it hovered. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90370.html",
      "state": "CT",
      "duration": "a few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bda76",
      "summary": "I KNOW PLANES AND HELICOPTERS AND THIS WAS NOT EITHER",
      "city": "madison",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "I KNOW PLANES AND HELICOPTERS AND THIS WAS NOT EITHER  At around 10:20 pm on september 10, 2012 after taking my cousin to her job I returned home and at around 10:50 pm and went inside. I put my supper in the microwave and decided to go outside and smoke a cigarette.  Upon doing so I noticed a light flash. I looked up and saw it traveling from north-east to south-west. thinking it was a plane i ignored it for a few moments. then i noticed it turn an head back north-east.  Thinking this was a hellicopter I watched to see what it was doing.  Then I noticed it turn a solid fire red.  Realizing this was not a plane or hellicopter i watched more closely.  As the object made its turn from north-east back to south-west it changed from a red ball to a blue green which at that time I could see almost a shape that looked like a boomerang.   This pattern  continued for an hour and ten minutes.  Then the object flashed real bright white 7 or 8 times and then headed south flashing low white light till out of sight at 12:15 am",
      "link": "http://www.nuforc.org/webreports/092/S92655.html",
      "state": "IL",
      "duration": "0:15"
    },
    {
      "_id": "64d005f478aba2ec5a3bde92",
      "summary": "Rolling ball of light/fire/gas fell to earth and then took off.",
      "city": "madison",
      "shape": "fireball",
      "date": "2012-11-04T00:00:00",
      "story": "Rolling ball of light/fire/gas fell to earth and then took off It was a little before 2 am and I was rushing to get home before my mother went to work because I had borrowed her car.  I was sober and wide awake because I was a 3rd shift worker at the time.  The streets were deserted as usual for this time of morning. I came to a stoplight at a 3 way intersection about 1 mile from my home.  When I came to a stop I quickly noticed something that looked as though it was falling from the sky.  I looked up to my left toward this ball of rolling light as it got closer and I was just in shock.  In seconds it “crashed” on and rolled across the hood of my car and continued to roll down onto the curb and onto the side walk where the color changed from this bright yellow color to a purple gaseous color.  It was still for maybe 2 seconds and then shot straight up into the night’s sky. The light turned green and I continued to sit at the stoplight looking up, waiting to see more, but I didn’t.  It just disappeared.  I probably sat there for! 4 or 5 minutes before slowly driving home. I couldn’t believe what I saw.  It was all I thought about that night. I only told one person, who thought I was crazy and from then on I kept my mouth shut about it.  But I still think about it and I still watch the sky, waiting to see it again. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94017.html",
      "state": "WI",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be32c",
      "summary": "7 Large bright lights over North Madison in cloudy, overcast  2:00 AM sky 9/23/2012",
      "city": "madison",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "7 Large bright lights over North Madison in cloudy, overcast  2:00 AM sky 9/23/2012 I live surrounded by acres and acres of land trust in North Madison, CT.  I have a little ranch house set in the woods but the area around the house is clear of trees.  I have a dog who usually has to go out during the night.  Sometimes I let him out on the back lead and let him wander or I take him out front on leash for a quick pee.  He woke me up at 2:22am September 23, 2012 to go out.  I took him out the front. He did his business but seemed like he wanted to do more, so I walked him a bit down the driveway.  When I had originally stepped out I looked up at the sky to see what the weather would be like the next morning.  It was overcast and cloudy, no black sky and absolutely no stars.  As I walked down the driveway I noticed several very bright, big lights in the sky.  They were situated over an area which is a state park called Chatfield Hollow in CT.  I thought it  was weird because if they were stars, first of all they were super big and bright and there was no black sky around them, just a hazy cloudy sky.  So my sleepy mind is trying to figure how these stars are shining through the clouds. Then I noticed a clearing in the trees that 3 of them are in  a perfect vertical line spaced evenly apart.  My first thought it was the 3 Sisters stars but then realized it couldn’t be them because the 3 Sisters are not so perfectly spaced or in such a straight line. I then noticed to the left  a second set of 3 lights perfectly spaced in a straight vertical line running horizontal to the first set.  They stood motionless but were giving off a very bright glow.  Then I noticed a 7th light off to the left, almost like it was the sideways tip of a pyramid (for all 7 in  formation)   These lights were spaced out very far apart like several football field lengths. This 7th tip light was just as bright but had more of a redish glow.  I remember thinking Mars, maybe this was Mars.  This is what really scared me….about 7 seconds after I turned my face up to this 7th light and I am trying to figure it out, it got a little brighter for a second, like a quick pulse and then went out  But it wasn’t a quick switch off more like a quick pull back.  And my first thought was….”.Oh my God, they saw me seeing them….”  I quickly went back into the house. Needless to say I did not sleep  most of the night.  About 10 minutes later I heard an airforce jet fly over coming from the area the lights were and over my house.  So I was wondering if someone else saw these and reported to the airforce.  I dozed off somewhere around 4:20 and 5:15.  My senses were so alert to all noises at this point. Normally it is so quite at night you can hear your own blood in your veins, but what woke me up was a low steady humming sound that lasted for about 10 minutes.  But I also noticed the crickets got louder if that makes sense.  I was thinking why are they so loud and was afraid to look out the window as I was sure I would see a UFO hovering over my house. This wan't a plan or helicopter as the sound was the same and steady and then gone. So I lay in bed literally frozen in fear and after ten minutes the  humming went away and the crickets sounds had diminished greatly.  About another 15 minutes passes and I hear the humming again but it is fa! ther away, it didn’t feel like it was right over my house and the crickets got louder.  I remember thinking o.k. now they are over my neighbor’shome,  who is down the road a bit. It then went away about 10 minutes later and the crickets quieted down.  A third time I heard the humming faintly, crickets got louder and then it went away.  Crickets got quieter.  I definitely could tell the difference in the sounds when the humming stopped.  (I do not have a furnace that could possibly have made this noise)  At about 5:45 I could finally breath and close my eyes to rest. Here is the really weird thing, my daughter who is 21, her bedroom window faces where the lights were and her bed is up against the window.  When she got up I didn’t mention anything to her.  I asked her how she slept.  She said she got up in the middle of the night and closed the curtains on her window.  She said she woke up in the middle  of the night with the weird feeling someone was watching her, “like some creepy guy”. There was definitely something to these lights. I figured if they wanted to harm us they could do it anytime and there is nothing I can do about it, you can’t call the police.  I know I am not crazy, I don’t drink or take drugs, I am a professional and I have no reason to make this up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93009.html",
      "state": "CT",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be69d",
      "summary": "Small, plain white speck of light smoothly, slowly, and without sound headed directly southeast. Used to seeing planes with blinking li",
      "city": "madison",
      "shape": "light",
      "date": "2012-06-05T00:00:00",
      "story": "Small, plain white speck of light smoothly, slowly, and without sound headed directly southeast.  Used to seeing planes with blinking lights.  I can always see PTI traffic from Greensboro. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89289.html",
      "state": "NC",
      "duration": "30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3be7c6",
      "summary": "UFO During Lightening Storm",
      "city": "madison",
      "shape": "circle",
      "date": "2012-06-05T00:00:00",
      "story": "UFO During Lightening Storm Driving by the Pine Hall Brick water tower, I saw what looked like a mechanical double-flashing light coming from a ufo air craft seen tucked just within cloud during lightening storm. It remained stationary.  Might balls of lightening but it looked mechanical, blinking like air plane lights. As another description, would say it looked like a cell tower with a white blink but there are no towers. I could have sworn I felt an electrical vibration. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89288.html",
      "state": "NC",
      "duration": "drive by"
    },
    {
      "_id": "64d005f478aba2ec5a3bea87",
      "summary": "Disk shaped object came  from bright blue and white light in the sky",
      "city": "madison",
      "shape": "disk",
      "date": "2012-02-10T00:00:00",
      "story": "disk shaped object came  from bright blue and white light in the sky i was walking around in my room when i saw a round flash of light like a portel or something then i stared at the light and after ten 3-4 seconds it disapeered and then a round disk shaped oblject appered about 10-50 feet off the ground it had a bright red light on its top left side it also appearted to have 2 windows sideby side with light comeing from them it made no noise whatsoever it was moving at a speed of 5-10 miles N HOUR",
      "link": "http://www.nuforc.org/webreports/087/S87097.html",
      "state": "WI",
      "duration": "2-3 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3beb54",
      "summary": "Two air crafts both with huge red circular lights.",
      "city": "madison",
      "shape": "triangle",
      "date": "2012-02-10T00:00:00",
      "story": "Two air crafts both with huge red circular lights. I was walking home from work on the evening of February 8, 2012.  About a block away from my apartment I looked towards the sky straight above.  I also looked to the right and noticed that the stars were extra vivid and crisp on this night.  I looked farther ahead of me and saw two abnormal bright-like stars. I assumed that they were planets but I have never seen two so close together.  Then, again, I look to the right of me and up above I notice a very huge circular red light.  Also accompanying the red light were smaller white-amber-ish lights on each side of the bigger red light.  The sequence of the blinking lights were unfamiliar to me and extremely close to the ground; hovering, in movement. I do not exactly remember how long each blink measured but knew immediately they were unfamiliar.  At this point I was in shock.  I was less than a block away from my home and instead of going straight home I followed in the direction of the red light.  It seemed as ! though the entire craft was a red sphere as it drew away. I turned a left on the street before my block and realized that not only did these lights look foreign but also they were headed in the wrong direction.  Had they been lights from an airplane, the craft should have been traveling more East towards the airport.  Instead the craft was traveling SE. It definitely could not have been an airplane because it was too low to the ground and I heard no sound from where I stood. Through my vision the craft could have been traveling at a speed of maybe 40 MPH…?  I did not get a good look at the shape of this particular craft because as I followed it, it traveled further away flying over tall houses and apartment buildings which blinded my sight. The duration of the craft siting was about a minute long.  \tAfter that I walked towards my apartment. It took less than two minutes to get to my front porch. I immediately sat down and just stared into the night sky. Not one minute had passed when I saw another red light coming towards my direction from the NW. It traveled over Lake Mendota toward my apartment building. I cleared my eyes completely amazed. This craft also had a sequence of odd blinking lights not like the sequence of lights you see on planes or helicopters. The lights also had short awkward pauses and then would resume to the blinking pattern. These lights were also very close to the ground. As the craft got closer I could kind of make out a shape. It was quite dark but my best educated guess would be that the craft had a shape of a triangle prism. The craft also looked like it had a disk-like base and the lights were blinking on the front of the base. As the craft traveled over the apartment building next to mine, I noticed that the underside of the base of the cra! ft looked like half of a sphere. I could not make out any color of the craft due to the time of the evening. Interesting to say, the craft traveled SE just like the first had. I was much closer to this craft than the first but I would assume the speed of travel was 50 MPH.",
      "link": "http://www.nuforc.org/webreports/087/S87106.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb68",
      "summary": "Several bright  white & one red lights moving quickly over the Madison/Huntsville/Owens Cross Road area 1 light not a plane.",
      "city": "madison",
      "shape": "light",
      "date": "2012-02-10T00:00:00",
      "story": "Several bright  white & one red lights moving quickly over the Madison/Huntsville/Owens Cross Road area 1 light not a plane. I went outside to have a cigarette and looked up noticing what I thought was a plane coming into land at Huntsville Airport.  I live approximately 2 miles from the airport.  It was a very bright white light moving fairly fast.  It kind of looked like the same light when the space station passed over the area a few weeks ago.   But there was what appeared to be a plane following very close behind as if it were being pulled in a direct path by a wire.  This object had to white flashing lights and a red light.  They moved very quickly and were too high to be landing at the airport but also to close together to be two planes flying in a identical pattern.  This went directly over my home.   My husband and I video taped with our Iphone but you can only see for a brief second both lights and their close proximity.   I then called my brother who lives in OCR, AL and told him to go look outside and sure enough he saw it come over the mountain and it appeared to be hea! ding in a South/West direction.  He to agreed this was not two planes flying that close together.",
      "link": "http://www.nuforc.org/webreports/087/S87121.html",
      "state": "AL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bebc5",
      "summary": "Oval, Glowing Chartreuse / Green Craft with Rotating / Blinking Red to Yellow lights along the side",
      "city": "madison",
      "shape": "oval",
      "date": "2013-08-30T00:00:00",
      "story": "Oval, Glowing Chartreuse / Green Craft with Rotating / Blinking Red to Yellow lights along the side Craft Description: Oval, Glowing Chartreuse / Green in color.  Rotating / Blinking Red to Yellow lights along the side of the craft.  The craft was very large.  Estimated size would be over 1,500 feet in diameter, with the wider diameter (Oval shape) acting as a wing appearance.  The craft emitted NO Noise.  Estimated elevation of the craft: approximately 1,000-2,000 feet. The craft appeared from the west and flew over the two of us in an Eastern direction.  Duration: 30 seconds.  When the craft disappeared from view, immediately following (less than one minute), three Huey helicopters followed the craft from West to East, on a chasing path. Witnesses:  Two 7th graders, playing in the snow after dinner.",
      "link": "http://www.nuforc.org/webreports/100/S100959.html",
      "state": "ME",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bedb3",
      "summary": "UFO sighting in Huntsville/Madison, AL  Just after finishing dinner on 7-29-2013, I walked out onto the front porch. It was approximate",
      "city": "madison",
      "shape": "egg",
      "date": "2013-08-30T00:00:00",
      "story": "UFO sighting in Huntsville/Madison, AL  Just after finishing dinner on 7-29-2013, I walked out onto the front porch. It was approximately 6:35pm (18:35) CST. I glanced up because I saw movement, and was facing due north. I saw a commercial airliner, like a 737, that was flying eastward, from near the center of my field of view. I watched it fly for a second, following the vapor trail backwards. When I reached the end of the vapor trail, I noticed an egg-shaped object hovering, just to the left of center, and a little higher than the original flight path of the plane. The egg-shaped object had an aura, or shadow, or pulse, to or about it. Within a blink of an eye, 2 orbs (circular) appeared just to the right and higher of the egg-shaped object. The egg-shaped object had a grayish or metallic appearance, while the orbs had a brighter white glow. The egg-shaped object was larger than the commercial airliner. It was larger in diameter, and similar to the difference in size depicted in the picture. The orbs were very similar in scale to the picture, as is the jet. The main object began to move westward, and had erratic movement. In my excitement,  I evaluated everything in a brief second.  I did not have a quality video camera, and feared that a cell phone picture would provide poor quality, and little details.  I made a decision to go for binoculars, in hopes of being able to see the object better. I ran for the binoculars, returning and seeing all three objects.  The plane was gone by now. At that instant, the orbs disappeared.  I threw the binoculars up to my eyes, and was not able to immediately locate the object.  I pulled them down to re-gain a fix on its location again, found it with my naked eyes, and watched it enter into the clouds. If it appears on any radar, it would be very close to the Alabama Tennessee state line, at about 6:35pm, on Monday, July 29th, 2013. I have attempted to re-create what I saw.  The picture should explain the movement, location, and surrounding veiw point.  The picture is pretty close to what I saw. I tried to provide as much detail as possible.",
      "link": "http://www.nuforc.org/webreports/100/S100645.html",
      "state": "AL",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bedb2",
      "summary": "UFO sighting in Huntsville/Madison, AL",
      "city": "madison",
      "shape": "egg",
      "date": "2013-08-30T00:00:00",
      "story": "UFO sighting in Huntsville/Madison, AL &lt;br&gt;&lt;br&gt;  Just after finishing dinner on 7-29-2013, I walked out onto the front porch. It was approximately 6:35pm (18:35) CST. I glanced up because I saw movement, and was facing due north.  I saw a commercial airliner, like a 737, that was flying eastward, from near the center of my field of view.  I watched it fly for a second, following the vapor trail backwards. When I reached the end of the vapor trail, I noticed an egg-shaped object hovering, just to the left of center, and a little higher than the original flight path of the plane. The egg-shaped object had an aura, or shadow, or pulse, to or about it. Within a blink of an eye, 2 orbs (circular) appeared just to the right and higher of the egg-shaped object. The egg-shaped object had a grayish or metallic appearance, while the orbs had a brighter white glow. The egg-shaped object was larger than the commercial airliner. It was larger in diameter, and similar to the difference in size depicted in the picture. The orbs were very similar in scale to the picture, as is the jet. The main object began to move westward, and had erratic movement. In my excitement,  I evaluated everything in a brief second.  I did not have a quality video camera, and feared that a cell phone picture would provide poor quality, and little details.  I made a decision to go for binoculars, in hopes of being able to see the object better. I ran for the binoculars, returning and seeing all three objects.  The plane was gone by now. At that instant, the orbs disappeared.  I threw the binoculars up to my eyes, and was not able to immediately locate the object.  I pulled them down to re-gain a fix on its location again, found it with my naked eyes, and watched it enter into the clouds. If it appears on any radar, it would be very close to the Alabama Tennessee state line, at about 6:35pm, on Monday, July 29th, 2013. I have attempted to re-create what I saw.  The picture should explain the movement, location, and surrounding view point.  The picture is pretty close to what I saw.  I tried to provide as much detail as possible.",
      "link": "http://www.nuforc.org/webreports/100/S100643.html",
      "state": "AL",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bedd3",
      "summary": "3 transparent gray diamond apperitions with red lights hovering high in the night sky",
      "city": "madison",
      "shape": "diamond",
      "date": "2013-08-30T00:00:00",
      "story": "3 transparent gray diamond apperitions with red lights hovering high in the night sky I, my husband, my husbands daughter, and my two dogs were out for our regular evening walk through East high schools football field.  As we were just entering the field from north fifth street, my husband started shouting \"look up!  Look straight above!\".  It took me and my husbands daughter a second or two to spot what he was seeing.   All three of us saw three diamond shaped apparitions with red lights on the outside edges of all three diamonds.  All three were hovering/moving in unison, with the front object being slightly in front of the other two.  The objects appeared to be almost transparently gray in color, and appeared to be quite high in the sky.  As we all three watched, they continued moving forward quite quickly, and seemed to disappear into the atmosphere.  The event lasted all of about ten seconds.  We all agreed that it was a very strange occurrence, and that none of us had ever seen anything like it before.  The apparitions are a b! it hard to describe, but I have described them as best as I could.  Thank you for the opportunity to report.",
      "link": "http://www.nuforc.org/webreports/100/S100679.html",
      "state": "WI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bee9e",
      "summary": "Three orange/red fireballs over Madison's West Side.",
      "city": "madison",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Three orange/red fireballs over Madison's West Side. Was driving eastbound on the Beltline and clearly saw 2 fireballs hovering in the sky.  They were orange in the center and radiating red around the outside.  They were large compared to red lights from airplane towers in the background.  They were situated between the Capitol and the West Side.  I got off on Midvale where I picked up my husband.  We drove to an elementary school on Midvale where we stopped our car and got out to look.  At this point there were now 3 fireballs. 2 hovering next to each other, and one moving southwest very slowly toward Fitchburg/Verona.  They were fairly low (helicopter height), but made no noise and did not move except for the one traveling slowly.   We got back in our car to see if we could drive closer to them, got on the Beltline continuing toward the downtown area, and lost sight of them.",
      "link": "http://www.nuforc.org/webreports/100/S100771.html",
      "state": "WI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf02c",
      "summary": "White saucer seen near Madison.",
      "city": "madison",
      "shape": "disk",
      "date": "2013-05-15T00:00:00",
      "story": "White saucer seen near Madison I was driving on I90/I39 towards Madison.  About 2 miles from the 12/18 Exit, I looked across the Southbound lanes up into the sky.  I saw a big, bright white saucer shaped object just hovering.  I did not see it long as I was driving, although I looked back several times.  I looked again this morning, to make sure that I was not mistaken and actually saw something else, but there is nothing there, no lights at all.",
      "link": "http://www.nuforc.org/webreports/096/S96621.html",
      "state": "WI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3ab",
      "summary": "Triangle flying object with 2 lights on the back switching one to the other never at the same time.",
      "city": "madison",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "Triangle flying object with 2 lights on the back switching one to the other never at the same time. Saw a triangle shaped object heading west.  It had two lights flashing back and forth but no other lights on it. It was dark but you could see the shape of the craft. There were several people standing in the parking lot observing this object including me. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95594.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf607",
      "summary": "Orange Glowing Fireball moved South, then North, then disappeared.",
      "city": "madison",
      "shape": "fireball",
      "date": "2013-09-09T00:00:00",
      "story": "Orange Glowing Fireball moved South, then North, then disappeared. We were watching neighbors with fireworks when we noticed, very high up in the sky over the Long Island Sound, a white moving object.  I said \"Look, it's a UFO\" and all of a sudden, the orange fireball came down toward us so we could have a good look at it!   It sounds strange, but I thought it heard me!   We were amazed and also kind of scared.  It hovered about and then eventually moved north in the sky to fade away.",
      "link": "http://www.nuforc.org/webreports/101/S101967.html",
      "state": "CT",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5dc",
      "summary": "Five fireball looking objects appeared moving at high speeds from the northwest moving south, southeast. One after another they moved a",
      "city": "madison",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Five fireball looking objects appeared moving at high speeds from the northwest moving south, southeast.   One after another they moved along the same flight path.  The space between objects looked to be some significant amount of miles, though the last of them was flying under cumulonimbus clouds.   All appeared as a golden orange fireball.   One solo object of the very same nature was spotted at approximately the same time and flight path two weeks prior. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101235.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf706",
      "summary": "Attached video.  Yes Not quality but it shows what was seen.  Don't laugh.",
      "city": "madison",
      "shape": "circle",
      "date": "2013-10-14T00:00:00",
      "story": "attached video.  Yes Not quality but it shows what was seen.  Don't laugh. Already posted, video link is.  http://youtu.be/qRfbShtF0is.   http://www.youtube.com/watch?v=qRfbShtF0is&feature=youtu.be",
      "link": "http://www.nuforc.org/webreports/102/S102951.html",
      "state": "AL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf705",
      "summary": "UFO sighting, Madison, AL Friday 4 October 2013",
      "city": "madison",
      "shape": "cylinder",
      "date": "2013-10-14T00:00:00",
      "story": "UFO sighting, Madison, AL, Friday 4 October 2013 My daughter called me from a separate location from where my wife and I were located and reported lights in the sky.  She was with her friend and friends family a few miles north from our location.  Our address is Amsterdam Pl, Madison, AL.  Number of witnesses at the other location were around 4.  They witnessed approx. 30 lights in the sky.  The location of the UFOs were North to North West of our location.  The angle of the objects were moving right to left from the horizon (north to north west in straight movement upward).  No erratic movement was witnessed.  The lights were red to orange and in a circular pattern.   The lights finally moved, what appeared to be out of the atmosphere.  At the same time of the sighting a plane was coming in to land at Huntsville Intl airport, from the North.  The airport is situated to the south of our location.  I do have cell phone recording of the event.   At first my phone would not allow a recording, which is very strange, as my phone usually always allows the recording selection.   Finally, my phone allowed some coverage to be recorded. ((NUFORC Note:  We spoke via telephone with the witness, and he sounded quite credible to us.  He is former military, and has considerable experience with flying military aircraft.  We suspect that he is an exceptionally capable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102950.html",
      "state": "AL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6f9",
      "summary": "What was the strange silent rectangle shaped  flying object in the sky.",
      "city": "madison",
      "shape": "rectangle",
      "date": "2013-08-30T00:00:00",
      "story": "What was the strange silent rectangle shaped  flying object in the sky. I was on my way to my storage unit, when I observed a silver & black rectangle flying west.  I could not hear any engine sounds.  It moved silent but really fast I could not keep up with it in my truck.  It flew out of sight as fast as it came.  Really weird I can't explain it and feel very weird and crazy, when I try to explain to family  .I don't dare tell friends I was just wondering if anyone else saw what I saw the morning  o k",
      "link": "http://www.nuforc.org/webreports/101/S101363.html",
      "state": "WI",
      "duration": "I was on way to my storag"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9af",
      "summary": "Orange orb flew silently overhead, flickered, then went out; replace by black object.",
      "city": "madison",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Orange orb flew silently overhead, flickered, then went out; replace by black object. A bright orange orb crossed the sky at what appeared to be a relatively constant speed and elevation. I estimate the elevation was 500 to 1000 feet.  The flight path was straight. It was completely silent. It was the size of a pea held at arms length.  The light was very orange, and kind of dancing; like plasma.  At times, a small more defined and brighter center point of light was visible within the larger object.  In the last minute of observation, the light vanish and reappeared a couple of times, keeping the same flight path.  Also during this last minute, the overall shape was morphing more; at one point looking like a cone.  Before disappearing behind trees, the light went out completely; but at that instant a larger black object was briefly visible.  I'm pretty sure this was not retinal fatigue, but an actual black object.  We all saw this.  Although it was nighttime, the black object was visible against the dark sky, but only for 2 to 3 seconds before it went behind trees.",
      "link": "http://www.nuforc.org/webreports/101/S101381.html",
      "state": "NH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb5e",
      "summary": "Bright orangy-red and white light in SW sky over Madison, WI, travelling slowly and then disappearing.",
      "city": "madison",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Bright orangy-red and white light in SW sky over Madison, WI, travelling slowly and then disappearing. In the Southwestern sky, we observed a large light in the sky that had an orange/red cast to it.  The shape wasn't quite round.   The light moved steadily, but slowly, towards the Southeast.   We watched it progress for about 5 minutes, at which time it got smaller and then disappeared from sight.   We waited to see if it would reappear, thinking their might be some cloud cover at high altitude, but it did not.",
      "link": "http://www.nuforc.org/webreports/101/S101420.html",
      "state": "WI",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd67",
      "summary": "Ball of flames moving quickly across the sky",
      "city": "madison",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "Ball of flames moving quickly across the sky An isolated ball of flames rose from over the treetops on the horizon.  It continued to rise and move across the sky at a good pace.  Three distinct tongues of flame were seen.  No balloon or craft was visible.",
      "link": "http://www.nuforc.org/webreports/098/S98215.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bffc5",
      "summary": "Red lights coming into sky",
      "city": "madison",
      "shape": "circle",
      "date": "2013-09-30T00:00:00",
      "story": "red lights coming into sky Red lights coming from ground into air in northeast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102804.html",
      "state": "WI",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c0300",
      "summary": "Saw a light like a star moving south non blinking disappeared.  5 min later saw 2 more one moving south and one moving east.",
      "city": "madison",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Saw a light like a star moving south non blinking disappeared.   5 min later saw 2 more one moving south and one moving east, the one moving east has a slightly red color to it and was moving much faster,   the one moving south disappeared in the same place as the first the one moving east just disappeared right after the one moving south.   At one point the second set crossed paths or at least one moved over the top of other.   I have seen lights like this before, really don't know what they are.  I checked Madison flights, Milwaukee and ohair flights and nothing meets time line plus they did not blink at all.  No sound. ((NUFORC Note:  Witness later corrected date to July 1st, 2013.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99081.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0316",
      "summary": "I was laying in my bed, when I looked up at my window and all of a sudden I saw a huge craft flying very fast and very low to the groun",
      "city": "madison",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "I was laying in my bed, when I looked up at my window and all of a sudden I saw a huge craft flying very fast and very low to the ground. It had three very huge lights on it, it was triangle shaped and it was going west about three hundred miles an hour and I saw it for only a few seconds.   But my roommates were on their way home earlier today about seven e o'clock and they called and told me they had seen a triangle shaped object in the sky.  Not thinking only a few hours later I would be seeing the strange object. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95922.html",
      "state": "AL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c0415",
      "summary": "Red light hovering in sky over Lake Mendota, too high and could not be tower as it was over the lake, constant red light (no blinking)",
      "city": "madison",
      "shape": "fireball",
      "date": "2013-02-18T00:00:00",
      "story": "Red light hovering in sky over Lake Mendota, too high and could not be tower as it was over the lake, constant red light (no blinking) I was stopped by the light at the Doty St/Wisconsin Ave. intersection facing Lake Mendota.  Saw red light hovering in sky straight ahead over Lake Mendota.  It was too high to be a tower with a light on it, and there is no tower there.  I've lived on that street and therefore know there's no tower there, and I've never seen any light there before.  It remained in the same place while I sat at the light.  It also did NOT twinkle or blink; the light was constant.  Possibly a helicopter, but it was a very windy and somewhat snowy night.  I grew up 15 minutes from O'Hare Airport most of my life so I am aware of typical air traffic. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96259.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0719",
      "summary": "3 orange glowing lights hovering moving slowly to the Northeast near Madison/ Deforest WI",
      "city": "madison",
      "shape": "formation",
      "date": "2014-01-10T00:00:00",
      "story": "3 orange glowing lights hovering moving slowly to the Northeast near Madison/ Deforest WI On January 8th, I was driving home from work in Madison, WI (6pm).  I was heading North on hwy 51 towards the interstate 90/94. and I notice to orange glow lights.  I saw them for a brief moment as I turn onto the Interstate heading North toward the Dells.  I then saw it again (I was near or just pasted hwy 19 now) this time much more clearer and their were three orange glow lights moving very slowly North East.  They had a color very similar to street lights (Orange in color rather big) One of the lights faded then the next one until it disappeared.  It look like it was hovering and moving very slowly  to the North east.  As the last light went out it started to move faster and faded.     I told people at work the following day  and a coworker was in Portage Northeast of were I was an described the same thing except is was later in the evening around 9PM.  This location is near Madison Airport, however this was not an Airplane!!  it was moving to slow and for too long of a time (at least a minute)..   I am now a believer of UFO's and if this was some type of Military Aircraft it was huge and it could hover.   Truly something amazing...",
      "link": "http://www.nuforc.org/webreports/106/S106161.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f5e",
      "summary": "Bright bluish white light slowly moves across sky and then disappears directly above me",
      "city": "madison",
      "shape": "light",
      "date": "2013-12-23T00:00:00",
      "story": "Bright bluish white light slowly moves across sky and then disappears directly above me I was driving to work on I-55 westbound, just past Illinois Rte 111.  I noticed a bright bluish white light hovering in the sky.  It was a solid light with a slight flicker.  It resembled a planet, similar to Venus.  As I travel this area daily, the light seemed out of place.  I watched closely and it appeared to slowly move toward my position.  I slowed to about 55 mph on the interstate and looked at the object through the top of my windshield.  Afraid that I was going to cause an accident in the early morning traffic, I decided to take the first available exit so that I could pull over and observe the object.  I exited onto Northbound Illinois Rte 203 with plans to stop at the Gateway Truck Plaza to watch the object.  While exiting, watching the light, and trying not to run off of the ramp, the light just disappeared.  I opened the moon roof and no longer saw the object.  I continued to the Gateway Truck Plaza and parked and exited my vehicle to scan the s! ky.  The sky was lightly cloudy, but above me, and where the object was, was completely clear.  The morning light was very faint and there were stars that were still visible.  After scanning the sky it was evident that nothing could be hiding behind clouds, as there were none in the area where the object was.  I would estimate at the time of disappearance, the object was at about 5000 ft.  I am a Mechanical Engineer and consider myself of sound mind.  What I witnessed this morning has left me perplexed.  Did anyone else see this? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105283.html",
      "state": "IL",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1007",
      "summary": "Star like obj. in mid air shining bright then dim then very bright for ~1 hour then just disappeared!  ((NUFORC Note:  Venus?  PD))",
      "city": "madison",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "Star like object in mid air shining bright then dim then very bright for about an hour then just disappeared! ((NUFORC Note:  The party who submitted the report elects to remain totally anonymous, and provides no contact information, so we are unable to contact the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103833.html",
      "state": "MS",
      "duration": "Hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c10eb",
      "summary": "Madison, WI - Lasers illuminate me on 2 different occasions.  Deafening wooshing sound.",
      "city": "madison",
      "shape": "unknown",
      "date": "2013-12-23T00:00:00",
      "story": "Madison, WI - Lasers illuminate me on 2 different occasions.  Deafening wooshing sound. I went outside for  break from wrapping presents when I noticed a red light, circular in shape, in the snow, next to my car.  It blinked 3 times and then disappeared.  It was 3 to 4 feet wide.   The reason I'm reporting  this is because after seeing this it reminded me of an experience I had a couple years ago, around 1am.  I was biking down Blount street toward the High Noon Saloon.  When I was on the sidewalk next to the MG&E coal castle I was engulfed in a green light or laser that was coming from quite a distance as I could tell the laser was breaking up around me.  I stopped my bike, and the green light stopped.  besides the Christmas similarities I find it rather disturbing.  I don't think it's alien in nature.   Another Madison experience I had about 6 to 8 years ago, we were sitting in my living room with the windows open when we heard a deafening wooshing sound.  It was spring or fall and lasted for 20 seconds.  Quite a while and was reported in the paper. I nev! er heard a conclusion I think the lights are Taran of nature... now the big question... why me?  And what was the wooshing sound?",
      "link": "http://www.nuforc.org/webreports/105/S105323.html",
      "state": "WI",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c11dc",
      "summary": "3 bright orange lights along side a bright white light.",
      "city": "madison",
      "shape": "triangle",
      "date": "2014-01-24T00:00:00",
      "story": "3 bright orange lights along side a bright white light We were driving down Sullivan Street towards Wall Triana when I suddenly noticed 3 very bright orange lights.  They were in a triangle formation.  There was another light that was out to the side a short distance from the triangle.  It was bright white and gone almost as fast as we saw it.  The white light and one of the orange lights disappeared as quick as if someone turned off a light switch.  The second lightt slowly faded away as did the third light about 10 seconds after the second.  My fiance tried to take a picture but his camera wouldnt focus for some reason...which is odd because he has a very nice camera on his phone.",
      "link": "http://www.nuforc.org/webreports/106/S106546.html",
      "state": "AL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1707",
      "summary": "Three Lights in formation suddenly split directions and disappear.",
      "city": "madison",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "Three Lights in formation suddenly split directions and disappear. Three of us, all Care Techs at Mendota Mental Health Institute, were out sailing on Lake Mendota, after our 3-11 shift.  The skipper and I were chatting.  He was at the tiller and I had the job of intermittently shining a flashlight onto the sail to let other vessels know we were out there.  At 01:00, we noticed we hadn't heard from our third member in a while.  We kidded him, asking if he was asleep, because he was laid back, face to the sky. He answered with a laugh and said he'd been watching three interesting lights. He pointed them out to us.  They were very high in the sky; if one horizon was three o'clock and the other horizon was nine o'clock, then these lights were now at about 11:30, nearly overhead. He said he'd been watching them for a long time and they hadn't changed formation.  They were arranged in a triangular formation, one light leading the other two, and they were just progressing across the sky.  It was hard to distinguish them from the stars on this clear night, they seemed to be just about that size and brightness.  We thought, at first, it was a plane; but then noted you could see the background stars between them as they went. The lights finally made it to directly overhead and they stopped.  They just sat in place for about half a minute.  Then, from a complete stop, they shot apart in three directions and out of sight in a brief second.  We had no idea what they were.  No one talked about seeing them the next day.  No coverage in the news media.",
      "link": "http://www.nuforc.org/webreports/109/S109591.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c19e6",
      "summary": "Strange red and green lights shaped and hovering.  ((NUFORC Note:  Possible \"twinkling\" star?  PD))",
      "city": "madison",
      "shape": "light",
      "date": "2014-07-11T00:00:00",
      "story": "Strange red and green lights shaped and hovering. strange red and green light flashing in sky, hovering for about 35 minutes sometimes moving forward and backward, up and down, and hovering. the green light was a circle the red light was a rectangle it looked like an L shape craft/lights.  The flashing was a long green flash then a quick red flash, it was repeating. before it flew away directly east the red light started to flash wildly or it seemed that way to me.  As it was leaving the red light became 3 small red lights. It looked like 2 rectangles, one on the left and one on the right with 1 small red square in the middle.  The shapes of the lights was very crisp and clear without distortion or halos.  For the clarity of the lights I think they where very very large but almost dim to be so clear. ((NUFORC Note:  Possible \"twinkling\" star?  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111234.html",
      "state": "IN",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b1c",
      "summary": "Red orb in night sky quickly disappeared.",
      "city": "madison",
      "shape": "circle",
      "date": "2014-07-05T00:00:00",
      "story": "red orb in night sky quickly disappeared One solid orb of red seen in the night sky.  Didn't strobe like a typical aircraft. Appears in the sky for about a minute and then rapidly disappeared over the course of 3to 4 seconds.  Initially headed north stand then turned south very quickly.",
      "link": "http://www.nuforc.org/webreports/110/S110939.html",
      "state": "AL",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d13",
      "summary": "Orange, large, three-object linear formation moving south to north approx. 60 degrees above horizon.",
      "city": "madison",
      "shape": "formation",
      "date": "2014-07-04T00:00:00",
      "story": "Orange, large, three-object linear formation moving south to north approx. 60 degrees above horizon. Three-object linear formation seen on 6/30/14, approximately 21:50 Central.  Objects appeared approximately 60 degrees above the horizon, moving south to north.   Objects appeared perfectly evenly spaced, maybe ten seconds apart.  Size: equivalent to a pencil eraser held at arm's length.  Resembled a chase formation seen two years earlier involving the ISS, Russian rocket and ESA ATV resupply vehicle, except these objects were higher in the sky (60+ degrees), larger and brighter.   Also, no ISS sightings are scheduled for this region (Huntsville, AL)  until 7/12/14. All of these objects were the same color yellow-orange.   Very bright. No tail, no fireball. And no sound whatsoever.  As objects moved north they gained altitude, grew smaller and vanished.   Observer is a sober, master's-degreed human factors specialist with 25-plus years in manned space systems design (ISS program).",
      "link": "http://www.nuforc.org/webreports/110/S110746.html",
      "state": "AL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f0e",
      "summary": "Looking west from Madison Al (Limestone County)toward Decatur al. Approximately 21:30 central time. Cluster of 20 to 30 spheres.",
      "city": "madison",
      "shape": "formation",
      "date": "2014-06-04T00:00:00",
      "story": "Looking west from Madison, AL, (Limestone County) toward Decatur, AL.   Approximately 21:30 central time.  Cluster of 20 to 30 sphere like lights.  Cluster (staggered) seemed to travel north to north east for at least 1 minute then disappeared.  May have been military craft or hot air balloons... not 100% sure.  I have no way of knowing.  Very strange. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109838.html",
      "state": "AL",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c21b6",
      "summary": "ever be scared so much you cant get it out of your head .",
      "city": "madison",
      "shape": "circle",
      "date": "2014-04-11T00:00:00",
      "story": "ever be scared so much you cant get it out of your head . have reported this already once but seems that it was not listed.  Although i have seen others report the very same thing. a red ball with a yellow upper section.   Moved rapidly in many  directions was able to get a short video after watching it for about 10 minutes.  It held still long enough to get it on video.  Have submitted video once.",
      "link": "http://www.nuforc.org/webreports/108/S108469.html",
      "state": "CT",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2364",
      "summary": "IT WAS NOT SOMETHING OF THIS EARTH NOT MAN MADE FLYS AROUND LIKE THIS THING DID",
      "city": "madison",
      "shape": "circle",
      "date": "2014-04-04T00:00:00",
      "story": "IT WAS NOT SOMETHING OF THIS EARTH NOT MAN MADE FLYS AROUND LIKE THIS THING DID OBJECT APPEARED IN THE SOUTH SOUTHWEST SKY AT ABOUT 2 O'CLOCK POSITION.  OBSERVED FOR ONLY 10 MIN.  CIRCULAR IN SHAPE NOTE THAT IT WAS AT A LONG DISTANCE AWAY SO NOT SURE OF SHAPE.  OBJECT MOVED IN STRANGE WAYS SO IT COULD NOT HAVE BEEN MAN MADE AIRCRAFT.  IT SEEMED TO BE A RED AN YELLOW COLOR.  I HAD TAKEN A VIDEO OF THIS OBJECT, IT'S BRIEF AND IT'S HARD TO TELL WHAT IT WAS BUT ITS MOVEMENT WAS WEIRD GOING IN MANY DIRECTIONS.  I HAD SAW A CRESENT MOON SHAPED OBJECT IF YOU CAN IMAGINE A CRESENT MOON UPSIDE SIDE DOWN WITH THE CRESENT AT THE TOP.  THAT WAS BACK IN LATE OCTOBER.  BOTH TIMES THE SKY WAS CLEAR AND JUST BEFORE SUNRISE",
      "link": "http://www.nuforc.org/webreports/108/S108166.html",
      "state": "CT",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c26a8",
      "summary": "White light chased by two jets from airport",
      "city": "madison",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "White light chased by two jets from airport. Bright white light flashing in the sky and moving at an incredible rate of speed, heading south east from Westport/Waunakee area.   It flew by going south and then just stopped completely in the air, and eventually started heading back north again.  Within a few minutes, two F-16-style jets took off from the nearby airport and went after it, but the white light then went straight up into the clouds and didn't come back.",
      "link": "http://www.nuforc.org/webreports/115/S115110.html",
      "state": "WI",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2764",
      "summary": "Light blue sphere seen moving from west to east in a zig zag pattern over a northern Nashville suburb in a clear sky.",
      "city": "madison",
      "shape": "sphere",
      "date": "2014-10-03T00:00:00",
      "story": "Light blue sphere seen moving from west to east in a zig zag pattern over a northern Nashville suburb in a clear sky. At approximately 11:00 am, I looked up at the sky to view the contrail patterns made by several jets flying overhead.  I took a picture and then noticed a light blue sphere that was moving in a zig zag pattern through the contrails from left to right.  At times, it was emitting a purple crescent-shaped haze.  I took several pictures of it and after approximately 15 minutes, it disappeared behind one of the contrails and was no longer seen.",
      "link": "http://www.nuforc.org/webreports/113/S113924.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c292a",
      "summary": "Friend says wow 2 shooting stars, i did not see but i know it wasnt stars",
      "city": "madison",
      "shape": "unknown",
      "date": "2014-11-14T00:00:00",
      "story": "friend says wow 2 shooting stars, i did not see but i know it wasn't stars friend seen 2 glowing objects fly through the sky he exclaimed it was shooting stars but i think otherwise. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115272.html",
      "state": "AL",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c29cf",
      "summary": "While walking easterly on a cold night, I saw this bright object moving from high in the southern sky, to medium low in the eastern sky",
      "city": "madison",
      "shape": "fireball",
      "date": "2014-11-21T00:00:00",
      "story": "While walking easterly on a cold night, I saw this bright object moving from high in the southern sky, to medium low in the eastern sky.   It had a meteor-like fireball with glowing tail appearance that increased in size and brightness as it moved through the sky on a steady linear route. It seemed to move slower than the usual misnamed \"shooting star\" of summers on the lake. Tonight's version was pretty and significant, but it was not a dramatic night-sky event.",
      "link": "http://www.nuforc.org/webreports/115/S115427.html",
      "state": "WI",
      "duration": "00:00:04"
    },
    {
      "_id": "64d005f478aba2ec5a3c29e7",
      "summary": "As I was driving towards Madison, WI, I noticed a light moving across the sky.  It was just one single light, moving fast.",
      "city": "madison",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "As I was driving towards madison wi I noticed a light moving across the sky.  It was just one single light, it was moving faster than any plane I've seen, when it suddenly completely stopped for about 4 seconds, then it shot towards the ground, went through a cloud, and completely dissipated it.",
      "link": "http://www.nuforc.org/webreports/115/S115069.html",
      "state": "WI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d67",
      "summary": "Another fireball sighting in the sky maybe two.",
      "city": "madison",
      "shape": "fireball",
      "date": "2014-08-29T00:00:00",
      "story": "another fireball sighting in the sky maybe two . was going to work at three in the morning . at my back stairs i looked up and saw a streak of light.  At that time also saw a jet flying in almost in the same direction.  Looking just above the tree line observed a fireball shaped thing.  It moved around in many directions . up, down, speed off sideways at a very fast speed than return to same spot and hover moving around just a little bit.   I am seeing a pattern forming here.  Seems that these objects appear while there is no moon.  I have tried to video this but lack the proper video tools to document what is going on here . this is a real case and should not be ignored.  I have seen this once before.  Same craft same area just about.",
      "link": "http://www.nuforc.org/webreports/112/S112814.html",
      "state": "CT",
      "duration": "15:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f36",
      "summary": "Mistaken sighting for two stars in the eastern sky just before sunrise.  ((NUFORC Note:  Jupiter and Venus??  PD))",
      "city": "madison",
      "shape": "unknown",
      "date": "2014-08-22T00:00:00",
      "story": "Mistaken sighting for two stars (sic.  Planets?) in the eastern sky just before sunrise. I had made a report of a sighting  in Madison, Connecticut on the 18 of this month.  Sorry to say it was 2 stars in the eastern sky.   The other sighting earlier in the year was for sure a real sighting.  Guess I am hoping for another sighting as grand as the first one.  Sorry to bother you with a false sighting.",
      "link": "http://www.nuforc.org/webreports/112/S112632.html",
      "state": "CT",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f5e",
      "summary": "THERE IS SOMETHING OUT THERE WATCHING US. OBSERVING THIS PLANET.  ((NUFORC Note:  Jupiter & Venus.  PD))",
      "city": "madison",
      "shape": "unknown",
      "date": "2014-08-22T00:00:00",
      "story": "THERE IS SOMETHING OUT THERE WATCHING US. OBSERVING THIS PLANET WHILE DELIVERING MY MORNING PAPERS LIKE I DO EVERY MORNING.  I HAD WITNESSED A OBJECT IN THE LOW HORIZON.  SEEMED TO BE TWO LIGHTS ONE BIGGER THAN THE OTHER.  ATTEMPTED TO VIDEO THE SITE BUT DID NOT PICK UP THE IMAGE.   I DID TAKE PHOTOS AS WELL.  BECAUSE OF THE PHONE I USED ITS JUST A BLUR WHEN ZOOMED IN ON. THIS OBJECT DID NOT MOVE NO NOISE AND OBSERVED IT FOR AWHILE .  I STILL HAD A JOB TO DO SO I TRIED TO KEEP AN EYE ON IT FROM TIME TO TIME .IT DID NOT MOVE IT REMAINED IN THE SAME POSITION SO IT WAS NOT A STAR THAT I KNOW OF IN THAT PART OF THE SKY.  IT WAS VISIBLE TILL SUN UP .   I CAN SWEAR THAT I DID SEE WHAT APPEARED TO BE A SILVERY CLOUD SHAPE AFTER SUNRISE.  IT WAS STILL IN THE VERY SAME PLACE AS WHEN I FIRST SAW IT.  I HAVE HAD A SEEN A ANOTHER OBJECT BEFORE AWHILE BACK BUT WAS MUCH FARTHER AWAY AND IN ANOTHER POSITION IN THE SKY AND THAT ONE WAS MOVING AROUND.  I BELIEVE THAT I HAD THREE SIGHTING THAT I CANNOT EXPLAIN.FUNNY THING IS NO ONE ELSE SEEMS TO HAVE WITNESSED THIS.   WERE NOT ALONG HERE AND WHO EVER THEY ARE SEEM TO OUTSMART OUR RADAR I GUESS .  HAS MUCH TO DO WITH THE SHAPE OF THE CRAFT I THINK. ((NUFORC Note:  Witness corrects his conclusion about the sighting.  PD)) ((ADDENDUM FROM WITNESS)) Mistaken sighting for two stars (sic.  Planets?) in the eastern sky just before sunrise. I had made a report of a sighting  in Madison, Connecticut on the 18 of this month.  Sorry to say it was 2 stars in the eastern sky.   The other sighting earlier in the year was for sure a real sighting.  Guess I am hoping for another sighting as grand as the first one.  Sorry to bother you with a false sighting. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/112/S112597.html",
      "state": "CT",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3023",
      "summary": "Silent, triangular-shaped object hovering in mid-air.",
      "city": "madison",
      "shape": "triangle",
      "date": "2014-08-08T00:00:00",
      "story": "Silent, triangular-shaped object hovering in mid-air Husband and I were driving east on Hoy Road, saw large triangular-shaped object to the north of us (we thought it was a plane coming in --too low for the distance, which is what led us to even notice it--to land at Madison local airport until we realized that it wasn't moving).  It looked to be about 100 feet off the ground.   It had 2 sets of 3 white lights on the points of the triangle.  It was not moving; it seemed to be just hanging there in midair.  No sound.   We immediately turned north into the next street to follow it/get a closer look, but it had disappeared (which felt impossible, considering that it was there just a few seconds before).",
      "link": "http://www.nuforc.org/webreports/112/S112152.html",
      "state": "MS",
      "duration": "2-3:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c30a2",
      "summary": "Bright light quickly disappears.  ((NUFORC Note:  Possible meteor, we wonder.  PD))",
      "city": "madison",
      "shape": "light",
      "date": "2014-08-08T00:00:00",
      "story": "Bright light quickly disappears. Bright lights streak across the sky in downward trajectory, then disappear with no sound.  Looked like what a flare looks like when fired, but with out any large illumination.  ((NUFORC Note:  Possible meteor, we wonder.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112142.html",
      "state": "AL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3150",
      "summary": "Circular craft (looks like stars) floats above lake Monona, another pulls up next, then rushes away.",
      "city": "madison",
      "shape": "circle",
      "date": "2014-08-08T00:00:00",
      "story": "Circular craft (looks like stars) floats above lake Monona, another pulls up next, then rushes away. We noticed a round object with numerous lights hovering over the capitol area which didn't look unlike a group of stars.   Then another circular object, same size and lighting structure very slowly pulled up next to it almost as if it were a satellite.   When they were next to each other the newer one sped up and was well in front of the first one, then sped off to the north at incredible speed.",
      "link": "http://www.nuforc.org/webreports/112/S112287.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c33ce",
      "summary": "3 bright whitish lights that changed formation moved slowly above the tree-line toward Lake Erie then disappeared.",
      "city": "madison",
      "shape": "changing",
      "date": "2015-03-06T00:00:00",
      "story": "3 bright whitish lights that changed formation moved slowly above the tree-line toward Lake Erie then disappeared. 2/23/15, 8:30 pm.  Madison/Perry/Painesville, OH. My son and I saw a very large triangular formation very low in the western sky.  Three bright whitish  lights seemed to change formation from a triangle to an L-shape and seemed to appear as one light at times.    Difficult to estimate size, maybe as large as a football field; and maybe a mile away at first, then it would seem closer, then move farther away again.  It was very erratic in shape, and distance.   It was probably more than one object.   We got in the car and followed it as it moved slowly northward toward Lake Erie.  It made no sound, and we kept losing sight of it due to the tree line.  We finally lost sight of it close to Painesville over Lake Erie near the Perry Nuclear Plant.   The sky is clear tonight and the quarter moon was quite high above the formation.   This thing was too large and low in the sky to be a plane or helicopter. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117467.html",
      "state": "OH",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e86",
      "summary": "from my office overlooking downtown and state street.  this dark object traveled from north to south above the buildings but below the",
      "city": "madison",
      "shape": "changing",
      "date": "2015-06-15T00:00:00",
      "story": "from my office overlooking downtown and state street.  this dark object traveled from north to south above the buildings but below the low clouds.  It didn't change shape (but that is not a choice given) it didn't have any distinct geometric shape, but looked like a larger cap with a dangling down piece.   It appeared to move with the wind and not under any power.  If I had to guess I would have said it was a mostly deflated balloon with the helium in the top part and the bottom dangly part uninflated.   I first thought it was a parachutist, but when it got closer it was obviously not and it was  traveling horizontally, not down",
      "link": "http://www.nuforc.org/webreports/119/S119429.html",
      "state": "WI",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3fc0",
      "summary": "Spotted triangular craft floating to the right of beltline. Went out of view for thirty seconds, couldn't find again.",
      "city": "madison",
      "shape": "triangle",
      "date": "2015-05-22T00:00:00",
      "story": "Spotted triangular craft floating to the right of beltline.  Went out of view for thirty seconds, couldn't find again. I was riding on the beltline, heading west.  From the Verona Road exit, to the Odana Road exit which we exited on, me and the one person I was with noticed three different colored lights that appeared to be hovering to the west.  I kept my eyes on it, and as our angle changed, I noticed the triangular shape.  When we exit, we attempt to spot it again but it was gone. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119023.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4196",
      "summary": "A shining green orb appearing suddenly in the sky in Madison, WI.",
      "city": "madison",
      "shape": "circle",
      "date": "2015-04-30T00:00:00",
      "story": "A shining green orb appearing suddenly in the sky in Madison, WI. I was walking east down Williamson Street early in the morning.  I was just approaching the Yahara canal, when I witnessed a green luminescent appear suddenly in the sky over the condos on First Street.  It was about the size of a dime in an outstretched hand. It then moved fairly slowly in a North to South path at about a 40 degree angle to the horizon.  I could lost sight of it when it went behind the trees on the horizon. In the yard across the street, there was a dog that noticed the light too.  I didn't notice any dog before I saw the light, but it got up and ran to the property line after the object appeared.",
      "link": "http://www.nuforc.org/webreports/118/S118609.html",
      "state": "WI",
      "duration": "5-6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c433d",
      "summary": "Spot light turned off, triangle pattern lights, helicopter noise, dog bark, shooting stars",
      "city": "madison",
      "shape": "triangle",
      "date": "2015-11-19T00:00:00",
      "story": "Spot light turned off, triangle pattern lights, helicopter noise, dog bark, shooting stars Was playing disc golf at night with lights and from the peek of hole 2 we saw a spot light above some trees in the hole 12 area.  It sounded like a helicopter.  It turned off the spot light and it had more of a spinning sound.  Could see blue lights that seemed to move in a triangle shape.  There was a red light in the middle.  My dog started barking as it got closer. He has never barked at an air craft before.  This course is in the country around some farms. We sometimes play at a course near the air port and he has never barked.  We saw shooting starts through out the night. I was stunned by the sight so much I thought I should grab my phone but could not look away.  It was near us then just a light in the distance heading south. My friend and I decided it was not a normal craft and it had to be something from the government or a UFO. Sort of sounded like what this person described:  http://www.nuforc.org/webreports/123/S123336.html   I didn't remember the exact night but I know it was that week I listed this.  I just found this site and I have never felt more sure what I saw was not normal.",
      "link": "http://www.nuforc.org/webreports/124/S124112.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4fa1",
      "summary": "On bike path just west of Black Hawk Golf Course.  I looked up in the sky and it appeared to look like a shooting star.  Then I could t",
      "city": "madison",
      "shape": "disk",
      "date": "2016-03-18T00:00:00",
      "story": "On Bike Path just west of Black Hawk Golf Course.  I looked up in the sky and it appeared to look like a shooting star.  Then I could tell it was disc-shaped.   Then It banked to my left.  Then it disappeared.  It glowed orange yellow as though it was reflecting the light from the Sun.   I was looking in the direction toward Lake Mendota, and University Avenue was on my Right.   When I got home my cell phone said it was 9:07 pm.  The time on the microwave and oven was 8:36 as was the time on my girlfriend's computer.",
      "link": "http://www.nuforc.org/webreports/126/S126412.html",
      "state": "WI",
      "duration": "1-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5443",
      "summary": "Sphere with red and green lights hovering over Ross Barnett Reservoir in Madison, MS.  ((NUFORC Note:  Sirius??  PD))",
      "city": "madison",
      "shape": "sphere",
      "date": "2015-12-21T00:00:00",
      "story": "Sphere with Red and Green lights hovering over Ross Barnett Reservoir in Madison, MS. ((NUFORC Note:  Witness provides a minimum of information, so we can only guess at what he might have witnessed.  However, We wonder whether he might have been observing a so-called \"twinkling\" star, and possibly the star, Sirius.  We don't know what time Sirius might have risen above the southeast horizon, in the area where the sighting occurred.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124746.html",
      "state": "MS",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5456",
      "summary": "TWO DISC SHAPED UFO'S CHANGING FROM RED TO GREEN IN MADISON, MS.",
      "city": "madison",
      "shape": "disk",
      "date": "2015-12-21T00:00:00",
      "story": "TWO DISC SHAPED UFO'S CHANGING FROM RED TO GREEN IN MADISON, MS. Last night Thursday, December 17th, 2015, (7:00 PM).  I ran into Walgreen's in Madison, MS, leaving my father in the car, when I returned I apologized for taking so long (10 min.), his reply was that’s ok, I have been watching the weirdest things in the sky, he said look over there and where he pointed there were two disc shaped objects with lights changing from red to green.  They looked like they were hovering over Home Depot, it put chills all over me!   We sat there a few more minutes (7:15 PM) and decided to leave and go out of the city where there would be no light pollution to watch them.  We drove about a mile and lost them, after getting to an area that was dark and a clear shot of the sky we parked and looked for another 5 or so minutes without seeing anything, I then left heading west after a couple of miles I turned back east and drove to a top of a hill where we saw them again (7:35 PM), they were much further away to the west and not as close together but were stationary and changing from red, green to white.  There were several planes in the sky so you could defiantly tell they were not planes. After another 5 or so minute’s they shot off to the West.  I decided to report this sighting after my father called me to tell me someone from the Madison Airport reported seeing several UFO’s last night.   This is not my first time seeing this type of thing, I grew up about 15 miles west of Madison, MS, and in the time I lived in Flora, MS (21 yrs.) I saw more than I can count Unidentified Flying Objects mostly in the Big Black River bottom west of town.  There have been several national stories done on all of the UFO sightings in that area.  This is the first time in 28-30 years I have seen any, but knowing from many years ago you could see a lot of them for a few months and then not see any for months or longer.  I believe if you will watch you will continue to see them for a while.   I will be watching for more sightings in the weeks to come with a good camera in hand.",
      "link": "http://www.nuforc.org/webreports/124/S124744.html",
      "state": "MS",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5455",
      "summary": "Red, spherical lights moving slowly in the sky.",
      "city": "madison",
      "shape": "sphere",
      "date": "2015-12-21T00:00:00",
      "story": "Red, spherical lights moving slowly in the sky. The lead mechanic for ((deleted)) in Madison, MS, came inside the FBO and requested that all the employees on staff step outside to witness the objects.  We initially saw five, red, spherical objects in the western sky traveling southbound at a rapid but steady pace.  (The objects were approximately two hand widths vertical distance from ground level). The red light on the objects was not blinking.  All of the objects began to disappear (their red lights faded slowly, as if burning out) once they all reached the same point in the sky.  A sixth and final object emerged, appearing to lag behind the initial objects but heading in the same direction and traveling at the same approximate speed.  It, too, disappeared once it reached the same point in the sky.  The entire event lasted between four and seven minutes.   The sighting was witnessed at an airport by personnel who have had numerous years in and around aircraft. This was not typical aircraft behavior.",
      "link": "http://www.nuforc.org/webreports/124/S124735.html",
      "state": "MS",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5472",
      "summary": "Green circle/orb in sky while going East on hwy 12/18.",
      "city": "madison",
      "shape": "circle",
      "date": "2015-12-17T00:00:00",
      "story": "Green circle/orb in sky while going East on hwy 12/18. Saw a green circle/orb that suddenly appeared in the sky while I was going East on hwy 12/18.  It stayed in place for about a second, shot into the sky at incredible speed and disappeared.",
      "link": "http://www.nuforc.org/webreports/124/S124622.html",
      "state": "WI",
      "duration": "4-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5471",
      "summary": "Bright green orb/circle shot into sky as I drove down the highway.",
      "city": "madison",
      "shape": "circle",
      "date": "2015-12-17T00:00:00",
      "story": "Bright green orb/circle shot into sky as I drove down the highway. Saw a bright green orb/circle while I was going East on 12/18 hwy.  The circle appeared out of nowhere, stayed in place for about a second, shot up into the sky and disappeared.   The speed of the orb was incredibly fast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124619.html",
      "state": "WI",
      "duration": "4-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c565a",
      "summary": "Orange orb sighting at night that lasted about 5 minutes in Madison, Wisconsin.",
      "city": "madison",
      "shape": "circle",
      "date": "2016-07-08T00:00:00",
      "story": "Orange orb sighting at night that lasted about 5 minutes in Madison, Wisconsin. The sighting took place at approximately 9:45pm on July 3, 2016 in Madison Wisconsin. I have never seen a UFO before but I sighted this one because I was looking for early firework displays.  Also, the night was particularly dark and visibility was crystal clear.  I could see several bright stars and at least two planets. While outside, I was enjoying constellations that I don’t normally see because the night sky was so dark that night.  I saw what I thought was a planet until I noticed that it was moving. It was an orange orb which was slowly moving across the sky.  I don’t believe it was a paper lantern that someone let go to celebrate the holiday because it was a perfect circle with a steady orange glow.  It stayed at the same altitude and speed as it flew over my head.  There was no sound. Since I was hoping to record a fireworks display, I had my camera ready to use.  I was able to film the orb from when I first notice it moving until it began quickly accelerating straight up until it went out of site.  There were no flashing lights, so it was not an airplane. Unfortunately, the recording showed no details and would not make good evidence.  I need to get a better camera for next time.  There will be a next time. Thanks for reading this account.",
      "link": "http://www.nuforc.org/webreports/128/S128239.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c57fc",
      "summary": "Glowing fire ball very bright and fast just disappeared after a few minutes.",
      "city": "madison",
      "shape": "circle",
      "date": "2016-06-16T00:00:00",
      "story": "Glowing fire ball very bright and fast just disappeared after a few minutes. Looked like a round ball of fire changing colors red, white, orange, blue, moving very fast.  One went by then a minute later another then another.  When I zoomed in with my camera it looked like the sun.   Me and wife on our way home saw them at first I thought it was an airplane, but realized it was moving to fast.   We have never seen any kind of ufos before it was eerie.",
      "link": "http://www.nuforc.org/webreports/127/S127822.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c58fd",
      "summary": "Single bright white light defies thunderstorm, lands.",
      "city": "madison",
      "shape": "light",
      "date": "2016-06-01T00:00:00",
      "story": "Single bright white light defies thunderstorm, lands. I was shooting time lapse footage of a storm passing to the north-west of Madison, Wisconsin and caught something unusual coming out of the clouds.  A bright, single white light swooped out of a thundercloud, stopped and hovered in one spot, completely unaffected by the wind or rain.  It then seemed to put itself in reverse, backed up several hundred feet, and proceeded to drop straight down, apparently landing in the Pheasant Branch Creek Conservancy area.  The video only lasts 2 seconds, which I believe would be 2 to 3 minutes in real time. ((NUFORC Note:  We have watched the video several times, but see nothing that is suggestive to us of an alien space craft.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127582.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c591a",
      "summary": "I saw 5 lights floating in a formation.. They &quot;burned out&quot; or &quot;turned off&quot; one by one... I tok a video and tried to",
      "city": "madison",
      "shape": "formation",
      "date": "2016-06-01T00:00:00",
      "story": "I saw 5 lights floating in a formation..  They \"burned out,\" or \"turned off,\" one by one... I took a video. I saw 5 lights floating in a formation..  They \"burned out\" or \"turned off\" one by one...  I took a video and tried to figure a rational explanation..  Flares burn out amd shoot up quicker..  Lanterns do not stay in formation. The lights stayed in formation for the duration and went out one by one. Then I heard planes.",
      "link": "http://www.nuforc.org/webreports/127/S127600.html",
      "state": "WI",
      "duration": "155 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f6c",
      "summary": "Strange hovering light due East of Madison, SD. Sighting occurred at the dosc golf course at 7th and Blanche. Light hovered in the far",
      "city": "madison",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "Strange hovering light due East of Madison, SD.  Sighting occurred at the dosc golf course at 7th and Blanche.  Light hovered in the far distance and did not move.  Light changed from red to white, back and forth.  Noticed the light and took video.  After video was take, a 2nd light appeared and went towards the light.  It neared the first light and then veered away from it, out of sight.  The light was still there at 23:45.",
      "link": "http://www.nuforc.org/webreports/131/S131128.html",
      "state": "SD",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ffc",
      "summary": "Red balls of fire over Madison, WI",
      "city": "madison",
      "shape": "sphere",
      "date": "2016-10-27T00:00:00",
      "story": "Red balls of fire over Madison, WI Six reddish-orange spherical objects appearing to be engulfed in flames, low in the sky, traveling in an East-Southeast direction over the I-90/94 interchange at about the speed of an airplane.  They were silent.",
      "link": "http://www.nuforc.org/webreports/130/S130780.html",
      "state": "WI",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fe5",
      "summary": "Multi-colored, flashing lights spotted over Lake Erie in North sky.  Moved E to W and thought it was space station.",
      "city": "madison",
      "shape": "light",
      "date": "2016-10-21T00:00:00",
      "story": "multi colored, flashing lights spotted over lake erie in North sky.  Moved East to West and thought it was space station that I was searching for at 8:25 PM.  However this had many lights that seemed to fan out from rear.  The object was very far and about the size that I thought the space station would be.   I have Stargazer app and nothing was in the area.  THEN this moved up and down, and East to West!   Then seemed to be stationary out over lake in the North  East sky about 45 degrees up and faded in and out..  No clouds…  Disappears for a while, and it is back right now.   I have three witnesses and left messages with channel five and 19 in Cleveland.",
      "link": "http://www.nuforc.org/webreports/130/S130630.html",
      "state": "OH",
      "duration": "continuous"
    },
    {
      "_id": "64d005f478aba2ec5a3c6055",
      "summary": "Bright light with no warning or indicator lights heading east for approx. 2 minutes until light suddenly went out.",
      "city": "madison",
      "shape": "circle",
      "date": "2016-10-21T00:00:00",
      "story": "Bright light with no warning or indicator lights heading east for approx. 2 minutes, until light suddenly went out.   Distance was too great to gain detail or shape. ((ADDENDA FROM SOURCE OF REPORT)) #1:  I do apologize for the mistake, October 17, 2016 was the date.  Did not see a date entry for the form, I should have included it in the description..  #2:  Additional Details:  I was able to exclude the ISS and that night's rocket launch on the East Coast.   I am unaware of anything else that could have been visible directly over head at my location \"62060\" moving west to east ESE 104deg. ((END ADDENDA))",
      "link": "http://www.nuforc.org/webreports/130/S130668.html",
      "state": "IL",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6152",
      "summary": "3 bright orange objects, traveling in a straight line, W-NW, in Madison, WI.",
      "city": "madison",
      "shape": "unknown",
      "date": "2016-10-21T00:00:00",
      "story": "3 Bright Orange objects, travelng in a straight line, W-NW, in Madison, Wisconsin Saw 2 bright, orange lights to the north. Very slight flicker but constantly visible. No visible aircraft lights or identifiers.  Absolutely NO sound. 1 following the other about 4 fingers apart at arms length.  Direction was N-NW.  Easy to see the Big Dipper for reference. Unable to determine distance or altitude.  Second object turned in a arc toward the north and disappeared.  No clouds visible.  The first object continued N-NW, in a straight line.  A third object quickly appeared behind the first.  Separation again about 4 fingers width at arms length.  These continued now W-NW and again in a straight line. Speed about as fast as the International Space Station travels across the sky however these objects were brighter and orange.  The second object then appeared from the area where it had disappeared from, traveled south for a short time.  Then turned and followed the First and  Third object to the W-NW.  This object appeared to be traveling faster.  Until the objects went over the horizon, all three were visible, in a straight line.  Total visible time approx. 5 minutes.",
      "link": "http://www.nuforc.org/webreports/130/S130738.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6231",
      "summary": "Triangle ufo in Madison, WI.",
      "city": "madison",
      "shape": "triangle",
      "date": "2016-09-15T00:00:00",
      "story": "Triangle ufo in Madison, WI. Was driving on Wilson st.  And saw huge triangle shaped craft going slower then my vehicle that was goin 20-25mph and had lights as if it were a airplane but was the size of three planes and was triangle shaped my driver wouldn't stop and me my girlfriend and her friend saw it hovering over the park and started flying above building and went out of sight might of been drone cause it had airplane like lights flashing but was to low to the ground and traveling to slow for airplane I am not joking have no need to play games or lye just wanted to let you guys no maybe someone you guys no can look at radar or something and see what it was have a lot more info as well but have never done this Ito posting thank you hope I could of helped ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129832.html",
      "state": "WI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6269",
      "summary": "Moderately bright rapid flashing light - multi-colored",
      "city": "madison",
      "shape": "light",
      "date": "2016-09-09T00:00:00",
      "story": "Moderately bright rapid flashing light - multi-colored Light in the Southeastern sky.  Rapidly fluctuated between white blue purple, basically flashing very rapidly.   Used binoculars to get a better look but was very difficult to keep in frame due to how far away and small it was.   Kinda looked like a star would but the rapid flashing was very strange.",
      "link": "http://www.nuforc.org/webreports/129/S129662.html",
      "state": "WI",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3c65af",
      "summary": "Red/orange light seen east of Madison, WI.",
      "city": "madison",
      "shape": "light",
      "date": "2016-08-16T00:00:00",
      "story": "Red/orange light seen east of Madison, WI. I noticed a reddish/orange colored light directly east above the tree line from my balcony.  It looked strange enough for me to stop and actually watch for a few minutes.  It was hard to say how far it was from me, but I would guess between 2-5 miles...  Which would make the light technically above Cottage Grove, WI, and not Madison, WI, where I was located.  Estimated at about 500-700ft in the sky.  It was likely located above farm fields.  I watched the light hover for ~3 minutes before it began to fade into a smaller light.  It faded within 5 seconds to 20% of its original brightness and began moving south east and appeared to be moving further away.  It followed this path for about a minute before it disappeared into the sky above the tree line.  There were no clouds in the sky.",
      "link": "http://www.nuforc.org/webreports/129/S129243.html",
      "state": "WI",
      "duration": "<10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6589",
      "summary": "It was hovering, not moving for a while then slowly started crossing the lake. It came closer and was a triangle. We saw two lights, th",
      "city": "madison",
      "shape": "triangle",
      "date": "2016-08-02T00:00:00",
      "story": "It was hovering, not moving for a while then slowly started crossing the lake.  It came closer and was a triangle.  We saw two lights, three once it started crossing over the main Street.   Now, 10 minutes later, its thundering.  And now it just came back in the other flying faster away towards the east.  It is 22:07.",
      "link": "http://www.nuforc.org/webreports/128/S128726.html",
      "state": "WI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6828",
      "summary": "((NUFORC Note:  No information provided by the witness.  PD))",
      "city": "madison",
      "shape": "sphere",
      "date": "2017-04-07T00:00:00",
      "story": "((NUFORC Note:  No information provided by the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133338.html",
      "state": "WI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c69b0",
      "summary": "I think I saw a normal looking passenger jet in the air that wasn't moving.",
      "city": "madison",
      "shape": "other",
      "date": "2017-03-17T00:00:00",
      "story": "I think I saw a normal looking passenger jet in the air that wasn't moving I was driving north on Highway 51 just north of Madison, WI, at the intersection of Highway 51 and Windsor Rd.  This is about 4 Miles north of Dane County Regional Airport.   It was 8:30 at night and it was dark out.  What I'm pretty sure I saw was a normal passenger type jet at the same height it would be as if it were coming in for a landing at the Dane county airport, but it wasn't moving.   I thought it might be a helicopter at first, but as I got closer I thought it was much to big to be a helicopter, and when I got right next to it I could swear the shape was of a passenger jet and I could see the two jet engines under the wings.  It had some red and white lights that were steady, and some red and white lights that were blinking.   Nothing really seemed out of place except for the fact that it wasn't moving.  I had it in sight for about 30 seconds I guess as I drove up to it and passed it.   I turned around at the next exit a few miles down the road and drove back to see if it was still there, but it was gone by that time.",
      "link": "http://www.nuforc.org/webreports/133/S133138.html",
      "state": "WI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6998",
      "summary": "White orb seems to be circling around in the sky by the moon.  Wasn't there earlier until now.  It's no Airplane.  ((anonymous report))",
      "city": "madison",
      "shape": "light",
      "date": "2017-03-17T00:00:00",
      "story": "A white orb seems to be circling around in the sky by the moon.  It wasn't there earlier until now all of a sudden.  It's no Airplane ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  For some reason, source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133119.html",
      "state": "WI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6acc",
      "summary": "White orb over Lake Mendota, Madison, WI.  ((NUFORC Note:  Lens flare, caused by photographing the Sun.  PD))",
      "city": "madison",
      "shape": "circle",
      "date": "2017-02-10T00:00:00",
      "story": "White orb over Lake Mendota, Madison, WI. On Sunday, February 2nd, 2017, at exactly noon, I was walking near a lake in Madison, WI, and stopped to take photos of a jetstream in the sky.  Upon returning home and examining the photos, I found there to be an unexplainable object in one of the photos, which I did not consider to be a dust orb or other lighting issue.  I have emailed these photographs to the email address on this page.  I did not actually witness anything at the time the photos were taken, but thought that by submitting my experience here you may be able to determine if the object in the photo is a UFO or something else.   I thank you for your time in considering my query. ((NUFORC Note:  Lens flare, caused by photographing the Sun.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132507.html",
      "state": "WI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6bbe",
      "summary": "is one of many occasions. can spontaneously change direction, speed, altitude. Hovering occurs, many patterned lights underneath",
      "city": "madison",
      "shape": "unknown",
      "date": "2017-01-19T00:00:00",
      "story": "is one of many occasions.  can spontaneously change direction, speed, altitude.  Hovering occurs, many patterned lights underneath ((NUFORC Note:  For some reason, source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132186.html",
      "state": "MS",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6eda",
      "summary": "I was in 9th grade and had fallen asleep during a movie at a friend's house who live in the same dark and quiet neighborhood.",
      "city": "madison",
      "shape": "changing",
      "date": "2017-08-11T00:00:00",
      "story": "I was in 9th grade and had fallen asleep during a movie at a friend's house who live in the same dark and quiet neighborhood.  I woke around 3 am, freaked because I had missed curfew and hurried to leave.  My friend lived at the end of a cul-de-sacred and for whatever reason, at the stop sign, I stopped and I turned completely around and looked up and there IT was... a giant bright light gold ball that looked to be far out in the sky, there was no light pollution and on clear nights like this one you could even see the milky way... anyway it shot off all these colors, then split into two identical balls, each shining with more colors, then it went back to one and then just warped into space it seemed, just disappearing...  it maybe took a few seconds to happen, it happened so fast.  I was so scared and awed at the same time. I knew this was not anything I could have ever imagined nor anything many people had ever seen. I would give anything to see it again and t! o this day always gaze into the night sky for another chance-glance glimpse whatever you would call it lol.  Anyway I had a walk ahead of me and I nearly knocked on someone's door at 3 am but decided not to despite my fear and racing heart, I usually took a little short cut through a little patch of woods but this time decided to stay in the view of the houses. As soon as I made it home, which seemed the trip home took a lifetime, I ran through the house right into my parents room and shook mom awake and told her what I'd seen, then again all morning, I was too scared to sleep alone so I begged for mom to sleep in my room but sadly she declined so I was petrified until the house was awake again, then everyone at school the next day... and still nearly 17 years since it's happened I haven't forgotten and I never will.If it was as far out in the sky as I perceived then this thing/s had to have been enormous....  but I wonder, why did it let me see it?  what would make a scaredy! cat who was always a little apprehensive about being out unde! r the bi g night sky when alone pause and take the time to turn completely  around and look up? fear is a pretty tangible thing when you're alone in the dark... also no noise, no hum or buzz that I recall just a very  brief and petrifying astonished wonder-struck couple of moments.... that will be with me until the day my life draws to an end. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135600.html",
      "state": "MS",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c72b2",
      "summary": "Saw lights flashing in the sky non-stop for hours, freaked my dog out.  ((anonymous report))",
      "city": "madison",
      "shape": "flash",
      "date": "2017-07-07T00:00:00",
      "story": "Saw lights flashing in the sky non-stop for hours, freaked my dog out I was sitting in my living room, and noticed flashing lights outside of my window.  At first I assumed it was just lightning, but lightning usually doesn't flash non-stop for hours at a time.  I walked outside to find the source of the flashing light, thinking maybe it was a tow truck or something.   Upon walking outside, there was no apparent source of the flashing lights.  I looked up but clouds were blocking any chance of me being able to distinguish what was causing the flashing.   My dog, who usually runs to the door when asked if she wants to go out, refused to leave the house, even when bribed with treats. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134999.html",
      "state": "WI",
      "duration": "3-4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c78b7",
      "summary": "Bright sphere (dot) slowly moving due east.  ((NUFORC Note:  Possible sighting of ISS??  PD))",
      "city": "madison",
      "shape": "fireball",
      "date": "2017-12-04T00:00:00",
      "story": "Bright Sphere (dot) slowly moving due east. Bright white sphere (dot) slowly moving due east.  Too bright to be a satellite.  If on same path its still in Bama.  was 5 min ago. Not a meteor. ((NUFORC Note:  ISS was visible from this location at 17:22-17-24 hrs..  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137440.html",
      "state": "AL",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c799f",
      "summary": "Hovering jet over Malt House.",
      "city": "madison",
      "shape": "triangle",
      "date": "2017-12-04T00:00:00",
      "story": "Hovering jet over Malt House A friend and I saw a small craft flying only twenty feet above the Malt House off of East Washington.  As it came closer it stopped for two seconds and then continued on.  It was grey, almost looked like a jet with a black bubble on top.  It only made a low hum.  It was only big enough for one person.",
      "link": "http://www.nuforc.org/webreports/137/S137524.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7aaf",
      "summary": "I looked up in the sky and saw one bright light- then it turned into 3! At first I thought it was a firework ((anonymous report))",
      "city": "madison",
      "shape": "light",
      "date": "2017-11-17T00:00:00",
      "story": "I looked up in the sky and saw one bright light- then it turned into 3!  At first I thought it was a firework, but there was no sound and the lights didn't fall- they just disappeared. Some ppl told me it was probably flares from Redstone, but I think it was something more...  This is my first ever sighting! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137251.html",
      "state": "AL",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b44",
      "summary": "Fast moving boomerang shaped object.",
      "city": "madison",
      "shape": "chevron",
      "date": "2017-11-09T00:00:00",
      "story": "Fast moving boomerang shaped object A large boomerang or chevron shaped object flying east to west.  Altitude/air speed unknown, but it was moving very fast and it was large.  No sound.  It was blacked out with no running lights.  The shape of the object against a background of stars was the only thing that gave it away.   As I watched it fly overhead and turned west to watch it fly away, a smaller and faster object from the Northeast flew in behind it.  All of this was over in 5 seconds.   I'm 50, x-military and have never seen anything like this before. ((ADDENDUM FROM WITNESS)) Hi Peter, It was 2x the size of a full moon, however boomerang shaped and completely dark, but duller than the night sky.  I picked it up almost directly above me at 70 degrees and followed it to about 140, until I lost it.   It blocked star light as passed.  It was moving very very fast and the size / speed / altitude did not equate properly in my mind based on anything I've previously experienced.  Then something smaller with a dull white light closed on it from a few degrees North East.  It all took 4-5 seconds max.  There was no sound. The only think I equate it to would be a B2 at 2,000 feet traveling at Mach 10 with no sound.  Impossible. I don't know that I'll call the media, but I will be checking local media for any other reports over the next few days. Regards,  ((name deleted)) ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/137/S137165.html",
      "state": "WI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fe7",
      "summary": "Mirror like crescent that disappeared.",
      "city": "madison",
      "shape": "other",
      "date": "2018-04-13T00:00:00",
      "story": "Mirror like crescent that disappeared. My wife and I were in the car, stopped waiting to turn.  My wife saw a crescent shaped object in the sky to our southeast, above the tree line.  The sun was behind the trees.  She described the object as looking like light being reflected off a mirrored crescent with a smaller object attached on the bottom.  After a second or two, it disappeared suddenly.  The car was not moving during the sighting.",
      "link": "http://www.nuforc.org/webreports/139/S139371.html",
      "state": "NC",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c83f5",
      "summary": "Cigar shaped object seen over Madison, WI,  10/16/18 at 3:50 PM",
      "city": "madison",
      "shape": "cigar",
      "date": "2018-10-18T00:00:00",
      "story": "Cigar shaped object seen over Madison WI 10/16/18 at 3:50PM I was leaving work at 3:50 PM on 10/16/2018 just passing the Costco store in Middleton heading east on Eagle Drive.  I looked up and observed what I first thought was a passenger jet coming over the city from the Dane County airport.  Something seemed a bit off, so I looked again and was unable to distinguish the presence of either wings or a tail section.   I pulled over on Eagle Drive next to Costco and observed what looked like a large cylindrical object, about the size of an A320 if not a bit longer.  It was white in color and aerodynamically tapered at both ends and had what appeared to be a red vertical stripe that separated the forward going half from the trailing half.  There appeared to be no windows or other openings.  It was moving in a North Westerly direction and was traveling very slowly.   The duration of the sighting was approximately one to one and a half minutes or so.   As it was heading off in the distance I saw a smaller aircraft the details of which I could not determine that looked as though it was flying at a higher altitude and moving in an East Southeasterly direction.  My background is an Electronics Technician.",
      "link": "http://www.nuforc.org/webreports/143/S143506.html",
      "state": "WI",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c87d3",
      "summary": "Lime green object flew quickly from NW to SE over the beltline near the Southtown exit. We lost sight of it as it flew behind trees.",
      "city": "madison",
      "shape": "chevron",
      "date": "2018-07-13T00:00:00",
      "story": "Lime green object flew quickly from NW to SE over the beltline near the Southtown exit.  We lost sight of it as it flew behind trees.",
      "link": "http://www.nuforc.org/webreports/142/S142156.html",
      "state": "WI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8af2",
      "summary": "Two lights merged into one and then faded out.  ((anonymous report))",
      "city": "madison",
      "shape": "light",
      "date": "2019-09-06T00:00:00",
      "story": "Two lights merged into one and then faded out We were driving towards home on Dayton Rd. In Madison.  Off to the West, appeared to be close to the Madison/Painesville line,  I saw two lights, at first glance, thought they were stars but then noticed they just looked a bit different and too large.  Within seconds the lights slowly moved towards each other, then merged into one and then faded out completely.  Did not see them again.  The light was not bright like that of a plane, it was more ambient.   Hard to describe, but definitely was odd. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148636.html",
      "state": "OH",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ceb",
      "summary": "A strange round cloud with a trail behind it.",
      "city": "madison",
      "shape": "sphere",
      "date": "2019-02-07T00:00:00",
      "story": "I was walking my dog on Middlebeach Road around 6:00am this morning, when I noticed what appeared to be a strange round cloud with a trail behind it.  It appeared to to be leaving a trail behind it.  It stood out because in the Eastern sky, the sun was rising and I had just taken a few Photos and videos of sunrise.  It was 29 degrees, under partly cloudy skies .   A man happened to be jogging by me while I was seeing this and I stopped him to ask him what he thought it was.  He was as perplexed as I was.  I continued to photograph the object.  It appeared to move extremely slowly and was leaving a cloud like trail behind it.  There were no lights.  There was no sound other than the sound of the water and at times I would seem to blend into the sky and then reappear.  I would put the object somewhere over Long Island sound or over Nassau County, NY.  I have at least 30 still shots taken with iPhone 10s Plus 256. ((NUFORC Note:  We spoke via telephone with the witness, and he seemed to us to be quite sober-minded and eloquent.  He occupies a very responsible job, and we suspect he is an exceptionally qualified, and reliable, witness.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144790.html",
      "state": "CT",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9270",
      "summary": "A formation of flashing lights hovering high in the air.",
      "city": "madison",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "A formation of flashing lights hovering high in the air. I looked out my window very late last night and saw an odd pattern of 3 flashing lights in the distance. I couldn't make out the exact shape because it was so far away. It was hovering in the air for a long time and making very small irregular movements. It didn't appear to be a satellite, as it moved back and forth. It might have been a drone, however it was very very high up. The lights flashed and appeared mostly white. Occasionally reddish, blueish, and greenish. I probably could have gone outside for a better look, but I was a bit spooked. I couldn't get a good picture of it. It hovered for a long time and gradually moved to the west. It had kinda a glow / aura around it.",
      "link": "http://www.nuforc.org/webreports/149/S149901.html",
      "state": "MS",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c9333",
      "summary": "A red fireball that looked like an orb was seen traveling at a slow pace moving from East to West in Madison Mississippi.",
      "city": "madison",
      "shape": "fireball",
      "date": "2019-12-01T00:00:00",
      "story": "A red fireball that looked like an orb was seen traveling at a slow pace moving from East to West in Madison Mississippi. On the morning of October 26, 2019, I was traveling on I-55 in my van to Madison Mississippi, when I saw a red fireball that looked like an orb. The red orb was traveling at a slow pace moving from East to West in Madison Mississippi. This sighting lasted approximately one minute.",
      "link": "http://www.nuforc.org/webreports/150/S150055.html",
      "state": "MS",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c97b6",
      "summary": "Pictures I took show an odd looking object in the sky surrounded by bright light.",
      "city": "madison",
      "shape": "disk",
      "date": "2019-12-01T00:00:00",
      "story": "Pictures I took show an odd looking object in the sky surrounded by bright light. I was outside of a store called “JoAnn Fabrics” facing west when I noticed a nice sunset. I then proceeded to take two pictures from my phone camara, one right after another, holding one higher in the air than the other. Upon viewing the pictures, I immediately noticed that a light with some sort of saucer type shape, above right to the sun, was apparent that was not there when I took the pictures. I am assuming that this may be the moon, however, there were no clouds in the sky to cover the lower half of a would be moon, and the object seems to have risen much higher in the sky in the 2nd picture, which doesn’t make sense for the object being the moon as the pictures were taken seconds apart. Please let me know if this is a valid UFO or if it is some sort of weather anomaly. If it could be identified as a UFO, I can only assume the reason for it not being visible by eye would be because of some sort of cloaking?  Thank you.",
      "link": "http://www.nuforc.org/webreports/151/S151090.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c9826",
      "summary": "I saw one fireball at a time come out of the southeast over the treetops flying low-bright slowly heading northwest",
      "city": "madison",
      "shape": "fireball",
      "date": "2019-10-04T00:00:00",
      "story": "I saw one fireball at a time come out of the southeast over the treetops flying low-bright slowly heading northwest.",
      "link": "http://www.nuforc.org/webreports/149/S149095.html",
      "state": "WI",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9932",
      "summary": "I was smoking a cigerett and saw a sesna (small airplaine) flying . I looked up to look at it as it was flying low.   I then noticed a",
      "city": "madison",
      "shape": "light",
      "date": "2019-10-04T00:00:00",
      "story": "I was smoking a cigerett and saw a sesna (small airplaine) flying . I looked up to look at it as it was flying low.   I then noticed a very bright light high in the atmosphere.  Moving very quickly then turned off at a 45 degree angle and picked up speed then disappeared.  It was a clear morning with the sun shining.   There was no visible object (airplaine, or metal) it was just a bright light in the southern sky and as bright as it was it looked as if the light should have been bouncing off of whatever it was , from the north...it was super weird. No sound, just a bright light ..",
      "link": "http://www.nuforc.org/webreports/149/S149313.html",
      "state": "ME",
      "duration": "15 seconds"
    }
  ]
}