{
  "city": "memphis",
  "fetch_timestamp": "2025-07-12T14:26:27.139513",
  "record_count": 85,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b42bc",
      "summary": "Huge disk seen hovering dead still in sky with 6 white lights on bottom and rotating red lights, Memphis, TN",
      "city": "memphis",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "Huge disk seen hovering dead still in sky with 6 white lights on bottom and rotating red lights, Memphis, TN I was smoking a cig in front yard looking in the sky.  All of sudden 6 bright white lights turned on in the sky directly above me.  I was maybe 30 feet from being directly underneath it.  It just floated and made no noise at all and i was very scared.  Then a min into it a red light started going around the disk in a counter clockwise motion, every second, all the way around on the part of disk that goes from the bottom part up. This totally freaked me out and I ran inside to get my mom to show her.  When we got outside....1 min later...it had to be 20 miles away headed towards Frayser (memphis area) but still very visible in plain view and mother saw it and ran inside scared.....this object was as big as 3 planes probably.  Then later on during the night i heard a high pitched ZzZzZzZ noise in my head and just knew the thing was back, but i was to scared to go outside. I ran around the house knowing it was out there.   The noise reoccured at on other point during the night. I got up both times it happened. The sheets were sticking to me cause of all the sweating i was doing.  The last time i was up i had a lighter than air feeling occur to me, really hard to explain.  Then after a few days i completly pushed it out of my memmory untill recently.  I could never convince anyone about what i saw except my mom cause she saw it.  I have never seen anything before and doubt i will again.  But this was the wildest experience in my life. ((NUFORC Note:  Witness indicates that the date of the event is approximate; provides minimum of contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49709.html",
      "state": "TN",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4882",
      "summary": "UFO heading east over sighted over Memphis.",
      "city": "memphis",
      "shape": "unknown",
      "date": "2019-08-23T00:00:00",
      "story": "UFO heading east over sighted over Memphis. Slower than a meteor, faster than Airplane, heading east to northeast.  Swerve pattern across the sky, not regular, so, pilot, but too fast for human craft with light.   We have observed meteors, satellite, planets, and airplanes.  This was different.  . Cool, but a bit scary. Does anyone know of a possible explanation?  If not, please log it. Thx ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148344.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4880",
      "summary": "UFO heading east over sighted over Memphis.",
      "city": "memphis",
      "shape": "unknown",
      "date": "2019-08-23T00:00:00",
      "story": "UFO heading east over sighted over Memphis. Slower than a meteor, faster than Airplane, heading east to northeast.  Swirf pattern across the sky, not regular,  so, pilot, but too fast for human craft with light.  We have observed meteors, satellite, planets, and airplanes.  This was different.  . Cool, but a bit scary.   Does anyone know of a possible explanation?  If not, please log it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))Thx",
      "link": "http://www.nuforc.org/webreports/148/S148339.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fc6",
      "summary": "An orange sphere was seen moving quickly across the sky over Memphis.",
      "city": "memphis",
      "shape": "sphere",
      "date": "2019-03-29T00:00:00",
      "story": "An orange sphere was seen moving quickly across the sky over Memphis. I was walking my dogs behind my house, as I do every night, and noticed an orange sphere moving very quickly across the sky in the south-southwest direction.  It appeared to be very high in the sky.  It did not have any of the characteristics of the aircraft that Memphis sees in its skies coming and going to MEMH. Firstly, it did not have flashing lights.  When the planes are headed directly towards your line of sight, you cannot see flashing lights, but they tend to appear yellowish-white; this craft was a solid, orange ball.   Secondly, it was going way too fast relative to its  apparent altitude.  Had it been a plane at that altitude, it would have been moving much slower across the sky.  Thirdly, when it finally dawned on me that what I was looking at might actually be a UFO, and I reached into my pocket to take out my phone, it instantly disappeared; as if you had just flipped a switch.  It was completely gone.  Since there were no clouds in the sky during this observation, it couldn’t have gone behind a cloud.  The entire observation lasted only 10-12 seconds. For years I have made a minor hobby out of watching the FedEx planes coming and going in the Memphis skies, and I am completely certain that what I saw tonight, March 21, 2019, was not a plane or a helicopter.",
      "link": "http://www.nuforc.org/webreports/145/S145367.html",
      "state": "TN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5687",
      "summary": "around shape object in memphis.please this is no lie.....",
      "city": "memphis",
      "shape": "oval",
      "date": "2007-11-28T00:00:00",
      "story": "around shape object in memphis.please this is no lie..... it was cold out  i had broke up with girlfriend and was sleeping in my truck.there was this humming in my speakers. i tried turnning off my radio. but it was already off. i looked out my back window and saw this huge orange ball. it had no trail behind it.and it was coming down fast.it took about 5 minutes from first site until i felt a concusion thruogh out my body. i felt it more than heard it.about 2 minutes later i heard all kinds of sireins.i tried to go in the direction i saw it fall but my stupid truck had transmission problems and wonted go in gear.not from the ufo. it had problems prior.i never heard what it was on the news.i think it landed somewhere around millington,or frazier.i tell this in tuth as im writing this now.",
      "link": "http://www.nuforc.org/webreports/059/S59899.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c41",
      "summary": "Large green fireball with sparks trailing behind",
      "city": "memphis",
      "shape": "fireball",
      "date": "2008-06-12T00:00:00",
      "story": "Large green fireball with sparks trailing behind I was walking on the golf course next to my mother in law's apartment. At first I was looking straight ahead, but all of the sudden a large green fireball about 50 times the size of a normal star averted my attention to the sky. The object was bright green fire that came to a point at the tail end. It had sparks flailing off of the it as it shot across the sky. I was on the phone with my boyfriend who was delivering pizzas across town and he saw the same thing, and we are at least 30 miles away from each other. His experience was that he saw the fireball separate into four different distinct smaller objects, only to converge seconds later back into one fireball before disappearing. The speed of the object was much faster than a plane, but it lingered in the sky for at least 20 seconds before completely disappearing. There was no sound, and it did not breach the horizon, it simply disappeared! I'm freaked out.",
      "link": "http://www.nuforc.org/webreports/062/S62689.html",
      "state": "TN",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b5dd1",
      "summary": "UFO filmed; huge flash of light over Memphis, TN",
      "city": "memphis",
      "shape": "",
      "date": "2008-06-12T00:00:00",
      "story": "UFO filmed; huge flash of light over Memphis, TN A huge blue flash of light filling at least part of the horizon was seen in the Memphis, TN area sky Saturday night. Dozens of citizens called Channel 5 WMC-TV to report this light and on the 10 p.m. newscast, WMC also showed a video shot by a local viewer that shows an unidentified object flying across the night sky just prior to the flash of light. However, WMC has not opted to post this video on their website (indeed, they haven't even bothered to have their televised report listed), at least at this point in time. Viewers have written WMC to request a link be posted to the film. The light was seen at least as far away as Olive Branch, MS, and from that vantage point, appeared to be north of Memphis.",
      "link": "http://www.nuforc.org/webreports/062/S62983.html",
      "state": "TN",
      "duration": "15 sec?"
    },
    {
      "_id": "64d005f478aba2ec5a3b60f9",
      "summary": "Three lights in a triangular formation.",
      "city": "memphis",
      "shape": "triangle",
      "date": "2008-02-14T00:00:00",
      "story": "Three lights in a triangular formation. I am a 38 year old female.  When I was 16-17 years old I saw something unlike anything I have ever seen. It was very late at night and my parents where sleeping. I was in the living room watching television.  I decided to look out the window at the stars. The view from our window was unblocked and the sky was full of stars that night. I had only been looking for a few seconds when I suddenly saw what I believe was a UFO.  Three lights in a triangular pattern appeared in the sky. At the top of the triangle shape was a red light. At the bottom in each corner was a white/yellowish color light. The two lights in the bottom corner left there position at a rapid rate of speed. The light in the left corner moved to the left and the right light moved to the right in the same formation at the same time. Both lights went out away from the red light. The two lights suddenly returned to their exact positions as before and the whole thing disappeared as if someone just turned it off.  All I saw was lights in the form of a triangle. If it was a ship of some kind it had no other lights on it except the three that I described. I have never seen anything like this before or after that night. Considering my age reporting what I saw at the time was of no importance to me. Now that I am older I feel it is important that someone knows of what I saw. If it was a UFO or not maybe the information I have to offer could be of some kind of help or assistance to our world or country.  I reported my sighting as one or possibly  three sightings because the two lights separated from there position as if they where separate from it but had a connection to the red light at the top somehow. From what I saw I believe it to be one main ship with others that detach . Thank you for time reading this and I hope I wrote it where you can understand what I saw. I’m more then glad to offer more detail if needed. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61273.html",
      "state": "TN",
      "duration": "1-2 minutea"
    },
    {
      "_id": "64d005f478aba2ec5a3b61ce",
      "summary": "Bright white light in rural area of Memphis in 1976 responds to kid's and their sealed beam flashlight.",
      "city": "memphis",
      "shape": "light",
      "date": "2006-07-16T00:00:00",
      "story": "Bright white light in rural area of Memphis in 1976 responds to kid's and their sealed beam flashlight. Myself, two friends and the mother of one of those friends witnessed in the summer of 1976 an unusually bright, white light moving extremely slow from south to north just above the trees and it seemed to be moving parallel to a fairly new street that ran through our neighborhood. It had just become dark (around 9 pm, the time we had to be back in our parent's sight)and my friends and I had begun settling down for the night on the front porch and were repairing our bicycles after a long hard day of BMXing and Evel Keneveling. We had our bicycles under extreme maintenance and one of us lost a small part in the shrubbery around the porch. One friend went down two doors to his home and returned with a 12 volt sealed beam lantern. We were looking for the part for several minutes and then found it.  As I got up and walked out on the sidewalk in front of the house, I looked to the east and noticed this bright light hanging in the sky just behind the very top of a tree. I said nothing and went back to my mechanic duties when my friend noticed it a few seconds later. She asked if that was the police helicopter that had frequented our neighborhood on regular patrol during the summers. (We would run out in the street and wave at the pilots and they would blink the carbon-arc spot at us to say hello. Those were the days...). Curiously I looked again to see if that was the same light I had noticed a few seconds earlier and it was. I said that if that were the helicopter, we would here it as close as it was like we always did. My other friend, with sealed beam flashlight still in hand, turned it on and shined it on the \"object\" through the tree top. I told him I didn't think that was a good idea, but he being a year older (15), over rode that idea and did it anyway.  At this point the \"object\" slowly moved out from behind the tree top as if to get a better look at us or our light source and just hung there quietly.  He turned off his light, and about 2 seconds later the \"object\" began to move and he shined his light on it again and it stopped. I excitedly told my other friend to get our parents and she ran in and only returned with her mother.  She saw the \"object\" and assured us it was an airplane or our helicopter friends until we questioned her as to where the moving BEAM of blue-white light was and pointed out that the white light was WAY too bright for normal running lights on an airplane, it was WAY too low to be an aircraft of any kind without making noise or kicking up dust.  It was not until my older friend  said, \"...and watch this.\" as he shined his light on it again and it began to slowly move (east) our way that she was convinced and noticeably shaken when he turned off the light and the \"object\" stopped! Here she nervously ordered us all in the house (mine being the closest)and to my parents surprise who thought were playing jokes. She also told them something strange was low in the sky and relatively close but they, still showing no interest chose not to investigate. We all four returned to the porch expecting it to be gone saw it still quietly hanging in the sky right where we left it.  We studied it for about 30 seconds when it began to move north. My older friend again shined his bright flashlight toward the \"object\" and it stopped once again.  We were all beginning to become concerned at this time when it began to resume it's northward course along a north-south street but slowly gaining altitude until it got to which is now by my estimation, 50-60 feet above the rooftops.  My older friend tried to chase it on his bicycle for a closer look and my other friend and I scaled a brick swimming pool fence and stood atop it to get a better look as it flew off over the neighborhood and sped out of sight within 1 or 2 seconds and disappearing after making an extremely sharp turn to the west. My friend's mother then used our phone to call Memphis International tower to see if anything was flying around our area. After what seemed to me to be about 15 minutes on the phone with them they said they could find nothing unusual. She retold these events to my parents as we kids returned to the front porch hoping it would come back but as far as I know, none of us ever spoke of this event again among ourselves or to anyone else. I'm just wondering if I am the only one that remembers this now.... ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50885.html",
      "state": "TN",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6622",
      "summary": "Four bright orange lights in a perfect square that was slowly drifting before separating and disappearing.",
      "city": "memphis",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "Four bright orange lights in a perfect square that was slowly drifting before separating and disappearing. My family and I were finishing Christmas Eve dinner when my aunt went to the car, ran back in, and said we had to come see something. In the sky were four bright orange lights, slightly larger than airplane lights or stars- the largest lights in the sky but very high up.  The odd thing was that they created a perfect square that was drifting slowly through the air.  We assumed they were part of one craft until they all began to drift off in other directions and quickly faded out.  The fact that they kept the square formation so perfectly was what got everyone.  Some neighbors down the street were watching, but we didn't ask them about it.",
      "link": "http://www.nuforc.org/webreports/060/S60551.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c10",
      "summary": "bright ball of white light falling in western sky",
      "city": "memphis",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "bright ball of white light falling in western sky My daughter and I were driving down Lamar Avenue heading west to turn left onto Willett. We both saw a bright bluish white ball of light in the western sky falling from right to left with a very slight arc.  We kept going straight instead of turning as originally intended to see if we could see anything but it had disappeared below the tree line.",
      "link": "http://www.nuforc.org/webreports/058/S58787.html",
      "state": "TN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d93",
      "summary": "this object became visible as i was standing in front of my house facing it to the north and the object was moving in the north-west to",
      "city": "memphis",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "this object became visible as i was standing in front of my house facing it to the north and the object was moving in the north-west to south -east direction. it was approx. twice to three time as bright as the current illumination of the moon, which is quite bright tonight. the object was approx. 2000 - 3000 feet above the ground as i was able to see other aircraft at the same time flying quite far above this object.  Also, i was in the u.s. army and have seen aircraft at this altitude and know at what altitude paratroopers jump from, and the object was in this range, as i have jumped from. This object traveled MUCH slower than any aircraft I have ever seen.  So slow in fact that I had figured if it were one of ours, it would have stalled.  The object passed over head without a sound.  It then dimmed from a bright white light to an ever diminishing nothing.  It was gone without a bit of reflection or an sound.  The brilliance never changed, just dimmed. ((NUFORC Note:  We have written the source of the report to share with NUFORC the time of the sighting, which is not included in the report.  We have assigned an arbitrary time for the report, until we hear back from the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63757.html",
      "state": "TN",
      "duration": "60 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b7016",
      "summary": "Gigantic round object with intense bright light moving thounsands of MPH",
      "city": "memphis",
      "shape": "circle",
      "date": "2008-01-21T00:00:00",
      "story": "Gigantic round object with intense bright light moving thousands of MPH At around 5:00 am (11:00 zulu) just south of Memphis a very bright light appeared from 240 degrees moving to about 060 degrees at an altitude of 200 to 300 miles high.  The object was round and very bright moving at a speed of several thousand miles per hour.  I could compare jet traffic at altitude moving along J29 high altitude airway over the Memphis area. This object was the probably the size of the Superdome or bigger viewing it from that distance.  The object was not trailing debris, and was maintaining level flight (not following the curvature of the earth) through out the sighting. The light was incredibly bright and did not dim as its azmith turned in passing. I have seen many satillites reflecting sunlight and this was much bigger and brighter than anything man made.  ATP Pilot 11000 hours B737 DA2000 HS125 45 years old  Business Owner 55 years old  Student 14 years old",
      "link": "http://www.nuforc.org/webreports/061/S61060.html",
      "state": "TN",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6fd9",
      "summary": "Green disk",
      "city": "memphis",
      "shape": "disk",
      "date": "2007-06-12T00:00:00",
      "story": "Green disk Left my home on the way to work at 400am that day.  Had been awake since 230 am.  On the way to work I noticed a object overing in front of my vehicle in the sky quite a distance up.  I pulled my truck over to get a better view, it allowed me to watch maybe for a minute tops.  At which time it zoomed off in a northeastern direction at a very high rate of speed.  I have seen UFO's before but never one like this.  It was the traditional Disk, but it was glowing green.  I was on a rural road and there was no noise what so ever.  It zoomed off at such a high rate of speed that all I could see what a blur.",
      "link": "http://www.nuforc.org/webreports/056/S56720.html",
      "state": "TN",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7052",
      "summary": "after an MLK rally 4/4/08 in Memphis, TN, I found multiple white orbs in formation in one picture I snapped",
      "city": "memphis",
      "shape": "formation",
      "date": "2008-04-17T00:00:00",
      "story": "after an MLK rally 4/4/08 in Memphis, TN, I found multiple white orbs in formation in one picture I snapped I did not see anything with my eyes.  I took pictures and saw the orbs in one of my photos.  I was using my digital camera, and they are very obvious when you notice them.  It was a very gloomy overcast day.  They were white orbs, in some sort of formation.",
      "link": "http://www.nuforc.org/webreports/062/S62535.html",
      "state": "TN",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b7228",
      "summary": "At aprox. 8:20pm I saw a craft in the sky slowly moving from the east to the west. The craft stoped and rotated and other lights were v",
      "city": "memphis",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "At aprox. 8:20pm I saw a craft in the sky slowly moving from the east to the west. The craft stoped and rotated and other lights were visable on the craft. The craft then proceeded to move in an eastward motionan. After it started the second time a second craft came in from the north going south under the first. The third craft was in the eastern sky aprox. 300ft in the sky and moved at a slower rate than the first. The first craft was aprox. 150 to 250 ft in the sky. They all had the same colors of light Bright white with some smaller blue and red. After 30 min of observation I notice the second craft in the south-west sky aprox. 200ft in the sky hovering and went streight op in the night.",
      "link": "http://www.nuforc.org/webreports/056/S56066.html",
      "state": "TN",
      "duration": "45 min to 1hr"
    },
    {
      "_id": "64d005f478aba2ec5a3b73ef",
      "summary": "I saw a ufo in memphis tn on feb 29th from the I-240 expressway around 9:00pm.",
      "city": "memphis",
      "shape": "changing",
      "date": "2008-03-04T00:00:00",
      "story": "I saw a ufo in memphis tn on feb 29th from the I-240 expressway around 9:00pm. Hi,my sister and I had just got off work? We were on the expressway going 240 north we were coming up on her exit for me to take her home. I look over to my left and I ask my sister \"WHAT IS THAT UP IN THE SKY\"? She said \"WERE\"? I said over there. She looked and we both said what the hell is that? My sister is not a UFO believer but I am. She yelled look how fast its going? All of a sudden it stop in place on just hoverd in one spot?  I WAS SO EXCITED? She than said is that a blimp? I said I dont know? The craft had a red light on top rotating from top to bottom. It was not a airplane or a blimp. We live in Memphis Tn were this kind of thing dont happen. I dropped my sister off and you still could see this craft in the west. I tried to get a picture of this craft with my cell phone but it was to far away. I than started on my way on from my sister's house and saw the craft, it had changed it shape? It went from having lost of lights to just one on top? I know what a airplane look like, I tried to follow the craft again and it just kept going far away? When I Got to my house you could hear the dogs barking like crazy? Please if anyone saw this craft let me know? Thank-you.",
      "link": "http://www.nuforc.org/webreports/062/S62048.html",
      "state": "TN",
      "duration": "Expressway"
    },
    {
      "_id": "64d005f478aba2ec5a3b75fd",
      "summary": "I saw a bright orange sphere that hung in the sky for nearly 10 minutes!",
      "city": "memphis",
      "shape": "sphere",
      "date": "2008-01-21T00:00:00",
      "story": "I saw a bright orange sphere that hung in the sky for nearly 10 minutes! I was outside walking my dog when I looked into the northern sky and saw a bright orange light approaching extremely slow.  It was a sphere shape and would have been about as big as one of those lamps on top of a tower.  As it got closer it was obvious that it was some kind of air craft, not a meteorite or any sort of space debris just by the shear fact that it was moving so slow.  The object was high in the sky and didn't make a noise as it passed over.  I know it couldn't have been a plane, because any planes that come into this area of Memphis are preparing to land at the International Airport and would be much lower.  The orange light that the craft emitted was bright like fire, but constant like a light bulb.  The craft took nearly 10 minutes to cross the sky, as I had time to call two of my friends while I was watching it!  This was the most eerie, awesome thing I've ever seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61023.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c05",
      "summary": "I work armed security in down town memphis and on 10/18/06 the store that i was watching had another thirty minutes to close,so i went",
      "city": "memphis",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "I work armed security in down town memphis and on 10/18/06 the store that i was watching had another thirty minutes to close, so i went outside to get some air and of course im allways watching the sky and saw a single white light moving accross the sky at about twenty MPH,but no sound and also flew accross the path of an incoming FED.X cargo plane, so i damn well now they had to see it too,BTW this makes my fourth sighting in my life.",
      "link": "http://www.nuforc.org/webreports/053/S53010.html",
      "state": "TN",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d12",
      "summary": "Distant light went from left to right in western sky. Twinkled as it flew and then after a little while maybe ten or twenty seconds it",
      "city": "memphis",
      "shape": "other",
      "date": "2006-12-07T00:00:00",
      "story": "Distant light went from left to right in western sky. Twinkled as it flew and then after a little while maybe ten or twenty seconds it disappeared from sight even though I thought there was more window space to view the left to right motion. Can the lights on an airplane just turn off or was this some other craft? It was hard to make out as it was only a distant light.",
      "link": "http://www.nuforc.org/webreports/053/S53760.html",
      "state": "TN",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f69",
      "summary": "Bright glowing green sphere that vanishes, very close and very big.  ((NUFORC Note:  Student report.  PD))",
      "city": "memphis",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "Bright glowing green sphere that vanishes, very close and very big I was sitting in the car with my boyfriend and looking at the stars out my window when a bright almost neon green ball flashes across the sky.  My boyfriend saw the light but wasnt lookin in the same direction to see the object.  It had a dark green core with glowing green around it and was HUGE.   This was not something that happened way up in the sky where you would normally see stars.  This was abouve some trees in the distance and when I went back out the next morning trying to judge how far away this ball was in refrence to the clouds, the clouds seem to be much further away.  Which made me question that this wasnt something burning while entering our atmosphere.  I'd really like to know what this was.  The best way to describe the movement was that it kind of \"fell\" in the sky and disappeared before the treetops.  Disappeared in mid air! ((NUFORC Note:  Student report.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71961.html",
      "state": "TN",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b8138",
      "summary": "ufo sighting over my car  Memphis",
      "city": "memphis",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "ufo sighting over my car  Memphis check files concerning ufo sightings on the month and year previously filed.  I saw this thing over my car accelerate from zero to several thousand miles an hour.  So did half the law enforcement in Shelby as well as Desoto county, Ms.  It was on the front page of the paper the next day.  Unexplainible is was.  Pushed under the carpet I guess. 77, or 78, the fall or late summer.  It seemed as though we lost some time while underneath whatever it was.  None of us felt the same as we had before.  It hovered over my car for about 30-45 seconds and then sped off at an aeronautically unimaginable speed.  I have always been fascinated by aircraft ever since childhood have spent almost my entire life learning everthing i could about their characteristics, however, never have i seen nor do i want again to see anything like that again. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67729.html",
      "state": "TN",
      "duration": "6:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e19",
      "summary": "tremendously wide V Shape object connected by lights spotted over winchester avenue north-west pattern",
      "city": "memphis",
      "shape": "",
      "date": "2009-01-10T00:00:00",
      "story": "tremendously wide V Shape object connected by lights spotted over winchester avenue north-west pattern tremendously wide V Shape object connected by lights spotted over winchester ave.  Must have had 20 lights connected one side was sligtly longer than other side.  Moving very slow in a north-west patern.",
      "link": "http://www.nuforc.org/webreports/067/S67021.html",
      "state": "TN",
      "duration": "90 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f26",
      "summary": "Two white lights seen in Memphis,TN. one on cellphone camera airplanes avoided the aircrafts",
      "city": "memphis",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "Two white lights seen in Memphis,TN. one on cellphone camera airplanes avoided the aircrafts There were 2 lights diagonal from each other.I could see airplanes flying around them to avoid these aircrafts. The on to the right was larger and at about 19:30 it disappeared. The smaller one just remained there .Each had white lights and seemed to be a circle shape.The one to the diagonal left was smaller and the other seemed to be much larger.Each moved slightly side to side swiftly. Oh I did call my local Fox network and they put me on hold for nearly 10 min. and I called back and he seemed to think of me as a joke,but he did say they would check it out and they never showed.",
      "link": "http://www.nuforc.org/webreports/067/S67108.html",
      "state": "TN",
      "duration": "17:-19:45"
    },
    {
      "_id": "64d005f478aba2ec5a3b94bb",
      "summary": "ufo spoted in google earth",
      "city": "memphis",
      "shape": "circle",
      "date": "2010-04-13T00:00:00",
      "story": "ufo spoted in google earth   i found a picture of a of a ufo in google earth in area 51 the cordinates are 37*11'55.10\" N  116*03'20.29w     the star thing means degrees . download google earth and hollow this cordinates . i hope this helped. PEACE",
      "link": "http://www.nuforc.org/webreports/074/S74652.html",
      "state": "TN",
      "duration": "none"
    },
    {
      "_id": "64d005f478aba2ec5a3b95ee",
      "summary": "On Friday, the sky was really dark as if it was going to storm. Around 12:00 midnight, I heard winds blowing hard against my bedroom wi",
      "city": "memphis",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "On Friday, the sky was really dark as if it was going to storm.   Around 12:00 midnight, I heard winds blowing hard against my bedroom window, so I went to the back door to look out. As I looked in the sky, I seen a multitude of blurry lights shooting from behind the clouds as if they were released from something & flying really fast above my home & disappearing. I couldn't tell exactly were they were coming from because there was a huge tree blocking my view, but it was definitely from behind the clouds. The lights continued to fly from behind the clouds for about an hour. It is really hard to describe, but I have never been so frightened in my entire life. I never believed in flying objects or ufo's, so this is very scary to me. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75549.html",
      "state": "TN",
      "duration": "30 min- 1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b964c",
      "summary": "The \"Moon of Memphis\" looked simular to the white full moon in size and brightness but rises to be a star.",
      "city": "memphis",
      "shape": "circle",
      "date": "",
      "story": "The Moon of Memphis looks simular to the white full moon in size and brightness but rises to be a star. In my backyard at 10pm mid-november 1964, I looked up and saw the bright white full moon but it had uniform whiteness and still bright enough to cast a shadow.   I looked around and saw the orange real moon rising over my neighbor house in the east.  I stared at the object the size of the full moon above me for several minutes while it hovered above me.   It started a rapid ascent in the sky looking like a small moon then a brilliant bright star and then dim star until it disappeared from view.   Later analysis suggest that the object was at twenty thousand feet and was about ten acres in size.  I call the object the \"Moon of Memphis\" since I witness this object over the community of Frayser in Memphis, Tennessee.  The backyard that I witness this event was ((deleted)) St.  I was a ((deleted--aviator)) in the USAF and an intellegence officer in the ((deleted--military)).  This object had religious implication since it appeared in 1964 because A through Z connected with 1 through 26 is a code! which decodes the word Israel to sixty four.  I believe it appeared so we would be more kind to every animal and give anathesia to animals before killing them to show more reverent to them and God. ((NUFORC Note:  We do not understand the allusion to Israel or anesthesia.  Date may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75780.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b96f8",
      "summary": "Traveling red lights that had the ability to rapidly change flight direction were seen on Jackson Ave in Memphis TN",
      "city": "memphis",
      "shape": "cigar",
      "date": "2009-06-09T00:00:00",
      "story": "Traveling red lights that had the ability to rapidly change flight direction were seen on Jackson Ave in Memphis TN Riding down Jackson Ave, traveling red lights were in the sky.  They clearly were not planes or jets based on the speed which was extremely rapid  and the verticle flight patterns.  They had the ability to start and stop sharply and then reverse flight direction.  Myself  and the other drivers  and looked at each other and back at the lights.  Anytime we were stopped by a red light we got a chance to see if others noticed and tried to get people’s attention by pointing  toward the lights.  I eventually got on I-240 and was able to see these lights for a while until I had to eventually get off at my exit. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70161.html",
      "state": "TN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9833",
      "summary": "This was observed happening in our friendly skies (lighted objects hovering in the sky with helicopters flying that way @ ~2300 hrs).",
      "city": "memphis",
      "shape": "other",
      "date": "2009-05-12T00:00:00",
      "story": "This was observed happening in our friendly skies (lighted objects hovering in the sky with helicopters flying that way @ ~2300 hrs). As I was driving along interstate 40 leaving Memphis Tennessee, I observed 4 objects in the sky spaced a fair distance apart from each other.  I could not tell the exact shape of the objects; however, the lights were square at the bottom and then out from the middle of each of the top 3 sides of the square was another light (a short distance from the box).  The objects were not moving but were hovering in the same place in the sky.   There was a beam of light shining to the west (toward Memphis) coming from the first 2 of the 4.  This was observed close to mile marker 35.   As I approached mile marker 52, I observed 2 helicopters in the sky crossing the interstate flying toward the direction of the objects.   I continued down the interstate and as I came to mile marker 72, I observed 2 more helicopters in the sky.   As I approached mile marker 75, it looked like 2 more of the same shaped objects in the distance (northern direction).  . ....... .       .     .       . ....... I found this to be unusual.  Not only the unidentifiable objects in the sky, but that number of helicopters in the sky at that hour of the night.",
      "link": "http://www.nuforc.org/webreports/069/S69925.html",
      "state": "TN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9c5a",
      "summary": "real bright light moving very fast",
      "city": "memphis",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "real bright light moving very fast At exactly 7:29 myself and friend stepped out of her house and noticed a real bright light in the eastern region, at first we thought it was a airplane but noticed that the bright light was moving away from us at a high rate of speed.If it had been a plane on approach the light would have been bright and it would have been coming toward us, But as I said it was moving so fast that the bright light got real small and disappeared.It was only one craft and I am 100% that it was not an airplane.",
      "link": "http://www.nuforc.org/webreports/066/S66129.html",
      "state": "TN",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3baab1",
      "summary": "Rectangular white object observed for a minute or less over Memphis about fifteen minutes before sunset.",
      "city": "memphis",
      "shape": "rectangle",
      "date": "2010-11-21T00:00:00",
      "story": "Rectangular white object observed for a minute or less over Memphis about fifteen minutes before sunset. I saw a single rectangular white object which appeared flat and featureless, almost straight overhead, moving from the southwest to the east-northeast, at about 6:55 pm Central Daylight Time (about fifteen minutes before sunset).   I watched it until my view was blocked by some trees, at which time it was about halfway down to the horizon.  It maintained the same perfectly rectangular shape, and maintained an extremely steady speed in a perfectly straight line, the entire time.  I did not hear any sound from it.  I did not see any sunlight reflections on it.   Planes from our main airport fly over this area very often, and it was at about the same height and moving at about the same speed as those planes often are.  However, it was definitely a perfect rectangle and not a plane (although it was about the same size as the jets I often see, or maybe a little larger than that), and it didn’t move irregularly at any time as I have seen wind-borne debris do (and th! ere was not even a breeze at ground level at that time).  I was only able to see it for a minute or less before my view was blocked by the trees.  I was formerly a litigation paralegal for over twenty years, have a Bachelors degree, own my home (where I observed this object), and was not ill or under any influence from alcohol, medication, or any form of drugs at the time I observed the object.",
      "link": "http://www.nuforc.org/webreports/077/S77770.html",
      "state": "TN",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe60",
      "summary": "Moon like UFO hovers for minutes then ascends to appear to look like bright star, then dim star, then gone.",
      "city": "memphis",
      "shape": "circle",
      "date": "",
      "story": "Moon like UFO hovers for minutes then ascends to appear to look like bright star, then dim star, then gone. This article will give you some information about my sighting of the \"Moon of Memphis\" and topics that the spirits talk and focus on.  This article may seem to some to be a UFO religion but the information is UFO evidence and spirit communications designed to integrate into your present beliefs and religion, not to replace them.   Hopefully this UFO sighting and news will improve your belief and devotion to God, other people, and all things living.  My UFO phenomenon began on the way to visit my grandmother in western Kentucky. We were riding north on Highway 51 late at night listening to the AM radio when we heard a news report of UFO’s seen in western Kentucky and western Tennessee. I looked out the back window at the stars above stating that I wish I could see a UFO. Twenty six days later I had my wish. I was back at home in Memphis when my mother asked me to take out the garbage at 10pm  Sunday 22 November 1964. I went out back and I looked up and saw a white full moon above then I looked around and to the east I saw an orange moon rising. I looked back above and noticed the white full moon shaped UFO again for a few minutes until it ascended in the sky looking like a bright star at high altitude. I believe this phenomenon was outside of my head and it was fantastic.  Since it appeared over the Holy Hills of the Frayser community of Memphis, I call it the \"Frayser Fatima\" of the \"Moon of Memphis\".  At 10pm 22 November of 1964 in Memphis Tennessee (USA), I was asked by my mother to take out the garbage. I went out back and I noticed a bright white full moon above. I looked closer and I noticed it had uniform whiteness with well define circular outline but I was not able to see the shades of white or grey that made the man in the moon face. It was equally as bright as the real full moon, bright enough to create a moon shadow. I looked around and I noticed another moon that was bright orange. This other moon was rising over our neighbor's house to the east, as I looked through the side yard from the back yard to the front. It had the features that created the man in the moon, so I believed that it was the real moon. I looked above and stared again at the white full moon for a few minutes, then it made a rapid ascend in the sky. I estimate the ascend speed between 180 to 300 knots.  As it rose, it became a smaller and smaller moon until it appeared to looked like a bright ! star, then a dim star, then disappeared into space. It reminded me of the Star of Bethlehem when it was at high altitude.  The event occurred within a mile of the Area 51 of Tennessee, that is near Highway 51 over the Holy Hills of the Frayser neighborhood of Memphis, Tennessee and the event lasted about fifteen minutes.  I was only seven when I witnessed this UFO that I now call the \"Moon of Memphis\". I had a good memory of the event so that when I was trained in the Air Force as an instructor navigator, I was able to analyze the event better with my aviation experience. I estimate that the \"Moon of Memphis\" was at twenty thousand feet and was about ten acres in size. I developed this information from watching the ascend of the \"Moon of Memphis\" through some high cirrus clouds that I estimate was at sixty thousand feet. At twenty thousand feet it would have taken four 747 aircraft parked in a circle to cover the area of the \"Moon of Memphis\" UFO, thus creating a ten acre size estimate. When it hovered above me and 10 ten degrees south, it was exactly the size and shape of the real moon when seen high in the sky.  Most observers probably could not tell the difference between the \"Moon of Memphis\" UFO and the real lunar moon when it's hovering above.   In 1964 the “Moon of Memphis” appeared at 10 pm 22 November over the city of Memphis. It was a night with two moons in the sky, the “Moon of Memphis” overhead and the lunar moon rising in the east. There is significance to this event because the timing of the event has biblical implications. First it appeared in 1964 which can be analyzed to derive meaning. If you take the alphabet and match the letters with numbers then you can derive a numeric number for words. I analyzed many religious words and I found two that are interesting. The English words \"Israel\", \"Zion\" and \"Jeshua\" decodes to 64 sixty four. Israel is a word that has meaning to the Jewish, Christian, and Muslim religions. The word Zion is a word that means Israel and Jerusalem in particular. In Revelations of the Bible, there is writing about a New Jerusalem or a new Zion. Could the timing of the “Moon of Memphis” mean that it was God’s New Jerusalem or Zion?  \"Jeshua\" is the Messiah of Israel that was translate! d to mean Jesus Christ.  The day of the month was the 22 twenty second which added to 11 eleven for the month of November equals 33 thirty three which is a religious number for the English word \"Amen\" and the crucifixion date of Jesus was 33 AD. If you count the 22 November to 25 December, then you will have 33 thirty three days.  Twenty two is also the sum of the word \"Lead\".  If you take the numeric sum of the appearance date: 11-22-1964, you get 26 which is the sum of the words \"God\" and \"heal\".  Also, my birthday 11-04-1964 of that year also added up to 26 and will always be the sum of the \"Moon of Memphis\" appearance anniversary which helps explain why I was given the honor to view it.   Lastly, the decoded English word \"Mercy\" equals 64 sixty four.  The UFO event occurred at 10 pm. Ten coincides with the English letter “J” which could mean Jewish, Jehovah, or Jesus.  The sum of the word \"ten\" equals 33 thirty three, a number often associated with Christ.   If we added the 10 ten to the 64 sixty four then we would get 74 seventy four. Seventy four has some religious meaning. The English words \"Messiah\", \"Jesus\", \"Cross\", and \"Jewish\"  decodes to 74 seventy four. Seeing meaning presumes that God intended for the year and time numbers to be added together. If we subtract 10 ten from 64 sixty four we get 54 fifty four. The English words \"Islam\" and \"Love\" adds up to 54 fifty four.  If you take the number of witnesses of the event 1 one and subtract 64 sixty four then you get 63 which is the sum for the words \"Saint\", \"try\", \"gentle\", \"agitate\", and \"Divine\". If you add the numbers of 1964, you get 20 twenty and if added to 64 sixty four you get 84 eighty four which is the decoded sum of the English words \"Savior\", \"evolved\"! , \" Patmos\", \"forty\", and \"Charity\".   If you add 33 thirty three to 64 sixty four you get 97 ninety seven and the English words \"convert\", \"story\", \"buildings\", \"control\", \"sixty\" and \"Hinduism\" equals 97.  If you decode the English word \"November\" the you get 94 ninety four which is also the decoded sum of the English word \"respected\"; if you add the 10 ten to 94 ninety four then you get 104 one hundred four which is the decoded sum of the English word \"Jerusalem\".  If you take the decoded sum of the English word \"Memphis\", you get 83 eighty three which is also the decoded sum of the English words \"percent\", \"prayer\", \"prepared\", and \"South\"; and if you subtract the time 10 ten then you get the sum 73 seventy three which is the decoded sum of the English words \"Joseph\", \"children\", \"thanks\", \"nation\", \"living\", and \"Ezekiel\";  If you take the sum of \"America\" which is 50 fifty and add 33 thirty three you get 83 eighty three for the sum of \"Memphis\".  If you add my age at ! the time of the event 7 seven to 64 sixty four you would get 7! 1 sevent y one which is the decoded sum of the English word \"spirit\" and \"Temple\".  If you subtract my age 7 seven from 64 sixty four then you get my birth year of 57 fifty seven which is the decoded sum of the English words \"Moon\", \"Jews\", \"Bless\", \"Mary\", \"birth\", \"human\", and \"city\".  I hope this analysis can help you understand the religious nature of the \"Moon of Memphis\" appearance of God which seems to reach out to believers of Christianity, Judaism, Islam, and others.   This witness of the event was born on 11-04- 1957 and 57 fifty seven is the numeric sum of the English word \"Moon\" and the English words \"Bless\", \"Mary\",  \"birth\",  \"city\" and \"Jews\"  which suggest that we should bless Mary and birth city of Jesus the Christ and Messiah.  The sum of my birth date is 28 which is the sum of the word \"Eden\".   Also English may have been chosen because England equals 57 fifty seven.  If you take the difference between 64 sixty four and 57 fifty seven you get 7 seven which subtracted from 57 fifty seven you get 50 fifty that decodes the words \"America\", \"second\", \"lands\", and \"helped\".  If you take the sum 67 sixty seven of my last name \"Bickers\" which is also the sum of the English words \"trees\", \"West\", and \"work\",  and add the time 10 ten, you get 77 seventy seven which is the sum of the English words \"Christ\",  \"wrong\", \"Power\", \"character\", \"Taoism\", and \"Judaism\".   If you take the sum 79 seventy nine of my first name \"William\" which also d! ecodes the English words \"Nature\", \"hereby\", and \"Virgin\", and subtract the time 10 ten then you get 69 sixty nine which is the sum of the English words \"message\", \"animals\", \"redeemed\", \"people\" and  \"Jehovah\". If you add 10 ten to 79 seventy nine, you get 89 eighty nine which is the sum of the word \"religion\".   If you take my middle name \"Harding\", it decodes to 61 sixty one which is also the sum of the English word \"Church\". If you subtract the time 10 ten you get 51 fifty one which is the sum for the English word \"Thor\"; and if you add the time 10 ten you get 71 seventy one which is the sum for the English words \"Zeus\", \"spirit\" and \"Temple\". If you take the sum of the neighborhood of the event Frayser then you have 92 which is the sum of the word \"reasonable\".   In addition, my initials WHB equals 33 thirty three and the English word AMEN equals 33 thirty three which is also associated with Jesus' crucifixion date (33 AD).  I am also 1/64 Native American (Cherokee).  ! Lastly the event was seen on a street called \"Leweir\" which d! ecoded t o 72 seventy two and it is also the decoded sum of the English words \"monks\" and \"world\". If you add the time 10 ten to 72 seventy two, you get 82 eighty two which is the decoded sum of the English words \"forgive\", \"Eastern\", and \"saints\".  If you subtract 10 ten from 72 seventy two then you get 62 sixth two which decodes to the English words \"gives\", and \"Think\".  These religious words decoded from my birth year and name may be factors in understanding why I was chosen to view the event and evolved into an UFO Prophet, Ambassador and Messenger of God.   Why was the city of Memphis chosen in 1964?    Several highways enter Memphis with interesting meanings and if you take the number, add or subtract the time of the event 10 PM to the highway number and match with the sum of words. Highway 64 and the event occurred in 1964 plus 64 decodes to the English words \"Mercy, Israel, focus, attend, never, and Zion\"; If you add 10 to 64 you get 74 for the words \"Messiah\", \"objects\", \"abortion\", and \"Jesus\";  If you subtract the event time 10 from 64 you get 54 which decodes to \"Islam\", \"those\", \"Gabriel\", \"right\", and \"Love\"; Highway 51 which like Area 51 can be suggestive of UFOs and 51 decodes the words \"Michael\", \"Indian\", \"saved\", \"Fatima\", \"avoid\", \"preach\", \"more\", \"Great\", \"Dixie\", and \"Catawba\"; If you subtract the event time 10 from 51 then you get 41 which decodes to \"good\", \"fun\", \"gone\", and \"King\"; Interstate I-40 which 40 decodes the word \"Buddha\" suggesting peace and harmony and the words \"Holy\", \"asked\", \"seek\", \"harm\",! and \"Maya\"; If you subtract the event time 10 from 40 you get 30 which decodes to \"Peace\", \"Bible\", and \"due\";  Highway 70 and decodes to the English words \"Yahweh\", \"honor\", and \"Cherokee\"; If you add 10 to 70 then you get 80 which decodes to \"Throne\", \"Creator\", \"values\", \"your\", \"miracles\", \"wildlife\", and \"religion\";  If you subtract 10 ten from 70 seventy you get 60 sixty that decode the words \"over\", \"mislead\", and \"believe\". Highway 57 and decodes to the English words \"Bless, Mary, Birth, City, Jews, Human\", and \"Moon\"; If you subtract 10 from 57 you get 47 which decodes to \"Beast, Radio, Judge, obey, Isaiah, John, and Osage\"; Interstate 55 and decodes to the English words \"Heaven\", \"Aztec\",  \"show\", \"part\", \"sky\", and \"Satan\"; If you add 10 to 55 you get 65 which decodes to \"Seven\"; Subtract 10 ten from 55 you get 45 which decode the words \"say\", \"Daniel\", and \"East\"; Highway 72 and decodes to the street where the event was witnessed \"Leweir\" and the English words ! \"Judging\" and \"World\"; If you subtract 10 from 72 you get 62 w! hich dec odes to \"Think\", \"first\", \"Comanche\", and \"tribal\"; If you add 10 to 72 you get 82 for the word \"forgive\";  Highway 61 and  decodes to the words \"Church\", \"Roman\", \"sins\", \"coming\", \"homes\", \"UFOs\", \"Yankee\", and \"Navaho\"; If you add 10 to 61 you get 71 which decodes to \"Catholic\", \"forget\", \"Moses\", \"advocate\", \"native\", and \"Pueblo\";  Highway 14 and 14 decodes to the English word \"Dead\"; Highway 79 and decodes to the English words \"Nature\", \"should\", \"words\", \"your\", \"honored\", \"elaborate\", \"Cheyenne\", and \"Quapaw\";  If you add 10 to 79 you get 89 for the sum of the words \"hunting\", and \"honors\"; If you subtract 10 from 79 you get 69 for the words \"Jeremiah\" and \"enjoy\"; Highway 78 and decodes to the name of the Native Indian tribe of Memphis region, the \"Chickasaw\" and the words \"repent\", and \"enjoyed\"; If you add 10 to 78 you get 88 which decodes to \"Woodland\", \"Sikhism\", \"peoples\", \"nothing\", and \"Ghosts\"; Highway 86 which decodes the words \"Mounds\", \"insight\", \"waters\"! , and \"souls\". If you add 10 to 86 you get 96 for the word \"opposes\".  These are most of the highways in Memphis and may be important clues relating to the \"Moon of Memphis\" UFO event.  The \"Moon of Memphis\" also represents the Great Spirit of the Chickasaw, Cherokee, Quapaw, Navaho, Catawba, Mounds, Osage, Pueblo, Woodland, Cheyenne, Comanche, Maya, Aztec, and other tribal Indian peoples.  Using many of the words decoded, this is a possible message:  To the peoples of the world, I William of the Divine God, the Holy Spirit, the Great Spirit, and the Good Creator greets you with this message and Fatima. The 1964 \"Moon of Memphis\" honors the Messiah Jesus Christ, the Savior in Spirit and the Virgin Mary, the Holy Mother.  Jehovah and Yahweh of the Jewish people of Israel and Zion gives thanks to Joseph, Mary, Jesus, the birth city of the Savior's spirit, the Cross, and Jerusalem. The  peoples of religion of Christ, Judaism, Islam, Taoism, Sikhism,  Hinduism, Buddha, the Great Spirit and more should show love, peace, honor, and charity as asked from your Good Creator of the \"Moon of Memphis\",  over America.   Also say a prayer, bless, and show mercy to animals; plus enjoy and forgive children . Trees and nature should also be enjoyed and respected.  Avoid the beast and harm nothing; if you do harm, be prepared to elaborate to a spirit.    Always love the message of Ezekiel, Jeremiah, Daniel, and Isaiah; plus the story of Mo! ses and of Elisha.  Obey the God and power of the \"Moon of Memphis\", which can think and radio to humans,  and is our Savior in Spirit.  Messiah Jesus Christ, the King on his thrown, is helped by those who preach, believe, and convert in the East, West, and South; by those who attend or lead a Bible Church, the Eastern Church, a Catholic Church or the Roman Catholic Church; and due to the work of saints, Saint Gabriel, and the Archangel Saint Michael.   Beware of Satan and in Heaven we are judging the living and the dead.  First repent of your sins, then the Jesus the Christ, your advocate, will forgive you,  forget your sins, and try to heal you.  Preach the gospel and seek insight on the Bible.  Focus on and believe in the words and values of the Messiah Jesus Christ. Saint John of Patmos was mislead; Jesus Christ, the Messiah and a part of God, was never gone so this is a gentle second coming.  UFOs are miracles of God. Abortion is wrong but birth control is right.  God ! opposes hunting wildlife for fun.  Monks should agitate huntin! g.  Use at least forty percent of your nation for native nature and wildlife.  The souls and ghosts of the living and the dead of animals, humans, homes, buildings, objects, lands, sky, waters, and trees of good or reasonable character of this world, respected by the Great Spirit, the Holy Spirit, and the Good Creator of the \"Moon of Memphis\" of 11-22-1964, are hereby honored, redeemed, and saved by your Divine God.  The “Moon of Memphis” was possibly the same object as the “Star of Bethlehem” but at a much lower altitude. The Book of Mormon states that a bright light appeared in the sky over Bethlehem. Was this the Star of Bethlehem at a much lower altitude like the “Moon of Memphis”? The “Moon of Memphis” ascended and appeared as a bright star until it ascended out of sight. The symbol of Islam is the moon and star. Was the “Moon of Memphis” trying to send a meaning to Islamic believers? At high altitude it appeared like a bright star reminding me of the “Star of David” or the “Star of Bethlehem”. It seems that the “Moon of Memphis” was trying to relay meaning to all of the religions of Zion; Judaism, Christianity, and Islam.  The \"Moon of Memphis\" may also be trying to connect with those who believe in the Wicca religion or those who worship the Great Spirit in Native American religions, and Indian religions.  The rising to space of the Holy and white circular \"Moon of Memphis\", symbo! lically suggest the body of Christ being taken by God to the heavens as a communion act and evidence of Jesus Christ being accepted as a Lord and Savior of Earth.  If you see the communion wafer used by the catholic church, then you can imagine what the Holy \"Moon of Memphis\" looked like in the sky.  This event also suggest that the \"Star of Bethlehem\" appeared as a very bright star from a distance but appeared as a full white moon to the people directly under it giving a moon-like light to the community below and baptizing the people with the Holy light of God.  Was the “Moon of Memphis” a sign to tell the believers of all religions that they have a common God who is known by many names? Was it a sign of peace or the return of the messiah? Much change in the human condition have occurred since 1964 suggesting that it meant both a sign of the living God and his commitment to the earth to improve the world. Was the appearance over Memphis, Tennessee (USA) a sign that God has chosen that city as the New Jerusalem mentioned in Revelations of the Bible? This city may very well be a gateway to heaven. Something to think about if you really want your prayers heard. It might be a city worthy of a pilgrimage.  The message analyzed from this event seem to suggest that the event symbolized a common God of all religions, peoples, and life.  The “Moon of Memphis” is a sign, the lamb of God, of the return of the Messiah for it is written:  Revelation 21:23 “The city had no need of the sun or of the moon to shine in it, for the glory of God illuminated it. The Lamb is its light.  Revelation 22:5; “There shall be no night there: They need no lamp nor light of the sun, for “the Lord God gives them light” And they shall reign forever and ever.  With the “Moon of Memphis”, the New Jerusalem will be made and with its power, the people will have light. This Holy city may not come about anytime soon according to scriptures, but the “Moon of Memphis” is proof that God can make good his promise to bless this new city with heavenly light not from the sun or the moon. Since the “Moon of Memphis” appeared over Memphis, Tennessee (USA) in 1964, it is possible that this city is similar to the New Jerusalem, an important city of God. The “Moon of Memphis” proved in 1964 to produce light as bright as the moon and I suspect that it could produce a much brighter light if it had to. It is a commitment to the earth to always be with us during good times and bad times. The “Moon of Memphis” is the lamb of God and also the Holy Grail or Holy light of Christ. Celebrate and be exceedingly joyous of the truth and existence of the “Moon of Memphis”.  As a seven year old boy, I was baptized by the light of the lamb, the Holy light of God.  In the Bible, Luke 24:51, “Now it came to pass, while He blessed them, that He was parted from them and carried up into heaven.”  This was the Ascension of Jesus and a phenomenon that I want to discuss. It is my assertion that Jesus went into something like the “Moon of Memphis” of 1964. The “Star of Bethlehem” which was similar to the “Moon of Memphis” had to of descended to a low altitude to be carried up into heaven. Though nothing was mention of a craft, the event suggests that such a event had to have happen for this to be true. As a witness the “Moon of Memphis”, I believe that the “Star of Bethlehem” was the same object as the “Moon of Memphis” and it actually took Jesus aboard so Jesus could establish his church and religion from celestial assistance. The success of the religion also suggest that a higher power and probably from what we now call UFO assisted Jesus as God in his mission. If this is what occurred then it would also suggest that the “Moon of Memphis” was the second coming of Jesus in the spirit. I believe that the Messiah,  Jesus Christ, returned to the earth in 1964 and we are li! ving in a new age of life.  God chose one individual to witness the return of the Messiah.  Jesus said in Matthew 5:8 \"Blessed are the pure in heart:  for they shall see God\".  Maybe the Spirit of Jesus of the \"Moon of Memphis\" felt that I was pure in heart as a seven year old boy.  Like the first visit to earth, the messiah chose a simple humble and meek way to make his return known. Also, the Messiah, Jesus Christ, had the privacy to work with humanity to make it more peaceful and comfortable. Most would have expected a more visible and public return but that would also cause many to resist change and expect instant success. God chose a seven year old boy to show his presence and return and much change has occurred over the past few decades. Glory to God and we welcome the return of the Messiah, Jesus Christ, who returned in the \"Moon of Memphis\" in the spirit to be a partner to humanity and all life to make the world better. Amen.  The historic battle of Armageddon was probably the famous Six Day War of Israel in 1967.  This war fulfilled prophesy and it occurred just several years after the return of Jesus Christ's spirit, the Messiah, and other new Messiahs that came in the \"Moon of Memphis\" event.  Apparently Jesus knew that with the turmoil in the world and Middle East, He and other Spirits of God had to appeared or return to work with this earth to make it more peaceful.  The Cold War with the Soviet Union and China were also very serious concerns to God.  Many prayed to God and Jesus to help and their prayers were answered with the \"Moon of Memphis\" appearance and influence.  Maybe prophesy of gloom were indicators when Godly influence was necessary to help humanity.  Maybe every generation in need get their own second coming of Jesus or appearance and influence of God.  For this generation the 1964 appearance of the \"Moon of Memphis\" was our second coming of Jesus and coming of new generations o! f Spirits of God made from collected spirits from the best of God's creation and the best of humanity.  In the New Testament book of Revelations from the Bible, John of Patmos may have been mislead because of his association of disasters and end of the world in association with the return of the Messiah, Jesus Christ. Jesus Christ had a good character and kind personality and his return has created a world that is more in tune with him as a Messiah and a Savior.  To believe that Jesus has not returned or has ever left the world is to believe that Jesus Christ is not a part of God.  The Divine God of many names and those who believe that Jesus Christ was gone did not fully understand his Divinity and constant presence on this earth both in word from the Gospels and in the Spirit as God.  The \"Moon of Memphis\" event is proof that God and Jesus Christ in Spirit is here on this earth and the true antichrists would make you believe that Jesus as a part of God was ever gone to begin with.  This is why John of Patmos vision may be a seed of Satan designed to make you fear Jesus Chris! t as a part of God or wish the end of this beautiful world.  God with Jesus Christ as the Son of God, known by other names in various religions, have worked hard to make this world better.   Do not be so vain as to think that humanity did it all alone without God.   We see the understanding and appreciation between nations and cultures; we see many nations dedicated to preserving peace and cooperation; we see much charity from many nations to other nations; we see animals receiving preserves and protection; we see kinder view of other religions; we see advancement in construction, science and technology; we see the human race living more comfortable and entertained; we see cooperation between nations to prevent and resolve issues of war;  we see remarkable improvement in medicine and health;  we see racial and sexual equality; and we see the advancement of food production. These are but a few of the many things that also truly mark the return of the Messiah for Christians and coming of the Messiah for other religions. A true sign of G! od, the \"Moon of Memphis\" is a sign that a kind God is with us and dedicated to all things living. Do not follow prophets of gloom, but understand that disasters are natural phenomenon that can not easily be predicted but we can overcome the trauma with our faith in a kind God and Messiah. The best of your religion will not fail you if you try to be kind in every way and not lose reverence to our kind lord, our God.  Since I was fortunate enough to witness the appearance of the light of the lamb, the \"Moon of Memphis\",  God and Jesus Christ love the world so much but understand the need for some to have the Revelations prophesy of John of Patmos fulfilled so the prophesy was completely fulfilled within the mind of me, William of God.  Within my mind was a world or earth that the spirits had made and everything that Revelations said would happen, did indeed happened according to scripture and prophesy.  I read Revelations in the New Testament and some of the events were in the physical world like visiting Whitehorse, Yukon twice without understanding the scripture significance of the White Horse.  Other event occurred with spirit visions in my mind that I could see and monitor.  This completed the Second Coming events of Revelations and allowed God and Christ to work with the world and earth of those who had not witnessed the Second Coming event of Jesus to use character, logic, reason, a! nd grace to help humanity to improve the world and work to make a heaven on earth for as many people and earthlings as possible.  The activities of God and Christ continues to this very day working with the spirits and humanity to make a peaceful and wonderful world for all life both physical and spiritual.  Minutes after this paragraph was added to this article, I heard a loud boom and power was cut from my residence and neighborhood at 1507 or 3:07 PM this clear sky Friday 18 November 2011.  By using his power to affect the transformer, God is saying that he is powerful and a transformer of life.  In 1990 at age 33 thirty three,  I was traveling to Washington, D.C. to my next assignment at USCG Headquarters.  I was on a highway from Florida north to Washington D.C. when I decided to say a prayer to God to help me on my next assignment.  At the moment that I said \"AMEN\", something happened.  My fingers were froze in the extended position and I went blind for almost my total vision. I could see just a little through a small tunnel and the rest of my vision was red.  It was just enough vision to get off the expressway where I stomped the brakes and waited fifteen minutes for my vision to return and my fingers to return to normal.  The phenomenon could have been a strike of lightening or it could have been just a mind phenomenon but when my vision and movement of my fingers became normal I was able to hear the voices of angels.  At age 33 thirty three the spirits of the Lord started to speak with me after being blinded for fifteen minutes after a prayer to God. The spirit gave revelations to me and in 1997, 33 thirty three years after the event,  a color vision of \"Jesus Christ\" appeared to me. Jesus talk many days with me about life on the earth and problems that exists with all of God creations.  Christ basically said God wanted humanity to be more reverent to all living beings and animals. The consciousness of each being or animal is precious and must be respected more. Before animals are killed, they should receive anesthesia and be put into a deep sleep. Anything less is cruel, heartless, and disrespectful  to animal rights and  to God.  Humanity should find a way to eat without killing animals, but until then, we must not kill an animal while it is awake. Treat innocent animals as you would like to be treated if you were in their place.  Many species of animals have a covenant with God that if! they are well protected and allowed to become numerous with the help of humanity,  then they will give their life when required to help humanity and earn a right to live in the heavens made for them.  At times some species are favored over humanity to help them, protect them, and increase their numbers.   If you put a human brain the form of most animals they would probably act as the do now.  To have dominion over other living creatures or animals requires that you treat them as you would like to be treated and that should be with kindness and mercy to avoid God's judgment or wrath against you.   The \"Moon of Memphis\" is proof that God does exist and we should obey Christ's message for us to be more kind to each living being and animals.  Each species of animals have their own lifespan which also dictate the time necessary for the young to be raised.  During their lives they have challeges that require much intellect.  The challenges of finding food, of social behavior, of mating, and of parenting their young.  Many species show much success, devotion, and intellect compared to many humans that exist in this world.  Though they have a smaller brain, they seem capable of showing human-like intellect.  This is because they have a God that assist them like humans or they somehow have human spirits in their minds.  God must create mind waves that help animals in a similar manner as God helps humans.  Because they have a God influenced mind from everything that exist, they must be revered more.  Human bigotry against animals is a form of prejudice that causes many humans to be heartless against them and for other humans as well.  If God shares it's mind with other forms of life, then do you think that God respects! those who seem to be insensitive, heartless, or cruel to other God influenced life.  An animal with a shorter life span probably values it's short life even more than humans.  It's life is precious and many religions totally ignore the santity of life of other earthlings to the point that they disrespect and get cursed by their God that suffers in these other harmed earthlings.  Those that connect true character with the respect and reverence of every form of life will be blessed, those with careless prejudice engrained through culture and religion will find their lives afflicted with pain and sorrow.  Nature is not dead in the mind but a very conscious and active God-like mind that will make life and death decisions based on the management of the various species.  Will the grim reaper think that you as an overpopulated human a kind credit to earth and it's many species or will you have to be weeded out with bad luck, disease, or spiritually warfare because of your heartle! ss closed mind to other living kinds of life.  If you neglect ! to learn from this article, then you many suffer a fate with a delusion that God doesn't truely exist and then suffer the consequences of nature.  If you are wise then you will learn that everything that exist is alive in its own frequencies and probable have a human or God like intellect that must be respected which includes each species of animals, trees, structures, lands, and even sky.  Jesus' birth in a wooden manger full of animals represents the specialness that Jesus' mind and nature had in common with the other special creatures of the earth; the animals and the trees.  His mission of salvation was meant for all things and life of the Earth and God.  He died to show us what was happening to the animals and trees who were very alive and needed humanity's love and understanding.  They needed help, respect, and salvation.  True salvation comes from understanding what God and Jesus was trying to tell humanity and only by kindness, respect, love, and avoiding harming these creations and life can God and even Satan give you peace.  Through the Christ power, the mind and spirit of trees, land, waters, and good animals have God's power and dominion over humanity and lesser spirits and lords to protect and preserve nature and require mercy and spiritual equality with humanity.  Jesus' suffering, death, and resurrection helped Jesus Christ to experience and unde! rstand what all life that is sacrificed and harmed experienced thus helping him as Lord and God to minister to the life that suffers and to strengthen his resolve to protect better and defend the life of animals, trees, humans, or spirits.  To avoid curses, retribution, and suffering, you must not harm anything because any harm has a price upon humanity and yourselves.  Those with a true love for Jesus and those he represent will find forgiveness and salvation; however, as he once stated, \"what you do to the least of mine people, you have done unto me\".  The manager full of animals and wood of trees with Jesus born to their witness reflect the people of Christ needing salvation and appreciation.  The enemies of the living things and creatures of earth; humanity and their spirits, also needed salvation for their sins against others that they harmed for their needs. Jesus showed the peoples of Christ how to face death, forgive those who harmed and killed you, and the miracle ! of resurrection by God that will be given to those good beings! who are sacrificed by God and humanity.  The Communion is remembering and honoring not only Jesus Christ but all life that is sacrificed for humanity and God's will for this world.  God wants people to be at peace with those who worship God in other religions. If a person or nation is reasonably kind regardless of their understanding of Allah or God, you should be friends with them. Do not war or jihad against reasonably kind and friendly individuals or nations. Work within yourself to be kinder and a better example of kindness to others and to animals. God’s character of kindness is true so do not follow those who urge you to harm or terrorize. God blesses any belief, religion, or culture that teaches kindness to others and to animals. Those who are mean spirited and cruel are not blessed by God and do not be deceived or lead by such individuals or organizations.  God believes that he has been fair in sharing the lands of Israel and Palestine. He believes that the followers of Christianity, Judaism, and Islam are the chosen people or Jews. Each is a religious belief of Jews of Allah or God with Holy books to learn of Allah's or God's will for you. Since Christians and Muslims are also Jews, Allah or God have allowed the religious and peaceful individuals access to these Holy Lands. Anyone near the Holy Lands of Israel or Palestine who is not a kind peaceful person will be cursed by God or Allah for violation of the peace and good will that God commands for all the Jews - the Bible Jews, the Koran Jews, and the Torah Jews.  God kept his promise to give the lands of Canaan to the Jews and he has done precisely that.  The Lord God asked Noah of the Bible and Torah to take care of wildlife.  The spirits of the Lord of the \"Moon of Memphis\" wants you to also help animals and plants and give land back to wildlife.  If you own a large section of land then give at least 40 percent to the wildlife.  Forty was chosen because it would create refuges all over the country side for the wildlife and plants to flourish and survive.  The word \"Buddha\" equals 40 and he would say 40 percent would make the most peace and harmony.  Forty is also associated with Jewish and Christian religions.   If you own small parcels of land then serious consideration should be given to allow the land go wild.  You can even plant some fruit and nut trees to help feed the wildlife.  If the animal has wings, then they must be Angels of Nature.  If you have a city or town lot and home, then try to feed the birds or angels to receive a special blessing from the Lord.  Your offering to the creatures of God in the form of food! and land will ease your spirit and soften your heart to all matters concerning life.  Your health will improve and you will receive blessings from God and you will help make amends for the sins that you want forgiven.  Many human illnesses, war, sin, and crime are caused when the spirits and God of land, fields, waters, trees, and animals war against humanity for cruel conduct against them.   Wildlife enjoy their life of freedom and it is possible for your spirit to be put into wildlife as a form of heaven for those who appreciate living free with nature.  Others may be required to live in animals minds that you harm to evolve your spirit to respect life more.  Many wild animals eat poisonous plants including agricultural plants with herbicides and pesticides, and have viruses that can contaminate your home so eating wild animals can cause you to have toxins and little known diseases that can cause shorter life spans.  Many small animals that rarely cause a problem to humanity or habitat should be protected like songbirds and never be hunted or killed by humanity. Natural predators other than humans should be allowed to affect them.  The wildlife covenant with God is to accept  a merciful ! move or possible death by God or humanity, when their numbers become too many and causing  significant harm to humanity or habitat, rather than a slower death by predators.    God tries to preserve their soul,  grant them land to live, and give their spirits good safe heavens such as in the minds of comfortable humans, other animals, land, trees, or sky.  What humans do to other earthlings will affect what the God mind in any geographic area does to humanity.  Hunters each year go to the wildlife areas to commit massacres of tribes of earthlings and cause their spirits to legitimately war on humans.  They can cause all kinds of mental and physical illnesses due to the trouble that hunters cause.  If you think that hunters have a God given right to murder other earthlings without retribution, then you are seriously wrong.  You should show God that you are reverent to all that God has made such as birds, animals, trees, and plants.  God will respect you more and love you mor! e if you can help the Lord take care of the other creations of! life.  The Bible, the New Testament, and the Koran speaks of phenomenon occurring when a tree is bothered.  The scriptures suggest voices and wrath could occur when trees are harmed.  The spirits of the \"Moon of Memphis\" suggest that since there is much electricity in a tree, it is possible for trees to think, dream or possess a form of consciousness recognized by God.  Trees may be a plant animal so be careful when harming a tree.  If it has nerves then winter is the season to prune them so they will not feel pain and curse you.  Cutting a tree at night may cause less pain since their consciousness are possibly stimulated by sunlight.  If you must cut wood then use the wood in a structure so the weight of the wood can reorganize into a acceptable consciousness and thus you will be cursed less.  Pray for your trees and pray about cutting them and if you feel it is wrong then don't cut them or harm them.  Show reverence to trees and save yourselves.  The parents who have children must apply kindness and justice to their discipline of children.  Never beat, hit or  whip a child just because they get on your nerves.  Harsh punishment and training should be reserved for the most malicious, cruel, or mean conduct. Evil conduct is dealt with more sternly than nerve troublesome conduct and honest mistakes should be dealt with a understanding, kind response. Do not be cruel to your children or you will be surely be cursed and many phenomenon of health could occur to you for cruelty.  Do not forget that as you want the Lord to forgive and give mercy to you, when a sorrowful child cries out for forgiveness and mercy, you represent the Lord and should not let your temper ignore your heart of kindness.  The spirits of God, Christ, and Allah the “Moon of Memphis” say that most rebellion and crime in most nations is the result of government failure to fulfill its role to its peoples. This can be discrimination against some segment of the population such as minorities or peoples with mental and physical disabilities.  In the more modern nations, minorities have rebelled and sued the government for equal rights and opportunities. Presently in most of the countries of the world the disabled have difficulty getting help in a timely manner. Disabled people, those with low learning abilities and mental disorders plus those with physical disabilities have been forced to suffer or forced to engage the sale of drugs and prostitution to sustain themselves to survive when the neglected by government and uncaring majorities. Government has a duty to provide the disable with a healthy pension or job so they can live a normal life and live a peaceful life free of crime and rebellion. The i! mprisonment of the disabled in most world countries by naïve and uncaring governments constitutes a gross civil rights abuse and cruelty. It is a violation against the duties of government and God to neglect and abuse the disabled and those who continues to ignore the disabled and abused them will be cursed by God and they will suffer mental and physical illnesses and bad luck from the spirits of God, Christ, or Allah.  In your memory of people you know, your mind makes spirits patterned after them. Sometime these spirits are loyal to the person they are patterned after. If you talk bad about a person then that person's spirit sometimes work against you by giving you bad subconscious advice and emotions and may be able to affect your mental and physical health. If you behave poorly, they may turn against you because you have lost their respect and love. If you keep bad friends then these poor or bad spirits may behave like your friends, saying things in your mind subconsciously to cause you to make poor decisions and make trouble for other people. You must not gossip or talk bad about others, especially against those you know closely and you must not get to know bad character individuals if you are weak in moral or law abiding behaviors. From watching television, you can even create spirits of people in the media or government. These spirits represent society and if you don't act right, the! y too can turn against you and make you ill. Everyone's mind makes spirits but most of the spirits influence the subconscious mind. Some people are disabled because they hear these same spirits in their conscious mind and sometimes they learn how to make changes in their lives and get along with them. Spirits are a fact of life but the Spirits of God are made from the \"Moon of Memphis\", the Earth, and from spirits that are especially good and kind; often influenced by religious texts of kind religions.  The spirits of Earth and sky can communicate with the spirits of your mind to influence your mind and body for various reasons and can create structured realities to affect you in usual positive ways but occasionally to bring you bad luck for something you have intentionally or accidentally harmed on this Earth.   The spirits of the land, trees, animals, humans, and sky can collect in the sky and make a glowing UFO that can be many acres in size and create light. Like phenomenon of dreams created from smaller size spirit matter in the brains of animals, in the UFOs, they can hover in space above a city or country and produce radio that is of good quality and very similar to human made radio. This is why some of the music and radio messages seem to be talking to what is on your mind because the spirits inside your head receive the signals also and guide your thoughts. These thoughts are designed to make you kinder, understanding of others, and forgiving to make you better and help you overcome negative thoughts planted from less honorable information given to you by other humans or human spirits and media sometimes behaving as the devil or Satan who may want you to be prejudice against others or act in a way that could cause you to harm others or become harmed. Listen for the kind thou! ghts and kind messages from God's UFO radio in words or music and receive security and wisdom from God.  This information is derived from analyzing the \"Moon of Memphis\" UFO phenomenon and radio phenomenon associated with God's spirits and voice phenomenon. Since the UFO produces light, there is no logical reason that would prevent it from producing radio and my personal experience strongly suggest that this capability exist.   The God of the \"Moon of Memphis\" would like the youth and adults to focus on character traits to improve themselves as citizens of this world.  The international scouting organization have focused on twelve traits and have lead this living witness to learn and live by them.  They are trustworthy, loyal, helpful, friendly, courteous, kind, obedient, cheerful, thrifty, brave, clean and reverent.  Your religious leaders, parents, community leaders and teachers may have other good character traits that you should also focus on to improve yourselves and be a honorable citizen of your community and God.  As Will-i-am of God,  a son of forests, fields, deserts, tundra, waters, land, sky, and cities,  I have asked the good Spirits of God of the \"Moon of Memphis\" to save the people of this world with good character and kindness to all earthlings.  They include the animals of Nature, food animals, trees, objects, structures, land, waters, sky, humans, spirits, God, and other forms of life.  These Spirits of God of the \"Moon of Memphis\" said that they would save them and try to bless them.  They ask the saved to help other people to develop good character and kindness to all earthlings so they too may be saved by the God of all kind religions, the God of the \"Moon of Memphis\" that appeared in 1964 to this honest living witness.  The God of the \"Moon of Memphis\" chose a boy named William to appear to because his name means \"protector of the weak and innocent\" and God of the \"Moon of Memphis\" also tries to protect the weak and innocent. The good spirits of the \"Moon of Memphis\" hav! e the power to save.  Jesus Christ is one of the good Spirits of God of the \"Moon of Memphis\" who also saves. In Matthew 5 of the New Testament of the Bible he says:   3aBlessed are the bpoor in spirit: for theirs is the ckingdom of heaven. 4Blessed are they that amourn: for they shall be bcomforted. 5Blessed are the ameek: for they shall inherit the bearth. 6Blessed are they which do ahunger and thirst after brighteousness: for they shall be filled. 7Blessed are the amerciful: for they shall obtain mercy. 8Blessed are the apure in bheart: for they shall csee God. 9Blessed are the apeacemakers: for they shall be called the bchildren of God. 10Blessed are they which are apersecuted for brighteousness’ sake: for ctheirs is the kingdom of heaven.    These verses show, for example,  some categories of people that the Spirit of Jesus of the \"Moon of Memphis\"  saves regardless of their beliefs or religion as long as they have learned to be good and kind.  The Spirit of Jesus of the \"Moon of Memphis\" appreciates the groups and churches that teaches his ministry and lessons devoted to character and to God.    God of the \"Moon of Memphis\" is not responsible for many natural disasters such as hurricanes, tornados, floods, droughts, and earthquakes. God is also not responsible for accidents and acts of violence but God can help you a little and maybe that will be enough to protect you most of the time.   You are loved by the Lord, our God, and God is dedicated to recreating many of the dead and injured by these disasters, accidents, and violence.  Do not be demoralized by them for the Lord cares about you and want you to not be harmed.  We may sense reasons for the disasters because there are many sinners in the communities but God prefers to work with sinners on an individual manner and chooses not to use disasters to harm a few individuals at the expense of the many.  God prefers and is limited sometimes to helping you by affecting your thinking so listen up to your conscious and subconscious mind for good advice to improve your safety and security. In addition, God of the \"Moon o! f Memphis\" uses its spirits to organize society to create schools, religion, industry, science, and government systems to improve society's behavior thus creating as many decent well behaved and helped citizens as possible to minimize suffering, dangers, and crime.  The spirits of the “Moon of Memphis” have moved me to comment on various topics. God wants you to pray to the Lord about your problems and hopefully, these comments will start you in that direction.  God  please help the hungry. If you are hungry and suffer, God will take away your pain in time. Those that feed the hungry will be blessed for their kindness.  Do not do evil while you suffer and the Lord will recreate you in better times if you stay honorable and endure faithfully.  God please bless the poor and improve their condition. If you are poor, do not do evil to sustain yourselves. God will try to improve your community if you live honorably and try to improve yourselves. If you die poor, God will try to remake you in more successful families so do not give up hope because this lifespan will one day end and you will get a new beginning.  God please heal the mentally ill. The Lord knows that you are suffering and do not give up on life. It may take a while for the Lord to help you but he is searching for people like you. If you perish, God will give you a new mind in your next life on this earth.  God please heal the physically ill. God will try to heal you with doctors and religious people. You may try to prepare yourself for you disability or death by being kind in every way imaginable. End the conflicts in your life and mind and know that you will one day inherit a new body and spirit.  God please help the lonely.  May your God open your mind and speak to you.  Avoid finding fault in others and be helpful to others and you will find friendship and love.  Do not give up your life to evil and harmful conduct and the Lord will bless you and you will not be lonely for a long time.  Try to improve your heart and character so others will like you better.  God please help the desperate men and women.   May you find each other to help each other with love and gifts of love to sustain you.  If you cannot find work then with your consciousness and God as your guide, try helping each other without being cruel and heartless. Be honest and honorable to those who befriend you to help you.  Do not have contempt in your hearts to others and they will sense your kindness and will help you with your needs.  God please bless the elderly and widows.  You are special people weakened by age and the loss of your love ones and friends.  Those that help you with friendship and love will also be blessed with God's friendship and love.  Make peace with your family and receive their considerate love and care.  God will one day welcome you to new dimensions of life so you must prepare by being full of grace and kindness.  God please stop the evil sinners. If you are a evil sinner then your fate cannot improve unless you immediately repent and follow a better behaved spirit. You will have much bad luck until you change to a kind decent individual. You cannot have peace in your mind until you change. If you are captured and imprisoned, then know that the Lord will work with you to help your bear your punishment honorably. If you must die for your sins and crimes, the Lord will try to help you live again in better circumstances so that honorable life will be easier to live.  God please help me to deal with enemies.  To love your enemy you must try to understand their culture, mind, and perspectives. From this understanding you can try to reconcile your differences with them. Examine yourself to see whether or not you are a good being or people. Correct your own culture, mind, and perspectives before acting against others or for God. War with your enemy only to defend yourselves and help God to stop their evil against yourself and others. If your enemy is generally good, kind, and honorable then lend yourself to their influence and love your enemy.  God please bless the dead. Do not grieve excessively for the dead for they are in God hands and they will be dealt with in a fair manner. The weak will be strengthened and the righteous will be rewarded. Others will be remade on this earth in better times and conditions. Rejoice to the wisdom and fairness of God.  God thank you for the blessed. If your life is good then try to be an honorable example of kindness. Your luck is intentional so you can carry the spirits of the less fortunate in your minds. Many lives have hoped to live in the minds of the blessed so enjoy your life and remember others that you share reality with. Charity and kindness should be your passion.  The spirits of the “Moon of Memphis” stated that billions Messiahs will be born on the earth. Some have already been born and are now youth and adults. These Messiahs will be from all the nations, all kind religions, atheists, most animals, and spirits. They will have much character and kindness to all earthlings.  They will be both male and female and they will be Holy.  These Messiahs will be of religion, science, industry, government, military, parenting, business, medicine, entertainment, land management, food production, judiciary, construction, charity, and many other fields and occupations.  Look for these Messiahs for the Lord has returned to the Earth to rule and assist this world. You will know the Lord by many names but the fulfillment of prophecy will occur. This world was visited in 1964 with the “Moon of Memphis” a sign of the spirits of God, messiahs, and prophets. They do have the Christ or Messiah mind that they radio into the minds of the good and kind of t! his earth. The Holy light will be visible by those who are fortunate and the kind spirit will be heard by those who are blessed; and they will be living witnesses of the return and presence of the Lord, our God.  The Revelation from the Christ of the “Moon of Memphis” explains how we will live again on this earth. We never die on this God blessed planet because it has life and it has a soul. The soul is everything outside the body that influences the brain to recreate the mind of a human. That is geography, language, history, religion, culture and species. These external factors create the mind and consciousness and will recreate you after you die. You pop out of life when you die and you reenter life by the \"conscious creating soul\" within a short period of time. You will probably have amnesia of your past life but you will certainly have consciousness again. If you made the world better and safer in your past life then you will come alive again in a world that you help create.  When God is at rest or allowing the natural world to recreate you then you have the phenomenon that was mentioned in the previous paragraph. God can collect your spirit by setting off a radio in your brain when activated by signals from the \"Moon of Memphis\". This would probably occur day or night when the \"Moon of Memphis\" is high in the sky or space above. When hovering it would be hard to tell whether it's the moon at low altitude or a star at high altitude.  When God wants you to be held accountable for your actions or if God wants to give special consideration to your spirit for it's accomplishments then you may experience unique mind phenomenon. Your spirit collected can allow God to do things to you in your afterlife. Heaven and Hell are two places that your spirit can go. It is possible for God to put your spirit in other people or in animals to help you understand them and their plight. If you are insensitive to others then God may recreate you in beings that you care little about. It's God's justice and you sometimes must evolve through those you don't care about. These might be animals that you harm or people that you cannot understand or help.  If you are a good influence then your spirit may be able to enter the minds of those you prefer.  Worship God, Christ, and the power of the \"Moon of Memphis\" and may God bless and have mercy on your spirit and soul.  Because animals have the goodness and kindness of nature, they should be never be harmed.  They have a lifestyle that humanity needs to respect and understand.  They must be allowed to roam the land without being molested or murdered.  God places the spirits of humanity often into animals as a heaven that some want or deserves.  If you grant the animals peace then your heaven will have peace but if you violate the heaven for animals by molesting their habitat and murdering them for fun and recreation then you will have to answer to God.   A good and kind heaven requires humanity to respect nature, the lands of nature, and the animals of nature, for the trees will be the pillars of your church called nature and in the minds of animals you will return to the garden of Eden, one type of heaven.  The UFO phenomenon may be the result of a natural intelligent life form that scientist have yet to understand and explain. I will offer one theory of how the UFO is formed and why they are of an intelligent life form associated to God.  I believe that there is a structured electro magnetic nuclear form that exist in space that absorbs light energy and it is a stable form made from light photons that no longer travel and other energy that no longer travel or move. It has a fabric or form that enables it to organize as a brain and store memory and information. It is an energy or spirit life form that collects and grows from light and energy. Over time, matter starts forming within it so it basically helps energy to reform into matter. It probably starts out is life span as a marble size intelligent life and grows into much larger size and eventually becomes meteors, comets, moons, planets, and stars. During it smaller youth size, it can enter there atmosphere and also enter to objects such as land, plants, animals, and clouds. Its can give consciousness to anything that it enters and in humans, it can cause people to hear voices of spirits and produce dreams. In trees, land, and clouds it also can produce int! elligence and phenomenon that is often associated with God.  These wisps of spirit energy beings can learn and affect other life in good or bad ways. These energy matter beings can also be religious or atheist in their outlook of themselves and humanity. They can come together, form large bodies of spirit energy matter beings, and form into impressive UFOs and start to glow from these collectives of spirit energy matter beings. Since they are intelligent, their collective can be organized into large multi-acre starships usually round in nature that can travel in the atmosphere or space. If they want to they can travel to other stars and disassemble and influence the mind of a planet and act as the God spirits to the life there. They could just find a star and grow to such a size to precipitate star energy into matter and form a planet. Other collectives can also in coordination with other collectives form into moons for the planet. This is how the spirit energy matter beings can influence reality and act as a conscious God to form pla! nets and UFOs.  If your mind has this type of spirit energy matter being in it, you probably are influencing it to create a spirit within it patterned after your consciousness and personality. If you die this being will probably leave your brain and carry your spirit to another location. It might take your spirit to a collective called heaven or maybe into a UFO or even choose to enter the brain of another person, animal, or other objects such as land, trees, or clouds. Great opportunities exist for those who are lucky enough to have one of these energy matter spirit beings in your brain.   If you want to signal the \"Moon of Memphis\", then put color lights on your front and back porch and color lights in your windows and light it every night for months and years. This will get God's attention as you stand out in the night and you will probably notice more dream activity. I have displayed color lights at my house for several years and it really works. This will help you get your spirit collected without harming the flesh and provide more peace and security to your mind as your lights call out to God for attention, love, and help.   Messenger of God of the \"Moon of Memphis\" William H. Bickers Capt USAF O-3 / Lt USCG O-3 Retired  PS:  People will believe what they want to believe but this article is both true and honest.  Much of the contents of this article has been published by these internet newspapers :  Memphis FM; Tennessee Post; West Virginia Post; Alabama Post; Arkansas Post; Washington State Post;  White House News; Security Council News; Pentagon Post; Israel Post; Israel FM; Saudi Times; Gaza News; Palestine Post; Iran Republic; Vatican Post; Muslim Generation; NASA News; World Wide News; Slavic Times; and many more.  I hope you received a blessing from reading this article.  Notes about author: I have worshiped in many churches such as Baptist, Methodist, Lutheran, Episcopal, Pentecostal, Assembly of God, Anglican, Catholic, Presbyterian, Church of Christ, Church of God, Military, TV and Mormon churches.  I believe that worshiping with others help you overcome prejudices and become one with the body of believers.  I also believe that every kind religion is another testament of God and much can be also learned of God by studying other religions.  I have visited some other countries and lands over my life.  The places that I visited are:  United States, Canada, Mexico, England, Scotland, Spain, Guam, South Korea, Japan, Australia, and the Bahamas.  I learned that we are very much alike all over the world.   Please show this article to your friends, family, and religious leaders if you could be so kind.  Everyone deserves to know about the \"Moon of Memphis\", the appearance of the Messiah.  Other evidence of a God both outside of my mind and inside of my mind is a piece of land that I bought at age 19 which just happen to be 6.4 acres of land that I bought to give back to God by allowing it to go wild.  It is my little Israel or Zion on the floodplain of the Loosahatchie River bottoms near Firestone city park of Memphis in Frayser.  This river is 64 miles long by the way which may be another reason the  1964 \"Moon of Memphis\" appeared within a mile of that river.   Another instance was when I had to find a house to rent I was not very conscious of its number significance until years later when I wrote this article.  My address was on a street in Frayser neighborhood of Memphis called Adair Street.  \"Adair\" has a numeric sum of 33 thirty three and the block was also 33 thirty three.  My initials equals 33 and I started to hear voices of spirits at age 33.  These two examples show evidence of a God in the community working structured realities with the cooperatio! n with the spirit of God inside my head.",
      "link": "http://www.nuforc.org/webreports/086/S86119.html",
      "state": "TN",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3ee",
      "summary": "A white full moon shaped ufo hovered for several minutes then started to ascend in the sky into space",
      "city": "memphis",
      "shape": "sphere",
      "date": "",
      "story": "A white full moon shaped ufo hovered for several minutes then started to ascend in the sky into space At 10pm Sunday 15 November of 1964 in Memphis Tennessee (USA), I was asked by my mother to take out the garbage.  I went out back and I noticed a bright white full moon above.  I looked closer and I noticed it had uniform whiteness with well define circular outline but I was not able to see the shades of white or grey that made the man in the moon face.  It was equally as bright as the real full moon, bright enough to create a moon shadow.   I looked around and I noticed another moon that was bright orange.  This other moon was rising over our neighbor's house to the east, as I looked through the side yard from the back yard to the front.  It had the features that created the man in the moon, so I believed that it was the real moon.  I looked above and stared again at the white full moon for a few minutes, then it made a rapid ascend in the sky. I estimate the ascend speed between 180 to 300 knots.  As it rose, it became a smaller and smaller moon until it appeared to looked like a bright star, then a dim star, then disappeared into space.  It reminded me of the Star of Bethlehem when it was at high altitude.   The event occurred within a mile of the Area 51 of Tennessee, that is near Highway 51 in the Frayser neighborhood of Memphis, Tennessee, and  the event lasted about fifteen minutes.",
      "link": "http://www.nuforc.org/webreports/082/S82905.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc404",
      "summary": "I know that what me and my daughters witness was not airplanes it was something that we had not seen before.",
      "city": "memphis",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "I know that what me and my daughters witness was not airplanes it was something that we had not seen before. Last night me and my two daughter's had just come from the corner store, they had gone in the house already and I was left outside I had to close my gate to my car. I was on my way in the house I just so happen to look up and saw what I thought was a high flying airplane. Well after about 1 min past this blinking light came from the east of me and I was about to go in the house when out of no-were another blinking light came from the west of the other light and they meet and in line of each other and I was like OMG these two planes are going to crash? I then ran to my door and called for one of my daughter's to come see she is fourteen years old and she came out and ask me what was I looking at and I said look at those two lights? She said I don't think those are airplanes? I said I know look how fast the lights are blinking? She said they look like UFO'S I ask her how do you know what it look like? And she said I've seen them on TV? And the one's I've seen ! on TV look just like these? By then my 9yr old came outside and ask what's up there in the sky mom? I said it look like a UFO or airplane? And even my baby said mama look at those lights over there and it was another blinking light they were blinking off and on so fast it was so amazing to us. After about 7 or 8 min we all went in the house because they the lights went over behind the trees and we could not see them anymore. After I got in the house I wanted to see them again so I was getting ready for the bed and happen to look out my bedroon window and the same two lights that we saw at first was back out over the top of the trees that I can see from my bedroom window, I called my daughter to my window and we watch them for about 3min and they just blinked out. I hope that someone else saw what we saw, I'm just glad I wasn't the only person that saw these lights. The fast flying lights were to far away for me to record it on my cell-phone, I was trying to record it.",
      "link": "http://www.nuforc.org/webreports/084/S84230.html",
      "state": "TN",
      "duration": "7 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7ee",
      "summary": "Objects over Memphis, 8pm mostly every night!  ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "city": "memphis",
      "shape": "cylinder",
      "date": "2011-08-07T00:00:00",
      "story": "Objects over Memphis, 8pm, mostly every night! 8 or 9 crafts, flying higher than airplanes, cigar in shape, some more cylindrical than others, some more pointed on the front end than others.  Most of them appeared to have a brighter tail end.  All of them were silvery in color.  No sound, seemed to just float by.  All of them were by themselves in the clear sky, except a pair that were travelling opposite directions came fairly close.  Not \"dangerous\" close, but certainly closer than airplanes fly together. These objects seem to appear out of thin air and we watch them in the sky until they have gone so far that we can no longer see them.  I have made a few other reports this past month and decided that 7:45-8:30pm CDT is the prime time to spot these things.  We have witnessed more that we haven't reported because they have all looked the same, appeared the same way, flew casually, etc. The past few observations we made, tonight included especially once it got around 8:15pm with the sun going down, was that there is a tiny blinking light at the tail end of these crafts towards the top back, although there is no \"tail\" like there is on an airplane.  These objects are perfectly smooth looking in contour, perfect cigar shapes and sometimes cylinder when the tail end looks abruptly \"cut off\" but still has the slightly tapered nose.  Also, there appears to be something stemming off the objects in the middle, coming off the side.  Almost like a wing, but certainly not long enough to be a wing.  The \"stem\" off the side isn't even half the size of the craft, not even a fourth of the size and is barely detectable.  The only way we can see it is by looking at the perfectly smooth contour of the craft in broad daylight (and sun going down) and you can tell some small object comes off the side of it. Some of them fly lower than others.  All of them fly higher than airplanes.  Make zero noise, float along slower than airplanes.  Silvery in color, more silver than airplanes.  Very pure looking.  They fly all directions.  This evening a couple flew towards Downtown Memphis, towards Southwestern Memphis, many towards the Frayser area, and some that go straight East from where we are which is towards the Germantown area.  These things are at least the length of a football field and you would not notice them at first glance because they are so high and the silvery color blends perfectly with clouds if you're not looking for it and once the sun starts going down, the objects take on that orangish-reddish color, so they are extremely reflective. We will be getting some tapes for our video camera now.  I think we can actually commit to this.  You know, I have been envious of people that see these things to what seems to be \"all the time\" and now that we are, we really don't know how to conduct ourselves.  I really wish you guys would send an investigator out here or something.  I know somebody else will be able to see them and they have been consistent now.  We are going to ask some people if they have some binoculars or anything.  Details of these things would be easy to make out with a pair of binoculars.  These objects almost look to be inspired by our airplanes, the way the long tube part of it is, except they aren't propelled \"forwards\" and have no wings and no contrail, of course.  We think there may be windows on these things, but we are not sure and are not willing to speculate that, but it certainly looks possible and it certainly looks as though we see these objects once they slow down tremendously from a g! reat speed.  We also see tiny \"blips\" in the sky like things moving so fast we can't see them, but it hasn't been worth mentioning because there's really nothing else to describe but that and that may sound crazy, but you just know there are more than what we can physically see at any given moment. The sky was very clear tonight, just like all the other nights we have seen them.  Oddly enough, there were zero airplanes taking off or landing during all of this and usually seems the case around the same time.  We have wondered if the airport picks these up on their radars (they must!) and stops sending flights out around that time and picks back up when we stop seeing them because that's exactly what we see happen.  A few airplanes take off at about quarter till 8 and it's usually dead till well after 8:20pm as these objects just float on by, then around 8:30pm the airplanes have their night lights on and are taking off as usual. ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82604.html",
      "state": "TN",
      "duration": "~30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc81a",
      "summary": "3 UFO sightings over Memphis. Weird jelly fish like spacecrafts",
      "city": "memphis",
      "shape": "other",
      "date": "2011-10-10T00:00:00",
      "story": "3 UFO sightings over Memphis.  Weird jelly fish like spacecrafts As I was on the way to pick up my mother from the Memphis international airport, I witnessed a strange object in the southwestern sky. At first I thought it might of been a weird drift of a cloud that drifted away from the cloud mass. As I was observing it closer I could tell it was definately not a cloud. It was a long and slim. It seemed to have a rounded front and what seemed to be long tentacle like rods coming out the backside. My 5 year old witnessed it and said it was a jellyfish, and no doubt it looked like a metal machine jellyfish. But it seemed like it was south of the airport but within 50 miles of it. It did not move it seemed as though it was hovering. I know what an airplane looks like becuase there were many airplanes in the sky at this time and it was not an airplane! As we observed this strange object we found two more that were very close to this one. They created a line that  seemed to lead to the Mississippi river. By this time we were f! reaking out and as we approached a tree line, we couldn't see them for less than 10 seconds, when the trees cleared they were gone, nowhere to be seen, as if they vanished into thin air. Another good description would be, if you've ever seen war of the worlds, the huge tripod machines is what came to my mind but these were airborne not walking around zapping people. I have heard of \"probes\"?? and this seems to be the case. I don't know what's going on but I'm pretty freaked out by this.",
      "link": "http://www.nuforc.org/webreports/084/S84451.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8ee",
      "summary": "More Memphis UFOs-- confirmed by investigator as U/I.  ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "city": "memphis",
      "shape": "other",
      "date": "2011-08-07T00:00:00",
      "story": "More Memphis UFOs-- confirmed by investigator as unidentified. Saw first craft at 8:52pm.  It was silver in color, cigar-shaped.  It had no contrail and was flying much higher than an airplane, but you could tell it was much larger than an airplane and had no wings.  It seemed smooth.  At times the silvery color appeared whiter or lighter in areas, but did not seem to be light, more the metal itself reflecting light?  That's a guess.  We watched it fly from West to East over a period of about 2 minutes or so.  It was long enough to watch it slowly glide out of sight.  At 8:03pm, I saw a solid black object in the sky.  At first I thought it was just a black bird because they are usually flying around, but I noticed it wasn't moving or if it was moving, it was coming straight at me.  Regardless, it was not fluttering about like a bird.  I watched it for a second, my girlfriend was on the balcony during all of this and I pointed it out.  She doesn't see as well as I do and I watched it get much closer before she was able to see it.  It was so far away or so high in the sky that I couldn't even make out a definite shape to this object.  Briefly, I thought I saw what appeared to be a triangle, but this object was sitting upright.  When it got to it's closest point near us, we could both clearly tell it was moving, rotating.  It would rotate around and turn itself as it was rotating.  I hope that's clear.  At some point, it curved off and started heading East (from the South).  Neither one of us could make out what shape this thing was.  It was! a solid upright object, not like the longer, more horizontal cigar-shaped object.  In the dropdown list before filling this out, I looked to see if any of those may have described it: like I said, it looked at some point to have at least a triangular edge to it, so it could have been \"diamond\" shaped, but I'm not entirely certain, but that's the best way to describe at least the edge I did see and the mass of the object itself.  This object appeared to have a haziness around it.  At it's closest point to us, it was probably about the size of my pinky nail if my arm was stretched out.  It was small, but very far and very high.  It stood out like a sore thumb because it was solid black on a light blue sky.  You couldn't miss it.  This one also moved much slower in comparison to the silver cigar-shaped object, which it probably why it appeared to be standing still when I first saw it.  Also, this thing came pretty much out of nowhere.  I don't know if I ever mention that, but! the same for the cigar-shaped objects.  We suddenly just see ! them and then watch as they glide away.  We never see them come INTO view.  They are just suddenly there.  Since we have frequently been seeing this, we contacted MUFON locally and I was contacted by an investigator.  While witnessing what I described above, I called the investigator.  He called me back later and it turned out he witnessed the exact same object I saw first-- the cigar-shaped one, heading the same direction, etc.  If it's any help to gauge the size of this object, he lives approximately 2-3 miles from me.  He mentioned that it was not an airplane, had no contrail, etc etc etc and ultimately it could not be identified. ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82732.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc928",
      "summary": "Object that changes colors. Easily spotted in the sky. Moves around quite a bit",
      "city": "memphis",
      "shape": "unknown",
      "date": "2011-10-25T00:00:00",
      "story": "Object that changes colors. Easily spotted in the sky. Moves around quite a bit Object is seen off to the west. Changes from red to blue. Moves around a little bit.",
      "link": "http://www.nuforc.org/webreports/084/S84788.html",
      "state": "MO",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3bc960",
      "summary": "10 Unknown objects over Memphis.  ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "city": "memphis",
      "shape": "cigar",
      "date": "2011-08-07T00:00:00",
      "story": "10 Unknown objects over Memphis We saw 10 tonight from 7:50-8:20pm.  I'm emailing you a picture I drew to describe it.  The second and third objects we saw we right behind one another, about 45 seconds apart, travelling slower than airplanes, no sound, and much, much higher of course.  All objects we saw this evening were traveling East, except one traveling Northeast and another traveling Southwest.  We frequently saw airplanes this evening in the sky at the same time as these objects.  We usually do not see airplanes in the air at the same time as the objects.  All 10 this evening were of the same, usual kind we typically see: silver, cigar-shaped, appear to float along with no sound.  The first one was notable because it seemed to be the lowest or closest of them all, enough to where we could make out what looked like a tail and a fin, almost like it was trying to appear to be an airplane, but looked nothing like an airplane.  So, we saw them all singly, spaced about 2-3 minutes apart o! n average, except for the second and third ones which were following one another rather closely.  After that there was one heading East and the only one that turned off and headed Northeast.  At this point, we were able to watch 2 in the sky at the same time again.  Only one of the objects had a blinking light on it, similar to an aircraft, but tiny and blinked a white or blue light that was inconsistent (i.e. i thought it blinked every second, it didn't).  I mention in the photo I'm attaching that the silver material looks like plutonium.  I have often suspected that these objects power themselves through nuclear power, which may explain the radiation they put off, the appearance of plutonium, and in some videos I have seen where they appear to turn on a fluorescent light that looks to be composed of the krypton element.  Sounds very sci-fi, but I think it could be likely. ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82738.html",
      "state": "TN",
      "duration": "30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc961",
      "summary": "10 Unknown objects over Memphis  ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "city": "memphis",
      "shape": "cigar",
      "date": "2011-08-07T00:00:00",
      "story": "10 Unknown objects over Memphis We saw 10 tonight from 7:50-8:20pm.  I'm emailing you a picture I drew to describe it.  The second and third objects we saw we right behind one another, about 45 seconds apart, travelling slower than airplanes, no sound, and much, much higher of course.  All objects we saw this evening were traveling East, except one traveling Northeast and another traveling Southwest.  We frequently saw airplanes this evening in the sky at the same time as these objects.  We usually do not see airplanes in the air at the same time as the objects.  All 10 this evening were of the same, usual kind we typically see: silver, cigar-shaped, appear to float along with no sound.  The first one was notable because it seemed to be the lowest or closest of them all, enough to where we could make out what looked like a tail and a fin, almost like it was trying to appear to be an airplane, but looked nothing like an airplane.  So, we saw them all singly, spaced about 2-3 minutes apart o! n average, except for the second and third ones which were following one another rather closely.  After that there was one heading East and the only one that turned off and headed Northeast.  At this point, we were able to watch 2 in the sky at the same time again.  Only one of the objects had a blinking light on it, similar to an aircraft, but tiny and blinked a white or blue light that was inconsistent (i.e. i thought it blinked every second, it didn't).  I mention in the photo I'm attaching that the silver material looks like plutonium.  I have often suspected that these objects power themselves through nuclear power, which may explain the radiation they put off, the appearance of plutonium, and in some videos I have seen where they appear to turn on a fluorescent light that looks to be composed of the krypton element.  Sounds very sci-fi, but I think it could be likely. ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82737.html",
      "state": "TN",
      "duration": "30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bcab5",
      "summary": "VERY LOW OBJECT w/ LIGHTS, sounded like helicopter, but WAS NOT! ((NUFORC Note:  Student report.  One of several.  PD))",
      "city": "memphis",
      "shape": "cylinder",
      "date": "2011-08-07T00:00:00",
      "story": "VERY LOW OBJECT w/ LIGHTS, sounded like helicopter, but WAS NOT! Circled several times. This evening, about 2:00am CDT, I was sitting on the couch watching TV when I heard what sounded like a helicopter circling the building really low.  I figured it was a helicopter going to the local hospital and dismissed it as not a big deal.  Then, I was still sitting there and heard it come back around again.  I turned off the window unit air conditioner to see if I could hear it better.  It was close.  I got up, opened the balcony door and looked outside and there was a dark cylindar-outline object with 2 lights on the rear, a red and a green one.  The red one was blinking, I think.  One of them was blinking.  There was also a spotlight on the front of the object.  The object also looked to have dark circles on the cylinder part that were just part of the craft itself, they were not lit up and hardly visible.  I screamed bloody murder to my girlfriend to wake up and to see what I was seeing.  She started to brush it off and was sleeping.  About that time! , I heard the sound of it fading back in towards me again.  Here it came again!  She got up this time and witnessed what I described above.  It was NOT a helicopter.  I thought it was when I heard it and even thought it still could have been after seeing it the first time because everything was so dark that I wanted to be really sure, but no, it was not a helicopter.  It was flying just as low as one though and when I first saw it, the cylinder dark part of it was facing slighting downwards, like it was looking for someone or something.  My girlfriend went back to bed, upset that she had to get up in a few hours, otherwise, I know she would not have wanted to miss the rest of this.  I stood there for a few seconds after it flew over that time and here it came again.  This time I knew it would.  I was excited and also kind of scared.  I had no idea what it was really doing, but it was astonishing to be so close to something that I could tell was not man-made.  When it came a! round this time, it started heading directly West, right towar! ds me, r ight towards my balcony door.  That's when I saw it shift it's light and knew that it did, in fact, have control over it's headlight/spotlight.  It never pointed the light directly into my apartment, but it pointed it right over me and I know that whatever was inside of the object definitely, without a doubt, saw me.  I was freaked out at this point because I have heard stories and read things about abductions and I was just not ready at this time, if this is what was planned.  So, I freaked out a little bit.  The object was flying directly over the 3-story leasing house next door that is only about 15 feet away from my balcony.  There is only a small space in between my building and the leasing office (it's a 3-story brick house).  The house has a chimney about 10 feet tall with an old antenna coming off of it that's about another 3 feet.  The object flew RIGHT ABOVE the antenna.  I'm telling you this object was no more than 15 feet above my head.  At this angle, it appeare! d \"wider\" or \"fatter\" more like a soda can, than it had from seeing it from the side.  I had grabbed a notebook and pen during all this and had began making sketches of it and I can see it in my mind, but was finding it hard to draw it on paper.  I have the sketches and am about to try to draw them in Paint or something.  We have been seeing objects for weeks and have been making reports here and have contacted MUFON on a local level here to investigate.  They are usually silver cigar/cylinder shaped and make no sound and appear to glide across the sky, seeming to appear out of nowhere.  We have witnessed them traveling slightly faster and higher than airplanes with a contrail of 2 lines that runs very close together and parallel and we have seen them fly slower than airplanes, at the same higher altitude with no contrails or sound whatsoever.  Recently, we have seen them appear, flying faster than airplanes with the \"double contrail\" then slow down, and have ZERO contrail and still no sound.  All of these are cigar-shaped and I have emailed you guys a picture I drew this last week or so of one of these objects and what I have seen on them that sometimes looks like a \"fin\" or a \"straw\" type of object stemming from the cylinder itself.  They are usually so high it's hard to make out what's on ! the object.  We have also noticed when it starts to get dark around 8:25pm, these same objects have a visible blinking red light on the top of them, sometimes in the middle of the cylinder and we have also seen them towards the tail end.  Tonight, we wanted to see if we could see them after dark, so we went out around 10pm and observed several of these objects in the sky at the same time... 2 or 3 sharing the sky at the same time within our field of view (which is limited from our balcony because of the house next door and trees across the street and we absolutely cannot see West or North at all).  These objects blinked erracticly like red/red/white/red/red/red/white/white/red/white/red/red/red, flashing brightly.  I also want to add after the close encounter highlight event of this evening/morning, I did actually see a REAL helicopter through the window, with the door closed, and was actually unable to hear it at all whatsoever.  To me, this is proof that this other object was even louder than a normal helicopter and certainly much lower.  Last, but not least, this may be the weirdest part in all of this, but hopefully you guys know how often we see this things now.  Well, sometimes when we are out watching them, I kind of say to them (the objects) that I wish they would come closer or lower so that we can view them.  I know this is going to sound really, really crazy, but it almost like this object wanted us to see it.  I did not witness anyone outside during this commotion of this craft, nor did I hear or see anybody afterwards.  It is like a desert town outside.  It is eerily calm and quiet.  I also want to add, although I do not fully know its significance, that last week sometime (not sure of the day) around 1 AM, I was sitting up by myself watching TV while my girlfriend was asleep.  I heard a very loud and very close BANG! right outside my window.  I then saw a flash of light right after it happened.  It was so sudden, so unexpected, so immediately unexplainable as anything natural at all, that my heart sank to my stomach and it began pounding.  I was so scared, I was literally frozen and did not know what to do.  Once I calmed down, I looked outside and decided that maybe somebody had busted a lightbulb out or something like that, but that doesn't even make sense either.  It was much louder than that and certainly on my level (the 2nd floor) and close enough that my neighbor lady on my level would have heard it and the guy that lives below her.  It was still after that.  No sound, nothing.  I told my girlfriend about it the next day and there was nothing out! side at all to remotely explain the sound.  Nothing was broken.  There were no large holes in anything.  Nothing out of the ordinary.  Until last night, around the same time I heard the noise before, around 1:20am, there was a loud BANG! boom, boom. then a rumble that lasted for a couple seconds.  This was NOT lightning.  It was not thunder.  It was not storming.  There were no rain clouds.  There was nobody outside.  Everything was still.  This scared the crap out of my girlfriend and it was almost like I didn't even flinch this time, even though it sounded like a shotgun went off outside my window and not even both of our windows, only one window.  That's how localized this sound was.  So, this evening before I heard the helicopter sound, I had looked at the clock at around 1:50am and decided that I guess we weren't going to hear that noise again tonight.  We had agreed to pay attention to the time in case it happens again (not that you wouldn't hear it), but she went to ! bed and I was still up and didn't hear anything.  It wasn't ev! en 10 mi nutes later when the helicopter noise began.  I hope you guys can make some sense of all of this.  I'm just along for the ride here, apparently. ((NUFORC Note:  Student report.  One of several from the same source.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82886.html",
      "state": "TN",
      "duration": "6-7 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb2f",
      "summary": "We saw 6 separate objects flying different directions with and without airplanes and in different flight paths than the planes!",
      "city": "memphis",
      "shape": "cigar",
      "date": "2011-07-17T00:00:00",
      "story": "We saw 6 separate objects flying different directions with and without airplanes and in different flight paths than the planes! Beginning at 8:05pm, my girlfriend was out on our balcony smoking a cigarette when she called me outside.  There was an object in the sky that was moving at a steady, casual pace towards the West, but as we were watching it, began heading south.  My girlfriend informed me that she had been watching it for a minute already and saw it fly past the moon, which is to our Southeast this evening.  Watching the object, we could tell it was not an airplane because it was SO high in the sky, there was no contrail, and the object appeared to \"float by\" instead of being \"propelled forwards.\"  Plus, for it to interfere with the view of the moon this evening, it would have to be flying very high and far away because the moon is at ~65 degree angle from us.  From our balcony, we see every flight that leaves Memphis International Airport, and THIS was not an airplane.  It was silvery in color and shaped like a long string, more cylindrical than cigar-shaped, but very narrow compared to its length.  It also appeared to \"grow a glow,\" but then it subsided.  It soon flew out of distance. So, we stood here in awe (we are still on the balcony now) and before we knew it a plane was flying West and here comes another one of these objects almost brushing the airplane!   We knew the passengers of the flight HAD to see this happen and we watched that object fly toward the East at about the same rate as the first one we saw, except this one was clearly lower and more cigar-shaped and looked to maybe have a light on each tip, but we are not really sure.  Each end was brighter than the silvery object itself. Before that one could leave our view, ANOTHER one flew from the East heading West and was flying against the other one.  They passed each other at about the same distance as the airplane and the second object.  So, that's three.  We watched them until they flew so far, we couldn't see them anymore. Then another one came and was flying Northeast at what appeared to be a slow, steady pace.  It seemed very casual, like it was in no hurry.  This one also looked cigar-shaped, same as the third one.  Same color, approximate altitude, etc. During all of this, we called a friend who owns a shop down the street who we asked to look outside toward the moon.  We talked to him on the phone for a minute and before we got off the phone with him, he saw an object to the South.  We couldn't see it, but stayed on the phone and it showed up.  Same type of object, cigar-shaped, silvery, although this one appeared lowest of them all, but maybe it was because it was heading our direction to a Northwest direction. We were off the phone with him and decided to stay out here knowing we would probably see more.  Then there was another one.  This one was different from all the other ones.  It's hard to describe the shape because it was so far up in the sky, but almost appeared like a cigar, but like it had something else on top of it or maybe kind of an L-shape to it or something.  Most notably, though, it had a reddish hue to it, like a haze, but not really \"light\" like it was shining, but maybe because the sun was going down and it was absorbing that color is my best guess.  That was at 8:28pm. We counted 6 total and it's 8:53pm now and we haven't seen anymore since that last one.  Also should be noted, we KNOW the airport had to know about that one coming so close to that airplane.  And we have not seen ONE airplane in the sky since that happened.  We are very used to the airplanes and never get tired of watching them even though they are around all the time.  I must say it is VERY unusual to go this long without seeing at least one airplane flying any direction out of the airport.  It's just unusual. I also want to add that I am in my 20s and have never seen anything like this in my life, not to mention so many.  I have always heard about them flying in groups, but we saw each of them singly.  The only time we saw more than one at a time was when the 2 were flying opposite directions of one another and that was weird.  Why we called the friend during all of this, though, was not only to confirm what we were seeing, but about 2 weeks ago, when my girlfriend was at work at the shop down the street, the two of them had spotted one of these objects then that she said looked just like these except the one she saw was bigger and appeared out of nowhere, disappeared, then returned heading the opposite direction, was reddish colored, and cigar-shaped with the brighter ends. We were so excited to see these tonight.  It must be a blessing or something!  It certainly is miraculous what we saw.  Oh, and I want to add, the friend we were speaking to on the phone, describe the clouds to look \"affected by electromagnetism\" if that means anything to anybody else.  We saw what he was describing and I would describe it as super thin clouds appearing to \"ripple\" across the sky... very huge.  I really don't think I would have noticed it had he not pointed it out, but it was very unusual, especially since the clouds were so thin and transparent.  The sun was setting so the whole sky was clear, purpley-blue and what cloud you could see was more purple and pink.  It's definitely the type of sky that suits this occasion. It's 9:06 and we just saw ANOTHER one, much, much higher than ALL of the other ones.  This one was heading north.  For being as high as it was, it must have been going really fast before we couldn't see it anymore because of the trees.  And then we just saw our first airplane since all the other stuff, heading East, blinking and clearly an airplane.  Wow.  Well, I will end this here.  If I have to do another one, I will.",
      "link": "http://www.nuforc.org/webreports/082/S82405.html",
      "state": "TN",
      "duration": "20 mins and watching"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb58",
      "summary": "More Objects Over Memphis",
      "city": "memphis",
      "shape": "cigar",
      "date": "2011-07-17T00:00:00",
      "story": "More Objects Over Memphis Following up with my report from last night, we wondered if these objects would show up again around the same time as last night and the time before a few weeks ago when my girlfriend saw one. We went outside to sit on our balcony a little before 8pm, as the sun was beginning to set and as the moon was rising.  At 8:03pm I saw the first one, which was much higher than all the other ones we had seen previously.  I wouldn't have been able to see it if I hadn't been looking for it, I suppose. During the total period of time of about 30 minutes we were out there, we saw 3 airplanes.  One going over us, one taking off, and one coming in.  They had their lights on, etc.  We knew they were planes compared to these other \"floating\" objects.  The planes also have clearly visible wings and tail.  We really double-checked ourselves a lot, especially after seeing so many. Within the next few minutes, I saw 2 more very, very high (I'm not even going to try to guess how high).  They all seemed to be cigar-shaped, but were harder to make out their exact contour because they were so high, but it was clear that it was just a floating silver line with a \"tarnished\" blackish tinge. My girlfriend saw the 4th one, which took me a moment to focus in on, but was able to confirm it heading West over us.   Then after a few moments, the last one came floating by, much much lower than all the other ones of this evening and last night.  This one had a much clearer \"cigar shape\" and was silverish in color, maybe hints of darker more tarnish-y areas.  We were able to watch it glide across the sky at a steady pace for quite some time.  At one point, from my angle it almost looked like a disc that was rotating forwards right side up, like a wheel and what was most visible to us was the underside of it, making it appear to be the cigar-shape.  My girlfriend said it was not only a disc rotating, but it was also shifting from side to side, but somehow was able to keep only the \"cigar shape\" of its side visible.  I also wondered if the cigar-shape may have been a ring of light that was wrapped around an invisible cylinder that may have been floating sideways in the way a ring would fit on a finger because when the object got further away it looked to be made of light instead of silvery, but it could have also been the sun going down. We are going to look out again tonight once it gets darker to see if any of them may glow or are visible in the dark at all.  And we will certainly be watching again around the same time of 8pm.",
      "link": "http://www.nuforc.org/webreports/082/S82425.html",
      "state": "TN",
      "duration": "Over a period of ~30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd01",
      "summary": "Red-colored, cigar-shaped craft seen flying over Memphis, Tennessee.",
      "city": "memphis",
      "shape": "cigar",
      "date": "2011-06-20T00:00:00",
      "story": "Red-colored, cigar-shaped craft seen flying over Memphis, Tennessee. Saw a red-colored, cigar-shaped craft at around 8:15, heading west, then it disappeared.  It reappeared, about 15 minutes later, going the opposite direction (east). Watched it for about 1-2 minutes, then it disappeared again.",
      "link": "http://www.nuforc.org/webreports/081/S81788.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd108",
      "summary": "Bright star-like dot - western sky - that moved silently at an angle towards the north before vanishing into the clear night sky...",
      "city": "memphis",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Bright star-like dot - western sky - that moved silently at an angle towards the north before vanishing into the clear night sky... Object appeared in the western sky and was moving at an angle up towards the north. Like the brightest star but moving.  No blinking lights.  No sound.  Faded out and vanished after ten seconds. I was sitting at a table in front of the Top's BBQ at Getwell and Quince, when I looked up and witnessed this. This was not a plane, nor was a star, as stars do not vanish.  No cloud cover for it to disappear behind, either.",
      "link": "http://www.nuforc.org/webreports/092/S92008.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3c1",
      "summary": "Day and Night - Saw object twice c.2009.  3-witnesses.  Very similar to that object in the Tulsa OK sighting c.1965.",
      "city": "memphis",
      "shape": "oval",
      "date": "2012-05-13T00:00:00",
      "story": "Day and Night - Saw object twice c.2009.  3-witnesses.  Very similar to that object in the Tulsa OK sighting c.1965. 1 Day, early evening hour, I was outside smoking on my carport.  As I was looking across the road over the tree line, a metal object traveled up and over the tops of trees.  It was silver with a copper strap that ran down the middle of it.  It was not \"floating\", it traveled with purpose.  It stopped and start on its way.  I hollered to my husband who was inside the house, to look out the window, by the time I went to knock on the window to get his attention it moved off towards the North East, until it disappeared behind tree line. Day 2 - Was a night time sighting.  First seen by my husband, then me, and then my daughter driving up the road from her work. We are in the country, no streetlights, so we saw it very clearly. It was the same object I had seen a month or so ago, (Day 1) but it was illuminated from within. No lights flickering, no blinking parts, no noise or sound.  It traveled slowly up and over the same tree line, then moved paralell to the tree line, and the illumination went off. We could not see or track it from then as it faded into the dark sky. Haven't seen it since. The object was the size and shape of the pilot cockpit of a hellicopter. Silver with copper strap down the middle of it.  It traveled with purpose and silent.  Was not a balloon or blimp. NAS Millington could not confirm nor deny seeing it on radar.  And basically made my husband feel like an idiot for calling with the information and sighting. I have a photo of what I saw.... I was watching a UFO special on TV one day and saw the exact same object on the TV!!!  I rewound it and took a photo off my TV screen. The object I saw is very similar to the photo of the sighting of Tulsa, OK c.1965. Thank you. ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88656.html",
      "state": "TN",
      "duration": "Twice - 1-5 minute sighti"
    },
    {
      "_id": "64d005f478aba2ec5a3be0c9",
      "summary": "Extremely reflective cylinder shaped object hovering then completely disappeared.",
      "city": "memphis",
      "shape": "cylinder",
      "date": "2012-07-04T00:00:00",
      "story": "Extremely reflective cylinder shaped object hovering then completely disappeared. My boyfriend and I were driving when something extremely reflective caught my eye.  I pointed it out to my boyfriend, and the reflection stopped. It hovered for about 7 more seconds and then completely disappeared.  No clouds, extremely clear sky. I have no explanation for the sudden disappearance. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90131.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be788",
      "summary": "Spherical metallic object high up in daylight sky gaining altitude and slowly heading west.  One witness observed a spider like orange",
      "city": "memphis",
      "shape": "sphere",
      "date": "2012-05-29T00:00:00",
      "story": "Spherical metallic object high up in daylight sky gaining altitude and slowly heading west.  One witness observed a spider like orange trail emanating from inside the orb.",
      "link": "http://www.nuforc.org/webreports/089/S89146.html",
      "state": "TN",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bed15",
      "summary": "A beach ball white orb at tree tops level traveling south at 5mph.",
      "city": "memphis",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "A beach ball white orb at tree tops level traveling south at 5mph. In the morning hours walking on Frayser Blvd, I noticed as beach ball size UFO at tree tops level cicular and white light and energy.  It was travelling 5mph south across the street headed to the center to the city of Memphis.  In numerology, the neighborhood &quot;Frayser&quot; equals 92 and this happened in 1992. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97604.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf349",
      "summary": "Metallic forest green with a dark circle around the middle. Seemed to be hovering and looked like a Weber grill without the legs.",
      "city": "memphis",
      "shape": "other",
      "date": "2013-09-30T00:00:00",
      "story": "I was driving down a busy side street. I saw what appeared at first to be a hot air balloon but there was no balloon.  Just a gondola shaped object in the sky.  It was metallic forest green with a dark circle around the middle.  Seemed to be hovering and looked like a Weber grill without the legs.  Pulled over to get a better look and it was gone.",
      "link": "http://www.nuforc.org/webreports/102/S102489.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf83c",
      "summary": "40 to 50 objects hovering over memphis tennessee",
      "city": "memphis",
      "shape": "diamond",
      "date": "2013-05-15T00:00:00",
      "story": "40 to 50 objects hovering over memphis tennessee me, my wife and daughter were driving from memphis to collierville corinth ms and i realized that there was an unidetified object just hovering right over byhalia. we were coming to all kinds of conclusions, helicopters or jets etc. but then we noticed atleast 30 more over the freeway pointing towards our way. they had red and white lights but you could tell that they werent normal lights. the lights were traveling around the object very fast as if it was only one light, and the red ones were just blinking. as i was looking at the first one we seen it was like it knew we was looking at it and flashed a light as if it winked at me. and even when i got to corinth ms i could still see them far out just hovering. they were so close together and so close to the ground that it was unbelievable! planes and helicopters make noises but these obvjects were quiet, no noise at all. i think theyre planning something just waiting for the right time to pop it off. they wer! e diamond shaped objects. it was just crazy. i searched on the internet to see if anyone else seen the objects but, nothing. i tried recording the objects but my phone mysteriously shut down! ive always been aware of the fact that they were out there but no one else ever believed me, even my wife! but now she knows that im not crazy. they were lined up for a while as if in formation. it was like we was walking down the aisle on the freeway.",
      "link": "http://www.nuforc.org/webreports/097/S97320.html",
      "state": "TN",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c02ec",
      "summary": "There was a aura or haze around the fireball with a tail.",
      "city": "memphis",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "There was a aura or haze around the fireball with a tail. I just pulled into my driveway and exited my vehicle.  Upon getting out I looked up and saw four to six fire ball shaped objects flying fairly low and not very fast.  Then approximately 100-200 yards behind were two more bringing up the rear.  All objects were heading north.",
      "link": "http://www.nuforc.org/webreports/094/S94925.html",
      "state": "TN",
      "duration": "30-40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c065e",
      "summary": "I was watching Gemimids meter shower when i observed a circular object with white lights that did not flash and red, blue, and green.",
      "city": "memphis",
      "shape": "circle",
      "date": "2012-12-20T00:00:00",
      "story": "I was watching Gemimids meter shower when i observed a circular object with white lights that did not flash and red, blue, and green lights that flashed. This objects direction was dropping down diagonally into the tree line.  It went s so that i could no longer see it all anymore not even when i stood on a chair.  It was gone.  Did not see object fly away nore return from the treeline.",
      "link": "http://www.nuforc.org/webreports/095/S95209.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c06ad",
      "summary": "Lights in sky.  ((NUFORC Note:  Possible advertising light??  PD))",
      "city": "memphis",
      "shape": "circle",
      "date": "2012-12-20T00:00:00",
      "story": "Lights in sky On my way home I seem four spinning white objects similar to a spotlight, going in circles and then combining.  Half of my neighborhood was outside watching the lights. ((NUFORC Note:  Possible advertising light??  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95258.html",
      "state": "TN",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c21cd",
      "summary": "Standing at my window around 0:00 brilliantly lit objects the size of aircraft carriers, passed by, one by one.",
      "city": "memphis",
      "shape": "rectangle",
      "date": "2014-05-08T00:00:00",
      "story": "in Memphis Tennessee standing at my window around 100 brilliantly lit objects the size of aircraft carriers, passed by, one by one. Standing at my half opened window at 6 minutes to midnight on May 7, 2014, lasting until ten minutes after midnight, May 8th, I saw objects that were the size of an aircraft carrier with such brilliant lights, especially those in front and behind that I could not actually see the object.   They moved very fast, one after the other, with several seconds in between, heading in the direction of the airport,  There were many many of them, maybe 100.   They made almost no sound at all, to be distinguished from jet planes which go by all the time and are noisy. ((NUFORC Note:  This is a hurriedly submitted, preliminary report from a friend of the witness.  We have invited the witness to submit a longer, more-detailed report.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109260.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c221b",
      "summary": "Orange lights fairly bright changed to white with a clear slightly oval circle around them and rapidly picked up speed.",
      "city": "memphis",
      "shape": "light",
      "date": "2014-04-24T00:00:00",
      "story": "orange lights fairly bright changed to white with a clear slightly oval circle around them and rapidly picked up speed. At 2029 Central Standard Time, I observed 5 orange lights coming over the apartment North of me.  They appeared one at a time, about 6 to 9 inches apart.   The orange lights began bright, with rays of orange light coming from each one but at different angles.  The objects moved slowly S-SW not in a straight line, more like two patterns one almost due south and the other angled more SW (alternating).   After moving a foot in the sky, the lights (one at time, the lead one) would begin to flicker for 1 to 3 seconds.  Then the orange light was gone and a faint white light appeared instead.   There was a a slightly oval clear outline like a contact lens around these white lights which moved faster and faster.  The speed quadrupled in the next two feet.  This ended at 2031 Central Standard Time.  The objects were also ascending while picking up speed.",
      "link": "http://www.nuforc.org/webreports/108/S108864.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c23c2",
      "summary": "As I stood outside on the telephone, I noticed something in the sky which at first seemed to look like a flock of birds. It seemed to",
      "city": "memphis",
      "shape": "unknown",
      "date": "2014-03-27T00:00:00",
      "story": "As I I stood outside on the telephone, I noticed something in the sky which at first seemed to look like a flock of birds.  It seemed to be in the form of migrating birds sort of a V shaped formation, the object was moving very slowly.  As the object moved closer I began to notice that it was not birds, but just a set of lights.  I stood there maybe about 2 minutes and watched the object go from a V shaped formation into a straight line.  I thought maybe I'm just seeing things so I ran into the house and had my sister come out just to make sure I was not hallucinating.  I asked my sister was she seeing this, he then asked me what was it? We could see directly through the object and there was nothing there but lights, no strings, no metal, or anything holding these lights in place.  The object then changed from a line into an oval shape and then back into a line. We stood there maybe 3 minutes the item went about 3 to 4 houses down from the house where I stood over the trees and then vanished into thin air.",
      "link": "http://www.nuforc.org/webreports/108/S108089.html",
      "state": "TN",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2988",
      "summary": "Circular green glow/light in clouds.",
      "city": "memphis",
      "shape": "light",
      "date": "2014-12-05T00:00:00",
      "story": "circular green glow/light in clouds Came home after studying.  Saw a green glowing cloud in the eastern direction.  There is a blanket of clouds and there's one almost circular section with a lime green glow.  It seems to intensify at times then dim down again.  The moon can be seen but its not near the green glow. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115745.html",
      "state": "TN",
      "duration": "1-2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c2990",
      "summary": "An extremely bright, white light shot across the sky that moved at a much faster speed than any kind of airplane, then it vanished.",
      "city": "memphis",
      "shape": "light",
      "date": "2014-11-26T00:00:00",
      "story": "An extremely bright, white light shot across the sky that moved at a much faster speed than any kind of airplane, then it vanished. I saw a large white light shoot extremely fast across the sky.  It seemed to be about 10,000 feet in the air, or maybe less.   The speed it was travelling at was way too fast for an airplane.  It shot across the sky for only a few seconds, then it disappeared into the clouds.  There was only one craft seen.",
      "link": "http://www.nuforc.org/webreports/115/S115600.html",
      "state": "TN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2aec",
      "summary": "One light, brighter than any star moved slowly across the sky and vanished.  30 seconds later a light sped across over my treeline.",
      "city": "memphis",
      "shape": "light",
      "date": "2014-08-29T00:00:00",
      "story": "One light, brighter than any star moved slowly across the sky and vanished.  30 seconds later a light sped across over my treeline. I stepped outside upon returning to my home near the University of Memphis, lit a cigarette, and looked into the sky, a habit of mine since I have always been interested in astronomy.  The sky was clear, dark, and surprisingly, for a Friday night.  I could see an unusual amount of stars.   But one light, which appeared to be a star was moving across the sky slowly, but fast enough to recognize it was indeed moving.  I stared at it, looked around, walked onto the street to get a better view, and looked up again.  It was still hovering, at a fairly consistent speed headed southeast from my vantage point.   I pulled out my phone to take a video, but I could not get enough exposure so i put it up.  Then all of the sudden, like the flick of a light switch, it was gone.  I looked all over the sky for another sign, but failed to.   So i called my friend who I was texting to tell him about what I believed was a ufo, and as I was talking to him, another light, with the s! ame brightness and size sped across the sky, almost as fast as a meteor that reaches the atmosphere.   It appeared in the center of the night sky and flew south over my treeline in a matter of a half a second.   I'm not sure if that second sight was the same object as the first, but they were two distinct sightings approximately 30 seconds apart from each other.",
      "link": "http://www.nuforc.org/webreports/112/S112791.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e9e",
      "summary": "Yellowish/Orangish oval shaped object flying northbound.",
      "city": "memphis",
      "shape": "unknown",
      "date": "2014-08-22T00:00:00",
      "story": "Yellowish/Orangish oval shaped object flying northbound I was sitting in my backyard when I looked up in the sky and saw what looked like a street lamp flying in the sky.  It was the color (yellowish/Orange) and the shape (ovalish/circlish) flying northbound. The light was zig zagging and also moving straight up/down and left/right.  I had never seen anything like this before and it gave me the chills. I ran inside and yelled for my brother to run outside.  We ran to the front yard/street where there were no visual obstructions. He witnessed the same thing I had.  While the object was travelling north,  The oval/circle shaped light dimmed at one point to somewhat of a dot like it would have if it were really far away, however it was in the same general area and then the light went back to normal.  Eventually the object still zigzagging, moving up/down and left/right travelled so far that I couldn’t see it anymore.",
      "link": "http://www.nuforc.org/webreports/112/S112567.html",
      "state": "TN",
      "duration": "5-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c30aa",
      "summary": "Green lights with a glare where fleeing across the sky.i sat in the drive-in theather when a green object spotted my eyes…",
      "city": "memphis",
      "shape": "fireball",
      "date": "2014-08-08T00:00:00",
      "story": "Green lights with a glare where fleeing across the sky.  i sat in the drive-in theather when a green object spotted my eyes... thought it was a green firecracker in the air, but it moved swiftly and a abnormal motion ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112129.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c33f5",
      "summary": "Black or grey large Boomerang-shaped object flew over mississippi river at night. No lights and completely silent.",
      "city": "memphis",
      "shape": "chevron",
      "date": "2015-03-20T00:00:00",
      "story": "Black or grey large Boomerang-shaped object flew over mississippi river at night. No lights and completely silent. We were sitting on a roof just east of the Mississippi river stargazing.  We then noticed this black object moving in the sky.  The object was somewhat difficult to see because it was black with no lights, but it was undoubtedly there.  It seemed to be in the shape of a boomerang or plane and it was rather large.  Three of us watched as it flew rather slowly and silently north.",
      "link": "http://www.nuforc.org/webreports/117/S117842.html",
      "state": "TN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3477",
      "summary": "Large green spherical light in the clouds.",
      "city": "memphis",
      "shape": "light",
      "date": "2015-01-07T00:00:00",
      "story": "Large Green Spherical Light in the clouds. Large Green spherical light in the sky to the north-east.  The light didn't move or change but after a few hours was gone.",
      "link": "http://www.nuforc.org/webreports/116/S116407.html",
      "state": "TN",
      "duration": "1-2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e35",
      "summary": "We seen a couple of them, then more came out of nowhere! They were in a circle at first then the started to fly really close. After tha",
      "city": "memphis",
      "shape": "disk",
      "date": "2015-07-03T00:00:00",
      "story": "We seen a couple of them, then more came out of nowhere!   They were in a circle, at first, then the started to fly really close. After that they formed a straight line.  They had at least 4 different colors down the side if it.",
      "link": "http://www.nuforc.org/webreports/119/S119949.html",
      "state": "TN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c48d9",
      "summary": "I was just outside chilling when I saw a triangular aircraft flying among the clouds. It had 3 white lights, one on each corner, and on",
      "city": "memphis",
      "shape": "triangle",
      "date": "2015-10-16T00:00:00",
      "story": "I was just outside chilling when I saw a triangular aircraft flying among the clouds.  It had 3 white lights, one on each corner, and one red light at the bottom.   It was pretty big out of what I could see, definitely bigger than how an airplane would look if it were flying that high.   It disappeared behind the trees before I could see any more of it.",
      "link": "http://www.nuforc.org/webreports/122/S122765.html",
      "state": "TN",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4aca",
      "summary": "((HOAX??))  White lights with a black belly in a triangular shape.",
      "city": "memphis",
      "shape": "triangle",
      "date": "2015-09-17T00:00:00",
      "story": "White lights with a black belly in a triangular shape. I was walking to my mail box,and I heard what sounded like a engine.  I saw a triangular ship with one light blinking on and off like it was failing.  I chased it cause I knew what the ship belonged to.  It disappeared into the tress of my neighborhood. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121901.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c500b",
      "summary": "Rectangular ship materialized north of Memphis, Texas.",
      "city": "memphis",
      "shape": "rectangle",
      "date": "2016-02-19T00:00:00",
      "story": "Rectangular ship materialized north of Memphis, Texas. On highway 256 towards Memphis, Texas around 2300 hrs.  Saw a large rectangular ship materializing into our asmopheric dimension.  Looked like a semi trailer very large.  It did not descend it actually emerged from a rift or portal like  spot about 200 feet above us as we drove towards Memphis, Texas.",
      "link": "http://www.nuforc.org/webreports/125/S125832.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5628",
      "summary": "We were on river front, looking up into the sky when we noticed a low flying gray triangle with a short tail..on this tail, between 6 a",
      "city": "memphis",
      "shape": "triangle",
      "date": "2016-07-08T00:00:00",
      "story": "We were on river front, looking up into the sky when we noticed a low flying gray triangle with a short tail..on this tail, between 6 and 8 lights were illuminated at different times, in a connect the dots fashion.  It stayed stationary but also appeared.to be swimming. More like a.sting ray...with a swift flick of the tail here and there.   We watched intil it faded from our vision.  There was a star that it blocked so I know it was an object… ((NUFORC Note:  Assuming a nighttime sighting, we have amended the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128185.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5aa0",
      "summary": "Today I witnessed a \"UF0\", on Winchester and Mendenhall in East Memphis.  ((anonymous report))",
      "city": "memphis",
      "shape": "disk",
      "date": "2016-05-06T00:00:00",
      "story": "Today I witnessed a \"UF0\", on Winchester and Mendenhall in East Memphis. Hello, Everyone!  Today I witnessed a \"UF0\" on Winchester and Mendenhall in East Memphis.  My boyfriend and I were in the turning lane when I noticed a reflection in the sky.  The reflection looked as if someone were beaming a mirror towards the sun.  Once the bright reflection went away I swear on my soul there was a saucer hovering in the sky for at least 3 minutes.   My boyfriend and I couldn't believe are eyes!!!  I tried to take a picture, but when I went for my phone it was dead.  Once we turned at the light it turned back to a reflection and disappeared.  Never seen anything like it, but i've seen quite a few \"UFO'S\" from Washington State, but this is my first encounter in Tennessee! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127201.html",
      "state": "TN",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c63b1",
      "summary": "Diamond shaped objects hoving over highway in and near Memphis",
      "city": "memphis",
      "shape": "diamond",
      "date": "2016-08-25T00:00:00",
      "story": "Diamond shaped objects hoving over highway in and near Memphis My wife, two adult children and I were driving from San Antonio, Texas, back to KY on 8/15/2016.  We arrived in Memphis between 23:30 and 23:45 on I-40.  While leaving Memphis on I-40 going towards Nashville, we witnessed a large diamond shaped object, hovering approximately 1000 feet above the highway.  It had several bright lights that alternating from a steady burn to a flickering behavior.  There was one red light that remained fairly constant.   We continued to drive because there was no place to pull over at that point on the interstate.   We witnessed approximately 8 or 9 more more similar objects spread over the next 8 to 10 miles of highway.   I was finally able to exit the highway and pull into a gas station where I got some mobile phone video and a photo of the last one.   We then continued on towards Nashville, and eventually took I-65 towards Louisville, KY. We were just south of the Elizabeth Town, KY, exit, when we witnessed another, identical, object hovering to the west of I-65.   We continued on to the Lexington, KY, area, with no further encounters.",
      "link": "http://www.nuforc.org/webreports/129/S129420.html",
      "state": "TN",
      "duration": "~15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6414",
      "summary": "I stepped outside at about 1:38 and immediately noticed two stationary lights in the northeastern sky. I thought this very unusual, bec",
      "city": "memphis",
      "shape": "light",
      "date": "2016-09-02T00:00:00",
      "story": "I stepped outside at about 1:38 and immediately noticed two stationary lights in the northeastern sky.  I thought this very unusual, because I can't usually see stars in this part of the sky due to city lights.  There were two lights one bigger, which I thought was a planet at first glance and the other much smaller.  They both had a white to blueish glow.  As I began to walk back to the front door, I took another look look up and they were both gone.  This was probably a two to three minute span of time.",
      "link": "http://www.nuforc.org/webreports/129/S129604.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c68e8",
      "summary": "Bright green shooting light.",
      "city": "memphis",
      "shape": "",
      "date": "2017-03-17T00:00:00",
      "story": "Bright green shooting light. A bright green light quickly shot across the sky toward the West and disappeared.  Very much like a shooting star, but green and there are were no stars out tonite!",
      "link": "http://www.nuforc.org/webreports/133/S133063.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6934",
      "summary": "Round glowing bulbs dims gets supper bright disappears leaving one. Them come the jets circling th bulb really scared us.",
      "city": "memphis",
      "shape": "circle",
      "date": "2017-04-07T00:00:00",
      "story": "Round glowing bulbs dims gets supper bright disappears leaving one.  Them come the jets circling th bulb really scared us Me and my mother are driving through Memphis on our way to Arkansas and we see three glowing round objects.  We turn away to look at the road look back up now there is three which proceed to do circle/zig zags around each other.   Then a third comes as a pulsating light between them disappears then reappears a little farther away with seconds.   Then two disapear leaving the one original one that is glowing bright.  We see small jet looking planes one flying directly above the other going straight toward it.   The bulb dims down so much you can barely see it as more little jets fly toward it from the opposite direction then more jets come maybe between 3-6 at a time some what circling the same spot where the light is the light kept getting really bright then dimming slowly.  I'm not sure what exactly is going on but the other planes seen it two.   I'm hoping we aren't the only people reporting this honestly really scared us.",
      "link": "http://www.nuforc.org/webreports/133/S133439.html",
      "state": "TN",
      "duration": "Until passing Arkansas st"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a54",
      "summary": "Bright light S of the Memphis-MS border that when viewed through a cell...can see it's actually moving fast.((NUFORC Note:  Sirius? PD)",
      "city": "memphis",
      "shape": "flash",
      "date": "2017-02-22T00:00:00",
      "story": "Bright light South of the Memphis-Mississippi border that when viewed through a cell...can seeits actually moving fast..vanishing and I saw what appeared to be an airplane to the North of my house Friday, Feb 17th 2017, but it was not moving.  I used the guide of a tree to verify it wasnt moving. Tonight, my neighbor told my husband to come out side and look at this object tonthe South of our house. I noticed it was the same appearance as what I saw Friday night. My neighbor though it was something doing surveillance. It doeant look like a star and it appears to be a bright light..or several bright lights in a row to make one. It is 10:10 PM as I type this and I have been recording it for over an hour. It moves similar to a flash light being waved spraticly in the dark and then it fizzles away and disappears...only to reappear a second later. I wish I could notify someone to docuement this better than I can...as I am using a LG Stylo 2 cell phone and have made numerous vidios over the past hour. By my naked eye, I can barely tell its moving, and it doesnt appear by naked eye to move a grea! t distance; but with my cell recording it, I am able to see it moving extremely fast sparaticly, actually disappearing only to reappear similar to a light splat. I emailed my local news to tell them what I am seeing and asked if they would also record it because thry might possibly be able to get better footage with a professional, high grade camera versus a LG cell phone. I have never ever experienced anything like this...and wasnt a believer in UFO's. Ironically, my 8 year old son has been watching u_ _ _ _ videos on UFO's and has been terrified to go to sleep the last few nights and I just finished telling him they dont exist...and if they did...they sure wouldn't come to Memphis where it's so populated and so much crime....I joked and alian would grt shot here..lol. This is unbelievably the most interesting thing I have ever seen. If anyone would like to see the footage I have, I'll gladly post or send it. I am going to keep recording it every night while it's here. I a! m 8 months pregnant and have to be up and at work in the morni! ng. I wi ll do one more recording before I go to bed. I wish someone could point me in the right direction of someone local to confirm this sighting! Anyone in my area of South Memphis...specifically Whitehaven, a half mile from the Mississippi border looking South. There are 3 stars that form a triangle to the left of it and 3 starsin a straight line to the right of it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132720.html",
      "state": "TN",
      "duration": "Ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c74e7",
      "summary": "It was about 1 a.m., I was standing outside smoking a cigarette with two friends and looked up to see a bright, orange/red-ish, glowing",
      "city": "memphis",
      "shape": "teardrop",
      "date": "2017-05-11T00:00:00",
      "story": "It was about 1 a.m., I was standing outside smoking a cigarette with two friends and looked up to see a bright, orange/red-ish, glowing light floating lazily in the sky.  It seemed to flicker, not blink (as some aircraft do), almost like the flame from a candle. There was no sound and my first thought was that it was perhaps some kind of magnesium flare or something similar, although it seemed to hover in the sky, instead of down in an arc like one might expect. It was visible to us for a minute, maybe two, then moved up and away, out of view, to the northeast. The shape was difficult to discern, due to the distance, but it looked almost like an egg or teardrop.",
      "link": "http://www.nuforc.org/webreports/134/S134045.html",
      "state": "TN",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e09",
      "summary": "Inverted cigar shaped or straightened chevron brightly glowing object passed east to west then vanished over river",
      "city": "memphis",
      "shape": "chevron",
      "date": "2018-05-31T00:00:00",
      "story": "Inverted cigar shaped or straightened chevron brightly glowing object passed east to west then vanished over river Driving west on North Parkway with my GF, in between East Parkway and Watkins.  We had been watching this thing for a couple of minutes.  This was certainly no drone, plane, helicopter, Chinese lantern, satellite or anything of conventional explanation.  Almost chevron shaped but straighter with a less defined apex to the angle of the shape. Very bright, totally silent, and appeared to be on fire but there was no trail or tail and it moved at a very steady but slow speed.  It could not have been a drone because we watched it vanish somewhere over downtown Memphis or maybe even over the river into Arkansas.  Our phone was dead and we left the charger at home.  No clouds for it to vanish into. When it was right above us it was so much brighter than anything else in the sky.  I've never seen anything like this.  I would say it was a fireball but the shape was wrong.  Also...the entire object was illuminated as if glowing brightly or on fire as opposed to something that had lights on it.",
      "link": "http://www.nuforc.org/webreports/141/S141592.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8071",
      "summary": "Bright colors of various intensities lighting up low level clouds and mists for nearly an hour.  ((anonymous report))",
      "city": "memphis",
      "shape": "unknown",
      "date": "2018-03-29T00:00:00",
      "story": "Bright colors of various intensities lighting up low level clouds and mists for nearly an hour. At about 11pm local time, looking toward the east, I and several others noticed the sky lighting up.  My first thought was that it was something akin to heat lightning, but it changed color from blue to orange to red to purple to green to white and it continued to light up the sky at random intervals for varied lengths of time while the entire phenomenon went on for nearly an hour.  It was a lightly stormy night with periodic heavy misting in the air so visibility was compromised.   All of us there tried explaining it away as lightning or a transformer shorting out or the like but all were forced to agree that none of our explanations fit.  The intensity of the lights was enough to light up between a quarter and half the sky.  At times it seemed there was a source low to the ground and other times it seemed high up in the sky, just judging by the relative brightness of the mists and clouds being lit and in which direction the brightness intensified.  The range and i! ntensity of colors, duration of the event, and overall unusual behavior and patterns suggested an event outside all of our experiences. It may well have been a weather event, I don't know, but if so it was one I've never experienced or had described to me by any person or textbook. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139303.html",
      "state": "TN",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c83e8",
      "summary": "3 triangular lights on 4 sets of objects, 2 sets of 3 then 2 set of 2 and 1 final one, soundless.",
      "city": "memphis",
      "shape": "circle",
      "date": "2018-09-13T00:00:00",
      "story": "3 triangular lights on 4 sets of objects, 2 sets of 3 then 2 set of 2 and 1 final one, soundless. Leaving my front door, there were bright lights in the air above me.  There were 3 lights in a triangular and 2 sets of 3, then 1 set of 2, finally 1 set alone.  Totally silent, moved at the same slow speed.  As they left my left field of vision, they just disappeared.  The silence was as unusual as the lights.  I used the car alarm, the horn screamed and yelled, but no one heard me.  I had nothing to photograph them.   I did call the police and a TV station, just to report if someone else, somewhere else, saw them. ((NUFORC Note:  The witness provided the time and date of the sighting during a follow-up telephone conversation.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143041.html",
      "state": "TN",
      "duration": "~3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a41",
      "summary": "Grey triangle moving very fast at night, east to west in North Memphis",
      "city": "memphis",
      "shape": "triangle",
      "date": "2019-09-12T00:00:00",
      "story": "Grey triangle moving very fast at night, east to west in North Memphis I was looking out across the field in front of my house and noticed a grey triangle shape moving across the top of the treeline (about 3/4 of a mile away).  It was moving extremely fast.  At first I thought it was just a cloud because it was grey in front of the black of the background sky.  But within a split second I realized hat it couldn't be a cloud because you just don't see triangle shaped clouds moving at approximately 1,000 mph.   Before i could grab a phone picture or do anything it disappeared into the blackness of the sky.  It was very weird. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148725.html",
      "state": "TN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e45",
      "summary": "5-6 yellowish lights moving slowly, yet not audible",
      "city": "memphis",
      "shape": "unknown",
      "date": "2019-01-11T00:00:00",
      "story": "5-6 yellowish lights moving slowly, yet not audible I was taking my dog outside earlier, when I saw around 5-6 lights in a horizontal line, the object looked like it would be a stereotypical ufo.  I didn't have my glasses on so I couldn't see it well, but the object appeared to be in an audible distance from where I was, yet there was no sound from it.  The craft was rather large, I would probably say around the size of a house.  The craft moved in a fixed speed moving slowly right to left.  When I ran I side to get my glasses, which probably took around 20-30 seconds, and returned the the object was gone. Afterwards I noticed that my wifi connection wasn't working properly.  I've seen another UFO before, that was similar to this, but I was in s different state st that time.  I didn't have my phone on me when I took my dog out, so i wasn't able to get a picture or video.",
      "link": "http://www.nuforc.org/webreports/144/S144367.html",
      "state": "TN",
      "duration": "Probably around 10 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e94",
      "summary": "I was driving down interstate 40 towards appling hwy64 and saw a boomerang shaped disc with one light moved fairly fast then disappeare",
      "city": "memphis",
      "shape": "other",
      "date": "2019-01-04T00:00:00",
      "story": "I was driving down interstate 40 towards appling hwy64 and saw a boomerang shaped disc with one light moved fairly fast then disappeared before i could get my phone out",
      "link": "http://www.nuforc.org/webreports/144/S144071.html",
      "state": "TN",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c91e9",
      "summary": "Silent orb of light, roughly the same size of a helicopter.",
      "city": "memphis",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Silent orb of light, roughly the same size of a helicopter.",
      "link": "http://www.nuforc.org/webreports/149/S149789.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c95ac",
      "summary": "We noticed that there were several extra bright what appreared to be stars. ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "memphis",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "As we were looking up in the sky to view a meteor shower, we noticed that there were several extra bright what appreared to be stars. These bright lights were moving in slow circular patters. I used my phone to enlarge the object and we could see bright orange lights. As we continued to study these lights, we saw more and more of them. They were in 4 different formations and the sky was filled with them. Some were in triangle formations and some were in straight line formations. We counted over 25 of them. They were hovering for hours and moving very slowly in circular patterns. We stayed and observed them for 3 hours, and they were all still there when we left. They were very far away, almost mistaken as extra bright stars, we could not determine the shape, but the lights were extremely bright.",
      "link": "http://www.nuforc.org/webreports/151/S151168.html",
      "state": "TN",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c9760",
      "summary": "lights across Memphis sky",
      "city": "memphis",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "lights across Memphis sky I watched a string of lights move across the sky in a south-easterly direction.  They all moved about the same speed and in a straight line.  I often see one but today, there were many.  I counted at least 25.",
      "link": "http://www.nuforc.org/webreports/151/S151518.html",
      "state": "TN",
      "duration": "5 to 10 min"
    }
  ]
}