{
  "city": "mesa",
  "fetch_timestamp": "2025-07-12T14:32:16.163691",
  "record_count": 164,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b424b",
      "summary": "Viewed a light yellowish-orange somewhat translucent triangular-shape object with an undulating light.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "Viewed a light yellowish-orange somewhat translucent triangular-shape object with an undulating light. While lying on our picnic table in our backyard watching the sky around 11:00 PM in late February in 1997, my husband and I suddenly sat up when seeing a light yellowish-orange triangular-shape object in the sky moving from north to south.  The object appeared somewhat translucent with an undulating light which changed colors (yellowish, whitish, orangeish) as the light moved in what appeared to be a counter-clockwise direction inside around the margins of the object.  The object looked smooth and rounded with no sharp edges or projections.  We heard no sound and it moved rapidly and quietly through the sky.  We observed it for probably less than 30 seconds.  My husband and I both hold college degrees, traveled extensively around the world, lived in Asia for five years, and never experienced an event like this.   My husband served six years in the military and is familiar with aircraft. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49554.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b438b",
      "summary": "Disk",
      "city": "mesa",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "As I went outside to smoke a cigarette, I looked at Moon to see what that the weather was doing.  Then I saw a \"disk\" (as large as the moon), traverse against the wind fly by.  No noise, no nothing.  It wasn't a balloon, nor a aircraft. Did anyone else see this?  It was so obvious how could anybody else miss it?? I'm only posting this in case somebody else saw it.  Thx",
      "link": "http://www.nuforc.org/webreports/049/S49703.html",
      "state": "AZ",
      "duration": "3 Secs."
    },
    {
      "_id": "64d005f478aba2ec5a3b43a1",
      "summary": "2 objects over Mesa, 10-15 thousand ft., broad daylight",
      "city": "mesa",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "2 objects over Mesa, 10-15 thousand ft., broad daylight 2 circular objects hovering from 7-9am over Mesa, AZ. they were hovering probablly at about 10-15 thousand ft. up. They were very bright and after the 2 hour period they shot away at unimaginable speeds ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49765.html",
      "state": "AZ",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4910",
      "summary": "I was watching my 2 year old son and happened to look up towards the sky. There was a black helicopter flying by first and then after i",
      "city": "mesa",
      "shape": "circle",
      "date": "2019-06-07T00:00:00",
      "story": "I was watching my 2 year old son and happened to look up towards the sky.  There was a black helicopter flying by first and then after it left 3 circular shiny objects were hovering.  They were quick moving and I watched them for a few minutes moving back and forth with each other before going inside to get my phone.  I tried to get pictures but the sun was blocking me from being able to take anything clearly.",
      "link": "http://www.nuforc.org/webreports/146/S146473.html",
      "state": "AZ",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d0f",
      "summary": "I saw a bright light in the southern sky. I grabbed my phone and shot the video as it head east north east.",
      "city": "mesa",
      "shape": "circle",
      "date": "2019-06-07T00:00:00",
      "story": "I saw a bright light in the southern sky.  I grabbed my phone and shot the video as it head east northeast.",
      "link": "http://www.nuforc.org/webreports/146/S146605.html",
      "state": "AZ",
      "duration": "2"
    },
    {
      "_id": "64d005f478aba2ec5a3b4dd9",
      "summary": "Two pulsating tricolor lighted objects; stationary - not hovering; approximately 20 miles apart; no noise; working in tandem?",
      "city": "mesa",
      "shape": "sphere",
      "date": "2019-04-25T00:00:00",
      "story": "Two pulsating tricolor lighted objects; stationary - not hovering; approximately 20 miles apart; no noise; working in tandem? Star gazing at 22:00 (Local); unusually dark, realized main road street lights out (?); spotted pulsating \"star\" in north eastern sky; not twinkling white light, but multi-color (i.e., red, blue, green) and very obvious, my [braced] binoculars still proved difficult to establish true shape, but my wife declared it to be a sphere (?). Estimated altitude approximately 10K AGL, and stationary - not hovering! I observed anomaly for over 20 minutes, then scanned westward approximately 20 miles, there in the sky (NW, same approximate altitude) identical, stationary, pulsating tri-color object.  Observed both objects for another 30 minutes.  Simultaneously witnessed commercial aircraft approach airfield via corridors (5K AGL?) were well below the western oriented object.  Object(s) altitude, bearing and distance unverified.",
      "link": "http://www.nuforc.org/webreports/145/S145850.html",
      "state": "AZ",
      "duration": "+1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f97",
      "summary": "Bright light in the sky in Mesa area.",
      "city": "mesa",
      "shape": "light",
      "date": "2019-04-12T00:00:00",
      "story": "Bright light in the sky in Mesa area Around 7:00pm we saw this bright light in the sky that looked like a miniature sun.  The light shape and color changed several times.  Also the movements were not consistence with known flying objects.  The sighting lasted about 25 minutes.  The shape got smaller and then looked like a star.  I have videos and pictures that proof what I saw. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145608.html",
      "state": "AZ",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b503a",
      "summary": "I was travelling on Loop 202 Beeline Highway heading West . Coming from the South were two perfectly round dull green lights on opposit",
      "city": "mesa",
      "shape": "unknown",
      "date": "2019-12-22T00:00:00",
      "story": "I was travelling on Loop 202 Beeline Highway heading West . Coming from the South were two perfectly round dull green lights on opposite ends of each other but directly across from each other about the distance of a medium to small size airplanes wing span.  These two lights did NOT blink at all and they were not bright like a conventional aircraft or helicopter as to be used for the purpose of seeing out ahead of where it was going. There were  (zero) no other lights whatsoever on this UFO. As it approached closer towards the highway and right when it got almost directly above me the light on the right side (as Im looking at it coming towards me) turned a reddish color and with the same dim and dull appearance. The craft that was flying was completely dark ,so i couldnt make out the actual shape of it. I thought I seen a quick glimpse of the craft as a other source of low light reflected off of it and It appeared to be like a flat triangle shape. The color ! of the craft was a grayish dull steel appearance with intricate box shaped  or square parts on the exterior located towards the center . I know it sounds like I seen alot but I really didnt and it happened so quick that the only image i have in memory to describe it. The craft also wasnt very high off the ground . It was a few hundred feet in the air . I completely lost sight of it after it flew over my car towards Red Mountain . After that main sighting there were 4 seperate bright super bright lights that hovered out South of Phoenix and North West of Phoenix.  2 each on each side of the 202. There were multiple helicopters flying out between these white lights as well as commercial aircraft coming in and out of Phoenix Sky Harbor Airport. The Airplanes and Helicopters are extremely easy to identify whether they are far or near. There was alot of activity in Phoenix at 7pm . I hope others that witnessed what i seen has the inclination to report it as well .. I got footage! of the white lights (4) of them on video on my camera phone. ! I wish I could of captured the dull green lights on the craft that was super close to me, but i wasnt thinking fast enough to get that . that one would even have the Pope believing without a doubt there are UFOs",
      "link": "http://www.nuforc.org/webreports/151/S151769.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5277",
      "summary": "UPDATE TO 2/6/97 MESA, AZ SIGHTING ALREADY POSTED TO NUFORC WEBSITE",
      "city": "mesa",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "UPDATE TO 2/6/97 MESA, AZ SIGHTING ALREADY POSTED TO NUFORC WEBSITE ..THIS REPORT IS TO SERVE AS AN UPDATE TO THE 2/6/97 SIGHTING IN MESA, ARIZONA... Per conversation with the NUFORC, provided here is a link to a g-maps pedometer map of the spot where the 2/6/97 Mesa, AZ sighting took place.  Also provided is an explination of what you will see on the map.  I encourage viewers to open the map in a new window so you may view it and the below explination at the same time. Here is the link to view the map:  http://www.gmap-pedometer.com/?r=1750635  ---------EXPLINATION OF WHAT YOU WILL SEE ON THE AERIAL VIEW MAP---------- In the aerial view we see the Mesa, Arizona apartment complex I lived in.  Notice two red markers, separated by a blue line.  Notice that the indicator to the left (outside the map) states that the distance between the two markers is .0242 KM (or 24.2 meters).  The red marker on the top is approximately where I was as I walked east.  The craft was observed flying east over the train tracks (just outside the complex) after it had flown past the silos (which you will also see in the photo).  In my original report, I estimated the lateral distance between myself and the craft to be \"60 meters.\"  This map has helped me to provide a much more realistic distance (just 24 meters!).  As discussed with the NUFORC, the altitude of the craft could still be estimated at 100-130 meters.  But, the main point of the estimate is that the craft was VERY close and VERY low.  From the point at which the craft was observed, it made a right turn and accelerated to terrific speed as it moved south, and out of sight.",
      "link": "http://www.nuforc.org/webreports/063/S63514.html",
      "state": "AZ",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b56ff",
      "summary": "Groups Medical Aliens do Healing on humans, animals, plants...",
      "city": "mesa",
      "shape": "",
      "date": "2007-10-08T00:00:00",
      "story": "Groups Medical Aliens do Healing on humans, animals, plants... They are aliens helping me to do a healing, is a medical group, they are coming to help the human race, they do surgery, balance and clearing the body parts heart,liver,kidneys,lungs, bone replacements, clearing past life isues,traumas,etc. in different levels, spiritual, mental,physical, etheric... they are from a different planets, they are working together with us to help the world!",
      "link": "http://www.nuforc.org/webreports/058/S58948.html",
      "state": "AZ",
      "duration": "60 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6100",
      "summary": "I AM WONDERING WHY NO ONE IN AZ IS REPORTING THE FACT THAT THE MASS UFO SIGHTING SEEN 10 YEARS AGO WAS ACTUALLY THE SECOND TIME THIS HA",
      "city": "mesa",
      "shape": "other",
      "date": "2007-06-12T00:00:00",
      "story": "I AM WONDERING WHY NO ONE IN AZ IS REPORTING THE FACT THAT THE MASS UFO SIGHTING SEEN 10 YEARS AGO WAS ACTUALLY THE SECOND TIME THIS HAS HAPPENED?   I , AND  SEVERAL THOUSAND PEOPLE HAVE SEEN THE SAME SHIP YEARS BEFORE.  I AM NOT THE ONLY ONE AND I HAVE YET TO HEAR ANYONE COME FORTH WITH THE SAME STORY..  MYSELF AND 6 FAMILY MEMBERS WITNESSED THE LARGE SHIP (SAME ONE  THAT MASS PEOPLE IN PHOENIX WITNESSED AND PHOTOGRAPHED)  AT 8PM IN 1981 OR 1982.  I WAS ONLY IN 6TH GRADE AT THE TIME , BUT THE SIGHT WILL NEVER LEAVE MY MEMORY.. MY TEACHER MR. CAPPUTO WAS ALSO A WITNESS AND WILL ATEST TO THIS..  JUST WONDERING IF ANY OTHER REPORTS HAVE BEEN MADE ABOUT THIS? THE SHIP CAME FROM THE WEST , PALO VERDE, LUKE  AIR FORCE AREA, THEN CAME DIRECTLY OVER OUR HOME. IT WAS HUGH MADE NO SOUND , JUST A WARM VIBRATION. IT WAS NOT A BLIMP OR PLANE . IT WAS LITE FROM WITHIN AND HAD WHAT LOOKED LIKE WINDOWS. IT WAS KIND OF V SHAPED , BUT VERY TALL. IT FLEW SO LOW AND WHEN IT REACHED THE END OF THE BLOCK IT SWAYED A FEW TIMES THEN WENT STRAIGHT INTO THE SKY AND IT WAS GONE.  I HAVE MORE BUT WOULD LIKE TO TALK TO SOMEONE FIRST. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56436.html",
      "state": "AZ",
      "duration": "35 MINS"
    },
    {
      "_id": "64d005f478aba2ec5a3b61f2",
      "summary": "Huge silver cigar shaped craft glides low and slow over a populated suburban area in Mesa Az followed closely by a military fighter air",
      "city": "mesa",
      "shape": "cigar",
      "date": "2008-03-31T00:00:00",
      "story": "Huge silver cigar shaped craft glides low and slow over a populated suburban area in Mesa Az followed closely by a military fighter air I was sitting in my parents pool facing south east. I looked up over my shoulder to see how much sun I was getting and saw a huge cigar shaped object sliding through the sky at no more than 200 feet up.  It was very shiny, seemless and big.   It was heading south east at a slow steady rate.  There was no indication of a propulsion system.  It was the same in front as in back.  It confused my senses because it was so huge that it should have been making some kind of noise.  I couldn't even hear it displacing air.   It was in view for no more than 10 seconds maybe less before the apartment complex next to my parents house obscured it.  About 15 to 30 seconds after it left my view a military jet fighter came right behind it low and slow.  The fighter validated my sense perception since it was obviously following the UFO and was loud.  It was very unusual for a fighter to be flying so low and slow over a populated suburban area.  I had never seen a jet fighter do that before. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62371.html",
      "state": "AZ",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6329",
      "summary": "In Mesa, AZ, I clearly saw a large triangular ship, flying slowly---it turned / flew away at terrific speed.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "In Mesa, AZ, I clearly saw a large triangular ship, flying slowly---it turned / flew away at terrific speed. Below is my February 6, 1997 sighting detail, which I also reported to www.ufoevidence.org in November 2005. Appearance / Description of Object(s): The craft was approximately 20 meters in lenth and 10 meters high. I believe it was triangular in shape, but I am not 100% sure. Because it was NOT dark yet, I could very clearly see that this was a flying vehicle, which accelerated at terrific speeds. It appeared lit as it moved south, after accelerating away from me. Size of Object(s): Again, 20 meters long and 10 meters high. With my thumbs tucked behind, my other 8 fingers may have covered it had I held them up. Distance to Object(s) & Altitude: Again, I believe the craft was about 60 meters away, and flying at an altitude of 100-130 meters. Description of Area / Surroundings: Mesa is a suburb of Phoenix, Arizona. The complex I lived in lies near an open field, train track and silos (south), at the end of a road that leaves the main road through town. Full Description & Details:  February 6, 1997 was my final day living in Mesa, Arizona.  The next day I moved to San Francisco. Done packing late in the afternoon, I left my apartment and began walking east, on the southern edge of the southernmost parking lot in the complex. I was headed toward the mailboxes to retrieve my mail for the last time.  To my right (south) was a concrete retaining wall that lines the complex.  Behind me, to my right were the large silos, which sit next to the train tracks.  There were no cars or trains passing by. Approximately 500 meters from the mailboxes, I began to hear a low humming noise behind me and to my right (south).   In my peripheral vision, I caught sight of a large triangular craft, the source of the low humming sound. The craft was flying very slowly, at an altitude of approximately 100-130 meters. It was flying over the train tracks, which lie about 60 meters from where I was walking.  At the moment that I turned my head to the right and looked directly at the craft, it stopped, turned right and accelerated to a terrific speed and disappeared.  The craft made NO noise above the low humming I initially heard.  It emitted NO exhaust, fume, smell or fire. It was very much like watching a movie, in real life. Can sighting be explained as any conventional man-made or natural object? NO way.  This was a craft that was being flown by somebody. ANYBODY who saw what I saw would instantly have known that.  The only question I have is, who was flying or controlling the craft?  Humans?  Extra-terrestrials?   Witness Background: I'm a teacher in Brooklyn, New York having recently changed careers from advertising.  I have a masters degree in education.  My undergraduate studies focused on marketing and political science and Arizona State University (1990-94). Views on UFOs, before and after sighting: BEFORE the sighting, I was very open to the possibility that some sightings could be attributed to military tests.  However, I had seen some stories and movies that were compelling with respect to the notion that some UFO's could actually be extra-terrestrial.  Beyond that, I paid no extraordinary attention to the question, mainly because I felt the odds of seeing something inexplicable were very, very low.  AFTER the sighting, I spent nearly a month in denial that it even happened.  Then, on national news, I saw the \"Phoenix Lights\" sighting on mainstream national news.  My first response was, \"That's what I saw.\"  Then, I was not in denial, but also did not speak much of what I saw except with very close friends.  Within the last year, my curiosity has risen again, though it is very frustrating to imagine that I may never know exactly what I saw.  However, recently I have had very vivid dreams which strongly suggest that what I saw was extra-terrestrial in nature.",
      "link": "http://www.nuforc.org/webreports/062/S62425.html",
      "state": "AZ",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6375",
      "summary": "A small dark purple quad-thruster craft hovering 200-300 feet in the sky.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2008-02-14T00:00:00",
      "story": "A small dark purple quad-thruster craft hovering 200-300 feet in the sky. I just recently have remembered an event that happened in my early childhood years.  I was about 8-9 years old playing football in my street with my brother and a friend that lived 2 houses over. I looked up into the northeast sky and noticed a small/medium craft hovering.  It looked to have 4 thruster looking devices on the underside of it.  If I could compare the underside of it to something, it looked like an one of those simon says electronic games.  Each of the 4 thrusters had a flap dangling from the outside rim of the undercarriage.  As the craft would ascend, the flaps would uncover the thruster simultaneously.  If it would descend, the flaps would cover them up.  The top side of the craft (not very visible to me) looked to be a half sphere. The craft's body was a black/dark purple shade. This took place in East Mesa, very close to the Apache Junction/Mesa boarder. Just south of the US60. Major crossroads: Baseline and Guadalupe ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61313.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6fc2",
      "summary": "Very large oval shaped object about the size of the City of Phoenix flying through the clouds.",
      "city": "mesa",
      "shape": "oval",
      "date": "2008-02-14T00:00:00",
      "story": "Very large oval shaped object about the size of the City of Phoenix flying through the clouds. My family and I were driving from Queencreek AZ to our home in Mesa, AZ.  We were on the U.S. 60.   My wife was driving and I looked out in front of me at what I thought was a funny smoke shape about 30 miles plus away.  It had a ribbon like shape and was vertical  thus my thought it was smoke.  However it was in the middle of the horizon and maintained its shape for the entire duration of this experience.  I continued to watch this trying to figure out what it could be.  It seemed to appear and disappear over and over with a waving like motion.  I then saw these round like puffs that looked like something bursting in the air like when you see movies of flack but the \"smoke\" was white in color.  What really seemed strange was that this explosion then seemed to reverse in outward movement to inward and more condensed.  It was then that about 10 Miles away I saw something that looked at first like a hot air balloon going through fog.  It was at that moment that I thought, \"Wow\" there is fog really low going horizontal to the freeway.  Then it appeared again even closer and it the object came into view and looked more like the front end of a blimp, however it was huge.  I thought, wow that fog is alot closer to the ground than I thought and the blimp looked as if it was within 30 feet to the right of us.  It was then that I saw that my eyes seemed to adjust and realize that what I was thinking was a low fog was a very high cloud and around along ways away.  I yelled out loud, \"WHAT IS THAT?  I realized that whatever it was, it was the largest object I had ever seen.  I told my wife to look but she was driving and could not see what I was looking at.  It was at that time that we passed the 202 ramp and the 60 dipped.  I watched the object all the way until the wall next to the freeway covered my view.  My wife kept saying, \"should I pull over?\"   I didn't know what to do.  I kept waiting and looking to where I thought it would emerge from the end of the cloud into open blue sky.  It had been! clear a ll day and we where out at our with our friends and so clouds were the last thing I expected.  I did not regain view of the clouds where the object was seen and I told my wife to exit the freeway.  She exited the freeway at power road as I looked into the sky looking back and forth scanning the whole area for a low flying hot air balloon a blimp or something else as the path seemed to be heading toward the opening sky.  We drove north on power until Broadway and never again saw this object.  It was then that I saw  a jet flying in the opposite direction as the object I saw and the jet was still pretty high flying the normal pattern toward PHX Sky Harbor airport.  I gasped when I realized the magnitude of what I had seen.  The object dwarfed the plane like a plane against an upside down mountain.  I continued to reflect back on what I had seen and can only say that it was only the front end blimp shaped in front and the smoke like ribbon was the same object passing through the clouds giving the solid object the smoky like appearance.  It was not a cloud behind another cloud. It was a definite Oval object and I would estimate it from just the nose and from how far away the clouds where that it was bigger than the size of the city of Phoenix.  I don't know what it was, or what it belonged to. I know that I saw something and I know that it was a solid object.  I have never seen anything that big except for a mountain.  It was not a mountain.  The object I saw was skimming through the clouds and because of its huge size it through my perception of the actual distance of the clouds way off.  The planes that flew in toward Sky Harbor were still very high above the ground and the clouds where still higher in the air then they were.  No low flying  clouds.  These clouds where pretty high.",
      "link": "http://www.nuforc.org/webreports/061/S61379.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7180",
      "summary": "A brilliant orb hung motionless then moved directionally side to side, up/down turned west - could see aircraft was circular.",
      "city": "mesa",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "A brilliant orb hung motionless then moved directionally side to side, up/down turned west - could see aircraft was circular. I am a public school teacher and do not drink or do drugs.  I have never seen a UFO nor have I, until now ever placed much stock in the belief of such occurrences.  I am reporting a sighting I witnessed at approximately 11:30 PM on Jan 6, 2007 in Mesa AZ.   My friend called me into the backyard to see what he called an unusual aircraft.  I was standing in my backyard facing south and saw a very bright orb or ball of light approximately 1000 feet above the ground and about 1-2 miles away..  It was about 40-60 feet in width, stationary, glowing and hovering just above my treetops.  It remained there for approximately 5 seconds, then \"floated\" slightly downward in a vertical direction, immediately slightly sideways in a western direction and then started turning westward.  As it turned, it tilted downward and the light became less evident and its shape was more visible.   It was a circular aircraft with what appeared to have as one brilliant head light with a circular light pattern of about 6 lights around it.  The lights were mostly white and red, switching to either all white or just all red.  It was silent and did not make a normal jet engine sound or any sound that would indicate to us that it was a helicopter or airplane.   Living in the Phoenix area we witness nightly, helicopters with spotlights.  This was not at all similar.   As the object floated westward it did so silently.  Within 10 seconds I could no longer see it.",
      "link": "http://www.nuforc.org/webreports/054/S54570.html",
      "state": "AZ",
      "duration": "10-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b717f",
      "summary": "Brilliantly glowing object could move directionally anyway, silent and houvered in a circular pattern and was a circular shape.",
      "city": "mesa",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "Brilliantly glowing object could move directionally anyway, silent and houvered in a circular pattern and was a circular shape. I  am a non drinker, nor drug user.  I work for a church and have never seen what I considered a UFO, though I do believe such phenomena exist.   On Jan 6, 2007 at approximately 11:25 PM, I was standing in my backyard when I looked directly southward into the sky and noticed what appeared to be brighter than normal airplane or helicopter lights. It was approximately 4 miles south and about 800-1000 feet off the ground.  At first, I thought maybe it might be a blimp coming in my direction so the display would be on its eastern facing side. But as I watched the lights I saw that it was moving faster than a blimp would and it seemed to turn to the west and sit stationary with 6-8 white lights in a circular to square configuration. The lights alternated from all white to red.   Having seen numerous airplanes being situated in the airplane flight path to Sky Harbor Airport, I observe that most aircrafts have 2 flight lights in the center with one red and one green light on the end of the wings.  These lights I witnessed seemed more brilliant than normal and the manner in which it flew was unlike any aircraft I had ever seen.  It seemed to float in a circular pattern and also moved directionally slightly to the east and then west and up and then down before it turned and headed west.   At this point I went inside to tell my friend to see this.  Her report has been sent in also.   We immediately came out and as I was describing to her what I saw, we both saw in the south west sky approximately 1-2 miles off, a glowing object seemingly hanging in the sky about 40-60 feet in width.  I don’t know if this was the same object or a second one as I had gone in the house for about 30 seconds to get my friend.  It didn’t appear to be a helicopter or airplane.  It appeared to turn on its left side and I saw a bright singular light and 4-6 smaller lights surrounding it in a ring shape pattern.  Although dark in the sky, I could see that it was an aircraft with a shape unlike an airplane.  It moved without any engine sound or propeller sound.   It stayed for about 10-15 seconds before floating westward quickly and silently.",
      "link": "http://www.nuforc.org/webreports/054/S54573.html",
      "state": "AZ",
      "duration": "30-60 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b762e",
      "summary": "doesn't appear to be aircraft, helicoptor or other recognizable object.  ((NUFORC Note:  Sighting of the star, Sirius.  PD))",
      "city": "mesa",
      "shape": "unknown",
      "date": "2006-12-07T00:00:00",
      "story": "doesn't appear to be aircraft, helicoptor or other recognizable object Looking due east, approximately 2' up from the horizon, a stationary spinning light with green, red and white lights.  Seen through binaculars.  ((NUFORC Note:  Sighting of the star, Sirius.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53333.html",
      "state": "AZ",
      "duration": "currentyl"
    },
    {
      "_id": "64d005f478aba2ec5a3b7af5",
      "summary": "Unknown light in picture of the arizona sky in january",
      "city": "mesa",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "Unknown light in picture of the arizona sky in january On the night of January 28, 2007 at approx 20:15 I was taking pictures of the ring around Moon caused from moisture in the air.  I took several pictures to the eastern part of the sky while using a delayed shutter speed of .7 on a 5 mega pixel Kodak camera.   When I examined the pictures I found a strange light on one area of the first picture I took that was below the Moon in the bottom portion of the picture.  Thinking I may have snapped a picture of a commercial aircraft I took several test pictures to check. I took pictures of one helicopter and two commercial aircraft at different altitudes.  When I compared the pictures I found them to be different.  This is something I am unsure of and  have no area of expertise on.  I would like it if someone else could check this out.   Thank you for taking the time to look at this and I would love to get some insight back.",
      "link": "http://www.nuforc.org/webreports/055/S55006.html",
      "state": "AZ",
      "duration": "4 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8087",
      "summary": "Events throughout my life",
      "city": "mesa",
      "shape": "other",
      "date": "2008-10-31T00:00:00",
      "story": "Events throughout my life   I am not wanting this to be shown.. I have written several times . Many of my reports do not have accurate dates. I have had several things happen.  Anyway.. I have a question that I am hoping someone will have an answer to.   When I was in 6th grade , approx 11 years old, my family and I witnessed an exstreamly large craft go from the west to the east side of town and directly over our home. It started out looking like a brilliant , bright  white light traveling very slowly from the west phoenix area. We were alerted to it by my brother who was on his way home with his father who lived in Scottsdale. He noticed it while on the freeway and was very concerned to see it still in the sky when he arrived to our home which was at Gaudalupe and Dobson rd. My whole family- Mother ,grandparents , step father and one of my brothers friends- all went outside to see what he was so upset about. We observed this  object coming closer to us . It was , no joke, about the size of a football field. It didn't have lights on it like it looked from far away. As it got closer we could see it was illuminating from within. It made no noise, just a low kind of warm humming sound. Not like a blimp. It was flying  low and it was  exstreamly large. I would say if you were to hold your hand out you would have to put two fingers together to cover it. My step father worked at air research at the time and even he was puzzled as to what it was. It was not a blimp, plan, or helicopter. It looked like it had windows completely around it, or possibly metal  panels and if I remember right it almost (im not trying to make a joke) but it kinda looked like the starship enterprise. Only in the sense that It seemed to have two sections to it. It was moving super slow .When it reached the end of our block it swayed a bit and you could see it was wider that our street. It then sped up and took of ,very fast north east and was gone. Absolutely gone. The next day I said something to my teacher.. He got very excited and made me go to the principles office and draw a picture for the principle. They both questioned me.. My teacher had seen it also and was using me to try to help prove his story.. It was very outrageous and I am sure very unbelievable if you hadent seen this for yourself.. I am getting to my question.. please be patient.  .. Now when I was sixteen, living in the same home, I had a very unexplainable event. I was coming home from my best friend house .. She lived 2 miles from me. I left at exactly 8:50PM .. I know because we use to watch the Waltanns religiously- of all shows!! anyway,  the show ended at 9pm. I was also due in at 9 , if I was late I would be grounded.. At sixteen that is the worst thing in the world to have happen.. My parents were strict and I was never late. So I pulled in front of the house , shut off my VW bug and then I was surrounded by the most intense blue-white light. My car kinda rumbled .. Its very hard to explain. I at the time thought I had been hit by lightning,I could feel the energy. Thats what I attributed it to at that second,  without realizing it was a totally clear night. The color of the light was  not a color I can explain.  It was blueish white. It consumed me and the whole car. Then it was over and I jumped out of the car and ran in. I was greeted with two VERY upset parents. I was an hour late. I had completely forgot what had just happened.. Even when trying to defend myself. I had no excuse and was very confused.. All I know is I left at 8:50 and walked in at 10pm.  I called my friend sobbing, screaming at her for making me late.. She defended the fact of when I left and said I was crazy. I was traumatized because I was not allowed to see my boyfriend for a week, or talk on the phone.. I didnt recall the light thing for about 3 to four years later. To this day my friend remembers the event.. We are still very good friends.. We still cant explain why i was late or what happened.. I am writing wondering if anyone has had a similar event.. If anyone has seen something then while at the same location they have a loss of time or some other unusual event.. Is it possible that the first time we saw the craft it was the first of several visits? I am not making much sense.. I guess I am wondering -if it is possible that abductions occur, do you think they make a planned route that they trav! el?.. Do they scope out , or survey areas and people  first?  I am confused and still want to understand what happened.. I have had 2 other events in my life where I have had the same light consume me. It is an unforgettable color I have never seen duplicated, even in the movies.  Only one of the other  times  I have  a witness to my time loss. Again, at the time you forget what has just happened, and are left just completely confused. .  All the times I remember seeing the light , but never seem to be able to comprehend it or associate with what is or has happened. I am not a very good writer, I hope this makes sense to someone.. I really hope I can get some kind of understanding of this.. Is there any other people in Az that something like this has happened to them? One thing I did not mention.. The friend of my  brothers who witnessed the ship with my family the first time, he still to this day will not talk about it.. He will admit he saw it, but CAN  not elaborate. I tried to talk with him about 6 years ago and he gets all sweaty and freaked out.. He actually almost crys.. He cant talk about it for some reason.. Im wondering if  possibly something happened to him and he remembers it too much.. Or is it possible he had bad things done to him, or ma bey his mind cant comprehend something that happened to him that night? I am hoping someone can give me some kind of answer or insight... .. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66033.html",
      "state": "AZ",
      "duration": "45 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b80d0",
      "summary": "Self-luminous, flourescent-glowing , disc-oid object appears stationary in central Arizona skies",
      "city": "mesa",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "Self-luminous, flourescent-glowing, disc-oid object appears stationary in central Arizona skies At approximately 1852 Arizona time and for a duration of approximately four to eight minutes, three of four family members including an adult married couple and their twelve-year-old son observed a self-luminous disc shaped craft with a more cone-like underbelly which emitted an intense, even, luminocity in a visible light spectrum similar to the light emitted from flourescent home aquarium lighting.  The object was stationary and continued to be observed from the corner shopping center, surrounding streets, neighborhood and from any point on the family property adjacent to the eleventh tee of the Painted Mountain Golf Course in far northeastern Mesa, Arizona.  The duration of the sighting was between four to eight minutes with a desert monsoon thunderstorm cell moving in from the north at approximately twenty-five miles per hour ended the sighting by piling in to mask in part, then wholly obscure the apparantly stationary object.  The angle of observation f! rom the mean horizon (Horizon is mountainous and a badlands region) of approximately forty degrees of angle.  The Azimuth from the driveway of the witnesses' home was a north-northeast heading of approximately twelve degrees.  The size of the object was similar to that of a seseme seed when held at arm's length.  In binoculars, the object appeared to be flatter than an upside-down candy kiss, but disc-shaped, with a round top and a slightly cone-shaped extended belly. Cell phone photo images appeared as nothing more than a faded point of light.  No detsil was descernible. The sun had already set minutes before but the waning afternoon had not quite reached the twilight stage.  No stars were visible in the northern or eastern sky above or between thundercells.  The quality of the light on the object precluded any possibility of it being illuminated by reflected or refracted light from the sun due to it being the wrong color and spectrum. SPECIAL NOTE: OBSERVER'S OPINION:  If the object were in fact an intensely glowing helium weather balloon, the altitude would be above twenty thousand feet and the size of the expanded gas bag would be a quarter of the internal volume of a sports stadium.  The flourescent spectrum-appearing internal glow was of an intensity that battery power for such a structure would be the size of a Uhaul trailer and would be too heavy to lift. This thing appeared too brightly lit, and was possibly too big to be an air force of NASA balloon construction. The location in the sky was north of and to the left of the northeastern approach corridor for Phoenix Sky Harbor International Airport and aircraft inbound and on approach to the runways were lined up to the east at an azimuth of approximately 80 degrees and were sporting intense, halogen landing lights in a spectrum completely different from the object.  That approach corridor takes the aircraft over the northern crags and spurs of Superstition Mountain and the Tonto National Forest. The entire flight pattern was at far lesser altitude than the object and was under the acumuated thunder cells inbound from both east and north. Lightning was flashing at a rate of severa discharges per minute both east and north from an azimuth of 120 degrees to zero degrees.",
      "link": "http://www.nuforc.org/webreports/072/S72288.html",
      "state": "AZ",
      "duration": "4-8 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b80fe",
      "summary": "It was around 7:00 pm when I noticed a bright white sort of haze non moving light.It was at a very high alltitude because at first I th",
      "city": "mesa",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "It was around 7:00 pm when I noticed a bright white sort of haze non moving light.It was at a very high alltitude because at first I thought that is one very bright star,and you could not see any other stars.I would say it was a very big object probably 40,000-100000+ feet up so it could not be landing lights on a commercial jet.This sighting happened right as a storm was moving in,I lost visual sight of it when the clouds blocked it.I got video of it on my digital camera but it is of poor quality.",
      "link": "http://www.nuforc.org/webreports/072/S72241.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b80fc",
      "summary": "Bright white light turns yellowish then fades away into space.",
      "city": "mesa",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Bright white light turns yellowish then fades away into space. As i was with my friends smoking a ciggrette at the park i looked up into the sunny sky and saw a bright white object. it was way to early for any stars to be seen. but up in the sky was a Very bright circular light that did not flicker at all nor had any noise. after we watched the object for 5 min it turned yellowish. i could see that the object was INSIDE of our atmosphere. as we watched and watched the object over a 20 min time span it seemed to shoot out into space then simpily dissapear.",
      "link": "http://www.nuforc.org/webreports/072/S72244.html",
      "state": "AZ",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b81e2",
      "summary": "Large gray Zeppelin or blimp shaped craft sighted north of Mesa, AZ",
      "city": "mesa",
      "shape": "oval",
      "date": "2009-03-19T00:00:00",
      "story": "Large gray Zeppelin or blimp shaped craft sighted north of Mesa, AZ One evening in June of 1995 I saw a large gray Zeppelin or blimp shaped craft among some small gray clouds in the shadows over the mountains north of Mesa, AZ, East of Phoenix. The reason I'm reporting it as a UFO is that it had no markings or lights on it as required and was hiding in the clouds. I was driving West from Florence Jct. on Rt. 60 towards Mesa at 18:00 just before sundown and was still about 20 miles from Mesa when I noticed it among the clouds North of Mesa. At first it looked like 4 small clouds floating South but then 3 of the clouds continued to float South while the 4th one turned and went back North over the mountains when it looked like it might end up out in the open over the city. At that time I could make out the football shape and was able to identify the craft as a Zeppelin or something similar. I continued to watch it for about 30 min. as I drove West until it disappeared in the shadows over the mountains to the North. I've seen the Goodyear blimp and the Fuji blimp and it wasn't either of them, it was much too big, all gray and had no lights or markings on it and looked a lot like the one moored to the Empire State Building at the beginning of the movie Sky Captain.  The odd thing is I searched for Zeppelins on Google and the last one seems to have been decommissioned around 1940. This sighting was before the Phoenix Lights so I figure something like that carrying a structure underneath with some lights on it at night could have been the cause of some of the reported sightings. Then, last year I saw a story about a new model Zeppelin that was flying across Texas and Arizona on it's way to California about the same time all the UFO reports were coming from Texas. It was on the local news in Phoenix because it stopped briefly in Tucson. Here are some photos and information about the craft that flew to Calif. but I believe this one is smaller then the one I saw: http://zeppelintransit.blogspot.com/",
      "link": "http://www.nuforc.org/webreports/068/S68699.html",
      "state": "AZ",
      "duration": "30 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b825b",
      "summary": "golden orb's flying about.",
      "city": "mesa",
      "shape": "oval",
      "date": "2009-01-10T00:00:00",
      "story": "golden orb's flying about. During a concert wich i performed,the band took a 10 min break between set;s.My wife & i were outside when i noticed several goldish orbs in the sky.Enormous in size,approx,the size of a dime.What i first dissmiss as flares,soon becomes obvious that theyre not.These object;s did things that flares cant do.I took the last 2 pics.off the roll of film in our camera.These objects were so bright we had to squint to look at them.When i got the film back to my astonishment,the objects were cloaked,dark on a dark sky.I believe these to be e.t.enjoy.",
      "link": "http://www.nuforc.org/webreports/067/S67315.html",
      "state": "AZ",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b8689",
      "summary": "Brilliant cone-shaped light to the WNW of Mesa, AZ.",
      "city": "mesa",
      "shape": "cone",
      "date": "2009-08-05T00:00:00",
      "story": "Brilliant cone-shaped light to the WNW of Mesa, AZ. At 7:40p I went out to grill, looked toward Sky Harbor and noticed a brilliant light toward the WNW at about a 40-45 degree elevation a couple thousand feet above some whispy clouds. I brought out my hunting spotting scope, and after focusing I saw it was cone shaped, upright, and clearly self-illuminated. I went out into the yard to look around to see if I could spot any stars at that time. I didn't see a single one. I went into the house, brought out my 7\" (dia) telescope and tried out various lenses. By this time the cone had gradually lowered in elevation, had maintained its brilliance, and moved slightly further south from where I'd seen it (total elapsed time about 5 minutes). It stayed in our range for about 45 minutes or so. Toward the end of its visibility, it quickly diminished in light intensity, to the point where it appeared to be a faint star. We then lost sight of it behind a tree, and I had a hard time tracking it due to its dimming. The light itself appeared cone shaped. The upper left corner appeared a bit rounded, the upper right corner was more squared. The light color itself I'd have to describe as what you'd see when looking at a fluorescent bulb; nearly a pure white. When looking through my Galileo telescope, directly below the bottom of the cone I saw a very small point of light. Unfortunately, because I had to rely on telescopes to spot the object, I was unable to get a photo of it. There was plenty of air traffic around, but I saw/heard zero fast-movers, and having seen flares fired from both helos and fighters, I can absolutely confirm this was no flare. My younger brother flies AH-64D's in Mirana. When returning to base tonight he heard several aircraft communicating with Williams Gateway tower explaining what they'd seen, and the word \"balloon\" was mentioned. Again, I've seen many balloons, to include both weather and hot-air, and this looked nothing like either of them.",
      "link": "http://www.nuforc.org/webreports/070/S70461.html",
      "state": "AZ",
      "duration": "45 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8983",
      "summary": "Three circular lights clearly not typical aircraft floating and moving away smoothly.",
      "city": "mesa",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "Three circular lights clearly not typical aircraft floating and moving away smoothly. While driving eastbound on Main Street between Val vista and greenfield roads my stepfather and i witnessed 3 bright lights separated randomly in the sky. The first two lights were in the north with one a bit further east and it seemed to be a bit closer to us.  The light closer and to the east (will be further reffered to as light 1) seemed to be shone in our direction because of the way the rays came off the light and how bright it was.  Light two did not seem either as bright or to be shone in our direction. Light one seemed to be floating and not really moving in any direction until it slowly turned the light toward the south and began to move across the sky.  The light didn't seem to move in any massive speed, but it did not go slowly either. (i am a terrible judge of speed and distance)  Light #3 was in the south east and was slowly moving south.  Lights 2 and 3 were not nearly as bright as one and thus i seemed to really only watch 1.  It was also the closer light so it caught my attention more.  My stepfather was mostly watching the one from the passenger side which was in the south on his side of the car. I know what an airplane looks like as i live under the flight path for Sky Harbor and these lights did not blink and had no red to them at all.  I also concluded it could not be a police chopper because for the light closest to us to be that bright the chopper would have to literally be aiming at us.",
      "link": "http://www.nuforc.org/webreports/066/S66817.html",
      "state": "AZ",
      "duration": "40-60seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a5a",
      "summary": "At sunset, a large cloud approached from the SW to a pos. approx. 10 km from us.  ((NUFORC Note:  We see clouds only.   PD))",
      "city": "mesa",
      "shape": "cigar",
      "date": "2008-10-31T00:00:00",
      "story": "Sighting 08/31/08(20 At sunset, a large cloud approached from the southwest to a position approximately 10 kilometers from our location at Usury Park hiking trail.  The sunset illuminated the cloud revealing many strange objects within (or possible one very large single object).  Some shapes appeared to be solid and others appeared transparent.  As the sunrays varied with the sunset so did the shapes of objects within the cloud.    Other clouds surrounding the larger appeared strangely illuminated in bright iridescent colors.  Many other hikers stopped hiking and marveled at the objects within the clouds.   I took many pictures of the event and was in the process of creating a panorama in Adobe CS2.  As the individual photographs were overlay semitransparent on each other to form the panorama, many more objects were then reveled in greater detailed clearly identifying them as possible UFOs.  It now became apparent that the large clouds concealed one very large craft (approx 30 kilometers in diameter and many other smaller craft in the adjacent clouds.  There appeared to be a bright illuminating beam of light cast down to the ground with  another UFO object suspended within it.  I am sending several photographs by e-mail to Mr. Davenport to help document the event.  In addition to your reference number, please use CODE: 00100A00B-000 as a cross reference. ((NUFORC Note:  Source of report forwarded photos, but all we see are clouds.  No UFO is apparent to us.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65557.html",
      "state": "AZ",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a31",
      "summary": "Ufo as big as a football field,boomerang shaped,with red non blinking lights!",
      "city": "mesa",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Ufo as big as a football field,boomerang shaped,with red non blinking lights! I was sitting on my deck watching planes fly over my house.  They fly over my house at about 5000ft on there way to land at Kphx. The craft I seen was gigantic,If you put three 747's together that would be about the same size. This craft was silent,It had red lights about 8 of them and looked like a giant boomerang black in color.  It was moving slow probably about 100 knots.I would guess the altitude was 7-10000 feet.  It was headed west,I ran in to get my digital camera but it was no longer visible.  More people must have seen this, especially some of the airplane pilots coming in to land. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66864.html",
      "state": "AZ",
      "duration": "One minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b08",
      "summary": "Two bright amber colored lights appeared over Phoenix, Az.",
      "city": "mesa",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Two bright amber colored lights appeared over Phoenix, Az About 9:15pm, I went on my patio to look at the stars (which I do regularly), and noticed two very bright amber colored lights in the distance.  I am in far NE Mesa, close to the Tonto National forest.  I am fairly high up on the mountain, and these lights were directly south of my view, possibly over Chandler or Gilbert.   I went back inside to get my husband since I wanted his opinion as to what these were.  We were back out on the patio together within less than 30 seconds.  Within about 20 seconds the light to the right faded out, and immediately after, the left faded out.   After about 1 minute, these lights both appeared again in the same exact spot.  They were not as bright as they had been when we first spotted them.   Over the course of the next hour and a half, these lights continually faded in and out.  Sometimes it took 5 to 10 minutes for the appear again.    We noticed that when the faded back on again, they had moved slightly - sometimes higher, sometimes lower, and sometimes spaced apart a little bit.   We also noticed a very smaller (third) light that would sometimes move around these other larger more stationary lights.   I brought my teenage out the patio to witness this, to see what he thought.  All of us were completely at a loss for what this was.   We called two news stations and reported this.   I wanted to call Luke Airforce Base, but could not find a contact number anywhere on their website.",
      "link": "http://www.nuforc.org/webreports/065/S65526.html",
      "state": "AZ",
      "duration": "1+ hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b4c",
      "summary": "Bright light moving quickly across the sky that  suddenly expands to 20X it size and then shoot into outer space.",
      "city": "mesa",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Bright light moving quickly across the sky that  suddenly expands to 20X it size and then shoot into outer space. My wife is from Japan and loves her outdoor hot tub, she's out there just about every night for the past 5 year, even in the hot summers of Arizona. She has been telling me of these strange lights that get real bright and and then dissapear very fast. I have been an Aircaft Mechanic sinse I joined the Air Force in 1980. Needless to say I have seen just about every man made aircraft ever made. So over the past few years I have explaining to her what a satelite looks like, pointed out the space station, space shuttle, and all manner of aircraft movement. She kept saying yea but this is different. Well, I finally seen it for myself last night and yes this is something completely different. We live on the edge of the metropolis in far East Mesa right next to the GM proving grounds. A bright white light like a low orbit salletite that moved from north to south that suddenly lit up to perhaps 20X brighter & larger. At this point the object shot directly into outer space and extremly high speed. Not speed of light speed but very very fast. No sound and only white light. I know of nothing that can move like that, very bizarre. The whole event lastest less than 10-15 seconds, with my wife sreaming; there that is what I have been seeing. Well I have no explanation but it did appear to move like a vechicle of some sort. A UFO until someone could explain what we are seeing.",
      "link": "http://www.nuforc.org/webreports/070/S70728.html",
      "state": "AZ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8be6",
      "summary": "Five very bright, solid yellowish, to golden lights that changed shape and format.",
      "city": "mesa",
      "shape": "changing",
      "date": "2008-10-31T00:00:00",
      "story": "Five very bright, solid yellowish, to golden lights that changed shape and format. While traveling west bound on East Apache Trail in Mesa heading towards Ellsworth Rd I noticed 5 very bright golden yellowish lights. The shape appeared to be curved like on the side of a circle. I continued east than merged onto the 202 freeway just west of Ellsworth lights were not in view obscured by a freeway wall. When I merged onto the 60 highway west the lights became visible again. At this point I could tell the lights were not connected to one object because the shape changed into a wide “V”. At this time I heard and saw two helicopters approaching. The lights were directly in front of me, one helicopter was headed from the south and stayed south of the lights. Another helicopter stayed north of the lights, so the lights were almost in the middle of two helicopters. I arrived at my destination on Power rd just north of the 60 and exited my car at this point only three bright lights remained and were not in any formation. I entered the store and upon exiting no lights were visible. I called my local news station who informed no other reports had been made at that time. Thanks",
      "link": "http://www.nuforc.org/webreports/065/S65568.html",
      "state": "AZ",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8cec",
      "summary": "2 brilliant lights in the Mesa, Arizona sky",
      "city": "mesa",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "2 brilliant lights in the Mesa, Arizona sky I was leaving my parents home when I noticed a bright light in the west northwest part of the sky. Initially I thought it was an airplane, but after it remained in the same position for a couple minutes I realized it couldn't be. I looked for airplanes in the sky and one moved beyond this light so I definitely knew it was stationary. I called my parents on the phone and had them head out to look at it. It was after I hung up with them that I noticed a second due north. I went to take video and pictures with my phone, but neither finction worked. I had stopped on the side of the road for a better look when I heard helicopters coming from the south (Williams Air Force base) as they passed overhead the northern light went out. The light in the west northwest remained. I drove home to get my camera which is only 4 miles away. By the time I got home the light was out and I've never seen either since. Nothing was mentioned on the news or in the newspaper after. The skies lighting had the sun set behind mountains but still light outside. Some stars visible but none nearly this brilliant.",
      "link": "http://www.nuforc.org/webreports/071/S71331.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d1c",
      "summary": "objects far up in the sky, pretending to be stars, a bit more yellow than actual stars, moving in all directions",
      "city": "mesa",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "objects far up in the sky, pretending to be stars, a bit more yellow than actual stars, moving in all directions My sister, my boyfriend and I were sitting on my roof to view the stars, when we had noticed a few brighter stars that had a yellow tint to them.  Some were fainter than others.  As we started to watch them, we would notice they would start moving in circles, up and down, figure eights.  Most times there would be a second \"star\" a little over dancing with the other.  When a plane would go by, the object would stop moving almost like it was just pretending to be a star.  After we noticed a couple, we started to look around for more, and indeed did realize not all the stars in the sky were infact stars.   We went inside after about 40 minutes and after seeing about 5 objects circling and hoovering about the night sky.",
      "link": "http://www.nuforc.org/webreports/068/S68262.html",
      "state": "AZ",
      "duration": "40 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e07",
      "summary": "Very bright light drops off smaller light & flies upward & disappears",
      "city": "mesa",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Very bright light drops off smaller light & flies upward & disappears I was walking to school when a very bright red/orange light above the Superstition Springs Mountains caught my eye. I watched it as I walked. It very very slowly descended directly downward for a long time. I assumed it was something falling from space. Then, when it looked like it was just about to reach the top of the mountain, a smaller light fell or was dropped and took a few minutes to fall onto the mountain and disappear. The light then began to rise in a diagonal straight line heading southward at a noticeably faster speed than before for about five, or at most, 10 minutes. It flashed and disappeared just before crossing paths with a commercial airplane headed West. (It looked nothing like the airplane.) I had seen a similar light in the same area a few days ago, but it had just hovered there. I had thought it was some sort of astronomical body, a star or planet maybe. Any suggestions? ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64936.html",
      "state": "AZ",
      "duration": "15-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b94d7",
      "summary": "Private pilot and passenger witness UFO in flight in northern Arizona Skies",
      "city": "mesa",
      "shape": "disk",
      "date": "2010-06-03T00:00:00",
      "story": "Private pilot and passenger witness UFO in flight in northern Arizona Skies I am a private pilot.  While co-piloting a 1959 B-95 Beechcraft \"Travel Air\" between Mesa falcon field (KFFZ) and St. George Utah (KSGU) I witnessed along with two others a spherical craft within approximately one statute mile of our position.  While making a course correction turn over the \"drake\" VOR at 150 knots 8500ft climbing to 10,500 approx heading 330 degrees(Prescott, AZ, according to GPS right after the event our exact posistion was 17 miles due east from the Prescott airport.)  I was visually scanning the sky for other air traffic prior and during a left turn.  Looking upward (off the starboard wing as it banked upward) the object in question came into veiw. It was a silver lenticular disk, I was the first witness to spot the object.  The passenger seated directly behind me was the second.  I asked the passenger to look up while still in the turn and to simply tell me what they saw.  The witness stated \"Oh my god... It's a flying saucer!\" (or somthing to that ! effect) By this time I had turned passed my intended heading.  I made a corrective turn passed the course in the opposite direction so I could see it again in another left hand turn.   We reaquired the target and attempted to photograph the object with a cell phone camera, without success.  It is difficult to judge it's exact size, however if it was anything close to a convetional aircraft in size it was within 1 to 2 miles almost directly above our aircraft.   As we continued our zig zag turns (in order to maintain a visual contact) on or about or third turn cycle the object began to climb in a spiralling arc through a broken cloud layer that was at about 12,500 plus feet at a very high rate (I estimated 500 to 700 knots possibly supersonic, I based this on my experience as a pilot and witnessing many supersonic fighter aircraft)  No condensation trail, and no visable exhaust trail and was out of visual range in under 8 seconds or so.   The rest of the flight was uneventful. ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75450.html",
      "state": "AZ",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9841",
      "summary": "Bright Light, No Sound, Heading Eastward at 5:59am Thursday 19th Nov 2009",
      "city": "mesa",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Bright Light, No Sound, Heading Eastward at 5:59am Thursday 19th Nov 2009 I had not beleived in ufo's, and maybe what I saw can be explained.   A bright light moving eastward- faster than a jet, slower than a shooting star. No trail like a meteor, but faster than a satelight. It was like it got brighter for a short period of time, only a white light-no other colors.   Then the bright light got smaller, but still visible with naked eye.   Then gone- vanished without thought.   Please tell me it was a very fast jet, and they just turned the light off due to heading eastward, and the sun comes up in the east... I have been in the Army- whats weird is that there was no sound...",
      "link": "http://www.nuforc.org/webreports/073/S73378.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a4c",
      "summary": "Two orange/amber lights moving across the sky in a SE to NW direction seen from backyard in Mesa, Arizona at 1:40 a.m on May 20, 2010.",
      "city": "mesa",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "Two orange/amber lights moving across the sky in a SE to NW direction seen from backyard in Mesa, Arizona at 1:40 a.m on May 20, 2010. I was star gazing on May 20, 2010 at 1:40 a.m. when two orange/amber lights appeared from the southeast; more parallel with an east/west orientation than north/south but at a slight angle, I estimate the angle to be 20 or 30 degrees. I say this because they came into view as I was looking toward the back fence which runs parallel with a street that runs in an East/west direction. One light was in front of the other but not in a straight line like single file, they were slightly offset from one another. They stayed the same distance apart. The speed remained steady. They did not zigzag or bounce around, or waver. I heard no sound from the lights as they passed overhead. I couldn't decipher any definate shape to the objects. The edges . They were diffused or hazy; the same way street lights or headlights appear to me, with a kind of halo effect. They seemed to be going slow but in reality they had to be going fast as they disappeared out of sight within seconds. Because we live on the outskirts of the flight path of an international airport and airplanes pass over all the time I'd say they were considerably faster than any airplanes I've seen. It's kind of hard to judge the size of the objects as there was nothing relative to compare the size with, but I'd say they were at least as large as a commercial airplane, maybe larger.",
      "link": "http://www.nuforc.org/webreports/075/S75475.html",
      "state": "AZ",
      "duration": "5-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a78",
      "summary": "Back in the early 1990s during the Early DARK Evening I witnessed a set of lights over NorthEast Mesa Arizona heading from East to West",
      "city": "mesa",
      "shape": "changing",
      "date": "2008-07-05T00:00:00",
      "story": "Back in the early 1990s during the Early DARK Evening I witnessed a set of lights over NorthEast Mesa Arizona heading from East to West. These lights were in the form of a giant flying wing. It appeared solid. I was driving north and increased my speed to intercept the appearant UFO. My speed reached 90 MPH to put the target on the collision course for me to pass under the appearent UFO to achieve a CPA ( Closest Point Of Approach). I ran out of road and was forced to pull over to the right of the road prior to CPA. After pulling over possibly a minute or so passed and I witnessed the following. The White Lights broke apart and formed a single trane of small aircraft which follwed one another in exact spacing and altitude so exact to land at Falcon Field in Mesa Arizona that I belive they were not under manual control but automated control. This airfield is close to Hughs Helicopter that makes the Apache Helicopter. Also Called McDonald Douglas. It is my personal belief from what I witnessed there has existed for some time an AutoPilot that can control the actions of a group of small aircraft and that is what many people are reporting as giant flying UFOs that look like a series of lights and give the impression of being a solid thing. The precision and accuracy of flying that I witnessed would seem almost impossible for individually piloted group of planes. Although I was able to Identify this Appearant UFO I think I would not have been able to if I had not actually witnessed the landing at Falcon Field In Mesa Arizona in the Early 1990s. I genuinely think they were under GROUP Automated Control and not Individual pilots. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64087.html",
      "state": "AZ",
      "duration": "15 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9cbe",
      "summary": "Flying object seen in Mesa.  ((NUFORC Note:  Confirmed high-altitude research balloon.  PD))",
      "city": "mesa",
      "shape": "diamond",
      "date": "2009-06-09T00:00:00",
      "story": "Flying object seen in Mesa I went out on my balcony to have a smoke & saw a bright white light to the northeast of me.  It slowly moved behind a tree out of my sight for about 5 minutes.  I stood up and walked to the other side of my balcony & saw the light again.  It slowly moved to the right, and then up.  After a few seconds it started moving back to the right. very slowly.  Once it had moved to directly in front of me, but it seemed to be a mile or more away from me.  At this point i stepped inside to call my husband outside.  When i did that  it started moving quickly toward me.  By the time my husband made it outside it was a VERY bright white light, almost like a spotlight pointed toward us.  It flew straight toward us and red lights started flashing on both sides of the craft.  It was directly above a shopping center in front of our apartment, i'd say about a football field (maybe that far) in front of us. It turned direction, towards the left (west) and flew silently ahead until it was out of sight.  When it first turned, i could see a row of lights (dim) along the bottom side (almost middle) of the craft.  You could tell it was metallic and it seemed to have what looked like rocket jets shooting orangish light out of them.  They were on both sides of the back of the craft, in between the red lights. The whole time it never made noise.  It was eerily quite for the city.  My husband and I just looked at each other & commented on how strange it was. ((NUFORC Note:  Confirmed high-altitude research balloon.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70100.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9cd0",
      "summary": "circular fireball slowly flew over me",
      "city": "mesa",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "circular fireball slowly flew over me Went out for a cig and even though i live under two flight paths i know what i saw it was not a plane. it started to my right and went right across my view, as it passed i thought i saw a little debris like red coals from a fire flashing behind it.it flew to my left untill it was so far i couldnt see it anymore. to long and bright to be a shooting star. ???????????? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73480.html",
      "state": "AZ",
      "duration": "1-2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ec8",
      "summary": "Bottle cap shaped UFO with red glow underneath, clearly seen from back yard on December 1st, 2009 .",
      "city": "mesa",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "Bottle cap shaped UFO with red glow underneath, clearly seen from back yard on December 1st, 2009 . Estimated Distance: 2-5 miles Estimated Altitude: 2000 ft. Shape: Saucer with some height on sides like a bottle cap but double the relative height. Features: Red glow underneath with intensity that seemed to fluctuate in coordination with the UFO's movement. Story:  I went out side my home to have a cigarette - no smoking indoors. A red light first caught my attention.  As I looked on, I saw a saucer shaped object.  At first I assumed it was a plane or helicopter and it's altitude seemed close to the altitude where I have seen helicopters hovering in the past.  The UFO was descending and approaching.  Within 30 seconds the UFO was close enough to see very clearly but didn't appear to get closer than around a mile or two.  From my line of site the UFO began around 30 degrees above one of our trees in the backyard and eventually moved to low to see.  I walked to the other side of the yard in an attempt to see around this large tree but after 3 or 4 minutes couldn't locate the UFO so I went inside.  The UFO was in my view for around 3-4 minutes. My view of the object was clear and the UFO was absolutely not a helicopter nor airplane.  The craft appeared to move or \"float\" in all directions although it never made any radical maneuvers or cha! nges in acceleration. About this report: written 3 minutes after the sighting occurred.  Since I am not in some remote, isolated, location, it seems odd to view something so strange - whether it be a UFO or some air-force experiment. I cannot say what it was. All I can report as certain, is that what I saw was not any type of normal aircraft. I can't say whether it is due to the distance of the craft or not, but if the object was making any sound, I couldn't hear it. About the whiteness: 39 year old male who has never seen nor reported a sighting before.  I have also never experienced nor reported any form of anomalous or paranormal experience. My eyesight is currently 21x20 and I have never required or used glasses.  My house where this sighting occurred is located in a normal, non-remote, neighborhood and there are no buildings, high rises or stadiums near enough to view.",
      "link": "http://www.nuforc.org/webreports/073/S73536.html",
      "state": "AZ",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e8a",
      "summary": "Its just movig really slowly, its staying up in th sky. Only seen is   very bright light",
      "city": "mesa",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Its just movig really slowly, its staying up in th sky. Only seen is   very bright light",
      "link": "http://www.nuforc.org/webreports/067/S67562.html",
      "state": "AZ",
      "duration": "in progress"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fbd",
      "summary": "Bright white light left earth at incredible rate of speed",
      "city": "mesa",
      "shape": "sphere",
      "date": "2009-08-27T00:00:00",
      "story": "Bright white light left earth at incredible rate of speed Sitting on Front porch when we noticed an extremely bright white spherical object come from horizon in the northern Sky. It had a trajectory that took it straight up. The object seemed to leave the earth and proceed straight up at a rate that far,far exceeded the rate of the hundreds of various launches I have witnessed growing up a few miles from kennedy space center. The sky was clear and we watched this object through binoculars for at least 6 to 8 min and could see it in relation to steady stars behind it in the night sky. I was left with the impression that it absolutely left our atmosphere and went into space. Again having witnessed many launches, there is a point when the manmade crafts begin to go down range, as to say you eventually see them moving with the curvature of the earth  I am convinced this object far exceeded the capabilities of any man made craft known to me. It didnt seem to produce any flames or smoke usually associated with liquid or solid rocket fuel used in NASA launches.",
      "link": "http://www.nuforc.org/webreports/071/S71819.html",
      "state": "AZ",
      "duration": "8-10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba16b",
      "summary": "May 25th, 2009 1 00 AM, i was sitting on my balcony. Smoking a cigarette , and talking to my girlfriend.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2009-06-09T00:00:00",
      "story": "May 25th, 2009 1 00 AM, i was sitting on my balcony. Smoking a cigarette , and talking to my girlfriend. i have been staying up all night lately, because i have been seing and Filming Slow Pulsing UFOS for the past week. I believe what i saw may 25th at 2 30 am was one of these same crafts But closer, lower, and brighter. At 1 00 AM, my girlfriend stopped me mid sentence and exclaimed \"What the heck is that\" i turned around and there was a tremendously  bright yellowish white light...looked to me at the time that it could be a plane coming Straight at us...{i watch the sky alot and im familiar with planes and what we have in our skys} but as i  watched it i realized, a plane would have moved a bit more by now....this object was barely moving visible to the eye. That was the first thing that raised my suspicion about this light...we watched it hover for a few minutes...and i decided to run and grab my camera... just to get a better look at it...my girlfriend decided to go to bed...i felt compelled to stay up. When i got back outside. the light was no longer white/yellow, But it was Pulsating ALL colors green red blue white purple, {same as the other lights i have filmed} - when zoomed in these lights have a colored aura ive seen the aura double in size and pulse vibrantly...I noted in my log it looked like a contained Aurora borealis Over AZ...I watched this light and filmed it briefly...i noticed this light was pulsing Inteligently...with a pattern so to speak...this is the first time i have observed these pulsations in an intelligent pattern.every 15-20 secconds the light would pulse solidly blue then solidly red. i thaught this was indeed a sign of life connected to this object.after 2 minutes of filming this object i put my camera down...lit a cigarette and just watced it. This was at approximitely 1 30 AM    I watched it for about 30 minutes and at about 2 00am it seemed much closer and much brighter. I decided to take out my camera again. What i saw when i zoomed on this object at 2 00 AM may 25th took my breath away. What before looked like a pulsing sphere was now...a 2 toned sphere of light.by 2 Toned i dont mean.. 2 colors i mean the bottom 2/3 was bright light and the top 1/3 was solid object. when i zoomed on this orb You could see the top 1/3 of the object was dark...or solid,the bottom 2/3 had a Glowing Core of moving light with Red and Blue Lines of light shooting or swimming all around it, like NOTHING i have ever seen on earth. on the video you cannot see this...until i expiremented with color settings i found. sharpening this image and turning contrast down to eliminate any kind of glare you can see what i saw.  here is a link to a clip i posted on you tube    http://www.youtube.com/watch?v=1Vp6IEdhCRk&feature=channel_page  this Light hovered slowly Moving twords me for a very long time i went to bed at 5 am because the sun was coming up and the object seemed to be moving Upwards after 4 00 am. it was back near that area -South of the Usery mountain range- May 27th 1am. but not this morning on the 28th.    I WOULD ALSO. like to note the strangest occurance...there is a point... i included it in my Youtube clip where i was about to adjust my camera. i remember my thaught prior i was thinking \"GOD this light is so amazing i wish i could communicate\" i thaught that right before i moved my camera....and in my footage ONLY i did not hear this noise... i did not notice it until i watched it the next day. There is a noise....right before the Easily Distinquishable sound of the camera rustling there is A multiple Octave STRANGE ...kind of raspy OTHERWORLDY noise...ive listend to it 100thousand times probably by now and it shakes me to my core everytime  i have no explenation for this whatsoever...and i hope you watch my footage and hear it for yourself",
      "link": "http://www.nuforc.org/webreports/070/S70234.html",
      "state": "AZ",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3ba518",
      "summary": "Wabboling UFO effect.",
      "city": "mesa",
      "shape": "other",
      "date": "2009-06-09T00:00:00",
      "story": "Wabboling UFO effect. Hello i was walking home from eating Mexican food at 6:15 pm on June 1st.  I looked up in the sky and I seen this rotating wabboling object in the sky.  It moved southwest over my apartments, and it finally went vertical over the bank.  It was probley pretty high but it was low for only a few seconds.  I didn't think it was a weather ballon, becuase weather ballons don't travel that quick.  It was at crusing speed I guess.  Than it was gone becuase it was to far away to see. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70320.html",
      "state": "AZ",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba554",
      "summary": "I saw an invisible helicopter",
      "city": "mesa",
      "shape": "unknown",
      "date": "2009-04-14T00:00:00",
      "story": "I saw an invisible helicopter I always look upward to the sky to see ufo’s  ( and I do see them often, but don’t usually report them.   We often see/hear police or TV helicopters in this area  I saw some red lights in a row and heard a helicopter but I did not see anything behind the lights.  I ran inside to grab the binoculars and ran back outside and the helicopter (or whatever it was), was invisible.  I live in a metro area and there is usually an outline of something!  I ran to the other side of the house and still could not see anything except the row of red lights and could hear the loudness.  Even if it was jet black, would’t I have been able to see an outline?  I got online to read about invisible helicopters, but could not find much. PS.  I see a lot of daytime sightings and will try to get better at reporting them.",
      "link": "http://www.nuforc.org/webreports/069/S69513.html",
      "state": "AZ",
      "duration": "3 min."
    },
    {
      "_id": "64d005f478aba2ec5a3ba813",
      "summary": "Triangle light pattern with 4th light in the center observed by 2 neighbors",
      "city": "mesa",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "Triangle light pattern with 4th light in the center observed by 2 neighbors Looked like bright stars in a triangle pattern with one light in the center, during dusk before sunset. Too bright to be natural starts or planets. I am an amateur astronomer so I know when I see a planet or star patterns. When the daylight was disappearing, they faded seemed as if they were a reflection with the sunlight.  I pointed it out to my neighbor and he witnessed the lights.   This evening my wife looked on the ufoevidence.com web site and we witnessed a drawing that looked similar to the 4 lights I saw tonight.",
      "link": "http://www.nuforc.org/webreports/066/S66550.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba837",
      "summary": "4 Orbs over Mesa, Arizona seen by at least three witnesses.",
      "city": "mesa",
      "shape": "formation",
      "date": "2008-10-31T00:00:00",
      "story": "4 Orbs over Mesa, Arizona seen by at least three witnesses. While golfing, my friend looked up and saw a pattern of four lights in the shape of balls high in the sky.  We watched them thinking they were weather balloons but they stayed in a triangle plus one pattern, kind of like the star formation of Cassiopeia.   The one farthest west turned a reddish color while we were leaving the golf course just before sundown.  I checked the sky at the same time today to see if the same pattern was there, but the sky was clear with no signs of the orbs.   I do part time astronomy and it was not Venus (not up yet and to low in the west, nor Jupiter, (in the south) and no star, yet four, are that bight to be seen like that while the sun is still up.   ((ADDENDUM FROM WITNESS)) Date should be Wednesday 10/30/08 ((END ADDENDUM)) ((NUFORC Note:  Venus, currently visible in the southwestern sky at sunset,  is seen to set in the western sky, as the Earth rotates to the east.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66573.html",
      "state": "AZ",
      "duration": "40 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bacf8",
      "summary": "Slowly moving and stopped craft barely over my home stayed for 15 minutes.",
      "city": "mesa",
      "shape": "other",
      "date": "2011-01-05T00:00:00",
      "story": "Slowly moving and stopped craft barely over my home stayed for 15 minutes. Approximately 8:30 pm, November 8th, 2007 I was sitting on my back yard patio, just outside the sliding back yard glass door. My wife was sitting just inside the glass door, sitting on the couch in her white nightly robe, and doing a cross word puzzle.  We were only about 10 feet from each other.  I was sitting facing my southern back yard brick wall that was approximately 60 feet from me, with the back of my neighbor’s home on the other side of the wall approximately 120 feet from me. Both of our homes were single story family homes in east Mesa Arizona. Each home was approximately 60 feet in width.  I was just sitting there relaxing and everything was very quiet when I suddenly saw some lights that looked like professional football stadium lights, only in a single row (not 2 rows), very slowly rising from in front of my neighbor’s home until they were exposed barely over the home’s roof.  The lights, in length, were looking to be about 10 feet past the west side of the home and about 30 feet past the east side of the home. This made the light fixture look to be about 100 feet in length and there looked to be about 10 lights, running horizontally. The light fixture looked to be about 6 feet in bottom to top height.  The lights were directly facing North, and my home.  My first reaction was that I was smiling a little and wondering what my neighbor was doing rising up lights like that, that were very large, at this time of night. That changed when I suddenly realized that the lights were now barely over the peak of my neighbor’s roof and very slowly moving over it toward my home.  Seeing this my next reaction, as I still sat in my chair, was that I realized the lights I was seeing were not on a pole, they were airborne, very low, and moving very slowly towards my home, with absolutely no sound.  It was then that I immediately stopped thinking about my neighbor.  When the lights had slowly passed over my neighbor’s home and were now over my back yard approaching my home, I stood up and walked off the patio and into my back yard as the lights slowly now went over me.  Approximately 2 minutes had passed from the time I first saw the lights. As I looked up I saw that the area behind the lights was black and suddenly looked like a very dark roof over my yard. It was then that I suddenly saw a red light over the top of me, approximately 6 feet in diameter, with what looked like a glass cover that looked almost like the exterior of a golf ball, although I did not see the red light come on. With the red light on directly over me I noticed that the light was not moving and that the front of the craft was just barely over the roof of my home and the rear of the craft was completely over my yard. It was now obvious that the craft was not moving. It was then that a noise was coming from the craft that was so loud I immediately looked at the ground and covered my ears. It was still very loud. I was immediately thinking that the whole block has to be hearing this and my wife is definitely coming out. The noise sounded like a combination of high wind and a high pitched engine sound. When I looked at the door of my home I did not see my wife coming out. When I saw that I ran to the door, stuck my head in, and told my wife quickly to come out side and see this, not describing what “this” is. She said that she is busy doing Sudoku, a form of cross word puzzle. I told her to come outside and I left the glass door open. The noise was still loud as I watched all of a sudden the red light start to move toward my roof. I ran back to the glass door and yelled at my wife to get outside and see this craft that’s over our home. It was then I was wondering why she could not hear this loud noise. My wife immediately got up and ran out the door meeting me quickly. Everything was completely silent again and I could not see the red light under the craft any more as it moved forward. My wife’s first view of the craft that I was seeing happened when the rear end of the craft was only now about 10 feet in front of us. My wife and I simply watched the rear of the craft move silently and very slowly to the front of our home.  There it stopped. My wife and I simply were silently just standing about 30 feet from the craft. The craft just silently stayed there about 5 to 10 minutes. On the bottom rear of the craft we saw 2 red lights spaced about 10 feet from each other and a craft height of about 6 feet.Then the craft started moving again with no sound and very slowly away from us. The strange thing is I do not, for some reason, remember how it left. My wife says the craft just disappeared. After the craft was gone my wife and I went back to the patio and talked about this event for about ten minutes and then didn’t again for a very long time, not even to our families. I must say that due to the craft being so low I could not see the width of the entire craft and from the rear the front large lights were not even visible. I also believe that the sound I was hearing was just in my head as my wife, even with the door open, did not hear any sound. I also state that there were no neighbors that even came out as the craft was hovering over me for that length of time and making that loud noise or just hovering in front of our home with absolutely no movement nor sound. Total time of this event was approximately 15 minutes. For the 3 years that followed this event I have had: Severe left ear infections and scabs that totally covered my left ear and back of my neck, and at times the left side of my face. Eye problems with swollen and red eye skin. This year my mind stopped remembering names and various things. October 2010 I had brain surgery after a tumor was found in my brain and then removed. It was then that the surgeon said he was not familiar with this kind of tumor and it had to be submitted to be investigated. It is called Glioblastoma Multiforme and I was told that most people die within 14 months which is December 2011 for me. I am not most people. I am sending this because I do wonder why this is killing me at the age of 54, and what is the primary cause my coming death. Doctors do not know why this cancer starts. I wonder about November 8th, 2007. I have told my doctors this and my surgeons. I have worked as a Production Planner for 23 years providing Weapon Systems to the United States Army, Marines, and the Armed Forces of Israel. My wife works for the same company as a Senior Quality Analyst and has for 21 years. Concluded. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79436.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad3f",
      "summary": "Not observed - Captured object in two of 3 images - Have original image in DNG format",
      "city": "mesa",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Not observed - Captured object in two of 3 images - Have original image in DNG format Not observed - Captured with a camera... I was using auto bracketing, captured object in two of 3 images. Specific time was at 16:17:20... 70mm lens at 1/500 of a second f6.8 Facing (towards) East from the roof of my house...",
      "link": "http://www.nuforc.org/webreports/078/S78558.html",
      "state": "AZ",
      "duration": "2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bb02d",
      "summary": "Bluish white egg shaprd light falling from sky",
      "city": "mesa",
      "shape": "egg",
      "date": "2011-05-02T00:00:00",
      "story": "Bluish white egg shaprd light falling from sky Saw a bright blueish -white light falling from sky that was egg shaped.  Was falling fairily fast like a shootingstar.  Fell into neighborhood but never came back up.  Could possibly be meteor but was pretty big in size and was egg shaped. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81065.html",
      "state": "AZ",
      "duration": ":20"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0df",
      "summary": "When i went out side i saw 10 very large craft. Me and my friends were really scared. I saw moving lights, and then all of a sudden the",
      "city": "mesa",
      "shape": "changing",
      "date": "2011-01-31T00:00:00",
      "story": "When i went out side i saw 10 very large craft.  Me and my friends were really scared. I saw moving lights, and then all of a sudden there was a bright light, and i saw something start to float up into the air. I think it might have been a human. then all of a sudden they were gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79767.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb19c",
      "summary": "triangle shaped, 5 lights, silent, fast,",
      "city": "mesa",
      "shape": "triangle",
      "date": "2011-03-23T00:00:00",
      "story": "triangle shaped, 5 lights, silent, fast, while me and a friend where having a conversation outside my dads house in mesa Arizona mid conversation my friend said \"dude what is that?\" and he pointed up.  I looked up and could clearly see a V formation of lights all moving together, the light the moon was giving up gave enough light that I could clearly see the craft was in the shape of a triangle not a boomerang. I am not good at judging altitudes but I will assume it was high because we could not hear a thing. it zipped over out heads and as it turn the lights level out and we could tell it was turning and by that time it completely disappear. It did not shoot up or just keep going it turned and tilted up and was gone. i went for my phone instantly to get a video but by the time it load up the craft had disappear.  I am a firm believer in what I see because i can rationalize what I am seeing and what I saw in the sky last night was something I can rationalize in my own mind. nor could my friend who po! inted it out first.  It would have flown right over our heads and if he did not see it it would have been gone and we would have never known it was there it moved so fast and was completely silent.  williams field air force base is about 5 miles south of my dads but this was not military there is no way we have crafts like what i clearly saw last night. i will tell any one who asks me if i believe we are not alone that we aren't in this universe something is out there from yesterday on my life will forever be changed after this.",
      "link": "http://www.nuforc.org/webreports/080/S80444.html",
      "state": "AZ",
      "duration": "5-10 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3bb42f",
      "summary": "Bright bluish light seen over Mesa Arizona in the direction of Four Peaks Mountain.",
      "city": "mesa",
      "shape": "light",
      "date": "2011-03-23T00:00:00",
      "story": "Bright bluish light seen over Mesa Arizona in the direction of Four Peaks Mountain. I saw what appeared to be a very bright shooting star with no streaking trail.  As it hit the horizon, it disappeared then reappeared going upward in a curved angle.  It then did three oval-shaped loops with amazing speed and went back down toward the horizon at a curved angle and disappeared.",
      "link": "http://www.nuforc.org/webreports/080/S80567.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb66a",
      "summary": "white light being chased by a F16",
      "city": "mesa",
      "shape": "other",
      "date": "2010-08-24T00:00:00",
      "story": "white light being chased by a F16 Was on my way to work driving down elsworth rd. and I seen a white light low to the ground coming from the williams airport area but then I noticed that a  F 16  was following this white light. they were heading east moving pretty fast .then the white light just stop and did a complete turn into the westerly direction and went right under the F 16 . then the F16 did a fast turn and spead off after it.  that was the last I saw of them both . A airliner was approaching the airport too at that time and I could make out the shape of the F 16 but I could not see any shape of the other object, other than just a white light.",
      "link": "http://www.nuforc.org/webreports/077/S77188.html",
      "state": "AZ",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bbaf6",
      "summary": "Oval object in the sky splits into three sections of light and start to rotate clockwise while moving to the west in Mesa, AZ.",
      "city": "mesa",
      "shape": "oval",
      "date": "2010-07-06T00:00:00",
      "story": "Oval object in the sky splits into three sections of light and start to rotate clockwise while moving to the west in Mesa, AZ. I was facing south when I saw an oval light object in the sky.  The object was not moving too fast that I could not make out what it was.  After about thirty seconds the oval light split into what appeared to be three sections and was rotating in a clockwise direction.  There was also a smaller red dot light above it. The object was moving slightly north and coming from the south.  It then began to move to the west and slightly to the south again.  After about three minutes total it was too far for us to see anymore because there were trees in the way. I compared the object to air planes and helicopters around the area after the sighting and it was larger and not comparable to the lights of our aircraft.  If you can look at a full moon and picture a sliver of the middle and slightly smaller, that would be about the size of this object.",
      "link": "http://www.nuforc.org/webreports/076/S76095.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbcbb",
      "summary": "All electronics died when aircraft was seen directly above myself.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2011-12-12T00:00:00",
      "story": "All electronics died when aircraft was seen directly above myself. My girlfriend and i were sitting at my house in Tempe Arizona , and she needed to go home. so i started to drive her home, and when we got to her house she wanted to spend a little more time with me before she went in.  She lives very close to a busy road so you could hear very clearly passing cars,   So we drove around the corner and parked, we were talking for a little while and things got sexual.  And once we were finished it was very hot in the car, so i opened my sun roof and stood up from it, i was enjoying the weather and when i was looking at the stars i saw an object off in the distance that at first glance looked like a street light. I didn't think nothing of it at first but then i saw that it was moving, and as it was moving toward myself, i called to my girlfriend,  Me: \"baby come up here\"  her: \"why\" Me: \" there is something in the sky, i don't know what it is but you have to look at it\".  She stands up and looks at it with me, by this time it clearly is moving toward us, once it got over the street there were no more car noises.  And the light was getting bigger and bigger as it approached.  I told her to reach down and grab her cell phone and take a picture of it, but her phone was dead, i told her to grab mine, mine was dead.  Then i told here to grab her camera, but that to was dead. The aircraft arrives over the top of the car and it was absolutely silent, not one decibel of noise was in the air. it floated above us for about 10 min.  Then it started to move away, as it got farther and farther noise started to come back and the electronics turned back on, and started to vibrate a lot.  The aircraft slowly flew off into the distance behind the mountains and disappeared.  The aircraft was about 200 feet above me and orange. i don't know what this is and i need answers. please help me ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85569.html",
      "state": "AZ",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf86",
      "summary": "arrow shaped craft red and orange-white over arizona.",
      "city": "mesa",
      "shape": "other",
      "date": "2011-12-12T00:00:00",
      "story": "arrow shaped craft red and orange-white over arizona. Myself my 13 year old son and a good friend were out front of my house and saw something in the sky that had no blinking lights and looked like   <-<-  I dont know if it was 2 craft or 1 thay were so close together the front arrow was red a the back one was orange white no kind of tail no real glow could not see anything but light and i watch the plains every day in are skys i know it was not a plain and i use to live at the end of a air force base in washington state the craft was way to fast moving west to east as it reached the mesa area seemed to head more south east ((NUFORC Note:  Witness elects to remain semi-anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85107.html",
      "state": "AZ",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2d4",
      "summary": "Mulitple lights seen over Mesa, Az New Years 2012",
      "city": "mesa",
      "shape": "circle",
      "date": "2012-01-12T00:00:00",
      "story": "Mulitple lights seen over Mesa, Az New Years 2012 approximatley at 11:55 to 11:58 pm dec. 31st 2011, 6 individuals witnessed 2 lights appear southwest of mesa skyline then a third light appeared as they all slowly moved to the east and slowly began to fade and disappear.  all having a reddish orange color.  then within a minute or two we witnessed two lights of the same color  appear to the northwest of the mesa skyline moving slowly south one above the other almost paralell to each other. both lights seemingly closer than the first group witnessed. as we watched them slowly move just to the west of our location heading south to southwest the bottom light appeared to speed up and pass the position of the light above it. as they slowly moved towards the south they again slowly started to fade and disappear. almost appearing to move towards the west as they faded and finally disappearing into the night.",
      "link": "http://www.nuforc.org/webreports/086/S86230.html",
      "state": "AZ",
      "duration": "2-5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc39d",
      "summary": "They looked like the Brazil UFO on January 3 video on YouTube. A cluster of around 12.",
      "city": "mesa",
      "shape": "light",
      "date": "2012-01-24T00:00:00",
      "story": "They looked like the Brazil UFO on January 3 video on YouTube.   A cluster of around 12. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86547.html",
      "state": "AZ",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc4a3",
      "summary": "Yellowish/orange sphere seen by Wife and Myself.",
      "city": "mesa",
      "shape": "rectangle",
      "date": "2012-01-24T00:00:00",
      "story": "Yellowish/orange sphere seen by Wife and Myself. At 18:00 on Sunday, Jan. 15th 2012 the wife and I were Driving East on Baseline Road towards Ellsworth Road. In the Sky were 8 lights, all of them a Yellow color. They were in a formation that resembled the little dipper upside down.  The Dipper of the formation was up.  As soon as I pointed the lights out to the wife they Dipper portion of the formation turned in a clockwise rotation.  The ships in the Handle then started to get smaller. It looked as if they went higher into the air and then were gone. Then the ships left in the Square formation started to do the same thing. At this time I was able to get my phone out and activate the camera. I was only able to snap two pictures. All but one light had left. At this time another light came up from the east. It stopped and hovered with the one remaining light. This light then disappeared the same way as the others. Leaving one remaining light, this one also disappeared as the others; however upon disappearing i! t did seems to cork screw or barrel roll before getting too small to see. Other than the last light come up, please note that all other lights were hovering.  They were only moving slightly in the sky. Image 1. Shows one ship just hovering, this is the last light to remain. Image 2. Shows two ships hovering, this contains the above light and the newest one that came from the east.",
      "link": "http://www.nuforc.org/webreports/086/S86625.html",
      "state": "AZ",
      "duration": "4 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3bc4a5",
      "summary": "6 orange globes in the east valley sky",
      "city": "mesa",
      "shape": "oval",
      "date": "2012-01-24T00:00:00",
      "story": "6 orange globes in the east valley sky 6 orange globes were traveling north west from over the superstitions mountain.  Then a seventh and eight globe joined them until they formed a v shape.  They held their position for about 30 sec then disappeared.",
      "link": "http://www.nuforc.org/webreports/086/S86602.html",
      "state": "AZ",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc55a",
      "summary": "3 orange globes hovering in the sky",
      "city": "mesa",
      "shape": "sphere",
      "date": "2012-01-12T00:00:00",
      "story": "3 orange globes hovering in the sky Seen them in the sky facing south towards tuscon about 9:55 tonight with me, my wife and uncle. There was 1 on the right and 2 on the left.  They sat still for about 15 seconds before the 2 on the left merged as one and seperated again befor forming a triangle formation and then just dissapearing exactly where they were at.  Seen them exactly 1 week before this in almost the same spot except there were only 2 last time.",
      "link": "http://www.nuforc.org/webreports/086/S86394.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8cc",
      "summary": "Big Round Circle UFO Sighting, A.M.",
      "city": "mesa",
      "shape": "circle",
      "date": "2011-08-07T00:00:00",
      "story": "Big Round Circle UFO Sighting, A.M. I was driving W on Guadalupe Rd. in Mesa, AZ, from Ellsworth Rd.  As I was driving I noticed off in the distance, above a Walgreens, positioned SE what appeared to be a black hot air balloon. It was big and barely moving, if at all.   As I was looking at it, slowly, my skepticism grew.  As I drove for another 5-6 seconds, I considered turning on and grabbing my video camera that I had in the car with me. I am doubtful when it comes to a UFO sighting (I've always wanted to see one) so I feel as if my mind plays tricks on me.   This was no trick.  It was huge.  And as I drove with smy head out my drivers side window and stared, I rolled through a light.   There were 3 ladies out running on the corner, and they had stopped to wait for the light.  I looked at them to see if they were seeing what I was seeing but it did not seem like it.   The UFO hadn't left my sight.  So I turned my camera on and pulled into my neighborhood.  As I drove in, the houses blocked the UFO.   When I returned to open road, couldn't have been more than 25-30 seconds, it was gone from sight.  It was then that a weird feeling started to kick in, almost of disappointment.   It was huge in the sky. Impossible to miss.  Looked like a big black ring with a weird center type and a little tiny upside down triangle on the bottom.   As soon as I saw it, it seemed to be gone.  I wish I would've shot a photo or shot some tape of the UFO but it was all over so fast.   Still hard to believe.  ((name deleted)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82664.html",
      "state": "AZ",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd09d",
      "summary": "The triangle shaped craft sat there for a couple seconds and then shot off really really fast.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2012-08-05T00:00:00",
      "story": "My friend and I went swimming. I looked up into the sky and saw this weird triangle shaped craft.  The triangle shaped craft sat there for a couple seconds and then shot off really really fast.  It shot of heading north.  After that I went home because i was way too freaked out to stay out there. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90508.html",
      "state": "AZ",
      "duration": "a couple of seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0de",
      "summary": "Triangle craft with flashing lights.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2012-08-05T00:00:00",
      "story": "Triangle craft with flashing lights. I was looking at the moon because it was really bright.  A Triangle shaped craft appeared out of nowhere and started flying towards the moon then it started coming back.  It was crossing the sky very slowly with no sound. It had four lights.  The was 3 white and one red.  The red one kept on flashing.  Then the white ones started flashing.It headed in west direction. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90511.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd658",
      "summary": "I saw two red blinking lights, one higher and on a slant, an occasional green light, an occasional blue light, moved in all directions.",
      "city": "mesa",
      "shape": "unknown",
      "date": "2012-05-13T00:00:00",
      "story": "I saw two red blinking lights, one higher and on a slant, an occasional green light, an occasional blue light, moved in all directions. My friend and I were driving from Mesa, AZ back to Tempe, AZ.  My buddy (who is driving, I am in the front seat) randomly notices some strange lights in the sky on the left side in relation to where the car was.  When I turned to look what I saw at first was two red blinking lights; one was higher than the other and on a slant from the other as well.  We kept driving for a minute and observing the lights.  Then we start to notice that at first the lights were moving right, and now all of a sudden they were moving left.  At first we thought we were just seeing things, but then at this point the lights were actually close enough to perfectly determine that the object was traveling LEFT RIGHT UP and DOWN.  We are still driving, and this is only about 2 minutes into the sighting (or at least when my friend first realized it)...and now another GREEN light is being omitted.  The green light was only on very briefly as the other two red lights continued to blink.  ! Now my friend and I were 100 percent convinced and immediately pulled the car over to attempt a shot at getting a better video.  Now we are about 10 minutes into the sighting.  When we observed the two blinking red lights from the sidewalk of the street it was clearly evident that the object was moving in all directions as if it was hovering or was in-decisive of where it wanted to go.  This is where my mind was completely blown...there was now a BLUE light as well, which only appeared for a short time just like the green light did earlier.  The two red lights constantly blink'd and seemed to fly in sync with one another although as I mentioned earlier, one was higher and on a slant from the other.  Another note that I'd like to make is that when the other colored lights such as the GREEN and BLUE appeared for their brief moment, a WHITE light was also somewhat evident but not as radiant as the colored lights.  Unfortunately our best video was actually taken in the car whil! e driving, as the lights moved further and further away.  It w! as weird When we were driving it seemed like they were so close to us, and like I said earlier, after little observation...we were like \"that fucking thing is hovering.  It keeps flying right, then left.\"  Once we decided to pull over, the lights just got further and further.  We attempted to hop back in the car and chase it for a few minutes until we realized it was a hopeless cause.  Both my friend and I felt though that when it did begin to start moving away quickly, it would make incredible travel time between the blinks of the two red lights.  My friend has the video on his phone.  I'll upload it to youtube as UFO sighting in AZ when I get a chance, or when he does.  Hope you enjoyed what we saw and my description. I have to say I've seem some questionable lights in the sky before such as weird blinking white lights, but never anything like what we saw today.  After today, I'm convinced.",
      "link": "http://www.nuforc.org/webreports/087/S87737.html",
      "state": "AZ",
      "duration": "Long"
    },
    {
      "_id": "64d005f478aba2ec5a3bd73d",
      "summary": "Yellowish amber spheres of light seen over the Sonoran desert.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2012-07-04T00:00:00",
      "story": "Yellowish amber spheres of light seen over the Sonoran desert. On March 3, 2010, at approximately 7:40 pm, I stepped out on the patio to have a cigarette. I was facing south when I stepped through the door and turned to the east to reach for the pack of cigarettes setting on the table. As I was lighting the cigarette I noticed a light in the sky, about a mile away and about a 1,000 feet in the air.  At first glimpse, I thought it was an airplane headed for Sky Harbor, which is about 20 miles to the west of us. My first thought was that it was coming in awfully low. Then a second light appeared and I wondered where this second plane had come from. I had not seen it approach. A moment later, it occurred to me that they were not planes, the color of the lights was wrong. Instead of being white, they were a soft yellowish amber, similar to the street lights around us ( the street lights were not on at this time).  By the time this thought cleared my mind a third light appeared. Then a forth and a fifth. Though they were aligned in a line, it was not a straight line.  Astounded by what I was seeing, I called my daughter-in-law outside to take a look. That is when the lights began to disappear, first one, then the other four according to the order in which they appeared. They did not fade or twinkle out, they simple were gone, as though someone had flipped a light switch.  My daughter-in-law and I watched this sequence of lights appearing and disappearing four more times. So I cannot say if we saw 5 or 25 lights. But I can say that they were individual. They were not connected to each other or a craft of some sort. The sky was clear and still light enough that we could see that there was nothing else in the sky. No planes, helicopters, or any other air craft. There were no kites or balloons either. And I can say without doubt that they were not flares being dropped as there was nothing there to drop them. Just as they were not fireworks being shot off from the ground. There were no tell tale trails of smoke. And there was no sound.  The whole incident took less than a minute, so even if I had the presence of mind to grab a camera, there was no time to take pictures. I immediately reported the event to MUFON. Two hours later a black helicopter appeared flying about half a mile south of us. It flew in from the west (from Luke perhaps) then came north to circle the EXACT spot the lights had appeared in before it flew off to the south.  I learned later from MUFON that these lights were seen 30 miles southeast of us only five minutes after we witnessed them.  I know these lights were not nuts and bolts objects. In fact, I got the distinct impress while watching these lights that they were alive and popping in and out of our dimension. My personal belief is that they were not ETs but Angels.  As I stated before, I did report this event to MUFON. But when I heard you speak on Coast to Coast I thought you should be aware of my sighting as well. And too, I am interested in hearing what you think I saw.   Thank you.",
      "link": "http://www.nuforc.org/webreports/089/S89887.html",
      "state": "AZ",
      "duration": "Less than a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc32",
      "summary": "Two slow, black heart changing to tear shaped objects decend with no lights and unheard witnessed by family over e.Mesa,AZ!",
      "city": "mesa",
      "shape": "changing",
      "date": "2012-05-13T00:00:00",
      "story": "Two slow, black heart changing to tear shaped objects decend with no lights and unheard witnessed by family over e.Mesa,AZ! I was standing outside watching the kids riding bikes, one of them asked what was in the sky. I look went inside to grab family and binoculors, came back to see 2 black heart shaped objects wiht out lights or sound going from north to south about 05 to 10 natical miles apart.  For about 7 to 10 min. they have traveled about 35 to 50 natical miles guessing by judgment that is, as they decended they both changed shape to a tear and slowly disappeared in altitude.",
      "link": "http://www.nuforc.org/webreports/088/S88117.html",
      "state": "AZ",
      "duration": "7 to 10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bdffa",
      "summary": "Amber diamond shape in Mesa night sky.  ((NUFORC Note:  We suspect a sighting of a star or planet.  PD))",
      "city": "mesa",
      "shape": "diamond",
      "date": "2012-03-13T00:00:00",
      "story": "Amber diamond shape in Mesa night sky Orange or amber, diamond shaped object in the sky.  Similar to other recent reports in Tempe.  Seems to look round in shape when still, then will take diamond shape and move quickly first in the southern direction then moving more south west.  Moves directions/shifts, very quickly then stops.   After an hour of watching this shape seems to appear more white then amber.",
      "link": "http://www.nuforc.org/webreports/087/S87287.html",
      "state": "AZ",
      "duration": "2 hours and still out the"
    },
    {
      "_id": "64d005f478aba2ec5a3be2b7",
      "summary": "There were 3 'fireballs' hovering very high in the sky and formed a triangle together. They were each making swirly patterns and their",
      "city": "mesa",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "There were 3 'fireballs' hovering very high in the sky and formed a triangle together.  They were each making swirly patterns and their lights would get very very dim to where you could hardly see them and then incredibly bright.   I'm not sure how they dissapeared but about five minutes after they did there were 3 more unidentified objects that were very bright that hovered right next to where they were located, but looked much different. ((NUFORC Note:  We assume an evening sighting, and have changed the time above.  Witness elects to remain totally anonymous, so we are unable to contact the person.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93018.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3be2b0",
      "summary": "Four white round lights in a square formation",
      "city": "mesa",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "four white round lights in a square formation I noticed to the south west of my location, four bright white lights, roughly a few times larger then a large aircraft's headlight, 4 of them in a square pattern.  They then started to make sudden movements, one by one they would slowly (best described as) &quot;stretch&quot; to the left leaving a light trail  expanding slightly, into a vertical cylinder...then would dim almost completely out leaving a very tiny light.  One by one this happened until all four seemed to disappear, but then as soon as they dimmed they rapidly re-lit, repeating the same sequence until they dropped below the housing development in front of me!  The entire time they stayed in the square formation seemingly stationary yet slightly dropping towards the horizon....",
      "link": "http://www.nuforc.org/webreports/093/S93000.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be699",
      "summary": "Round object just hovering over homes.",
      "city": "mesa",
      "shape": "circle",
      "date": "2012-06-05T00:00:00",
      "story": "Round object just hovering over homes. Two days prior to my 9/11/2001 sighting, I saw a round object  flying very high in the southern skies over Arizona.  On 9/11/2001 at approximately 20:30 I was walking my two dogs.  There were no airplanes flying this day because of the terrorist attack, except for military jets from Luke Air Force base.  I just came around the corner and between two homes I saw a bright light coming toward the homes in front of me.  I thought it was the police helicopter flying with their search light on.  I watched the light get closer to me and there it was just hovering over the neighborhood homes.  It was just there, no sound coming from it at all.  The two dogs never reacted to this object.  It hovered for just a few minutes and then it took off, straight up and the started to head west.  This is exactly what I had seen in the sky two days earlier. The most interesting thing was the lack of noise or any sound coming from this object.  The speed of it taking off was incredible. I have not reported this to any authority because I did not want any repercussions to this.  I have told several people since and I just get that look of disbelief.",
      "link": "http://www.nuforc.org/webreports/089/S89272.html",
      "state": "AZ",
      "duration": "3minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be902",
      "summary": "Small, bright, white light appears, beam of light flashes, then it's gone.",
      "city": "mesa",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Small, bright, white light appears, beam of light flashes, then it's gone. I was in my backyard looking at the stars, when I suddenly saw a bright white light appear, which seemed to be the size of a dime from my perspective.  Then a beam of seamless white light from it, pointed in the middle from the sheer distance, flashed over my backyard, and mine alone.  Then, as quickly as it came, it was gone.",
      "link": "http://www.nuforc.org/webreports/087/S87424.html",
      "state": "AZ",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3be91f",
      "summary": "No tail of light like a meteor, just bursts of light from what seemed to be from deep space.",
      "city": "mesa",
      "shape": "circle",
      "date": "2012-05-29T00:00:00",
      "story": "No tail of light like a meteor, just bursts of light from what seemed to be from deep space. About 10pm May 28, 2012 looking nearly straight up in sky ( I live in Mesa AZ, USA) a little to North I saw a faint light that got brighter and went white to blue then faded to nothing took about 4-6 seconds. It got to about 25% of the size of the moon. Then about 5 to 8 min latter just a little to the East it happened again just not as big, but just as bright and it did not last as long. Any one else see it, can anyone tell me what it was.  Also, I saw the same thing last Wednesday night (May 23) in the North Eastern sky, this one was a little more orange.  But what caused me to write about it and search for an answer for what I was, each had no tall. It was just a burst of light.  Like in the meteor fall that leaves a tail showing the direction of the fall, these all had no tails, no streaks? What is it, anyone know?   ((name deleted))",
      "link": "http://www.nuforc.org/webreports/089/S89255.html",
      "state": "AZ",
      "duration": "4 to 6 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3be9f7",
      "summary": "Rectangular ufo seen in Arizona",
      "city": "mesa",
      "shape": "rectangle",
      "date": "2012-03-13T00:00:00",
      "story": "rectangular ufo seen in Arizona My friend and I were playing outside when we spoted a rectangle in the sky.  It was about a mile away and moving fast.  it looked like mercury inside of a digital camera.  It seem to shift from gray to a reddish color.  Sadly we couldn't catch it on video.  After a time it dissapered and we lost it from veiw.",
      "link": "http://www.nuforc.org/webreports/087/S87559.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb97",
      "summary": "Appeared round from the ground, but unusually bright. Upon observation through binoculars it appeared more diamond shaped.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2013-09-09T00:00:00",
      "story": "appeared round from the ground, but unusually bright. Upon observation through binoculars it appeared more diamond shaped. When I was traveling along a freeway on 09/02/13 at approximately 18:35 p.m. I saw a unusually bright light in the north sky from Mesa, Arizona.  I made mention of it to my wife who also noticed it's unusual luminiosity.  Since I have been a night shift worker for 21 years I am used to looking up in the night sky and noticing anything that seems out of place.  As we drove along I notices that the object was above the clouds, since as we traveled some high clouds would come in between the object and us.  I thought this unusual since balloons up that high would hardly be visual.  Since that area in the sky is in the normal route of commercial aircraft arriving to land at Sky Harbor Airport in Phoenix, AZ, I thought it unusual that this object was much higher than the descending aircraft who were approaching to land (and below the cloud level).  When we reached our destination in Mesa, AZ at 18:55 we immediately requested some binoculars from the home of my my father! -in-law to observe it more closely.  He complied.  When I looked at it in the binoculars the object seems to have a diamond shape.  It appeared to have lighting from within itself. The object did not appear to be moving at all, just hovering.  I, my wife and several members of her family observed it through the binoculars for several minutes. One member of the family thought it was a hot air balloon due to it's shape, but observing it myself I could not detect any flickering from the typical flame that normally occurs in the ascent and descent of a hot air balloon.  I observed a flight of an airplane that passed by but I have no reliable experience as to whether it was close at all (the same altitude, etc) to the observed object.  I did notice people in other cars at stop lights observing the same thing from their cars, it was that noticeable.....",
      "link": "http://www.nuforc.org/webreports/101/S101878.html",
      "state": "AZ",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bee9b",
      "summary": "Pulsing bluish-white object seen over NE Mesa AZ",
      "city": "mesa",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "Pulsing bluish-white object seen over NE Mesa AZ Outside swimming with my Son and Grandson when I looked up and saw a bluish-white circular almost orb looking object.  It almost appeared as if it was blurry or out of focus.  There was one flashing white light circling around the outside of the object.   I asked my Son if he saw the object and he confirmed that he did. We continued to watch the light move through the sky towards the SW.  There was no sound associated with the object.  All of the sudden it was gone.  We got out of the pool to get a better view of the sky in the area that it disappeared thinking maybe it had gone behind a cloud but we were unable to locate it or a cloud in that area of the sky.",
      "link": "http://www.nuforc.org/webreports/100/S100756.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf013",
      "summary": "Went outside to look at the stars and noticed a cone shaped object low in the sky, which the streamers, it displayed immediately dissip",
      "city": "mesa",
      "shape": "cone",
      "date": "2013-07-03T00:00:00",
      "story": "Went outside to look at the stars and noticed a cone shaped object low in the sky, which the streamers, it displayed immediately dissipated quickly.  It seemed like the cone shaped object had a material embodiiment  surrounding it.   As quickly as it came, it quickly disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98996.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1b4",
      "summary": "Really blue bright looking object that look like a bright star at first",
      "city": "mesa",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "really blue bright looking object that look like a bright star at first I was sintting outside on Easter sunday at 9:30 PM when I was waiting to take my mom to the Airport when I looked at the the northern Sky and say a Blue light I got up and ask my mom what is that ...she said I dont know I said well its not a plain or chopper well the light kepted getting closer moving really fast then in a blink of a eye it had moved to the southern skys well it keepted fading in and out well I videio the whole thing it even went has low has the trees my mother was so freaked out she ran in side it even scared me but this thing we saw was really bright blue and small like a basketball and then it turned red/white and it really did keep fading away moving slow and fast . ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96862.html",
      "state": "AZ",
      "duration": "5-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2b8",
      "summary": "Several yellow-orange lights in v formation break apart and zigzag until blinking out one by one",
      "city": "mesa",
      "shape": "formation",
      "date": "2013-05-15T00:00:00",
      "story": "several yellow-orange lights in v formation break apart and zigzag until blinking out one by one   there were about 8 or 9 bright yellow-orange balls of light in v formation. lights then broke apart some went up others went to ground near cattle farm. the lights that went in other directions slowly blinked out leaving a cloudy disk shape in sky. the ones that went to the ground were not seen for a minute then slowly came back up only to zigzag vertically and horizontally until blinking out again leaving a milky disk shaped &quot;cloud&quot; which continued to float away",
      "link": "http://www.nuforc.org/webreports/097/S97025.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf32b",
      "summary": "2 ufo sighted above Superstition Mt Mesa Az 330am 9-17",
      "city": "mesa",
      "shape": "triangle",
      "date": "2013-09-30T00:00:00",
      "story": "2 ufo sighted above Superstition Mt Mesa Az 330am 9-17 Two ufo sighted.  Location is: Looking at star constellation Orion, find the 3 stars in the belt, follow the 3 stars down to see the brightest off the two ufo's.  Standing Facing East we call that the 2 oclock position.  The other ufo is at the 12 oclock position.  We saw these two ufo's facing east looking towards the Superstition Mountain in Mesa Az The ufo are triangle-shape giving flashing lights red teal-green white.  They are stationary.  We have been watching them for 40 plus minutes.  330am - 410am",
      "link": "http://www.nuforc.org/webreports/102/S102120.html",
      "state": "AZ",
      "duration": "40+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfba9",
      "summary": "Very bright light in north eastern sky. Larger then stars and smaller then moon.  ((NUFORC Note:  We suspect a star.  PD))",
      "city": "mesa",
      "shape": "circle",
      "date": "2013-09-09T00:00:00",
      "story": "Very bright light in north eastern sky.  Larger then stars and smaller then moon.  Grabbed pair of binoculars and verified it to be a rather large weather ballon.  Ballon has very long tail dropping from center.  Ballon also appears to be metallic in reflecting sunsets rays. Object is very bright and a few resident here in our subdivision (Boulder Mountain) all have stopped and noticed.  Object appears to be floating west bound. ((NUFORC Note:  We suspect a star.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101865.html",
      "state": "AZ",
      "duration": "Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bfbf9",
      "summary": "Triangular shape with bright lights",
      "city": "mesa",
      "shape": "triangle",
      "date": "2013-09-09T00:00:00",
      "story": "Triangular shape with bright lights A triangular, stationary shape with bright, flaring, reflective lights was visible in the Northern sky.  As the night grew darker, the brightness faded, though the object was still visible.",
      "link": "http://www.nuforc.org/webreports/101/S101863.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bfe04",
      "summary": "White halo/ fire ball appeared in east mesa.",
      "city": "mesa",
      "shape": "fireball",
      "date": "2013-07-22T00:00:00",
      "story": "White halo/ fire ball appeared in east mesa very large white halo like ball appeared over Broadway and power road, then moved in a zig-zag formation about 200 feet south and turned into a huge red orange fire ball just over the gas station and then disappeared abruptly into the air, leaving no tracts.",
      "link": "http://www.nuforc.org/webreports/100/S100244.html",
      "state": "AZ",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0174",
      "summary": "Reddish orange orbs moving east to west, caught on video",
      "city": "mesa",
      "shape": "circle",
      "date": "2013-07-05T00:00:00",
      "story": "Reddish orange orbs moving east to west, caught on video Slow moving, orange/red orbs following in the same flight path.  No flashing lights like planes have. I have video on my iPhone of the event.  There were fireworks being set off all around but these lights were far to high and stayed illuminated for the entire time. No sound when they moved over our home.  They were moving east to west.",
      "link": "http://www.nuforc.org/webreports/099/S99696.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0818",
      "summary": "3 orange lights lined up, went to grab my phone came back and they were gone.",
      "city": "mesa",
      "shape": "unknown",
      "date": "2014-01-10T00:00:00",
      "story": "3 orange lights lined up, went to grab my phone came back and they were gone. 3 orange lights lined up in the sky, went inside to grab my phone for 2 seconds and came back out and they were just gone like that.",
      "link": "http://www.nuforc.org/webreports/105/S105699.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b12",
      "summary": "I was just let my dogs out to the backyard. And walk around the corner and looked up behind the house and saw orange glowing light movi",
      "city": "mesa",
      "shape": "rectangle",
      "date": "2014-03-18T00:00:00",
      "story": "I was just let my dogs out to the backyard.  And walk around the corner and looked up behind the house and saw orange glowing light moving slow west to east then changed to.   The southeast few sparks fade out but still could see it and looked like three engines were at the bottom. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107769.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0afa",
      "summary": "I'm reporting very concerning sightings of non identifiable objects that are being launched into the sky.",
      "city": "mesa",
      "shape": "fireball",
      "date": "2014-01-10T00:00:00",
      "story": "this is James from Mesa Arizona reporting very concerning sightings of non identifiable objectsthat are being launched into the skyfor for the last 2 days I have witnessed now 4is our military doing red balls of light ascending upwards until they faded into near invisible white-ish objects that at first observation last night staid stationery for roughly 5 minutes before proceeding across the sky and tonights multiple accounts proceeded without stopping 1 stay faded continuing in 1 north bound and the remainder southbound and as I speak more proceeding.  these objects are most certainly ground started and are great concern to me what the hell.",
      "link": "http://www.nuforc.org/webreports/105/S105813.html",
      "state": "AZ",
      "duration": "48 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c0bd3",
      "summary": "Copper orange lights grow and disappear over East Mesa.",
      "city": "mesa",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "Copper orange lights grow and disappear over East Mesa. I saw two orange/copper lights, very bright and close to eachother in the western sky. I was at the intersection of Signal Butte and Baseline Road.  They were very luminous and bright and too close together for normal craft.   As I watched, one disappeared (the one on the right) and the one at the left was pulsing.  Then the one on the right reappeared.   They both continued overhead to the east, then got wider and less bright but their shapes were more delineated.   The two circular objects had smaller circles at their edges, akin to a rotary dial–a circle with smaller circles all along their edges and rotating.   As the objects got larger and lower they became transparent and then vanished.",
      "link": "http://www.nuforc.org/webreports/107/S107827.html",
      "state": "AZ",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11ec",
      "summary": "2 orange glowing orb hovering in the sky by the South 202 and McKellips",
      "city": "mesa",
      "shape": "oval",
      "date": "2014-02-07T00:00:00",
      "story": "2 orange glowing orb hovering in the sky by the South 202 and McKellips I was driving on the South 202 near McKellips when I noticed 2 orange oval shaped glowing orbs in the sky.  They seemed to be hovering.",
      "link": "http://www.nuforc.org/webreports/106/S106949.html",
      "state": "AZ",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1235",
      "summary": "Reddish-orange object with beams of light emanating from body of object.",
      "city": "mesa",
      "shape": "light",
      "date": "2013-11-20T00:00:00",
      "story": "Reddish- orange object with beams of light emanating from body of object. Object silent moving west to east, reddish-orange with starlike beams of light emanating from body of object.  Did not look like any previously observed  aircraft.  Object proceeded to move off into horizon with increasing speed.",
      "link": "http://www.nuforc.org/webreports/104/S104369.html",
      "state": "AZ",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c13c9",
      "summary": "Three lights orange in color and wide spread. lights went out one at a time and then were gone.",
      "city": "mesa",
      "shape": "unknown",
      "date": "2014-01-10T00:00:00",
      "story": "Three lights orange in color and wide spread.  Lights went out one at a time and then were gone. three orange lights in a widespread line. Lights went out on a at a time and then disappeared. ((NUFORC Note:  The time of the sighting is unclear to us.  The witness, who elects to remain totally anonymous, indicates a time of \"8.\"  We do not know what that means, and we are unable to contact the witness for clarification.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106108.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c15f9",
      "summary": "Formation of moving lights split off and hover.",
      "city": "mesa",
      "shape": "formation",
      "date": "2013-11-11T00:00:00",
      "story": "Formation of moving lights split off and hover. Around 7:40 PM Arizona time on my way to work, I pulled over as I saw what appeared to be five lights flying in formation that gave the illusion it was one large object.  It could have been a military training flight with the formations, but I am not sure.  The light they gave off I can only describe as looking like a dim orange street lamp color, but large and bright enough to be seen very easily. After watching it fly in a single direction for a few minutes, the front three lights split up and formed a small-medium sized triangle.  I lost sight of one of the lights in the back completely, and the other one was still moving in the direction of the other three at a slow pace.  The triangle hovered for roughly three minutes.  After those few minutes, the lights of all three simultaneously faded from bright to nothing, with a bit of flickering, lasting in total around 30 seconds. Sometime in between the last sight of the back light and the fading of the three front ones, I lost sight of the last light behind a house.  I tried moving the car to a better location, but they were already gone.  That was everything I saw. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104299.html",
      "state": "AZ",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17f0",
      "summary": "Fast, blue ball of light.",
      "city": "mesa",
      "shape": "light",
      "date": "2014-07-20T00:00:00",
      "story": "Fast, blue ball of light I was walking home with my room mate and we saw a blue light in the sky about 10-15 miles SxSE of my location. It was very fast in horizontal and vertical movement.  It seemed to gain altitude, then free-fall multiple times. It then sped towards us, stopped about a mile away, and without turning around, returned to where it was first sighted. After about 15 minutes of racing around the sky, it just disappeared.",
      "link": "http://www.nuforc.org/webreports/111/S111538.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c182a",
      "summary": "About 10 Orange fireball orbs in a straight line north to south. Began to move east and scatter in a random shape. Followed our car sou",
      "city": "mesa",
      "shape": "fireball",
      "date": "2014-06-04T00:00:00",
      "story": "About 10 Orange fireball orbs in a straight line north to south.   Began to move east and scatter in a random shape.  Followed our car south east and were gone.",
      "link": "http://www.nuforc.org/webreports/109/S109539.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2060",
      "summary": "Me and My Family Stood and watched the lights as they flew around in Formation and Synchronization, Then Dissapeared",
      "city": "mesa",
      "shape": "formation",
      "date": "2014-06-13T00:00:00",
      "story": "Me and My Family Stood and watched the lights as they flew around in Formation and Synchronization, Then Dissapeared 20 Green Floating/Flying Lights   The Greens Lights Were Flying In Formation and moving around in synchronization  Constantly  There Were 20 Green Lights  The Shape was round and they Appeared Green in Color  Complete Dark and black Background With Stars Shining in the Distance",
      "link": "http://www.nuforc.org/webreports/110/S110185.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c205f",
      "summary": "UFO in Mesa, AZ, 30 lights to 20 than 10 disappearing and made T-shape and Triangle shape before disappearing.",
      "city": "mesa",
      "shape": "changing",
      "date": "2014-06-13T00:00:00",
      "story": "UFO in Mesa, AZ, 30 lights to 20 than 10 disappearing and made T shape and Triangle shape before disappearing. As I sat in my computer room doing research, guns went off I of course ignored them. About three minutes later my mom came running in the house telling me to go outside.  My neighbors across the way said there were 30 lights over their house which moved in the direction of NE from Sky Harbor airport, from the location of my house the lights were NW.  I am a amateur deep space astrophotographer, so I definitely can identify any normal aircraft or lights in the sky when I see them.  By the time I got outside there were 20 lights.  I did not want to move for fear I might miss something.  I ran to grab my Canon rebel T3i with the telephoto lens.  When I went outside my hands and body were so shaky, I guess that is why spare of the moment photographs of UFO's are not clear.  My neighbor however got a video.   While all this was going on the lights dropped down to ten, still ascending NW.  At this point my dog in the house was going crazy.  Once the lights got to about 7 or 8 they began to make a triangle formation.  It looked like a triangle with one flat side parallel to the ground with the top tip point bent forward while it all rotated on a lazy-susan.   When any of the lights began to disappear they would blink in and out then slowly fade into a dim disappearance.  The video shows three lights stationary while a helicopter goes across  ithttps://www.youtube.com/watch?v=x1OLecTpZy4 .   One of my neighbors who witnessed the UFO's is a aircraft mechanic, he could not identify any aircraft that he knows to make such formations or behave in such a way.   The lights traveled NE and disappeared; both away from sky harbor and my house.",
      "link": "http://www.nuforc.org/webreports/110/S110179.html",
      "state": "AZ",
      "duration": "28 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c21e0",
      "summary": "Spinning disc shape with red,and blue lights. Changing direction rapidly and hovering for several seconds",
      "city": "mesa",
      "shape": "circle",
      "date": "2014-05-02T00:00:00",
      "story": "Spinning disc shape with red, and blue lights.   Changing direction rapidly and hovering for several seconds.",
      "link": "http://www.nuforc.org/webreports/109/S109078.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2313",
      "summary": "An object which was constantly changing shape moved very slowly across the sky.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2014-04-04T00:00:00",
      "story": "An object which was constantly changing shape moved very slowly across the sky. The object was very dark in color. It was either dark gray or black.  The object seemed to be changing shape rhythmically.  It would go from being a perfect sphere and then flatten out to be an extremely thin disk and then back to a sphere.  It was changing shape constantly while moving across the sky.  It was too high to get any kind of clear picture using my phone.  It was moving in a northward direction for about 15 to 20 minutes and then turned and went west until it was far enough away that I could not see it anymore.  It was never so high that it was in the clouds.",
      "link": "http://www.nuforc.org/webreports/108/S108142.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2740",
      "summary": "At 6:40 pm I went to let the out side in the back yard when I got the back side of the I could not miss look Up in the sky to see a re",
      "city": "mesa",
      "shape": "oval",
      "date": "2014-11-21T00:00:00",
      "story": "At 6:40 pm, I went to let the out side in the back yard, when I got the back side of the I could not miss look up in the sky to see a reddish yellow glow following a airliner leaving Skyharbor airport . Every time a airline departed a reddish yellow followed it then turn south and was gone. I called my wife and she saw the same thing I did, and all the neighborhood dogs were Barking and growling like my dogs were until the lights stoped. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115486.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a57",
      "summary": "Glowing, blue triangle slowly crossed sky.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2014-08-29T00:00:00",
      "story": "Glowing, blue triangle slowly crossed sky A large, glowing, blue triangle-shaped object slowly crossed the sky right before 4 a.m.  It was flying pretty low and it was close enough so that I could see a perfect triangle-shape.   I followed the object until it suddenly disappeared.",
      "link": "http://www.nuforc.org/webreports/112/S112983.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bfd",
      "summary": "I saw a half round disk object in flight zone then realized it was flying against flight path traffic normally flies.",
      "city": "mesa",
      "shape": "disk",
      "date": "2014-09-05T00:00:00",
      "story": "I saw a half round disk object in flight zone then realized it was flying against flight path traffic normally flys. So, I am driving in the city of Mesa, Az, on 9:50 am Tuesday, 08/26/2014, it was the first cloudless day we had in last week, being that we are in monsoon season and have had a particularly rainy season this year. I see what at first appears to be a plane at a glance especially being that the area is a fly zone over falcon field and sky harbor.  Then I realize I have never seen anything flying the opposite way of falcon fields mandated flight path allows.  Another detail that had me for a split second assume it was a commercial or private plane was it looked white, and almost textured, but at this time I was looking up at it and may have been looking at the bottom.  Then I noticed it was barely swerving slightly back and forth.  So slightly that unless you stared at like I did it could appear to be going straight.  This is when I was positive it was worth taking a picture at least. If my phone wasn't on verge of dying, I would have taken a video.  As I got my phone ready to take the picture the object was getting further away quickly even though we were traveling same direction.  When I took the picture I wasn't sure if I would be able to see anything.  And when you look at the picture you almost can't see anything until you zoom in then you can see it quite clearly.  So the time I observed it was about 2 min. approximately, OR the time it takes to travel 2 miles at 40 MPH might be a more accurate way to describe it. I snapped the picture, passed two palm trees, looked back up and the object in sky was gone.  Then I saw a commercial airliner fly by and noticed distinct blinking light on the belly and obvious wing shapes which the object I saw was lacking.   I turned east and by the time I got to my destination 2 miles up the road I observed 2 air force jets both flying straight up with the afterburners on and I remember thinking that they were going much slower than the object they were chasing.   The shape of the craft appeared to be somewhat cigar shape and with the white I was seeing is why it looked at a glance like a jetliner but it quickly looked different in shape but I think this is because of the angle not that it changed in shape and became very obvious to me it was wingless.  Half round in shape.  The best thing I can think of to compare with is a bike helmet which is kind of funny to me because I imagine both the helmet and the ship were built with aerodynamics in mind.",
      "link": "http://www.nuforc.org/webreports/113/S113132.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2dc6",
      "summary": "I know what i seen....",
      "city": "mesa",
      "shape": "unknown",
      "date": "2014-09-10T00:00:00",
      "story": "i know what i seen.... circle shape to my south east very high in the sky..... changed colors....could not believe what i was seeing...got binoculars for better look could only see changing colors..... i know what i saw ......did any one else? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113335.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c312f",
      "summary": "I was driving from Fountain Hills to my apartment using highway 87.",
      "city": "mesa",
      "shape": "formation",
      "date": "2014-08-08T00:00:00",
      "story": "I was driving from Fountain Hills to my apartment using highway 87.  As i was about a mile from Gilbert Road, i looked to the south towards Mesa, and the best way I can describe what I saw was that there were three orange orb-lights in the sky spaced pretty close to each other really far away (maybe 20 miles away, 5000 ft high) and as they started to dim out from left to right pretty quickly,   3 more lights appeared a little bit further away in a straight line.   As those started to dim out from left to right 3 more lights appeared.  And this happened about three to four times before they just disappeared completely.   The pattern these lights turned on and off reminded me of a caterpillar effect.",
      "link": "http://www.nuforc.org/webreports/112/S112248.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c320e",
      "summary": "Bright lights",
      "city": "mesa",
      "shape": "formation",
      "date": "2015-04-03T00:00:00",
      "story": "Returning home going east on Ray Road just east of Ellsworth at around ten at night.  This is a new housing development area with lots of daytime housing construction during the day and vast open areas.  I was in the passenger seat and saw six bright lights at a little above ground level to the ESE.  There are other lights in the area from warehouses and domestic homes.  These were in a horizontal line consistent with the ground and were different, spanning about 100 yards in width if my measure is correct.  My girlfriend was driving and commented on them and I wasn't sure what it was.  There were 3 passengers in the back seat and we all saw them.  Unlike mercury or sodium vapor lights, these looked incandescent, yellowish white, bright and large.  What stood out is that unlike the domestic and business lights to the left and right of this array, these had a hazy fog around them.... They were about 1/2 mile away... I wanted to go over there, but there are n! o roads ....  I have looked at that area every night since and it is dark....",
      "link": "http://www.nuforc.org/webreports/118/S118050.html",
      "state": "AZ",
      "duration": "~3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c329f",
      "summary": "Large Bright Light with Red Thin Lights Shooting Out.",
      "city": "mesa",
      "shape": "light",
      "date": "2015-04-03T00:00:00",
      "story": "Large Bright Light with Red Thin Lights Shooting Out Last night, I was with my family and friends by the swimming pool and we saw an unusually bright light.  It appeared to be an extremely large star with very thin red lights shooting off the top.  This red light was very thin and long and it went up and down slowly several times.   After 30 minutes, it very slowly headed towards Tempe, Az.  People in our apartment complex could be seen watching the event out their Windows!!!  No sound at all.",
      "link": "http://www.nuforc.org/webreports/118/S118074.html",
      "state": "AZ",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3311",
      "summary": "((HOAX??))  Bright green light shaped like a done lit up the sky for about 10 seconds.  House lights dimmed for a few seconds.",
      "city": "mesa",
      "shape": "flash",
      "date": "2015-03-20T00:00:00",
      "story": "Bright green light shaped like a done lit up the sky for about 10 seconds.  House lights dimmed for a few seconds.  When light was gone, house lights became normal again. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117795.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c343e",
      "summary": "4 orange umbrella-like objects seen above Mesa, Az.",
      "city": "mesa",
      "shape": "other",
      "date": "2015-01-07T00:00:00",
      "story": "",
      "link": "http://www.nuforc.org/webreports/116/S116327.html",
      "state": "AZ",
      "duration": "~5"
    },
    {
      "_id": "64d005f478aba2ec5a3c35e8",
      "summary": "Sphere with red and green lights hovering over Mesa, Arizona.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2015-01-26T00:00:00",
      "story": "Sphere with red and green lights hovering over Mesa Arizona. UFO seen hovering over northwest Mesa.  Red and green lights, spherical shape, moving sideways and straight up and down.  The object appeared to move closer to our location and then hovered in the sky for several minutes.   Our dogs were attracted to the object and seemed to watch it without making a sound.  We know there was one, possibly two objects in the sky.  We were frightened.",
      "link": "http://www.nuforc.org/webreports/116/S116799.html",
      "state": "AZ",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3705",
      "summary": "On the night o Nov 15 my wife and just got home From shopping and I let our dogs out back went Out side with the dogs . When I heard th",
      "city": "mesa",
      "shape": "circle",
      "date": "2015-01-30T00:00:00",
      "story": "On the night o Nov 15 my wife and just got home from shopping and I let our dogs out back went outside with the dogs.  When I heard the dogs looking up in the sky and barking a airline was leaving Sky Harbor. But there was reddish gold light folowing the air plane.  Another airplane and another light the light head south and then was gone.  My wife and watch for eight minutes or more.  There were six or more lights.",
      "link": "http://www.nuforc.org/webreports/117/S117036.html",
      "state": "AZ",
      "duration": "9:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c3704",
      "summary": "On the night o NO 15 my wife and just got home From shopping and I let our dogs out back went Out side with the dogs . When I heard th",
      "city": "mesa",
      "shape": "circle",
      "date": "2015-01-30T00:00:00",
      "story": "On the night o Nov 15 my wife and just got home From shopping and I let our dogs out back went Out side with the dogs.  When I heard the dogs looking up In the sky and barking a airline was leaving Sky Harbor. But there was reddish gold light following the air plane.  Another airplane and another light the light head south and then was gone.   My wife and watch for eight minutes or more . there were six or more lights.",
      "link": "http://www.nuforc.org/webreports/117/S117009.html",
      "state": "AZ",
      "duration": "9:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c37b9",
      "summary": "You will be seeing 2-3 glowing orbs over Mesa/Salt River Reservation In Arizona.",
      "city": "mesa",
      "shape": "circle",
      "date": "2015-01-30T00:00:00",
      "story": "You will be seeing 2-3 glowing orbs over Mesa/Salt River Reservation In Arizona.   As I watched in awe, it looked like energy was charging up, and the orb was flashing various colors, then my camera got blurry and the focus stopped working.  It almost seemed as if it were some sort of energy like pulse.  The orbs aligned into triangular formations as well as a line.   Previously to starting video, there was 4 orbs that moved fast across the sky in a way that I could only say compares to a star, realigning in the sky.   At the end the orbs grew closer and combined into one orb that ended up fading out and slowly grew harder to see. https://www.youtube.com/watch?v=iQ2ht9sxNfk ((NUFORC Note:  The video is fraught with profanity, so we recommend you turn off your computer's sound, if profanity is offensive.  The video shows three lights, hovering in the night sky, and apparently moving slightly.  We do not know what the lights are.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117040.html",
      "state": "AZ",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c38aa",
      "summary": "Glowing orange light moving in a random way and then disappeared.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2015-01-07T00:00:00",
      "story": "Glowing orange light moving in a random way and then disappeared. I saw this same thing earlier in the year but it was 3 lights.  To the south of me I saw one orange sphere glowing brightly almost like it was on fire.   I thought at first it was a firework because it was New Years, but it was slowly coming towards me.  It didn't take a straight path however.  It seemed to randomly move forward.   It was too high to be a helicopter.  I thought maybe a plane and the light was a weird color because of clouds, but it was moving in such an odd manner.   It stopped moving eventually and the Orange light seems to get dimmer until it finally disappeared.",
      "link": "http://www.nuforc.org/webreports/116/S116405.html",
      "state": "AZ",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3924",
      "summary": "Orange spheres over Mesa.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2014-12-18T00:00:00",
      "story": "Orange spheres over Mesa. Coming home from my daughter's school concert, I noticed two bright orange spheres south of my location  At first, my wife thought that the lights where airplanes, until an airplane passed right in front of them. At this point, we were stumped because the orange spherical lights where bigger than the airplane and a little further south.   We continued south towards the US 60 freeway and the lights were still there,  I got on the freeway heading west and was able to see the lights again however one more light had appeared to the right of one of the spheres making sort of a L shape, at that point I also noticed that they where around the same location as the Mesa Gateway international airport. We continued on to south loop 202 and around Guadalupe Rd the spheres starded to disappear into itself like if someone had pulled a string from the middle and vanished. I dont know what they where but i know they where not planes, and i have my family as witnesses.",
      "link": "http://www.nuforc.org/webreports/115/S115946.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3926",
      "summary": "Multiple orange spheres over Mesa/Chandler, AZ.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2014-12-18T00:00:00",
      "story": "Multiple orange spheres over Mesa/ Chandler, AZ. After coming home from the store, I noticed a orange sphere on the southwest of my location, I pulled over on the side of the road and parked my car facing west.  Soon after I parked I saw another sphere appear next to the first one I initially saw, I tried recording but my phone kept going out of focus. Around 9:30 I saw a single sphere appear far to the right of the two that i was triying to record,a few seconds later two appeared further right, two more appeared to the left of them and then two more!  All three of the set of two appear to be equally spaced and parralel from each other. I got some blurry video and a picture where all nine can be seen at a distance, unfortunatelly that is all I got, I wish I had a better camera.",
      "link": "http://www.nuforc.org/webreports/115/S115957.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c39f0",
      "summary": "Three lights in sky appear and disappeared.",
      "city": "mesa",
      "shape": "oval",
      "date": "2014-12-12T00:00:00",
      "story": "Three lights in sky appear and disappeared. Three circular shaped lights, one on top of another, appeared and disappeared over east mesa.  The top one flashed, then the bottom, then the middle, then the bottom moved west, and they all came lower and still appearing and disappearing.   The bottom one shot off to the sky and the other to continue to go lower and slowly west then eventually all disappeared.",
      "link": "http://www.nuforc.org/webreports/115/S115857.html",
      "state": "AZ",
      "duration": "10 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b89",
      "summary": "Top of hill, South Central Mesa, AZ, close to Interstate 60 Distance: approx. 0.5 mile from observer, facing north.",
      "city": "mesa",
      "shape": "light",
      "date": "2015-07-06T00:00:00",
      "story": "Location:  Top of hill, south central Mesa, AZ, close to Interstate 60. Distance:  Approx. 0.5 mile from observer, facing north  Source:  Periscope user broadcasting sighting, with over 28 live users watching at some time Observation Time:  02:45 to 04:15 approx  Description:  3 lights observed over South Central Mesa, AZ, close to Interstate 60.  2 of the lights over each other but not perfectly  (approx 10 degree off ) stationary.  3rd light bellow also at the same angle, this one is flashing and moving up and down fairly fast. All lights changing color from white, yellow and blue. Something lights fading but not at the same time.  Top light and bottom light had a relation  Ex: color change simultaneously and vanishing and coming back (but not all the time) this was observed about 4 time. Middle light not changing much and not at the same time as the other two.  No sounds.  Light just vanished without movement. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120003.html",
      "state": "AZ",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b9b",
      "summary": "3 fiery colored lights in line that did not flicker, but eventually dimmed, grew bright, then dimmed and zoomed off quickly one-by-one.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2015-07-17T00:00:00",
      "story": "3 fiery colored lights in a line that did not flicker, but eventually dimmed, grew bright, then dimmed and zoomed off quickly one-by-one. 3 fiery-colored lights in slightly bent line formation.  Appeared to be triangular in shape, and did not flicker, stayed in same spot for several minutes until the top one dimmed, grew brighter, then dimmed again completely and began to take off at an alarming speed.  Once flying away, it flashed subtly between red and blue, but there were no \"plane wing\" lights.  Over the next ~5 minutes, the other 2 did the exact same.",
      "link": "http://www.nuforc.org/webreports/120/S120313.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3da7",
      "summary": "2 orange lights.",
      "city": "mesa",
      "shape": "circle",
      "date": "2015-06-24T00:00:00",
      "story": "2 orange lights We witnessed 2 glowing orange light flying silently in tandem from the west head due east. They flew at a slow rate of speed just to the north of our home at an altitude of what appeared to be typical helicopter cruising height of 1200-1500 feet. We observed them for approx. 3-4 minutes until they 'winked out' in the far eastern sky. I have film footage.",
      "link": "http://www.nuforc.org/webreports/119/S119673.html",
      "state": "AZ",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3de5",
      "summary": "Two lights in sky slowly moving west over valley. Lights would Disappear and reappear. Multiple aircraft hovering/observing objects",
      "city": "mesa",
      "shape": "light",
      "date": "2015-07-06T00:00:00",
      "story": "Two lights in sky slowly moving west over valley.   Lights would Disappear and reappear.  Multiple aircraft hovering/observing objects ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120154.html",
      "state": "AZ",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e23",
      "summary": "Hovering object over SE Mesa.  ((NUFORC Note:  Venus and Jupiter.  PD))",
      "city": "mesa",
      "shape": "unknown",
      "date": "2015-07-03T00:00:00",
      "story": "Hovering object over SE Mesa Two hovering lights over SE Mesa.  Held position for an hour.  No sound and lights did not flash.",
      "link": "http://www.nuforc.org/webreports/119/S119935.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e62",
      "summary": "Noticed lit object dipping, recoiling, then glided over a park near me .  Bright red and blue orbs from ufo. 5 ft diameter.",
      "city": "mesa",
      "shape": "diamond",
      "date": "2015-06-24T00:00:00",
      "story": "Noticed lit object dipping, recoiling, then glided over a park near me.  Bright red and blue orbs from ufo.  5 ft diameter. I saw a lit object dancing in the air before it glid rapidly over a park.  Looked like a kite with neon red and blue lights.   The object flew very near to me over a brightly lit park, before it sank after flying over the roof of a house, never to be seen again.    Various witnesses saw the kite, drone like object.  Maybe it was a drone?",
      "link": "http://www.nuforc.org/webreports/119/S119728.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4056",
      "summary": "Small object moving in a straight line west to east just below cloud level",
      "city": "mesa",
      "shape": "circle",
      "date": "2015-05-22T00:00:00",
      "story": "Small object moving in a straight line west to east just below cloud level I was walking back from my mailbox and I noticed a small white object coming in my direction.  It was fairly high in the sky.  At first I thought it might be a piece of paper blowing along with the wind.  As it got closer to me I could tell that it was high in the sky. I kept looking at it and it traveled in a straight line, never veering from what seemed like an intended course.  The object was white and I could not make out a true shape other than an oval or circle.  It flew just below the clouds.  I watched it fly past in a line from west to east. I heard no sound and saw no other lights or flashes.  I started to think it might be a bird, but never saw a wing flap, and, as I stated, it flew in a perfectly straight line.  It was definitely too small to be an aircraft. I went into my house and got my binoculars, but by the time I got back outside it had disappeared from sight.  I know I was not seeing things, but I do not know what I actually saw.",
      "link": "http://www.nuforc.org/webreports/119/S119043.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4187",
      "summary": "Rectangular object with no lights or sound heading from south to north over mesa night sky",
      "city": "mesa",
      "shape": "rectangle",
      "date": "2015-05-13T00:00:00",
      "story": "Rectangular object with no lights or sound heading from south to north over Mesa night sky We were laying watching the night sky for shooting stars when I noticed what at first seemed to be a ground spotlight in the sky.  I pointed it out to the other person,  we both realized it was not a spotlight within seconds.  It came from the south going to the north.  It looked rectangular and seemed to have tan on the underneath.  Almost like many tan \"things\" flying in formation or like a parachute.  It was going too fast to be birds or a parachute and it was just after midnight. It made absolutely no noise and had no lights on it.",
      "link": "http://www.nuforc.org/webreports/118/S118947.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c418c",
      "summary": "Multi-colored almost straight line of lights, dropped out of sky near east mesa (Ellsworth and baseline) looking west.",
      "city": "mesa",
      "shape": "other",
      "date": "2015-05-13T00:00:00",
      "story": "Multi-colored almost straight line of lights, dropped out of sky near east mesa (Ellsworth and baseline) looking west. Almost straight line of multi colored lights, friend thought it was a ufo I didn't believe him until it dropped out of the sky out of no where.  It came back about five mins later no where near as high and I could see if from behind a tree line for ten seconds until it dropped down again.",
      "link": "http://www.nuforc.org/webreports/118/S118954.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c41cb",
      "summary": "As a friend of mine took our dog out to the backyard last nite she saw a very bright light in the sky.I saw this same light thru an ope",
      "city": "mesa",
      "shape": "light",
      "date": "2015-04-30T00:00:00",
      "story": "As a friend of mine took our dog out to the backyard last nite she saw a very bright light in the sky.  I saw this same light thru an open window in the house.  We both watched it from our locations.   After a couple of minutes the light disappeared with no movement or sound.  We live near an airport, know the sounds of all planes & helicopters.  This light was very still for the duration.  Then as stated it was gone within a blink of the eye.   This is not the first time I've seen a ufo.  There's no question on what we saw.  Also we've never seen a light this bright in the sky.   I don't believe a plane or helicopter could produce the brightness of this light we saw!  The night before we somehow lost power to part of the house leaving clocks blinking & cable box reset to Chan 1.   The rest of the house was fine so it's the strangest thing.",
      "link": "http://www.nuforc.org/webreports/118/S118665.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c455d",
      "summary": "Strange UFO meet up above Mesa Arizona!",
      "city": "mesa",
      "shape": "diamond",
      "date": "2015-11-26T00:00:00",
      "story": "Strange UFO meet up above Mesa Arizona! 2 Gray UFO's were in front of a bigger whiter somewhat similar shaped UFO and it looked like they were shooting little things back and forth but no noise or explosions; like even smaller ufos going between the three bigger UFO's.",
      "link": "http://www.nuforc.org/webreports/124/S124269.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c465d",
      "summary": "Fiery ball floating in the sky over Mesa, AZ.",
      "city": "mesa",
      "shape": "fireball",
      "date": "2015-12-03T00:00:00",
      "story": "Fiery ball floating in the sky over Mesa, AZ. While walking our dog my wife and I seen this fiery flashing ball like object, just floating in the sky and staped flike ring for abut 3 mins, then disappeared.   We were standing in the area of Southern Ave & Stapley Dr in Mesa, AZ & seen the object in the direction NE of there.   It looks like someone posted something similar on 11/24/15 @ same time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124393.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b65",
      "summary": "Triangle craft moved slowly and deliberately over the area, was very low, and clearly visible after thunder storm.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2015-09-11T00:00:00",
      "story": "Triangle craft moved slowly and deliberately over the area, was very low, and clearly visible after thunder storm. Triangular craft, 7 lights total, each corner one large white light, with a small white light between each corner.   Large orange-red light in the center.  Caught the light out of the corner of my eye, looked up to my left (southwest facing yard).  Craft was moving very slowly westward, had enough time to get a full view of it, turned my head for a second and it disappeared.   Was much lower than a plane, lower than cloud cover.   Made no sounds but was not trying to hide.",
      "link": "http://www.nuforc.org/webreports/121/S121690.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5073",
      "summary": "Very low, large, fast traveling lights that just disappeared quickly with no clouds in the sky. There were 3 lights in a triangle shape",
      "city": "mesa",
      "shape": "triangle",
      "date": "2016-02-26T00:00:00",
      "story": "Very low, large, fast traveling lights that just disappeared quickly with no clouds in the sky.  There were 3 lights in a triangle shape.   I grabbed my friend because I thought a big, passenger plane may have been crashing.  Then it just was gone.   We both saw it.  Neither of us can truly explain it. ((NUFORC Note:  Source provides not information about sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125938.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c54c3",
      "summary": "Successive bright amber lights lighting up in a row.",
      "city": "mesa",
      "shape": "light",
      "date": "2015-12-17T00:00:00",
      "story": "Successive bright amber lights lighting up in a row As I was driving home from dropping my daughter at Volleyball practice in Gilbert, AZ, while driving east on Germann Rd near Higley Rd, I saw lights, about 2 miles up, directly over Phoenix Mesa Gateway Airport (KIWA.)  The lights successively lit up from right to left with a bright amber points of light.  I believe there were about 6 of them.  After each light lit up and the one next to it lit up, it would go dim and disappear.   After arriving home around 7:15pm, I immediately called the Airport's \"Aviation Services, fixed base operations,\" and the lady that answered the phone said that they just heard the tower address the lights and nobody knows what they were or how they ended up directly above runway 12R-30L.  She said it was very strange, but had no explanation.   I am an aviation enthusiast and am very familiar with anomalies in the skies.",
      "link": "http://www.nuforc.org/webreports/124/S124707.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a2d",
      "summary": "A craft over a house in East Mesa..",
      "city": "mesa",
      "shape": "teardrop",
      "date": "2016-04-29T00:00:00",
      "story": "A craft over a house in east mesa. On this evening,  facing as I was coming down the street I saw a craft about the house it seemed to be on its left side I thought it was a helicopter but then I noticed it had no propeller it was facing Southwest as I approached the area A big flood light flashed over the entire house got my attention.  in the craft turned more towards the West and then it was gone,  nothing.   I did approach the house and I asked the people that were leaving the house at the time at the same exact time if they saw anything and they said no they said nothing they jumped in their cars and rode away in this took place on Colby Street on the east side of Mesa. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127058.html",
      "state": "AZ",
      "duration": "1.30"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a72",
      "summary": "I saw what looked like the only cloud in the sky. It was a small smudge. The sun was rising from behind the mountains so that little sp",
      "city": "mesa",
      "shape": "fireball",
      "date": "2016-05-06T00:00:00",
      "story": "I saw what looked like the only cloud in the sky.  It was a small smudge.  The sun was rising from behind the mountains so that little speck of a clout was shining super bright in the sky.   I train my eyes on the freeway and when I looked back I appeared as if the atmosphere had changed this illuminous cloud, the bottom had fallen down and it was now elongated top to bottom.  I look back a third time and it was even longer but a round circle was there ad I'd an explosion took place below the original cloud/light.  As the newly formed bottom parts disappeared the original cloud remained but a small star was under it where the other mass had been.  Then the star slowly descended behind the Superstition Mountains while the Sun in view thru my same wins hill (sic.  windshield??) kept rising up.  Shouldn't the star and the sun both have risen upwards?  Yes, if it was a star.",
      "link": "http://www.nuforc.org/webreports/127/S127164.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5be5",
      "summary": "Red, spherical light slowly and irregularly flashing, no sound.",
      "city": "mesa",
      "shape": "light",
      "date": "2016-04-01T00:00:00",
      "story": "Red, spherical light slowly and irregularly flashing, no sound. I was leaving the hospital from visiting a relative when I looked up to the sky because something caught my attention as I walked to my car.  I noticed a red spherical light traveling slowly across the sky right over me.   As I watched, I noted that it traveled rather slowly and blinked periodically, slow blinking. I looked for other lights as my first thought was that it had to be a helicopter, but no other lights could be seen...then I realized it absolutely couldn't be a helicopter anyway because it made absolutely no sound whatsoever.   It got to about halfway across the sky and directly overhead when it paused for about 3 seconds, then began to travel, at the same slow speed, back to the north, in the opposite direction from how it was traveling prior to stopping for a moment.  I watched it until it faded from my view.   No other appearances were made by this light that I noticed before I got in my car and drive home.",
      "link": "http://www.nuforc.org/webreports/126/S126618.html",
      "state": "AZ",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c6b",
      "summary": "Triangular shape object flying overhead maybe 50 feet was seen.",
      "city": "mesa",
      "shape": "triangle",
      "date": "2016-03-24T00:00:00",
      "story": "Triangular shape object flying overhead maybe 50 feet was seen. While attending a LDS/Mormon Easter Pageant last Friday evening at the Mesa Temple in Mesa, AZ... approximately 20mins after 8pm, while there was a break in the play.  Just for a second in relaxing while I was looking up to the stars, noticing a half-faced moon (facing south-west) I noticed during the event/show there were airplane learjets flying from south to north-western pattern which would fly directly over my head say every 50 secs.  This was a bother at times when I'm trying to enjoy the show as these jets were only a few hundred feet above me.  So as I looked up one time I noticed a triangular shaped craft as I took aim with my eyes for a closer examination.  I noticed there was at least 2 circular shapes within this triangle... it was not lit up internally but the shape of this was illuminated from the street lights (Main street which was to my right) and the surrounding lights.  This shape was say 40 to 50 feet above me it seemed like and was taking a! northern flight path.  It seemed to be the speed of like a quad-copter or drone which my first thought was that someone probably is currently flying a drone because it would make a great camera/video of the event that night but after I was examining this object as it hovered slowly at the same altitude there were several brief moments in the play/show where there were no sounds so I had a good listen to the surrounding area while it was flying overhead and I noticed no sound coming from this craft.  After further thought I ruled out it was any quad copter/drone because something that size would be quite loud enough for me and others to hear it's props/engine.  I was asked by my family later when I told them what I saw why I didn't catch their attention when I saw it first but this whole experience took maybe 20-25 secs was all so I was recording this experience and taking in all of my senses in to determine what it was exactly.  Besides, if I would have told them about it and to look up, etc...  I would have missed more of the details! of what I saw.  In another detail of this craft I was prompted to remember the framing of this triangle/object I saw as it had thick bars outlining this triangle... almost thinking it was from an Erector set, haha, but again I saw no evidence of it being owned by people or could be bought in any Hobby store... as there were no sounds coming from it when all around me was quiet for a few seconds.  I following watching this object and even cupping my forehead and face to block other lights around me and it flew a northern path until I couldn't see it anymore as it flew into the darkness.  So it either flew at a higher altitude or flew away so far that the current surrounding lights that I was seeing it could not lite it up anymore. This experience prompted me to submit this post as I couldn't find any other UFO sighting/records around the area/valley with this same experience and description. Thank you for your attention.",
      "link": "http://www.nuforc.org/webreports/126/S126511.html",
      "state": "AZ",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5db9",
      "summary": "Bright red light,waning until disappearing, moving in small, erratic, directional changes.",
      "city": "mesa",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "Bright red light, waning until disappearing, moving in small, erratic, directional changes, and didn't seem to be acting as an aircraft. While sitting outside our home, we noticed a one very bright red flashing light that appeared to be moving in small increments in different directions.  After approximately 20 minutes, the brightness of the object gradually waned to merely another light, similar to a \"star\" in the sky.  Moments later, it literally disappeared.   I am aware of different conditions that can seem odd to the casual observer, such as a jet airplane that may be cruising at high altitude after sunset and the Sun's rays reflecting off the airliner's skin and appearing to be a bright red fast moving object.  I have been around airports and airplanes for most of life and have seen many aerial objects in combat areas, so I know something odd when I see it.  I sincerely believe that I witnessed a UFO above the Mesa/Apache Junction/Queen Creek, Arizona area.  Thank you.",
      "link": "http://www.nuforc.org/webreports/131/S131423.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c60c0",
      "summary": "I only saw 4 or 5 oscillating lights while travelling down the 202 eastbound.   Amber or white in color.  Slowly moving through the sky",
      "city": "mesa",
      "shape": "unknown",
      "date": "2016-10-27T00:00:00",
      "story": "I only saw 4 or 5 oscillating lights while travelling down the 202 eastbound.   Amber or white in color.  Slowly moving through the sky.   Didn't look like military flares and used to live next to AFB and Army base that used them all the time.   No sound and not like any aircraft I've ever seen. 40 yr old educated Hispanic American.",
      "link": "http://www.nuforc.org/webreports/130/S130847.html",
      "state": "AZ",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6563",
      "summary": "Green, bright, ball falling from sky, Mesa, AZ.",
      "city": "mesa",
      "shape": "fireball",
      "date": "2016-08-19T00:00:00",
      "story": "Green bright  ball falling from sky, Mesa, AZ. Driving and saw a soccer size green light, with light in back, fall from sky and disappeared.  Was really fast. ((NUFORC Note:  We assume a nighttime sighting, and have amended the time above, to reflect that fact.  Witness elects to remain totally anonymous, and provides no contact information, so we are unable to confirm the time.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129367.html",
      "state": "AZ",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6830",
      "summary": "We saw bright orbital objects and 1 larger grey object.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2017-03-10T00:00:00",
      "story": "We saw bright orbital objects and 1 larger grey object. I was at work Saturday, February 25, 2017.  I took my lunch brake at 2:05pm.  Went to the back of the building and sat down to enjoy some fresh air.  I felt (something) staring at me, looked around and did not see any body.  After a few minutes looked around again but this time I looked around in the sky and there I saw roughly 9-15 white sphere objects moving around.  Not sure how long I was staring in disbelief at what I was seeing. I then knocked on the window and asked for someone to bring me my cellphone so I could take photos of this event.  My daughter brought out my IPhone and we both stood there a few minutes to make sure this was not just debris.  Then I started too snap photos and saw a bigger dark grey object fly in to the area where the spheres were.  Then the store started to get busy and my help was needed.",
      "link": "http://www.nuforc.org/webreports/132/S132810.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c68f9",
      "summary": "Blue dot in sky ascends and descends quickly with a plane flying by a reference.",
      "city": "mesa",
      "shape": "light",
      "date": "2017-04-07T00:00:00",
      "story": "Blue dot in sky ascends and descends quickly with a plane flying by a reference. Looking SE from my 3rd floor apartment patio, saw what I thought at first glance was the police helicopter circling something but when I looked back it had done this super fast circle and immediately dropped behind the tree/building line of sight.  Seconds later it reappeared and achieved a very high altitude in seconds.  I recorded it on my phone and will be sending that footage to you guys as well. In the video, it appears as a blue dot and seems to hover for a bit then starts descending again as a passenger plane approaches. It lowers below the aircraft, hovers for a second, then continues its descent until out of view again. Shortly after a helicopter flew over the area as well as other lights that looked to be small aircraft or helicopters in the distance for about 10 minutes afterwards. I understand this could just be someone playing with a drone or whatever, but the altitude it appears to achieve and the speed it occurs at is something I've honestly never seen before.  Never seen a \"drone\" or anything like this flying in this area of Mesa/East Valley in my whole life.  Like I said, could possibly be explained or \"debunked\" but I felt strong enough about it to let you guys take a look.  Thank you.",
      "link": "http://www.nuforc.org/webreports/133/S133411.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c697c",
      "summary": "Witnessed 2 orange orbs being followed by a large helicopter like a Blackhawk. Flew directly overhead at approximately 500ft northbound",
      "city": "mesa",
      "shape": "sphere",
      "date": "2017-03-17T00:00:00",
      "story": "Witnessed 2 orange orbs being followed by a large helicopter like a Blackhawk.  Flew directly overhead at approximately 500ft northbound.   They circled around a few miles past me and were headed south near the Mesa and Tempe border.  No noise from the smaller craft.   Although they seemed to move in unison, they were 2 separate objects.",
      "link": "http://www.nuforc.org/webreports/133/S133113.html",
      "state": "AZ",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b64",
      "summary": "3 Pulsing yellow/orange lights.  ((anonymous report))",
      "city": "mesa",
      "shape": "light",
      "date": "2017-02-03T00:00:00",
      "story": "3 Pulsing yellow/orange lights Looking south from McDowell Rd and 202, I saw three pulsing lights hovering in a straight line.  After 20 seconds or so, all three lights disappeared.   This is the second time in 3 months I have seen these. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132433.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c6d",
      "summary": "Metallic object flashing in sky.",
      "city": "mesa",
      "shape": "egg",
      "date": "2017-01-06T00:00:00",
      "story": "Metallic object flashing in sky. I was walking down 8th ave near the railroad tracks in downtown mesa, looked up and saw what i thought to be an approaching plane, but it remained motionless in the sky, slighlty gliding around about sundown, its body glimmering with light from a setting sun.  It appeared to be hovering over interstate 87 on the pima reservation.   I brought a police officer's attention to it who was nearby working an unrelated call, and after he saw it, told me it could be a balloon.  The object vanished in clouds soon after.",
      "link": "http://www.nuforc.org/webreports/131/S131988.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ea5",
      "summary": "Several aircraft in Mesa, AZ, seen on 8/18/17.  ((anonymous report))",
      "city": "mesa",
      "shape": "other",
      "date": "2017-08-24T00:00:00",
      "story": "Several aircrafts in Mesa, AZ, seen on 8/18/17. Several aircrafts seen with flashing lights.  They would come together and form a bigger white lights then race in the sky and go in all directions.  Then they would disappear while the others would form groups.  They would go forward and backwards.  They would go very low and at super fast speeds go up into the sky.  No sounds was heard from them. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135786.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c72d3",
      "summary": "Low altitude balls over Mesa, AZ, appearing, then disappearing after a short flight in tandem.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2017-06-22T00:00:00",
      "story": "Low altitude balls over Mesa, AZ, appearing, then disappearing after a short flight in tandem. At approximately 9:00PM, I was in my backyard attending to my BBQ.  From the corner of my eye I saw a extremely bright flash that lit up the entire neighborhood.   I looked and thought for a second someone had shot off those massive fireworks.  Two extremely bright red glowing balls of light were now sitting in its place, silent.   As I pulled my phone from my pocket to get a video they started to move together eastbound.  They remained extremely bright red, almost like a hot air balloon.  They move together in tandem at approximately 80 knots at an altitude of 3,000msl.  No position light or anti collision lighting was observed.   As they moved east the one at the rear  disappeared completely.  The one in the leading position continued until it flashed a number of times then disappeared.  The video does not do justice, these objects were  incredibly bright casting a red hue over the ground as they moved.   I am a professional pilot and know just about everything fixed wing and rotor craft display at night.  These were completely silent.",
      "link": "http://www.nuforc.org/webreports/134/S134618.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7445",
      "summary": "Arch shaped, red/orange color.  ((anonymous report))",
      "city": "mesa",
      "shape": "other",
      "date": "2017-05-15T00:00:00",
      "story": "Arch shaped, red / orange color We were near 4 peaks and Saguaro Lake.  Looking into the cliffs.  This appeared and definitely did not move like a plane or heli.  We watched for a few minutes and got a pic.  When zoomed in, it is an arch shape.  Red/orange in color. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134144.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7542",
      "summary": "Round, shiny object fewed sitting way up in the sky for a few seconds before drifting to the right and disappearing completley.",
      "city": "mesa",
      "shape": "circle",
      "date": "2017-04-28T00:00:00",
      "story": "Round shiny object fewed sitting way up in the sky for a few seconds before drifting to the right and disappearing completley. My 13 yr old son and I were throwing frisbee in the front yard.  It was late afternoon, around 6pm.  I noticed something really high in the sky and started staring.  My son asked what I was staring at, and then turned around and exclaimed, \"Wow, that is really high in the sky.\"  We both proceeded to watch it sitting still in the sky, and then after a few seconds, moved slowly, sort of drifting, to our right for a few seconds, and then disappeared.   At this time, my son swung back around with excitement and asked, \"Where did it go?!\".  I wondered the same and shrugged my shoulders.   The object was round and very shiny, silver looking.  It made no noise and had no chemical trail behind it.  Very strange...???",
      "link": "http://www.nuforc.org/webreports/133/S133832.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7658",
      "summary": "Bright light with trailing aura moving across the sky.",
      "city": "mesa",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "Bright light with trailing aura moving across the sky My partner and I saw a bright light with a trailing aura (like a wake spreading out behind a boat, only not V-shaped, but more U-shaped) slowly move across the sky. We live near the Phoenix-Sky Harbor flight path, so we see planes coming in a lot.  This looked completely different than the normal planes we see coming in at night.",
      "link": "http://www.nuforc.org/webreports/137/S137998.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c765c",
      "summary": "A light in the sky that emitted whitish beam with a tint.  ((NUFORC Note:  Rocket launch at 5:27 p.m. (Pacific).  PD))",
      "city": "mesa",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "I was in the middle of wrapping Christmas gifts, when my fiance called.  He is a mailman that's why he was out late.  He let me know to go outside that there is a light in the sky that emitted whitish beam with a tint.   I grabbed my mother in law and said come outside there is something in the sky.   I went in the house to grab my camera and when I came back outside my mother in law let me know that a yellow round light beam shot out for about 2 seconds and then a green light that was round shot out.  From my understanding of air control rockets can emit beams of light due to aircraft's.  They even tell you on new statements not to use lasers or appoint them randomly in the sky rad aircraft's.   I called my brother who lives in Los Angeles he captured the event on video.  This did not look like a rocket to me in the video.  It looked more like a comet like object.  If you look closely at the video you can see there's something in the trail like there's 2 objects.  I've never seen a rocket leave a trail the way that this anomaly did.  The most odd aspect of this event is how the light lit up the cloud like it was forming a cloud.  Not to mention after my brother filmed this video he said that helicopters were following the anomoly.  If this was a rocket what purpose would helicopters have in following a test rocket. ((NUFORC Note:  Rocket launch at 5:27 p.m. (Pacific).  We have changed the time indicated by the witness, to reflect an afternoon launch.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138006.html",
      "state": "AZ",
      "duration": "0:30"
    },
    {
      "_id": "64d005f478aba2ec5a3c765d",
      "summary": "Fast moving glowing object with glowing gas plume remaining for several minutes flew over Phoenix after sundown heading north to south.",
      "city": "mesa",
      "shape": "cigar",
      "date": "2018-01-12T00:00:00",
      "story": "Fast moving glowing object with glowing gas plume remaining for several minutes flew over Phoenix after sundown heading north to south. A glowing orangish cigar or cylindrical shaped object formed  a huge fan of whitish glowing gas (at about a 45 degree angle behind the object) with object traveling horizontally at a high rate of speed from North to South over Phoenix (Observers were looking west from a Mesa Hillside). The residual gas remained behind and stayed glowing for several minutes after object could no longer be seen near the horizon.  The object was not a meteor or an aircraft.  Based on the remaining gas plume the object originally must have traveled west to east first and then turned south somewhere over north Phoenix. It could have been a rocket that went off course? ((NUFORC Note:  Rocket launch at 5:27 p.m. (Pacific).  We have changed the time indicated by the witness, to reflect an afternoon launch.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137968.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c76d4",
      "summary": "orange orbs in formation",
      "city": "mesa",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "orange orbs in formation I'm in Lehi when it happened  (North Mesa Arizona) The First Time was 7-10 minutes.  The Second time was longer.  At First was 5 or 6 but would dissipate when you caught a glimpse of them.  The Color was Orange Hazy but each one was like 3 points of light that formed a upside down triangle (flying in formation like ducks )",
      "link": "http://www.nuforc.org/webreports/138/S138161.html",
      "state": "AZ",
      "duration": "10-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b8f",
      "summary": "Is that a star?",
      "city": "mesa",
      "shape": "changing",
      "date": "2017-10-05T00:00:00",
      "story": "Is that a star? Sitting outside when we noticed what seemed to be a star bouncing around.  Grabbed my iPhone to take photos and use Stargazer App.  With  the naked eye looked like a star. Zoomed into the object and took about 20 photos of the object as it changed shape and color.",
      "link": "http://www.nuforc.org/webreports/136/S136489.html",
      "state": "AZ",
      "duration": "2 miniutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e54",
      "summary": "Black Rectangular Flying Object Over Mesa, AZ.  ((anonymous report))",
      "city": "mesa",
      "shape": "rectangle",
      "date": "2018-05-31T00:00:00",
      "story": "Black Rectangular Flying Object Over Mesa, AZ. As I watched the sun set and planes making their way to Sky Harbor airport, I noticed a black, square aircraft almost directly overhead.  It was much further away compared to the planes heading to the airport.  And it didn’t move much.  Watching for a few minutes, I saw that when it did move, it was slow and bobbing.  This was potentially a balloon or drone.  But it would have to be jet sized or bigger, judging by the planes for reference. The craft was too far away to take a meaningful picture.  It was just too small.  But I ran inside to get some binoculars just in case they would help show some detail.  I came back outside less than 60 seconds later, and it was gone without a trace.  Nothing in the sky either above, or on the horizon.  It was far too slow to have moved completely over the horizon or up out of sight in less than a minute. After a brief search, I’d say the closest similar sighting is one recorded in McAllen, Texas, on Dec 6th 2014. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141678.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8223",
      "summary": "Line of sequencing lights in Arizona.",
      "city": "mesa",
      "shape": "cigar",
      "date": "2018-01-25T00:00:00",
      "story": "Line of sequencing lights in Arizona. Observed from SanTan freeway (north bound) headed toward Apache Juction (by Mesa Gateway Airport). Northern Sky.  Observed 8 to 10 lights in very tight proximity to each other.  A perfect horizontal line of lights.  The light on the left turned on first then it turned off as the light next to the right turned on and so on, then repeat.   There was 1/2 seconds between transitions.  These were very bright, others also had to see these lights.  The lights were bright amber in color.",
      "link": "http://www.nuforc.org/webreports/138/S138592.html",
      "state": "AZ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c88fa",
      "summary": "Magenta-Violet Orb Moves Abnormally Through Eastern Mesa Sky.  ((anonymous report))",
      "city": "mesa",
      "shape": "circle",
      "date": "2018-06-15T00:00:00",
      "story": "Magenta-Violet Orb Moves Abnormally Through Eastern Mesa Sky Saw a circular UFO while walking my dogs tonight around 8:00pm MST. Glanced up and saw a violet-turning-magenta colored circular figure (I can only explain the violet color as looking like your nails do when you're in a room that has a black light on) in the sky sitting dead still.  At first I thought it may be a plane or helicopter coming straight toward me, appearing to be still, but then the object started moving to the left (eastern sky beginning at dead-center east, then slightly left of east across horizon and back).  The object moved slowly to begin but glided unlike anything I have ever seen. It then stood at a dead stop once again for about 30 seconds.  After this it ZIPPED QUICKLY AND UNNATURALLY to the left about an entire palms-length when held up to the horizon. After this it stood still for a moment once more, then zipped back to the right to its original position and lowered itself straight down at an unnatural speed.  This happened three times and I have three separate videos of the event. Directly before recording the third video, a helicopter made a brief attempt at chasing the object (which prompted me to run into my home to grab my camera for a third recording). ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141787.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c899e",
      "summary": "Orange orbs over Mesa, Arizona.",
      "city": "mesa",
      "shape": "sphere",
      "date": "2019-09-19T00:00:00",
      "story": "Orange orbs over Mesa, Arizona, While looking North, 2 orange objects appeared in the night sky moving from North to Northeast.  Moving slowly, no sound.   Watched for 10 minutes as they moved out of sight.",
      "link": "http://www.nuforc.org/webreports/148/S148817.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c922a",
      "summary": "My husband and I were heading east on Route 60 towards Mesa Arizona when my husband noticed an object in the sky. He at first thought i",
      "city": "mesa",
      "shape": "rectangle",
      "date": "2019-12-01T00:00:00",
      "story": "My husband and I were heading east on Route 60 towards Mesa Arizona when my husband noticed an object in the sky. He at first thought it was a flag flying, when we realized it was some kind of flying vehicle. I got out my phone and took a picture and a short video. My husband handed me his phone to get better quality photos but unfortunately, the vehicle had already dipped below the horizon. We are still wondering what we saw exactly.",
      "link": "http://www.nuforc.org/webreports/149/S149812.html",
      "state": "AZ",
      "duration": "00:30"
    },
    {
      "_id": "64d005f478aba2ec5a3c935a",
      "summary": "My daughter and I have seen them several times they hover. Last night my nephew was with me and we saw the most we've ever seen if we w",
      "city": "mesa",
      "shape": "oval",
      "date": "2019-12-01T00:00:00",
      "story": "My daughter and I have seen them several times they hover. Last night my nephew was with me and we saw the most we've ever seen if we were facing west we saw approximately 5 just hovering when we were looking I think to the South we saw them hovering three of them one larger and then we saw helicopter come by and investigate and the largest one started to move it had been offering for several minutes continue throughout the evening",
      "link": "http://www.nuforc.org/webreports/150/S150000.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c93fe",
      "summary": "UNIDENTIFIED FLYING OBJECT OVER MESA, ARIZONA TONIGHT 11/07/19.",
      "city": "mesa",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "UNIDENTIFIED FLYING OBJECT OVER MESA, ARIZONA TONIGHT 11/07/19. Hello, I just called in at 8:54 p.m. mountain time and spoke to Mr. Sky (Sic.  Davenport) himself.  At around 8:44 p.m. in Mesa, Arizona, I was standing in my backyard facing north and saw an unidentified flying object above. It was traveling in the northeast direction. This object, viewing it at a length size, had to of been comparable to the size of a football field or bigger.  I live under the flight path to Sky Harbor airport where the planes travel in the west direction to land. As the object was flying over the valley, it was silent. It had a very eerie feeling to it for the 60-90 seconds I got to experience. It was a grey/black object with 3 lights spread out equal length on the craft.  The lights were red, and the rear light was flashing red.  This object, like I said, was silent.  No lights on the object like a plane, no engine sounds, complete silence and darkness other than the 3 lights on the craft.  It slowly traveled over the Mesa area in the northeast direction and I lost eyesight of this object. This was not a plane. This was not a jet.  This was not a blimp.  This was not any craft known to man, I know this for a fact.  I am a very reliable source that has been studying this subject for years now and it is not my first experience.  However, this was the clearest and longest experience I have had to date. Thank you for taking the time to read my report and answer my phone call.  Hope to hear someone else had experienced this as well.",
      "link": "http://www.nuforc.org/webreports/150/S150465.html",
      "state": "AZ",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c94cc",
      "summary": "String of lights traveling horizontally before entering a pocket.  ((NUFORC Note:  Cluster of \"Starlink\" satellites.  PD))",
      "city": "mesa",
      "shape": "other",
      "date": "2019-12-01T00:00:00",
      "story": "String of lights traveling horizontally before entering a pocket. In the Southwest skies at approx. 19:20 was a horizontal formation of lights. They appeared to be following in a line with the last light keeping space from others. They didn’t appear to be ascending/descending but did appear to be getting further away. The lights seemed to have disappeared one at a time as though they were going into a pocket one at a time.",
      "link": "http://www.nuforc.org/webreports/150/S150549.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c94c9",
      "summary": "At 30 degrees In S skies string/column of 6 to 10 lights. ((NUFORC Note:  Cluster of \"Starlink\" satellites.  PD))",
      "city": "mesa",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "At 30 degrees In South skies at considerable distance and height string/column of 6 to 10 lights traveling west to East. Very visable. Some lights were single and some multiple but all in a row. *    ——-      *    -       *      ————    *.      —— 19:00 pm  for  4-5 minutes beginning In the Southwest and remaining visable until slightly South East.",
      "link": "http://www.nuforc.org/webreports/150/S150660.html",
      "state": "AZ",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c98b4",
      "summary": "String moving satellite like dots in sky above Mesa, AZ.   ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "mesa",
      "shape": "light",
      "date": "",
      "story": "String moving satellite like dots in sky above Mesa, AZ Saw a whole string of white moving dots of lights, like satellites, numbering about nearly 30 or 40 moving slowly from SW (From Orion Constallation) towards the NW. The whole show string lasted several minutes, at least 5 minutes.  In fact I went and check on the computer and then came back out to see them still emerging from the Orion constellation.  They were all lined up almost perfectly and fairly evenly spaced.",
      "link": "http://www.nuforc.org/webreports/151/S151033.html",
      "state": "AZ",
      "duration": "5 minutes"
    }
  ]
}