{
  "city": "milwaukee",
  "fetch_timestamp": "2025-07-12T14:26:43.732214",
  "record_count": 81,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b48e8",
      "summary": "I have video  Danced in sky then took off.",
      "city": "milwaukee",
      "shape": "flash",
      "date": "2019-08-23T00:00:00",
      "story": "I have video  Danced in sky then took off.",
      "link": "http://www.nuforc.org/webreports/148/S148385.html",
      "state": "WI",
      "duration": "26 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b14",
      "summary": "Voronezh symbol shape ufo spotted in Milwaukee.",
      "city": "milwaukee",
      "shape": "other",
      "date": "2019-06-20T00:00:00",
      "story": "Voronezh symbol shape ufo spotted in Milwaukee While driving South on 43 we saw what looked like The top of a tower only it wasn’t a tower.  It was 3 vertical Dark tube like markings.   When googling ufo 3 vertical Lines we found the exact shape.  It was like The Voronezh Alien Encounter shape on the illustration.  Exactly like it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146688.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4c8d",
      "summary": "I can see a cylinder crossing at high speed on the sky,from west to downtown,on the back is very dark cloud..  ((anonymous report))",
      "city": "milwaukee",
      "shape": "cylinder",
      "date": "2019-06-27T00:00:00",
      "story": "I can see a cylinder crossing at high speed on the sky,from west to downtown, on the back is very dark cloud..  so the object is white metalic..some vary saw the same thing?? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147064.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5249",
      "summary": "Milwaukee-- one winged, silent, brightest lights, huge, 1993",
      "city": "milwaukee",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "Milwaukee-- one winged, silent, brightest lights, huge, 1993 I was a passenger in a vehicle with three other people (a friend, his brother, his mom, me).  We were traveling from Milwaukee south to Kenosha on a road running parallel and just east of I-94.  We first noticed what we thought was a plane flying very low with extremely bright lights flying directly at us.  The plane took a long time to reach us and eventually we pulled over to witness this flyby.  The three lights were so bright.   We pulled the car over and turned off the engine.  The craft was flying around 100 ft off the ground—amazing.  It was all-white, one winged, no windows, and had to be two stories thick but rounded with slightly swept back wings.  The most amazing part was it made no noise!  It looked like it weighed 300 tons, as big as a passenger jet but much thicker.  Moreover, it was flying no more than 15 mph.  I had a good long look at it 100 feet away.  It flew right along the west side of the road.  By far the most amazing thing I’ve ever seen.   I’ve told the story many times with a response most often of “hm.”  I have yet to look on the site but more people had to see this thing.  It was flying in the direction of the Mitchell airport, so I’ve always wondered if it landed. ((NUFORC Note:  Source of report indicates that date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63069.html",
      "state": "WI",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b563d",
      "summary": "A silent black triangular object with no lights moved over us as we walked our dog across a school playground.",
      "city": "milwaukee",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "A silent black triangular object with no lights moved over us as we walked our dog across a school playground. My husband and I were walking the dog on a clear crisp October night when I looked at the eastern sky and spotted the little dipper. Suddenly I saw a shadow move in front of the little dipper and thought it was a flock of ducks or geese or something. Well I kept looking up at the sky and suddenly out of nowhere moving slowly from the northwest to the southeast right above us was a large black triangular shaped object blotting out the stars as it moved silently along. It eventually disappeared from view in the souteastern night sky. There were no lights and no sound. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57538.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b590e",
      "summary": "Golden orb follows car, then changes into black triangle ufo, stops , and \"waits\" for them to pass close by.",
      "city": "milwaukee",
      "shape": "changing",
      "date": "2007-02-01T00:00:00",
      "story": "Golden orb follows car, then changes into black triangle ufo, stops , and \"waits\" for them to pass close by. It was New Years day, 1998. Approximately 10:55 pm in Wisconsin, USA.  Three people were driving from Milwaukee to West Allis on a routine 20 minute drive to drop off a companion on a cold New Year's night. While on the apex of a bridge adjacent to an industrial area, the back passenger spotted a golden light, flashing at a rate of about 4 flashes per second, moderately high in the dark southwestern sky [see FIGURE 1]. It was about the size and color of a small, golden street light, fixed in the sky behind and to the left of the vehicle. The back-seat passenger alerted the driver and the front passenger to the peculiarity of the light, and they all thought it might be some sort of \"helicopter\" or \"star\". As there was hardly any traffic, the driver slowed the vehicle down between 10 to 15 mph.  The object conspicuously glided down towards the ground and closer to the observers. It ceased flashing and became a solid \"gold-light orb\" [see FIGURE 2]. Now seeming to be only a few blocks away to their left (west), it began to parallel the movement of the vehicle—keeping up with its exact speed.. It was fairly low to the ground because it was somewhat being obscured by some thin tree branches (without leaves) along the roadside.  The vehicle, now having passed off the bridge, continued to move northbound towards a major intersection. As the driver slowed even more to get into the left-hand turn lane at a stop light, a red light rotated around the left side of the object, and then a blue light rotated around to the right side of the object. Both lights stopped at the visible edges and remained fixed at the object's respective sides for only a moment—disappearing within seconds [see FIGURE 3]. At this point the object was moving at its slowest. Because of the sudden appearance of the “police” lights and its speed, the witnesses concluded that it must be a police helicopter on a mission.  As the car sat at a complete stop in the left-hand turn lane, there were a few cars to the right of the vehicle. But people in those cars were not looking toward the object, which was traveling at a laborious pace very low to the ground (perhaps a 100 ft). It could barely be seen unless you were looking for it. As the object began to cross over the avenue they were going to turn onto (west), it now appeared to “branch out” into a string of five pale-white lights. It moved silently, almost at “walking speed”. The witnesses rationalized that it might be some sort of plane trying to make an emergency landing - but why land perpendicular to the street?  The lights suddenly stopped and became fixated directly above an estimated seven story factory building just two blocks away. The traffic light changed to green, and the driver finally turned left toward the object; it was just up ahead. No other cars or people were out on this usually busy street. Curiosity and perplexity filled the witnesses as they moved closer to the building.  Finally, the car pulled over to the side of the road. The back passenger rolled down his window and stuck his head out of the car to observe what could be resting in the sky above. The other two people strained to get a good view from the front passenger window. What seemed like a string of lights from a few blocks away on approach were actually the lights on the \"front\" and underneath of a large, black, equilateral triangle object. The five lights shown down like \"baseball stadium lights\", and were located at all three corners and in the middle of the two \"front\" sides [see FIGURE 4].  This large object was “fixed” in the air, producing absolutely no noise, movement, or flashing. Everything around them seemed so still, almost like they were in a vacuum and “weren’t supposed to be there.” The body of the triangle was colored charcoal-black, with a faint, grayish grove running along the front tip to the back center. There were visible sides: the edges showing a continuous grayish-black indentation with a slight overhang or lip. There also seemed to be very faint “circuit board” type etches on the body of the object. These apparent etchings were more apparent in the center grove on the “belly” of the triangle and within the groove or indentation along the sides. One witness later remarked that some of its features reminded him of a “Star Destroyer” space vehicle from the Star Wars movies.  After approximately 30 seconds of viewing the object, the driver became agitated and fearful, saying that they “have to get out of here.” He drove away and continued westbound on the avenue. When they left, the object left their point of view. But as they increased their distance at a block away, it came into view again in the back window, still fixated in the sky in the exact position last seen. Anyone else viewing the object might have passed and though nothing of it. It was so still and innocuous, that they probably would have thought it was part on the building complex. As the car passed over a hill a few blocks west of the object, it could not be seen any more. No other cars were observed on the road until about a half mile later.  The total experience was less than 5 minutes.  The three witnesses remained shaken for the rest of the night, with one of them insisting that it must be some sort of police helicopter performing a maneuver, and never wanting to talk about it again.  The most disturbing thing to the witness in the back seat was that even though he had been a big “UFO buff” from the time he was young, the word “UFO” or “alien” never entered his mind until after the triangle was completely out of view. He even had other UFO related experiences before this, but still cannot explain why he wasn’t “freaking out” at the time. The best explanation was that “he was denying it in his mind to keep his body from freaking out.”  The strangest element to the whole experience was the apparent personal awareness the object had to the witnesses. It got their attention by flashing, moved in and followed alongside the vehicle at a distance, changed forms, and seemed to wait for them and them only. ((NUFORC Note:  Date of sighting may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54674.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a65",
      "summary": "More intreging then the fireworks, the object hiding in the smoke.",
      "city": "milwaukee",
      "shape": "teardrop",
      "date": "2007-02-01T00:00:00",
      "story": "More intreging then the fireworks, the object hiding in the smoke. I was at the Harley-Davidson's 100th Anniversary final night bash, but I was in the Marina on a boat listening to the music, the party was coming to an end the fireworks started.  As I lay on the front of the boat looking at the fireworks I followed the smoke which was coming over the Marina.  I noticed a shiney object in the smoke almost directly above me it would appear then disappear in the thick blowing smoke, a couple of times I was able to see the entire bottom of the craft it was shaped like a teardrop all along the edge it looked like diamond cuts like you would see on jewelry.  At times I thought it had left but the smoke would clear alittle and there it would be again.  It stayed in the clouds of smoke as long as the fireworks continued.  Then it was gone, not a sound did it make at least nothing I could hear over the fireworks. I seen no lights. ((NUFORC Note:  Date of sighting may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54075.html",
      "state": "WI",
      "duration": "10 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d43",
      "summary": "Peculiar,steady, red and white blinking ,star like object that slowly descended behind the tree line.",
      "city": "milwaukee",
      "shape": "diamond",
      "date": "2007-10-08T00:00:00",
      "story": "Peculiar,steady, red and white blinking ,star like object that slowly descended behind the tree line. I went out to smoke a cigarette and looked up at the stars and there was one peculiar star in the northwest at about 60 degrees from the horizon. The object would pulse light between white and red. It looked like it was hovering or rotating. Then I called my friend to look. He said it's probably a satellite. But it slowly descended down below the tree level which took about 30 minutes to accomplish it. This would put this object at about 40 degrees to the horizon. I gave up watching but it never reappeared. I came out about an hour later and it still wasn't there. This object made no noise but it was quite distant. It also did not travel parallel across the sky at all. It just dropped straight down very very slowly.",
      "link": "http://www.nuforc.org/webreports/058/S58405.html",
      "state": "WI",
      "duration": "30 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6778",
      "summary": "At  11:00 PM lighting struck a silent, unlight craft and then started to glow a brilliant yellow illumination and flout across the sky",
      "city": "milwaukee",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "At  11:00 PM lighting struck a silent, unlight craft and then started to glow a brilliant yellow illumination and flout across the sky I was watching the sky to my south observing a lighting storm/thunderstorm.  I saw a bolt of lighting come across the sky from west to east.  In its path the lighting hit an unidentified object that had no lights or markers on it.  The lighting did not continue across the sky, it went straight down after hitting this object.  the object looked to be a circular long object.  The object was a mile or two away at the point of impact.  It moved across the sky faster than a plane and as light as a feather.  It looked as though this object was slowly declining out of the sky.  It was a neon yellow glowing haze/aura/light after the lighting hit it.  It was just at the lower level of the cloud line(Few thousand feet).  As it passed directly over my head it made no sound at all.  At this point there was no thunder or rain to dampen the sound of a plane.  Several minutes after the object had passed a plane had flown by at a similar level and not directly over my head, and it made normal airplane noise.  The plane had several lights on it(like the F.A.A. requires), as the U.F.O. only had one light that glowed on and almost off but still bright enough to see. ((NUFORC Note:  Possible overflight of the ISS.  I don't have time to check.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63538.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a7d",
      "summary": "while cooking steaks on 12/31/06 at 1730 hours i looked to the south west skys on a 45 degree angle and noticed tew egg or football sha",
      "city": "milwaukee",
      "shape": "egg",
      "date": "2007-02-01T00:00:00",
      "story": "while cooking steaks on 12/31/06 at 1730 hours i looked to the south west skys on a 45 degree angle and noticed tew egg or football shaped objects in the sky being a burnt orange coler .",
      "link": "http://www.nuforc.org/webreports/054/S54318.html",
      "state": "WI",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7820",
      "summary": "Reaccuring semi-stationary, color alternation spheres",
      "city": "milwaukee",
      "shape": "sphere",
      "date": "2006-10-30T00:00:00",
      "story": "Reaccuring semi-stationary, color alternation spheres This is the second time I've seen these craft. They seem to be stationed all around and so easily visible. They around. I would imagine a gunmetal color with lights of some kind all around their middles...like a belt. The lights alternate colors, not quite blinking but moving in a rythm the way the signs at movie theaters and similar places do. They alternate colors, similar to the way a projector does, like at the movie theater. They are somewhat stationary, moving usually only in one direction (up) and very slowly. They are visible on clear nights. I have watched many airplanes fly around in the sky and also have watched many many stars. They are not either and that is what I am positive about. The difference between these and a twinkling star is drastic. I have not seen any other accounts of these things, so I'm guessing they are fairly new. They're so obvious that there should be others. I know that I am not the only one that has seen them. My significant other has seen them before too. Both times i have seen them there's one that is low and then two more adjacent to it higher up. The last time I watched them I could see more than three. They are odd and intriguing. What purpose do they serve.. they're not there for nothing. : (",
      "link": "http://www.nuforc.org/webreports/052/S52756.html",
      "state": "WI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bc4",
      "summary": "Did any one report seeing a UFO around 6:30 this morning off of Hopkins and Capitol? Myself and a few people stopped this morning and s",
      "city": "milwaukee",
      "shape": "oval",
      "date": "2007-02-24T00:00:00",
      "story": "Did any one report seeing a UFO around 6:30 this morning off of Hopkins and Capitol? Myself and a few people stopped this morning and saw a round silver object with bright white lights under the round rim. It stayed floating in one area for about 5 minutes and just zoomed off at the speed of light to the east. There was a citing in Milwaukee, Wisconsin. I would like to remain anonymous.",
      "link": "http://www.nuforc.org/webreports/055/S55420.html",
      "state": "WI",
      "duration": "5 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f10",
      "summary": "Seen Three aliens three different times outside my window within 2 weeks",
      "city": "milwaukee",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "Seen Three aliens three different times outside my window within 2 weeks I saw three translucent inter-dimensional beings out my window three times in 2 weeks   I was sitting on my recliner in my living room.  I was watching my Television and I noticed something in the trees.  I looked through my big glass window that looks onto the back of the apartment building. I saw three aliens or some kind of beings in my trees.  At least I thought they were in the trees. The tree line is about 10 feet my window.  They were about 4  feet off the ground. I was scared to death, I could not move, I just froze with fear.  There were three of them. They were sitting side by side. At least I think they were sitting, hard to tell because they were translucent. I could see right through them, seeing the leaves move behind them.  Like in the movie “Predator” they were kind of see through but the outline of them was visible. They were on a platform.  They had very long arms and the width of their bodies were about 6.  Their height was maybe 1 foot, hard to tell since I was not sure if they were sitting or standing.  This was about 10.am around the first week of July, of 2009 in Milwaukee Wisconsin.  I am in an apartment complex that is two stories’ high and 10 apartments wide.  Mostly very nice Mexican people live here.  I am from Georgia.  I mention that in case this becomes significant since there are so many sightings of  UFO’s in Mexico. In no way were these Grays aliens that people talk about.  The face was cone shaped. I could not really make out eyes or any features.  Obviously they were cloaked or thought they were invisible, I do not know.  They stared at me the whole time, never looking around, just right at me for about 4 minutes.   Finally I got the nerve to stand up slowly and make my way to the front door. I knew the window was open; I wanted to close it because I was afraid they would come in and abduct me. Or do experiments as we hear about what happens to people.  As I had my back to them for only a second, I turned to look back but they had gone. I then went too quickly to my neighbor’s apartment. She asked me if I had seen a ghost. I said just something very weird. I would not tell her for being afraid of her thinking I was crazy. I was so afraid I told no body. Not even my boyfriend who was out of town for the next two weeks. I was there alone. I want to let you know. I am a 48 year old woman from Georgia. I do not do drugs, I do drink a beer here and there but I had not had any beer for about a week. I have never hallucinated or imagined anything in my whole life. I am not on any prescription drugs and have never been on them. I was really seeing this and wish I had never had. So when Mark came home from working in Canada I did not tell him even though I was still scared. A couple mornings after he was home he woke me to ask if I have ever seen anything weird out the back window.  I said yes, why are you asking me? He was scared, I could tell as he started to tell me that he saw three beings out the back window in the trees that he could see through. It was about 5:30 as we slept in the living room all night since it is cooler then than our bedroom. We have had placed our mattress on the floor near the front door. He said there were three of them side by side with cone faces, long arms and almost he could make out! eyes or holes where there would be eyes. He described them exactly as I had seen them and also they were on a platform. He said the platform was a milky color but still translucent. He could see the outline and see the leaves right through them. He said their heads were moving up and down, to the right to the left looking at the back of out apartment building. He was sure they did not see him since he was so far from the window near the front door on the mattress which is on the floor. When I am in my recliner I am only about 4 feet from the window. He said they were there for about 4 minutes also then they disappeared. When I asked him to point right where he saw them, it was interesting because they were on the right side of our window but when I saw them they were on the left side. Remember now both times were in the morning and same description. He said they were doing something with their hands, maybe working controls? I don’t know, I am just scared out of my mind the! y will come back again. I was happy I could share this bizarre! happeni ng in out lives. So about two days after Mark had seen them I was in my recliner watching Television. It was around 9 a.m in the morning. I saw movement in the trees again and this time there was only one of the beings. I saw him for about only about 1 minute or minute and a half or so. This time he was in the middle of the window about the same height in the trees. His cone shaped face and long hanging arms, looking right at me. I was very scared and had a look of fear on my face. Mark was in the room and when he saw my face he saw I was scared but when he turned his head to look it disappeared. Now I have been analyzing this highly unusual event. I am scared all time. I am in fear they will take mark or myself to where to do what? Why appear behind an old run down apartment building in virtually the same place area in the trees? This has reoccurred three times in the morning hours. From about a minute and a half to about 4 minutes they stay to study mark or I? To take readings of the Earth, say maybe they are measuring the Earths magnetic field, gasses in atmosphere? Are they planning an attack on mankind? Do they want to become our friends? Learn our language? Are they just as curious about us as we are of them? Do they want to reproduce with our species? Do they want to use us as food? So many things run through our heads, WHY WHY HERE? Why not appear at the White House, a museum, a school, a park or in a science laboratory? Why behind an old apartment building at OUR WINDOW? Are the other people in the apartments seeing them also? I am not ready to ask around. I want to move out of here as quickly as I can but for financial reasons I don’t see that happening anytime soon. Maybe they will never appear again and my nerves can calm down. \tMy girlfriend Mary is vey excited about this. She wants to see them very badly so she can take photos or video tape them to show the world. She says this is very important for the world to see that beings are showing up here repeatedly. She says they probably are not from another world but from another dimension. That maybe their laboratory in their dimension is situated right there at all times but the veil from our dimensions are opening up. They are not really in the trees at all but in their time and a different dimension. They could be opening and closing them. They are showing up as almost invisible, is that because they are scared that we will shoot them? They know enough that this is a common reaction among humans, Shoot first ask questions later. Do they even know we see them at all? Mary says we can roll up a ball of yarn with a long string on the end. When they appear throw it at them, it might go into their place and we might see just a string hanging in mid air! when they closed the veil. The yarn will not show harmful intent because we could put a note on it saying :Become our friends, Talk to us, we know your there. We could put a little present inside the ball of yarn. She wants to bring in a high tech video camera, digital camera, regular camera, infrared camera, aura camera and a meter she has that can pick up very low frequencies that turns it into voice. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72662.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8262",
      "summary": "line of 4 balls of light three white and one red seen for 10 seconds moving straight across sky",
      "city": "milwaukee",
      "shape": "formation",
      "date": "2009-03-19T00:00:00",
      "story": "line of 4 balls of light three white and one red seen for 10 seconds moving straight across sky I was standing in my driveway a few years ago (hence the guessed date) when I looked up and saw the UFO. It was a line of four balls of light.  The first three were white and the last one was red. They were moving across the sky in a southeast direction as I faced to the southwest. They were almost directly overhead at about a 75 degree angle.  They moved together as if connected as one craft and the balls of light were touching like this OOOO.  They didn't blink or anything, just moved in a straight line. I was about 10 at the time and was with my parents and their friends. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68673.html",
      "state": "WI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8324",
      "summary": "Four spheres witnessed by two people......5-10K feet in the air.",
      "city": "milwaukee",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "Four spheres witnessed by two people......5-10K feet in the air. This event occurred during \"Bastille Days\" in Milwaukee, Wi., July 2006.  We went to the festivle on Sat.. The Blue Angles were there on both Sat and Sun.  The next day, Sunday, My girlfriend I were at her Mothers house with the dogs in the front yard. Side note, I was a stinger missile gunner in the Army and ever since then, I have a habit of looking in the sky/air.  I was trained to look and observe and identify aircraft.  Since then, I tend to look upward often and try to challenge myself to identify aircraft whenever possible. This day however had a very high overcast.  I would guess 5-10 thousand feet.  We were  in her Mothers front yard playing with the dogs.  I happened to look up and noticed  a single sphere silhouetted against the backdrop of the overcast skyline.  I quickly called for my girlfriend to come over and see it as well.  As we stood there watching the ONE sphere/round object silhouette against the background of the overcast sky, suddenly a second sphere/round object appeared, then an other sphere/round object, then finally a fourth.   All were perfectly aligned and all where exact same size/symmetric.  Within less than one minute they suddenly simply streaked off or more accurately, just disappeared. This is what the looked like once all four came together: (although they almost perfectly blended in with the skyline/clouds).  I’m simply trying to point out the symmetry and alignment of the way they appeared. Thank you,  US Citizen",
      "link": "http://www.nuforc.org/webreports/067/S67586.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c84",
      "summary": "yellow circle that materialized with a small circular craft and then vanished afterwards",
      "city": "milwaukee",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "yellow circle that materialized with a small circular craft and then vanished afterwards I was staying up late playing games. At 4 in the morning my mom wakes up to go to school. Because Milwaukee has laws about parking on certain sides of the street my mom asked me to go check on my brother's car. It was parked on the correct side of the street so I start walking back to the house. As I'm walking back I take a glance at the night sky, always a beautiful sight with the clouds illuminated by the stars and moon in my opinion. I saw something completely different though. About 200 feet up (from what I can estimate) a yellow circle appeared. It was somewhat fuzzy and opaque. When I say appear I mean it slowly materialized, at first, transparent, then getting more solid-like. It also seemed to be flat, so it wasn't a sphere, I don't think. From the middle of this yellow circle a small craft appeared. One moment there was just a yellow circle. The next, the craft was there. It was circle shaped since it was against the yellow circle I couldn't make out many details other than that it was dark in color. The yellow circle then began to fade again just as it had appeared. Growing more transparent aside from more solid. As the yellow circle was fading the small craft began lighting up. I didn't have my glasses so I can only surmise at a few lights that lit up along it. The craft then accelerated suddenly and flew south. It made no noise to accelerate and no noise while in flight. Also, no visible means of flying (no engine exhaust, etc). ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72932.html",
      "state": "WI",
      "duration": "~30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b93eb",
      "summary": "it was glowing and it looked like glowsticks but parted, it left some whiteish smoke in the sky.",
      "city": "milwaukee",
      "shape": "disk",
      "date": "2009-08-27T00:00:00",
      "story": "it was glowing and it looked like glowsticks but parted, it left some whiteish smoke in the sky. it lookes circleish and parted and it looked like orange glowsticks, and it was like around 2:23 AM and i was looking by my house and the thing was like above my neighbors house and no was up except us cuz all lights wre off WHOOAAA i didnt tell any one though",
      "link": "http://www.nuforc.org/webreports/071/S71866.html",
      "state": "WI",
      "duration": "by my house"
    },
    {
      "_id": "64d005f478aba2ec5a3b9df4",
      "summary": "Ball of light floating in sky near main freeway in Milwaukee.",
      "city": "milwaukee",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "Ball of light floating in sky near main freeway in Milwaukee. At approx. 6:50am on April 3rd, I was on my way to work, driving on the freeway 794W to ward Madison.  I was driving past the Marquette University campus, when I noticed a very bright light shining in the still dark sky at about 30 degrees to my left and up slightly. I immediately thought it was an airplane approaching.  I continued to watch it, thinking, “Wow, what a bright light.”  I really was brighter than any plane light I have ever seen.  It was only one color (a yellowish white, not a bluish white).  It was then I thought why is there no flashing?   The light stayed solid the whole time. Then as I kept watching, I waited to see if it would change or get closer or keep going to the side so I could see what sort of plane it was.  But, I was amazed to notice that it never moved. That really startled me, so I really now strained to keep an eye on it for about 30 more seconds…no movement.  As I was driving on the freeway, I had to occasionally divert my eyes back to the road, and at that point I did once again, but when I looked back, the light was gone.  I slowed the car down and scanned the whole sky out my left window.  No lights.  There was nothing at all in the sky. Also, the weather was completely clear.",
      "link": "http://www.nuforc.org/webreports/074/S74892.html",
      "state": "WI",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e46",
      "summary": "light moved faster than any jet i've seen and turned 90 degrees in a millisecond toward chicago",
      "city": "milwaukee",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "light moved faster than any jet i've seen and turned 90 degrees in a millisecond toward chicago object flew from west to east at a very high rate of speed over milwaukee toward lake michigan and turned sharply towrds chicago.object was approx. 1,000-1,500 ft. above ground and moving at hundreds of miles an hour,very,very fast.was a round light.",
      "link": "http://www.nuforc.org/webreports/066/S66167.html",
      "state": "WI",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f34",
      "summary": "Very large, bright moving searchlight, but no plane or helicopter in sight to be making it.",
      "city": "milwaukee",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "Very large, bright moving searchlight, but no plane or helicopter in sight to be making it. My grandfather and I were flying on a plane from Milwaukee and stopping in Atlanta, GA, from there to go to Cancun and on to Cozumel.  It was about 6:30 in the morning, and we had just taken off.  The sky was dark and clear with very few clouds, and it was my second time on an airliner so I was looking out through the window.  As we were passing over a town outside of milwaukee, I noticed a large spotlight passing over a few neighborhoods.  The yards and streets that it passed over were brightly illuminated.  You could see the grass in the fields and chimneys on the rooftops and such as they were being lit up as the light was passing, and you could see the outline of the light.  I looked to see a helicopter or even a plane generating the light but I could not find one.  I told my grandpa to look over and check it out and he said he didn't know what it was either.  I was tempted to ask a flight attendant but noticed they were pretty busy, so I just let it go.  The moon was out and full, but i've never heard of the moon creating such a focused, concentrated light of which I saw. I followed the light up and you could see the light was in a conic, searchlight projection, but nowhere was there anything to be making it.  No tower, plane, or helicopter.  The light seemed to be shining down from about 1-2 hundred feet up.   I followed the light for a good 2-3 minutes and then it dissapeared.  It was sort of making the same path as the plane, except that it had more of a wavy pattern slowly angling away from the plane and it moved very quickly. It came back into sight again shortly after and then it just vanished, like if someone just flipped off the switch.   I don't know if anybody else had seen it, but it was clearly something strange.  If it were being emitted from some sort of aircraft, the plane had amazing stealth technology because the only thing seen was its searchlight. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74354.html",
      "state": "WI",
      "duration": "4-6 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba92b",
      "summary": "Large top shaped UFO over Lake Michigan leaves 3 witnesses with  possible coverup or were cops really aliens ?",
      "city": "milwaukee",
      "shape": "teardrop",
      "date": "2010-11-21T00:00:00",
      "story": "Large top shaped UFO over Lake Michigan leaves 3 witnesses with  possible coverup or were cops really aliens ? I submit to you , whoever you guys really are this report of what I have witnessed. This event was real and I was with my girlfriend at the time and another friend . So the 3 of us were there and we all saw the same thing .. and honestly it was very disturbing. This event was on the banks of lake Michigan right there a few feet down the trail that leads off to the south of the lake front park in Millwaukee Wi. . It has been quite a while since and Im not really sure of the exact date but i think maybe Aug. or Sept 1999 I could ask the other friends of mine and maybe get a more exact date . Anyway I thought I should tell about this because I think we need to know more and maybe this account along with others that come forward will hopefully someday help to prove that these things are real. Well here ya go , I just thought one nite it might be fun to go down to the park. I liked to go down by he lake . It was a place I could kinda go and think and anyway we went down there . It was getting dark and I started walking down a trail .. that was really private property and we shouldnt have been down there after dark anyway .. but we were just talking and throwing rocks. thats when I noticed what I thought was a falling star streak across the sky in the east way off far away in the sky . as I saw that I said to the others , \" hey check this out look in the sky \" and thats when things became very strange.The light Id seen streak across the sky actually stopped and went back in the opposite direction. It was fast like a streak and stopped on a dot then after stopping a second. jolted again back across what Id say whatever 8 inches in the sky from that distance .. and it looked just as bright and as far off as a star..  The original distance that it was is hard for me to try and explain but I say , it was way the hell out there in space. So at that point we were all focused on this little light that seemed to zip and stop and zip and stop and as we were watching it , it became obvious that it was coming straight in a line for us .. I mean it was only like a minute from when we first noticed it to where this thing was right up in our faces ... It was there hovering like maybe 20 feet above the lake and like as close as if it was the house across the street .. This thing was huge it was like rounded and TOP shaped not a sharp edged upside down triangle but more smooth like an old style Top.. like the spin toy for kids .. but this thing was as big as like a couple of houses .. and there wasnt really a sound ,more like a hum a vibration that you could feel . And all along the top edge were like 5 or so rows of lights and these lights were very bright .Red,blue,yellow, and an eerie white like similar to those high pressure sodium lights, in that they seemed to pulse and surge and there were also lights all over the thing from the top to the bottom that pulsed and so forth .AS I looked at my friends on either side of me and said are you guys seeing this .. we were all just frozen our jaws fucking dropped to the ground .. I couldnt believe it . So we stood in awe there for about 2 or 3 minutes and watched this thing and then a very intense sharp light started moving and as it did it was like a beam and the thing shined right into my eyes. and immediatly I cover my face with my hands and thats when I got really scarred . I thought at that point this had begun to get a little bit to close and it sunk in that this might not be all fun and games .. honest I said ok guys fuck this shit I've seen enough Im getting the fuck out of here everybody for themselves ..I felt panic for real .. when that light shined on me I felt it was reading my mind and I didnt like it .. so I was looking around for an escape route should I go this way or that way .. we saw a light comming up the trail we came in on .. thats when I said ohh shit they are comming for us .. so as that light comming up the trail got our attention just as we were gonna take off up the side of the banks .Guess what it was ? a police officer .. he's like \"hey you guys \" what are doing ... and with his flashlight in our faces we say just out here looking at this UFO .. and he takes the flashlight and shines it out over the lake where all the sudden its pitch black and the thing is gone .. just \"poof \"gone and says, \"what ufo\". Man I dont know what the hell was going on but it seemed ass if he was in on it or something was deffinatly weird about not only the UFO but the cop as well .. anyway after running all our Ids and trying to mess with us about being where we shouldnt be and private property and so forth .. he let us go and we got the hell out of there .. So, thats the story .. this was the real deal and you guys want to know more I would love to tell ya .. I wish I knew what they wanted but I have a strange feeling that they were going to do something bad to me .. I have nightmares about it still .. who knows, It was just a total trip.. well also the 3 of us we just would look at each other and just shake our heads ,, Ive told friends of mine about this and I think they probably say Im crazy .. or just telling a story .. but this was no ((deleted--B.S..)). ((NUFORC Note:  Source of report indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78743.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4c2",
      "summary": "((HOAX??))  a very erie in Wisconsin & above in the sky in Milwaukee.  I am one of the few who stays up looking out my window",
      "city": "milwaukee",
      "shape": "triangle",
      "date": "2011-02-23T00:00:00",
      "story": "a very erie in Wisconsin & above in the sky in Milwaukee.  I am one of the few who stays up looking out my window   orange - white object came from east to west. triangular in density .. small ... 50 meters diameter.400-500 meters off the ground. ((NUFORC Note:  Possible hoax, we believe.  Witness indicates that Milwaukee is in Germany; does not respond to e-mail.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80130.html",
      "state": "WI",
      "duration": "10-20-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb851",
      "summary": "multicolored lights, random fast movement, hovering, blinking",
      "city": "milwaukee",
      "shape": "unknown",
      "date": "2010-08-30T00:00:00",
      "story": "multicolored lights, random fast movement, hovering, blinking search you tube for milwaukee ufo for proof.  several people video recorded the event.  multicolored lights, red, orange, blue, green, purple.. darted about above the milwaukee skyline late 8/28/10 - 8/29/10.  at aproximately midnight the object darted about hovered and blinked off and on and also displayed some dazzling lights. it eventually moved out of sight behind buildings.",
      "link": "http://www.nuforc.org/webreports/077/S77505.html",
      "state": "WI",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbd3",
      "summary": "3 disk shaped lights swerving among each other across sky, got to North, shot straight into the stars",
      "city": "milwaukee",
      "shape": "disk",
      "date": "",
      "story": "3 disk shaped lights swerving among each other across sky, got to North, shot straight into the stars Myself, my brother, and a neighborhood friend of ours were in our backyard looking at the stars with one of those old Gilbert cardboard tube reflector telescopes.  I actually did an ink drawing of the event and submitted it to Coast to Coast’s website, which they posted.  My brother is three years younger than I.  When we saw this I must have been around ten.  I don’t know if he would fill out a form like this.  I’d really like to know his blow by blow recollection.  What’s funny is that when I got onto Facebook, before that we hadn't talked to each other in almost twenty years (for whatever reason).  We got all caught up in two days (score one for Facebook).  One of the first things I asked him was if he remembered the night in the backyard when we saw the three UFOs?  I may have been living with an hallucination my whole life.  He told me – Yeah, he remembered it and he thinks about it all the time.  That night has convinced me there is something going on.! I’ve been pro-space and a Trekkie (to a point) my entire life.  I’m now 62 and actually I have been diagnosed with MDS which has really taken me out of the game, it’s a pre-leukemia, may need a bone marrow transplant.  I have a younger brother that already said he would do it if it came to it. Being that my mortality is staring me in the face, I feel like I have to get all this stuff in me – out of me, before I won’t be able to any longer.  I just heard the program on Coast to Coast tonight where you asked to send all this stuff in.  Here’s my two-cents. My Uncle gave me the telescope for my birthday.  It was in November and a cold clear night, but ya gotta try it out.  We took turns looking through it, and I’m sure we saw nothing we could comprehend.  What happened: is that we heard a noise like the sound of a jet aircraft, but we couldn’t see it yet.  We knew it was coming from the East which were houses and trees.  I had an idea to maybe see if I can see the jet in the telescope, close up. What came over the tops of the trees however, where these three classic disks.  They glowed enough that they were obvious.  At arm’s length, maybe the size of a silver dollar between finger and thumb.  What I’ll never forget (if that wasn’t enough), was that they were swerving in and out of each other; like playing, easy as you please, absolutely in control, dancing around each other.  They came over the trees,  came across the sky (clear-starry), maybe 45-50 degrees above the horizon line, which we could not see for the neighborhood houses and trees.  They went across the sky, swerving in and out of each other, go to about where North is and shot straight up into the sky and disappeared.  We forgot about the damn telescope, we were too dumfounded.  I remember running into the house to tell my mother (who was watching television) that we just saw flying saucers in the backyard.  She straight out didn’t believe us.  Why should she?  Not the same night, and I know I was still a kid.  My mother sat under the street light on our front porch, waiting for my father to come home (he worked late as a chef in a restaurant).  This could have been 1 am.  She was alone (yes under a street light at night, dark streets, in inner town Milwaukee – those days are long gone).  Anyway, she swears she heard the sound of a freight train, come from the East going to the West and it was in the sky over the top of houses in the neighborhood.  She curled up to protect herself – I cannot recollect if the same instance is when she said she saw something that was \"cigar\"-shaped.  After it was gone (the noise) she said she saw a smoke trail, extend from the East to the West, being blown South from a wind from the North.  It was low enough for the street lights to reflect off it.  I can’t recall where I heard about-shaped UFOs that sounded like a locomotive?   You’re preaching to the choir.",
      "link": "http://www.nuforc.org/webreports/084/S84835.html",
      "state": "WI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfdd",
      "summary": "My son and his friend was sitting out side and they both seen flashing lights passing rapidly through the sky. He was very scared by wh",
      "city": "milwaukee",
      "shape": "unknown",
      "date": "2011-10-10T00:00:00",
      "story": "My son and his friend was sitting out side and they both seen flashing lights passing rapidly through the sky.  He was very scared by what he saw.  The children were so startled by what they had seen, they could only give cohernant discription. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83794.html",
      "state": "WI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc94f",
      "summary": "Large bright orange/red ball over Milwaukee that slowly disappeard",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2011-07-17T00:00:00",
      "story": "Large bright orange/red ball over Milwaukee that slowly disappeard Over the greater Milwaukee area (center of Milwaukee).   A large, slow moving \"fiery ball\" it was very large and bright as it approached then it sloped to the left and became smaller and the \"fire ball\" started to slowly become smaller and dimmer until it disappeared. ((NUFORC Note:  The date may be flawed.  We wonder whether the date indicated by the witness might be flawed.  We have sent him a note, inquiring whether the sighting was on July 8th, or whether it might have been in the year 2011.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82342.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bcae7",
      "summary": "Location: USA Milwaukee WI Lakeshore Park Event: Milwaukee World Music Festival Also Known As Summer fest.",
      "city": "milwaukee",
      "shape": "formation",
      "date": "2011-07-17T00:00:00",
      "story": "Location: USA Milwaukee WI Lakeshore Park Event: Milwaukee World Music Festival Also Known As Summer fest. Time: July 9 between 2200-2300  While observing night sky for a brief moment, I noticed 3 amber light orbs moving north east over Lake Michigan in a straight line.  The orbs were quiet.  I pointed to two other individuals to look at the orbs.  As soon as I pointed at them the middle orb faded away very slow but still moving at continuous rate of speed toward north east.  We dismissed the orbs as military aircraft however after further discussion it was determined that if they were military aircraft they are part of the next-gen models.  The 3 Amber orbs resembled the 3 orbs observed on March 13 1997 in Phoenix Arizona.   After watching footage developed in 2005 about the Phoenix Lights I was convinced that the Amber orbs of 1997 and the orbs over Lakeshore Park were definitely the same.   Watching the show also convinced me to report.  I almost did not.",
      "link": "http://www.nuforc.org/webreports/082/S82422.html",
      "state": "WI",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bcba8",
      "summary": "2 light colored objects turning color and traveling at rapid rates and turning red and dissapearing.",
      "city": "milwaukee",
      "shape": "light",
      "date": "2011-07-04T00:00:00",
      "story": "2 light colored objects turning color and traveling at rapid rates and turning red and disappearing. I live by the airport and I’m sitting in my living room staring outside at the clouds seeing if it was going to rain.  Well, there are a few patches of clouds, but I see two lighted circular almost like a ball.   I grab my wife so she sees what I’m seeing. The one on the right is moving around at a rapid pace flickering then turns reddish pink and disappears.   Then the second object does a j-hook formation and turns pinking red and disappears.   I am not saying it was aliens or anything like that I am saying these balls were too close together in the sky to be airplanes.  They also were too far apart to be an airplane.  And one was stationary and the other was traveling at an absurd rate.   Still have goose bumps from it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81961.html",
      "state": "WI",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0ea",
      "summary": "Silent group of 12-15 glowing orange orbs of light appear one at a time over horizon and flying in a spread out cluster NW to SWW",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Silent group of 12-15 glowing orange orbs of light appear one at a time over horizon and flying in a spread out cluster NW to SWW I was sitting at a bus stop across from a Domino's waiting 15 minutes for my Pizza playing Angry Birds on my cell phone. I put the cell away and was just about to cross back over the street to pick up my Pizza when out from behind a cloud to my right I suddenly saw a bright orange burst of light that was so bright it could not be ignored. One orange burning/glowing ball light in the night sky is one thing, but suddenly I saw another, and yet another trailing behind it. I could not believe what I was seeing and before I knew it on the horizon I was seeing them pop up to the North & just West and follow a similar path NW to SW almost as if in a non-linear string formation.  During this time I called my girlfriend who was at our house 6 blocks away and yelled at her to go outside and look up while I frantically tried to snap photographs on my cellphone to no avail due to the overbearing light from street lamps. When I first saw them I thought it could be a meteor, but after the first two and then seeing how fluidly they were moving, with small adjustments in elevation I knew they couldn't be as it wasn't burning up or crashing or dissapating.   Then I thought could be a helicopter, but they were SO bright and 100% SILENT & did not move like helicopters. There were planes in the sky as well during and after the sighting (Milwaukee County Airport traffic) but these lights neither came from the Airport nor headed toward the airport and were way too bright and obvious to be planes or anything else that uses the Airport Terminals. I stayed on the phone with my girlfriend until I had walked the 6 blocks home and by the time I had gotten there all the remaining UFOs were gone, however she had seen them as well, albeit not as many - she ended up seeing 5-7 & even noted that one seemed to turn it's light off and she got sight of the actual shape of the object as seen on the face of a cloud, which was round / spherical - as she put it &quot;a! lmost 2 spheres in one&quot;. I only lost sight of the remaini! ng 3 &qu ot;fireball&quot; orbs that I could still see from my perspective once I got about 2 blocks from home and they seemed to have changed direction and were all now traveling more decidedly west than Southwest, however still had a slightly southern trajectory as well. When the sighting was said and done I had seen a &quot;fleet&quot; of these lights - about 12-15 very strong & bright glowing orange orbs moving across the Milwaukee night sky over Milwaukee's East Side near the University of Milwaukee Wisconsin. I lost sight of the remaining objects the same way I lost sight of the first 8 or 9... as they flew south past my point of view, they headed hard west & disappeared into cloud cover at this point. You could see them climbing up into the clouds quickly once they reached them and fading out of view in less than a minute. These objects were completely silent, very bright, seemingly moving as a large group / unit but with their own variances & at least 5-10 orb lengths between! each object. I felt calm, dumbfounded and not really frantic quite frankly but rather at ease. I remember that my only concern was that my girlfriend who was only a few blocks away get outside and confirm what I was seeing from that perspective as well (looking south as I was seeing them come from the north), so I was ecstatic when she answered and when I heard her reaction over the phone when she looked up. I had a feeling in my chest, slightly emotional and my eyes were wired open as well as a feeling of calm. UFO Sighting looked very similar to some of the photos taken in this article http://www.dailymail.co.uk/news/article-1190481/Mysterious-orange-UFOs-swoop-Britains-skies.html",
      "link": "http://www.nuforc.org/webreports/091/S91991.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd276",
      "summary": "There were like 6-8 orange fireball looking objects forming circles, wavy lines and triangles.",
      "city": "milwaukee",
      "shape": "formation",
      "date": "2012-09-24T00:00:00",
      "story": "There were like 6-8 orange fireball looking objects forming circles, wavy lines and triangles. while me and my guy were walking back from the gas station I noticed somethings bright in the sky. It was sort of dark outside and there were a few clouds out this night. So while walking past the library they just closed I told my guy lets go back real fast. We went back towards the library parking lot looking northbound and up in the sky was about 6-8 bright orange fireball looking objects forming into a cicle. So we were under a tree and decided to go into the parking lot to get a better view.  What we seen next left us speechless. A few of the objects started to disappear while they were forming into a line that was like waving like a snake. At this moment I counted 4 objects just sitting there waving in the air. Then suddenly one more disappears and theres 3 left. These 3, still in a line formation, started to form a triangle that was rotating counterclockwise. The entire time we were watching these lights they were blinking from dull to bright.  We decided to try and go north to see if it was just someone floating somethng in the air. We cut through the parking lot and next to it was an alley but at the beginning of the alley theres a huge house with big trees there. While were walking the object starts to proceed northbound but at a slow rate of speed and then we lose sight behind the tree. I continue down the alley a couple steps as my guy stops and I see the bright light but this time theres only 1 and its starting to gain a little speed as I was following it. Then i just decided to stop and go back home. I had my phone with me but couldn't take a video because I was to shocked at what was happening in the sky for those 10 or 15 minutes.",
      "link": "http://www.nuforc.org/webreports/092/S92173.html",
      "state": "WI",
      "duration": "10-15 minutess"
    },
    {
      "_id": "64d005f478aba2ec5a3bda8e",
      "summary": "2 Orange/Amber Fireballs fly by Milwaukee, above Lake Michigan.",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2012-07-04T00:00:00",
      "story": "2 Orange/Amber Fireballs fly by Milwaukee, above Lake Michigan. Parked on E. Kenilworth Place in Milwaukee, WI, facing SouthEast. Noticed two orange/amber fireballs traveling over Lake Michigan in a Northern Direction. Wind Direction unknown.  Two Fireballs flew across my field of vision until line of sight was blocked by buildings on opposite side of the road.  Distance from objects was unknown, so rate of travel was hard to judge, but was moving faster than a plane, but slower than debris entering atmosphere.  Have 1 photo and 1 (10 second) video taken from a cellphone that shows only one of the two mysterious lights (the other left line of sight before camera was ready).",
      "link": "http://www.nuforc.org/webreports/090/S90121.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bde95",
      "summary": "5 glowing objects",
      "city": "milwaukee",
      "shape": "rectangle",
      "date": "2012-07-04T00:00:00",
      "story": "5 glowing objects At approx 0024am Sunday morning 5 square to rectangular objects were seen traveling north over downtown Milwaukee area emitting an orange glow.  After about 3 minutes the orange glow stopped and all 5 objects proceeded on the exact same course about 50-300 feet apart trailing each other.  Lost sight of the objects as they passed behind buildings. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90019.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be656",
      "summary": "Orange/Red burning ball sailing in midnight sky",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2012-05-29T00:00:00",
      "story": "Orange/Red burning ball sailing in midnight sky 5/19/12 going into 5/20/12 at about midnight-Bright orange/red circle, sailing in the dark sky, it sailed in a upside &quot;u&quot; shape slowly enough for picture taking as if it wanted a picture taken and then it disappered into the blackness of the sky.",
      "link": "http://www.nuforc.org/webreports/089/S89078.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be821",
      "summary": "Strange bright light which suddenly appeared in the south western sky over lake michigan..near milwaukee. Semblance of lights of a plan",
      "city": "milwaukee",
      "shape": "diamond",
      "date": "2012-05-13T00:00:00",
      "story": "Strange bright light which suddenly appeared in the south western sky over lake michigan..near milwaukee.  Semblance of lights of a plane but stayed in one location for 5 minutes.  Object appear to have 2 sets of orange/yellow lights almost like flame which grew bright, with circular lights (like a lighthouse) which occurred in the middle of the craft.  Lights seemed point at us.  The object then descended very slowly out of sight.",
      "link": "http://www.nuforc.org/webreports/088/S88846.html",
      "state": "WI",
      "duration": "approx 5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2ae",
      "summary": "I happened to look up in the sky' It was dark and the street lights were out. The objects appeared to be far away but our eyes can not",
      "city": "milwaukee",
      "shape": "other",
      "date": "2013-02-04T00:00:00",
      "story": "I happened to look up in the sky'  It was dark and the street lights were out.  The objects appeared to be far away but our eyes can not judge distances and size without references.  The size appeared to be about that of a jet after takeoff from about two to three miles away.  All of the objects had the same shape, close to upside down u's.  Each had five lights of a bright red color.  They came from the norteast and rose from the horizon at an aproximately 45 degree angle untill they came to about the height of the tree lines.  We have 80 year old elm trees in milwaukee about 100 feet tall. They tenn proceeded to level off and move to the east.  They then leveled off. One followed another at a space of about one tenth of the northern horizon.  They were silent. Their angle of diaganol assent was constent and in a straight line and was slow, slower than a helicopter.  They were silent.  I flagged down several cars and four witnesses saw this.  They were scared and would not give me their names ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95419.html",
      "state": "WI",
      "duration": "5:00"
    },
    {
      "_id": "64d005f478aba2ec5a3bf442",
      "summary": "Unextraorindinay discovery.  ((NUFORC Note:  Possible sighting of a celestial body?  PD))",
      "city": "milwaukee",
      "shape": "unknown",
      "date": "2013-09-30T00:00:00",
      "story": "unextraorindinay discovery At 3:30am, looked out in the sky seen an air plane passing by.. unknown object floating along my right side view gradually shining brighter than the north star.  I called the non-emergency #, reported an interesing strobe of flashing lights in the sky.  Located northeastern of my location.  I couldn't tell you what kind of shape it is..its very distant.   itS about 4:30am, it seems to move each hour. ((NUFORC Note:  Possible sighting of a celestial body?  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102452.html",
      "state": "WI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf663",
      "summary": "Strange lights, stranger shapes, and a strange ending.",
      "city": "milwaukee",
      "shape": "other",
      "date": "2013-06-02T00:00:00",
      "story": "Strange lights, stranger shapes, and a strange ending. It was a cold late fall day.  Myself and 3 friends were along with me when we decided to go to the lake front (Lake Michigan). The 4 of us were strolling casually along the coast that evening.  As we progressed further down a lake front pier we collectively noticed an unusually bright.  Since the lake front is closed after 10pm and it was now around 1am our first thought is it being some form of authority,  police, coast gaurd etc. We soon realized that was not the case.  All of us agreed that this exceptional light was moving our direction(west) from the east.  East of us was Lake Michigan.  So our thought is still optimistic, that being, as if it were a boat or some other everyday regularity.  We all can not let this light go, we continue to stare in its direction. Within about a minute, the light gained significant ground growing closer in distance to us.  At this time we were able to tell that this light was not on the water but, in the air.  It took a moment to take its airborne presence in. 1. because from this location on the lake we frequently seen air craft heading south toward Mitchell International airport and 2. because of the low level and quietness. Another sign that allowed us to realize that this was airborne was in its approach toward us it passed over the rock walls which I believe is for a wave/wake break for sailors and ships. At my estimate the rock walls are about 300 yards from shore and about 150 yards from our position on the pier. So, this quite airborne light is about 100 yards out from us and its light becomes much more intense.   With it becoming more clear that the light is attached to something greater behind it 2 of my friends become hysterical and begin to cry and emotions become rather powerful and overwhelming. I have stood my ground thus far when the light begings to angle itself toward the ground/water.  It is at about a 45° angle(the light) and close enough for me to be able to reach it with a stone or tennis ball toss.  The brilliant light is seemingly piercing the filthy water in this area to a depth of about 6ft. and approaching the tips of my toes. The light comes to about an inch before my toes and turns its &quot;high beem&quot; off.  Within a matter of 10 seconds the ship accelerated and was out of view. While taking in all of what had just happened and calming down we begin to notice a set of lights following the same path coming towards us again. This time,  I reach for my phone and begin to use my camara.  That craft is still well out above the water but I start to take pictures anyway to try to gather as much as I can. The flash may have caught the attention of the craft because as I clicked more pictures and more flashes it seemed to quicken its pace in our direction. As this craft got closer it became clear it was not the same one in which we had just seen because this one was easily 10x as large with a set of lights across the bottom(yellow/whiteish)  and 3 larger lights on top(red/green/red) that appeared to be incased in glass or another see-through material. I would guess its length to be around 200ft. This craft slowly pan across our view at about 60ft out and 60ft up.  It was the most strange structure.  It looked as if it were made of old oil barrels and not in a slick uniform shape,  more jagged and off balance.  It had unique looking hieroglyphs written on the barrells. The hieroglyphic text did not show up in any of the photos.  All together I took around 110 photos which i shared with people.  I e-mailed a few photos to one of my co witnesses which I believe she still possess today.  Within 24 hours all 110 photos were erased/disappeard from my phone....not one of my other personal photos of friends and the such were missing from my phones photo gallery.  Olny the ones I took that night. We were just 4 friends in our early 20s....no professional background. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98270.html",
      "state": "WI",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf79a",
      "summary": "Object was hovering over 500 feet off ground, had no wings, no tail, fire coming from bottom, and certainly intelligently controlled.",
      "city": "milwaukee",
      "shape": "diamond",
      "date": "2013-07-03T00:00:00",
      "story": "Object was hovering over 500 feet off ground, had no wings, no tail, fire coming from bottom, and certainly intelligently controlled. I was watching the basketball game in the kitchen when I got a call that I wanted to take privately, so I stepped out of the side door of the house.  As I was in a heated debate on the phone, I looked up and noticed something in the distance above the treeline. I stared at it, and as I did so, short bursts of flame began to come from the bottom of the object.  The flame would switch from left to right as the object wobbled a bit; as if it was trying to maintain balance.  That's when I yelled to my girlfriend to &quot;go get my camera&quot;. She did, but it took at LEAST 40 seconds for her to do so. As I continued to stare at the object, waiting for my camera,  I noticed that the flame at the bottom of the object began to lose it's intensity.  As the flame went from a full flame to just a red glow, I noticed that the object was slowly losing altitude, and drifting slowly south east, toward Lake Michigan.   As it dropped below the treeline, I began to run out of the ! yard and down the street so I can see around that particular treeline. I could, and again, I could see the object. The red glow at the bottom of the object was barely noticeable at this point, and the object began to descend more straight down than southeast and down as it was before.  It began to lose altitude faster, until it went below the treeline at that location, which was approximately half a city block to the south of where I was when I first began to record.  I waited at this location for about 30 minutes for the object to ascend or reapear, but it never did. While I was recording, I was not looking at the viewfinder; I was just pointing the lens in the direction of the object, so I had no idea if I actually had what I was seeing on the camcorder.  But after a discussion with neighbors and others who were present, I went inside, connected the camcorder to the television, and began to view the footage. I've been from that point on, compelled to find out what I saw is.  I contacted the local police, military, FAA, News Stations, etc., trying to find out if they had anything on the radar at that time and area of that day, but.....nothing; even though I expressed to them all that I had this thing on video!!  This incident has not only caused me a great deal of concern, it has changed my life, and challenges many things I believe. I have always been open to the possibility of the existence of such things, but never saw anything that came anywhere near actually convincing me that they are real. All that has changed now though. That thing had no sound whatsoever, it had no wings, and it had no tail end. It looked almost like a giant church bell with a flame at the bottom. Had I not recorded what I was seeing, I would have long since just assumed it was something normal, that can be explained. But after viewing this thing in slow motion on zoom, I am convinced that it is not, and can not. I will be attaching a copy of my video with this report (If it will upload). My animus is to have an expert opinion of what it is! that is on my video. it was certainly intelligently operated, and it was definitely a mechanical craft of some sort, and not a balloon or anything like that. I for some reason had a feeling of desperation as this thing was descending. It is the same desperate feeling I felt that made me look in that direction and up in the first place when I first noticed the object. I'm left feeling as though whatever it was, it was losing power, running out of fuel, or something to that effect, because it seemed to be struggling to maintain it's altitude. It was a struggle that It evidently lost. The object was moving slowly in the direction of the Lake; which leads me to believe that it was attempting to get out over open water. In  fact, it seemed to be trying very diligently to do so. I have no idea if it landed in the water or over land. All I know is it landed or crashed somewhere slightly south east of where I was, and never came back up. After you review my video, please get back ! to me and let me know what you think. Thank you; verily.",
      "link": "http://www.nuforc.org/webreports/098/S98726.html",
      "state": "WI",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfcdb",
      "summary": "Orange ball of light in sky over Milwaukee.",
      "city": "milwaukee",
      "shape": "cone",
      "date": "2013-02-04T00:00:00",
      "story": "Orange ball of light in sky over Milwaukee We went outside at midnight and after a few minutes I noticed an orange glow in the sky.  I called to my husband who immediately noticed it, as well.   It was flying relatively low from north to southeast and made no noise.   After about two minutes it disappeared.  It is a totally clear night here. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95667.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0402",
      "summary": "((HOAX??))  Triangle ufo gang.",
      "city": "milwaukee",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "Triangle ufo gang I know for a fact I saw a UFO.  I used to be a skeptic but tonight that changed.  I literally saw this thing with my own eyes and could not believe it.  At first I was driving down 91 past brown deer road heading to Mequan.  I noticed a bright light fixed in the sky.  I approached the bright light thinking it was a street light.  I was wrong I literally stopped my car right up under it and looked up and saw a triangluar craft.  Ten I noticed the craft turned its light of which was located in the center of the craft. That's when I saw the whole body of the craft.  I have never seen anything like this. It appeared the occupants in the craft noticed me.  Because I noticed they started to slowly move the craft. I do a u turn to follow it but it takes off at this point with a high speed faster than any jet, plane or craft I witnesss. I tired to follow it but lost track. Then I drove around hat area to see if I could find it....that's when I saw the sky was practically filled withy these objects there were literally about 10 or or15 of the, some of the, flying around with their bright orange center lights off but they had these police like lights and each were shaped like a triangle.  Ten they would turn their lights on and make a formation wither a triangle or strain line.  They were flying close too where you could look up and literally see the vehicle. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95958.html",
      "state": "WI",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c09fe",
      "summary": "Reddish orange lights floating in the sky from west to east",
      "city": "milwaukee",
      "shape": "circle",
      "date": "2013-11-11T00:00:00",
      "story": "Reddish orange lights floating in the sky from west to east When I pulled into the driveway I saw about 6 reddish orange round lights.  They were coming from the west and going to the east.   I have never seen anything like it before.",
      "link": "http://www.nuforc.org/webreports/103/S103540.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a36",
      "summary": "This was many years ago but this is what I can remember. I walked up to an open field it was a nice clear day.",
      "city": "milwaukee",
      "shape": "light",
      "date": "2014-02-27T00:00:00",
      "story": "This was many years ago but this is what I can remember.   I walked up to an open field it was a nice clear day.  In the distance near the horizon line between the clouds I witness something I cannot fully explain, nor comprehend.  I saw 4 bright lights that appeared to be large objects, judging by the distance I would sat they were the size of half my 2 bedroom house.   One appeared to be hovering and the others would shoot out from it one by one and sometimes two at a time.  They shot off very quickly disappeared behind the clouds and in a minute or two they were back in the same spot.   It was intelligent but not like any intelligence I have ever witnessed or known on this Earth.   I panicked at a certain point and fled home after maybe twenty minutes? ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107333.html",
      "state": "WI",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c9f",
      "summary": "Three orange orbs flying west in the sky in Milwaukee, WI on 9/10/2013.",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2014-01-30T00:00:00",
      "story": "Three orange orbs flying west in the sky in Milwaukee, WI on 9/10/2013. Three separate orange objects seen in the sky on September 10, 2013 at about 11:00pm in Milwaukee, WI. My friend, who doesn’t believe in UFO’s, had gone out to her car and saw 3 orange lights flying in the sky.  The lights appear white on the video, and are actually closer than it seems.  They moved in a westerly direction, without sound, and then just disappeared. They fly above her about half way through the video. She doesn’t “believe” in UFO’s, but was wondering if there is a logical explanation for these 3 separate orange glowing orbs to have been in the sky at this time.",
      "link": "http://www.nuforc.org/webreports/106/S106721.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ef9",
      "summary": "Craft with white and red lights hovering and slowly moving SE from Froedert Hospital past State Fair Park",
      "city": "milwaukee",
      "shape": "unknown",
      "date": "2013-12-23T00:00:00",
      "story": "Craft with white and red lights hovering and slowly moving SE from Froedert Hospital past State Fair Park Traveling west on I-94 from Milwaukee around 9pm, I was on my way to pick up a friend when, nearing Miller Park, I noticed an aircraft hovering above the area around Froedert Hospital.  With two bright white lights connected by smaller red and white blinking lights, I thought it was an airplane at first, except it remained almost completely stationary.  Maybe it was a helicopter, I thought, as I continued on my way to my friend's place, losing sight of it. About 15 minutes later at around 9:15pm, my friend and I were getting back onto I-94 westbound near Miller Park when I spotted the same lights.  By this time, the object had moved and was presently just south of I-94 by about a quarter to a half mile, hovering about 1000 feet above the ground.  As we got closer, we were able to get a better view of it as it hovered above the area just east of Stare Fair Park. There were no discernible wings and it wasn't a helicopter.  There were at least 3 bright white lights and a hale-domed shaped blinking red light which appeared to be in the center.  I couldn't determine the shape-it was night and we were on the freeway, driving fast-but my friend and I both did not recognize it as any aircraft we're familiar with.  If anyone else happened to see the same thing, please post.",
      "link": "http://www.nuforc.org/webreports/105/S105305.html",
      "state": "WI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1324",
      "summary": "Sphere aircraft or airplane with two white lights and have 6 lights in center of aircraft or airplane.",
      "city": "milwaukee",
      "shape": "sphere",
      "date": "2013-12-02T00:00:00",
      "story": "Sphere aircraft or airplane with two white lights and have 6 lights in center of aircraft or airplane. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104956.html",
      "state": "WI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c1383",
      "summary": "Two pitch white cylinders flying close to the moon in daylight.",
      "city": "milwaukee",
      "shape": "cigar",
      "date": "2013-11-20T00:00:00",
      "story": "Two pitch white cylinders flying close to the moon in daylight. The date was the same as I write this.  November 13th, 2013.  It was approximately 4:15 PM and the sun was setting.  It was still very light outside even though the sun just started to set.  I was on my way to my grandmothers apartment same as I do almost every week to help her out with sme household stuff and just to talk and visit.  Normally I would have used public transportation to get there completely however due to construction I had to walk the last had mile there.  Her apartment building is right across from Lake Michigan, I don't feel comfortable being anymore specific.  As I was walking down the street I looked out over the lake like usual to enjoy the view.  As I was looking I noticed as usual some planes going over.  Then, I saw this white object very close to the moon.  It drew my attention because it made no sound and had no exhaust trail behind it.  As I began to look closer I noticed it had no wings, or appeared not too.  This made me think it was one of those new \"drones\" police departments are using to monitor their districts.  So, I wanted to get a better look.  I hurried across the street to get a better view.  When I did I saw another pitch white cylinder shaped object also close to the moon moving in the sky.  I felt mesmerized.  I couldn't stop staring.  Once I saw th both I knew they were drones or planes or anything I've ever seen.  I couldn't look away.  I heard cars driving by past me but everything felt like it slowed down.  I experience a surge of fear and adrenaline.  I stared at them moving slowly towards each other.  The moon seemed to be in the middle point between them.  When they got close to the moon they just disappeared.  I was staring right at them and instantly, they were just gone.  I was in disbelief.  I ran back and forth, looking all around trying to see where they could have gone.  I couldn't see them anywhere.  I felt, strange.  I have no idea how to describe it.  After that I just sat on a bench and stared out onto the lake and the sky hoping they'd come back for about 20 minutes but they never did.  I know that what I saw had to be a UFO.",
      "link": "http://www.nuforc.org/webreports/104/S104413.html",
      "state": "WI",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c16b0",
      "summary": "I was pulling into work at 6:36am and a bright blue light lit up the sky.  There were many clouds and this light was behind them.  It f",
      "city": "milwaukee",
      "shape": "unknown",
      "date": "2013-10-23T00:00:00",
      "story": "I was pulling into work at 6:36am and a bright blue light lit up the sky.  There were many clouds and this light was behind them.  It flashed for about 10 seconds and then disappeared and I did not see it again.  No sound was made.",
      "link": "http://www.nuforc.org/webreports/103/S103435.html",
      "state": "WI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c16c2",
      "summary": "There appears to be a bright light at first I thought it was a plane.. but I've been watching it for 10 min no movement besides very b",
      "city": "milwaukee",
      "shape": "light",
      "date": "2013-10-23T00:00:00",
      "story": "there appears to be a bright light at first I thought it was a plane.. but I've been watching it for 10 min no movement besides very bright light ...it just turned dim out no star was shining yet but this bright light ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103476.html",
      "state": "WI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c2329",
      "summary": "Intelligent Light moving very slowly through the sky then disappears from view",
      "city": "milwaukee",
      "shape": "light",
      "date": "2014-04-11T00:00:00",
      "story": "Intelligent Light moving very slowly through the sky then disappears from view Last night I was walking my dog ((dog's name deleted)).  There were a few low lying clouds passing through the area.  I had been pointing a professional strenght laser around the sky at the cloud bottoms.  I looked down to see what my dog was getting herself into and retrained my eyes on the laser pointer.  When I looked up I noticed a very bright light directly next to the laser pointer.  I immediately shut the pointer off thinking it was a plane.  The bright light started to strobe extremly slowly and out of any rhythm.  I've seen before.  The light was just at cloud level and moving much too slow to be a aircraft.   Each time the light got brighter it seemed to become more intense.  The light had gotten so bright it started to feel like it was burning my skin.   After going inside my home I noticed my skin was slightly orange.  The light was strong enough to shine on the pavement around me.  The light moved behind a cloud rather fast and did not return after the cloud had past.  I stayed in the area for several minutes to see if it would come back.  It did not return.",
      "link": "http://www.nuforc.org/webreports/108/S108497.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a7b",
      "summary": "Two points of light above Bayview.",
      "city": "milwaukee",
      "shape": "light",
      "date": "2014-12-05T00:00:00",
      "story": "Two points of light above Bayview. While driving southbound I saw two points of light like stars above Bayview.  They appeared for around 10 seconds or so and then vanished.  They didn't fade in or fade out or anything, just appeared and vanished. ((NUFORC Note:  Confirmed as a morning sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115804.html",
      "state": "WI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2cbe",
      "summary": "Traveling star moving erratically across the sky.",
      "city": "milwaukee",
      "shape": "circle",
      "date": "2014-08-29T00:00:00",
      "story": "Traveling star moving erratically across the sky. Looked like a star at first glance, then it started moving erratically across the sky. First it was above my dads house then moved to above the garage and then back over to my dads house.   The neighbor even came out and had no explanation herself",
      "link": "http://www.nuforc.org/webreports/112/S112850.html",
      "state": "WI",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3257",
      "summary": "Dozens of orange lights traveling over Milwaukee south west side sky.",
      "city": "milwaukee",
      "shape": "triangle",
      "date": "2015-04-03T00:00:00",
      "story": "Dozens of orange lights traveling over Milwaukee south west side sky. Orange triangular lights traveling north east  to south west gaining altitude while overhead. Would appear from horizon as multiple single file groups down to one every several seconds.  Orange changed to red, and greenish blue at epox and continued gaining height until disappearing in southwest. Several neighbors witnessed from our back yards.  One post on Facebook.",
      "link": "http://www.nuforc.org/webreports/118/S118052.html",
      "state": "WI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36f6",
      "summary": "3 red light in delta formation flying at 5 k ft  from w  to east toward mke mitchel field.",
      "city": "milwaukee",
      "shape": "light",
      "date": "2015-01-26T00:00:00",
      "story": "3 red light in delta formation flying at 5 k ft from w to east toward mke mitchel field. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)",
      "link": "http://www.nuforc.org/webreports/116/S116837.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a71",
      "summary": "6 or 7 objects disappear and reappearing down to earth.",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2015-07-31T00:00:00",
      "story": "6 or 7 objects disappear and reappearing down to earth. It was like 6 or 7 fire spacecrafts that was in the air in Milwaukee people all over milwaukee have posted videos on facebook and such,  The objects would appear then reappear",
      "link": "http://www.nuforc.org/webreports/120/S120661.html",
      "state": "WI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c3aac",
      "summary": "Bright white light opened like hand-fan, violently collapsed on itself",
      "city": "milwaukee",
      "shape": "other",
      "date": "2015-07-31T00:00:00",
      "story": "Bright white light opened like hand-fan, violently collapsed on itself At about 5:05 am on the morning of Friday, July 24, 2015, I witnessed something in the sky in the city of Milwaukee, as I was on my balcony looking west across the Milwaukee River.  There was an incredible white light that resembled a hand-fan that was opening and then quickly and violently collapsed.  The light did not brighten the sky as a whole, just a remote area that was about double the size of a typical full moon.  I would guess I witnessed the light at about 35* above the western horizon and my best estimate for direction would be a straight line from about the Hoan bridge towards Potawatomi Casino.   The occurrence lasting about a second, left me humbled and dumbfounded.  I have since been feverishly trying to identify an explanation for the event, but nothing I have found with internet searches or recall from a college-level introduction astronomy course I took years back have helped me make any sense of the incident.   The light collapsing on itself reminded me of television depictions of travel between dimensions I suppose.  I cannot say that there isn’t a natural explanation, but it did appear that the light was flat on the bottom (and rounded on the top as it “fanned-out”).   Whatever it was that I saw has left quite an impression on me, and I’m certain the awesomeness cannot be fully explained with words.",
      "link": "http://www.nuforc.org/webreports/120/S120665.html",
      "state": "WI",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b2c",
      "summary": "Flaming object split into 5 blue orbs, formed a trapeziod then disappeared.",
      "city": "milwaukee",
      "shape": "sphere",
      "date": "2015-07-31T00:00:00",
      "story": "Flaming object split into 5 blue orbs, formed a trapeziod then disappeared. Was driving, saw something burning in the sky, thought it was a plane crashing because it was completely on fire, object then broke apart and split into 5 orbs of bluish light that then formed trapezoid,   Then the orbs split apart and disappeared completely.",
      "link": "http://www.nuforc.org/webreports/120/S120653.html",
      "state": "WI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b2d",
      "summary": "Object moving downward with orange glow then suddenly disappeared.",
      "city": "milwaukee",
      "shape": "unknown",
      "date": "2015-07-31T00:00:00",
      "story": "Object moving downward with orange glow then suddenly disappeared. Looked like a jet only the trail was orange and continued downward. Eventually it stopped and held position for a couple seconds and then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120684.html",
      "state": "WI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3bc8",
      "summary": "Observed 13 different orange/red spheres moving quietly in small groups, east to west, in a dark night sky.",
      "city": "milwaukee",
      "shape": "sphere",
      "date": "2015-07-17T00:00:00",
      "story": "Observed 13 different orange/red spheres moving quietly in small groups, east to west, in a dark night sky. A band I work with had just finished performing at a downtown outdoor festival.  I was standing behind the stage area, talking with a musician, facing toward Lake Michigan, which was about 4 blocks away.   I saw 4 reddish-orange spheres, moving slowly in the night sky, as if in unison, from the lake vicinity toward land, coming our direction.  I showed the musician and he was captivated, like me, as we watched.  They slowly disappeared behind a tall building.   We wondered what we had seen, and then he said, “Look, there’s another.”  As another appeared on the horizon, soon there were 2 more.  That group of 3 spheres, or orbs, same color, moved the same general direction, quietly, again in unison and moved behind the same tall building til we could not see them.   Again the sky was dark and we watched as slowly a group of 5 more appeared, moving the same general direction, slowing, as if in unison.   Last, 2 more appeared and did the same thing, always moving slowing, ea! st to west, but disappearing. I got a few photos.   I’m very aware of the night sky, and my surroundings and have never seen anything like this; neither had the musician who watched as long as I did, a total time of about 15 minutes.  Never have seen anything I'd call a UFO, until this.  Info. about witnesses: adult female, college grad, school teacher for 35+ years; adult male, musician/keyboard player, highly respected in the community for many years.  We are just casual acquaintances.",
      "link": "http://www.nuforc.org/webreports/120/S120422.html",
      "state": "WI",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d20",
      "summary": "Saw bright light complete circle around aircraft and then vanish.",
      "city": "milwaukee",
      "shape": "light",
      "date": "2015-07-23T00:00:00",
      "story": "Saw bright light complete circle around aircraft and then vanish. Standing on 2nd floor balcony looking east toward Lake Michigan, which is approximately 7 blocks from my house.  Looked up directly to zenith of night sky when I noticed a single medium bright white light traveling in a northward direction.  The odd thing was 3 planes were in my view, I also live next to General Mitchell Airport, and I knew they were planes due to their flashing FAA lights.   As the UFO neared the plane closest to it, which was traveling south, the object changed its straight course and did a counterclockwise rotation around the airplane and after it completed the circle it seemed to get dimmer until gone.  The plane was estimated to be at 5,000 feet however since I had no clue on the size of the UFO I don't know how high it was.  The funny thing is I used to see the same objects every night (sometimes 19 in one night) every night during the summer of 2008 and until tonight have not witnessed the phenomenon again.",
      "link": "http://www.nuforc.org/webreports/120/S120544.html",
      "state": "WI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d35",
      "summary": "I live in a 14th floor apartment in downtown Milwaukee. As I was getting ready for bed this past Sat night / Sun morning, I looked out",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2015-07-03T00:00:00",
      "story": "I live in a 14th floor apartment in downtown Milwaukee.   As I was getting ready for bed this past Sat night/Sun morning, I looked out my bedroom window at the city and the moon in the SW. I saw a moving light from the west, past the Potawatomi Hotel, maybe as far as Miller Park, and thought it might be a plane coming in.  Then there were more lights that came bobbing in, maybe a few hundred feet up and around ¼ mile away.  At one point, there were up to 12 of them, each one of them had one light. My thought was that they were drones, but with lights?  Or maybe gyrocopters.  No sound.  I finally thought to grab my cellphone and took a photo in which 7 lights can be seen.  They seemed to gather above the 100 East Wisconsin building.  Then they turned south, ascended and disappeared without a sound. ((NUFORC Note:  High-quality photo shows a cluster of at least seven small objects in the nighttime sky.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119889.html",
      "state": "WI",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c443c",
      "summary": "4 bright objects in the sky looks like drones.  ((NUFORC Note:  We suspect a sighting of planets in the E sky.  PD))",
      "city": "milwaukee",
      "shape": "egg",
      "date": "2015-11-19T00:00:00",
      "story": "4 bright objects in the sky looks like drones. 4 bright objects moving slowly. Did not change shapes.Too big to be stars. ((NUFORC Note:  We suspect a sighting of one of the three planets, which currently are quite prominent in the eastern morning sky.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123839.html",
      "state": "WI",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a7b",
      "summary": "Glowing orange ball in sky moving west to east.",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2015-10-16T00:00:00",
      "story": "Glowing orange ball in sky moving west to east. Seen orange glowing ball in sky to the south on west center St and 60th St. that moved from the west to the east. While letting my dogs out and on the phone my call dropped on my cell phone. Also my dogs were going crazy looking at the sky with me.",
      "link": "http://www.nuforc.org/webreports/122/S122843.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c504a",
      "summary": "Very Very Bright... To fast to be a airplane...Unbelievable,",
      "city": "milwaukee",
      "shape": "triangle",
      "date": "2016-02-11T00:00:00",
      "story": "Very Very Bright... To fast to be a airplane...Unbelievable Listen I do not know if this a ufo but I tell you what im 43 years old I have never seen something this big and bright in my life....this thing I dont know if this was a military craft or what but it was shaped something similiar to a triangle but it wasn't a triangle...it had a very bright light on the fcront and indivisual lights maybe 6 or 7 lights on the bottom.   I live in Milwaukee on the coast of lake michigan driving north this whatever it was was approaching me going south.  It stopped, then swerved left and then right then disappeared.  I know this sounds unbelievable but I swear to god I know what I seen.  I I'm a black man who don't believe in that but whatever it was scared me half to death and still do....I still cannot believe what I seen.  Whatever it was hovered over Lake Michigan and took off.…",
      "link": "http://www.nuforc.org/webreports/125/S125652.html",
      "state": "WI",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c51f0",
      "summary": "Fireball, Lake Michigan, Milwaukee.",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2016-02-04T00:00:00",
      "story": "Fireball, Lake Michigan, Milwaukee. So, I am walking home from the gym, heading east on Wells St. towards Lake Michigan and I just so happened to be looking up at the sky.  There was a very bright object in the sky, with long very bright tail (kind of what what Hollywood would portray as a meteor or a comet....or even some rocket/missle) that was traveling in a downward trajectory.   Some random stranger was walking next to me and I said do you see that!  Unfortunately, they were too busy looking at their phone, and by the time I got their attention, it was gone.  I can tell you with 100% confidence that was no way a shooting star or a plane.  It was way too big to be a shooting star and way too bright and fast to be a plane.",
      "link": "http://www.nuforc.org/webreports/125/S125581.html",
      "state": "WI",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c546b",
      "summary": "Bright white light form northwest.  Lit up entire sky.  No sound.  Not lightning.",
      "city": "milwaukee",
      "shape": "other",
      "date": "2015-12-17T00:00:00",
      "story": "Bright white light form northwest.  Lit up entire sky. No sound. Not lightning I was running through the park and all of a sudden the sky lit up starting from the northwest, almost as if lightning struck.  But there was no sound and it was scattered clouds no rain or storms on that day.   For 1-2 seconds I could see as clear as daylight.  Bright light that came from the northwestern horizon and lit up the entire sky.   I tried searching to see if anyone else had seen this but couldn't find any explanation so I'm filing a report.",
      "link": "http://www.nuforc.org/webreports/124/S124697.html",
      "state": "WI",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c54b0",
      "summary": "Glowing streak high in the sky.",
      "city": "milwaukee",
      "shape": "cigar",
      "date": "2015-12-17T00:00:00",
      "story": "Glowing streak high in the sky Dec 14, 2015.  7:30 pm. North of Milwaukee, WI.  My son and I were on the back deck enjoying a calm night, semi clear sky, and unseasonably warm temperature.  He said that he thought there was supposed to be meteor activity so we were sitting and looking up.  He burst out, “Whoa!”.  I see a “dash” shaped object glowing brightly and streaking high across the North sky from East to West within our atmosphere.  It wasn’t a meteor, there was no atmospheric piercing flash and fade.  It was a constant light or glow and moved at what appeared a consistent altitude.  It streaked quickly, then appeared to instantaneously stop or slow and then streak again just as fast.  Only lasted 2-3 seconds to cross the sky and gone.  No sound or visible exhaust, no blinking lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124691.html",
      "state": "WI",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5756",
      "summary": "Large Red Orb moving from S to N over Washington Heights Neighborhood.",
      "city": "milwaukee",
      "shape": "light",
      "date": "2016-07-15T00:00:00",
      "story": "Large Red Orb moving from South to North over Washington Heights Neighborhood. At approximately 22:00 I was out walking my dog and noticed a very large glowing red orb moving silently above the houses.  It was pretty high up yet moving at a steady pace without a sound.  It was bright red with an amber flickering light in the bottom center.  I though it could have been a Chinese lantern, but it was not moving upward in any way, just from south to north.  Besides that, I feel it was much too large to have been a Chinese lantern. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128491.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5885",
      "summary": "Sighting in Milwaukee?",
      "city": "milwaukee",
      "shape": "formation",
      "date": "2016-06-10T00:00:00",
      "story": "Sighting in Milwaukee? I am seeing bright lights in formation in the sky.  The sky is very cloudy in some areas can only see when pass through the clouds not when reach the clear sky.  Moving very fast they are circling through the cloud spread out in an open formation each will make like a circular motion in their separate area then speedily move inward touch for a very brief second then spread out again.  Circle around as individuals then speed to the center again where all four touch.  They are moving very very fast can compare to airplane that can be seen not to far away.  These lights are much faster covering a vast amount of space.  Hypnotic in their movement almost looks like they are playing and tracing the clouds.  The objects appeared as large round balls of light that could be seen through the clouds very bright yet could not be seen when reached clear night sky areas at first but after about 35 minutes could see two of them in night sky also.  Seemed very patterned mov! ement and purposeful.  Don't know if others saw also.  I did video but have not watched yet to see how turned out.",
      "link": "http://www.nuforc.org/webreports/127/S127766.html",
      "state": "WI",
      "duration": "Hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c59fc",
      "summary": "Walked outside looking northwest, noticed 4 orange lights almost in a row hovering for a few seconds and slowly moving west and dissapp",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2016-05-06T00:00:00",
      "story": "Walked outside looking northwest, noticed 4 orange lights almost in a row hovering for a few seconds and slowly moving west and dissappearing at the same point.  Each time one disappeared another appeared vertically next to the other red balls.  At one point 8 red balls not flashing were in a lined formation in the sky.  Camera wouldn't pick up the lights.  Was much larger,slower and further compared to other aircraft flying past.",
      "link": "http://www.nuforc.org/webreports/127/S127101.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6712",
      "summary": "Oval space craft?",
      "city": "milwaukee",
      "shape": "oval",
      "date": "2017-04-07T00:00:00",
      "story": "Oval space craft? My daughter passed this along to me.  It was taken by her boyfriend in Milwaukee on South 27th Street.   It appears that he was taking pictures of the clouds and when he was looking though his pictures, he zoomed in on the spot in this one and saw this.   Let's figure this out together. ((NUFORC NOTE:  We can't be certain, but it looks like a hole in thin cirrus cloud, caused by an airliner passing through it.  Just a guess.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133298.html",
      "state": "WI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c69f0",
      "summary": "I noticed object went to my front door noticed something in the air I proceeded to open my door stepped on my porch walk down a few ste",
      "city": "milwaukee",
      "shape": "unknown",
      "date": "2017-02-22T00:00:00",
      "story": "I noticed object went to my front door noticed something in the air I proceeded to open my door stepped on my porch walk down a few steps looking in the air notice  the object floating above the tree lines a little bit higher with lights running around it clock snd counter clockwise can't tell you the height I immediately went back in the house to get a phone I came outside the object had moved slightly to the right not   just a little further where I had noticed  this object was pretty large in size but I didn't think I was getting the film footage of required on this phone because I couldn't tell because my phone wasn't as good as phone as my daughters as I come back out of the object was further away I have the film that what shows orbs dancing around a light also",
      "link": "http://www.nuforc.org/webreports/132/S132718.html",
      "state": "WI",
      "duration": ":27"
    },
    {
      "_id": "64d005f478aba2ec5a3c69ef",
      "summary": "Observed light in my doorway walk through the door and looked out the door saw an object in air went got my phone took a film of it",
      "city": "milwaukee",
      "shape": "circle",
      "date": "2017-02-22T00:00:00",
      "story": "Observed light in my doorway walk through the door and looked out the door saw an object in air went got my phone took a film of it",
      "link": "http://www.nuforc.org/webreports/132/S132734.html",
      "state": "WI",
      "duration": ":27"
    },
    {
      "_id": "64d005f478aba2ec5a3c7106",
      "summary": "Given that local weather forecasts mentioned that the Aurora Borealis could be viewed in my area from around 10 PM, I went outside to s",
      "city": "milwaukee",
      "shape": "light",
      "date": "2017-07-23T00:00:00",
      "story": "Given that local weather forecasts mentioned that the Aurora Borealis could be viewed in my area from around 10 PM, I went outside to see if they were, indeed, visible in Milwaukee.  Unfortunately, they weren't. However, while scanning the night sky around 9:45 PM, I noticed a light directly overhead.  At first, I thought it was a satellite moving quietly, steadily due north.  But then I saw it was blinking on-and-off in one second intervals.  No navigation lights were evident, and the light was not the strobe of a high-flying aircraft.  In fact, two such high-flying jets (headed west) crossed well in front of this object, so it was easy to discern and compare what a strobe looked like at altitude vis-a-vis the unknown object. In terms of illumination, the object/light resembled Saturn in both brightness and magnitude, although the quality of its light was a steady pale white while lit.  There light definitely wasn't a flash like that of a strobe, and it wasn't like the brilliant reflected light of a planet like Jupiter or Saturn.  It had no star-like characteristics, either. Unlike transient satellite flashes, the pulsing remained constant throughout the sighting.  And, unlike a satellite, the object appeared to stop about 30 degrees above the horizon for 15-20 seconds, before heading off in a more northwest direction (a deviation under 10 degrees).  It pulsed steadily until it disappeared from view.  No navigation lights were ever in evidence; no contrail; no sound; no silhouette visible against the sky. The sighting lasted about five minutes. ((NUFORC Note:  For some reason, witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135213.html",
      "state": "WI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cf6",
      "summary": "Orange/red ball that flickered, moved in what seemed to be a straight line due North.  ((anonymous report))",
      "city": "milwaukee",
      "shape": "fireball",
      "date": "2017-09-21T00:00:00",
      "story": "Orange/red ball that flickered, moved in what seemed to be a straight line due North. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136176.html",
      "state": "WI",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8177",
      "summary": "Flying lighted objects glowing in Milwaukee sky; live broadcast. ((NUFORC Note:  Video is very interesting, and worth watching.  PD))",
      "city": "milwaukee",
      "shape": "light",
      "date": "2018-03-02T00:00:00",
      "story": "Multi flying lighted objects glowing in Milwaukee skyline; live broadcast. Fox 6 news early morning broadcast; city cam caught numerous lights swirling, trailing, flashing and flying around the dark sky.  On Facebook they state these were seagulls. https://www.facebook.com/fox6news/ ((NUFORC Note:  Video is accessible from the FOX 6 site shown above, of from the following website, as well:  http://www.rumormillnews.com/cgi-bin/forum.cgi?read=94580 It is worth watching.  We do not know what the objects are.  We would welcome reports from anyone who personally witnessed the lights.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138971.html",
      "state": "WI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c89a3",
      "summary": "I saw a green star sized object flashing green at a very high altitude . About 30 sec. Later,it started moving fast in different direct",
      "city": "milwaukee",
      "shape": "flash",
      "date": "2019-09-06T00:00:00",
      "story": "I saw a green star sized object flashing green at a very high altitude.  About 30 sec. later, it started moving fast in different directions.  It changed to yellow momentarilly, then moved instantly to the other side of the sky.  It stopped for a few seconds, then disappeared.",
      "link": "http://www.nuforc.org/webreports/148/S148457.html",
      "state": "WI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bf1",
      "summary": "Slow moving glowing cylinder, yet flat on bottom, going east with white light a third way back.",
      "city": "milwaukee",
      "shape": "cigar",
      "date": "2019-02-14T00:00:00",
      "story": "Slow moving glowing cylinder, yet flat on bottom, going east with white light a third way back. Cigar shaped UFO siting, 10/27/2012, Milwaukee, WI.  As I was going out on Saturday, 10/27/2012, sometime between 9-10 pm, to see a band in Milwaukee, WI, on  Halloween (also Sandy storm) weekend, I noticed a large cigar shaped illuminated cylinder, floating very high up, going west to east directly above my house located a few miles north of I-94, 5 miles west of downtown.  The diameter to length ratio was about 1:8. It was misty, with clouds, yet I could see the object fairly well, traveling similar or slower than a typical aircraft. While mainly cylindrical, it seemed to have a flat bottom, was glowing, but most distinctly had a white light on the side about a third of the way back, and overall seemed brighter near the rear.  A friend in the Kickapoo Valley in SW Wisconsin, also mentioned seeing the same craft earlier that night traveling west to east. Ironically, earlier that day, I dropped off information of my first UFO sighting in the NY Hudson Valley in 1985 (could not recall the specific date, but was mild day in the spring, summer or early fall before dusk) to a local Milwaukee MUFON contact.  He provided me two forms in 2008, and I finally wanted to get them back to him.  I am not sure if he believed my sighting of the saucer shaped UFO, and/or actually processed the information I provided.  While searching online, I found a website describing a similar situation that may have been the person that I met during my siting, who drove up in a maroon van, from the east and turned south onto the road in front of my house, who said he had been tracking same craft for 40 minutes. Additionally, I saw online that similar Cigar shaped sightings happened a week before on Oct 15, 2012,  in Huntsville, AL, and TN, Oct 16 in Pike, Kentucky, during the day,  ((Male's name deleted)) photographed a translucent cylinder, with two lights on side a third of the way back, using a camera on a telescope, Oct 17 in Virginia, and Oct 18 in Gardiner, NY, equal distance apart over the 4 day time span. Also, a few years later, I was on the Coast to Coast radio show and spoke with guest John Lear.   I have a ((degrees deleted)) in Engineering, worked for ((major corporation)) 9 years and was a brewing consultant/ brewer for over ten years.",
      "link": "http://www.nuforc.org/webreports/144/S144835.html",
      "state": "WI",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9288",
      "summary": "Strange large contrail in sky over Milwaukee going from SE to NW. Larger and wider than usual jet contrails.",
      "city": "milwaukee",
      "shape": "",
      "date": "2019-12-01T00:00:00",
      "story": "Strange large contrail in sky over Milwaukee going from SE to NW. Larger and wider than usual jet contrails.",
      "link": "http://www.nuforc.org/webreports/149/S149942.html",
      "state": "WI",
      "duration": "25 min"
    },
    {
      "_id": "64d005f478aba2ec5a3c9426",
      "summary": "Bright light, eastern sky changes colors round midnight",
      "city": "milwaukee",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Bright light, eastern sky changes colors round midnight At 11:45 approximately 90° east of true North a light approximately four times the luminosity of Venus appeared but instead of remaining one color it cycled through multiple colors and slowly moved upwards from the equator toward Orion.  The colors were blue, red, green, white, orange.  It did not appear to match any sort of aircraft from any angle that I'm familiar with.  I have video from a monile device that I will email.",
      "link": "http://www.nuforc.org/webreports/150/S150496.html",
      "state": "WI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c944f",
      "summary": "Light seen zipping across trail with very loud noise after it.",
      "city": "milwaukee",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "Light seen zipping across trail with very loud noise after it. Me and my 2 friends were walking on a trail by the river in Milwaukee and about 75 feet away from us we saw a large green light shoot across the trees horizontally and then made a very loud noise. My two friends saw the light while it was green going onto the path and I saw the light as orange as it went into the woods on the other side of the path and right after there was a very loud zipping noise. This only lasted for about 2 seconds but we were all very scared and ran as fast as we could. We can't think of anything that it could be.",
      "link": "http://www.nuforc.org/webreports/150/S150602.html",
      "state": "WI",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9814",
      "summary": "I just had a feeling to take my camera out & that I might capture something & yes I did & it was flying pass then stop in mid air then",
      "city": "milwaukee",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "I just had a feeling to take my camera out & that I might capture something & yes I did & it was flying pass then stop in mid air then Everytime I tried to focus it Distortion started to make my camera go out of control then it vanished camera is distroyed it will not focus anymore",
      "link": "http://www.nuforc.org/webreports/151/S151091.html",
      "state": "WI",
      "duration": ""
    }
  ]
}