{
  "city": "minneapolis",
  "fetch_timestamp": "2025-07-12T14:32:49.489073",
  "record_count": 90,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b41e8",
      "summary": "On 3-19-19 at 11:30 pm (CST) I viewed a &quot;star&quot; whose form was constantly changing, emitting points of light then fusing back",
      "city": "minneapolis",
      "shape": "light",
      "date": "2019-03-21T00:00:00",
      "story": "On 3-19-19 at 11:30 pm (CST) I viewed a &quot;star&quot; whose form was constantly changing, emitting points of light then fusing back On 3-19-19 I looked up into the night sky from my kitchen window (facing east at 11:30 pm CST) and noticed a solitary star.  (I had just let my dogs out in the backyard to go to the bathroom.)  The \"star\" was high in the sky, approximately 60 degrees or so from the horizon. The \"star\" then began to move.  It's movement is best described as squirmy and its form was constantly changing.  Small points of light dispersed from it, remaining very close and then it would all fuse back together.  It was \"ever changing\" in a constant state of flux. The \"star\" moved to the right and upward over the course of 2-3 minutes.  It covered a distance approx. twice the size of my double garage.  The garage is approx. 40-60 feet from my kitchen window. Soon after a light haze of clouds covered the sky and the \"star\" disappeared.",
      "link": "http://www.nuforc.org/webreports/145/S145282.html",
      "state": "MN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b432f",
      "summary": "green flash",
      "city": "minneapolis",
      "shape": "flash",
      "date": "2006-05-15T00:00:00",
      "story": "green flash I was watching tv(in uptown)(facing north) and theres a big window behind the tv it was 8:33 pm all of a sudden the whole sky flashed green lasted maybe one and a half seconds",
      "link": "http://www.nuforc.org/webreports/049/S49613.html",
      "state": "MN",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b4359",
      "summary": "green flash",
      "city": "minneapolis",
      "shape": "flash",
      "date": "2006-05-15T00:00:00",
      "story": "green flash 2nd time this week this happened ...I was sitting on the couch drinking coffee watching the news getting ready to go to work..my tv sits in front of a big window with a view of the northern sky 4:38 am and the whole sky flashed green for maybe a second and a half",
      "link": "http://www.nuforc.org/webreports/049/S49614.html",
      "state": "MN",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b4362",
      "summary": "The following sighting reports are very similar to the one my mother, father, North Minneapolis and I had back in 1975. This is the sec",
      "city": "minneapolis",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "The following sighting reports are very similar to the one my mother, father, North Minneapolis and I had back in 1975. This is the second time it's happened to a friend of mine, his story:   He said he was walking home from the store during the Monday night snowstorm and as he approached his building, he noticed three women in high-school cheerleader mini-skirts walking silently behind him (he mentioned that they were silent because he said that he only heard his own footfall as it crunched into the snow). When he turned back around he noticed what he first thought to be alot of police cars. Then he said because of the size of it, maybe a large construction crew working on Lyndale Ave N.  As he climbed the steps of his building, he noticed that the women had lined up side-by-side, standing at the foot of the steps but were facing and staring at the \"construction sight\".   Everything was silent and this is when he said he got the sudden urge to run into the building.  He said he went straight to the Recreation Room because the window there gives you a direct sight to the street where the \"construction sight\" and the women were.   This is when he got a clear view of what he said was this huge object hovering over the street about tree level.  It was silent, black, or either a very dark color, and had a row of flashing, dancing, lights running along the bottom perimeter of it.  He said what was also astonding is that the object was about as large as a football field.  ' He also noticed that the street--which is usually busy--did not have ANY traffic at all.  (I was born and raised there too so I know this particular street and it is ALWAYS busy--just like a freeway.)  He said he then started running around inside the building to all his neighbor's, knocking on their doors trying to get someone to come and see the object--finally finding someone after approximately 15 minutes.  He said he told this person, \"Man, come and see this shit!\"  But when they got to the window, the craft was gone.  He said the guy then asked him, \"What shit?\", and my friend said he told him, \"Man...NEVER MIND\"  He saw this very same object back in 1979 while with a group of friends. That sighting lasted for about 10 minutes as a triangular-shaped object moved slowly in their field of vision from right to left.  I must say that these encounters are similar in that there is an eerie calm and that sometimes no-one seems to be around or is arousable when these experiences happen--obviously \"they\" set it up this way.",
      "link": "http://www.nuforc.org/webreports/049/S49673.html",
      "state": "MN",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b33",
      "summary": "Unknown object that flies above us, below the clouds,  bright, sunny day. Travels quickly,  then disappears.",
      "city": "minneapolis",
      "shape": "other",
      "date": "2019-06-27T00:00:00",
      "story": "Unknown object that flies above us, below the clouds,  bright, sunny day. Travels quickly,  then disappears. Good afternoon, June 16th, my mother called me quickly to come see something strange in the sky.  She quoted seeing antennas on some craft.  I went outside to see this amazing object traveling at an angle.  Like it wasn't vertical,  or horizontal, it was quite strange.  It was long in width (by the way it was traveling).  I believe I also saw some form of sphere in the middle.  I really hope they can share my photo on the web. As it passed above us,  below the clouds, nice sunny day.  I took out my phone and happen to take a one second video! I have an image of what we saw.  I'm excited and share the photo with my close relatives to tell me, what I saw. The object traveled quickly,  and made no sound.  At one point I thought maybe that's an eagle.  I'm not far from the river.  But it did disappear.  If I didn't have this picture, I'd be wondering my entire life.",
      "link": "http://www.nuforc.org/webreports/146/S146981.html",
      "state": "MN",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b95",
      "summary": "Bright light appears to have form of a triangular craft when I zoom in.",
      "city": "minneapolis",
      "shape": "unknown",
      "date": "2019-06-07T00:00:00",
      "story": "Bright light appears to have form of a triangular craft when I zoom in. Close to 4 PM, we sat outside because we were done cutting the grass. Looked up at the sky and I asked my momma “do you remember the sky was the same, when we saw the red orbs” and Bam!  I spot a UFO in the sky.  This one was not an orb, I thought it was longer light. Vertically.  As I zoomed closer it appeared different.  I have been studying the images I took and zoomed in again, and am able to see a triangular shape.  You can see very clearly the form.  They were a few different things happening as we were looking at that direction.  We could spot more than one object.  I took a couple of videos hoping that at least one would capture the right image.  In the video that I play repeatedly, you can also clearly see how something shoots out of the bigger object.  The object appears and disappears.  When they appear again it was slightly a different area.  Not the same spot.  At some point, it moved above us.  Extremely high in the sky I would not even be able to calculate ! how far up it was.  I do know it was above us because that’s where it stopped and then left.  We were not able to see it after that.  By left I mean disappeared.",
      "link": "http://www.nuforc.org/webreports/146/S146446.html",
      "state": "MN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d8e",
      "summary": "Well, typical in Minnesota. Another sighting.This time I had the chance to pull out my phone.  Strange extremely bright light in the da",
      "city": "minneapolis",
      "shape": "light",
      "date": "2019-04-25T00:00:00",
      "story": "Well, typical in Minnesota.  Another sighting.  This time I had the chance to pull out my phone.  Strange extremely bright light in the dark night.  Different than a star.  The first bright light moved across horizontally, then suddenly vanished.  Faded.  Disappeared.   After I was done recording the first bright light, I noticed a second brighter light.  As you can see in the second video.  Planes fly above us all the time and the that was most definitely not a plane.",
      "link": "http://www.nuforc.org/webreports/145/S145733.html",
      "state": "MN",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e44",
      "summary": "((HOAX??))  Mysterious vanishing parachute thing.  ((anonymous report))",
      "city": "minneapolis",
      "shape": "other",
      "date": "2019-05-09T00:00:00",
      "story": "Mysterious vanishing parachute thing Mysterious object about the size of a person floating down from the sky.  Looked like something attached to a parachute.  Appeared to land in a public park, but was missing, when I went over to investigate. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145918.html",
      "state": "MN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b54ca",
      "summary": "I saw a disk hovering above some suburbs with a light shinning down below before disappearing in a streak of light.",
      "city": "minneapolis",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "I saw a disk hovering above some suburbs with a light shinning down below before disappearing in a streak of light. I am 24 and i live in Edinburgh, Scotland. I was in Minneapolis in July 1998 visiting my cousins with my parents. They live in suburbs of Minneapolis.  One night around 1am i couldn't sleep because i was too hot, being from Scotland im not used to the heat! I got up to open a window but the problem was there was a mesh on the inside to stop mosquitos. I coludn't work out how to open it so was at the window for quite some time. It was then that i noticed a light in the corner of my eye. Looking out the window across the suburbs i could see a disk shaped craft hovering above a small clump of trees in the middle of the suburbs. It was about 500 yards away. It was clear to see because the house i was in was on a hill and the suburbs sloped away from it so there was nothing obstructing my view. I was almost looking slightly down on the craft. The craft was dark in colour, about 100 feet wide and thin from top to bottom, maybe only 10 or 15 feet. There were also small lights in the middle of the craft around its circumfrance. There was a green beam of light shinning from the middle of the underside of the craft down into the trees below. It was about 15-20 feet wide and panned out fractionaly futher from the craft. I watched it for about 10seconds or so then the light shut off. Without any noise the craft disappeared in a streak of orange light leading up to the right into the night sky. It was as if it had almost instantly accelerated to a speed hundreds of times faster than any plane, simply too fast to see. ((NUFORC Note:  Date of the event may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58707.html",
      "state": "MN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5620",
      "summary": "Circling Shiny Objects",
      "city": "minneapolis",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Circling Shiny Objects About 6pm, my husband and 2 kids were in our back yard and looked up to see what looked like a bird circling at a very high altitude, only it looked metallic. It was very high and appeared to be circular or possibly a cylinder shape.  We were facing east and the sun was behind us. It was still daylight with a clear blue sky. The object appeared to be reflecting the sun as its light varied as it moved in its circular path. It seemed that at certain points in the circle it was at a better angle for reflecting the sun. It was making circles and moving north, then it faded away for a while or moved too far away to see, then it returned and circled around some more.  At the time airplanes were landing in a path from Lake Harriet, southeast toward the airport. The planes were crossing under the area where these objects appeared to be circling, so they were very high up.  After about 10 minutes, we saw two identical lights circling in the same pattern in unison, again moving northward, then fading away, then returning to the same spot due east. We watched until they faded away again then went inside. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62890.html",
      "state": "MN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b56cc",
      "summary": "20-30 orbs in birdlike formation heading east from west. City lights illuminated bottoms of orbs",
      "city": "minneapolis",
      "shape": "formation",
      "date": "2008-06-12T00:00:00",
      "story": "20-30 orbs in birdlike formation heading east from west. City lights illuminated bottoms of orbs My wife and I just witnessed approximately 20-30 orbs flying high in the sky. They are currently heading east (from the west). The formation is almost birdlike. The orbs were moving in a group type formation in what looks like a flying w type formation. The bottoms or the visible portions were what looked like a mirror. The tops were not visible.",
      "link": "http://www.nuforc.org/webreports/062/S62803.html",
      "state": "MN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b57c0",
      "summary": "Giant triangle-shaped craft at very low altitude right over North Minneapolis",
      "city": "minneapolis",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "Giant triangle-shaped craft at very low altitude right over North Minneapolis Sometime in the Summer of 1993, when I was 12 years old, me, my brother, and my best friend ((name deleted)) were playing outside. We were going about our business as usual on the blacktop hill at the school across the street from my house. The weather was perfect.  At any rate, I saw ((name deleted)) eyes get real wide as he looked at the sky. I looked up and what I saw was amazing. I saw what appeared to be a triangular shaped craft of some kind. I can clearly recall that the bottom was bordered with a green glowing light, and there was a large circular orange light right in the middle of the bottom of the craft. So basically, I was looking a a big green-rimmed triangle with a circular orange light in the center.  When I first looked at it it seemed like it was quite far away. Like it was  just passing overhead. But to my mixed horrer/awe/excitement as soon as I looked at the damned thing it slowly but surely started coming right at me. It felt as though I were attached to it by some kind of string, and that by looking at it I was pulling it towards me. Like we were magnetically attracted and we had reached the point of no return, and a collision was inevitable. I also had this odd feeling that everything but me and the object had ceased to exist. I mean, everything was still around me, but it was like everything but me and the ship was on pause or something.  As it descended towards me I watched in awe as it just kept coming closer, and closer, and closer. And the closer it came, the bigger I realized it was. Eventually the thing got so low that I thought it would squash me along with 3/4 of my city block. It was truly amazing. It was gigantic, and it came down right over me in the middle of North Minneapolis! I would have expected chaos around me if I had been thinking clearly. I mean, cars should have been pulled over honking, people should have been yelling, etc... But no. Complete calm. And the calm seemed perfectly natural to me.  So, when the ship had come so low that i could hit it with a baseball it was like I snapped out of a trance and panic overwhelmed me. I immediately burst towards my front door across the street. Upon my first step was the first time my brother and my friend had entered my awareness since I first spotted the object.  I don't actually remember physically running across the street, but that may have been due to pure panic. Anyway, I got to the door with my brother and friend scrambling right behind me. I took one last look up as I darted into the house, and there was nothing there.  An odd side note. My brother only remembers seeing the thing from a very far distance. He remembers a big ass light far up in the sky and that's about it. ((name deleted)) remembers the thing descending, but he doesn't remember it getting nearly as close as I do. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54754.html",
      "state": "MN",
      "duration": "1 Minute?"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a4a",
      "summary": "UFO sited at Minnehaha Creek in Minneapokis Minnesota",
      "city": "minneapolis",
      "shape": "other",
      "date": "2007-10-08T00:00:00",
      "story": "UFO sited at Minnehaha Creek in Minneapokis Minnesota We were watching the stars at Minnehaha Creek.  In the western sky, south of the Big Dipper, a star (unknown) had a spot flashing every few seconds around it.  First it was on the left, then up top, then on the right.  We were only there for a few minutes, but it continued for 1/2 hour on our walk home.",
      "link": "http://www.nuforc.org/webreports/058/S58749.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b20",
      "summary": "Look to the clouds",
      "city": "minneapolis",
      "shape": "disk",
      "date": "2007-02-01T00:00:00",
      "story": "If you want to find UFO's look to the clouds, more specifically thunderstorms with heavy electrical activity. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54159.html",
      "state": "MN",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b631d",
      "summary": "Two spheres flying in tight formation near Ford Parkway bridge",
      "city": "minneapolis",
      "shape": "sphere",
      "date": "2008-01-21T00:00:00",
      "story": "Two spheres flying in tight formation near Ford Parkway bridge On June 16th 2006, my wife and I were sitting outdoors at a café, the clouds looked particularly interesting that day, and as I often photograph them for my projects, I asked her if she minded us making a quick stop at the Ford Parkway bridge. This bridge provides an excellent panoramic view of the sky, perfect for capturing images of clouds.  I considered stopping at home first, to grab my Nikon D50, but I could tell I was testing my wife’s patience as it was. To my everlasting regret, we proceeded with my cheap digital camera that I kept in my car.  We got to the bridge and I walked out to the center of the bridge and took about 20 some pictures. The sky was partly cloudy (25% cloud cover?) but mostly blue sky.  When I finished, I walked back to the other end of the bridge where my wife stood waiting. As I talked to her I noticed two grey spheres flying toward us from the East in tight formation, the one nearest us just above the other.  They flew at a constant speed and trajectory from East to West. I was so excited I forgot that I had a camera in my hand. I kept asking if my wife could see them, but she could not. By the time I finally got my composure, the objects had begun to pass behind an apartment complex in front of us. Unfortunately the next mistake I made was to switch my camera to the movie setting, not realizing that the resolution is so poor it would not pick up the objects. I took a short video which is completely useless.  I have seen many different aircraft in my 43 years on this planet, these objects defy conventional classification. They were not weather balloons, I have seen weather balloons. They were perfect spheres, metallic gray, but not too reflective.  I figured that the reason my wife did not see then was the glare. Despite the partial cloud cover that day, it was actually a very bright day, and I had polarized prescription shades on. As the objects passed through the sky the seemed light gray, as they passed in front of clouds they seemed darker. They disappeared on the Eastern horizon. From the time I spotted them to the time they reached the Eastern horizon was less then a minute.",
      "link": "http://www.nuforc.org/webreports/060/S60670.html",
      "state": "MN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6aaa",
      "summary": "bright light falling from sky",
      "city": "minneapolis",
      "shape": "fireball",
      "date": "2006-12-07T00:00:00",
      "story": "bright light falling from sky Very very bright light coming from the sky and falling toward the earth, it made no sound at all. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53482.html",
      "state": "MN",
      "duration": "1 Second"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b18",
      "summary": "A three-light object was observed hovering and moving above the Wells-Fargo Bldg. in downtown Minneapolis, MN",
      "city": "minneapolis",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "A three-light object was observed hovering and moving above the Wells-Fargo Bldg. in downtown Minneapolis, MN I saw what appeared to be a short object composed of three closely arranged amber lights  hovering over the Well-Fargo building in downtown Minneapolis.  This object had no colored lights as might be observed on a helicopter.  It moved back and forth to the  the opposite side of the W-F building at a very high rate of speed then disappeared behind the building.  I was observing this from the City Center Marriott.  A few minutes later the object reappeared above the south corner, rapidly moved to the north corner then disappeared completely.  I saw this same object again on June 4 during the approximate same time frame and it did much that same as it had on Monday night.",
      "link": "http://www.nuforc.org/webreports/063/S63831.html",
      "state": "MN",
      "duration": "15 - 20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ee6",
      "summary": "lighted object circling over Minneapolis, then makes a few dramatic directional changes and zooms away.",
      "city": "minneapolis",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "lighted object circling over Minneapolis, then makes a few dramatic directional changes and zooms away. I HAVE A VIDEO OF THE SIGHTING!   The object is a solid light source that appears to make a few horizontal circular paths, and then makes a few dramatic directional changes and then zooms away.  I could not hear any sound coming from the object/light (as you generally would with a plane).  There is a building in the background which can probably be used as a scale for the size/distance/speed.",
      "link": "http://www.nuforc.org/webreports/063/S63798.html",
      "state": "MN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6eed",
      "summary": "triangular craft with white lights at each point and dimmer lights in the middle.",
      "city": "minneapolis",
      "shape": "triangle",
      "date": "2008-04-17T00:00:00",
      "story": "triangular craft with white lights at each point and dimmer lights in the middle. While driving home from Salina, KS my radio went completely static for a about a minute (I tried several channels) and moments later I saw lights to my left (which was west) and I looked out my window and saw a craft that was triangular shaped. It had brighter white lights on each point and dimmer lights at the midpoint of each side.  It was very low to the ground, lower than any normal plane would be traveling and it made absolutely no sound. It was traveling south pretty slowly; I took my eyes off of it to look back at the road to check my driving when I looked back it had disappeared. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62496.html",
      "state": "KS",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b7952",
      "summary": "Glowing green object crosses Twin Cities at low altitude",
      "city": "minneapolis",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "Glowing green object crosses Twin Cities at low altitude I was driving home alone on westbound highway 36 in Roseville MN.  It was about 10:45 pm and I had just passed the Rosedale shopping mall when I glanced out the side window of my car.  I saw a craft emitting pale green light moving very quickly through the low clouds.  It was flying from east to west, toward downtown Minneapolis.  I watched it glide through the sky for a moment, but then I had to look back at the road to make a curve.  When I tried again to look for the light, it was gone.  Because of the low clouds, I could not fully make out what the object was.  At first I thought it was a small plane, but it instantly struck me as different because it did not behave like a plane.  Its pale green light was steady, not blinking.  And it was moving at a low altitude so quickly and steadily, in an impossibly-perfect straight line.  I have never seen any plane do like this.  And about 30 seconds after I saw this, my 17 year old nephew called me from St Paul MN on my cellular phone to tell me that he had just seen a UFO.  He described exactly what I had just seen--only he had gotten a better look at it.  He was sitting outside on his front step in St Paul, and the craft crossed the sky at low altitude, from east to west.  He saw the same pale green light passing in and out of the low clouds.  But he got a good look at the craft -- it was triangular shaped, like an arrowhead.  And the pale green light was coming from lights along the edges that were long, more like fluorescent light tubes than like bulbs that you would see on a plane.  And the craft was perfectly silent.  I believe my nephew and I saw the same craft, from vantage points about 10 miles apart, as it crossed the Twin Cities from St Paul to Minneapolis at low altitude. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52792.html",
      "state": "MN",
      "duration": "5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f9d",
      "summary": "While walking around Minnehah Park in Minneapolis Mn. I don't know what these are. I took these photos with a casio small digital camer",
      "city": "minneapolis",
      "shape": "oval",
      "date": "2009-12-12T00:00:00",
      "story": "While walking around Minnehah Park in Minneapolis Mn.  I don't know what these are. I took these photos with a casio small digital camera while shooting pitches of aircraft landing.  Time was around 1300-1500 cst ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71991.html",
      "state": "MN",
      "duration": "2 times"
    },
    {
      "_id": "64d005f478aba2ec5a3b8586",
      "summary": "UFO - Viewed From Downtown Minneapolis, MN",
      "city": "minneapolis",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "UFO - Viewed From Downtown Minneapolis, MN Observation location:  Across the street from Orchestra Hall, 1210 Marquette Ave., Minneapolis, MN, looking down Marquette Ave. toward the Wells Fargo and IDS Towers. Description:  Object was a light, appearing from this vantage point to be above the Wells Fargo Tower.  The taller IDS Tower is located to the left of the Wells Fargo Tower, the object would typically move slowly from the right of the Wells Tower, left above the top of the Wells Tower, and continue further to the IDS Tower, and would go out of view behind the IDS Tower.  The object would come from behind the IDS Tower back over the Wells Tower, then move to the right beyond the Wells Tower, and back again. The object sometimes performed fast complete loops in the air, would abruptly stop, and would drift slowly once again.  Sometimes the object would change direction abruptly moving up, down, sideways, or diagonally at a high rate of speed, sometimes instantaneously changing direction at a high rate of speed several times before abruptly stopping and then beginning to drift again.  There were times when the object would appear to hover without moving for up to a minute.  On at least two occasions the object quickly, at a high rate of speed, darted down at a diagonal between the towers toward the ground, covering two thirds the height of the Wells Tower in perhaps one half second.  There were times when the object would go dark and reappear several seconds later, sometimes at the same, sometimes at a different location.  There were times when the object would become dim, then brighter.  There were times when the object would appear to pulsate in intensity.  The second witness, ! a woman who stopped to watch, stated that the object changed colors. Luminosity:  Variable, from dark to dim, but often about as bright as Jupiter would appear in a dark sky.  Note that downtown Minneapolis is highly lit at night, as is the Wells Tower itself. Other:  The aircraft obstruction light on the antenna mast at the top of the IDS Tower functioned normally during the entire observation.  Several large commercial aircraft, apparently on approach to MSP International, made typical runs across the general area appearing to be at a higher elevation than the object observed.  There was an advertising searchlight scanning the sky in Minneapolis that night but it had no effect upon the observation of this object.  I observed the light for twenty five minutes, left and returned twenty minutes later to find the object still presenting itself as before.  I left and returned once again thirty minutes after the second observation and could observe no trace of the object. Opinion:  This was not a conventional aircraft, helicopter, or bird.  The abrupt stops, instantaneous change of direction, zig-zagging, and fast rates of speed, loops, and abrupt stops are inconsistent with such explanations. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72517.html",
      "state": "MN",
      "duration": "25 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8dc7",
      "summary": "Very bright light under clouds that isn't moving.  ((NUFORC Note:  Venus, sighted through overcast?  PD))",
      "city": "minneapolis",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Very bright light under clouds that isn't moving. Very bright light shining in western sky about 45 degrees up. There is a haze of light cloud cover, and no stars or celestial bodies visible. Light seems to be just below clouds. There is a slight haze around the light, which could be due to the haziness of the clouds. A couple low-flying airplanes have passed below it. It is not moving like a plane, but seems to wobble a little bit and light changes intensity, yet is very very bright. First explanation is that it could be Venus, but that would be lower to the horizon than this light. A friend with a telescope says he saw one bright light with 2 smaller lights on it too. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Venus, sighted through overcast?  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68291.html",
      "state": "MN",
      "duration": "1 hour+"
    },
    {
      "_id": "64d005f478aba2ec5a3b9273",
      "summary": "triangle shape air craft",
      "city": "minneapolis",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "triangle shape air craft the triangle shape speed off very fast and then it was gone",
      "link": "http://www.nuforc.org/webreports/065/S65881.html",
      "state": "MN",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b95f1",
      "summary": "disc shaped craft seen over kenwood neighborhood Minneapolis",
      "city": "minneapolis",
      "shape": "disk",
      "date": "2010-05-12T00:00:00",
      "story": "disc shaped craft seen over kenwood neighborhood Minneapolis I took my dog outside to use the facilities and all of a sudden a low flying Shape caught my eye.  I was concerned because it was very low and I thought Maybe a plane was having trouble and was going to crash.  To my surprise, It slowly rose straight up into the air.  No noise at all.  Dogs starting barking On the block.   It  flew overhead about 50 feet over the tallest tree.  Very slowly. It had a formation of lights on the bottom.  It was almost like an upside down Wok With a row of white lights in the middle and four red lights in each corner.  I stood And watched it quietly proceed to the highway.  No sound at all!  Afterwards\t When I came in, my hands had a burning smell to them and my fingers tingled. I have no idea why! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75046.html",
      "state": "MN",
      "duration": "five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9913",
      "summary": "Large trinagular craft spotted over Mpls, MN in 1975",
      "city": "minneapolis",
      "shape": "triangle",
      "date": "2008-07-05T00:00:00",
      "story": "Large trinagular craft spotted over Mpls, MN in 1975 In either late '75 or early (jan-mar) '76 my husband and I were driving through a neighborhood known as North Minneapolis. I was in the passenger seat.  My husband suddenly hit the brakes and exclaimed \"What the hell is that?\".  He had stopped where a large elm tree blocked my view and he moved forward.  When he did I looked to my left and saw about 100 feet above the houses, a large triangular craft.  it was moving in parallel to us but in the opposite direction.  While I kept the craft in view my husband went the short distance to the end of the block and turned the corner to follow it.  I do not recall any lights, the craft was a medium gray and from what I could perceive the only way we were able to see it at all was that it was so close to the ground the street lights were illumination the bottom.  I looked specifically for any openings for landing gear etc but the bottom was smooth.  It was winter so the windows were rolled up and the heater was on so I dont know that it made any sound.  As we followed it down the block it appeared to be moving at no more than 10 miles and hour.  I looked to see if lights were going on and if people were coming out of their homes but did not see any unusual activity.  We did turn another corner to keep it in sight and that is when I saw what I call an army jeep with a young blond bespectacled male soldier standing outside the jeep with one hand on the steering wheel, the other on the door and one foot just on the inside of the car.  He was also staring at the craft. As we passed him I looked at his face but he did not seem to notice us.  I observed that the craft was accelerating and told my husband to drive faster. With a sudden burst of speed the craft was gone.  I dont know if it moved away from any light source and so became impossible to see but it did seem to me that it simply vanished.  We tried to continue in the direction in which the craft was headed and came to a point where we could see a bridge crossing the Mississippi.  I felt that if any! one on t he bridge was seeing it that traffic would come to a halt but this did not happen.  He is now my ex-husband and about 25 years after this happened I asked him if he remembered what we saw.  He remembers that the craft had lights and that there was more than one military vehicle at the scene.  I know that people use football fields as a measure but I am not familiar with the size of football fields so I can only tell you that it measured the length of three small single family homes driveways included.  I did not report it to the police as my then husband feared ridicule but I have always been curious as to whether others saw the same thing that night.  I have run into many people who did not strike me as mentally stable who are involved in such organizations as MUFON and so when I say you on a news program I thought perhaps you were the person to report this too. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64203.html",
      "state": "MN",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ed9",
      "summary": "A amber light with a surrounding halo was hovering above Wells Fargo Center for approximately 5 minutes on 3 separate occasions.  It wo",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2010-06-03T00:00:00",
      "story": "A amber light with a surrounding halo was hovering above Wells Fargo Center for approximately 5 minutes on 3 separate occasions.  It would fly over near by buildings and would streak across skyline and disappear.   Several patrons on nearby rooftop bar saw same object and tried to film.   As I'm typing this it just came back near the same area downtown.",
      "link": "http://www.nuforc.org/webreports/075/S75598.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f95",
      "summary": "UFO over mpls 5/28/2010.  ((NUFORC Note:  Possible sighting of Venus??  PD))",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2010-06-03T00:00:00",
      "story": "ufo over mpls 5/28/2010 over the Wellsfargo building in minneapolis minneasota. i have video of this with my digital camera. it hovers in an irregular pattern and the begins to change direction quickly and very sharply. its not a helicoper or plane. then after it seems to sharply change direction it shoots off in a direction very very fast. then 5 min later it comes back and does the same thing. i also noticed it following a commercial jet that seemed to fly very low and not in a normal patter right over the city on mpls. ((NUFORC Note:  Possible sighting of Venus??  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75603.html",
      "state": "MN",
      "duration": "60 min so far"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ffb",
      "summary": "A large, green, glowing ball of light moved from West to east in a sharp downward angle across the southern horizon.",
      "city": "minneapolis",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "A large, green, glowing ball of light moved from West to east in a sharp downward angle across the southern horizon. At approximately 01:40 I saw a large, green, glowing ball of light move from West to east in a sharp downward angle across the southern horizon.",
      "link": "http://www.nuforc.org/webreports/067/S67603.html",
      "state": "MN",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba169",
      "summary": "light moved from the nnw to the ssw then changed direction sharply and headed nnw, diffuse red in color.",
      "city": "minneapolis",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "light moved from the nnw to the ssw then changed direction sharply and headed nnw, diffuse red in color. While stargazing on May 25, 2009 at 12:45 A.M. I saw a light move from the north northeast, just above Vega, to the south southwest, in between Vega and Arcturus.  I thought it was a shooting star but then it abruptly changed directions and headed north northwest.  It was slightly red in color and slightly diffuse.  In all my years at looking at the sky I have never seen anything like this!  Although I am still skeptical, this sighting deserves a report.",
      "link": "http://www.nuforc.org/webreports/070/S70183.html",
      "state": "MN",
      "duration": "7sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba44e",
      "summary": "Bright star like objects",
      "city": "minneapolis",
      "shape": "light",
      "date": "2009-08-27T00:00:00",
      "story": "Bright star like objects I woke up to smoke a cig. a little after 4 am. I seen a star like object moving slow in the sky at some points it would speed up. It was also going dim then bright as it zig-zagged in the sky. it seemed real close to the ground and it made no sound it was really quite. It all lasted for around ten minutes till I lost it in the trees. As I lost that one I noticed another larger one. Same thing a large star like object real close to the ground but just hovering doing the same thing getting dim then real bright at times. Rare but true. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71825.html",
      "state": "MN",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba497",
      "summary": "strange white lights  ((NUFORC Note:  Possible advertising lights?  PD))",
      "city": "minneapolis",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "3 strange white lights moving in a concentric circular pattern then merging and seperating ..it was a very wide field of seperation before they would merge ..due to the duration of time and the place where i live and the time i saw this i rule out any spotlights ..this is what i first thought it was ..im not drunk or on any drugs ...it was quite odd ((NUFORC Note:  Possible advertising lights?  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69114.html",
      "state": "MN",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3ba485",
      "summary": "Flashing triangular lights over North Minneapolis New Year's Eve 12/31/08",
      "city": "minneapolis",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Flashing triangular lights over North Minneapolis New Year's Eve 12/31/08 Seen hovering over Mary's Place Shelter for approximately 15 min.  Triangular shape with red light on top middle section with lights on each side ad flashing bluish light at approximately 30 degrees from the center.  Gradually shifted and turned then faded as if moving up.   Cloudy cover hindered clear sighting but witnesses observed shifting and fading of phenomenon.",
      "link": "http://www.nuforc.org/webreports/067/S67764.html",
      "state": "MN",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3bba43",
      "summary": "a oval ring of 11 light sources. seen for about 15 mins , taken shots of the sighting",
      "city": "minneapolis",
      "shape": "oval",
      "date": "2010-07-28T00:00:00",
      "story": "a oval ring of 11 light sources. seen for about 15 mins , taken shots of the sighting",
      "link": "http://www.nuforc.org/webreports/076/S76824.html",
      "state": "MN",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0d6",
      "summary": "Two orbs emitting no light moving together until one starts to circle the other then attach themseleves.",
      "city": "minneapolis",
      "shape": "sphere",
      "date": "2011-12-12T00:00:00",
      "story": "Two orbs emitting no light moving together until one starts to circle the other then attach themseleves. Me and a friend were on the roof of an office building 20 stories tall in downtown Minneapolis just talking and looking up at the surrounding skyscrapers when something caught the corner of my eye.   I seen what appeared to be two orbs or spheres that were side by side just floating along.  I thought maybe they were just balloons or something.  I took another look and realized just how far away they were and then one started to circle the other in a clockwise motion.  After circling a few times they seemed to attach themselves to one another and we just watched until we could no longer see them.  These objects did not emit light and I believe the only reason we could see them was because of the city lights and the full moon.",
      "link": "http://www.nuforc.org/webreports/085/S85255.html",
      "state": "MN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc75a",
      "summary": "Round white object over Minneapolis that disappeared",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2011-08-21T00:00:00",
      "story": "Round white object over Minneapolis that disappeared Sitting in the back yard near Lake Nokomis, I looked up at the sky and saw a circular-shaped white object moving in a straight line west to east.  It was not a jet or any other kind of plane, not even close--just a white circular object.   It was very distant, but if I were to hold up something to compare it to, it would have been about the size of a dime from my perspective.  It was moving rather slowly and in a very steady, straight line.   I turned to my friend to ask him, \"What is that?\" and when I turned back to the sky one second later to point at it, the object was gone.  Completely disappeared, and I had a wide view of the sky.   There are always a lot of airplanes taking off over this neighborhood, which is near the MSP Airport, but this was not plane-shaped and it flew much higher: a jet at 30,000 feet or so reflecting light would not be as large and would not look like a white ball.",
      "link": "http://www.nuforc.org/webreports/083/S83041.html",
      "state": "MN",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc7f",
      "summary": "Report.",
      "city": "minneapolis",
      "shape": "other",
      "date": "2011-07-04T00:00:00",
      "story": "Report   I called about a month ago to report what appeared to be three strange lights visible in the night sky that myself and a few neighbors noticed at about 3 am for a few nights consecutively.  I could make out three lights in what i would say were in a formation with the center light blinking rapidly.   It was obvious to me that these lights did not originate from any aircraft known to me i automatically called 911 and was told there were other confirmed reports of these lights as well as my own report.   It has been a month now and i have experienced lapses in time between the hours of 3 am onward and after a few strange dreams i woke up with a numbness in my right hand.  This IS NOT an attempt to hoax.   I am very frightened to have discovered an object about a half centimeter underneath the skin of my right thumb (second knuckle) and i have no recollection of having ever noticed it before.  I dont know what to make of it.   I am going to go to a hospital to arrange for it to be removed.  The object is dark and from what i can see about the size of an apple seed.   I can see it because of its dark color and closeness to the surface of my skin but it is an object that I can feel by pushing down on the area.   I dont know what this is but it was never there before all of these strange incidents began to occur.   I have not seen the lights since my last report",
      "link": "http://www.nuforc.org/webreports/082/S82092.html",
      "state": "MN",
      "duration": "unkown"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0b0",
      "summary": "I was in uptown Minneapolis near the Ice House and got video of 6-8 bright orange lights floating across the sky.  Several people on th",
      "city": "minneapolis",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "I was in uptown Minneapolis near the Ice House and got video of 6-8 bright orange lights floating across the sky.  Several people on the streets stopped, looked and discussed what they possibly could be.   I don't think there was a chinese lantern festival in the area, so not sure what else they could be... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92024.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0d3",
      "summary": "Orange objects over south Minneapolis sky",
      "city": "minneapolis",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Orange objects over south Minneapolis sky As a friend and I sat on a patio, we saw first three objects in a triangular formation move slowly across The Sky.  These faded out, and then two more Of these objects appeared. They were heading south towards The airport, and towards The military training facility located near The airport. There were several airplanes In The Sky much lower than these objects In altitude.  The second set faded out and there appeared To be a very quickly moving aircraft flying toward where The objects had faded out but much higher In altitude as well With purple and green blinking lights. I have a recording Of The set Of two objects. The objects were orange In color and appeared To be circular.",
      "link": "http://www.nuforc.org/webreports/092/S92069.html",
      "state": "MN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4d8",
      "summary": "Craft over wells fargo building",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "craft over wells fargo building   craft with light hovering apox. 50 feet into the air. about 6 lights. hovering ove wells fargo building. tilted. seen from 35 w bridge ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88564.html",
      "state": "MN",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bd9c7",
      "summary": "6 orange fireballs flying quickly above Minneapolis.",
      "city": "minneapolis",
      "shape": "fireball",
      "date": "2012-08-19T00:00:00",
      "story": "6 orange fireballs flying quickly above Minneapolis The fireballs flew steadily and quickly from West to East in the North sky in Minneapolis.  They were incrementally spaced, flying the same speed and in the exact same direction. I saw six, but another witness drew my attention to them.  He may have seen more;  They were orange, round and seemed to occasionally flicker.",
      "link": "http://www.nuforc.org/webreports/091/S91492.html",
      "state": "MN",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be0a1",
      "summary": "V-shaped stealth aircraft",
      "city": "minneapolis",
      "shape": "other",
      "date": "2012-09-24T00:00:00",
      "story": "V shaped stealth aircraft The aircraft had 4 lights, one in the apex of the V shape and the other on the front and side wings. It was moving slowly and then turned abruptly, you could not hear anything, so it was in stealth mode or using some sort of quiet engine.  After turning it flew in the same direction and eventually the lights went out and we lost sight of it.  The craft itself looked metallic grey and the light in the apex was red while the other ones were regular light.  I could make out the V shape because there was nothing connecting the wings together which is why I found it odd in the first place.",
      "link": "http://www.nuforc.org/webreports/093/S93046.html",
      "state": "MN",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be12c",
      "summary": "Objects Generating Intense Burst Of Light And Disapear",
      "city": "minneapolis",
      "shape": "unknown",
      "date": "2012-07-04T00:00:00",
      "story": "Objects Generating Intense Burst Of Light And Disapear My sightings have been over the past year and it usually involves 1 object at a time. I regularly watch the skies for moving lights and can tell the difference between satellites and other objects.  Over the last year,  early in the morning  when the skies are clear I have witnessed individual lights moving in a pattern inconsistent with any satellites; usually diagonal across the sky instead of North to South or East to West.  Some of the objects are brighter than any stars and do not blink. Some blink very brightly without a consistent pattern.  What is most puzzling is that I have followed these objects across the sky and then suddenly there is an intense flash and it disappears.  It reminds me of Star Trek when a ship jumps to light speed.  My background: I have worked in IT Security, Legal and Compliance for many very large corporations for the past 22 years.",
      "link": "http://www.nuforc.org/webreports/090/S90149.html",
      "state": "MN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be51e",
      "summary": "About a dozen strange silent orange lights in a formation flew slowly over the night sky in Minneapolis, MN",
      "city": "minneapolis",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "About a dozen strange silent orange lights in a formation flew slowly over the night sky in Minneapolis, MN I saw these strange orange lights flying in the sky. We live near an airport and these were NOT aircraft. There were too many of them in a row and too close to each other.  Aircraft would never fly that close together except perhaps the military. An aircraft did fly lower than the lights as we watched and looked nothing like these lights.  Soon after the lights passed us it started to rain. They were moving over our apartment building, probably like 12 of them, and were staggered, ad much larger lights than any aircraft I've ever seen, and weren't flying always in a straight line but instead a general direction.  They made no noise at all and eventually vanished in the distance. I took some pictures of the event which can be seen here: http://imgur.com/a/sdJNQ#0",
      "link": "http://www.nuforc.org/webreports/091/S91933.html",
      "state": "MN",
      "duration": "3 - 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be5bd",
      "summary": "Red Lights over Minneapolis",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2012-05-29T00:00:00",
      "story": "Red Lights over Minneapolis On Saturday evening around 9:00 pm, we saw 12-15 glowing red lights floating across the sky.  They were moving in a northern to southern direction.   We were looking east toward the MSP airport.",
      "link": "http://www.nuforc.org/webreports/089/S89070.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be5bf",
      "summary": "I saw 3 blinking red lights that blinked from bright red to white in a triangle formation flying south at same speed. It was silent and",
      "city": "minneapolis",
      "shape": "triangle",
      "date": "2012-05-29T00:00:00",
      "story": "I saw 3 blinking red lights that blinked from bright red to white in a triangle formation flying south at same speed. It was silent and low flying.  It flew behind trees so blocked my view then it was gone",
      "link": "http://www.nuforc.org/webreports/089/S89073.html",
      "state": "MN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beaa4",
      "summary": "A couple driving to the north toward Duluth witness a disc-shaped object cross the road in front of them.",
      "city": "minneapolis",
      "shape": "disk",
      "date": "2012-02-10T00:00:00",
      "story": "A couple driving to the north toward Duluth witness a disc-shaped object cross the road in front of them.  Sighting occurred during daylight hours, at 11:42 a.m. on January 31st, 2012. Telephoned Report:  A man and wife called to report have witnessed a disc-shaped craft cross the road in front of their automobile, as they drove from Minneapolis to Duluth.  It was so close, they reported, that they could see various details on the exterior surface of the craft. The object crossed the road in front of them, and then disappeared behind trees to their right.  Then, a short time later, it appeared again, traveling in a different direction.  It disappeared from their sight a second time, and then reappeared, providing them with a third sighting of the strange object. The couple were traveling north, and were approximately 2 hours' drive south of Duluth. The witnesses will submit their own report, sometime in the near future.  Their ability to write a report has been delayed by a death in their family.  They will submit a report, once they return to their home.",
      "link": "http://www.nuforc.org/webreports/087/S87131.html",
      "state": "MN",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bec5b",
      "summary": "Bright red light/s, no noise, moving moderate speed and low in east sky, moving south to north.",
      "city": "minneapolis",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Bright red light/s, no noise, moving moderate speed and low in east sky, moving south to north I don't know how to cut and paste, sorry.  July 4 2013 about 2230 at night looking to east sky after fireworks display downtown, I saw red light or lights moving moderate speed and low moving from south to north.  I live one block from highest spot in Mpls.  Red lights appeared lower than my position.   Approx over St Anthony Village east of me.  There was no noise whatsoever.  Clear night.   I ran up my alley looking at it/them through the trees and they disappeared, they must have increased speed.  I told my wife and child what I saw immediately.  I came by this web site by accident and found other reports similar to mine so I am posting this here now.  They could be domestic, nazi, hollow earth type, or other alien type.  I've found tons of info out there on regular web sites. Good luck in your efforts.     P.s. the time reported is approx.  I think the object/s were no more than 100 to 200 feet in air. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101580.html",
      "state": "MN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf44d",
      "summary": "Orange/reddish circle object NE mpls flying below strom cloud near down town mpls.",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2013-10-14T00:00:00",
      "story": "Orange/redish circle object NE mpls flying below strom cloud near down town mpls. me and my 3 other friends sitting on deck  in Ne east Mpls by Castoffs-Oktoberfest while on the 2 floor deck to out s object was in a glowing orange-ish litt redin it glowing & moving weird  below the storm clouds going toward n mpls closer to down town mpls   No way any one could admit here that it was any but an object of size that was not normal behavior of human or know flying object that we have today.",
      "link": "http://www.nuforc.org/webreports/103/S103003.html",
      "state": "MN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc8b",
      "summary": "Silent v-shaped objects with dim blue lights flew north over downtown Minneapolis",
      "city": "minneapolis",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "Silent v-shaped objects with dim blue lights flew north over downtown Minneapolis My boyfriend and I were laying on the Gold Medal Park hill gazing at the sky, when he suddenly pointed out a white banner flying silently in the sky over the eastern side of downtown Minneapolis.  It was partially invisible, and had a weird hazy glow.  You could almost describe it as a kite-looking object. About 5 minutes later, my boyfriend and I saw a triangle of lights, two red and one yellow, flying in a half circle before disappearing. The last sighting, I, along with people atop of the hill, saw another v-shaped object. It was closer, much larger, black in color, and had numerous small, very dim, and blue lights on the bottom of it.  Still, it was silent, and moved in ways different than a jet plane.  It, too, was flying north on the eastern side, right over the Mill Ruins and the Mississippi River.",
      "link": "http://www.nuforc.org/webreports/097/S97421.html",
      "state": "MN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0245",
      "summary": "Moving red spheres in sky.",
      "city": "minneapolis",
      "shape": "sphere",
      "date": "2013-07-05T00:00:00",
      "story": "Moving red spheres in sky My boyfriend and I were walking around the neighborhood looking for fireworks when we spotted red balls of lights in the sky. We knew they weren't fireworks because the lights didn't fade out.  They seemed to be moving in batches.  At first we saw about 3 or 4 moving separately across the sky, much faster and swifter than an airplane moves.  Then one by one they would disappear into the sky.  I'm not sure of the exact direction they were going, but I can verify that these lights were moving horizontally across the sky, like the same way a plane would...only much faster.  We then saw a few other groups. All of the moving lights were spread pretty far apart, but appeared to be going in the same direction. I attempted to record one with my phone, but the quality isn't nearly as good as I would've liked it to be.",
      "link": "http://www.nuforc.org/webreports/099/S99648.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0488",
      "summary": "Orange/blue light-ball cluster over downtown Minneapolis 1/17/13.",
      "city": "minneapolis",
      "shape": "formation",
      "date": "2013-02-04T00:00:00",
      "story": "Orange/blue light-ball cluster over downtown Minneapolis 1/17/13 Leaving a Minnesota Timberwolves game in downtown Minneapolis at approx. 9:45-10:00 PM January 17th, 2013, and walking south, my friend and I noticed strange lights in the sky.   There appeared to be about 5 large orange lights and maybe 4 smaller blue lights, all in a small cluster.  The lights appeared to be above a light layer of clouds, very high in the sky.   Currently, the clouds are 9000 feet in the sky, and wind is moving 5 mph from the southwest (currently one hour later).   The lights were not moving, and appeared to make “smear” like shapes in the sky (especially the orange lights).   There were about 3 other witnesses that we pointed out the lights to that were also stunned by the lights.  The lights eventually faded out after about 15 minutes.   We were not able to see any stars or anything else in the sky.  The shapes were circular to oval, and appeared “smeared” (maybe due to cloud cover).   Spotlights were shining into the sky from downtown Minneap! olis (due to clubs/bars), and as the lights hit the orange balls, the balls would seem to quickly illuminate from the light reflection.   We have a good picture that shows what we saw as well.",
      "link": "http://www.nuforc.org/webreports/096/S96012.html",
      "state": "MN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a23",
      "summary": "I was standing near the corner of Washington and Oak St in Minneapolis, MN and noticed a long perfectly straight beam of like about 50m",
      "city": "minneapolis",
      "shape": "other",
      "date": "2014-01-10T00:00:00",
      "story": "I was standing near the corner of Washington and Oak St in Minneapolis, MN, and noticed a long perfectly straight beam of like about 50m long; just above the bottom of the cloud cover.  There happened to be a spotlight from a local business circling the night sky and whenever the spotlight passed across the beam of light there was, what looked like, a reflected pulse of light bouncing off perpendicular to the light beam.   See linked video, this happens at about the 10 second mark (sorry for the background noise, I was waiting at the bus stop).   I watched this for a good 10 mins and the object didn't move, and each time the spotlight passed over it I saw the reflected light. https://drive.google.com/file/d/0B1VabPXMI1Q_aFNGLTBRZzVZeDA/edit?usp=sharing ((NUFORC Note:",
      "link": "http://www.nuforc.org/webreports/105/S105773.html",
      "state": "MN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c13d8",
      "summary": "Bright light almost  like a bright star with bright light luminating.  ((NUFORC Note:  Venus?  PD))",
      "city": "minneapolis",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "Bright light almost  like a bright star with bright light luminating It looks like a bright light almost with star like um it says she'll it has to sit still for over an hour please have come by jets not sure what's going on but something maybe that explains the noises we here.",
      "link": "http://www.nuforc.org/webreports/104/S104121.html",
      "state": "MN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b93",
      "summary": "A fireball/spherical kind of orange glove floating and it's July 4th but it's no mere firework.",
      "city": "minneapolis",
      "shape": "fireball",
      "date": "2014-07-05T00:00:00",
      "story": "A fireball/spherical kind of orange glove floating and it's July 4th but it's no mere firework One would thing this orange fireball/globe was a firework but it just kept moving north never exploding or making noise it was moving at a steady pace at first we glanced and saw it and were like cool then 10 seconds past then 20 before we knew it a person said that's not fireworks we watched it leave our sight in 10 minutes I always used to shrug people on this website as conspiracy theorist but now I know there's something out there and it's not an airplane a balloon a cheap firework, but something of the unknown",
      "link": "http://www.nuforc.org/webreports/110/S110954.html",
      "state": "MN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c266c",
      "summary": "Flying wing shaped craft, with no lights or sound moving north to south in the sky.",
      "city": "minneapolis",
      "shape": "other",
      "date": "2014-11-06T00:00:00",
      "story": "Flying wing shaped craft, with no lights or sound moving north to south in the sky. At approximately 22:15, I saw  The silouette of what appeared to be be a flying wing shaped craft with no lights and no sound, move north to south across the sky, before fading out of sight.",
      "link": "http://www.nuforc.org/webreports/114/S114781.html",
      "state": "MN",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e53",
      "summary": "UFOs (?) discovered in pictures taken in broad daylight on sunny afternoon.  I only saw the objects after downloading the pics.",
      "city": "minneapolis",
      "shape": "formation",
      "date": "2014-09-10T00:00:00",
      "story": "UFOs (?) discovered in pictures taken in broad daylight on sunny afternoon. I only saw the objects after downloading the pics. I did not observe these craft at the time of the incident, but only saw late them in photos I took (two photos 3 seconds apart).  I was out taking photos at a park near my home. It was a sunny afternoon and I took some pics of the sun behind a large tree and a commercial jet making a contrail next to tree (visually speaking). I did not notice several small shapes to the right as I was focused on the tree when taking the pictures. My camera is an iPhone 5s. I can send you the picture setting details if that helps.  So, I took two photos where the objects appear. They were taken 3 seconds apart, but, the objects have changed shape and are apparently further away and in a different area of the sky (you can see this in the two photos). I have enlarged these images and looked at them from different angles and experimented with changing the contrast and sharpness of the pics. You can judge for yourself but so far I have not been able to debunk them as balloons or Chinese lanterns or conventional aircraft. To me the second picture has even more oddness to it in several respects.  If these are UFOs, my impression is that they are possibly trans-dimesional, based on the shape changes and the difficulty deterring the exact shape of the objects (edges are a bit fuzzy for example). I would interested in hear what you think.",
      "link": "http://www.nuforc.org/webreports/113/S113417.html",
      "state": "MN",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c31fd",
      "summary": "At approximately 22:14 Central Time, I witnessed a bright-orange, orb-shaped object float across the eastern sky of Minneapolis.",
      "city": "minneapolis",
      "shape": "fireball",
      "date": "2015-04-03T00:00:00",
      "story": "At approximately 22:14 Central Time, I witnessed a bright-orange, orb-shaped object float across the eastern sky of Minneapolis. A film of the object may be viewed here:   https://www.youtube.com/watch?v=JdqZcBEZSTc",
      "link": "http://www.nuforc.org/webreports/118/S118149.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c323b",
      "summary": "Two objects near downtown Minneapolis, a third comes to call them away.",
      "city": "minneapolis",
      "shape": "sphere",
      "date": "2015-03-13T00:00:00",
      "story": "Two objects near downtown Minneapolis, a third comes to call them away. I was on the rooftop bar of The Solara, a resturant in downtown Minneapolis, MN, with my entire family one evening.  We were sitting at a round table, I was facing out toward the city, and I could see most of the towers in the city.  I was visiting with my family and looking out at the buildings, when I saw a yellow/gold object kind of glide out from behind the tower I was looking at. The way it moved almost looked like it was floating on water or something as it came in and out of view from behind this skyscraper.  Just really smooth hovering, gliding, deliberate motion.  It was coming out from the left side of the building and going back behind it.  It never crossed to the other visible side of the building kept coming out the left side.  It did this over and over for a minute. The distance was a mile away I would guess.  It did not look very large.  This object did this for a couple minutes until another object came into view.  Almost looked like it appeared, or went from very small to visible, or like it came from far away into view to look just like the first one my family and I have been watching now for a few  minutes. Remind you, this rooftop was completely full, but I didn’t see anyone else looking at it, but we were.  The two objects stayed for another 30 seconds or so, kind of hovered around a bit until a 3rd object came down, almost like it was telling the other 2 to come back. I saw all three there for about 8 seconds, the third a bit smaller because it was further away, until all three took off.  When they took off they got smaller and smaller like they flew away very, very quickly.  They didn’t just disappear. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117652.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c32fa",
      "summary": "2 orange red objects appeared as flames one after the next.",
      "city": "minneapolis",
      "shape": "unknown",
      "date": "2015-03-13T00:00:00",
      "story": "2 orange red objects appeared as flames one after the next. 3 people saw 2 objects flying across the sky flying east.  Appeared to be reddish orange flames. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117622.html",
      "state": "MN",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3348",
      "summary": "Object in sky with two cone lights shining down.",
      "city": "minneapolis",
      "shape": "disk",
      "date": "2015-03-20T00:00:00",
      "story": "Object in sky with two cone lights shining down. While driving east on 694 I saw this craft.  It looked like an elongated egg with two bright white lights on the bottom (shaped like 2 snow cones), pointed toward the ground.  I followed it as I drove to work.  The object was moving in the same direction as me, but was ahead of me.   I took my cell phone and took three photos of this event.  When I got to work, I looked at the photos and enlarged them.  I was shocked at the clarity and of what the camera showed.  It is a disk shaped object with lights.  Very clear, not a plane or helicopter.",
      "link": "http://www.nuforc.org/webreports/117/S117816.html",
      "state": "MN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b80",
      "summary": "Three balls of light seen moving east over industrial area of NE Minneapolis-St. Paul.",
      "city": "minneapolis",
      "shape": "light",
      "date": "2015-08-06T00:00:00",
      "story": "Three balls of light seen moving east over industrial area of NE Minneapolis-St. Paul It was a sunny and mostly clear day. As we were looking north, we witnessed three balls of light heading east. Two were fairly close to each other, and one lagged quite a bit behind. Objects were visible for about two minutes, moving at a leisurely pace. Plenty of planes fly over.  Not planes.",
      "link": "http://www.nuforc.org/webreports/120/S120848.html",
      "state": "MN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c410e",
      "summary": "Red square object with light in center  flying across sky north to south over mississippi river",
      "city": "minneapolis",
      "shape": "rectangle",
      "date": "2015-05-13T00:00:00",
      "story": "Red square object with light in center flying across sky north to south over mississippi river. Me and wife were going to garage when we observed it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118917.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4732",
      "summary": "Object in East Minneapolis sky shoots into view of my window horizontally, stops dead, shoots upward seemingly into space.",
      "city": "minneapolis",
      "shape": "oval",
      "date": "2015-11-06T00:00:00",
      "story": "Object in East Minneapolis sky shoots into view of my window horizontally, stops dead, shoots upward seemingly into space. Object flew into my peripheral vision in the East sky (from Downtown Minneapolis).  I realized it was not a plane, as it was moving too quickly, and that it was not a bird as it looked to be too far away and was flying too straight.   As I turned my head to focus on the object it stopped dead and shot off and incredible speed, seemingly upward into space.   The object was far away, oval in shape, and I couldn't tell what color it was.  There was no sound and I didn't notice any environmental effects.   I was basically just laying on my couch watching television when I noticed it out the window to my left.  It frightened me.",
      "link": "http://www.nuforc.org/webreports/123/S123348.html",
      "state": "MN",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4adc",
      "summary": "White, illuminating ring around 3-4 blocks in circumference.",
      "city": "minneapolis",
      "shape": "other",
      "date": "2015-08-27T00:00:00",
      "story": "White, illuminating ring around 3-4 blocks in circumference. On August 9th, 2015, around 10pm, I went out onto my balcony with my boyfriend.  We sat down and we were having a conversation when he told me to check out the ring of light off to the south. I looked over and saw what he was talking about.  At first I thought that some business must be projecting lights into the sky to draw attention. When I said that to him, he said, “Just look at it.  If it was a business projecting that light, wouldn’t you be able to see the beams coming from below?”   I sat there for a moment and watched this ring. I looked over at my boyfriend and asked him if he thought that the ring seemed to be moving closer to us.  He agreed with me.  As we sat and watched this ring, I noticed that it seemed to be illuminating from inside the ring.  I went in and got my phone so I could take a photo and hope to capture the light.  I came back out and started to take photos.  Unfortunately, the photos do not show the enormity and brightness of this ring.   I live close to an airport, and was able to take a photo of a plane flying near this illuminating ring.  The longer I sat and looked at the ring, the more I convinced myself that there had to be a logical explanation for it.  This ring of light lasted for more than an hour and I am still shaking my head trying to figure out what it was. ((NUFORC Note:  Suspected advertising lights at a local casino.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121121.html",
      "state": "MN",
      "duration": "60-90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ac1",
      "summary": "Regarding the report of a ring of lights on this date-- A witness reported this sighting on reddit's r/ufos. I discussed this sighting.",
      "city": "minneapolis",
      "shape": "",
      "date": "2015-09-11T00:00:00",
      "story": "Regarding the report of a ring of lights on this date--A witness reported this sighting on reddit's r/ufos.  I discussed this sighting with the witness and witness mentioned a friend suggested these were the lights from Mystic Lake Casino, which can be seen from many miles away.  I later contacted Mystic Lake to ask them how many lights they have.  They stated that they have 12 lights on their roof.  I believe this explains the sighting.  I'd be happy to forward their email reply if you like.  You can contact me at:  ((address deleted)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121705.html",
      "state": "MN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c4b13",
      "summary": "Source of halo of lights seen over Minneapolis Area  ((NUFORC Note:  We agree.  The lights probably were from the casino.  PD))",
      "city": "minneapolis",
      "shape": "",
      "date": "2015-08-27T00:00:00",
      "story": "Source of halo of lights seen over Minneapolis Area ((NUFORC Note:  We agree.  The lights probably were from the casino.  PD)) I am submitting this in response to the report about the halo of lights seen by multiple people in the Minneapolis area on or around the date of August 9, 2015.  I heard about the sightings last night (8/13/15) on Coast to Coast AM, and, since I live in the Twin Cities area, I was of course very interested in these sightings and went to your site to view the photos and read the reports. Upon viewing the pictures, I could not figure out what the lights might be from, nor could my husband.  We were both very intrigued. Later today, however, as luck would have it, I was perusing various Facebook pages dedicated to another (local) interest of mine, namely the musical artist, Prince.  When I saw the photos on your site of the halo of lights, it didn't jog my memory about a particular photo that was posted to Prince's band's official Twitter on that same night of the other reports of the halo:  August 9, 2015.  But one of the Facebooks I saw today had posted the photo and well...I think I have an answer for you as to the source of that halo of lights. Here is the link to the Tweet and photo posted to Prince's official Twitter: https://twitter.com/Prince3EG/status/630615331308830720?s=04    As I read through the comments, I saw that many people said the halo of lights was from an illuminated teepee display at a nearby casino, Mystic Lake Casino.  Paisley Park Studios, Mystic Lake Casino and the area the other reports came from (if I heard correctly last night on the radio) are all relatively near proximity and also if it was an overcast night, the lights would likely be seen a distance away as well (I'd think, anyway). A quick bit of research by my husband, using Google Earth and Google Images, shows that, in my opinion, the comments about the halo of lights coming from that teepee are likely correct.  I will email images for your convenience, but if you would like also to check for yourself as well, merely put search terms \"Mystic Lake Casino\" into Google Images and it will pull up these same pictures, and more. I hope I have helped.  I enjoy your reports on Coast to Coast AM very much.",
      "link": "http://www.nuforc.org/webreports/121/S121259.html",
      "state": "MN",
      "duration": "varied"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b5a",
      "summary": "3 points of light moving fast, in close proximity, across night sky.",
      "city": "minneapolis",
      "shape": "light",
      "date": "2015-10-02T00:00:00",
      "story": "3 points of light moving fast, in close proximity, across night sky. Three points of light moving in tandem across the night sky.  They individually resembled a satellite but they were in close proximity in an L pattern, moving in tandem across the sky very quickly.  Halfway across they started to dim and then vanished in a blink of a second.",
      "link": "http://www.nuforc.org/webreports/122/S122439.html",
      "state": "MN",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c4b",
      "summary": "Black hang glider /triangle shaped object in clear sky moving slowly then turned to the side and disappeared.",
      "city": "minneapolis",
      "shape": "triangle",
      "date": "2015-09-17T00:00:00",
      "story": "Black hang glider /triangle shaped object in clear sky moving slowly then turned to the side and disappeared. I was driving west on Hwy 62 at the 35w interchange.  Sky was clear and I saw a black object that looked like a hang glider shape/triangle floating in the sky.  I thought maybe a military plane (B-2 spirit).  It started to turn and looked very thin and disappeared.",
      "link": "http://www.nuforc.org/webreports/122/S122007.html",
      "state": "MN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4de9",
      "summary": "Minneapolis lights are believed to be from Mystic Lake Casino in Shakopee, MN.  ((NUFORC Note:  We agree.  PD))",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2015-08-27T00:00:00",
      "story": "Minneapolis Lights are believed to be from Mystic Lake Casino in Shakopee, MN. Monday evening I witnessed the same ring of lights recently reported in Minneapolis, MN. My guess is these lights are being beamed from Mystic Lake Casino in Shakopee, MN. Interesting as the photograph currently on your home page is identical to my sighting on Monday. Although I've never seen these lights in the past, Mystic Lake beams other lights into the sky, as well. ((NUFORC Note:  We agree with the assessment by the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121499.html",
      "state": "MN",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c51f7",
      "summary": "The circles of light are from the lights at Mystic Lake Casino.  The have a giant teepee made of spotlights.",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2016-01-05T00:00:00",
      "story": "The circles of light are from the lights at Mystic Lake Casino.  They have a giant teepee made of spotlights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Suspected advertising lights at a local casino.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124894.html",
      "state": "MN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c556b",
      "summary": "Red/Fiery object (or plane) in sky; Loud humming noise.",
      "city": "minneapolis",
      "shape": "cigar",
      "date": "2016-07-08T00:00:00",
      "story": "Red/Fiery object (or plane) in sky; Loud humming noise. Red/orange-plane/cigar shaped craft moving at the speed of an airplane.  Cruising high in the sky before sunset against a clear blue sky.  It was very shiny, almost like it was on fire, though its color was consistent and didn't seem to flash or go 'out of shape'.  Initially thought it was a plane, but seemed to bright and high up to be a plane.  There were no con trails trailing the plane that were visible.  Couldn't make out any specific details on the plane itself, but it was flying South to East and was visible for approximately 3 minutes.  Additionally, there was a loud humming/high pitched noise approx. 10-20 minutes after viewing the plane, which lasted about 2 minutes and seemed to come from no specific direction.  Not sure if the incidences were related, but the plane like object itself didn't seem to make any noise at the time, though it was very high up.  Just wanted to report this incase anyone else has seen this.",
      "link": "http://www.nuforc.org/webreports/128/S128093.html",
      "state": "MN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a9a",
      "summary": "Gray disk with a blue bump in the bottom.",
      "city": "minneapolis",
      "shape": "disk",
      "date": "2016-04-29T00:00:00",
      "story": "Gray disk with a blue bump in the bottom. Last night my brother, husband, and I were in the yard. Suddenly I looked to my right towards my neighbor's house.  I saw a disk it was gray and on the bottom it had a bump with a blue light.  I couldn't believe what I was seeing because it was so clear and so close.  I turn back to tell my brother and husband so they can look at it too and it disappeared.   I don't know if anyone is going to believe me but I know what I saw and it was incredible.",
      "link": "http://www.nuforc.org/webreports/126/S126994.html",
      "state": "MN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c7a",
      "summary": "Object in sky; red, green, white lights.  ((NUFORC Note:  Possibly advertising lights at nearby casino.  PD))",
      "city": "minneapolis",
      "shape": "unknown",
      "date": "2016-03-24T00:00:00",
      "story": "Object in sky; red, green, white lights Let the dogs out at about 12:30 a.m. on 3/20/16.  Noticed \"twinkling\" object in the sky, got the binoculars and viewed an object in the sky.  It was about 30 degrees above the horizon, possibly five miles away, approximately above Lake Minnetonka area.  It was not moving.  It appeared to be flashing red, green and white lights.   I watched this object for at least 30 minutes, suspecting that it was some type of aircraft, waiting for it to move in the sky.  It didn't - I went to bed.  Drone maybe?  Anyone else see this? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126465.html",
      "state": "MN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f02",
      "summary": "Odd lights in south Minneapolis.",
      "city": "minneapolis",
      "shape": "changing",
      "date": "2016-10-11T00:00:00",
      "story": "Odd Lights in South Minneapolis. I am amazed I haven't heard any reports on this sighting this following morning.   I was out on my front porch last night at about 3 AM.  Clear sky, and I was admiring the stars.  I then noted a strange light in the Eastern sky.  Very difficult to describe.  It was multi-colored, red, white , blue.  The colors shifted, or pulsed.  It seemed to hover, but did make a very slow Southerly progression.   After viewing it for approximately a half hour, I went an woke my wife.  I didn't do this easily, but felt she would be upset if I told her what I'd observed and didn't let her know.  She was as awed as I was.  She grew up in Old Ford Town, which is the neighborhood of the old Wold Chamberlin Field, and right close to MSP.  So, obviously she is not new to seeing aircraft in the night sky.  Neither of us could explain what we were seeing.  We were watching with binoculars, and we could come up with no explanation for this sighting.  Obviously, not a plane, nor a helicopter.  We watched until almost 5:00 AM.  Any other reports?  We'd love an explanation.  We were never freaked, but very intrigued.",
      "link": "http://www.nuforc.org/webreports/130/S130384.html",
      "state": "MN",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c63f9",
      "summary": "Pulsating light in the cloudy eastern sky.",
      "city": "minneapolis",
      "shape": "sphere",
      "date": "2016-09-09T00:00:00",
      "story": "pulsating light in the cloudy eastern sky. 7:45am, high, dense clouds to the east of the city. Heading east on 50th St from the Edina/Minneapolis line while riding my motorcycle, I noticed the usual low flying air traffic over head.  As a plane passed overhead and out of my line of sight, I noticed a round, pulsating light in the distance.  It was backed by significant dark cloud cover, but didn’t seem to be moving.  I was able to watch it for about 2-3 minutes before it became obscured by trees. I rode on approaching the west side of the I-35 overpass, and came to a high, open spot giving me the opportunity to see the ball of pulsating light again. It hadn’t moved, changed size, or direction in the 3-5 minutes since I had seen it last.  I was able to watch for another minute or two, noticing again the pulsation as well as a lack of any discernable movement.  I decided to pull over and try to record it using my phone.  I made the first possible right immediately after the I-35W overpass.  This gave me a high vantage point with no obstructions or interference of visual contact with the object.  I briefly looked away to get my phone out, entered my code to unlock it, and selected the video option under the camera mode.  This whole process took less than 20 seconds.  By the time looked back up, the object was gone.  There were no signs or indications it had been there at all.",
      "link": "http://www.nuforc.org/webreports/129/S129820.html",
      "state": "MN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c66dd",
      "summary": "Rectangular prism hanging over Minneapolis vanishes after 1 minute duration",
      "city": "minneapolis",
      "shape": "rectangle",
      "date": "2017-03-10T00:00:00",
      "story": "Rectangular prism hanging over Minneapolis vanishes after 1 minute duration I saw a similar object as the other reporter for this date, but my view was much closer, so I really got a good look at it.   It was early afternoon and I was driving in Minneapolis.  The object was in a northerly direction.  I saw a very large rectangular prism just hanging there in the sky.  It was just beyond the tree line, the tree line about 4 city blocks away.  It looked like it was hanging over the city's lakes area.   It was off-white in color with brown outlining the edges and outlining other rectangular shapes within the object outline.  Interesting detail, the off-white was dirty and dingy, like it was old and well used.  It didn't move, it just hung in the air.  It was close to the ground too.  Usually, when I think of UFO's, I imagine them like the movies; high in the sky, flashing some lights, flying around, then speeding by, and disappearing. It did disappear, but not by speeding away.  It just vanished, it was there one second and gone the next. I discounted what I saw, I don't know why.  I don't want to be a conspiracy person maybe, sorry no offense intended.  Now, I don't know what I believe.",
      "link": "http://www.nuforc.org/webreports/132/S132923.html",
      "state": "MN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6adc",
      "summary": "Fast moving ball of light over Mississippi River in Minneapolis.",
      "city": "minneapolis",
      "shape": "light",
      "date": "2017-02-10T00:00:00",
      "story": "Fast moving ball of light over Mississippi River in Minneapolis. I was driving home from work very early in the morning on 2/6/17 about 2:30 am.  I was driving eastbound across the Mississippi River bridge on I-94.  I looked to the southeast and saw a bright ball of light moving downward at what appeared to be between a 45 and 90 degree angle.  It was moving very fast and I lost sight of it as some trees came between me and the light. My first impression was it looked like a missile, but I saw no flashes or smoke.  There was no visible tail on the light.  From the speed, angle of movement, and appearance it did not look like a plane, helicopter, or drone.  I make no claims to know what it was, but it was definitely odd enough that it made me take note. ((NUFORC Note:  We have corrected the date above, to reflect a sighting on the morning of the 6th of February.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132502.html",
      "state": "MN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b96",
      "summary": "1-2 Second Green Flash in sky near Theodore Wirth Golf Course.",
      "city": "minneapolis",
      "shape": "flash",
      "date": "2017-01-26T00:00:00",
      "story": "1-2 Second Green Flash in sky near Theodore Wirth Golf Course. Driving at night on 394, headed towards downtown Minneapolis, and was about to merge onto 94 WEST...  All of a sudden there was a huge flash of green light that lit up the sky for maybe 1-2 seconds then turned yellow for maybe 1 second then was gone.  It was dark so this was super odd and not sure what to make of it.",
      "link": "http://www.nuforc.org/webreports/132/S132286.html",
      "state": "MN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6bfd",
      "summary": "Interesting sighting over Uptown Minneapolis.",
      "city": "minneapolis",
      "shape": "cigar",
      "date": "2017-01-19T00:00:00",
      "story": "Interesting sighting over Uptown Minneapolis. One craft with two bright lights.  Seemed to hover in one area until it finally shot straight up a disappeared from sight.  Thought it could of been a drone or helicopter by the way it was behaving until it went straight up a faster then any craft I could imagine.",
      "link": "http://www.nuforc.org/webreports/132/S132234.html",
      "state": "MN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6eb1",
      "summary": "4 slowly revolving white lights in the sky.  ((NUFORC Note:  Possible advertising lights??  PD))",
      "city": "minneapolis",
      "shape": "light",
      "date": "2017-07-07T00:00:00",
      "story": "4 slowly revolving white lights in the sky. 4 slowly revolving lights just above the clouds, they could be seen in the clouds.   The lights stayed in that area for at least 5 minutes.   I went into my house to have others come out to see, and when I went back the lights were gone. ((NUFORC Note:  Possible advertising lights??  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134783.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c74b1",
      "summary": "Light formation in sky and similar pattern reflected on people in photos taken an hour earlier.",
      "city": "minneapolis",
      "shape": "formation",
      "date": "2017-05-11T00:00:00",
      "story": "Light formation in sky and similar pattern reflected on people in photos taken an hour earlier. Seven of us were hanging out on our rooftop deck and I pointed out two lights above us behind the fast moving clouds.  We couldn’t tell if the lights were moving slowing for about 5 minutes and then stopped, or was stationary the entire time.  For about 20 minutes the lights remained still as we watched them dim and brighten behind the moving clouds.  We could see a faint third light which created a triangular formation.  However, the photos suggest there may have been more lights than what we could see by eye. Heavier clouds rolled through and, once cleared, the lights were gone. About 20 minutes after the light formation disappeared, we saw a very bright aircraft fly overhead.  We all agreed it was an airplane, yet it did appear to be much brighter, faster and and closer than what we typically see in the area.  Our condo is directly under a flight path and we also acknowledged that no airplanes had been seen since we first noticed the lights. Then this morning (the next day), I was reviewing our photos from the evening and noticed a single green formation on my friend’s left shoulder.  It appears on the chest of the person sitting next to him in a different photo. Attached are photos of the formation we saw in the sky and a zoomed in photo of the pattern on my friend. 20:04 Photos of friends 21:30 Noticed two lights in the sky 21:41 Photos of lights. ((NUFORC Note:  The witness provides a number of high-quality photographs.  The green objects, seen against the arm and shoulder of one of the people present, suggests to us that there is a flaw in the camera.  The other lights appear to us to be reflected from the bottoms of clouds, which suggests advertising lights, although we cannot be certain.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133996.html",
      "state": "MN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c74ef",
      "summary": "12 glowing lights in sky circle shaped did not move stayed in position was south Minneapolis a lot of witnesses.",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2017-05-06T00:00:00",
      "story": "12 glowing lights in sky circle shaped did not move stayed in position was south Minneapolis a lot of witnesses. ((NUFORC Note:  Ring of stationary advertising lights at local casino.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133882.html",
      "state": "MN",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c7719",
      "summary": "They were visible, then invisible, light red almost pinkish round, but not clear definition of shape.",
      "city": "minneapolis",
      "shape": "unknown",
      "date": "2017-12-04T00:00:00",
      "story": "They were visible, then invisible, light red almost pinkish round, but not clear definition of shape. So, it was 3 pm when my mother went to sit outside and noticed something move far into the sky.  The ufo seen was not any particular shape, but I can describe as round.  Like a light red sort of pinkish.  No lights or anything shiny...  They were about 5 or 6, maybe more of these round things that were visible, then invisible.  Nothing metallic, like in the movies.  \"They\" were hovering over the city as we could see.   As hours went by, they were hovering closer and closer on top of where we were.  They had a peaceful movement as they appeared and again disappeared.  Constantly moving.  I was AMAZED, for nothing, absolutely nothing could describe fully what we saw.  We stared up into the sky for hours!!!   A few people gathered at the place where we were to see.  Neighbors, friends and family.  We tried to take a video but the objects could not be seen as with our eyes.   We were not scared but more so AMAZED.  We pretty much stared until our necks hurt! ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness corrected the date to sometime during June 2011, not 2010.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137547.html",
      "state": "MN",
      "duration": "5+ hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f3a",
      "summary": "((HOAX??))  Bright moving object in Minneapolis.  ((anonymous report))",
      "city": "minneapolis",
      "shape": "disk",
      "date": "2018-05-04T00:00:00",
      "story": "Bright moving object in Minneapolis I looked outside my apartment window and saw bright small moving object I took my phone out and started recording so I zoomed in and it was moving. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139663.html",
      "state": "MN",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8685",
      "summary": "Saw a HUMONGOUS UFO very low downtown moving through the skyscrapers",
      "city": "minneapolis",
      "shape": "disk",
      "date": "2018-08-17T00:00:00",
      "story": "Saw a HUMONGOUS UFO very low downtown moving through the skyscrapers I was driving from hwy 55 to where it merges to 94 west right near downtown, around 10pm.  Saw a HUMONGOUS UFO very low, and moving slow downtown, it looked like it was going through the skyscrapers, ~300 feet or less off the ground.  South-east side of the city.  It had red lights and I might have told myself it was a plane except it was moving through the buildings, not above them.   Was driving in the passenger seat so I lost sight of it after about 5 seconds.  It was huge and caught my eye right away. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142755.html",
      "state": "MN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c931f",
      "summary": "Noticed a pulsating hovering light in north sky for the past two nights. Not an airplane or star.",
      "city": "minneapolis",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Noticed a pulsating hovering light in north sky for the past two nights. Not an airplane or star.",
      "link": "http://www.nuforc.org/webreports/150/S150079.html",
      "state": "MN",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c9597",
      "summary": "low flying cone shaped craft spotted in the city.  ((anonymous report))",
      "city": "minneapolis",
      "shape": "cone",
      "date": "2019-12-19T00:00:00",
      "story": "low flying cone shaped craft spotted in the city I was laying in bed looking out of the window when this dull cone stopped maybe 3 miles away in the air.  It looked like it was shaped like a cone, and it was glowing a little.  No visible lights, it had some sort of aura.  I immediately got up to see it closer.  It hovered for a couple seconds then it went in a straight line real fast back in the direction where it came. It lasted about a minute and I don't know if anyone else saw it, for I was alone.  Couldn't have been a plane, it was too low in the sky, and it was hovering, it moved way too fast and sharp.  Absolutely terrifying experience for me.",
      "link": "http://www.nuforc.org/webreports/151/S151294.html",
      "state": "MN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c9886",
      "summary": "Large, round object with rotating orange lights or flame traveling fast from SW to NE across SW Minneapolis",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2019-10-04T00:00:00",
      "story": "Large, round object with rotating orange lights or flame traveling fast from SW to NE across SW Minneapolis.  No sound.  Perhaps traveling aound the same height as a high-flying helicopter, but  faster.  Viewed at an angle so it could not have been some sort of reflection off of helicopter blades.  Object was round and emitted an orange glow that slowly rotated around the object.  Traveled from South-Southwest to North-Northeast between Edina and Southwest Minneapolis.",
      "link": "http://www.nuforc.org/webreports/149/S149026.html",
      "state": "MN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c98fb",
      "summary": "Me and my son was walking home we was on 4th st and Franklin Ave, we was looking up at the sky because it was starting to get cloudy fa",
      "city": "minneapolis",
      "shape": "circle",
      "date": "2019-10-04T00:00:00",
      "story": "Me and my son was walking home we was on 4th st and Franklin Ave, we was looking up at the sky because it was starting to get cloudy fast and three bright circles appeared out of nowhere directly above us.  One big light and two smaller lights on each side.It stayed motionless for about 5 minutes then the lights \"turned off\"and that was it. Me and my son was very scared and have never seen anything like that ever.  I know that it was not an airplane because how big the lights were and it was like it turned invisible and it made no noise or any movement at all.  It was either a U.F.O or secret military air craft.  I know what I saw.",
      "link": "http://www.nuforc.org/webreports/149/S149380.html",
      "state": "MN",
      "duration": "5 minutes"
    }
  ]
}