{
  "city": "nashville",
  "fetch_timestamp": "2025-07-12T14:25:56.326927",
  "record_count": 127,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4f10",
      "summary": "((HOAX??))Very beautiful disc shaped object appeared in the sky @ 10 pm, this is the time when I noticed it first. ((anonymous report))",
      "city": "nashville",
      "shape": "disk",
      "date": "2019-04-08T00:00:00",
      "story": "Very beautiful disc shaped object appeared in the sky at 10 pm; this is the time when I noticed it first.  The disc then changed to a beautiful neon blue color, in a split second.  I expected it to dart towards the FEMA location, which is where all other anomalies usually dart to.  This one lightly drifted south bound without a sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145550.html",
      "state": "TN",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5344",
      "summary": "Large white/green ball trailing green crap behind it close to green hills in Nashville.",
      "city": "nashville",
      "shape": "other",
      "date": "2008-06-12T00:00:00",
      "story": "Large white/green ball trailing green crap behind it close to green hills in Nashville. In short this was seen by myself and and a local news reporter also.I saw this from a third floor deck in the 37221 zip looking over percy warner park towards green hills ,it looked like it was over the Green hills area which is another zip code but not far.Late in the summer of 07 not sure of exact date,but looked like a white globe with green to light green smoke or mist?? coming off the back end of it.I might have been 4 to 10 miles away, but at that distance a plane normally looks a third of the size of what I saw.I have never seen things that were not there,don't hear stuff either. I was not with the news guy when I saw this, but my friend who knows him said he saw the same thing a week or so later.This thing came in fast and then I could not see it any more. No impact was reported and I am sure more people saw it than us two.I have a couple of degrees and a carry permit they don't give those to crazy people,This was too big to make it that close to the ground without breaking up first and no impact was reported.I'm very far from stupid,and have seen many shooting stars etc etc.This was quite different...That's all I got. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63704.html",
      "state": "TN",
      "duration": "3-5sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b57e4",
      "summary": "A high altitude red star began moving fast straight acrossed the sky, then turned up straight up and flew out of sight instantly and wa",
      "city": "nashville",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "A high altitude red star began moving fast straight acrossed the sky, then turned up straight up and flew out of sight instantly and was gone. Ive seen plenty of these types and also have had them come to within 50 feet of me going thru the entire rainbow till they became brilliant white which is proof they are coming in from another dimension",
      "link": "http://www.nuforc.org/webreports/051/S51833.html",
      "state": "TN",
      "duration": "5minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b62be",
      "summary": "BRIGHT LIGHTED OBJECT, CLEARLY VISIBLE WITH THE NAKED EYE, HOVERING LESS THAN 100 YARDS ABOVE THE GROUND.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "BRIGHT LIGHTED OBJECT, CLEARLY VISIBLE WITH THE NAKED EYE, HOVERING LESS THAN 100 YARDS ABOVE THE GROUND. THIS INCIDENT OCCURRED IN THE SOUTHEASTERN PART OF BROWN COUNTY, INDIANA, ON FEBRUARY 10, 2007.  IT WAS BETWEEN 8:30 AND 9:00 P.M. WHEN I STEPPED OUTSIDE TO RETRIEVE SOMETHING FROM MY CAR.  TAKE NOTE THAT THIS IS IN THE COUNTRY, AND A RESIDENCE WHERE I HAVE LIVED FOR OVER 6 YEARS.  I AM AN AVID STAR GAZER, AND MORE FAMILIAR WITH THE NIGHT SKY AND MY SURROUNDINGS THAN MOST MIGHT BE.  NOT TO MENTION THE SKY IS MUCH MORE DETAILED THAN LIVNG IN THE CITY.   I IMMEDIATLY NOTICED A VERY BRIGHT LIGHT IN THE SKY NOT 5 MILES AWAY, AND VERY CLOSE TO THE GROUND.  IF I WERE TO DESCRIBE A STAR IN THE SKY AS THE SIZE OF A PENCIL DOT, THIS OBJECT WOULD, IN COMPARISON, BE A FOOTBALL.  IT HAD 3 WHITE LIGHTS, FORMING WHAT LOOKED LIKE A TRIANGLE, AND ONE RED LIGHT IN THE REAR.  NONE OF THESE LIGHTS WERE FLASHING.   I OBSERVED THE OBJECT THROUGH MY BINOCULARS, WHICH WERE IN ARMS REACH, JUST INSIDE THE DOOR, AND COULD CLEARLY SEE THE MOVEMENT OF THE OBJECT, WHICH SEEMED TO BE HOVERING, MOVING IN SPORADIC, SMOOTH MOVEMENTS CENTERING IN ONE LOCATION.  I YELLED FOR MY DAUGHTER AND BOYFRIEND TO COME SEE.  BOTH WITNESSED THIS AS WELL AS A NEIGHBOR, ONE RIDGE BEHIND ME.   I REACHED INSIDE AGAIN, ABOUT 7 OR 8 MINUTES LATER FOR A SECOND PAIR OF BINOCULARS, AND TURNED BACK AROUND TO FIND THE OBJECT GONE, WITHOUT A TRACE.",
      "link": "http://www.nuforc.org/webreports/055/S55599.html",
      "state": "IN",
      "duration": "10 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b62df",
      "summary": "8 rocket pay load for emissary  sen. J. glenn  sts-95  ((NUFORC Note:  Nature of report is unclear to us.  PD))",
      "city": "nashville",
      "shape": "other",
      "date": "2007-06-12T00:00:00",
      "story": "8 rocket pay load for emissary  sen. J. glenn  sts-95 I was coming out of a bookstore in south Nasville and I almost bumped into a lady staring up into the sky.  I turned to look and witnessed 7-8 rockets side by side coming out of the sunset, plumes mixed in gigantic trail.  Senator Glenn's purpose was reportedly elderly astronuat medical experiments.  But I could find no report of the other launches that day. ((NUFORC Note:  We do not know what the source of this report is implying.  He called us over the Hotline, but we did not understand the call, either.  He seemed to believe that the sighting had something to do with UFO's, but we did not understand what the relationship was.  Source of report provides no contact information with his written report.   STS-95 was launched on October 29, 1998, we have learned over the internet.  The link to the STS-95 mission is here:   http://spaceflight.nasa.gov/shuttle/archives/sts-95/index.html PD))",
      "link": "http://www.nuforc.org/webreports/056/S56640.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b63c5",
      "summary": "I have pictures",
      "city": "nashville",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "I have pictures I saw the same type of anomoly as in Arizona last year.  I have 4 pictures from a 35 mm SLR Canon camera.  They definitely show what I believe to be some sort of lines with lights, it is only one line but where it would form a V, i have a shot of what looks to be a craft of some sort at the other V point.  It was a cloudy day and nearing sunset when I heard and saw this.  In the third frame, it appears as though multiple crafts were in focus.  I only had a 200 mm lens but as I enlarge the photos, the sighting is remarkable.  I misplaced the film in Florida and I found it in March of this year. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62377.html",
      "state": "TN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b647e",
      "summary": "On March 7, 2007, we observed a chrome cigar-shaped craft.",
      "city": "nashville",
      "shape": "cigar",
      "date": "2007-04-27T00:00:00",
      "story": "On March 7, 2007, we observed a chrome cigar-shaped craft. My son and I were out in the front yard of my residence pointed west and we happened to look up, and we saw a chrome cigar-shaped craft. This craft was silent and made no engine noise. The weather was sunny and a few clouds. We saw the UFO in plain site with no obstruction of view. We observed it for 2 minutes and it disappeared going east. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55623.html",
      "state": "TN",
      "duration": "2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6487",
      "summary": "formation of 5-6 Ufos fly directly over Nashville.",
      "city": "nashville",
      "shape": "formation",
      "date": "2007-11-28T00:00:00",
      "story": "formation of 5-6 Ufos fly directly over Nashville. Ufo sighting approx 815 pm cmt. Headed in a direction south south east approx 6 objects about magnitude 1.0 traveling in formation.  Objects appeared to be individual running in a straight line together.  there was 1 object that ran parallel to the other objects which traveled in a row object was traveling very fast.  seemed to come out of nowhere. observation lasted approx 25 -35 seconds.  the objects appreared and disappeared they were headed directly over nashville tennessee from my  home in the germantown area. which is north of town. objects did not leave any trails or have any noise associated. I have been an amature astronomer for many years and have seen lots of sattlites and airplanes at night but this was unique.  The objects were not very bright which makes me wonder if the light I saw was reflected off the objects , they were well placed to be immumitated by the city lights of nashville..The moon was also full or almost full.. Space station??",
      "link": "http://www.nuforc.org/webreports/059/S59474.html",
      "state": "TN",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b659d",
      "summary": "this thing was really there",
      "city": "nashville",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "this thing was really there   I was sitting in my living room watching TV, when i felt a buzzing in my left thigh at first i thought it was my cell phone on vibrate then i noticed it laying on the table. when i saw a light flash past my back door. my puppy looked at the door and started to bark. i got up and went to the door to see what gave of the light and scared my dog. when i got to the door i looked out and saw a saucer shaped craft hoovering about one hundred yards from my house. i said outloud that nobody will believe this crap. as i turned to go get my video camera two of these little things were in my livingroom. they had the typical look that every says. i noticed a small line around one of their wrists then i took off out the door i left dog and everything. i ran down the street and looked back and my puppy was coming. i hid behind a trash dumpster and looked back at the house i didn't see anything at the house but i looked for the craft and it was still there. some guy came down the street in his car and stopped he stepped out of his car without closing the door and looked i was to scared to yell for him. then he jumped back in his car and sped off. it seemed like i stayed there for a few minutes but when i got back to the house it was three in the morning and my dog was under my bed whining. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63764.html",
      "state": "TN",
      "duration": "about 20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a64",
      "summary": "Green stream of light that was moving in a manner that made it seem alive and not a craft Flying through the sky at a very slow rate of",
      "city": "nashville",
      "shape": "light",
      "date": "2008-03-31T00:00:00",
      "story": "Green stream of light that was moving in a manner that made it seem alive and not a craft Flying through the sky at a very slow rate of I stepped out my front door and was immediately attracted to some movement above me. Flying through the sky at a very slow rate of speed was what appeared to be a green stream of light that was moving in a manner that made it seem alive and not a craft. It was flying no more than 20-30 feet above me due east for approximately 30-40 seconds when a spark of light materialised at the head of the stream and seemed to reveal a vague ring shape with bright white flamelike sparks of light emanating from inside the outer portion of the ring towards the center and right before the sparks met in the middle the whole thing dissapeared. The object made no sound which was strange to me as it was flying so low. The movement of the object was fluid and slightly undulating which the only way I could make a rational human comparison when I told my wife was that it moved and had a vague physical resemblance to a jellyfish. I have never seen anything like it nor have I ever heard or read of anything like it but since it happened I have found similar sightings reported online.  This was not a firework, or any light abberation or distortion. It was vivid, close and highly visible with more than enough time for me to size it up and find a logical explanation. I would like to know if anyone else saw it that night. I have never seen a ufo and am a rational intelligent person who has never ruled out the possibility of life beyond this world but at the same time never convinced by the limited knowledge of reported sightings and lack of first hand evidence. What I saw changed that for me forever.",
      "link": "http://www.nuforc.org/webreports/062/S62139.html",
      "state": "TN",
      "duration": "30-45 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a73",
      "summary": "MILITARY JETS FLYING OVER NASHVILLE AT NIGHT",
      "city": "nashville",
      "shape": "",
      "date": "2008-03-04T00:00:00",
      "story": "MILITARY JETS FLYING OVER NASHVILLE AT NIGHT TO WHOM IT MAY CONCERN,  NOT SURE OF THE PRECISE TIMES...SOMEWHERE BETWEEN 7:45-8:45. I DIDN’T CHECK THE TIMES.  FIRST EVENT: SOMETIME JUST BEFORE 8 PM CST. HEARD A VERY LOUD AIRCRAFT SOUND COMING TOWARDS THE NEIGHBORHOOD COULDN’T REALLY TELL FROM WHAT DIRECTION. IT SOUNDED LIKE A PLANE WAS  GOING TO LAND IN THE NEIGHBORHOOD, AS IT GOT CLOSER I COULD SENSE IT WAS GOING VERY FAST AND THEN WAS FOLLOWED BY ANOTHER VERY LOUD JET GOING EQUALLY FAST. BY THE TIME I LOOKED OUTSIDE THEY WERE GONE, BUT THE SOUND PUT IT GOING OVER NASHVILLE TOWARDS THE WEST.  SECOND EVENT: SOMETIME AROUND 8:45 PM, I HEARD THE SOUND AGAIN IN THE DISTANCE. COMING FROM THE EAST. THIS TIME I WENT OUT INTO THE YARD, HEARD 2 JETS ONCE AGAIN PASSING OVERHEAD, VERY LOUD, AND VERY FAST, JUST ABOVE (100 FT? PROBABLY MORE) CLOUD COVER SO I COULD NOT SEE THEM AS THEY FLEW OVERHEAD BUT FOLLOWED THE SOUND TO THE WEST -SOUTHWEST. I SAW 2 SETS OF RED “TAIL LIGHTS”. MY NEIGHBORS ACROSS THE STREET ALSO HEARD THEM, AND MY NEXT DOOR NEIGHBOR HAD ALSO COME OUT TO SEE WHAT WAS GOING ON AND WE CHATTED ON HOW WEIRD IT WAS THAT THE MILITARY WERE FLYING JETS OVER A MAJOR METRO AREA AT NIGHT. THERE WAS ALSO A COUPLE GETTING INTO THEIR CAR FROM A GET TOGETHER ACROSS THE STREET THAT STOOD AND WATCHED ALSO. I HAVEN’T SPOKEN WITH ALL MY DIRECT NEIGHBORS YET THOUGH I AM SURE THEY HEARD IT AS YOU COULDN’T MISS IT.  BOTH EVENTS LASTED LESS THAN 60 SECONDS EACH.  I LIVE IN AN APARTMENT, I AM A PROFESSIONAL ORGANIC LANDSCAPE GARDENER, MY NEIGHBOR IN THE APARTMENT NEXT DOOR IS A WAITRESS, MY NEIGHBORS ACROSS THE STREET ARE BUSINESS PROFESSIONALS. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61702.html",
      "state": "TN",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7275",
      "summary": "It was a sphere lit up about 500 feet away over an interstate by a dam in the local hermitage area.",
      "city": "nashville",
      "shape": "sphere",
      "date": "2007-08-07T00:00:00",
      "story": "It was a sphere lit up about 500 feet away over an interstate by a dam in the local hermitage area. Went out to smoke with my fiance' at about 30 after midnight. About 500 feet away over a local dam we saw what we thought was a local water tower lit up. We soon realized this was not near the tower. This thing whatever it was was huge and lit up. It was not moving and looked like for a bit it was on top of some trees. We have no clue what this object was but when we came back out after going back in it was gone.",
      "link": "http://www.nuforc.org/webreports/057/S57765.html",
      "state": "TN",
      "duration": "about 30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b756e",
      "summary": "White, flashing object, looked like an airplane, but traveling way too fast.",
      "city": "nashville",
      "shape": "disk",
      "date": "2006-07-16T00:00:00",
      "story": "White, flashing object, looked like an airplane, but traveling way too fast. I thought it was a plane, but it was traveling WAY too fast.  It was daylight outside, with clouds, it was white and it looked like lights were flashing on it, then it just disapeared.",
      "link": "http://www.nuforc.org/webreports/050/S50770.html",
      "state": "TN",
      "duration": "7-10 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a17",
      "summary": "two trangular space craft with two lights on all sides seen in Nashville Tn.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "two trangular space craft with two lights on all sides seen in Nashville, TN. I saw two aircraft they had two bright lights on each side and it was a triangular in shape.  They were hovering in the sky.  And seconds later they disappeared to the east leaving a purple trail in the sky.",
      "link": "http://www.nuforc.org/webreports/055/S55042.html",
      "state": "TN",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ae2",
      "summary": "Circle shaped solid white object flying through clouds.",
      "city": "nashville",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "Circle shaped solid white object flying through clouds. I was talking to a friend online and I was about to sign off yahoo. I looked out my window because it's a cloudy day with the rain we had during the night and early morning. I saw a solid white unknown air craft flying at a high rate of speed at a very high altitude. It did not have any reflection like a commercial airliner does, and neither the shape. It was like a circle shape but had more of an edge toward the front.  This object did put out a stream behind it but the stream went away just as fast as it came out. And the object appeared to be climbing higher in altitude. I watched it fly through the clouds until I could see it no more.",
      "link": "http://www.nuforc.org/webreports/052/S52891.html",
      "state": "TN",
      "duration": "13 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b82c8",
      "summary": "A Shapeshifting Black Balloon Flashed A Red Light At Me",
      "city": "nashville",
      "shape": "other",
      "date": "2009-01-10T00:00:00",
      "story": "A Shapeshifting Black Balloon Flashed A Red Light At Me I don't know why my report from that day was not posted.  I even spoke to the rep. at NUFORC who seemed to not want to hear many details for whatever reason.  Therefore I am posting this again.  On the date and time specified I saw a black balloon floating high in the sky as I sat on my balcony at my apartment complex.  It was a hot July evening.  I noticed the \"balloon\" and stood up to look at it.  I thought of a contest we had in Sunday school as a child in which we were all given helium ballons to tie our names and phone numbers to so that if our balloon was found we would receive a call from whomever found it.  The one found from the farthest place was the winner. Suddenly the balloon shifted into a horizontal shape and I could see what appeared to be heat waves like you see when you look down a road on a hot day. This balloon morphed back and forth from vertical balloon shape to horizontal oblong shape a few times as it moved lower in the sky and began to pass over my apartment.  I ran through my apartment to the front door.  When I emerged from the apartment the balloon was just above my apartment. It passed over me at that height and then a slit opened and a red light flashed and the slit closed.  It continued along over the next hill and morphed a few more times.  It made no sound whatsoever.  I don't know what I saw.  If you know please tell me. I have since seen a video clip of a similar thing from Bristol Va. a few days later in August of that year.",
      "link": "http://www.nuforc.org/webreports/066/S66886.html",
      "state": "TN",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a2e",
      "summary": "Object fell from sky vertically leaving trail of sparks behind it -- changed from green to yellow-white as it entered atmosphere.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Object fell from sky vertically leaving trail of sparks behind it -- changed from green to yellow-white as it entered atmosphere. While driving home I saw what at first I thought might be a shooting star glittering down from the heavens.  Upon reflection, I thought it might be falling 'space junk.' The object was 45 degrees above the horizon, just above the treetops.  The trail, from my perspective was a bit longer and closer to earth than the standard shooting stars I've seen.  The object entered green/orange and turned yellow-white.  The trail disintegrated/disappeared as quickly as it appeared. It was in the southern sky. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66850.html",
      "state": "TN",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b8aed",
      "summary": "Large silent object that landed and seemed to hover and make fast turns!!",
      "city": "nashville",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Large silent object that landed and seemed to hover and make fast turns!! My fiancé was driving me home after she had gotten off work when I noticed a large bright object in the sky.  We had just passed smith springs road were it intersects with murfresboro road driving away from downtown Nashville.  I was in the passenger seat and saw it to the left and in front of the car. At first I thought I was looking at a helicopter as the object seemed to hover.  But, as we drove closer I could see that the object was long and flat on the bottom and far to large to be a helicopter. Once we made it to our turn at nashboro blv, we could see the object quite clearly and noticed that it had begun to move slowly.  Once we turned from murfresboro on to nashboro blv., the object passed over our car slowly and making no noise at all.  The object was low enough that if I had been on the roof of a nearby house I could almost have touched it.  After it passed over our car we watched it descend into a near by field. We drove around trying to get a better view of where it had landed but were unable to see more then a bright glow from the road.  Neither of us were willing to get out of the car and trek through unknown fields to find it so we drove around hoping we could get a better view.  After about 10 minutes of driving up both smith springs and nashboro blv we saw the craft shoot back into the sky at a steep angle.  After it took off we followed it until the object turned around and a plane passed over us a few seconds later. We made a u-turn at bell road back onto smith springs to follow both the plane and the object. We lost sight of the plane and never saw it again but we did find the object again flying low and parallel to murfresboro road.  We followed it down murfresboro till it came to a halt in the air and then a few moments later it turned and headed back the other way towards nashboro blv again.  Making another u-turn we followed the object turning off murfresboro and back onto nashboro blv. There it traveled straight down nashboro blv and I snapped a few pictures while driving after it. After about 3 minutes the object turned sharply around an came over our car once again.  It was silent and fast and quickly was out of sight seeming to descend again. After this we lost sight of the object and were unable to find it again.",
      "link": "http://www.nuforc.org/webreports/068/S68177.html",
      "state": "TN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8aa6",
      "summary": "Object came from west to east at about 200-300 m.p.h.,object was on fire with black smoke trail behind it. Obect did not appear to be l",
      "city": "nashville",
      "shape": "fireball",
      "date": "2010-04-13T00:00:00",
      "story": "Object came from west to east at about 200-300 m.p.h.,object was on fire with black smoke trail behind it.  Object did not appear to be losing attitude.  Visible for about 30 sec.   I was traveling on highway 46 east behind sister brother-inlaw up very large hill towards Brown count state park.  Could not miss this site!   Never will forget this!  I heard that this was seen over lots of northern parts of Indiana.  My guess is possible old satilite reentering atmosphere.",
      "link": "http://www.nuforc.org/webreports/074/S74497.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b92d9",
      "summary": "UFO CASEBOOK REPORT:  Alien Encounter in Tennessee",
      "city": "nashville",
      "shape": "unknown",
      "date": "2010-05-12T00:00:00",
      "story": "Alien Encounter in Tennessee Peter, this is B J Booth, webmaster of UFO Casebook, and guide at about.com UFOs and Alien site.   I am sending this on behalf of a witness, who works for a law firm in Tennessee, and relates an alien encounter.  I am including her contact phone number in the appropiate section. Alien Encounter - Alien Encountered in Cheatham County, TN  I reside in Cheatham County, Tennessee, and observed an alien in my yard in February this year. The reason I am coming forward is because the description the woman in Georgia provided of the 3 alien beings she observed at a campsite where she and her husband were camping the latter part of 2009 is almost exactly the same as what I saw. It was approximately 5:00 in the morning.  There was still snow on the ground from the last snow.  I had gotten ready for work and was sitting in my Suzuki in the drive letting it warm up before leaving for my job in Nashville, Tennessee. I caught movement out of the corner of my eye in the area of my garage (which is used for storage and not to pull a car into).  At first, I thought it was one of the neighbor's dogs. I turned to look and saw something which very closely matched the description of the alien creatures which the woman in Georgia observed. Its body, extra long arms and hind legs were so thin.  Its head was very large and bumpy. It was pale in color and hairless. It was very cold outside, and the creature appeared a light grayish color (I'm not sure whether the cold temperature would have affected the appearance of the color). The only difference in my story and hers is that the 3 creatures she saw were upright.  This was moving on all 4's, however, the way it was moving made it appear like a monkey or gorilla that are oftentimes upright, but then use their arms in conjunction with their legs to propel themselves forward. On all 4's, it was about the height of a large dog, and I observed that it would be considered short, compared to most humans, if it stood upright. Its legs were short, quite a bit stockier than the body and arms, which were long and skinny. It kept looking back as though it thought it was being followed, and so it was surprised to see me sitting inside the automobile when it looked around, directly at me, for the first time. I got a good look at its large, round eyes which were darkish in color.  They appeared a dark brown.  It was as though it sensed I wasn't going to hurt it, and it continued on across my yard, across the road, and continued out a connecting road which is directly in front of my home. There are lots of wooded areas in the direction it was traveling, and lots of wooded area behind my home. I am not comfortable just ignoring this occurrence. Questions are racing through my mind - questions which need to be answered. What are these creatures doing in our wooded areas, hiding out by day and wandering by night?  Where did they come from?  Are they depleting any of our resources?  Will they become dangerous if someone acts aggressively toward them?  (I was so busy looking at its eyes and bumpy head that I cannot describe a nose and/or mouth.)  I am a sane individual who is employed at one of Nashville's most prominent law firms. ((NUFORC Note:  Witness, and source of report, indicate that date is approximate.  We express our gratitude to B. J. Booth, of UFO Casebook, for sharing the interesting report with NUFORC.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75071.html",
      "state": "TN",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9311",
      "summary": "Eccentric shaped object flying over my home",
      "city": "nashville",
      "shape": "unknown",
      "date": "2008-08-12T00:00:00",
      "story": "Eccentric shaped object flying over my home I was a roughly rectangular object with 6 \"extensions\" flying over my home and videotaped it.  Bluish on the bottom and a hint of yellow on \"top\".",
      "link": "http://www.nuforc.org/webreports/064/S64392.html",
      "state": "TN",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b93c3",
      "summary": "it zoom a cros the sky very fast",
      "city": "nashville",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "it zoom a cros the sky very fast we saw it jest fly a cros the sky it was about 3,000 ft and we watched it fly acros the sky very fast faster then i normle ari plan ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73276.html",
      "state": "TN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9792",
      "summary": "NUFORC Home Page Web Report Indexes : by Event Date | by Location | by Shape | by Posting Date National UFO Reporting Center Sighting R",
      "city": "nashville",
      "shape": "oval",
      "date": "2009-06-09T00:00:00",
      "story": "NUFORC Home Page Web Report Indexes : by Event Date | by Location | by Shape | by Posting Date National UFO Reporting Center Sighting Report Occurred : 12/12/2004 22:00 (Entered as : 12/12/1904 22:00) Reported: 12/13/2004 11:33:08 PM 23:33 Posted: 12/14/2004 Location: Nashville, TN Shape: Light Duration:30 min. Lights circling inside clouds over Nashville  My wife and I were driving on I-40 westbound on Sunday night, coming back to Nashville from east Tennessee. After passing the Lebanon exit, I began noticing lights moving inside the clouds closer to Nashville. As we got closer, I could tell that they looked like spot lights shining down from above or inside the clouds instead of from below, and they were moving in large circles. This night we saw two of them moving in large circles and figure eights from east to west over Nashville. One of the main reasons I became so interested was that my wife and I have seen similar lights before. I filed a report back in 8/03 about lights we saw clrcling around inside the clouds during a big thunderstorm. We had pretty much conviced ourselves that this earlier sighting was a spotlight promoting something, or maybe lights from the Starwood Ampitheater, which we're kind of near (although I don't know why anyone would have continued to shine these types of lights during one of the biggest thunderstorms of the summer). These lights looked almost exactly the same and were moving in almost the same fashion, except there were only two instead of four. So now we had a chance to try to find the source of these lights and prove to ourselves that we weren't seeing anything out of the ordinary. We closed in on the city from about 30 miles out and the lights became increasingly obvious. I'm sure other cars must have seen them, but there's no way to know. I had slowed down a lot because I was fascinated by these lights clrcling and seemingly swooping around just above the cloud ceiling. We kept expecting one to become more visible or distinct though a break in the clouds, but it never happened. They stayed very fuzzy and shapeless. The lights would circle opposite each other, then move together and back apart or do some crazy zig zag. However, we never saw a beam of light from the ground, and that was primarily what we were looking for. We got off the interstate on Stewarts Ferry Pk., when we thought we were finally getting below the lights, and went east. I was driving, but my wife could still see them northeast of us, so I took a left on Lebanon Pk and went north. Now we were very close to the Nashville airport, but the general movement of the lights seemed to be to the northwest and we could never get under them. We were also getting around more city lights and it was harder to see them, and they seemed to be farther away from us. We were tired from our drive so we went on home, but we satisfied ourselves that these lights were not originating from spotlights on the ground. I don't know that it proves anything about the first lights we saw, but it makes me wonder. I know other people must have seen these lights, as they were all over above the city, so I'm hoping someone else will come forward. THIS IS EXACTLY WHAT I SEEN 4/16/09 (of which I posted here) I feel so much better knowing someone seen the same thing 5 years eariler.  The cloud thing is interesting though.. It was like they not want to go beneath the cloud cover, but I could see them clearly once they connected together in the cloud clearing. The cloud thing is strange, it was between walmart and kroger on the busiest street in Nashville, near a communication tower... odd and very strange... I have calmed down a little since then but I cannot enter my apartment without thinking about what I saw. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70265.html",
      "state": "TN",
      "duration": "2min"
    },
    {
      "_id": "64d005f478aba2ec5a3b987a",
      "summary": "Multiple Red Orange luminous obects flying in formation over Nashville, Tennessee",
      "city": "nashville",
      "shape": "sphere",
      "date": "2009-08-05T00:00:00",
      "story": "Multiple Red Orange luminous obects flying in formation over Nashville, Tennessee Approximately, 8:55 pm CDT, Saturday, July 18, 2009, 7.7 miles northeast from Nashville, Tennessee. I witnessed Red Orange luminous objects flying from northwest to southwest.  There was 1, 2, 3, 4, 5 luminous objects, and disappearing as they go southwest. Another group formed a line of 5 with equal distance.  One of those objects broke off going west and another one went east. Next, 5 more objects flew in the same pattern. Then 4 objects together flew in a diamond formation.  One of the four seemed illuminated brighter than the others within the group.  I saw these objects in a clear night sky.  When the unidentified flying objects flew over the area the dogs in the neighborhood began to bark. I did not recognize any sirens going off at the time. These objects did not have any engine sounds coming from them like a conventional plane, military aircraft or helicopter.  There was no starboard, port, or flashing lights emitting from these objects.  They stayed in a consistent glow except for one that came at the end.",
      "link": "http://www.nuforc.org/webreports/071/S71157.html",
      "state": "TN",
      "duration": "15 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9991",
      "summary": "Blurry blob of light streaking through sky above a cloud",
      "city": "nashville",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "Blurry blob of light streaking through sky above a cloud Last night I was outside at approximately 23:30.  I was on the west side of my house between my house and my neighbor’s house.  I was walking northward towards my back yard.  There were a few low clouds that were mostly transparent.  I saw a streak of light traveling from east to west above one of the clouds.  Because I saw it through the cloud, it was kind of blurry.  It was traveling very fast, and it only lasted a few seconds before it flew out of site behind my neighbor’s house.  My first thought is that it was a meteor.  However, I watched a meteor shower several weeks ago, and this “streak” traveled a longer distance than the meteors I’ve seen.  It was also traveling the opposite direction of the meteors I saw a few weeks ago.  (I admit that I don’t know much about meteors, and I assume they can travel in any direction.)  However, this streak didn’t look as long as the meteors I saw and it lasted longer.  My next thought is that it was a spotlight, but! I searched the horizons, and I didn’t see any spotlights shining up and moving around.  My last explanation was that it could have been some light refracting through the corner of my glasses lenses, and it created some sort of optical illusion.  However, there were no cars driving by or any other moving source of light that could have caused that.  Also, since I’ve worn glasses for years, I can say that I have never experienced an optical illusion of a light in a cloud due to refracted light though my glasses.  It was too fast to be a plane, plus there was no noise.  It was most likely a meteor, but it didn’t look or behave like the meteors I’ve seen.  But I admit that may be because my sight of it was distorted though the low thin cloud.  I would say that the chances of this being some sort of ET craft is very low, but since I couldn’t positively identify it, it was a mystery to me, and therefore, a UFO.  I just wanted to report it so that there would be record of it in c! ase someone else saw something, too.",
      "link": "http://www.nuforc.org/webreports/073/S73415.html",
      "state": "TN",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d74",
      "summary": "Two craft sighted in the night sky over Nashville, NC, flying in a North Northeast direction.",
      "city": "nashville",
      "shape": "oval",
      "date": "2009-05-12T00:00:00",
      "story": "Two craft sighted in the night sky over Nashville, NC flying in a North Northeast direction. On Friday April 17, 2009 at approximately 22:36 hours a friend and I witnessed two objects in the sky over Nashville, NC. These objects flew side by side at a high rate of speed emitting no sound and leaving no vapor trail. They flew at a steady speed and at a constant distance apart from each other. There were no lights on these craft and seemed to be reflecting ambient light from the material they were made with. It resembled a semi polished aluminum or titanium. The craft flew in a North, Northeasterly direction. The speed at which the craft traveled was comparable to that of a low flying military fighter. The craft seemed to be approximately 20-25,000 feet in the air. I am no flight expert but it seemed to be at an altitude slightly higher than what a helicopter would fly. The craft appeared to be flying in a formation with one slightly ahead of the other. As stated before, these craft traveled without making a sound. I only noticed the objects because I had went outside to smoke and happened to be looking at the stars noticing what a clear night it was. The objects seemed to be round or a slight elliptical shape. This is the second time I have witnessed unidentified objects. The other sighting was approximately 17 years ago near Warrenton, VA. That sighting was confirmed by documentation with a government agency of other reports.",
      "link": "http://www.nuforc.org/webreports/069/S69688.html",
      "state": "NC",
      "duration": "7-8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5f1",
      "summary": "Nothing like I have ever seen before.",
      "city": "nashville",
      "shape": "teardrop",
      "date": "2008-10-31T00:00:00",
      "story": "Nothing like I have ever seen before The sighting was very brief.  I have lived in the mountains my whole life and I know what a shooting star is and this was no a star.  I was in the city not more than a mile from where I live.  You really can't even see the stars from where I was.  We walked out of the bar where we had had a few drinks.  I looked up and saw a large light moving across the sky.  This was no star!!!!!  I guess if you want the color it was white.  WHY IN THE HELL DO YOU WANT THE BACK GROUNDS OF THE OBSERVER!!!!!!!  Either you saw it or you didn't.  Believe me I feel like an ass even writing this.   All I know is there was something in the sky that I have never seen in my life!!",
      "link": "http://www.nuforc.org/webreports/066/S66379.html",
      "state": "TN",
      "duration": "5 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6b1",
      "summary": "I went to get a pack of cigaretts, only a 2 min walk... but I drove because I felt lazy.  got my cigarettes... walking back to my apart",
      "city": "nashville",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "I went to get a pack of cigaretts, only a 2 min walk... but I drove because I felt lazy.  got my cigarettes... walking back to my apartment and halfway up I notice a light in the sky, no big deal...it look sort of like a search light.... I live on a hill... a great view.... Im looking for where it is coming from. Country music awards tonight but in Las Vegas... still I figure perhaps a satilite celebration.  but the speed of the lights and the fact that they were above the clouds sorta of freaked me out.... just KNEW in my heart that this was not normal....... I kept walking up the stepts, a storm has passed through tonight a lot of cloud cover but stil a few open spots... Im looking at the light... so very bright... shining through the cloud... but I could not get my brain around it. at the top of the stepts I notice another light flying in the same \"all over the place pattern\" 2 seconds... they Both meet in a clearing in the clouds..... and I lost it........  Totally freaked out..... two bright orbs touched for a brief second and then seperated...... I'm thinking am I the only person in this town that see's this?????????  My hands were shanking when I got to my apartment.  Very odd, and it scared the sh&t out of me.  If anyoneone from the Davidson county area saw anything please post ok. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69554.html",
      "state": "TN",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba904",
      "summary": "myself,and three other people i knew very well in school and growing up,were all standing around talking having fun kidding joking reme",
      "city": "nashville",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "myself,and three other people i knew very well in school and growing up,were all standing around talking having fun kidding joking remembering things we did in school together,and other stuff like that.during our bs sessioni kept noticing a very bright star below the moon or maybe a planet i was thinking. my friends saw me looking at it many times i kept thinking how bright it was, blue white briliant color,and i guess they noticed i was ignoring them i just couldn't help but stare at it.we all were looking at it the moon was about the size of a dime it was a full moon,and  the ball started moving slowly to the northeastern direction it emitted a megaphone shaped light you could see mist moving thru it  as it was emitting the yellow white lite we all were freaking out because we couldn't believe what we saw the object was the size of a 1mm diameter oval circular shape but larger than the stars around it and behind. there was no noise  other than a sound like! it was cutting thru the air when the light was emitting,the light stopped after aproximately 30 seconds everybody was yelling and we all were totally shocked. the object  moved off a little more eastern and it dropped down a little bit and turned almost like when you put copper dust on a flame it turned green orange slightly ,and shot off  so fast we saw a red streak of light and was gone. we all just looked at eachother for a moment,and i just said wtf was that . no one had been drinking or anything; all the events are accurate as i can remember. i dont really know if my friends ever reported it ,but i did here now.........",
      "link": "http://www.nuforc.org/webreports/078/S78264.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baa17",
      "summary": "The Object proceeded over our location in response to an interactive action.",
      "city": "nashville",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "The Object proceeded over our location in response to an interactive action. I am forever amazed at the number of so-called experts in this field of study… who profess to know what is authentic evidence... and what is not.  I am appalled at the censorship of reports that MUFON receives. If it doesn’t fit their criteria of benefit, they move it to a hidden file. I know… I was a MUFON Investigator! You guys can’t seem to get past the limitations of digital technology to analyze what is real… and what you state is not.  Since most experts who sell books and lectures have very little experience, regarding the information that they weave into their sales and lectures, than maybe the chase of this anomaly will gather no real and substantial foundation other than the sensationalist venue where it has thus been historically  limited.  I suppose… that is good for cover-up and book sales.  But for the eye witness, you know in your gut… that which is real. You need not rely upon people, or experts, or anyone else to validate your experience. Let he who has eyes, let him see!   ((name deleted)), F.I. Nashville, TN",
      "link": "http://www.nuforc.org/webreports/077/S77862.html",
      "state": "TN",
      "duration": "1 min."
    },
    {
      "_id": "64d005f478aba2ec5a3baa2e",
      "summary": "My wife and I regularly hike in the Brown County State Park in the evenings. On our drive home at about 8:55 p.m., we passed a cleared",
      "city": "nashville",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "My wife and I regularly hike in the Brown County State Park in the evenings.  On our drive home at about 8:55 p.m, we passed a cleared lookout spot on top of one of the park’s hills and saw several very bright, yellow-orange lights, stationary in the sky, northeast of our location.  We parked and got out of the car immediately, and then stood in the dark watching these lights for the next four minutes approximately. The park has many of these scenic overlooks where trees have been removed and people can pull their cars off the roads and view forested hills, perhaps as far away as 15-25 miles.  Brown County is very rural and covered with forested hills.  There is no town, or towers, or any high structures in the direction of these lights.  However, Camp Atterbury, a military camp, is about 10 miles east of this location. For the next four minutes or so, we watched these lights come on, stay lit about 30 seconds or so, and then go off, fading quickly. We noticed as one light would go out, another would often come on in another location. Often, the lights seemed to be grouped in a diamond-shape pattern, but this shape changed as a light would go off. We saw as many as 5 lights at one time, and as few as one, before all of them went completely out. They appeared, at first, to be stationary, but through careful observation we noticed that lights would go slightly out of alignment with each other, suggesting very slow movement. We wondered if these lights were attached to a larger shape or form that we could not make it out. They were bright and it was getting dark. It is also hard to say how far away they were from us with any accuracy. They may have been a mile or so away. Even if they were as close as a mile away, the lights themselves would be rather large and exceedingly bright. If they were! attached to a form, it would be gigantic. They may have been have been several hundred feet in the air and were above tree line. Becasue we do not know how far away they were, it is also hard to determine how high they may have been. My wife had her iPhone and located the direction of the lights (northeast from where we stood) and zoomed in to take a picture at a time when three lights were present. My son (age 24) and I watched similar very bright, yellow-orange lights one night, in the same direction, about 2 ½ months ago. They also went off and on as well; there were about 10 lights or so. At that time, we heard what sounded like thunder rumbling coming from these lights. When I asked him what they looked like to him, he replied, \"They look like the lights on the front of a stereo equilizer, moving slightly in relationship to each other.\"",
      "link": "http://www.nuforc.org/webreports/077/S77596.html",
      "state": "IN",
      "duration": "4 minutes approx"
    },
    {
      "_id": "64d005f478aba2ec5a3bace8",
      "summary": "Red and white with big window",
      "city": "nashville",
      "shape": "cigar",
      "date": "2011-05-02T00:00:00",
      "story": "Red and white with big window It was the shape of a cigar it was white and red.  It no wings.  When it was flying it was tilted over going up.  Couldn't be plane cause if it was it wouldn't be going straight up.  Big clear window with little human like figures in it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80965.html",
      "state": "TN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb13a",
      "summary": "craft seen over old hickory dam holding a quarter at arms lenth object was 3 times the size of the quarter beams seen coming from the n",
      "city": "nashville",
      "shape": "disk",
      "date": "2011-01-05T00:00:00",
      "story": "craft seen over old hickory dam holding a quarter at arms lenth object was 3 times the size of the quarter beams seen coming from the north hitting object the beams were white seemingly from kentucky object lowered into lake i suspect since lake was not visiable to me near the dupont chemical plant near old hickory dam in old hickory tenn and i left my vantage point to see three orange orbs pulsating from south east to northwest at size of 1 quarter at arms lenth which dissapeared out of sight this was a very strange thing to me so i want an answer",
      "link": "http://www.nuforc.org/webreports/079/S79208.html",
      "state": "TN",
      "duration": "10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb261",
      "summary": "Fireballs over East Nashville, TN",
      "city": "nashville",
      "shape": "fireball",
      "date": "2011-05-02T00:00:00",
      "story": "Fireballs over East Nashville, TN Outside smoking a cigarette with my roommate.  We're very close to downtown Nashville on the East side.  out of nowhere what appeared to be a fleet of slow moving fireball like objects moved across the sky.  They kept coming out of the horizon, with 2 staggering behind.   We have footage of the last 2 objects that are quite clear, sadly we didn't capture the big fleet.",
      "link": "http://www.nuforc.org/webreports/081/S81056.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb262",
      "summary": "Orange/Yellow fireball or flame inside round shape spotted in East Nashville traveling in steady pace.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2011-05-02T00:00:00",
      "story": "Orange/Yellow fireball or flame inside round shape spotted in East Nashville traveling in steady pace. On Saturday, April 30, 2011, at approximately 9:00 PM, while taking a break during band rehearsals in East Nashville, we were outside and happened to look up to the sky.  We saw what first looked like a hot air or weather balloon.  It appeared to be round in shape and almost looked like it was either a fireball or a flame inside the shape. It was of a orange/yellow color and appeared to be traveling Southwest to Northeast.  It was neither slow nor fast, but seemed to travel in a steady pace.",
      "link": "http://www.nuforc.org/webreports/081/S81080.html",
      "state": "TN",
      "duration": "1 min. 30 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bb29b",
      "summary": "A crazy. Red object appeared spinning around about a football field away very bright loud high pitch noice it hurt my ears",
      "city": "nashville",
      "shape": "disk",
      "date": "2011-04-03T00:00:00",
      "story": "A crazy.  Red object appeared spinning around about a football field away very bright loud high pitch noice it hurt my ears Bright red and white it was really a loud frequency noice that hurt my ears and it was about the altitude of treeline and after the objects appeared 15 min later 3 F-16 mil. Jets flew in the direction it went it was very loud when the UFO appeared ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80626.html",
      "state": "TN",
      "duration": "23"
    },
    {
      "_id": "64d005f478aba2ec5a3bb491",
      "summary": "a shiney  sitting in the skys over nashville",
      "city": "nashville",
      "shape": "egg",
      "date": "2010-11-21T00:00:00",
      "story": "a shiney  sitting in the skys over nashville the object was hoovering in on spot with the sun reflecting on it that's how it got my attention i checked to see if it was a glare from my win-shield i was talking on the phone my friend said i was on drugs i hung up and tried to record the sighting on my phone it vanished it was not a plane helicopter or any other man made flying object because the sky's were empty within 5 or six seconds it was very shiny even with my window rolled down it was a ball shaped object the time was around 3:46pm",
      "link": "http://www.nuforc.org/webreports/078/S78855.html",
      "state": "TN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4e6",
      "summary": "First Military Planes, Then Comes The UFO.",
      "city": "nashville",
      "shape": "sphere",
      "date": "2011-02-18T00:00:00",
      "story": "First Military Planes, Then Comes The UFO. At around 8pm, my brother and I witnessed strange occurences in the Nashville night sky.  We noticed alot of aircraft flying in the same direction(west).  Moments after, this strange beam of light appeared in almost the exact location of the other crafts.  It just sat there for about fifteen minutes then slowy move toward the west. We see alot of aircrafts coming and going form Fort Cambell and this was no ordinary craft. My first reaction was maybe a ufo had crashed, that would explain all of the aircrafts in the area.  I believe that people will see alot of human aircrafts right before seeing a ufo because the military knows about ufo's.",
      "link": "http://www.nuforc.org/webreports/080/S80023.html",
      "state": "TN",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb779",
      "summary": "Bright red/ orange lights over ashland city/ nashville disappears behind trees.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2010-08-30T00:00:00",
      "story": "Bright red/orange lights over ashland city/nashville disappears behind trees. I was standing on my back porch staring at the sky because of how clear it was out, and I noticed a bright orange/red light in the sky moving ever so slightly.  It started moving in L shaped directions in short intervals. it looked like it was over near ashland city, over the mountains. it moved in sharp right angle turns until it went into some trees.  I tried to watch it more, but the tree line obscured my view. I ran over to my  brothers house to get my mother to see it, but she was on the phone and couldn't leave.  This lasted for about 30 minutes near my house. Ive been an avid sky watcher for years now, but this is the first report Ive made.",
      "link": "http://www.nuforc.org/webreports/077/S77414.html",
      "state": "TN",
      "duration": "30 MINS"
    },
    {
      "_id": "64d005f478aba2ec5a3bb73d",
      "summary": "Silent White Orb UFO followed by other Unidentified Craft",
      "city": "nashville",
      "shape": "circle",
      "date": "2010-08-30T00:00:00",
      "story": "Silent White Orb UFO followed by other Unidentified Craft August 24, 2010 On August 24, 2010 around 8 pm or so, my girlfriend and I were relaxing outside our apartment in West Nashville, TN.  The sky was clear, with a full moon illuminating the sky considerably. While looking at the moon we witnessed a very bright, solid white, orb-like object float into our field of view.  We don’t know where it originated from as it seemed to have simply appeared. As we watched the light, we witnessed it accelerate fluidly and slow down just the same.  The object was able to make left, right, up, and down movements while changing altitudes quickly.  This object was totally silent, and it traversed the length of our house, but must have been at least a couple of miles away.   The light then moved behind the trees just behind our house.  Yet, being as bright as it was, we were still able to maintain visual contact and track its movement.  We were at this point standing on my neighbor’s porch, my girlfriend on my right, when the object vanished.  Simultaneously, a shooting white light shot off into space faster than lightening.  The light trail was almost imperceptible to the eye, and it’s duration a fraction of a second.  Almost like a reverse shooting star. At this point, we were stunned because we knew it was like nothing we had ever seen.  As we sat and discussed the object/light, we continued watching the sky. It couldn’t have been mo re than 5 or ten minutes since the other object vanished when we began to see multiple high-altitude aircraft flying towards the area where the object had been.  These aircraft made no sound, and had blue and red quick flashing/blinking lights.  These lights flashed quickly and they appeared to be set in a rectangular shape or pattern.  One after another, these aircraft continued to appear at what looked like the same altitude and speed; the latter being hard to estimate.  At one point, it appeared these craft were assuming a triangular formation or were flying in a formation directly above where we witnessed the first object. I estimate seeing at least 10 of these aircraft, and I do not believe these were commercial aircraft.  I think it’s possible they were military in nature, and that they also may have been circling the area.  These aircraft eventually disappeared, maintaining the same direction, speed, and altitude.",
      "link": "http://www.nuforc.org/webreports/077/S77420.html",
      "state": "TN",
      "duration": "30 minutes (+or-)"
    },
    {
      "_id": "64d005f478aba2ec5a3bbaeb",
      "summary": "Huge Diamond shaped object full of lights and flying very low to the tree tops with no sound emitting",
      "city": "nashville",
      "shape": "diamond",
      "date": "2010-07-06T00:00:00",
      "story": "Huge Diamond shaped object full of lights and flying very low to the tree tops with no sound emitting I was driving home from work about 9:45 on HWY 40W between mile marker 191 and 192 when a huge object caught my eye hovering over the tree tops in front of me, going in the opposite direction.  It was almost right above me.   It moved slowly and I followed it as long as I could before I had to get my attention back on the road, about one min.   I didn't pull over, I really didn't know what to do, I just immediately started calling people.  It was way too big & way to lit up and much to low to the tree tops to be an airplane.    It was in the shape of a diamond, almost a triangle but much wider.  It had lights all along the wide base and up the sides that met together into a point.",
      "link": "http://www.nuforc.org/webreports/076/S76076.html",
      "state": "TN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bc9cf",
      "summary": "Round fiery object moving across the sky at the same speed a plane travels.",
      "city": "nashville",
      "shape": "circle",
      "date": "2011-08-07T00:00:00",
      "story": "Round fiery object moving across the sky at the same speed a plane travels. We have a skyline view of all of Nashville.  Object was moving at the same speed that planes do through the sky (we watch them land).   Round object, fiery orange, looked like there was a flame inside at the bottom.   Thought it was a hot air balloon at night, but it moved too fast.   Moved out of sight and went up in the sky.",
      "link": "http://www.nuforc.org/webreports/082/S82761.html",
      "state": "TN",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bce5a",
      "summary": "Rumbling noise, lights, multicolor lights, medium speed going across the sky.",
      "city": "nashville",
      "shape": "oval",
      "date": "2011-05-29T00:00:00",
      "story": "Rumbling noise, lights, multicolor lights, medium speed going across the sky. I was sitting inside my house watching television and all of a sudden I heard a very loud and robust rumbling outside my house so curious to what it was I opened my front door and looked outside and saw 2 white lights and 2 multicolor lights in an oval formation going at a medium sort of speed, not very fast but not slow. The rumbling noise was very very unique and I've never heard anything like it before.  After standing in awe for a few minutes or so I grabbed my phone in my pocket and tried to get some pictures of it but the quality is horrid and you can't even make out the lights at all.  I've tried taking pictures of the moon and stuff before with my phone camera but it never comes out right on the black and the quality of the camera.  A minute later the lights disappeared behind the trees and the rumbling was slowly getting less and less prominent.  Soon it completely stopped and I just went back inside in pure shock.",
      "link": "http://www.nuforc.org/webreports/081/S81336.html",
      "state": "NC",
      "duration": "6 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcf9a",
      "summary": "In October 1961, a silvery flattened disk hovered motionless over a local school fair for more than 30 minutes.",
      "city": "nashville",
      "shape": "disk",
      "date": "",
      "story": "In October 1961, a silvery flattened disk hovered motionless over a local school fair for more than 30 minutes. I saw an unidentified flying object in the fall of 1961 or 1962. I was 11 or 12 years old at the time, and I was attending a fall fair with my parents at my elementary school.  Several hundred people were in attendance at this fair.  There were numerous rides for the kids and there were plenty of colored flashing lights all over the place.  One of my friend's dad was an amateur astronomer and had set up his telescope for people to see the moon and the planets. At some point, a UFO appeared out of nowhere.  It was a silvery flattened disk with 2 or 3 portholes on the side. It was not a shiny silver color but had a sort of dullness to it.  It remained completely motionless over the large field where the fair was in progress.  It had an oscillating glow between red and green.  I cannot recall how high the UFO was but you could see it fairly well with the naked eye.  Many people observed the UFO through the telescope.  When I looked through the telescope, I could see that it appeared to be fairly bright inside the UFO but I did not see any life or movement inside.  Some one placed a call to either the local police or to the Tennessee Air National Guard which was located just a few miles away from the school. Two (2) jets were scrambled, and you could hear them approaching very quickly.  As they approached, the UFO took off at a very oblique angle, no sound was made, and the departure was faster than you could blink your eyes. I am now 62 years old, and I have never forgotten that night.  From time to time, I have tried to find information on the internet about this incident but without success. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91468.html",
      "state": "TN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7d7",
      "summary": "Yellow/Orange/Red Sphere seen in up close, in Middle TN.",
      "city": "nashville",
      "shape": "sphere",
      "date": "2012-07-04T00:00:00",
      "story": "Yellow/Orange/Red Sphere seen in up close, in Middle TN. I was walking from my bedroom into the living room when something caught my eye. From my living room door, which is comprised of a solid glass panel, I witnessed a sphere, spinning outside, hovering approximately 6 inches above the concrete slab patio. The sphere was very close to my door, less than 3 ft from where I was standing inside. It was larger than a basketball, solid, and perfectly symmetrical. There were dime sized holes covering the sphere, perfectly spaced, approximately 1.5 inches from each other. Bright lights were emitting from these holes, changing colors, from red to orange to yellow. The sphere was spinning slowly and horizontally, from left to right. I was so stunned that I stopped in my tracks. I watched the object, while I called out in wonder to the individuals in an adjacent room, who could see me looking outside. They kept asking, “What is it?” so I turned to tell them, and when I looked back, the object was gone.",
      "link": "http://www.nuforc.org/webreports/089/S89995.html",
      "state": "TN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd1b",
      "summary": "Round lights circling for hours-no noise and quite fast-not spot lights!",
      "city": "nashville",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "round lights circling for hours-no noise and quite fast-not spot lights! while taking my dogs out I turned to see a ball of light-which I initially thought was a spot light-put realized there was no beam from the ground-it was circiling in a fashion that was constant but occasionally would change as far as speed and distance-after wtching the activity-I kn ew it was not normal aircraft such as a helicopter-no noise and moving too fast-I then noticed in the distance-many miles away-two more lights moving in coordination of each other-again in a circular type fashion and too fast to be aircraft like helicopter-I took video with my phone-video camera was dead-I witnessed these lights for nearly an hour-the first light disappearing after about 45 min.-my opinion was that it was nothing I had ever seen before and very strange-will have my video camera ready tonight.",
      "link": "http://www.nuforc.org/webreports/093/S93715.html",
      "state": "TN",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd5a",
      "summary": "Two lights flying in random patterns over Nashville.",
      "city": "nashville",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "Two lights flying in random patterns over Nashville. Two lights appearing above clouds.  Moving in random rapid patterns.  Sometimes both appearing to fly together, then one would stop and very quickly shoot off in the opposite direction.  I observed for 20 minutes.  These were in the distance to the southwest.   My son spotted them coming homr from work and called me.  He said they appeared closest to him when he was near Harding Place an I-65. I thought they might have been spotlights, but the lights were coming from above not below.  Not only was the pattern random, so was the speed, but generally they moved much faster than an airplane.",
      "link": "http://www.nuforc.org/webreports/093/S93709.html",
      "state": "TN",
      "duration": ">20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bddc4",
      "summary": "Extremely Low white circle moving horizontally in sky vanishing.",
      "city": "nashville",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "Extremely Low white circle moving horizontally in sky vanishing. Me and my husband were on the  on ramp to interstate 24 from Bell Rd. In front of the Percy priest dam. I happened to look up and saw a Very low bright circle light. My first thought was an airplane because we are right next to the air port. But that wasn't the case. It was just above the tree line. My next thought was a shooting star but it was Way too low and had no tail. Basically it was moving in a horizontal  line, moving at incredible speed.  I watched it from about half my windshield to my driver side window. Until it completely disappeared.  It didn't fade away, or get smaller. It was almost like it vanished or went into some kind of hyper speed. When it disappeared the light got slightly wider.It was so low and apparent, I had time to realize this was not any kind of helicopter or air plane even a military jet. Second thought was a torpedo and I'm about to see a large blast.  This was non explainable.    Almost no words can explain what we saw.  I almos! t crashed the car because of what I watched transpire in front of me.  It was round, with a white glow. The hairs on my head stood up, and im still in shock.  It was so fluid of a motion that it looked like it was held up by a sting.",
      "link": "http://www.nuforc.org/webreports/088/S88358.html",
      "state": "TN",
      "duration": "less then a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bdff3",
      "summary": "4 objects not visible to the naked eye, flying around odd vertical \"rainbow.\"",
      "city": "nashville",
      "shape": "unknown",
      "date": "2012-11-04T00:00:00",
      "story": "4 objects not visible to the naked eye, flying around odd vertical  \"rainbow.\" Driving home at 5pm headed towards the city from Elm Hill and 40-W I saw a small vertical rainbow in the sky.  I pulled over to take a few pictures, since the vertical sliver of rainbow was something I had never seen.  When looking at the camera screen I noticed 4 objects flying around the&quot; rainbow&quot;. I looked without using the camera and could not see the objects with the naked eye.  I once again looked at the screen and the objects were still moving around the \"rainbow.\"  I did this several times with the same result. I cleaned my lens, as well as checked my camera by taking photos of other things in the area.  This was not a dirty lens.  The objects could be disc shaped but it is hard to tell.  I have a series of photos.",
      "link": "http://www.nuforc.org/webreports/093/S93975.html",
      "state": "TN",
      "duration": "several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdff1",
      "summary": "WE SAW A GREEN BALL SHAPE FALLING OUT OF THE SKY AT 6:10 AM ON TUESDAY OCTOBER 30TH 2012...IT WAS VERY LARGE BUT WAS GONE IN 5 OR 10 SE",
      "city": "nashville",
      "shape": "circle",
      "date": "2012-11-04T00:00:00",
      "story": "WE SAW A GREEN BALL SHAPE FALLING OUT OF THE SKY AT 6:10 AM ON TUESDAY OCTOBER 30TH 2012. IT WAS VERY LARGE BUT WAS GONE IN 5 OR 10 SECONDS. I WAS ON MY WAY TO WORK ON I-40 TO NASHVILLE, TN, COMING FROM HERMITAGE TN..",
      "link": "http://www.nuforc.org/webreports/093/S93970.html",
      "state": "TN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be2ad",
      "summary": "White light on small lunar lander shaped object.",
      "city": "nashville",
      "shape": "other",
      "date": "2012-10-30T00:00:00",
      "story": "White light on small lunar lander shaped object UFO Sighting I was driving north on second ave. Downtown Nashville TN. While stopped at a traffic light on the corner of 2nd ave.  And Korean veterans pkwy.  I saw a white light coming towards me traveling in a southwestern direction.  At first i thought it was an airplane but then i noticed it was lower than it seemed.  There was a tall building in front of me and i thought since it was of normal airplane altitude, it would go behind the building, but it went in front of the building. S o then i knew it was quite a bit lower than it seemed.  Maybe 100 feet off the ground.  I was able to get a pretty good look at it considering it was quite low.  It looked like a very small lunar lander, maybe 3 to 4 feet across.  It seemed to have very stable flight, very smooth.  Ruling out a flying toy or something like that.  It was traveling at about 30 to 40 MPH.  The street light turned green and i started moving while continuing to watch it as it moved passed me still traveling in a southwestern direction.   I then stopped at the next light and looked for it again and found it on the same path but climbing higher.",
      "link": "http://www.nuforc.org/webreports/093/S93926.html",
      "state": "TN",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be38c",
      "summary": "Huge bright object the size of a house slowly traveling across sky",
      "city": "nashville",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Huge bright object the size of a house slowly traveling across sky. I was traveling towards Hermitage from Donelson and saw a huge ball of bright light the size of a house traveling at a slow steady pace.   I cannot figure out what this could have been could not have been a meteor it was traveling too slow.   I considered myself a skeptic about UFOs until now.  Very scary object.",
      "link": "http://www.nuforc.org/webreports/093/S93959.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf08d",
      "summary": "Round from the distance/slowly changing colors and hovering.",
      "city": "nashville",
      "shape": "light",
      "date": "2013-09-30T00:00:00",
      "story": "Round from the distance/slowly changing colors and hovering. Going to my car I noticed lights.  It was changing from red, green, and white.  I went to get my daughter so she could see.  We went out to the roof and watched until it was out of sight.",
      "link": "http://www.nuforc.org/webreports/102/S102276.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0ff",
      "summary": "Triangle/ three lights/ silent/ lights went out one at a time until you didn't see it.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2013-09-30T00:00:00",
      "story": "Triangle/ three lights/ silent/ lights went out one at a time until you didn't see it. My daughter and I were pulling out of the gas station and my daughter noticed it.  There were three lights in triangle shape.  Flying low enough where some kind of noise should have been heard.  Thee lights then two then none.   Second time this week.",
      "link": "http://www.nuforc.org/webreports/102/S102277.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf13e",
      "summary": "It was a blue glowing orb made from a membrane material that looked like it had an embro inside it",
      "city": "nashville",
      "shape": "oval",
      "date": "2013-02-04T00:00:00",
      "story": "It was a blue glowing orb made from a membrane material that looked like it had an embro inside it ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95808.html",
      "state": "TN",
      "duration": "8 hrs at least"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3ef",
      "summary": "Bright white light or spinning object.",
      "city": "nashville",
      "shape": "changing",
      "date": "2013-05-15T00:00:00",
      "story": "Bright white light or spinning obetct A friend and I were walking around downtown Nashville for exercise about 11:45 AM Saturday April 13th when a white bag flying through the sky just caught our attention.  As we looked at it floating a thousand or so feet to the northeast, we noticed a very faint light or a white abject that had to be at least 30 thousand feet in the sky changing shapes and directions.  It would have been the size of a star or maybe the size of Venus if the stars were out, maybe a little larger as I could tell there was movement.  It was directly above and beyond the bag and very hard to see and would not have noticed it otherwise.  The object was moving in a general SE direction but would take slight jumps up down and back and forward.  The movements were not smooth and very abrupt jaunts going back in the direction it came and then seeming to stop and then move on.  The object was either spinning and a shinny side was catching the sun or there was a light flashing. We could not ! tell. We watched the object for about 5 minutes and then lost site of it as we looked away. In those five minutes it would have traveled from the 12 o clock position to the three o clock position toward the sun.  If there was sound we could not tell as we were on a busy street.  There was a slight breeze and the temperature was about 66 degrees with almost totally clear skies.  There was not vapor trail left by the object.  I was able to view the object a little better with my sun glasses on as did my friend and we both had polarized sun glasses.",
      "link": "http://www.nuforc.org/webreports/097/S97141.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf425",
      "summary": "Three white spheres separate, then connected and rotating in the afternoon.",
      "city": "nashville",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "Three white spheres separate, then connected and rotating in the afternoon. My two boys and I (ages 6 and 7) were playing baseball in the backyard when I just thought I should look up for a vague but unknown certain reason, if that makes sense.  \"Look! Parachuters!,\" I yelled, noticing two bright white spots just hanging in the sky, seeming to drift around.  The sky was a deep blue with just one large wispy feather-like cloud stretching from over our heads to the horizon.  Visibility was excellent.   One of my boys pointed out a third object.  We watched for a while as they moved further away, maybe higher, couldn't tell. I am terrible at judging heights, so I will not try to guess their altitude.  Two of them were in the same general area.  One was off to the northeast of the others.  My husband pointed out to the boys that these couldn't be parachuters because they were not coming down.   Then I decided they weren't going to vanish because they weren't darting around or just staying still like ufos are often reported to do.  I though! t they must be weather balloons. I ran inside, came back out with the binoculars and couldn't get an eye on them.  They finally got too far away to see.   I gave up, went in for water and ate a little snack, came back and there was another one, or one came back, just as low as when I first spotted them.  This time I supported my elbows on the trunk of my car and got a good look through the binoculars.  I watched this thing for about five minutes.  Maybe more.  There were three large spheres all apparently connected, and they were rotating, not like those balloon arches do that people think are space worms or whatever.  This was steady as clockwork. It was like the hand of a clock going around but the hand was made of spheres.  It did this the entire time I was watching.  For a while they were roating vertically, then turned horizontal. Its movement appeared to me to not be subject to the wind.  It was steadily sailing to the east with no variation in direction.  At one point, I don't k! now if it was the light reflecting or my eyes, but they had a ! rainbowi sh glow on the edges.  The object or objects appeared white.  They did seem to be connected. I watched until it got too small to see.",
      "link": "http://www.nuforc.org/webreports/097/S97168.html",
      "state": "TN",
      "duration": "~15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7d9",
      "summary": "Two bright star-ish lights moving parallel over Nashville sky.",
      "city": "nashville",
      "shape": "circle",
      "date": "2013-10-14T00:00:00",
      "story": "Two bright star-ish lights moving parallel over Nashville sky Looking straight up in the clear night sky, we saw what at first appeared to be 2 extremely bright stars.  But looking at them for a few seconds we saw that they were moving.  If you held your hand up at about 1 o'clock over your head they were about 3 finger widths apart.  No blinking lights.  No other signs that they may be aircraft or satellites.  There were other standard aircraft in the area - likely commercial flights so it was easy to tell the difference of these lights.  Just big bright white lights.  No glowing.  They simply moved off at a consistent speed (not too fast, but steady) in parallel until out of sight.  At first I thought they were part of a constellation - that's how much like a bright star they appeared.  No photos were taken. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103056.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf820",
      "summary": "Three bright orange lights seen flying low over east Nashville.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2013-10-14T00:00:00",
      "story": "Three bright orange lights seen flying low over east nashville 3 bright orange lights were scene one at a time over the course of 30 minutes.  Each orange light flew low over the city for about 2-3 minutes before completely disappearing.   A couple of minutes would pass  and the next would soon appear.  They flew in the same direction at the same speed.   They made no sound and had no other signs of being some sort of an aircraft.",
      "link": "http://www.nuforc.org/webreports/102/S102992.html",
      "state": "TN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd72",
      "summary": "Moving orange, round lights in the sky... 5 to 6 minues... 35 to 45 objects in random and changing formations.   Silent",
      "city": "nashville",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Moving orange, round lights in the sky... 5 to 6 minues... 35 to 45 objects in random and changing formations.   Silent Saw 5 or 6 bright lights coming over the horizon relatively slowly.  They seemed to be in some kind of formation, but the formation changed as they proceeded.  Then, several more formations come over... all behind the previous ones.   I could see air traffic in the area as well, and the planes were quite a bit smaller.  The planes were all 737's and MD-80's, at that is what flies in/out of BNA.  The lights made no noise.     They either burned out after 2 minutes or so, or became invisible as the passed over head.    It was difficult to tell the altitude, but these lights were very bright, large, and not any kind of aircraft.  I thought maybe debris from something coming through the atmosphere.. but no tails were visible. I took two videos with my phone that turned out pretty good, though it's difficult to determine the true scale because it was so dark outside.  They are too large to e-mail though.",
      "link": "http://www.nuforc.org/webreports/101/S101521.html",
      "state": "TN",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfeef",
      "summary": "Very bright, disk shaped UFO moved very rapidly above Briley Parkway in Nashville.",
      "city": "nashville",
      "shape": "disk",
      "date": "2013-09-30T00:00:00",
      "story": "Very bright, disk shaped UFO moved very rapidly above Briley Parkway in Nashville. I was driving East on Briley Parkway in Nashville TN today, about one quarter mile away from exit 11. Suddenly, a disk shaped UFO appeared in the sky. The UFO was a solid white color, that shined very bright in the sky.  The object moved very rapidly to the east.  After the object moved across the sky for around 55 seconds, the speed of the object increased even faster then disappeared after around 5 seconds.  My date witnessed this appearance as well, we both are still amazed.  I'm a Lending Manager/Banker here in Nashville. I have been in this profession for 8 years.",
      "link": "http://www.nuforc.org/webreports/102/S102745.html",
      "state": "TN",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bff1f",
      "summary": "Above is what I heard over a ham radio.",
      "city": "nashville",
      "shape": "formation",
      "date": "2013-07-05T00:00:00",
      "story": "Above is what I heard over a ham radio. Peter, I could not find how to email you this info.   A farmer outside of Nashville found a deflated and semi deflated weather balloon attached to some items last month.  The balloons were attached to a triangle of small fibreglass rods about six feet on each leg.  Styrofoam balls about the size of footballs were attached to these rods.  About two balls on each leg of the triangle.  The bottom half of each styrofoam ball was covered in red and yellow LED lights.  About eight AA batteries were glued into each styrofoam ball.  This must be what some saw as orange orbs flying over at night.  Red and yellow LED's make orange light.   This report was heard by a ham radio operator.  The farmer is a ham radio operator.  Please excuse the other data, I did not know how to get this message to you via email so I filled out this form.",
      "link": "http://www.nuforc.org/webreports/099/S99617.html",
      "state": "TN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c01f1",
      "summary": "Star like orb shoots thru sky seen in west Nashville.",
      "city": "nashville",
      "shape": "light",
      "date": "2013-06-02T00:00:00",
      "story": "Star like orb shoots thru sky seen in west Nashville. Glowing White Orb, star size from view, passed through the sky high speeds, no trail lost sight after 50 seconds under a minute. Was seen in west Nashville ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98220.html",
      "state": "TN",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c024b",
      "summary": "Three spheres in the N.E. sky departing in sequence on 1/7/2013.",
      "city": "nashville",
      "shape": "sphere",
      "date": "2013-02-04T00:00:00",
      "story": "Three spheres in the N.E. sky departing in sequence on 1/7/2013. Leaving work at 17:00 observed three bright spheres in the northeastern sky.  They hovered in a line for a period of several minutes.  The sphere on the left departed off into the sky in an easterly direction.  The other two hovered for a period of 2 to 3 minutes then the middle spheres departed in the same direction.  After another 2 to three minutes the last spheres departed on the same trajectory.",
      "link": "http://www.nuforc.org/webreports/095/S95869.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0490",
      "summary": "Orangish bright \"fireball\" low altitude flying through Nashville.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2013-02-28T00:00:00",
      "story": "Orangish bright \"fireball\" low altitude flying through Nashville My event is almost identical to the one described in October 2012 in Burns, TN.    I was driving in southeast Nashville towards Brentwood when I noticed a bright orange light at low altitude traveling northeast from southwest.  I am an avid sky watcher and have seen satellites, military jets, \"northern lights,\" and know the difference between planets and stars, natural phenomenon, etc.   My first thought was a helicopter, though the light was different and did not throw a beam nor where there any navigational lights.  It was orange and rough in appearance, not like a sharp, well-defined light.  It looked the same color as a sodium-burning street light.   I pulled over to observe.  It traveled in a straight path.  It was not a windy evening.  It made no sound and being at low altitude ( I would estimate 500-1,000 ft.) made no sound.  Flight path was straight.  I'm not quick with the camera/phone like kids are but wanted to observe.  It was heading towar! ds the Smyrna/Mt. Juliet area and I thought it interesting a couple other similar reports earlier in the year.   I keep running over this in my head and can't figure out what it was and I'm the first to think there is a logical explanation.  The Russian Meteor happened within 12 hours of this event. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96364.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04e9",
      "summary": "Two craft one blinking red and blue and yellow pulsating and the got really bright and went over my house  500 Lights On Object0: Yes",
      "city": "nashville",
      "shape": "other",
      "date": "2013-02-18T00:00:00",
      "story": "two craft one blinking red and blue and yellow pulsating and the got really bright and went over my house  500 Lights On Object0: Yes First I saw two bright lights one stayed solid white and the other to the left of the other craft was flashing blue and red and yellow.   So I grabbed my cell phone and started recording it and it got really really bright and atsyed there for approximately 7 minutes, I tried to grab my telescope and when I looked back the solid light was gone and the other one stopped flashing and as it got closer I could see two lights and a purple light underneath and it went right over my house as I filmed it.  I thought it was a police helicopter because it stayed put so long but as it passed over it clearly was not it was more of a box shape with a back that stretched into a triangle shape.",
      "link": "http://www.nuforc.org/webreports/096/S96222.html",
      "state": "TN",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0645",
      "summary": "Lights in sky.",
      "city": "nashville",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "Lights in sky three balls of light came across the sky stoped in mid air one on top two on bottom they formed a triagl, each one came together with beam of night.  They went stright up in a flash and were gone.",
      "link": "http://www.nuforc.org/webreports/095/S95176.html",
      "state": "TN",
      "duration": "0.05 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c07a4",
      "summary": "We noticed about twenty lights outlining a triangular shaped objects, suddenly, the lights all disappeared at once.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2014-01-10T00:00:00",
      "story": "We noticed about twenty lights outlining a triangular shaped objects, suddenly, the lights all disappeared at once. In the city of Nashville, Tennessee on the night of December 23, 2013, my brother and I were driving in his car.  As we looked out the front window of the car we both saw about twenty lights slowly moving across the sky maintaining the same distance apart from each other. At first we asked each other could twenty helicopters be flying in formation at night maintaining exact distances apart so much so they seemed to be almost somehow connected. Then we noticed the lights were outlining a “triangular shaped” object. After about 5 minutes, all the lights on the object just disappeared at the same time.",
      "link": "http://www.nuforc.org/webreports/105/S105523.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c08a5",
      "summary": "Large star-like object seen in afternoon sky then quickly vanished.",
      "city": "nashville",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "Large star-like object seen in afternoon sky then quickly vanished I was driving on 65 N towards Nashville and saw a bright white star-like object to my left.  Within a second it faded from a large bright object to a tiny dot and was gone.  Seen in clear blue afternoon sky, planes spotted before and after sighting and this was definitely no plane. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107518.html",
      "state": "TN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fe8",
      "summary": "Orange lights in Nashville, TN.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2014-02-14T00:00:00",
      "story": "Orange lights in Nashville TN At 20:30 tonight we saw two bright orange lights.  Heading North East from the South.  Too low to be aircraft.  They were bright orange and in perfect alignment with each other.  And absolutely no sound at all. Then they seemed to climb, and one faded to nothing, then the other did exactly the same. I have no idea what it was, but I am very familiar with all types of aircraft, and this was 100% NOT anything I've ever seen! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107027.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c10c8",
      "summary": "Was a cloudy night, hovering low amongst clouds saw large lighted object with a red light atop (moving clockwise atop the craft).",
      "city": "nashville",
      "shape": "egg",
      "date": "2013-11-11T00:00:00",
      "story": "Was a cloudy night, hovering low amongst clouds saw large lighted object with a red light atop (moving clockwise atop the craft ).   It hovered slowly over downtown area and then moved south east over nashville intl airport.  at the same time I was able to observe airplanes serve their normal routes, coming out of clouds and landing.   This craft was moving at a much slower pace and also took up a much larger portion of the sky.  It eventually disappeared headed south east. ((NUFORC Note:  Date and time have been corrected above.  Source of report elects to remain totally anonymous.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104152.html",
      "state": "TN",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c112a",
      "summary": "Nashville Sunday/Monday Morning Triangle UFO.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2013-12-02T00:00:00",
      "story": "Nashville Sunday/Monday Morning Triangle UFO On 11-25-2013 at 01:40 hours  I was traveling south bound on smith spring road, in south Nashville area when a craft \"Triangle Shape\" appeared  at my 9 o'clock position slow coasted to my 1 o'clock position and drop down behind a set of trees next to or in  J. Percy Priest Lake,   This craft if measured against a full moon it points would past the moon on either side by a foot.    3 white light with no flash,  1 red light flashing with 4-5 second  space   I am a pilot, so  I have knowledge of aircraft light this had no anti-collision light, no navigation  lights, no logo lights no taxi and/or landing light- and no sound     traveling in a 270 to 314 degree compass direction   from my location less the 1 mile to runway 31 at KBNA - Nashville International",
      "link": "http://www.nuforc.org/webreports/104/S104838.html",
      "state": "TN",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c159c",
      "summary": "Cigar shaped bright fluorescent light over nashville",
      "city": "nashville",
      "shape": "cigar",
      "date": "2013-10-23T00:00:00",
      "story": "cigar shaped bright fluorescent light over nashville I was at work by the nashville airport and I saw a bright fluorescent light that was round and then it shrunk to a cigar shape and started moving.  It was far off and really bright. No stream or sound and way faster than the planes flying over.  It disappeared and then reappeared within minutes.  It went over a plane but was way above itand then I saw a bright flash from it again and then it went away from where I was then disappeared again.",
      "link": "http://www.nuforc.org/webreports/103/S103343.html",
      "state": "TN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c15ec",
      "summary": "3 triangled crafts eastern Nashville, TN. red/orange/yellow lights.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2013-11-20T00:00:00",
      "story": "3 triangled crafts eastern Nashville, TN. red/orange/yellow lights I was outside looking into the eastern sky.  I was amazed with how clear and bright the stars looked, when I noticed 3 triangled shaped lights following each other in a line.  I thought how strange that planes would fly so close to each other.   Then I noticed each craft had 2 red lights (not blinking) and 1 Orange/yellow light (not blinking) that's what made me more curious.   As I watched the 3 crafts headed north in the eastern sky they slowed down then hovered.   I noticed that a aircraft at this point turned and went into their direction and at that point its as if they just disappeared.",
      "link": "http://www.nuforc.org/webreports/104/S104570.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c6e",
      "summary": "Standing outside restaurant one person said what is that? Look it up and saw an upside down L shape in 5 to 7 orange lights.   The ligh",
      "city": "nashville",
      "shape": "other",
      "date": "2014-07-26T00:00:00",
      "story": "Standing outside restaurant, one person said, \"What is that?\" Look up and saw an upside down L shape in 5 to 7 orange lights.  The lights were moving in perfect unison and there was the exact distance from each light as it moved.   The lights slowly faded away one by one but it was followed by a singular light of the same color a small distance behind the upside down L.",
      "link": "http://www.nuforc.org/webreports/111/S111856.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e38",
      "summary": "2 hovering light disc's during CMA music fest Nashville, TN.",
      "city": "nashville",
      "shape": "disk",
      "date": "2014-06-13T00:00:00",
      "story": "2 hovering light disc's during CMA music fest Nashville TN After carefully watching the skies, due to severe weather in the area at this time, I observed what appeared to be a funnel cloud on my way home.  I took a couple pictures with my cellphone of the funnel cloud.  After driving through the storm and arriving at my home maybe 10 minutes later after taking the photos of the funnel clouds, I looked out my back door at the sky and saw two hovering discs of white yellow light.  They remained stationary and faded into the clouds, after about what seemed to be 30 to 45 seconds.  I live 10 to 15 minutes south of Nashville, TN, and the ufos appeared to me looking north in the direction of downtown Nashville.   This event (the severe weather and sighting) took place during the CMA music festival ... coincidence maybe..maybe not.",
      "link": "http://www.nuforc.org/webreports/110/S110049.html",
      "state": "TN",
      "duration": "30-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2117",
      "summary": "One light falling splits into three different lights, falling in a triangle formation.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2014-05-08T00:00:00",
      "story": "One light falling splits into three different lights, falling in a triangle formation I was driving and noticed a light/burning figure falling.  I sped up to try to get a better glance, and watched as the one light split into three and fell through the sky in a triangle formation.   The lights then vanished behind the trees in the distance.   People in the cars around me seemed to notice the figure as well.",
      "link": "http://www.nuforc.org/webreports/109/S109196.html",
      "state": "TN",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c22fc",
      "summary": "Cylinder, shape surrounded by mist, chased by black helicpter.",
      "city": "nashville",
      "shape": "cylinder",
      "date": "2014-04-04T00:00:00",
      "story": "Cylinder, shape surrounded by mist, chased by black helicpter. What I saw was I believe cylinder shape, it was very cold, perfectly blue sky.  I watched it come from the west, no sound at all.  What was odd about it, was it looked like it may have been about 40-50 long, but was covered in mist, with maybe a 25 foot con-trail, that quickly disappeared.   As it started to come over our parking lot, I started to hear a helicopter coming from the North(probably from Fort Campbell).  As soon as the copter was heard, the object made a 90 degree turn, straight up.   When the black copter (no markings) got there, no more than 3-4 seconds, it was gone. The copter turned and headed back North.   Also, I would like to say please keep up the great work, you, Mr. Davenport, Stanton Friedman, and the, late, dear, Dr. Roger Leir are great heroes of mine.  You've all given up so much for the pursuit of the truth.  Keep your eyes to the skies, I do. 6/77 Otis Reservoir MA.  reported 05/27/03 (me also) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108222.html",
      "state": "TN",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c246b",
      "summary": "Bright Lights Over Nashville, NC",
      "city": "nashville",
      "shape": "unknown",
      "date": "2014-11-06T00:00:00",
      "story": "Bright Lights Over Nashville, NC At the time of the sighting I was delivering news papers for the Rocky Mount Telegram.  While delivering papers on Womble Rd. in Nashville, NC I noticed two bright lights in the sky about 5-10 miles away from me.  The lights resembled that of an commercial airliner with the landing lights on.  While I observed the crafts I noticed that they were hovering. At that time I started to realize the this was a UFO.  They then started to move in a zig-zag pattern over a great distance in a matter of seconds.  Then as I'm staring one of the crafts comes towards me at a very high rate of speed.  The craft then flies over the field next to me (by this time the bright lights was no longer emitted from the craft) moving very slowly with a flashing blue light on the bottom of the craft.  There was no sound.  The craft then disappeared behind the trees.  I will remember this for the rest of my life.",
      "link": "http://www.nuforc.org/webreports/114/S114953.html",
      "state": "NC",
      "duration": "6"
    },
    {
      "_id": "64d005f478aba2ec5a3c2af2",
      "summary": "UFO Spotted on 8/22/2014 Flying Slowly over Sky.",
      "city": "nashville",
      "shape": "diamond",
      "date": "2014-08-29T00:00:00",
      "story": "UFO Spotted on 8/22/2014 Flying Slowly over Sky. I was standing on the front yard of my farm.  Looking up I noticed a pretty big bright light moving slowly from the south to the north.  I know the difference between a plane at night in the sky and a satellite way in the distance and this was neither of those 2 things.  I kept watching to see if I would notice additional blinking lights like on a plane and there were none. the shape seemed to be diamond like and bright like a star.   I ran to grab 2 friends and showed them the very bright flying object which made no noises at all.  We all 3 of us stood there going what the hell is this??  Trying to make sense of it.   Then it just dimmed to orange then disappeared.  It did not get obstructed by anything.  Totally clear night and gone just like that.  It actually dimmed out slowly to orange and then was gone.   I noticed on the news this morning about recent sightings in other states and Nashville too recently.  This was real.  I'm a professional and will be looking up allot more often now.",
      "link": "http://www.nuforc.org/webreports/112/S112987.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2afa",
      "summary": "Sighting replicated two nights in a row in West Nashville.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2014-11-14T00:00:00",
      "story": "Sighting replicated two nights in a row in West Nashville. Profile of sighting(s):  Sighting 1-  11.09.14 2200  At approximately 11pm I was out on a run here in west Nashville.  My approximate location was at the highway 100 highway 70 split.  Upon looking down at the city scape, I noticed a light that seemed to cut the sky in half the way a spot light would if it were pointed directly up into the night sky.  The stream of light was faint due to the saturation of light coming off of the city and the almost full moon.  To give you an idea of my vantage point- the at&t building is facing my direction with this stream of light appearing to disect the building in half vertically.   I looked at this stream for perhaps a minute or so as I tried to discern if it was light coming off of another building (such as a hospital) and as I was doing so a globe appeared directly over the at&t building itself - or so it seemed.  The light was circular or globe like in shape and it emitted a red and orange pulsating light.  The light I saw was akin to tossing red and orange glow in the dark balls into a circular tumbler and then revolving the tumbler in a fashion similar to the way a drying machine might tumble clothing around.  The light I saw had an extremely unusual characteristic to it.  The light appeared to strobe, yet it was faint enough that I didn't get the impression I was on the dance floor or having a laser pointed at me.  The light lasted approximately 2 minutes and was 4-5 times the size of the at&t logo itself.   After a couple of minutes the intensity of the light decreased -as did the frequency of strobes.  The light then moved in a south/east path over the city and out towards Memphis if you were headed on I 40.  The velocity was\"slow\" yet constant (similar to that of an airplane cruising at altitude)  with no apparent change in trajectory or pitch.  The light continued to move horizontally across my field of vision until it went behind a tree line and into the night.  No jet stream or sound observed. Sighting 2 -  11.10.14 2200  In an effort to gather some additional information about the sighting - I decided to head out at the same time and be at the same place as I originally saw the object.  I didn't think that I would be able to replicate my experience, but fortunately I was able to gather some extremely important observational data that may help in identifying what it is I originally saw.  Again at 2200 the night after my initial sighting I saw this object but this time it was different. At this point the object flew into my line of sight as if it came from Memphis into Nashville.  The object exhibited the same behavior as the object I saw last night during it's exiting phase. I saw it fly in a constant velocity and altitude as it did the night before. This time however - the object stopped in mid air just outside the city and hung there for approximately 30 seconds. Then it proceeded to head out the way it came without any sign that the object actually turned around mid flight.  Essentially it w! as like the object was attached to a tether (like that of a yo-yo approaching the ground- appearing to stop for a second- and then going right back towards it's initial point of entry into my vantage point)  The entire sighting lasted approximately 6 minutes.  2 min entry. 1 min \"stationary.\" 2min departure towards initial point of entry.  This is the third time that I have witnessed this object - earlier in the summer I saw the same thing as my inititial report above but I didn't record it on my phone.  I have footage from the Nov. 9 sighting but unfortunately I gave up my personal information in the video.  Que the X-files track!",
      "link": "http://www.nuforc.org/webreports/115/S115207.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c33bd",
      "summary": "Thick white line UFO with round light on end seen floating over Nashville, TN.  ((NUFORC Note:  Contrail??  PD))",
      "city": "nashville",
      "shape": "cigar",
      "date": "2015-03-20T00:00:00",
      "story": "Thick white line UFO with round light on end seen floating over Nashville, TN. While driving down US 65 through Nashville, TN, my husband and I noticed a bright straight line flying in the sky.  At first we thought it was a plane, and then a bird.  But as we examined it further, we noticed it was a UFO. It looked like a thick white line with a round white light at one end of it.  It was hovering very slowly and moving in strange patterns.   After 2 minutes of staring at it in complete awe, it disappeared into seemingly nowhere. ((NUFORC Note:  Contrail??  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117862.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c346a",
      "summary": "Dark triangular object over West Nashville; no lights.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2015-03-20T00:00:00",
      "story": "Dark triangular object over West Nashville; no lights. The witness is a busy mom, who was out for a walk, around 10pm at night.  She had my headphones in listening to music, so she has no idea whether the object made noise.   The object was triangular, dark colored, with no lights, and was flying rather low.  The object was flying much like a plane, and the witness first thought it might be a plane or jet.  When she didn't see lights she became curious.   The object was only in her sights for a minute or two before she lost it in the night sky.",
      "link": "http://www.nuforc.org/webreports/117/S117852.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3564",
      "summary": "Orange lights traveling in a southeasterly direction. Object(s) didn't blink, absolutely no sound either. Watched until it moved out of",
      "city": "nashville",
      "shape": "unknown",
      "date": "2015-01-07T00:00:00",
      "story": "Orange lights traveling in a southeasterly direction.  Object(s) didn't blink, absolutely no sound either.   Watched until it moved out of sight.   One more orange object appeared and wasa going relatively fast.  It appeared it was trying to catch up with the other lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116278.html",
      "state": "GA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c373d",
      "summary": "Metallic shapes circling overhead, then flying off to the northeast.",
      "city": "nashville",
      "shape": "unknown",
      "date": "2015-02-06T00:00:00",
      "story": "Metallic shapes circling overhead, then flying off to the northeast. While I was in my backyard, I noticed a leaking gutter.   When I looked up, I noticed a small metallic shape in the sky.  I, at first, thought it was a high flying plane, but then I saw it was traveling in a very tight clockwise circle.   Then I realized there was another flying in a counterclockwise circle next to it.  The flight paths never intersected but passed extremely close to one another.   I could not make out the exact shape of them because they were so high.  They did seem to be metallic.   Also, there were no flapping movements like birds.  If they were birds they would naturally fly with each other not in opposing circles.   After I observed this for about 5-10 minutes, one of them flew off to the north-east.   Soon afterwards the second one followed.",
      "link": "http://www.nuforc.org/webreports/117/S117170.html",
      "state": "TN",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c382f",
      "summary": "Sighting Replicated in West Nashville, again.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2015-01-16T00:00:00",
      "story": "Sighting Replicated in West Nashville, again. Pick a clear night to go out to the location detailed below and see for yourself.  I see this thing almost every time I've ran on this track and cannot explain what it is.  Good luck, people.  (probability of sighting is extremely high in my experience.)  6506 Harding Pike, Nashville, TN 37205, USA Latitude : 36.08XXXX| Longitude : -86.89XXXX  2200 Nightly    Warning:  going onto the property is against the law and there will be a security guard lady to tell you that if you are not slick.  It is private property.   This is not a hoax so please moderator people, do not flag it as such. (For more information on sightings,see my original post entitled:  Sighting replicated two nights in a row in West Nashville. 11/14/14.) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116669.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c38bf",
      "summary": "Two fireballs hovering over I-65  near the exit to the old Saturn Plant outside of columbia TN",
      "city": "nashville",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "Two fireballs hovering over I-65  near the exit to the old Saturn Plant outside of columbia TN My son and I had been hunting today on some family land in middle Tennessee.  On our way home on I-65 around the exit that leads to the old Saturn plant, we saw two lights in the sky.  I have an Aerospace degree and make a living in technology and design which puts me in some interesting experiences.  I am naturally visual spatial and am usually very aware of my surroundings and notice a lot of details.   We drove for about 4 miles from the time that I first noticed the lights before finally stopping on the side of the interstate to watch them almost directly overhead.  At first the two lights were in close proximity to each other and seemed to rotate slowly at about a 20 degree angle from horizontal as we were initially driving along.  I say that it looked that way but of course from our vantage point in a moving vehicle it can look like rotation but not actually be that. the most interesting thing was what we saw when we came to a stop and rolled the windows down.  The two lights were at about 1000 feet altitude from our position.  We had an overcast sky with a ceiling of about 1200 to 1500 feet I guess without checking.   These two objects seemed from my vantage point to be about as large as a car each in size judging from the size of the light they were emitting. initially from the first view we had of them, they seemed to alternate between brighter and darker in the intensity of their light which initially led me to believe that they were two airplanes that were in a holding pattern waiting for their turn at final approach into Nashville airport.  I knew that air traffic control would not have placed two planes this close together so I figured that they must be much farther apart yet my vantage point just makes them look closer.  I also thought they were much farther away than they actually were.   As we pulled over and stopped the car, I could see that they were not airplanes, helicopters, drones, balloons, light from a ground source, etc.  We had about 30 seconds of clear visual from the time we stopped and tried to video to the time that the first object on the left phased out like turning off a light with a dimmer.   About 10 seconds later the second one on the right phased out the same way.  Now they did not fly into the clouds, they were below them.  The light they emitted was an orange glow like a torch.  I am familiar with most everything that flies and many FAA regs.  I also am able to use logic and reason to determine what I might be seeing.   All I know is that with my experience both educationally, professionally, and Spiritually, I was not able to determine what I saw but I am convinced that it was not something man made.  I have never seen anything like it before and am very aware of what it takes to make something fly and these two things did not match that knowledge.  They did not emit any sound that we were able to single out from the mild interstate traffic.  We would have heard a helicopter or possibly even a drone in my estimation.  Even if it had been something like! a drone then from the size it was, we would still have seen the object against the cloud ceiling via the ambient light emitted from the nearby urban infrastructure when the light it emitted phased out.   Again the light was a orange glow times two, fixed hovering in the sky about 1000 feet above the ground  with a constant fixed distance between the two.  The left one phased out first, then 5 to 10 seconds later, the second one phased out the same way leaving no trace or sound.   Again, I reiterate, I would know if they were airplanes, helicopters, drones, balloons, flairs, ground emitted light, etc and they were none of those.",
      "link": "http://www.nuforc.org/webreports/116/S116429.html",
      "state": "TN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d9e",
      "summary": "UFOs at the Cumberland River Edge.",
      "city": "nashville",
      "shape": "other",
      "date": "2015-07-17T00:00:00",
      "story": "UFOs at the Cumberland River Edge. My friends and I sat at the edge of the Cumberland River and watched the stars above, and also looking at the skies (sic.  sky's) reflection in the water. No star had a reflection in the water but one.  I attempt to seek the star creating the reflection.  To my slight right on the opposite bank we were sitting, one of the stars begins to shift oddly in the sky and I immediately let my two friends know that one of the stars was not a star. We kinda freaked out a bit because its flight pattern was abnormal from what we generally are exposed to in the sky.  Plus we just learned something!  As it reached the near edge of the other side of the river, we got a decent look of the lights.  (Well, any view is a decent look.)  It was, oddly enough, the shape of a Mercedes Benz symbol minus the circle.  All I could explain it as is just three streaks of light coming from one point in the sky as it settles above the trees.  It sat there for a while, and then it just went up until it was out of our view.  After that, three more followed suite. All were the same shape. There was one of the same shape to our left higher than the others.  As time went by, it descended down and just stood still.  Felt like we were being monitored, but just slightly.  We kept a visual on it the minute we saw it.  It stayed with us the longest out of all. About 1:30, we see one of them descend behind the trees with its lights shining brighter and closer than before any of the others.  No more were seen afterwards.  The sky was quickly covered in clouds around 3:00.",
      "link": "http://www.nuforc.org/webreports/120/S120446.html",
      "state": "TN",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c3fcd",
      "summary": "Stationery light which did not move.",
      "city": "nashville",
      "shape": "light",
      "date": "2015-05-29T00:00:00",
      "story": "Stationery light which did not move. Bright light in the sky over the Donelson area of Nashville, TN.  Stationery object that did not move from its position very much.   Duration I saw it was about 10 minutes, then it moved out of my view behind some trees on the horizon.",
      "link": "http://www.nuforc.org/webreports/119/S119126.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c40a5",
      "summary": "5 UFO's sighted east of Nashville, TN, at 9:13 CST 5/28/15.",
      "city": "nashville",
      "shape": "fireball",
      "date": "2015-05-29T00:00:00",
      "story": "5 UFO's sighted east of Nashville, Tn at 9:13 CST 5/28/15. 5 objects, 3 evenly spaced followed by 2 all following the same ingress and egress trajectory.  East of Nashville.  Ceiling 10,300 ft at time of event, objects approximately 10,000 ft.   All craft in controlled decent, leveled off and then executed coordinated climb in trail formation.",
      "link": "http://www.nuforc.org/webreports/119/S119197.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42fb",
      "summary": "About midnight we were driving along Hwy. 40, going E.  I noticed a big triangle shape with red flashing lights. We followed it for a",
      "city": "nashville",
      "shape": "triangle",
      "date": "2015-08-27T00:00:00",
      "story": "About midnight, we were driving along highway 40 going East I noticed a big triangle shape with red flashing lights.   We followed it for about 15 minutes until it was gone or disappeared.   It was zig raging back and forth across the interstate going a high rate of speed.",
      "link": "http://www.nuforc.org/webreports/121/S121487.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e20",
      "summary": "About midnight we were driving along I-40 heading east when my girlfriend pointed out a triangle shaped object that was going e",
      "city": "nashville",
      "shape": "triangle",
      "date": "2015-08-27T00:00:00",
      "story": "About midnight, we were driving along interstate 40, heading east, when my girlfriend pointed out a triangle shaped object that was going extremely fast, zig-zagging back and forth, over the interstate.  It flashed bright red quickly.   We watched it until it disappeared or we lost sight of it.",
      "link": "http://www.nuforc.org/webreports/121/S121488.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5054",
      "summary": "Two Large Oval Lights Above the Clouds Two Nights in One Week",
      "city": "nashville",
      "shape": "light",
      "date": "2016-02-26T00:00:00",
      "story": "Two Large Oval Lights Above the Clouds Two Nights in One Week. Same occurrence 2 nights this week – first 2-13-16; second tonight, 2-19-16.  Both nights around same time.  Both nights with same amount of cloudiness, just big temperature difference.  Initially appear similar to spotlights but (1) no trail of light; (2) each would disappear behind clouds randomly; (3) area of night sky coverage too immense; (4) somewhat circular flight pattern while moving across sky; (5) immediate change of direction at random times; (6) quick change in speed of movement. Viewing from southeast Davidson County, Tennessee (Nashville).  Two roundish/oval lights moving separately, crossing over one another at times and each would occasionally disappear behind clouds.  Both with variation in speed of movement.  Quickly changed directions, even a complete 180 at times.  Viewing location less than 10 miles from airport with fair amount of air traffic.  All lights on planes were clear and crisp, commercial airplanes far smaller than the 2 orb-sha! ped lights and undoubtedly flying much lower in the sky than location of the 2 orb-lights. I took videos on the night of 2-13 but only had my iPhone and the videos don't do justice.   Can see the lights if watch in darkened room but it just didn't pick things up like a true camera could.",
      "link": "http://www.nuforc.org/webreports/125/S125930.html",
      "state": "TN",
      "duration": ">30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5191",
      "summary": "White light above highway, changed shape, then disappeared.",
      "city": "nashville",
      "shape": "changing",
      "date": "2016-01-29T00:00:00",
      "story": "White light above highway, changed shape, then disappeared. Was driving down Briley Parkway, from Madison to the West side of Nashville.  The time I entered is an approximation, but it was daylight, not long before evening, and I was looking up at what seemed like a very bright star above the road in front of me.  I started thinking it looked more like something lower, like a plane, but it was just one white light and seemed stationary. While I was looking at it, it seemed to stretch or unfurl into a straight line.  When that happened, it looked more like a metallic thing, and the light (which before was all I could see) seemed to all move to the top, above the object...like it was either light reflecting off of it, or flame/exhaust shooting out of it. Then, it looked like it just shrunk into itself and disappeared, or maybe flew away in the direction perfectly away from me, so that it looked like it just shrunk into nothing.  Or maybe it just stopped reflecting light, it's hard to say. I saw another report from the 5th in a nearby area that sounded similar, so I decided to report mine as well.",
      "link": "http://www.nuforc.org/webreports/125/S125414.html",
      "state": "TN",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c520f",
      "summary": "Ominous, dark-clouded sky was a perfect setting for UFO to pass - Downtown Nashville, TN.",
      "city": "nashville",
      "shape": "circle",
      "date": "2016-01-05T00:00:00",
      "story": "Ominous, dark-clouded sky was a perfect setting for UFO to pass - Downtown Nashville TN At the time the photo was taken, I did not see the UFO.  I took the picture because the sky looked so ominous and strange that day.  But, upon later reflection of the photo I took that day, I noticed a small collection of lights in the background in the sky with a green tint.  Naturally, I zoomed in to get a better look only to find a classic \"UFO\" shape -- a circle formation made out of lights. Strangely, I was carpooling with a friend that day and she also took a picture of the dark-clouded sky.  We took pictures at the exact same time as marked by the date and time on our phones, but her photo does not capture the UFO.  I actually have two pictures taken at the same hour:minute.  One is a little more blurry because a car was driving in the distance, but, both of my photo's capture the unidentified object pretty clearly. Personally, I've never been one to believe in UFO's, though, I believe there is most definitely \"life\" outside of Earth.  For all I know, UFO's could be the government screwing with us.  I don't really know.  What I am certain of is that I didn't notice the object at the time the picture was taken -- I was too distracted by the sky.  Additionally, I didn't go back and look at the pictures I took until a month later when I noticed something tiny in the background.  To clear any misconceptions - I don't own photoshop or know how to use photoshop.  I'm sure there is enough technology out there to check and see if anything was added to a photo.  If such technology were to be used on my two photos of the object, it would appear they have not been tampered with in any way. Hope this report helps some UFO tracker out there!",
      "link": "http://www.nuforc.org/webreports/124/S124980.html",
      "state": "TN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c5373",
      "summary": "\"Helicopter\" lights are completely silent while moving very slowly through night sky.",
      "city": "nashville",
      "shape": "light",
      "date": "2016-01-14T00:00:00",
      "story": "&quot;Helicopter&quot; Lights are completely silent while moving very slowly through night sky. I noticed a large bright reddish star outside my dining room window. I brought it to the attention of my  parents, a retired middle school teacher of 32 years and a retired Corrections Officer/truck driver turned truck driving instructor and certified license examiner. We watched the \"star\" flicker between reddish orange and white as it slowly moved East across the sky.  My father noted that any plane moving that slowly would have fallen from the sky.  The light dimmed as the \"star\" turned South and began moving faster toward our house.  My mother and I quickly went outside to see if we could see the actual craft instead of just the light.  It changed course slightly, instead taking it higher and further to the side behind some trees rather than directly overhead. We never heard the sound of a plane engine or rotor of a helicopter. As we were watching the \"star\" through the trees now heading Southeast, another object flew Northeast overhead very low but much quicker.  It looked like the lights of a helicopter, but again, absolutely no sound. We are very accustomed to hospital helicopters flying overhead between Rocky Mount, Raleigh, Durham, Chapel Hill, and Greenville at all hours. We know how they look and what they sound like. We know the sounds of the occasional military helicopter making a night flight.  These lights looked like helicopters, but moved too slowly and were completely silent. This is not the first time we have seen lights with no sound.",
      "link": "http://www.nuforc.org/webreports/125/S125221.html",
      "state": "NC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c53e5",
      "summary": "Green light quickly shoots across sky and changes direction before fading.",
      "city": "nashville",
      "shape": "light",
      "date": "2016-01-08T00:00:00",
      "story": "Green light quickly shoots across sky and changes direction before fading. Standing outside in East Nashville, and in my view appeared a green light moving quickly.  I thought it could be a fireball, but it was bright green and changed direction at the last second.  It only streaked for a second.   It was too high up and too fast to be a firework. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125149.html",
      "state": "TN",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c547d",
      "summary": "Saw them moving from the left to the right within minutes, follwed by air planes, looked moving stars",
      "city": "nashville",
      "shape": "light",
      "date": "2015-12-17T00:00:00",
      "story": "saw them moving from the left to the right within minutes, followed by air planes, looked moving stars. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124621.html",
      "state": "TN",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c54dc",
      "summary": "Triangle shaped object with yellowish/orange lights flying over middle TN around midnight",
      "city": "nashville",
      "shape": "triangle",
      "date": "2015-12-10T00:00:00",
      "story": "Triangle shaped object with yellowish/orange lights flying over middle TN around midnight Hi,   My brother and I saw something fly over our house on November 19th at approximately 11:45/11:55 pm CT.  It was in the shape of a huge triangle.  It was one dark solid object and, If I had to guess, I'd say there were 5 to 6 round shaped lights on each side.  The lights were a yellowish/orange color, kinda the same as streetlights.  The lights didn't blink at all (like you would expect to see on airplane's).  Either it was military or something local/something to do with Christmas...? Idk (I doubt).  It was flying in the northwest direction. This object made no noise whatsoever.  If you wasn't looking up at exactly the right time, you most likely wouldn't have seen it. I was just wondering if anyone in middle Tennessee area had seen the same thing?  Or anyone at all in the southeast?  Just curious!  If so, I would like to be contacted via e-mail if possible.  Thanks.",
      "link": "http://www.nuforc.org/webreports/124/S124546.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c57e0",
      "summary": "4 white objects sationary in the sky on edge of storm cloud",
      "city": "nashville",
      "shape": "unknown",
      "date": "2016-06-24T00:00:00",
      "story": "4 white objects sationary in the sky on edge of storm cloud. 4 white objects were seen south east of downtown Nashville. They were semi-stationary in sky near the edge of low dark storm clouds on the horizon.   Approximately 4 miles away.  They appeared and reappeared slowly.  No aircraft lights visible. Observer backgrounds:  Electronics technician and art director",
      "link": "http://www.nuforc.org/webreports/128/S128006.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d77",
      "summary": "There was a bright light in the sky that had red and blue and green lights blinking.  ((NUFORC Note:  \"Twinkling\" star?  PD))",
      "city": "nashville",
      "shape": "changing",
      "date": "2016-12-05T00:00:00",
      "story": "There was a bright light in the sky that had red and blue and green lights blinking it did not move for 45 minutes and then it just disappeaed ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131358.html",
      "state": "TN",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e75",
      "summary": "I saw a star like object appear as bright as Venus for about 4-5 seconds and gradually disappear.",
      "city": "nashville",
      "shape": "diamond",
      "date": "2016-11-04T00:00:00",
      "story": "On Wednesday night, September 21, 2016, @ 7:40PMCT, about 40 minutes after sundown, I was viewing the sky from the middle Tennessee area, looking in the far North West of a clear sky and I saw a star like object appear as bright as Venus for about 4 to 5 seconds, and gradually disappear.  The sighting appeared to be stationary, not moving in any direction, simply appeared and disappeared.   I am wondering if this sighting could have been a caused by the reflective surface on a geostationary or communication satellite? ((NUFORC Note:  One of two sighting reports submitted by the same source.  The witness's other sighting also occurred in Nashville, TN, and is posted to our database of sighting reports for October 22nd, 2016, at 2040 hrs..  We spoke via telephone with the witness, and he seemed to us to be quite sober-minded.  We suspect that he is a quite credible witness.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130869.html",
      "state": "TN",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ec1",
      "summary": "I saw star like object appear and then disappear about 5 times within about a 4-5 minute time bracket.",
      "city": "nashville",
      "shape": "diamond",
      "date": "2016-11-04T00:00:00",
      "story": "I saw star like object appear and then disappear about 5 times within about a 4-5 minute time bracket. On Saturday night, October 22, 2016, @ 8:40PMCT, I was viewing the sky from the middle Tennessee area, looking in the far North West of a clear sky, and I saw a star like object appear, and then disappear, about 5 times within about a 4-5 minute time bracket.   Then looking slightly to the left a little more to the west, I saw another star like object do the very same thing twice.  Both sightings appeared to be stationary, not moving in any direction, simply appearing and disappearing.  Both looked just like a star.   I am wondering if these sightings could have been a caused by the reflective surfaces on geostationary or communications satellites? ((NUFORC Note:  One of two sighting reports submitted by the same source.  The witness's other sighting also occurred in Nashville, TN, and is posted to our database of sighting reports for September 21, 2016, at 1940 hrs..  We spoke via telephone with the witness, and he seemed to us to be quite sober-minded.  We suspect that he is a quite credible witness.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130868.html",
      "state": "TN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fc3",
      "summary": "Cluster of White Dots",
      "city": "nashville",
      "shape": "light",
      "date": "2016-10-27T00:00:00",
      "story": "Cluster of White Dots Cluster of at least 16 white dots moved across the sky slowly.  They all seemed to move independent of each other.  They eventually disappeared into some very high clouds.",
      "link": "http://www.nuforc.org/webreports/130/S130771.html",
      "state": "TN",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c60df",
      "summary": "Steady Large Triangle of Lights behind clouds.  VERY large craft if that is what it was.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2016-10-21T00:00:00",
      "story": "Steady Large Triangle of Lights behind clouds.  VERY large craft if that is what it was. Dog woke me up with his low growl.  I looked out the bedroom window to check the driveway on the east side of the house in the city by the airport.  I looked up to check the sky wondering if we had any low flying air planes or search choppers and saw nothing like that.  I noticed a large light behind the clouds and thought it was the moon.  Then I saw two other lights that were shining through the clouds.   They formed a perfect triangle.  They were about the size of half-dollars in the sky and spread apart about a foot from each other as you look up.  Whatever it was, it was very close and NOT the moon or planes.  I felt very calm and the lights stayed there for about 5 min going dim and brighter with the cloud cover.  Then they went out.",
      "link": "http://www.nuforc.org/webreports/130/S130690.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6150",
      "summary": "Gigantic Silver cigar shape craft passed in silence over our home.",
      "city": "nashville",
      "shape": "cigar",
      "date": "",
      "story": "Gigantic Silver cigar shape craft passed in silence over our home. When I was 6 years old, my family lived on the outskirts of Nashville, Tennessee in the country.   We had a paved driveway that was next to the house.  One afternoon, I was outside playing on the driveway with my Hot Wheels matchbox cars.  At some point, I recall seeing what looked like a floating aluminum pie plate (bottom facing forward) coming toward the house (at the time I said it looked like the bottom of a Jiffy Pop Popcorn pan).  It looked as though it was slowly rotating and moved silently but quickly toward the house.  At first, I wondered if it was going to crash as it was flying so low and was so large, but it continued on its trajectory and silently floated overhead.   As the front approached me, I realized that it was actually a very long cigar-shaped, silver-colored cylinder.  As it passed overhead it appeared to be so low that I got excited and jumped to see if I could touch the bottom of it.   When I couldn't touch it, I realized that my perception was clouded and I couldn't tell how close it was.  As it passed overhead, the body of the craft was wider than our entire house, such that the area where I stood became darkened from the shadow it cast.   There were some square dark gray hatches in places on the hull and as the craft was passing overhead, I remember clearly noting that the craft was higher than the roof of the house (perhaps 20 feet over the rooftop).  I have no visual or auditory evidence to support it, but at some point, I felt that the craft was occupied and the occupants were aware of my presence.  This scared me, and as a result, I ran inside the kitchen and told my mother that there was a big silver thing flying over the house.  She was washing dishes from lunch.  I remember being annoyed that it was taking her so long to come outside, but when I ran back out, she quickly joined me.  By this time, the object had passed and my mother and I both saw what appeared as a small aluminum pie plate the size of a golf ball rotating off into the distance.   My mother saw the craft as it departed.   To me, she didn't appear to be impressed by the sighting, but it is clear that she accounted the event to my father.  I recall the next day, we were watching a football game and my father pointed out the GoodYear blimp.  He asked me if that was what I had seen.   I told him it was not, because what I saw was shaped like a giant silver pencil and had no writing on it.  He also pointed out the undercarriage and the propellers to me.  I told him that it had no carriage underneath and there was no motor and no propellers and that it was slowly turning and made no noise.  At the end of my account, my father sternly told me to say that I saw a blimp.  Over 50 years later, I have always remembered this, and my life experiences have not explained away the sighting as a blimp. ((NUFORC Note:  We have corresponded with the witness, and he seems to us to be a quite sincere, and eloquent, individual.  He has worked in a position of considerable responsibility as a public employee, and we suspect he is an excellent witness.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129744.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c65d6",
      "summary": "Bright orange light in the sky, appeared to be two separate lights when zoomed in. Both shaped in straight lines.",
      "city": "nashville",
      "shape": "light",
      "date": "2016-08-16T00:00:00",
      "story": "Bright orange light in the sky, appeared to be two separate lights when zoomed in.  Both shaped in straight lines. One object seen near two cell towers, no movement.  Recorded a video of the object, and when zoomed in, it seemed as if there were two lights with a small gap between them, but farther away it looked like just one light.  Lights were a very bright orange, similar to a street lamp, but shaped like straight lines. After one minute of no changes, object began to shrink and turn white, and then faded out after approximately 2 minutes of observation.  Moments after the object faded out of sight, I heard several loud popping noises in quick succession from the direction the object was located, unable to determine if the noises are related or unrelated.  Unknown how long it had been there before I saw it. Object was sighted near an Air Force base and an airport.  I am the only direct observer that I am aware of, but I did record a video of the entire event as it happened.  I returned to the spot the next morning to take a picture of the area during the day to verify that there was nothing between me and the object I recorded, as well as no signs or lights that could account for the object's appearance.",
      "link": "http://www.nuforc.org/webreports/129/S129285.html",
      "state": "TN",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c1c",
      "summary": "I observed 4 bright orange objects flying in a straight line in a southerly direction.  They appeared to be glowing as if on fire but l",
      "city": "nashville",
      "shape": "fireball",
      "date": "2017-01-12T00:00:00",
      "story": "I observed 4 bright orange objects flying in a straight line in a southerly direction.  They appeared to be glowing as if on fire but left no trail at all.  They flew very steadily and consistently.  They flew at an altitude of a small airplane.  They were in the northeast night sky.  They made no sound.",
      "link": "http://www.nuforc.org/webreports/132/S132098.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f79",
      "summary": "This craft was not i ed today at towards the end of the eclipse noticed shadow moving across sky like it was cloaked but I could see it",
      "city": "nashville",
      "shape": "other",
      "date": "2017-08-24T00:00:00",
      "story": "This craft was not i ed today at towards the end of the eclipse noticed shadow moving across sky like it was cloaked but I could see its large wing formation.  There were no other types of craft in the air at this time and this craft went in a sideways direction.  It remained the same shadow even after coming through the clouds and into the sky .",
      "link": "http://www.nuforc.org/webreports/135/S135823.html",
      "state": "TN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7395",
      "summary": "While night fishing at Washington Co. Lake, there was a very bright light in my SE.  ((NUFORC Note:  Venus.  PD))",
      "city": "nashville",
      "shape": "cylinder",
      "date": "2017-06-09T00:00:00",
      "story": "While night fishing at Washington County Lake In a secluded spot, I looked up and there was a very bright light in my south east direction, behind trees,   At first, believed it was a star but upon further investigation object was moving up and down and sideways,  The light or object was not there prior to that time,  We began fishing at 1800 hours on 6/1/17.  It was very strange I felt like I was being observed,  It was not a plane,  It hovered behind trees for 2 hours,  It went above the trees on side tree.   I am really rather in shock.  The animals were all riled up,  Birds screeching, and all sorts of sounds coming from animals. ((NUFORC Note:  Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134407.html",
      "state": "IL",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c73ab",
      "summary": "Bright, irregular, flashes across the night sky similar to alien Iridium flare.",
      "city": "nashville",
      "shape": "circle",
      "date": "2017-06-09T00:00:00",
      "story": "Bright, irregular, flashes across the night sky similar to alien Iridium flare. The object started near west (~260 deg) and continued to east alternating between very bright flashes and dim flashes over different intervals.  It crossed near the rate of a plane but very direct.  It was dusk with just a bit of light blue on the horizon and the stars of the Big Dipper were just becoming visible.  The brightness for a brief flash was as bright as the surface of the moon and was consistently brighter than Venus.  I checked HA ((www.Heavens-Above.com)), and nothing matched the discription. ((NUFORC Note:  We have amended the time above, in order to reflect a nighttime sighting.  We spoke via telephone with the witness, and he seemed to us to be serious-minded.  We suspect that he is a very good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134419.html",
      "state": "TN",
      "duration": "00:05"
    },
    {
      "_id": "64d005f478aba2ec5a3c748e",
      "summary": "Around 3:21 AM April 30,I was winding down from work and looking at my tablet online. Lights on, quiet,TV unplugged, no other electroni",
      "city": "nashville",
      "shape": "",
      "date": "2017-05-11T00:00:00",
      "story": "Around 3:21 AM April 30, I was winding down from work and looking at my tablet online. Lights on, quiet, TV unplugged, no other electronics on.  I was in bed. A sound best characterized as a blend of flying insect,and electrical buzz permeated the room and was perceived to be moving in front of me, around the room.  The amplitude was not soft but quite discernible. The sound then localized at a wall mirror on the left side of the TV stand.  The mirror began to move on the two nails that served as its anchor point.  The sound stopped as the mirror kept moving. My subjective sense tells me that possibly, this was a directed intelligently controlled event. An examination of the wall behind the mirror revealed nothing.  No bug found, no sound. I had the sense to video with my cell phone, but the camera app kept switching off to home screen.  Nevertheless I have some footage. I live near the airport in Nashville and am wondering if any unusual aerial or meteorological phenomena occurred.",
      "link": "http://www.nuforc.org/webreports/134/S134003.html",
      "state": "TN",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7543",
      "summary": "((HOAX??))  Round, oval-like shape.  ((anonymous report))",
      "city": "nashville",
      "shape": "disk",
      "date": "2017-04-28T00:00:00",
      "story": "Round, oval-like shape. I was in my house, and suddenly I heard a big \"whoosh\"/\"boom\".  I looked out the window to see what it was and I saw an oval shaped UFO come from the top of the window to the middle.  It came from the top and made a backwards check mark and sat there.   After about 4/5 minutes another one appeared and did the same thing.  They were both oval shaped and had two yellow lights on the sides and one big if, bright blinking red light on the bottoms.   I went to get my phone but when I came back, they were gone. ((NUFORC Note:  Witness elects to remain anonymous; provides no contact information.  We wonder whether the correct date might be April 23rd, not March 23rd, but we have no means of confirming our suspicion.  Possible hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133859.html",
      "state": "TN",
      "duration": "9 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c76ea",
      "summary": "Triangle shaped object near Nashville airport over interstate",
      "city": "nashville",
      "shape": "triangle",
      "date": "2017-12-21T00:00:00",
      "story": "Triangle shaped object near Nashville airport over interstate Boyfriend and I were driving home towards Clarksville when noticing a large plane flying abnormally low outside Nashville airport.  We thought it was a normal plane malfunctioning due to the low flying.  It was so low and flying relatively  slow.  My boyfriend pointed out how nearby there was an actual commercial plain flying and how differently it flew and how the size wasn’t scaled to the actual plane.  We then realized after staring in awe for a long time that it was a triangle shaped craft with three white lights and a red light in the center.  It was extremely close to us flying over a heavily traffic congested area. I couldn’t look away.  My boyfriend scrambled to hand me my phone to take a picture but it was too late.  I did get photos but it had flown far by then.  I looked over to the neighboring car who was also seeing it and taking photos.",
      "link": "http://www.nuforc.org/webreports/137/S137829.html",
      "state": "TN",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7887",
      "summary": "2 ufo lights grew brighter and then faded and moved south.",
      "city": "nashville",
      "shape": "light",
      "date": "2017-12-04T00:00:00",
      "story": "2 ufo lights grew brighter and then faded and moved south. 2 large bright lights appeared out of nowhere in the sky.  They were beside each other with space in between.  The lights grew suddenly brighter and bigger.  They were not moving at the time.   Within 10 seconds of their brightest the lights began to fade simultaneously.  They dimmed to barely visible and moved in perfect formation south until I could see them no more.",
      "link": "http://www.nuforc.org/webreports/137/S137409.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c80fa",
      "summary": "Have never seen anything this bright and fast in the sky.",
      "city": "nashville",
      "shape": "unknown",
      "date": "2018-03-08T00:00:00",
      "story": "Have never seen anything this bright and fast in the sky. First, saw a bright white, stationary light in the sky, after a few seconds it appeared to be heading west at a high rate of speed...we were going 75 MPH in a westward direction.   It did not have any flashing lights and was not an airplane.  The light was very, very bright and FAST.",
      "link": "http://www.nuforc.org/webreports/139/S139050.html",
      "state": "NC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c83f9",
      "summary": "One silver, one bright red, one bright blue circle lights interact in midday Nashville sky",
      "city": "nashville",
      "shape": "circle",
      "date": "2018-10-18T00:00:00",
      "story": "One silver, one bright red, one bright blue circle lights interact in midday Nashville sky I was sitting at a park in my car eating lunch.  I noticed a bright silver ball object hovering high in the sky.  I watched it for one minute trying to see if it would move but it did not.  It appeared to be glittering or twinkling.   Then, far to the right of the object a brilliant blue light appeared and shortly thereafter a scarlet red light below it.  (The red and blue lights also appeared ball like but were not scintillating like the silver ball.)  Then simultaneously the blue and red light moved towards the silver light and then stopped before meeting.  All three lights appeared to be locked in a formation like they were somehow connected.  Suddenly and slowly, they began to move together in the sky.   I watched for several minutes and thought I was filming them on my phone but as it turns out, I forgot to push record.  At the very beginning of the ordeal, I snapped a picture of the sky, hoping to catch something.   When I arrived home and zoomed in on the picture, I noticed that I captured the silver ball before the others appeared.   I have no explanation for what I saw and it was by far the most other worldly thing I have experienced in my life.",
      "link": "http://www.nuforc.org/webreports/143/S143518.html",
      "state": "TN",
      "duration": "Several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c89e9",
      "summary": "I looked up and saw 4 lights that appeared to be darting.  ((anonymous report))",
      "city": "nashville",
      "shape": "unknown",
      "date": "2019-09-19T00:00:00",
      "story": "Was at a rooftop bar in downtown Nashville where I looked up and saw 4 lights that appeared to be darting.  I watched a couple planes fly over where you could tell that these lights were significantly higher then normal plane height.  They just seemed to be darting from side to side then the lights were just gone.  You could visually see the lights move where it wasn’t just normal stars flashing.",
      "link": "http://www.nuforc.org/webreports/148/S148867.html",
      "state": "TN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a7d",
      "summary": "I was driving into work westbound on Briley Parkway. About a qtr mile from the whites creek pike exit I noticed 3 or 4 solid green ligh",
      "city": "nashville",
      "shape": "unknown",
      "date": "2019-09-19T00:00:00",
      "story": "I was driving into work westbound on Briley Parkway.  About a qtr mile from the whites creek pike exit I noticed 3 or 4 solid green lights and a blinking red light Southwest if Briley hanging  at a low altitude.  At first I thought maybe it was a large radio tower that I’d never noticed before, but I was confused by that idea due to the distance between the lights.  As I took the Whites Creek Pike exit I realized that the lights were moving northward in unison.  Once I stopped at end of the exit I was able to stare at the object for maybe 10 seconds before it was nearly out of sight over the tree line.  I only thought to record at the last second.  I have a few seconds of footage to share if anyone is interested.  After reviewing the video the craft appears to be triangle shaped with the blinking  red light at the rear.",
      "link": "http://www.nuforc.org/webreports/148/S148942.html",
      "state": "TN",
      "duration": "15-30"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a4f",
      "summary": "While sitting outside stargazing watching heavy plane traffic, I noticed a craft thin and long with 3 amber/orange lights with no visib",
      "city": "nashville",
      "shape": "cigar",
      "date": "2019-09-19T00:00:00",
      "story": "While sitting outside stargazing watching heavy plane traffic,  I noticed a craft thin and long with 3 amber/orange lights with no visible strobe.  It was moving west to east at a \"normal\" speed.  When the craft was exactly due east of my location - and I had determined it defiantly did not have strobes in a blink of an eye changed direction to going straight up increased speed and vanished in less than a second.",
      "link": "http://www.nuforc.org/webreports/148/S148959.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8de8",
      "summary": "Watched a light move back and forth very quickly with no rhythm to it. Watched it for about 10 minutes. ((anonymous report))",
      "city": "nashville",
      "shape": "light",
      "date": "2019-01-11T00:00:00",
      "story": "Watched a light move back and forth very quickly with no rhythm to it.  Watched it for about 10 minutes.  Came back into my house for 5 minutes and when I came back out it was gone.  Hide your wife and children. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144312.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e71",
      "summary": "Several small or one massive craft.  Reminded of story of the ACTUAL Phoenix lights.  ((anonymous reports))",
      "city": "nashville",
      "shape": "other",
      "date": "2019-01-04T00:00:00",
      "story": "Several small or one massive craft.  Reminded of story of the ACTUAL Phoenix lights. In the south sky, 5 objects seemed to be flying in sync.  2 broke off and 3 stayed in triangle formation.  Looked to be a mile apart.  Disappeared in plain sight.  This took place 10-20 miles west of BNA.",
      "link": "http://www.nuforc.org/webreports/144/S144108.html",
      "state": "TN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fcc",
      "summary": "Comet falling, then it split into 3 pieces, which flew in different directions and changed shape.",
      "city": "nashville",
      "shape": "changing",
      "date": "2018-11-24T00:00:00",
      "story": "Comet falling, then it split into 3 separate pieces, they flew in different directions and changed shape.  As they flew, they were shaped more horizontal. One disappeared, then the second one dropped down like a comet, and changed its shape back to a horizontal shape and disappeared, then, the 3rd one disappeared. ((NUFORC Note:  We received another report about this sighting from a resident of the Nashville area, who reports that there were a number of comments about it on social media pages.  We believe the correct date of the sighting should be November 17, 2018, but will confirm that possibility with the source of this report.  We have temporarily amended the date, to reflect a sighting on November 17, 2018.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143814.html",
      "state": "TN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c90e4",
      "summary": "I was driving home from work when I turned on my street J saw three floating triangles that had a golden aura above my house.",
      "city": "nashville",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "I was driving home from work when I turned on my street J saw three floating triangles that had a golden aura above my house. I saw them floating above my house in a triangular form and they were all black triangles that had a yellow aura and they were just sitting there.",
      "link": "http://www.nuforc.org/webreports/149/S149761.html",
      "state": "TN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9399",
      "summary": "I was at a park in town with my friends because there is a great view of the city at night. While walking back to the car, I looked up",
      "city": "nashville",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "I was at a park in town with my friends because there is a great view of the city at night. While walking back to the car, I looked up at the sky to get another view of the stars. As I was fixed on looking at these two stars that were very clear to see, one of them moved quick  to the left, and then moved extremely fast across the sky and disappeared. As soon as I first saw it move, I told my friend to look, but it disappeared so fast he didn’t get a chance to look. They laughed when I told them why I wanted them to look. It just looked like a star, until it moved the way it did. No shooting star could make such a sharp angle the way it did, nor would it accelerate from a stand still. It has been weighing on my mind because it was so bizarre, and I wish someone else witnessed it because I know what I saw.",
      "link": "http://www.nuforc.org/webreports/150/S150607.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9417",
      "summary": "Group of 7 white flashing and disappearing flying objects",
      "city": "nashville",
      "shape": "sphere",
      "date": "2019-12-01T00:00:00",
      "story": "group of 7 white flashing and disappearing flying objects I was sitting in my backyard Saturday afternoon in Nashville, TN. I noticed 7 white round objects flying, then after watching for a few seconds, they flashed individually and disappeared. They re-appeared a few seconds later. I thought they could be birds but looked to be very far away, and there were 2 airplanes flying behind them leaving trails in the sky they looked to be around the same height and distance as the objects from my vantage point, and these objects were as large as the planes. You can see the trails in the videos I'm sending. I watched this happen multiple times then had the idea to take my phone out and get some video. I got 3 videos of the occurrence with the 2nd one (video_1.mov in the email I'm sending you) as the most clear. However you can see them in all 3. I have shown multiple people the videos and it was suggested I submit them to someone as it does not look to be natural. After I got the videos I was fairly disturbed and went inside to show my wife, so I do not know how much longer it went on.",
      "link": "http://www.nuforc.org/webreports/150/S150720.html",
      "state": "TN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9812",
      "summary": "Fast moving lights above downtown Nashville.  ((NUFORC Note:  Possibly advertising lights??  PD))",
      "city": "nashville",
      "shape": "light",
      "date": "2019-10-04T00:00:00",
      "story": "Fast moving lights above downtown Nashville I was out with friends in Nashville on a Saturday night.  We had proceeded to the rooftop of a business located on Broadway.  I looked up towards the AT&T “bat building “ and noticed around 4 lights zipping around the sky above the building.  They would disappear for a few moments then suddenly return.  Objects were making sudden direction changes and quick accelerations.  The objects were not necessarily always witnessed at once but maybe 2, then a 3rd or 4th would return.   I have a Bachelor’s degree in math and physical science and have always enjoyed stargazing. ((NUFORC Note:  Possibly advertising lights??  PD))",
      "link": "http://www.nuforc.org/webreports/149/S149079.html",
      "state": "TN",
      "duration": "30 minutes"
    }
  ]
}