{
  "city": "newark",
  "fetch_timestamp": "2025-07-12T14:33:15.544635",
  "record_count": 90,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4586",
      "summary": "Metallic doughnut shaped craft with a mirror finish.",
      "city": "newark",
      "shape": "circle",
      "date": "2019-08-23T00:00:00",
      "story": "Metallic doughnut shaped craft with a mirror finish. Was on my way to work and across the street from Kroger.  I saw and object that looked like a doughnut.  It was heading south.  No lights or odd movements.  Looked like chrome polished to a mirror like finish.",
      "link": "http://www.nuforc.org/webreports/147/S147869.html",
      "state": "OH",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ab0",
      "summary": "Newark, NY, solid dark sphere with orange/red light on front.",
      "city": "newark",
      "shape": "sphere",
      "date": "2019-07-12T00:00:00",
      "story": "Newark, NY, solid dark sphere with orange/red light on front. We watched a dark ball shaped craft with a single steady orange/red light on front approach us while boating on the Erie Canal in Newark, NY.  I shined a bright flashlight at it and it turned back the way it came.  No noise, no wings, no anti collision lights.   It flew about 1000 feet in the air.  It maintained the same speed and height for the duration we could see it.  It flew as close as a quarter mile from us before turning back.",
      "link": "http://www.nuforc.org/webreports/147/S147454.html",
      "state": "NY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e9d",
      "summary": "Bright flash over central Ohio.",
      "city": "newark",
      "shape": "flash",
      "date": "2019-04-08T00:00:00",
      "story": "Bright flash over Central Ohio Around 4:30AM on Thursday March 28, I saw a bright red flash directly overhead at about my 12 o'clock.  Several seconds passed and I expected to see another flash as if it were an airplane, but it took almost 10 seconds before I saw another super bright red flash in the western sky.  There was no sound.   I have seen many meteors and know what the planets look like.  I am actively interested in avaition and can identify most types of planes.  I have seen a day time fireball and this was not that as it was a bright flash.  It did not intensify like an Iridium satellite, or reentry of space junk.  For 30 years, I have been looking at the sky and this one has me stumped.",
      "link": "http://www.nuforc.org/webreports/145/S145472.html",
      "state": "OH",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5675",
      "summary": "Bright light moving in sky for about 3 seconds before burning out?",
      "city": "newark",
      "shape": "fireball",
      "date": "2008-06-12T00:00:00",
      "story": "Bright light moving in sky for about 3 seconds before burning out? Driving home from dinner, I looked up. A bright light caught my eye: slightly brighter than the two airplanes in the sky.  The bright light moved fairly quickly: it covered about 15 degrees of arc in about 3 seconds.  I saw a (much smaller) spark fly off of the light, then the spark faded out.  The main light itself winked out while it was in the air.  I heard nothing; I was in my car.  I have no idea what it was. It seemed too fast for an airplane, but too slow for a meteorite. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62770.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5815",
      "summary": "UFO spotted near Fremont CA",
      "city": "newark",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "UFO spotted near Fremont CA The object was shaped like a disk, which was spinning in cirles. The object had couple of yellow lights in a row on one of the sides. The body of the object was dark and it was hard to identify the shape on top of the disk. It remained in one spot for about a minute and then slowly started to disappear into the clouds.",
      "link": "http://www.nuforc.org/webreports/062/S62765.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d37",
      "summary": "a bright light that at first appeared to be a plane, helicopter or star.  we saw it for at least half an hour and it never moved.  as i",
      "city": "newark",
      "shape": "diamond",
      "date": "2006-10-30T00:00:00",
      "story": "a bright light that at first appeared to be a plane, helicopter or star.  we saw it for at least half an hour and it never moved.  as it got lighter all the stars lost their visibility but this stayed just as bright and stationary. larger than a star and closer to us. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51669.html",
      "state": "NJ",
      "duration": "half hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e69",
      "summary": "LARGE OBJECT 7/20/70 NEWARK NEW YORK",
      "city": "newark",
      "shape": "oval",
      "date": "2008-02-14T00:00:00",
      "story": "LARGE OBJECT 7/20/70 NEWARK NEW YORK   IM SORRY THIS HAPPENED WHEN I WAS 10 YEARS OLD, IT STILL SCARES ME,,, AT AROUND 10PM, I WAS LAYING ON A COUCH WATCHING TV. I KEPT LOOKING UP INTO THE SKY BECAUSE WAY UP THERE WAS A VERY COLORFUL STAR-LIKE OBJECT,,  I DID THIS OFF AND ON FOR SOMETIME,,,THE NEXT THING I KNEW, THIS THING WAS HUVERING ABOVE OUR BARN,,,  WE, MY MOM, STEP FATHER, SISTER AND MYSELF, WALKED OUTSIDE TO SEE WHAT IT WAS,,IT WAS THE SIZE IF OUR BARN ROOF, CIGAR SHAPED, AND HAD COLORS FROM ITS SIDE.  IT DIDNT MAKE A SOUND. IT SCARES ME FOR SOME REASON TO TALK ABOUT IT NOW.. ANYWAY  IT  HOVERED OVER OUR BARN FOR WHAT SEEMED TO BE 5 MINUTS,,THEN IT SLOWLY FLEW AT GROUND LEVEL,, WHAT SEEMED TO FLY UNDER THE PHONE WIRES,, AGAIN UNIFORMED WITH THE GROUND, IT CONTINUED TO FLY OVER THE HILL SIDE AND OUT OF SITE....NOW THE NEXT PERT DOESNT MAKE SENSE,,,THE NEXT THING I REMEMBER, I WAS BACK LAYING DOWN ON THE COUCH...SOME OTHER DETAIL...I REMEMBER MY STEPFATHER TELLING US IT WAS A AIRPLANE....I WISH I COULD TELL YOU WHY I FEEL THE WAY I DO, BUT TIME WENT MISSING,  I DONT UNDERSTAND , AND I DONT THINK I EVER WILL...MY MIND KEEPS TRYING TO TELL ME SOMETHING ELSE HAPPENED,,BUT IT WONT LET ME GO THERE... YOU MUST THINK IM NUTS,,SOMETIMES I STILL GOT THIS NEED TO KNOW,,,, IV TALKED TO MY PARENTS AND SISTER ABOUT THIS AFTER IT HAPPENED,,THEY REMEMBERED IT,,,BUT NOW WHEN I TRY TO TALK ABOUT IT,,,THEY HAVE NO MEMORY OF IT....THATS THE BIGGEST REASON IV NEVER TOLD ANYONE...BUT BELIEVE ME I REMEMBER AS MUCH AS I DO, LIKE I HAPPENED YESTERDAY.... ((NUFORC Note:  Date may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61125.html",
      "state": "NY",
      "duration": "NOT LONG????"
    },
    {
      "_id": "64d005f478aba2ec5a3b6299",
      "summary": "Coming out of RedRobins resturant around 6:50pm I saw a bright light ahead of me moving towards my right which would be south. It was a",
      "city": "newark",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "Coming out of Red Robins resturant around 6:50 pm I saw a bright light ahead of me moving towards my right which would be south.  It was a clear night and one could see visible air traffic in the air that night with their blinking lights.  This was just one single light lower than anything else in the sky it appeared the light sped up and disappeared.  It looked strange b/c cause i could not see a ship or a plane it was just a light.",
      "link": "http://www.nuforc.org/webreports/060/S60388.html",
      "state": "DE",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b632f",
      "summary": "Two very bright lights seen in the sky before vanishing, one seen a second time in a different location several minutes later",
      "city": "newark",
      "shape": "circle",
      "date": "2008-03-04T00:00:00",
      "story": "Two very bright lights seen in the sky before vanishing, one seen a second time in a different location several minutes later Last Saturday evening, the 15th of December, I was running some errands. I was on my way from my apartment to my place of work to pick up my paycheck (about a 5 minute drive.) I was alone in the car. There are two ways to get to my work, and if I had chosen the way that I usually prefer to take, I may not have seen what I saw that night. I thought that this other way would be quicker though, so I went that way. I almost made the light at the intersection of Wyoming Road (which I was on, facing east) and Marrow's Road, but it turned red just before I got there, so I was stopped for a few minutes waiting to make a left turn. To the south (my right side) of this intersection is a large suburban residential area. To the northwest (roughly behind me) is a shopping center. Directly east (in front of me) is a large warehouse of some kind, and slightly to the northeast of that building is a highly visible chemical factory building with large smokestacks (which I always jokingly call \"those pretty cloud machines.\") I don't think there was anyone else stopped at the intersection. The sky that night was completely overcast; not a single star could be seen anywhere. The sun had set, so it was fully nightttime, but because of the cloud cover bouncing back the light pollution it was relatively light outside. So I was sitting at the red light and just looking ahead of me, when I saw two very bright, circular or spherical white lights come out of nowhere in the eastern sky, above the warehouse. I thought they must be planes at first, and Delaware does have an airport somewhat nearby with occasionally low-flying planes, but these objects were hovering and not traveling in a straight trajectory. The lights on them were also much brighter than on a plane. It was difficult to tell exactly how far away from me they were, and I did not hear any noise. The two lights were close together at first. The one on the right remained stationary in the sky, and its light was stable. The one on the left was blinking on and off, and moved slowly to the left (north.) I got the feeling that the stationary one was in some way controlling the movements of the other one. As I watched this I realized they were not ordinary aircraft, and it seemed that the instant I thought this, the lights stopped moving for a second and then gradually retreated back behind the thick cloud cover. From my perspective, it looked like they faded out before disappearing. I had the distinct impression that they had been aware I was watching, and the whole thing spooked me out. The traffic light turned green and I continued on my way, trying to analyze what had happened and think of any other possible explanations. I was mad that I had forgotten to take out my camera, but I was so shocked by what I was seeing and it was over very quickly (the lights were visible for maybe 20-30 seconds or so total.)  After picking up my paycheck, I went to my mother's house, which is in a residential neighborhood off of Kirkwood Highway. As I pulled onto her street (again facing east) I saw just one of these same bright white lights. The light was not blinking, so I assumed it was the non-blinking one I had seen before (it looked exactly the same), but it could have been the blinking one from before or possibly a third craft. I pulled into my mom's driveway while continuing to watch the light, which was still just moving slowly around in the sky, hovering. I looked at the clock so at least I would know exactly what time it was on this second sighting...it was 6:41 pm. Now I thought of my camera and fished around in my purse for it, but was unable to locate it. (I had taken it out a couple nights before to take pictures of something else and never put it back.) I kept watching the light, and again it was like the craft knew I was watching and conspiring to take pictures of it. Suddenly, the bright light was shut off, but I could still see three very dim lights in a triangular pattern in its place. The lights were (I think) red/pink, blue/green, and yellow/orange. This triangular formation then moved to the left (north) and disappeared behind a house. That was the last I saw of it. When I got home that night, I drew pictures of what I had seen and jotted down the details. I looked up the locations where I saw these craft on Mapquest, and I was definitely looking almost directly east both times. I am a college student in my senior year, and I work part time in customer service. I was not under the influence of any intoxicants at the time. I believed in UFOs and extraterrestrial intelligence before, but now I am even more sure that they exist. I am not sure that what I saw could not have been explained by man-made technology, but I can't shake the feeling that they knew I was watching and altered their movements because of it.",
      "link": "http://www.nuforc.org/webreports/060/S60426.html",
      "state": "DE",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6456",
      "summary": "Ship located in the upper half of the picture.",
      "city": "newark",
      "shape": "disk",
      "date": "2008-03-31T00:00:00",
      "story": "Ship located in the upper half of the picture. I was taking some skyline photographs for the state of New Jersey's offical website, ans took a beautiful picture of Newark.  However, after adding my signature \"((initials deleted))\" to my photographs ((name deleted)), I noticed a very, very distinct disc shape in the upper half of the pictures.  I compared this photo with the others I had taken, and this was the only one to include the \"disc\". ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62324.html",
      "state": "NJ",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b65c7",
      "summary": "30 someodd years later and I finally saw proof of my early morning sighting",
      "city": "newark",
      "shape": "disk",
      "date": "",
      "story": "30 someodd years later and I finally saw proof of my early morning sighting It was the early 60's where I lived on a lake in Newark Tx.  I woke up one morning and looked out the bedroom window and saw a saucer like craft with a raised dome on top.  It had a white outline highliting it.  I watched it going towards the direction of Fort Worth Tx.  I noticed it would go thru some of the clouds so I knew it was real.  I turned to yell for my mom and rest of the family but by the time I looked back out the window, I saw it dissapear back into clouds and it was gone. I never thought much of it anymore until I saw a program on UFO's and they had talked about an event where they had tracked a UFO across areas of Texas during that time frame of my childhood  and when they showed the actual tracking on TV, I was amazed to see it had gone near Newark and was headed to and flown in thier airspace at Carswell AFB.  I know for a fact that what I saw as a kid in Newark Tx. was and is real. I couldn't believe I had proof in my mind of what I saw that early morning.  I am 51 now and haven't seen any more since then but I do believe in UFO's ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  We have assigned an artificial date in June 1963.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53717.html",
      "state": "TX",
      "duration": "1 or 2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6650",
      "summary": "Very brilliant white light over northern Delaware, hovering for an hour and then shot upward into space.  ((NUFORC Note:  Venus.  PD))",
      "city": "newark",
      "shape": "unknown",
      "date": "2007-11-28T00:00:00",
      "story": "Very brilliant white light over northern Delaware, hovering for an hour and then shot upward into space. I woke up around 4:20am because I was having trouble sleeping.  I was in my living room, sleeping near sliding doors and it was a very clear night.  I looked up a star chart just so I wouldn't make a mistake here.  Facing south/southeast, about 30-35 degrees above the horizon, a very bright white light was hovering over the tree line.  It almost looked like the northern star, but was 100 times more brilliant.  The object was far off in the distant, but after observing it for about 20-25 minutes, it made a very slow, controlled movement toward the south (left to right), not by much.  Very very small, slow movements.  The object continued to hover for about 50-60 minutes.  My wife came out of the bedroom, because she claimed she could not sleep either.  She observed it as well, and as a science teacher, she was curious also.  After about an hour, the object took a straight upward, controlled increase in elevation, starting out very slow and then increasing upward at a faster rate of speed, until object lost site into the stratosphere and further upward into what appeared to be outer space.  Object was looked for throughout the early morning hours and the next evening, but was not seen again.  I think it's safe to say this wasn't a weather balloon or meteor; military!  I also might note that there is a local airport with very little traffic nearby, however, this airport also houses military aircraft for soldier transports, usually to and from Iraq.  Furthermore, these aircraft are incapable of going straight upward and also do not have the ability to hover for hours at a time, for all you skeptics. Make your own opinion. ((NUFORC Note:  Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59519.html",
      "state": "DE",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b66d9",
      "summary": "A strange light flashes in the sky and the lights reflect a dark circular object before it disappears completely",
      "city": "newark",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "A strange light flashes in the sky and the lights reflect a dark circular object before it disappears completely At about Ten P.M. Easter Standard Time on May 24th I looked out my window and saw a strange light flashing in the sky. I went outside to get a better view and what I saw was a bright flashing light that was not moving but hovering quietly. It began flashing blue lights and it flashed them in sequences. It would flash a light every second for three seconds and at the third second count it would hold for a longer period of time become very bright and then dim away for a few seconds before starting again. It then seemed to turn and move up and to the left. It stayed in that place and continued blinking and then it would seem to go far away and then appear again. I ruled out any chance of it being a star or an aircraft and after doing this and moving quickly to different positions it stopped completely and went out of sight. My neighbor looked at it and also saw it. A few minutes after it went away it seemed to appear one more time and as it blinked it’s lights you could see the outline of a dark circular shape around it in which the lights were reflecting off of it. It was truly mind-boggling.",
      "link": "http://www.nuforc.org/webreports/063/S63517.html",
      "state": "OH",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d0c",
      "summary": "Bright BLUE/GREEN object streaked cross the sky from NE to SW.",
      "city": "newark",
      "shape": "fireball",
      "date": "2007-11-28T00:00:00",
      "story": "I saw this while ordering food at a Wendy's drive-thru Traveled from NE to SW sounds very similar to this report:  National UFO Reporting Center Sighting Report  Occurred : 12/24/2004 20:58 (Entered as : 12/24/2004 20:58)  Reported: 12/24/2004 7:41:26 PM 19:41  Posted: 1/11/2005  Location: Vienna, VA  Shape: Fireball  Duration:1 sec  Bright BLUE/GREEN object streaked cross the sky from NE to SW. Only lasted a second or two. Suspect it was a meteor, but can't be sure. It seemed larger and closer than a shooting star.",
      "link": "http://www.nuforc.org/webreports/059/S59724.html",
      "state": "DE",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b75eb",
      "summary": "While sitting outside, witnessed an unusual aircraft, which changed speeds amazingly.",
      "city": "newark",
      "shape": "other",
      "date": "2006-07-16T00:00:00",
      "story": "While sitting outside, witnessed an unusual aircraft, which changed speeds amazingly. I was outside on my patio and i heard what sounded like an airplane. Suddenly it sounded like a helicopter as it was approching. i stood to my front yard and looked over my house, South, and saw it heading my direction, North. When it was close enough the noise changed to a Humming Pulse. It wasnt moving very fast, about 100-200mph. Altitude approx. 150-200 ft. Suddenly stopped completely approx. 600 ft. past me. Spaceship was in shape of an H  very flat. with a light in each corner, and a smaller light in the center of the ship. I went inside to grab a witness, and as i was moving away, it took off six times faster than it was moving before. Definitally Believe in UFO's now. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50820.html",
      "state": "DE",
      "duration": "2:01"
    },
    {
      "_id": "64d005f478aba2ec5a3b75fa",
      "summary": "A bright perfectly round ball shaped object hovering north of our location on a hilly street with a bunch of trees.",
      "city": "newark",
      "shape": "light",
      "date": "2008-01-21T00:00:00",
      "story": "A bright perfectly round ball shaped object hovering north of our location on a hilly street with a bunch of trees. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61019.html",
      "state": "OH",
      "duration": "19:15-!9:18"
    },
    {
      "_id": "64d005f478aba2ec5a3b78c9",
      "summary": "Object traveling at an extreme speed and maneuvers not capable by any known aircarft",
      "city": "newark",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Object traveling at an extreme speed and maneuvers not capable by any known aircarft Roughly around 2:30am this morning I went out on my deck to have a smoke before going off to sleep.  After about 5 minutes or so I gazed at the stars as I normally do during the night.  As I looked over an adjacent house I noticed a flying object moving at and incredible speed.  It was not at an altitude of a commercial airliner.  It passed behind a tree line.  A few seconds came back into sight, made a incredible vertical change in direction.  Rose for about a mine and shot horizontally.  The object continued in this head for about 15 seconds and rose vertically again then vanished. The speed this object moved was at nothing I have ever seen in my life.  The sharp turns and maneuvers it made are just not feasibly possible with any known aircraft.  It did not have any distinct shape, just a white circle light.   This sighting whatever it is will be stuck in my mind for a very long time indeed. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56982.html",
      "state": "DE",
      "duration": "2-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7fdd",
      "summary": "Orange-ish array of lights cruising over I-95 in Delaware",
      "city": "newark",
      "shape": "triangle",
      "date": "2009-12-12T00:00:00",
      "story": "Orange-ish array of lights cruising over I-95 in Delaware In vehicle heading North on I-95 around 4:30 am 9/5/09.  Saw huge array of orange lights over I-95, and another bright white light to the west.  The white \"object\" seemed to twinkle like a star but zooming in with a 20x camera I could see it had multiple parts so this was not a star. There was a large part with 2 smaller parts separated but close to it, these smaller parts seemed to move away from the large part, then return (I think that is the reason for the twinkle effect).  The orange looking \"array\" kept moving to the North but slowly, and always kept it's same configuration. These were visible from 4:30am to 5:15 am.  Video was taken at high zoom and some clear images were obtained for a few seconds. These objects seemed to be just moving North very slowly and made no sudden moves or speed changes.  I would estimate people from northern MD to NY could have seen this, but I have seen no reports on the news as of today (9/6/09). There were some clouds in the sky and a full moon was behind me as I traveled north.  I wish I had thought to get my camera out sooner as the orange object(s) were huge when first seen.  When I did manage to snap pics distance became a factor. I the orange array was the Goodyear Blimp, I'd say it was 2 miles in front of me when first seen, maybe 10 miles out when filmed. The white array, which I thought at first was Venus or a star, always \"seemed\" to be 20 miles or maybe thousands of miles away, and never seemed to get closer or farther away. With the naked eye, I would have to conclude the white thingy was a star, but after looking at the video I have to rule that out.  Naked eye on the orange \"array\" was never thought to be anything other than an array of dim, orange-ish lights grouped together.",
      "link": "http://www.nuforc.org/webreports/072/S72103.html",
      "state": "DE",
      "duration": "40 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b810c",
      "summary": "This was not a far away light but a real flying sauser hovering directly above me.",
      "city": "newark",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "This was not a far away light but a real flying sauser hovering directly above me. I was leeving work at 9:00 on a friday night.  I stepped out the building and felt something over me and looked up to see a flying spacecraft hovering closely to the ground.  I screamed for my boss who was just inside the office but my voice was not heard.  It hovered above me long enough for me to look it over real good.  I new it was a ufo.  It took off at a very high rate of speed without making a noise.  I now what i saw!!!!!!!!!!!!!!!!!",
      "link": "http://www.nuforc.org/webreports/067/S67420.html",
      "state": "DE",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8577",
      "summary": "sepreate lights on a back road country road..lumunous beyond anything manmade....electronical and mechanical (engine)failure.....",
      "city": "newark",
      "shape": "formation",
      "date": "2009-03-19T00:00:00",
      "story": "sepreate lights on a back road country road..lumunous beyond anything manmade....electronical and mechanical (engine)failure..... me and my girlfriend were driving home from dinner and we decided to take a slightly backroad style direction home.....as we were coming up towards the crest of the hill. you could begin to see the aura or projection of an oncoming light.....my reaction was that it was just simply an oncoming car...we reached the crest of the hill to find that no car was in plain sight. But in the distance i could see a set of lights near or on the top of another hill.....i once again assumed it was just a house with the lights on, but as we coasted down the hill i noticed that the position of the lights were moving vertically in comparison to us as we made our way down the hill.....at this point i had stoppd the car and rolled down the window to look more clearly .....what i saw at first was just what appeared to be a disk with a very low intensity orangish light emmiting from the entire craft....but just as soon as i focused in on it the object began to move diagonaly towards the feild below...as it moved the orange glow slowly faded to white and then the light seperated itself int seven seperate light orbs that pulsed..now from the angle i was at i could not see it all to well now.....so i went to drive the car around the corner but the car had turned itself off. the key was still in the ignition and i attempted to restart it but there was no resonse. even the electronics were unresponsive...now at this time i looked back up and saw that the object moved over towards my car......not over top of me but close enough....at this time i realized it was not a disk because even though the lights where in a disk shape formation, when it crossed paths with the moon you could see the moon in the center of all the lights....as the lights began to ascend upwards, the lights slowley turned orange once again........then out of no where my car started........when i looked back up at the object it was a brite violet and it took of.......my radio did not work for weeks after the inccident.............when i went home ! every cl ock had said it was 10:52........but both my car and cellphone clock read 22 minutes faster....",
      "link": "http://www.nuforc.org/webreports/069/S69075.html",
      "state": "OH",
      "duration": "8-9"
    },
    {
      "_id": "64d005f478aba2ec5a3b891d",
      "summary": "Strange flickering lights over Newark, NJ",
      "city": "newark",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Strange flickering lights over Newark, NJ I went to the back porch of my apartment to grab a smoke and as i am sitting on a chair looking out the window i see a object flickering in the clear night sky. It is not the first time i see this object it would always appear every night, never fails and always between the hours of 12AM and 3AM. The object appears to be a sphere with flickering multi color lights from the distance that i am viewing it from. I knw its not a plane or a star for the simple fact that an actual airplane would pass by and you could clearly tell the diffrence from it and you could tell the diffrence from a star for the simple fact its the only object flickering multi color lights and the stars around it are as normal as they should be. I tried video taping it but my camera would simply not reach the distance. The object would move at a steady but slow pace, and judging from the distance of my view it would ruffly move 5 inches south every 5-10 minutes. I see this object every nigh! t and it does worry me. I am a strong beleiver that we are not the only ones in this world. It would be great if someone explains to me what is there to hide.",
      "link": "http://www.nuforc.org/webreports/072/S72744.html",
      "state": "NJ",
      "duration": "30 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9249",
      "summary": "2 hovering bright lights in the sky, disappearing and reappearing in diff. loc.  ((NUFORC Note:  Possible sighting of stars??  PD))",
      "city": "newark",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "2 hovering bright lights in the sky,disappearing and reappearing in different locations 2 bright lights in the sky one brighter than the other but i was only really focusing on the brightest light since i reported almost the same object back in may around the same area,they both had red coming off of them and i thought i saw blue but im not sure,it was deffenetly hovering since it kept moving in its place,if that makes sense, i couldnt tell that they were crafts but they deffenely were not air planes/helicopters or stars, i never seen a star hover like a craft or disappear and end up all the way across the sky and dip down into the tree's. Im not crazy and im not a story teller! i just want to know what it is. Well its brighter than a star and i noticed ((NUFORC Note:  Possible sighting of stars??  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68478.html",
      "state": "OH",
      "duration": "midnight=3 AM"
    },
    {
      "_id": "64d005f478aba2ec5a3b952d",
      "summary": "triangle shaped craft with 3 dimming lights",
      "city": "newark",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "triangle shaped craft with 3 dimming lights triangle shaped craft flew right over my house,i didnt see any wings,just 3 red dimming lights making a triangle,and made an odd buzzing noise",
      "link": "http://www.nuforc.org/webreports/068/S68569.html",
      "state": "OH",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c06",
      "summary": "NEWARK NJ Star like objects moving WEST  ((NUFORC Note:  Venus??  PD))",
      "city": "newark",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "NEWARK NJ Star like objects moving WEST I thought it was a ster. It was just sitting,then it dimmed out a little then started moving slow.I tried to catch it on camera but couldnt pick it up. ((NUFORC Note:  Venus??  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68941.html",
      "state": "NJ",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c34",
      "summary": "big bright ball of light and a smaller redish light",
      "city": "newark",
      "shape": "light",
      "date": "2009-05-12T00:00:00",
      "story": "big bright ball of light and a smaller redish light Big bright ball of light, i think it might be hanging over a small airport 2-3 miles from my house but i just saw a small plane pass right under it twice but the plane was soo much bigger than the ball of light, and its been there for about an hour and its just now starting to head downward as it has all the other times i have seen it. And i see another small redish ball of light miles away from it which has been up there for over 2 hours. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69672.html",
      "state": "OH",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c5f",
      "summary": "it was spinning and the lights were red and yellow on them. half was yellow and half was Black. Red light on top. and travled spinning",
      "city": "newark",
      "shape": "disk",
      "date": "2009-08-27T00:00:00",
      "story": "it was spinning and the lights were red and yellow on them. half was yellow and half was Black. Red light on top. and travled spinning toward the montain side.it aso made a sound like a buzzing sound combined with machine",
      "link": "http://www.nuforc.org/webreports/071/S71658.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba121",
      "summary": "3 star like objects in a row,3 separate lights giving off red or orange light",
      "city": "newark",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "3 star like objects in a row,3 separate lights giving off red or orange light I dont have a compus so i cant say which direction they were but these lights always show up in the same areas and they give off red or orange light and it takes them 30 minutes to an hour to disappear from my sight. Tonight i saw 3 dim white lights in a row 12am-12:30am, And 3 separate lights giving off red or orange light,the first object i noticed disappear about the same time as the 3 lights in a row did and by 1:08am all the lights were gone, The 2nd to last light to disappear didnt even give off color till the other 4 lights disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69311.html",
      "state": "OH",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba3d0",
      "summary": "White haze/light moving at amazing speeds.  Far greater than any known military or commercial aircraft",
      "city": "newark",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "White haze/light moving at amazing speeds.  Far greater than any known military or commercial aircraft I went to bed early on this night and awoke around 12:15am, to a thumping noise.  Although I do not believe the noise is related, I somehow felt the need to look out my window.  I pulled the blinds back and noticed a white hazy object, hovering above the treeline across the street from where I live.  The object was at a distance of anywhere between 5-7 miles away.  It was a particularly clear night and the stars were out.  It was a white light moving in a small circlular patter, very eratically.  I stared in disbelief and then walked outside to observe.  It was very quiet.  The object hovered for about 3 minutes off to the west and then suddenly shot directly to the north very rapidly, maintaining altitude and distance.  I continued to observe the light for about another minute, before it shot off at an amazing speed toward the north, northeast.",
      "link": "http://www.nuforc.org/webreports/070/S70275.html",
      "state": "DE",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1d1",
      "summary": "it flew as if it was a jelly fish..but in the sky",
      "city": "newark",
      "shape": "other",
      "date": "2011-01-05T00:00:00",
      "story": "it flew as if it was a jelly fish..but in the sky I was looking out of thw window because my car alarm went off when I noticed something the sky which was moving kind of weird so I took a harder look and call my mother and she also saw it ...it was like a jellyfish without tentecles....it was like a transparent red with light surrounding the edges and flew exactly the way a jellyfish would swim in water..and it had a kind or glow to it...I couldn't believe it but my moms was there to and we watched it pratically swim in the sky until it disappeared",
      "link": "http://www.nuforc.org/webreports/079/S79235.html",
      "state": "NJ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb36b",
      "summary": "Rolling strobe lights over Newark",
      "city": "newark",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "Rolling strobe lights over Newark We were driving down the highway about 10 miles west of Newark heading east.  We spotted two very bright (but off white) round lights very close together in the sky.  It alarmed us because it looked nothing like any airplane lights we'd ever seen.  It seemed to be barely moving.   All of the sudden, the lights went out and bright strobe type lights started rolling in a pattern from left to right (about 10 lights).  The speed accelerated and we couldn't keep it in our site for long as it zipped across the sky.  It was dark and we were driving so we could not make out a shape....only lights.",
      "link": "http://www.nuforc.org/webreports/079/S79317.html",
      "state": "NJ",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb874",
      "summary": "Multiple witnesses of 2 flying disks in Newark, DE on 08/29/10",
      "city": "newark",
      "shape": "circle",
      "date": "2010-08-30T00:00:00",
      "story": "Multiple witnesses of 2 flying disks in Newark, DE on 08/29/10 While driving to the Christiana Mall in Newark today, I noticed two metallic disks flying rather close to one another. They were absolutely silent and moved slightly sporadically.  The disks were spinning, but not on a perfect axis.  They were not in sync, but they stayed relatively close to one another for the approximate two minutes in which I observed them. It seemed as though they were moving closer and they flew higher extremely fast.   From my perspective, it seemed as if they flew straight up into the sky. I was able to keep an eye on the objects the whole time until I had to travel below an overpass and I lost sight of the objects, which were very far away the last time I had my eye on them. I was a passenger in a car with two other people, who both observed the objects.  Traffic notably slowed down on the exit ramp, as I assume that other drivers noticed them as well. When the car I was in parked at the mall, I got out and saw an unmarked plane, and I am! not sure if it had any relation to the UFO sighting I had witnessed minutes before.   The sighting did not have any physical effects on me or on any of the other passengers in the car that I was traveling in.  As one who takes particular interest in UFOs I was absolutely speechless to observe the sighting, and it has left a traumatizing mental effect, as the images I saw have been in my head the whole day. I am very curious as to whether or not anybody else reported the sighting.",
      "link": "http://www.nuforc.org/webreports/077/S77503.html",
      "state": "DE",
      "duration": "2+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc323",
      "summary": "Strange cloud changed shapes and became a saucer.",
      "city": "newark",
      "shape": "disk",
      "date": "2012-01-24T00:00:00",
      "story": "Strange cloud changed shapes and became a saucer. I was walking my dog and I looked up at the sunset, red clouds moving South to North.  When I noticed a dark grey cloud moving slowly North to South.  I thought it was unusual because it had 2 white tendrils and looked like a grey football being kicked over goal post.  I noticed it stopped and the tendrils changed shape...I know this will sound crazy but each tendril became a representation of the star ship Enterprise one large and one a third of the size of the right side.  These keep this shape a while and then they became a rectangle with  a sphere on top as it moved away it twisted and disappeared all the while the dark grey cloud remained stationary.  I notice a darker grey disc in the center that went horizontal and  the cloud started to shimmer that when I notice it was a saucer shape and in seconds the entire cloud disappeared. (NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86578.html",
      "state": "DE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2e3",
      "summary": "Upside down \"Y\" low flying overhead wiht 4-5 dimly lit amber lights on each leg",
      "city": "newark",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "Upside down \"Y\" low flying overhead wiht 4-5 dimly lit amber lights on each leg steeping off my back porch to enter my vehicle with my wife i noticed a a aircraft flying from north to south over my house it had to be flying low from the angle and distance and size it passed coming in to vision and leaving the vision of the sky i had visible i live in a city so i had limited view of the sky after pointing out what i seen to my wife \"do you see that\" pointing to the sky i was dumbfounded it made no noise and was traveling at a decent speed hard to Jude speed of objects in air of size reference and distance away.... i also shined a green laser pointer at it that i happen to have in my pocket nothing happened. the aircraft outline was not visible but a row of dim amber lights that looked like an upside Y was visible no sounds were made there were about 4-5 lights per leg of the \"Y\" and the lower leg was leading. like below   | | | | / \\ /   \\ /     \\ /       \\ ((ADDENDUM FROM WITNESS)) sorry about that, it was in the afternoon 8:05 pm it was a very interesting event. even tho it didn't last long it has made an lasting impression on me. ((END)) ((NUFORC Note:  We have amended the time above, to reflect an evening sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85469.html",
      "state": "OH",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7dd",
      "summary": "Five orange balls of light following each other coming from the ground about a minute apart.",
      "city": "newark",
      "shape": "fireball",
      "date": "2011-12-17T00:00:00",
      "story": "Five orange balls of light following each other coming from the ground about a minute apart. We were on 21st in Newark Ohio, 5 of us  My 58 year old wife, 83 father in-law, 42 sister in-law, 21 son, and myself 65 year old ex Navy yeoman aboard the USS Saratoga in the weapons office.  I was also the Captains talker during GQ so I know what airplanes look like in flight at night.   We observed 5 orange fireball type lights leaving the ground and proceeding in an arch going north.  They were about a minute apart following in the same path.  They looked like they maybe reached 1,000 feet.  We observed them until the disappeared.  I observed the same kind of lights this summer going from the south to the north at Seneca Lake Park only there were two of them following each other.  Several persons saw this because I brought to their attention.  I have photos of them.",
      "link": "http://www.nuforc.org/webreports/085/S85857.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc810",
      "summary": "Sighting of colorful lights in the morning sky",
      "city": "newark",
      "shape": "light",
      "date": "2011-10-19T00:00:00",
      "story": "Sighting of colorful lights in the morning sky On October 13, 2011, at about 3:30 in the morning is when I saw strange colorful lights through my window.  At first I thought it was police cars outside but the lights were a lot of different colors.  There was a mixture of purple, pink, blue and other colors but those are the main ones that I remember.  As I was about to look out the window to see what it was my husband woke up.  Our bed is next to the window so as soon as he opened his eyes he saw that there was a beam of light coming from the sky.  It lasted about 10 seconds and then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84519.html",
      "state": "NJ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc45",
      "summary": "Around 2:45 AM driving by Branch Brook Park Newark, NJ. Spotted red firey/glowing object slowly coming down traveling SE.",
      "city": "newark",
      "shape": "fireball",
      "date": "2011-07-06T00:00:00",
      "story": "Around 2:45 AM driving by Branch Brook Park, Newark, NJ, spotted red firey/glowing object slowly coming down traveling South/East  It was NOT fireworks.   As it traveled it slowly faded/and decreased in size, until it shrank to look like a dot, then it zipped up in like an arc motion and disappeared.  Just wondering if there were anymore reports or witnesses. Events like this happen always when you have no camera on hand   :-(",
      "link": "http://www.nuforc.org/webreports/082/S82194.html",
      "state": "NJ",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1e8",
      "summary": "Red glowing fireball floating across field in Newark delaware",
      "city": "newark",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Red glowing fireball floating across field in Newark delaware Sitting with my family at the edge of a field by pep boys as we were waiting for the July 4th fireworks.  Just before the fireworks started, a fireball -like, silent light with a fog like haze around it flew in a linear formation VERY SLOWLY across the field.  My wife, kids, and I were so taken by this light that we had to get out of the car and watch it as it flew right over our car.   I've never seen anything like this in my life and they're we're at least 50 people waiting for the fireworks that saw this thing too!   So I'm interested to see if anyone else posts about this UFO... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90406.html",
      "state": "DE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd312",
      "summary": "Single orange light moving very fast W to E",
      "city": "newark",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Single orange light moving very fast W to E My husband and I went onto our back deck to let the dogs out.  We noticed the sound of an airplane, the small kind that only one or two people can sit in.  We noticed a bright orange light moving very quickly over us in a straight line West to East.  At first we thought it was the plane we heard, but as it sped across the sky, we realized it wasn't.   This object had no blinking lights.  It was bright, like the size of Venus on an early spring morning, but orange in hue.  With a full moon tonight, the clouds were illuminated, and this object was flying beneath them.  It was out of sight within 15 seconds, miles and miles away, but we still heard that biplane somewhere, so we know that the object was something else entirely.   The object was never obscured by houses or trees at any point. It either disappeared, or was simply so fast it was hundreds of miles away in mere seconds.  I am a very logical thinker, and I cannot imagine what, in my index of known objects, this was.   Moments after, a commercial plane flew in from another direction. It was blinking and went behind the clouds. The UFO was, without a doubt, not an airplane. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93145.html",
      "state": "OH",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd65e",
      "summary": "Reddish orange flaming ball.",
      "city": "newark",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "Reddish orange flaming ball. The object in question was a redish orange ball of fire that had no tail.  the fire looked as though the power source was contained within a sphere.  it moved from the south to north stopping occasionaly and at one point it turned in a circle and then started north.  it then went to a spot then stopped and stayed there till it gradually got smaller and smaller till it disapeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87857.html",
      "state": "OH",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6fc",
      "summary": "Orange Triangle shaped craft",
      "city": "newark",
      "shape": "triangle",
      "date": "2012-07-04T00:00:00",
      "story": "Orange Triangle shaped craft My girlfriend and I were walking outside, around 11pm at night. Usually when she leaves my home she we’re outside talking for a few minutes before she leaves. Normally, I always like to look into the sky check out stars I can see, planets, or constellations. On this night I noticed the craft moving at a very common speed in comparison to Earth aircraft. This craft was triangle in shape.  This object had absolutely no sound and was moving in one direction from North-west direction to a South-East direction. This object was at a height of a private passenger plane. It was so apparent in the sky in contrast to the background of the night that my girlfriend had no problem recognizing the craft immediately when I pointed out to her. The glow on the bottom side of the craft had what I would only describe as a “dusk” orange on the bottom side of the craft. The shape can best described as a stealth bomber.  The only recording device I had on me at the time was my iphone 3g and I snapped some pictures when it was already out of view. I am attaching the ones I believe are the photos from that night. I am more than experienced to realize that this is not Mars and was no known aircraft I've ever seen in the area. As regular commercial jets fly around our area often and can normally be heard. Whereas this particular object had absolutely no sound. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90084.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd715",
      "summary": "Red blinking light near Venus on 7/12/12",
      "city": "newark",
      "shape": "flash",
      "date": "2012-08-05T00:00:00",
      "story": "Red blinking light near Venus on 7/12/12 At 4:45 am eastern time  I was outside at work and looked up 2 see the 2 planets that are in the sky this month (Venus and Jupiter) and next to Venus on the right side was a small flashing red orange light that did not move.    I work nights and have looked at the 2 planets every night this month but this was the first time I saw the flashing next to Venus.   It dident seem to be a plane because it dident move.  It was a very clear night and my coworker also saw it.",
      "link": "http://www.nuforc.org/webreports/090/S90796.html",
      "state": "DE",
      "duration": "At least 10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd980",
      "summary": "Two silvery-white circular shaped craft appeared to use a cloaking technology to reappear and disappear.",
      "city": "newark",
      "shape": "circle",
      "date": "2012-08-19T00:00:00",
      "story": "Two silvery-white circular shaped craft appeared to use a cloaking technology to reappear and disappear. Hello. I am the same guy that reported the sighting on August the 2nd after leaving the Glasgow Park. This time I was on the deck of my backyard during the brewing of the late afternoon thunderstorms that were quickly covering Northern Delaware around 5-6 PM Eastern Time.  I was sitting on my deck watching the clouds swirl as there appeared to be one frontal system coming from a Southwestern direction that was bisected by another from a Southeastern direction.  As I stand on my deck watching the clouds move with grace and speed, I noticed in the distance at what appeared to be a great altitude, maybe that of what you would typically see inbound and outbound flights appear at, but just under the main cloud layer that was forming. They were a silvery white colored and my initial thought in trying to recognize what these 2 objects were is that it may have been 2 seagulls flashing their white underbelly as the sung shines a reflection from it to my direction. Howe! ver, what happened next lead me to believe these were not birds or traditionally inbound, outbound passenger airliners as they disappeared as if they were cloaking for 2 seconds and then they reappeared in the next breath to only disappear for good after a few more seconds (another 2 to 3).  They were flying in the general direction that the storm system was heading, a Northeastern direction (they were following the frontal system that was coming from the southwest).   Both of these objects were far from where I was standing, from what I could tell but they were tightly grouped together. They did not zig or zag, they merely were flying in what appeared from my parallax as a straight pattern toward a northeast direction. Maybe due to the sunlight's distortion or other exogenous factors, the crafts appeared to be silver at first but then they appeared to be more of a pure white color. I did not see any flashing lights, just merely the objects themselves. And as for the shape o! f the craft, they were a spherical or circular fit. I did not ! see any visible wings, but that does not mean there weren't any wings b/c from my vantage point, I was quite far. The reason I decided to report this is b/c of the peculiar cloaking and reappearing nature of these crafts. I have never seen any aircraft ever do this to my knowledge. As to the specifics of weather, it was not quite raining yet, it was cool outside due to the coming frontal system, daylight was still visible although it was quickly dimming due to the dark cloud systems forming, and this is my 2nd late evening sighting within 3 days. Also, the objects left no visible contrails and I did not hear any audible jet or engine noise.",
      "link": "http://www.nuforc.org/webreports/091/S91501.html",
      "state": "DE",
      "duration": "2-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bda5e",
      "summary": "Movind sw to ne",
      "city": "newark",
      "shape": "sphere",
      "date": "2012-08-19T00:00:00",
      "story": "movind sw to ne bright shpere, straight path,  no blinking lights, 5 times brighter, at least twice diameter of stars, probably manmade but odd that it did not blink and was solid white ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91535.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be28c",
      "summary": "Red light (orb)",
      "city": "newark",
      "shape": "light",
      "date": "2012-06-20T00:00:00",
      "story": "Red light (orb) I was leaving for work when I noticed a bright red object just above the tree line,  I was heading directly toward it for about 30 sec.  In that time I noticed it was moving and had changed directions.  I had a similar sighing last year before the fireworks in Newark also, and was interested enough this time to stop my car and shut off the engine.  I couldn't detect any sound or see any other lights just the red glow.  It was moving in my direction, and I lost sight of it when the street light I was under obstructed its view.  I waited for it to reappear out of the glare of the light, but it never did.  I assumed it had entered cloud cover,  I got into my car pulled forward about 50 yards, to where I had a clear view of the sky, there was no cloud cover at all. In my estimation, it was either very large, or very close to the ground.",
      "link": "http://www.nuforc.org/webreports/089/S89660.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be325",
      "summary": "Sphere orange light anomaly in the sky",
      "city": "newark",
      "shape": "sphere",
      "date": "2012-09-24T00:00:00",
      "story": "Sphere orange light anomaly in the sky Last night, I was delivering pizza at the local shop I work at.  It was like any other night.  I had just picked up an order from the store and was on my to drop it off.  The location where I was going was maybe 2.5 miles from where I was at.  It was aprox. 9:50 pm and I had turned off a main road (busy with traffic on to a side street.  Out of the corner of my left eye I saw an orange sphere shaped object in the sky.  It had interested me because of the shear size of the sphere.  (if you were to hold a penny as far out with your left hand it appeared to he that size ).  As I'm driving I am still looking at this object when I notice another of the same objects appeared. Now 2 sphere shaped glowing orange Ufos were in my sight by hey began a theater totter motion as one went up the other went down.  At this time I pulled to a stop sight from the side street I was on which was still only about 250 ft from the main road.  The spheres dimmed in color as I pulled ou! t my iPhone to capture about 40 seconds of video. After recording this I had called a friend to explain what was still before my eyes and I began to drive towards the objects.  The opposite direction of my delivery.  As I came to another stop light the objects dissipated into the sky.",
      "link": "http://www.nuforc.org/webreports/093/S93017.html",
      "state": "OH",
      "duration": "<5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be3e7",
      "summary": "After running at the Glasgow Park off of 896 and rt 40, my friend texts me and asks, \"Dude, did you see those 8 orange lights leavin",
      "city": "newark",
      "shape": "circle",
      "date": "2012-08-05T00:00:00",
      "story": "After running at the Glasgow park off of 896 and rt 40, my friend texts me and asks, \"Dude did you see those 8 orange lights leaving the park?\"   I told him I did not b/c I was not paying great attention as I had taxed myself heavily in the workout. But he distinctly saw 8 orange, dull colored lights in the distance and could not hear any noise, then they all started to disappear one by one.   This happened approximately at 9 PM Eastern Standard time during a dingy colored full moon on a clear night. Temperature is in the 80s at the time with about 95% humidity.  There were more mosquitoes than average out tonight and I recall some strange activity among animals in the area. This actually reminds me now of a sighting I saw myself about 2 or 3 months ago while driving towards Wilmington on 95 North, probably a few miles from exit 7. I remember driving and seeing a strange rotating craft appear on my right with 3 distinct lights, it was hard to see, but it appeared that one of the lights was changing colors from red to green and I had my windows down but I could not hear any distinct afterburner sounds.  I was driving most likely around 70-75 mph and I lost the craft as trees began to appear in the foreground.  I have also witnessed strange crafts/lights in the Florida area.",
      "link": "http://www.nuforc.org/webreports/091/S91398.html",
      "state": "DE",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be56a",
      "summary": "Green fireball seen over Newark, NJ",
      "city": "newark",
      "shape": "fireball",
      "date": "2012-05-13T00:00:00",
      "story": "green fireball seen over Newark, NJ I was crossing the intersection of Stuyvesant Ave and 18th Ave going east bound when I saw a green fireball arch in the sky.  There was no sound to indicate that it could have been fireworks, and it was too high in the sky to have been fireworks.   The green light faded off quickly and I didn't see anything further.",
      "link": "http://www.nuforc.org/webreports/088/S88740.html",
      "state": "NJ",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3be673",
      "summary": "2 clusters of orange lights in sky. About 25 lights per cluster",
      "city": "newark",
      "shape": "unknown",
      "date": "2012-03-13T00:00:00",
      "story": "2 clusters of orange lights in sky.  About 25 lights per cluster 2 clsuters of orange lights in the sky. First no moving, then moving, then disappearng.  No noise.",
      "link": "http://www.nuforc.org/webreports/087/S87266.html",
      "state": "DE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be818",
      "summary": "Green laser lights in the sky simutaneosly and evenly shooting parallel to each other",
      "city": "newark",
      "shape": "other",
      "date": "2012-03-13T00:00:00",
      "story": "Green laser lights in the sky simutaneosly and evenly shooting parallel to eachother It was approximately 0620 hrs  and I was looking in the sky I noticed 2 geese flying together which was weird I usually see geese in the bundles...  I thought nothing much after I lt sort of followed the geese with my eyes I turned and that's  when I saw what I saw it was shocking but exciting at the same time I saw a light which was white really bright not like a plane and it wasn't blinking then like 3 seconds later I sort of took of straight and while it did that the  light turned green as if there was a green laser it was super fast so fast I couldn't keep up with it with my eyes no plain or jet is that fast I have common sense but after that I saw something even more surprising I saw another similar light coming in the opposite direction as the other one before it and then I saw two of the same white lights going left to right simultaneously with the green laser looking thing there's no aircraft in the world that can go that fast and turn back 180degrees! instantly back and forth that fast it was beautiful it was like some thing you see in a movie after several seconds it just vanished in the air  it sounds funny but that's what  I saw and not only that this isn't the first time I've seen it I've seen it years ago about maybe 9 years ago coming out a factory in the early morning by again a green laser looking UFO flying back and forth then disappears I wasn't the only one who saw it actually about 4-6 other people saw it I was scared to say something but this time I googled how to report a UFO sighting which lead me to this form  I hope other people saw it To.. Thanx",
      "link": "http://www.nuforc.org/webreports/087/S87346.html",
      "state": "NJ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bea9e",
      "summary": "White objects in group flying together.",
      "city": "newark",
      "shape": "circle",
      "date": "2012-03-13T00:00:00",
      "story": "White objects in group flying together. I was out taking a walk with my boyfriend on east main street,  Beside the local speedway,  It was about 1:26 am and we both looked up at the sky at the same time.  It was very cloudy,  The clouds were very thick and moving kinda fast.  All of a sudden we seen an object in the sky moving out of the clouds,  We knew it was not a star because the stars were not moving.  The object we seen had 4 other objects following it. about 10 secods after that 5 other objects were following the other objects as if they were going somewhere, or maybe getting away from something.  These objects were a little bit bigger than stars.  But appeared as stars. It was very strange,  They were moving a moderate speed.  These objects were moving south west.  Towards Columbus, Ohio.  It was strange, Like nothing I have ever seen before.",
      "link": "http://www.nuforc.org/webreports/087/S87637.html",
      "state": "OH",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bea9d",
      "summary": "10 Circular bright white objects over Newark, Ohio.",
      "city": "newark",
      "shape": "circle",
      "date": "2012-03-13T00:00:00",
      "story": "10 Circular bright white objects over Newark, Ohio. Tuesday March 13, 2012 1:26am I was out taking a walk with my girlfriend around 1:26am.  I remember thinking to myself how small we really are in the universe, and how much we really still don't understand.  And at that moment me and my girlfriend looked up into the sky and we noticed 4 glowing balls of light moving at a descent speed.  I wasn't sure at first what they were.  They came out from behind a cloud in a tranglier movement heading Southwest.  After the four objects flew right over they dispeared into the clouds.  And as those four went behind the clouds six more came out from behind the clouds moving in a straight line. They seemed to be in the shape of a average star. The light omencing from these circular objects were white bright lights.",
      "link": "http://www.nuforc.org/webreports/087/S87638.html",
      "state": "OH",
      "duration": "4 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3befe7",
      "summary": "Circle with lites.",
      "city": "newark",
      "shape": "circle",
      "date": "2013-09-30T00:00:00",
      "story": "Circle with lites. it was a circle with what I thought was 6 lites it stayed in the same place with little movement wich I say drifted up and to the right inches from far away but maybe long distance in reality.  it looks far but I can see the circle and the lites brite white green blue I thought red but im not sure. and it is in the same place again tonight my phone can not capture it but now my sister sees it too. also the stars moved faster I feel asleep before it went away.",
      "link": "http://www.nuforc.org/webreports/102/S102816.html",
      "state": "DE",
      "duration": "2.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bf34a",
      "summary": "Bright light on the sky look like a star behind Budweiser and near Newark international airport on 9/18/13 the i saw the same light nea",
      "city": "newark",
      "shape": "circle",
      "date": "2013-09-30T00:00:00",
      "story": "Bright light on the sky look like a star behind Budweiser and near Newark international airport on 9/18/13 the i saw the same light near south orange nj around 17:30 hours",
      "link": "http://www.nuforc.org/webreports/102/S102093.html",
      "state": "NJ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bfa59",
      "summary": "Big white orange changing size fire ball.",
      "city": "newark",
      "shape": "changing",
      "date": "2013-10-14T00:00:00",
      "story": "Big white orange changing size fire ball My wife and I seen a huge orange and white light on the southern horizon.  At first we thought it was the moon because of the tree line.  The object decreased in size until it disappear.  The color of the object went from bright white to orange.   Neither my wife nor I have seen anything like it before.  We will be more vigilant in the future.",
      "link": "http://www.nuforc.org/webreports/103/S103071.html",
      "state": "",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd28",
      "summary": "Orange Fireball Shape Floats Across Sky",
      "city": "newark",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "Orange Fireball Shape Floats Across Sky While sitting outside at around 11:15 pm my friend and I saw a strange orange light floating high in the sky.  It looked like the light flickered as it moved.   It progressed slowly but at a constant speed and eventually changed angels and move further away from us.  It was much larger than any plane.   We watched it for around 5 minutes and then the light just seemed to turn off.   We continued watching for a other 10 minutes but didn't see anything else.",
      "link": "http://www.nuforc.org/webreports/098/S98824.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe95",
      "summary": "Craft was low above trees circling lookin for something to pick up spraying white powder.",
      "city": "newark",
      "shape": "circle",
      "date": "2013-10-14T00:00:00",
      "story": "Craft was low above trees circling looking for something to pick up spraying white powder. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103197.html",
      "state": "TX",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c03b1",
      "summary": "Silent aircraft blinking white light six-flash increments. Followed by jet. Near Kirkwood Hwy and Polly Drummond Hill Rd.",
      "city": "newark",
      "shape": "unknown",
      "date": "2012-12-20T00:00:00",
      "story": "Silent aircraft blinking white light six-flash increments.  Followed by jet. Near Kirkwood Hwy and Polly Drummond Hill Rd. 12/05/12 1:00 AM  Silent aircraft blinking white light six-flash increments.  Travelling South and West in wide circular arc. Followed by jet. Seen near intersection of Kirkwood Hwy and Polly Drummond Hill Rd in Newark, DE. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((ADDENDUM FROM WITNESS)) I entered the date of my entry in Newark DE near Kirkwood Hwy and Polly Drummond Hill Road as 12/05/12. The correct date is 12/04/12. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/095/S95031.html",
      "state": "DE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0454",
      "summary": "Green glowing silent orb moving S at 30&#730; down from the horizon looking east near Kirkwood Hwy and Polly Drummond Hill Rd in Newark",
      "city": "newark",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "Green glowing silent orb moving S at 30 & #730; down from the horizon looking east near Kirkwood Hwy and Polly Drummond Hill Rd in Newark Green glowing silent orb travelling S at 30 degrees down from the horizon.  Disappeared behind tree line.  Looking east near intersection of Kirkwood Hwy and Polly Drummond Road in Newark, DE. Different from a green firework because it didn’t exhibit a parabolic trajectory such as an object in free fall.  Different than meteorite because of bright green color that did not fade. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95029.html",
      "state": "DE",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c04f7",
      "summary": "Noisy aircraft travelling slowly S. Low in the sky; lights on each corner of triangle. Near Kirkwood Hwy and Polly Drummond Hill Rd.",
      "city": "newark",
      "shape": "triangle",
      "date": "2012-12-20T00:00:00",
      "story": "Noisy aircraft travelling slowly S. Low in the sky; lights on each corner of triangle. Near Kirkwood Hwy and Polly Drummond Hill Rd. Noisy aircraft travelling slowly S. Low in the sky.  Lights on each corner of triangle.  Seemed large but that is probably only because it was much lower in the sky than most aircraft around here. Spotted near Kirkwood Hwy and Polly Drummond Hill Rd in Newark, DE. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95032.html",
      "state": "DE",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0bdb",
      "summary": "Slow moving orange and red circle, like a large upside down gas stove range.",
      "city": "newark",
      "shape": "circle",
      "date": "2014-02-27T00:00:00",
      "story": "Slow moving orange and red circle, like a large upside down gas stove range. Slow moving orange and red circle - like a large upside down gas stove range.  We were driving north on 95  in Delaware close to the PA border.   Wish we would of stopped and video taped but it is a busy highway.",
      "link": "http://www.nuforc.org/webreports/107/S107435.html",
      "state": "DE",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c147c",
      "summary": "Black egg floating in the air on freylinghuysen ave by mcD's.",
      "city": "newark",
      "shape": "egg",
      "date": "2013-12-02T00:00:00",
      "story": "Black egg floating in the air on freylinghuysen ave by mcD's Saw black shiny egg shaped ufo on freylinghuysen by mcD's floating in the air",
      "link": "http://www.nuforc.org/webreports/104/S104897.html",
      "state": "NJ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c15b0",
      "summary": "large Reddish White fireball coming through the foggy sky near Newark Airport.",
      "city": "newark",
      "shape": "fireball",
      "date": "2013-11-20T00:00:00",
      "story": "large Reddish White fireball coming through the foggy sky near Newark Airport. On November 17th at 18:45 driving off exit 14 heading on to Route 78 west we saw a large Reddish White fireball coming through the foggy sky, going very fast on a 45 degree angle heading towards Newark airport. It was very foggy that night yet we could still see this object.  My wife thought it might hit a plane that was landing.   After I passed the toll we could see a large tail of smoke in the foggy shy.  What was a little weird was that the line was not straight but zigzagged back and forth.  I checked the news and no one else reported this sighting.   My observation was that it might be a Meteor.",
      "link": "http://www.nuforc.org/webreports/104/S104554.html",
      "state": "NJ",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1877",
      "summary": "Red and green lights and spinning quick movements in a crowded place.",
      "city": "newark",
      "shape": "rectangle",
      "date": "2014-07-20T00:00:00",
      "story": "Red and green lights and spinning quick movements in a crowded place. We were at a carnival and I looked up and I saw a diamond/rectangle shaped aircraft.  It was about 10,000 feet in the air and it had about 4 lights that flickered (in no pattern or sequence) red and green. The aircraft hovered and then made very fast movements back and forth, it also made spinning movements.  The spinning, quickness, spontaneity of the lights and closeness to the ground ruled out any possibility of this being a plane or helicopter. Not many people saw it because no one made a big deal but I alerted my friend and she also agreed that it was like nothing she had ever seen before. After about 10 minutes of scoping the 1 mile radius, the aircraft seemed to just disappear.",
      "link": "http://www.nuforc.org/webreports/111/S111549.html",
      "state": "DE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1bd8",
      "summary": "We were watching the fireworks, when we noticed this thing in the sky flashing green & red lights. At first I thought it was just a hel",
      "city": "newark",
      "shape": "circle",
      "date": "2014-07-05T00:00:00",
      "story": "We were watching the fireworks, when we noticed this thing in the sky flashing green & red lights.   At first I thought it was just a helicopter.  Then people around us started to take notice of it, because the movements of it were so strange.   At one point, it hovered downward real slow, then shot back up really fast, then shot forward, and then backwards.  We couldn't take our eyes off it.  It actually was there for about 20 mins, until it just disappeared in the blink of an eye.  I am 100% certain that this was not a helicopter or any type of man-made aircraft.   I've never experienced something like this in my life.",
      "link": "http://www.nuforc.org/webreports/110/S110928.html",
      "state": "DE",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1fe9",
      "summary": "I witnessed this event that took place, have definitely cited previous ufo activity in the sky seeing two obejcts. I know what I saw.",
      "city": "newark",
      "shape": "disk",
      "date": "2014-05-02T00:00:00",
      "story": "I witnessed this event that took place, have definitely cited previous ufo activity in the sky seeing two obejcts. I know what I saw. I went to my balcony door window this morning at 5:15a.m. I noticed an object sitting stationery in the sky about 30 degrees NE, the size of star, knowing that this object was not a star. As I got my camcorder position the object was moving from right to left in the sky.  I have no calculated measure of distance between my balcony door window and the position the object was sitting stationery in.  I don’t want to give an incorrect measure. I prepared my camcorder at 5:17 a.m. – 5:30 a.m. and videotaped the event I noticed for about 13 minutes. I spotted bright high beam lights bright enough to be blinding to the human eye, I noticed a blue color trying to detect the shape of this object unknown taking a guess maybe round shaped; I counted about 6 large round high beam lights.   I was alone when I videotaped this activity in the sky this morning and this is not my first time spotting this type of activity. I heard no sound of an engine, it was very quiet.  Counting some auto activity driving down the street at that time.",
      "link": "http://www.nuforc.org/webreports/108/S108966.html",
      "state": "NJ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2439",
      "summary": "A  dark large round object extremely high move left,move right and then almost like dance in and out of the cloud making a figure eight",
      "city": "newark",
      "shape": "circle",
      "date": "2014-08-15T00:00:00",
      "story": "A  dark large round object extremely high move left,move right and then almost like dance in and out of the cloud making a figure eight then standing totally still bagan to move in one straight line and disappeared into the cloud.",
      "link": "http://www.nuforc.org/webreports/112/S112463.html",
      "state": "NJ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c28a6",
      "summary": "3 Black Triangular Objects flying silently overhead.  ((NUFORC Note:  Witness is highly experienced, and credible.  PD))",
      "city": "newark",
      "shape": "triangle",
      "date": "2014-11-26T00:00:00",
      "story": "3 Black Triangular Objects flying silently overhead. On the night of November 15th 2014, there were low clouds and I estimate the ceiling to be approximately 400 ft.   I was sitting in my Spa in my back yard, when I noticed a redish yellow light flying low and slow.  It appeared to be pulsing or rotating.  It looked more like a flame than a navigation light.   Then I noticed two more that appeared to be flying in formation with the first. Because of the cloud cover, I could not make out the aircraft that were displaying the lights, but my first thought was that it was a formation of Helicopters.  As they approached, however, I was struck by the lack of any noise.   As the lights were directly overhead, they extinguished.  The lights had been flying SE to NW, but about 30 seconds after they went out, I saw a large, black, triangular object flying (or floating) very slowly moving in a Northerly direction.  It appeared to be about the size of a C-17 at about 400 ft in altitude, but was of a triangular shape.  It was in complete view below the clouds, and I could see the shape perfectly.   My first impression was that it was a Stealth Fighter, but after a couple of seconds, I realized that the trailing edge was perfectly smooth, unlike the jagged edge of a Stealth Aircraft.  Add the very slow movement and the complete silence, and I realized that this was like nothing that I have ever seen.    I watched the object as it flew over my house, and it appeared to be dropping something like a parachute.  At that time, I saw 2 more lights appear from the SE, and they extinguished at about the same point as the others had.   I then saw 2 more of the Black, Triangular objects on the same flight path as the first one.  I lost sight of them as they flew over my house.   From the time that I saw the first lights to the time that I saw the third object fly over my house, was about 4 to 5 minutes in duration. ((NUFORC Note:  Witness has been known to our Center for over 15 years.  He is an aviation specialist, with many decades of experience in that field, and is an exceptionally credible witness, we believe.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115561.html",
      "state": "TX",
      "duration": "4 to 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d6b",
      "summary": "Driving towards E on NJ turnpike at the vicinity of Newark Liberty Int airport towards the eastern sky saw 2 lights move from north.",
      "city": "newark",
      "shape": "light",
      "date": "2014-08-29T00:00:00",
      "story": "Driving towards east on NJ turnpike at the vicinity of newark liberty int airport towards the eastern sky saw 2 lights move from north to south side at extreme velocity for 3-4 secs and disappeared. direction of movement upwards and not towards the earth which rules out meteor..!!!",
      "link": "http://www.nuforc.org/webreports/112/S112748.html",
      "state": "NJ",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3030",
      "summary": "Reg, green lights, movement atypical.",
      "city": "newark",
      "shape": "unknown",
      "date": "2014-08-29T00:00:00",
      "story": "Reg, green lights, movement atypical. I was driving along rte 273 towards Newark.  I saw an object with 2 red lights and 2 green lights in the air.  I thought I was seeing an aircraft go down because it moved towards the ground (still high though), stayed there, shot up and down again and then flew forward.   An airplane and helicopter cannot move like that.  I could not tell the shape as the sky was dark. I thought it was triangular but can't be sure.  I have never seen something like that in my life.",
      "link": "http://www.nuforc.org/webreports/113/S113002.html",
      "state": "DE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4257",
      "summary": "Bright Red Circular Light",
      "city": "newark",
      "shape": "circle",
      "date": "2015-04-17T00:00:00",
      "story": "Bright Red Circular Light At 8:45 pm, my wife and I saw a bright red circular object in the WSW horizon.  At first we thought it was a plane.  It appeared to be moving in our direction, but it stopped and reversed its direction and arrived back to its original spot.   The object then made all sorts of circular moments and weird angled movements.  Next, it would rise up and then down again hiding in the tree line.  It did this movement a couple of times before disappearing.   I would guess it was maybe a couple miles from our location. Our location is between state route 79 north and reform road.  This is the third time we have seen strange things in our night skies that we could not explain.   If it wasn't for the fact we go outside to smoke cigarettes we would not have witnessed any of the events.",
      "link": "http://www.nuforc.org/webreports/118/S118449.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c465f",
      "summary": "((HOAX??))  Circular lights showed up in the sky,",
      "city": "newark",
      "shape": "circle",
      "date": "2015-12-03T00:00:00",
      "story": "My family were driving from Newark to Wilmington, DE.  They were 7 people in the car, everything was foggy so it was hard to see the road, however, from a moment to another circular lights showed up in the sky, they were 10 craft every one has 5 lights and they were coming on line formation. ((NUFORC Note:  We wonder whether this is a serious report, or not.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124401.html",
      "state": "DE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a1c",
      "summary": "Trianular shaped, silent aircraft with pulsing white lights silently and quickly passed over top in Newark, DE.",
      "city": "newark",
      "shape": "triangle",
      "date": "2015-10-02T00:00:00",
      "story": "Trianular shaped, silent aircraft with pulsing white lights silently and quickly passed over top in Newark, DE. Pulling onto my street, around 9:30pm on April 15th, 2015, which is located in a very nice and quiet neighborhood on the outskirts of Newark, Delaware, by the border of Pennsylvania, I happened to look to the left in the west and up into the sky as I usually do, driving home.   I noticed some bright and what I thought were distant lights moving slowly towards my direction eastward.    My first thought was that it was a commercial airliner coming straight towards where is was on Bristol Lane in Cotswold Hills.  I don’t usually see lights this bright or commercial airliners for that matter moving in this direction over top of my neighborhood which slightly sparked my interest. The  PHI Airport is a little over 35 miles NE from me and I do see lots of air traffic at night when skies are clear and this was a clear night.   The Dover Air Force Base is about 50 miles south of me. As I looked up and saw the aircraft, I thought is was far away and might have been low flying because it didn’t appear to be high in the sky.  I was still driving and slowed to stop and watch the aircraft as I saw it approaching fairly quickly.  Within about 30 seconds of spotting it in the distance, it was now almost right on top of where I was.   I quickly rolled the windows down, shut the car off, and stuck my head out of the window to listen for any engine noises.  I heard nothing.  It was still silent outside.  Looking up I could now see that this craft had three large randomly pulsing white lights underneath of it with one red light in the center.  The white lights were not all pulsing at the same time.  They were pulsing independently of each other.  The red light was a solid and consistent brightness.  As the craft went directly over top of me I noticed it was still making no noise at all.  My neighborhood is very quiet and I can usually hear, jets, propeller p! lanes and helicopters.  There is a farm field behind my neighborhood and no bright shopping centers or main roads are very close to me to create noise or light pollution. Looking straight up I also noticed that the body of the craft is in the definite shape of a large dark triangle because it blocked out the sky in that area which was full of stars this night.  I also noticed now that it was moving very quickly because it was very far away at first but within seconds it was on top of me.  As it went overhead, I could see one more small red like in the very back center of the triangle.  It quickly, silently passed over top of me and over the house to my immediate right.  Still no noise at all.  I put my head back into the car and started it up again and then quickly pulled forward to track the object after it was blocked by the house.   When I saw the object again, which was only about 5 seconds later, it was very far away moving in the same eastern direction.  It might have been at least a mile away at that point and quickly and steadily moved away and out of sight in the next minute until I couldn’t see it at all anymore.  That was the last I saw of it.",
      "link": "http://www.nuforc.org/webreports/122/S122433.html",
      "state": "DE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c65",
      "summary": "Red light flickering in the northwestern sky.",
      "city": "newark",
      "shape": "circle",
      "date": "2015-09-17T00:00:00",
      "story": "Red light flickering in the northwestern sky. A flickering red light with green flashes was hovering in the North Western sky tonight.  It has not moved, but there was definitely red flashing with white and an occasional green.",
      "link": "http://www.nuforc.org/webreports/122/S122021.html",
      "state": "DE",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c5c",
      "summary": "Two white lights moving around back an fourth I can see from my apartment building one disappeared the other moves back and forth until",
      "city": "newark",
      "shape": "circle",
      "date": "2015-09-11T00:00:00",
      "story": "Two white lights moving around back an fourth I can see from my apartment building one disappeared the other moves back and forth until it turned red object move back and forth in place until it eventually disappears. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121722.html",
      "state": "NJ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5675",
      "summary": "Red floating orb for sure not craft or fireworks",
      "city": "newark",
      "shape": "fireball",
      "date": "2016-07-08T00:00:00",
      "story": "Red floating orb for sure not craft or fireworks",
      "link": "http://www.nuforc.org/webreports/128/S128222.html",
      "state": "NJ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5650",
      "summary": "Red orange fireball traveling slowly E to W, then dropped and disappeared like it burst apart.  No trail left behind it at first.",
      "city": "newark",
      "shape": "fireball",
      "date": "2016-07-15T00:00:00",
      "story": "Red orange fireball traveling slowly East to West, then dropped and disappeared, like it burst apart.  No trail left behind it at first, until it dropped in a controlled manner. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128379.html",
      "state": "NJ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6888",
      "summary": "My husband and i were driving and a light caught our eye and looked over at it and it hoverd then got further and further in a matter o",
      "city": "newark",
      "shape": "oval",
      "date": "2017-03-10T00:00:00",
      "story": "My husband and i were driving and a light caught our eye and looked over at it and it hoverd then got further and further in a matter of seconds",
      "link": "http://www.nuforc.org/webreports/132/S132865.html",
      "state": "DE",
      "duration": "1-2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b0c",
      "summary": "UFO'S in Newark, NJ.",
      "city": "newark",
      "shape": "other",
      "date": "2017-02-03T00:00:00",
      "story": "UFO'S in Newark, NJ 1/31/17 AT 1:00A.M.EST.  I heard a humming sound.  I thought it was my heating unit, but then a light shined in my bedroom.  I looked out the window and in the sky was 2 lights with a red light in between the 2 white light.  The white lights looked light 2 eyes with a red nose.  I thought it was a drone.  But then it started to head in the direction of my room.  As it got closer, the humming sound eased up.  All I said was this looks like eyes looking at me. It flew over my home, but then in a matter of seconds it reappeared in the original location, that I saw it in.  All of a sudden, the eyes split apart and this red like tail curved like a snake into one little red light.   At that point I told myself I'm not loosing my mind. I truly didn't sleep well.  At 10;00 a.m. est, I got online and started to read UP ON UFO SIGHTINGS.  I told a few people and they said I was crazy.",
      "link": "http://www.nuforc.org/webreports/132/S132400.html",
      "state": "NJ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7134",
      "summary": "An UFO generated intense orange light with sound, modulated those synchronously for 20 sec, while hanging above our house.",
      "city": "newark",
      "shape": "cylinder",
      "date": "2017-07-27T00:00:00",
      "story": "An UFO generated intense orange light with sound, modulated those synchronously for 20 sec, while hanging above our house. Reporting an UFO sighting on July 24, 2017 around 3:00 am. On July 24, 2017, both my wife and I woke up around 2:30 am with loud thunders from lightning.  As we tried to sleep, we heard a few more thunders around the Drummond North area.   Then, suddenly, we heard a loud sound and the intensity of that sound was increasing and decreasing periodically with a time period of 2 or 3 seconds.  Our ears were able to detect that periodic nature of the sound.  Then a bright orange beam of light entered our room through a window.  The intensity of that orange light became brighter and darker in synchronization with ups and downs of the loudness of the sound.  As this event was unfolding, we both thought that lightning might have started fire at a power transformer somewhere.  So, I asked my wife to call 911, and I ran to the window. After removing the curtain of a window, I saw that a cylindrical structure hanging between our house and a neighbor’s house at a height of about 40 to 50 feet above my window.  The approximate size of that cylindrical structure could be about 5 feet in height and 2 feet in diameter.  That structure was generating both the sound and the light beams, and their intensities were modulated synchronously.  The sound had the characteristics of running a huge blower whose speed was changing periodically in a very controlled manner.  The light was so intense that at its peak value that I was getting blinded by it.  Our backward was lighted up as if the sun’s rays on a clear midday have become orange and pulsing. As I tried to look directly at that cylindrical surface, I could only see some window-like features on that structure when the light intensity was low.  The beam of light was practically coming from all over the structure.  Instead of calling 911, my wife was so puzzled by the event that she unknowingly ran to another window and witnessed that bewildering event. Suddenly, the whole thing stopped.  That cylindrical structure just disappeared in front of my eyes, and the world around us appeared to be the same as before.  Approximately, whole event took probably between 15 to 20 seconds to unfold. I realized later that while that event was progressing, not a single dog barked in our area. We do not have a dog, but all of our neighbors do, and their dogs will bark even if a moderately loud car enters our area at night. In the morning when I was looking up and tried to identify the area where I saw that cylindrical structure, I realized that there is no electrical or any other overhead line has gone through that area or close to that area.  The trees around that area have no burning sign, at all.   As if nothing has happened last night.",
      "link": "http://www.nuforc.org/webreports/135/S135354.html",
      "state": "DE",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c73eb",
      "summary": "This occurred on top of McCarthy Hwy in Newark NJ. Clear glass looking balls with a light in the center.  ((anonymous report))",
      "city": "newark",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "This occurred on top of McCarthy Hwy in Newark NJ. Clear glass looking balls with a light in the center.  Moving in a pattern. At least 30 of them.  Beautiful yes unexplainable.  Moving like eerie birds in unison. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134154.html",
      "state": "NJ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c781b",
      "summary": "Very large diamond shaped craft with lights on all 4 points, moving very slowly, then disappeared.",
      "city": "newark",
      "shape": "diamond",
      "date": "2017-12-21T00:00:00",
      "story": "Very large diamond shaped craft with lights on all 4 points, moving very slowly, then disappeared. As my daughter was driving us home from shopping last night through White Clay Creek State Park, we noticed some strange lights in the sky, but they were too far away to tell what was going on.  Once we got closer, we noticed they weren't really moving very fast.  As we neared the object we realized it was not a plane and it was directly overhead of us.  The object was HUGE!  It was diamond shaped and each point had a light on it. It hovered above the trees very slowly but was moving.  We could not believe what we were seeing!  It was making a strange wah wah sound.  As it was going in the opposite direction we were, we decided to turn around and follow it.  We turned around and could not locate it. It was gone!  We drove around for quite some time to try to locate it and as slow as it was going, we should have been able to easily find it, but we did not.",
      "link": "http://www.nuforc.org/webreports/137/S137884.html",
      "state": "DE",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c09",
      "summary": "I first noticed the object when star gazing from a vehicle at approx. 21:18 hrs,  The object appears to be at a higher altitude than an",
      "city": "newark",
      "shape": "circle",
      "date": "2017-09-28T00:00:00",
      "story": "I first noticed the object when star gazing from a vehicle at approx. 21:18 hrs,  The object appears to be at a higher altitude than an airplane in comparison.  At first glance it appeared to be stationary, and looked like a large twinkling star without a focus aid.  But, when aided,  it looks round with bright light and also appears to make quick movements upwards, downwards, and returning to the same position.  It appears round, white with bluish light emitting on occasion.  At 02:40 hrs, It still remains in the sky at even a higher altitude.  This craft has moved over this time span but is still visible.  It seems like air traffic i.e. airplanes,  seem to be normal/uninterrupted. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136315.html",
      "state": "NJ",
      "duration": ">5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c808b",
      "summary": "We were walking in Branch Brook Park and we saw an sphere like object. It was not moving at first, it was just hoovering. However,in a",
      "city": "newark",
      "shape": "sphere",
      "date": "2018-03-23T00:00:00",
      "story": "We were walking in Branch Brook Park and we saw an sphere like object.  It was not moving at first, it was just hoovering.  However,in a second speeded up and dessapeared, we tried to take a video of it but it was sooo fast. we got a picture for memories.",
      "link": "http://www.nuforc.org/webreports/139/S139140.html",
      "state": "NJ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c80f4",
      "summary": "Possible ufo sighting over Licking County.",
      "city": "newark",
      "shape": "oval",
      "date": "2018-03-23T00:00:00",
      "story": "Possible ufo sighting over licking county Evening of March 19th, time exactly I would say 11:12 pm est,  was haveing a smoke at my patio door  very dark night mostly cloudy to cloudy conditions low cloud bank between 10 to 15 thousand feet the object I saw and in question I saw was moving slowly west stopped shot back to the east then west looked yellowish green in color to me being it was cloudy there were no stars or planets visible at the time caught a 20 second video of the object in question watched the video in the video u can see it in the video when it moved back west it was fast the went straight up in the low clouds first thought was a flare or a firework was not the case no noise do not believe it was a plane or helicopter to cloudy to see so it was not a satellite or the iss but clearly caught something in the 20 second video u can decide looking for yourself thought it was worth report to for your attention on this subject!! ((NUFORC Note:  We spoke via telephone with the witness, who sounded to us to be quite sincere and sober-minded.  We received a video, but there is nothing distinct enough in it for us to be able to conclude what the object was.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139234.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8286",
      "summary": "Red flashing light crashing from the sky.",
      "city": "newark",
      "shape": "sphere",
      "date": "2018-11-09T00:00:00",
      "story": "Red flashing light crashing from the sky. Red/pinkish low flying object.  Looked like a steady moving drone, then suddenly ascended down at sharp speed with a trail of flashing light.  Almost like a single firework, but without any crackling sound.",
      "link": "http://www.nuforc.org/webreports/143/S143585.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c83e3",
      "summary": "Early AM with some fog but light in a circle shined though slightly then was gone within seconds.  ((anonymous report))",
      "city": "newark",
      "shape": "circle",
      "date": "2018-09-27T00:00:00",
      "story": "Early morning with some fog but light in a circle shined though slightly then was gone within seconds of me turning my head. It was early morning with lite fog but some light shined though slightly formed in a circle.  Trying to get a photo, I turned my head, and it was gone from the sky.  This all happened within seconds, but I know it was really there in the sky just a moment before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143151.html",
      "state": "DE",
      "duration": "~20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c853c",
      "summary": "Bright white light moving really slow and disappearing.",
      "city": "newark",
      "shape": "circle",
      "date": "2018-09-13T00:00:00",
      "story": "Bright white light moving really slow and disappearing. A bright white light was seen moving in a south west direction.  Moving very slowly, no blinking lights.  Eventually disappearing suddenly.",
      "link": "http://www.nuforc.org/webreports/142/S142981.html",
      "state": "NJ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c959c",
      "summary": "Observed a stationary triangular shaped object over Cecil County, Md. at 5:10 on 12/5/2019.",
      "city": "newark",
      "shape": "triangle",
      "date": "2019-12-19T00:00:00",
      "story": "Observed a stationary triangular shaped object over Cecil County, Md. at 5:10 on 12/5/2019. While driving to work this morning I witnessed an object in the sky. It appeared to be motionless. Hard to make out shape, but it appeared to triangular.  It had clear/white lights. Ten minutes later when I arrived at work,  I got out of my car and the object was still visible. It did not appear to have changed its location.  It appeared to be over Cecil County, Md., but not being able to judge how high up it was in the sky it's hard to say for certain.",
      "link": "http://www.nuforc.org/webreports/151/S151307.html",
      "state": "DE",
      "duration": "10 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3c97a3",
      "summary": "Witnessed low flying craft over the PA side of White Clay Creek State Park while driving on Hopkins Rd towards Route 896.  Object was m",
      "city": "newark",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Witnessed low flying craft over the PA side of White Clay Creek State Park while driving on Hopkins Rd towards Route 896.  Object was moving slowly over the tree, made no noise that could be heard in the car.  It was too far away to make out a definite shape but it was larger than a helicopter and the whole bottom was a bright white light.and at the same time appeared mirrored.   It was gone in a blink of an eye.  It was easily visible when we were driving next to the open fields but as lost sight of it when we drove into the trees we lost sight of it.  We didn’t see it after that.  We thought we’d see it again once we cleared the trees but it disappeared.  It was dark out and the object although close was too far away to notice any details besides the light.",
      "link": "http://www.nuforc.org/webreports/151/S151595.html",
      "state": "DE",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c98f7",
      "summary": "Triangular UFO sighting.",
      "city": "newark",
      "shape": "triangle",
      "date": "2019-10-04T00:00:00",
      "story": "Triangular UFO sighting Was driving home from a late night workout, and saw a noticeably bright and flashing light.  After a few minutes, it was apparent that it was moving, so I pulled over.  I saw two people on the other side of the road recording on their phones.   I was by the Newark Farmers Market when all this had happened.",
      "link": "http://www.nuforc.org/webreports/149/S149231.html",
      "state": "DE",
      "duration": "10 minutes"
    }
  ]
}