{
  "city": "newport",
  "fetch_timestamp": "2025-07-12T14:36:56.413364",
  "record_count": 60,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b45cf",
      "summary": "Was watching the meteor shower at around 5:00 am and seen some meteors.At around 5:40 I spotted a strange light in sky was not aircraft",
      "city": "newport",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "Was watching the meteor shower at around 5:00 am and seen some meteors.  At around 5:40 I spotted a strange light in sky was not aircraft navigation lights had steady blue and white color to it also hovered for  about 40 seconds then looked as if it glitched and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147914.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b45ce",
      "summary": "Was watching the meteor shower at around 5:00 am and seen some meteors.At around 5:40 I spotted a strange light in sky was not aircraft",
      "city": "newport",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "Was watching the meteor shower at around 5:00 am and seen some meteors.  At around 5:40a.m. I spotted a strange light in sky was not aircraft navigation lights had steady blue and white color to it also hovered for  about 40 seconds then looked as if it glitched and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147913.html",
      "state": "TN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b50f4",
      "summary": "The light could move slowly or inordinately fast any direction in complete silence.",
      "city": "newport",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "The light could move slowly or inordinately fast any direction in complete silence. My husband and I were night fishing on Douglas lake near Newport,Tennessee.We were both teachers and it was summer.We do not drink etc.I told my husband to look at the satellite moving over English Mountain. He saw it as it slowly moved right to left at the speed of the old satellites. It sudenly stopped. There was no noise as  helicopter would make. Everything was very quiet. There were no city lights. Then it fell straight down. We were both very quiet and there still was no noise.  Then it started zigging and zagging left and right back and forth up and down. It was still a pinpoint of light--far above english mountain. It stopped again and hovered for about half a minute. Still there was no noise. And then it -zip- went out of sight toward the right in the direction it had come from. My husband and I both asked each other if we had seen what we thought we had seen and did we see the same thing. It was not a flood light or a flashlight--just a bright pinpoint. We have night fished for thirty years and have never seen anything like that since...but my husband has died and I wanted someone the remember what we saw.I can tell you it was stange--We were not afraid of it--But it was eerie-- ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52004.html",
      "state": "TN",
      "duration": "5+minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5283",
      "summary": "11-16-04 On this night both the anniversary of my fathers death and the birth of my grandfather I had an intense UFO experience. While",
      "city": "newport",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "11-16-04 On this night both the anniversary of my fathers death and the birth of my grandfather I had an intense UFO experience.  While laying on the couch I received some kind of message to get up, grab the binoculars and lay under my skylight and look for movement. I remember seeing a couple flashes of light in the star field and being frustrated.  I said to myself \"come on now lets not play hide and seek\" just then I spotted what looked like two saucer shaped craft at about thirty thousand feet. They were huge I could make out lights emanating out from the edges, while coming to grip with the fact that I am looking at real UFOS suddenly through my field of view at about five hundred feet flew a totally silent black triangle. I only saw it for a moment because I was looking through the binoculars and it was so close. At this point I put down the binoculars and went down to my mothers apartment to tell her whats over the roof I think she was concerned that I was going crazy. Sitting in amazement over what I had just seen I started to feel frightened, cotton mouth, heart racing, the works it felt like I was being probed while sitting in that chair. My mother calmed me down and I gained my composure back, I said to myself no more star gazing tonight!. The following night I called my sister to talk about the event, she is a spiritual healer (healingthehologram.com) I told her that I felt like the aliens probed me. She told me to ask what the alien called itself the name Ether came to my mind weird!. We talked for hours till 9pm and I felt much better. As I hung up the phone I looked up and out the skylight and this time gliding at about 200 feet and 20mph rotating slowly was another huge silent triangle with orange plasma round lights on each corner, there is no doubt that they knew I was looking at them, it flew directly over head then turned 90 degrees and flew off WOW up close and personal! ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52963.html",
      "state": "RI",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5440",
      "summary": "A bright orange light. Moved awkwardly up and down as it traveled across the sky...Like a fireball at one point then suddenly moves",
      "city": "newport",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "A bright orange light. Moved awkwardly up and down as it traveled across the sky...Like a fireball at one point then suddenly moves At first there was just one bright light that closly resembled a planet that was really close though and more of an orangy color than a white color. Suddenly after being still for a few minutes the object moved backwards quickly, did a circle, moved to the left and started to become more distant. The object moved away awkwardly. It was moving up and down. Really weird. Later, we saw 5 of them they were further away then the one seen before. They were all on the same side of the sky, as well. THey resembled stars even more. They were still for a bit then one by one or two at a time they started moving away to the right, all in the same direction. As they moved they did not travel straight they moved up and down slightly as the one before did as well. These objects were definitely not planes, because there were planes in the sky and they moved and looked very different. Plus, planes do not move up and down and do weird loop-d-loop things, nor do they stand still for a few minutes then move rapidly away. I swear this is true I am not even one to totally believe in UFO's. It was so weird. Oh and at one point it was like a fireball, and was stationary, then suddenly would start moving away and didn't look like a fireball anymore but more like a plane, but obviously different. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52022.html",
      "state": "RI",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5487",
      "summary": "Silver saucer with white flashing lights flew overhead",
      "city": "newport",
      "shape": "disk",
      "date": "2007-10-08T00:00:00",
      "story": "Silver saucer with white flashing lights flew overhead I was 13 years old, in seventh grade, and I was at lunch with a fellow student and my teacher.  (My teacher took us out to lunch at a local restaurant for good behavior over the course of the school year.)  We sat in a booth, and I faced the window with my fellow classmate.  During the conversation I kept seeing a bright light in the distant sky outside.  I assumed it was the metal from an airplane reflecting the sunlight.  I kept looking out the window because the light drew closer.  I soon noticed the light was flashing, and I thought that it could be sunlight glinting off of a helicopter instead.  My curiousity remained, so I continued to watch it as the flashing light came closer and closer.  Soon enough it actually flew over the restaurant, and I was dumbfounded and in disbelief at what I saw.  It was a rather large, silvery metal saucer, and the flashing [white] lights were on the outer rim of the saucer.  They seemed to be flashing because the lights would turn on and off in a line, going round and round the rim.  Looking back, I suppose the lights could have seemed to be going round and round if the saucer were spinning, but at the time that did not seem to be the case.  Either way, I could not believe what I had seen.  I asked my friend sitting next to me if she had seen it, and she said she had not seen it.  I think they both thought I was crazy, but even to this day I cannot shake the image from my brain.  I know what I saw and I believe in my experience 100%. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59026.html",
      "state": "ME",
      "duration": "5 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b5865",
      "summary": "A montage of events, you figure out what this was, I really am not sure.",
      "city": "newport",
      "shape": "other",
      "date": "2007-02-01T00:00:00",
      "story": "A montage of events, you figure out what this was, I really am not sure. While leaving a friends house in rural Monroe County, three of us stepped out onto the front porch.  I commented on a greenish glow in the horizon, but the other two friends thought I was being funny.   I didn't say anything more about it, but after about 1 minute, I noticed that the horizon had become substantially greener.  The neon green glow stretched from one end of the horizon, to the other.  This was a very large phenomenon.  I told the two I was with to look again, and they were very surprised by what we were now looking at.  Very soon after the horizon had taken on what was now a very green glow, objects began to materialize then dematerialize, and move in an \"S\" shape for about half an hour.  This is a description of the objects that materialized:  First, let me tell you that the night was perfectly clear.  The initial object appeared and had a cloud like texture, which literally materialized right before our eyes, but then began to expand outward in the a diamond shape, with the center being empty, yet it was aligned with the outer diamond shape.  After reaching a certain size of expansion, the object would dissipate, or dematerialize.  Then, more of the same object began to occur, and began occurring simultaneously in different areas of the horizon.  Very soon after, another object appeared, but this one was circular and would move in an \"S\" shape downward toward the earth, leaving an \"S\" trail, and then dissipating as well.  This also had a cloud like texture to it.  Several of both kinds of objects kept appearing and either expanding as a diamond shape until dissipating, or growing into a circular shape and moving in an \"S\" pattern, downward toward earth.  The sky remained a very strong glow of green, and then in what seemed to be the climax of the entire event, two objects, both about the shape and size of a full moon, seemed to materialize out of nothing, a single object in between them appeared and shot down toward earth, and then shot right back up again.  After this, the entire phenomenon began to slowly go away.  It took another 15 minutes for it all to stop, each of the objects I described, except for the final moon like objects, began to appear less and less, and the sky slowly turned back to normal, and then it was all gone.  Let me note, this phenomenon made no sounds.  Also, I ran in the house and called the Sheriff’s department to ask if anyone had reported any strange phenomenon in the Northern part of the sky.  They said no, so I did not want to talk any further as they would have thought I was crazy.   I also called my sister who lived about 25 miles north of where I was and she said she saw nothing in the sky either.  So, I just ran back outside to continue watching.   My friends and I were in shock at what we just witnessed.   Then, I decided to go home, but I did notice every here and there, people were pulled over onto the side of the road watching the sky.  I have to think that they saw the same thing I did.   The following day, my friend who was with me, and attended the University of Michigan, asked a science professor if the northern lights were visible from where we were and he said they were not.  Besides, the northern lights don't do all that! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54309.html",
      "state": "MI",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b59b6",
      "summary": "0:00 04/23/08 Newport Oregon High Flying Objects with Red Halo/Haze @ High Speed, No Sound",
      "city": "newport",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "0:00 04/23/08 Newport Oregon High Flying Objects with Red Halo/Haze @ High Speed, No Sound At approximately midnight I was outside looking at the stars. I noticed an extremely highflying object moving east off the ocean then quickly changing course proceeding southwest. The object had an enormously large red haze or halo around what looked like a star, traveled at fast speeds with no sound. Because the object was flying so high, this red halo/haze was the only way my eye could keep tracking its position and movements which I consequently lost sight of behind high clouds. A moment later I tracked another object starting at the same position as the first, again showing a red haze/halo around it and followed the same course.",
      "link": "http://www.nuforc.org/webreports/063/S63347.html",
      "state": "OR",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b99",
      "summary": "Bright blinking rows of lights with a red light that changed position, hovering in the northern and northwest sky.",
      "city": "newport",
      "shape": "changing",
      "date": "2007-11-28T00:00:00",
      "story": "Bright blinking rows of lights with a red light that changed position, hovering in the northern and northwest sky. We saw a bright blinking row of lights hovering in the northern sky, toward Havelock. Then we saw another of the same in the northwest sky. There was a red light blinking and it would move from the center of the row to the left, then back again to the center. It got closer for a short time, and the shape looked like a V shape. It was not close enough to distinguish the color of the craft. The one in the northwest sky moved after about 45 minutes, further north a short distance. Then the one closer began moving away slowly, but before I sat to type this, it was still in the sky. We live on the coast of the Newport River but these lights were inland. We saw them off of our back deck, with no house lights on or reflections from other lighting. Amazing.",
      "link": "http://www.nuforc.org/webreports/059/S59162.html",
      "state": "NC",
      "duration": "almost 1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d0e",
      "summary": "Sighted two orange rectangles above treetops while driving on a county road.",
      "city": "newport",
      "shape": "unknown",
      "date": "2007-04-27T00:00:00",
      "story": "Sighted two orange rectangles above treetops while driving on a county road. While a passenger in a vehicle being driven by a friend, we were driving on a country road in a wooded area after dark.  We first saw a stationary orange rectangle on a ridge line about a quarter mile away.  As we drove along the base of the ridge about 20 seconds later we noticed an orange reflection in the windshield, and at that point I rolled down the window and stuck my head out the door to look straight up.  What  I saw at that point was a pair of rectangular orange panels moving in sync directly above our vehicle, just above the treetops, mirroring our path along the winding road.  This conitnued for about two miles.  The objects made no noise, and there was no wash of air hitting us from above.  I believe the panels were part of one object, located at the rear of it.  I kept my eyes fixed on it the entire time and when we came to a stop sign I jumped out of the vehicle and it shot straight away from us, slightly gaining altitude, but made no noise.  It did not disappear over a horizon line, but disappeared from view in the distance in less than two seconds.  I estimate each orange rectangle to have been about 15 by 20 feet and about 20 feet apart, with the outer edges angled slightly forward. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Source of report elects to remain anonymous; provides e-mail address only.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55945.html",
      "state": "PA",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6209",
      "summary": "Young woman, and her boyfriend, witness a bizarre dis-shaped obj. hovering nearby.",
      "city": "newport",
      "shape": "disk",
      "date": "2007-02-01T00:00:00",
      "story": "Young woman, and her boyfriend, witness a bizarre dis-shaped obj. hovering nearby. Telephoned Report:  A mother calls to recount her daughter's experience in Newport, CA.  The daughter was driving with her boyfriend, when the two of them observed a large disc hovering motionless beside the road.  It appeared to them to have a distinct \"bulge\" on the top side of the object, and it had flashing green and blue lights along the edge of the flange of the object.  The boyfriend stopped his car, and the young woman (age 22 yrs.) attempted to photograph the object with her digital camera.  When the flash of the camera flashed, the object suddenly shot toward the witnesses, passing over their car.  They both heard a peculiar buzzing or humming, as it passed over.  Daughter reported to her mother that there were an estimated 10 other vehicles stopped on the same road, and that at least one police cruiser also was present.  Mother telephoned the Newport Police Department, but the police did not volunteer that any incident had been reported to their offices.  NUFORC is awaiting a written report from the two witnesses.",
      "link": "http://www.nuforc.org/webreports/053/S53990.html",
      "state": "CA",
      "duration": "10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6732",
      "summary": "Completely black huge circle covered at least a mile",
      "city": "newport",
      "shape": "circle",
      "date": "2006-07-16T00:00:00",
      "story": "Completely black huge circle covered at least a mile I was at work and outside and as I always do I looked Up at the stars and as I did in this night something was very differant , there was a patch of stars missing it looked like but with further observance i saw that they werent missing but were covered up by this huge black circle . It was moving very slowly across the sky but was completely black ,no lights on it at all . I starred at it for awhile til I was called in by my boss and then had her come look at it too . It was In the paper the next day and is still unidentified . There were no militatry crafts out at the time this happened or airlines through this area either . I wish i knew what is was . Very strange in deed . ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50769.html",
      "state": "NC",
      "duration": "an hour or so"
    },
    {
      "_id": "64d005f478aba2ec5a3b738f",
      "summary": "newport,oregon  ufo",
      "city": "newport",
      "shape": "triangle",
      "date": "2008-02-14T00:00:00",
      "story": "newport,oregon  ufo   started around midnight on feb 12 2008, I thought i was seeing an airplane, around 1am I then witnessed the same object had moved from south to south west keeping the same height in the night sky, got curious when i noticed red green purple blue lights flashing, I grabbed my telescope and saw a craft, I saw a space ship not a light, i saw a craft surrounded by lights blinking, it was gray metal looking with balls of lights on the outer edge of the craft, i was also able to zoom in to see outlines or designs, hard to explain looked like it was a seem on the ship or something outlining the edge of lights it was more arrow shaped bottom was indented like an arrowhead.( the bottom part),it was floating facing if that is the front towards outer space floating clockwise in a circle. I lost it in the sky my neighbor also saw it with me, i later around 2:20am notice it again but was too far, I only could make out the lights it was due west over the ocean, got my telescope again and saw it fly away into space.",
      "link": "http://www.nuforc.org/webreports/061/S61560.html",
      "state": "OR",
      "duration": "3hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b73ed",
      "summary": "occuring right now",
      "city": "newport",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "very important. no joke.  i see again a red and white  blinking lite hovering over atlantic ocean.  this is not a joke.  it is occuring right now ((NUFORC Note:  Witness elects to remain semi-anonymous;  provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62453.html",
      "state": "RI",
      "duration": "present"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e1d",
      "summary": "Craft hovering about a half-mile over my head",
      "city": "newport",
      "shape": "rectangle",
      "date": "2009-12-12T00:00:00",
      "story": "Craft hovering about a half-mile over my head My first sighting was in 1970 near Newport, Rhode Island.  I was seven years old, playing outside.  It was summer, a bright sunny day.   I looked up and saw an object floating above me.  It looked similar to a lunar module.  Very 'boxy' with lots of projections extending from it.  It made no sound and lifted straight up into the sky until it was gone.   I have experienced three sightings of UFOs in my lifetime. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73259.html",
      "state": "RI",
      "duration": "several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f8d",
      "summary": "Two separate LARGE  balls of light fell from sky within five minutes of eachother.",
      "city": "newport",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Two separate LARGE  balls of light fell from sky within five minutes of each other. At about 1:00 am i witnessed a large ball of light fall out of the sky. it happened pretty fast. It was like something i've never seen before. My friend saw it at the last second before it went over the horizon. About five minutes later my friend saw one northbound. ( the previous one was east) It was pretty bright. it had had a slight green glow around it. after these sightings we spent a little over an hour watching the sky, there was no more activity so we went home.",
      "link": "http://www.nuforc.org/webreports/071/S71968.html",
      "state": "OR",
      "duration": "8sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8716",
      "summary": "((HOAX??))  4 cigar shaped craft hovering over newport",
      "city": "newport",
      "shape": "cone",
      "date": "2008-10-31T00:00:00",
      "story": "4 cigar shaped craft hovering over newport one then three individuals was outsode on a clear dark night and saw sone stars start to move and opon further examination concluded that they were large cigar shaped craft ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65283.html",
      "state": "RI",
      "duration": "10mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8744",
      "summary": "((HOAX))  flying saucer speeds by overhead while bystanders are appaled while the traind investigator me is not surprised.",
      "city": "newport",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "flying saucer speeds by overhead while bystanders are appaled while the traind investigator me is not surprised. two individuals spotted a shiny disk shaped craft speed by overhead. it looked like one of the ships that were jetisond from the cigar shaped craft the night before. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65298.html",
      "state": "RI",
      "duration": "30sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e1c",
      "summary": "Strange U.F.O. space craft spotted over Newport Maine.",
      "city": "newport",
      "shape": "oval",
      "date": "2009-03-19T00:00:00",
      "story": "Strange U.F.O. space craft spotted over Newport Maine. Tuesday January 27th 2009 at 11:30 pm, In Newport Maine, I happened to look out my kitchen window and see a very large distinct U.F.O. space craft up in the sky. It appeared to be hovering above somewhere over the town of Hermon Maine. It was initially slowly making it's way left towards Bangor then it stopped in mid air and hovered for about 30 seconds, it then moved back towards the right and stopped and hovered again, it hovered for about 2 minutes and then slowly started hovering straight down until it dissapeared out of sight due to the tree line. It had distinct white and red flashing lights that didn't match up to any plane or helicopter that I've seen at night before. It also didn't have any audible sound in the sky like a plane would. It also seemed quite low in the sky as well as moved any direction it pleased. My grandfather also witnessed it right along side of me. A gentlemen who works with my grandfather said his wife (and her female passenger in her car) saw the same U.F.O. earlier that night at around 9:30 pm on her way home from the bangor/hermon area. She said that she stopped on a hill heading home to watch the U.F.O. and she said that it looked pretty nearby to her. She said it just hovered for a while and then dissapeared out of sight. I could clearly tell from my observations that night, that this was some type of unexplainable U.F.O. space craft.",
      "link": "http://www.nuforc.org/webreports/068/S68335.html",
      "state": "ME",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5fb",
      "summary": "Pink Phoenix Lights type grouping",
      "city": "newport",
      "shape": "formation",
      "date": "2008-07-05T00:00:00",
      "story": "Pink Phoenix Lights type grouping Was riding with a friend north on St Rt 66 towards Fort Loramie, Ohio. Noticed pinkish lights – four in a formation similar to the \"phoenix lights\".  One light was the point; wedge shape had two lights on one side and one light on the other.   We pulled over the car as they slowly blinked out one after the other from East to West.  They did not return from what we could see.   The night remained mostly clear with stars visible and much smaller than the pink colored lights.",
      "link": "http://www.nuforc.org/webreports/064/S64030.html",
      "state": "OH",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb186",
      "summary": "Bright lime green orb that appeared, hovered, and then quickly shot downward leaving green trail.",
      "city": "newport",
      "shape": "sphere",
      "date": "2011-01-05T00:00:00",
      "story": "Bright lime green orb that appeared, hovered, and then quickly shot downward leaving green trail. It was on Saturday, December 11 2010 around 3:30 a.m. I was out behind my house in my garage working. I had to move a car from the back and park out front. After I parked the car I started to walk back to my shop. The walk is approximately 60 feet. It was a cool clear night, the stars were out with almost no clouds. As I walked back I saw how calm and clear it was. So I decided to stop and just admire how nice it was. There I stood for a good minute looking upward at the southern sky. Nothing obstructed my view, and I was looking in the same general direction the whole time. My eyes were about at a 45 degree angle with the horizon. As I said I was looking at the sky for a good minute and I am sure nothing but stars were there. Then suddenly in the calm and clear sky it appeared. Yes it just appeared, as if someone had flicked a light switch.  It was a very, very bright round sphere. It had a distinct edge to it.  It was a lime green color with a green lighted haze or fog pulsating and radiating all around it.  In relation to where I was standing I would have to say it was 400 feet forward.  The height was at least 250 to 350 feet up now judging from its position above the house below it.  To where I was the size was like a basket ball. Next to the stars it was much larger. It stayed there for at least 7 to 10 seconds, not moving an inch from where it appeared. Not getting any dimmer, or changing in any way.  When without any warning or change it quickly darted directly downward, leaving a straight bright lighted green haze trail behind it.  Within 10 seconds the lighted trail diminished completely, and nothing was there.  The whole incident happened quickly and only lasted at the most 20 seconds from start to finish.",
      "link": "http://www.nuforc.org/webreports/079/S79247.html",
      "state": "NJ",
      "duration": "15 secs."
    },
    {
      "_id": "64d005f478aba2ec5a3bb719",
      "summary": "Moving object recorded  in sky",
      "city": "newport",
      "shape": "light",
      "date": "2010-08-24T00:00:00",
      "story": "Moving object recorded  in sky we laid out to see the meteor shower when we notice a very bright light that didn't move.  It was brighter then any star we have ever seen, which is what originally brought our attention to it.  After a while, it significantely dimmed in brightness, almost to the point of disappearing.  We then got our video camera out and although we couldn't see anything through the camera, when we later viewed the digital image we discovered alot of anomolies.  It moved very fast in multiple directions.  At one point during or filming, we noticed an orange light that zipped all over the area in no appearant pattern.  It left a trail behind it as it zipped through the sky, right up until the point where it completely disappeared.",
      "link": "http://www.nuforc.org/webreports/077/S77200.html",
      "state": "NC",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb8df",
      "summary": "UFO photo sighting",
      "city": "newport",
      "shape": "disk",
      "date": "2010-07-10T00:00:00",
      "story": "UFO photo sighting UFO sighting off castle hill, Newport, rhode island.   We were taking photos of Newport harbor on a digital camera and when we reviewed photos the UFO appeared as you can see below.   UFO was not seen except for in photo.   We were standing in an open field with nothing above us or around.",
      "link": "http://www.nuforc.org/webreports/076/S76377.html",
      "state": "RI",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd6e",
      "summary": "black triangle newport tn  cocke county",
      "city": "newport",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "black triangle newport tn  cocke county triangle shape ,3 lights white  one on each corner red light in center no blinking low hum,no jet or propeller sound traveling level in straight line guess at 1 to 2 thousand feet about same as fighter jets that sometimes fly thru mountians here. went directly overhead was looking at bottom of craft no jet flame to dark to see body only the lights moving toward southwest.moving to slow for a plane and was a perfect triangle.  saw a couple of high flying comercial jets at same time steve",
      "link": "http://www.nuforc.org/webreports/085/S85583.html",
      "state": "TN",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc954",
      "summary": "Two men observe large, red/orange, glowing object disappear into the night sky.",
      "city": "newport",
      "shape": "fireball",
      "date": "2011-07-17T00:00:00",
      "story": "Two men observe large, red/orange, glowing object disappear into the night sky. During a camping trip in Newport, OR, myself and a friend of mine were watching the sunset along the coast line.  We were facing the western coast line from 20:30 - 23:00  Approximately 30 minutes after the sunset we noticed a single, large, glowing object moving across the water.  We dismissed it as a barge of some kind and didn't pay it much attention until it started  moving into the air. The object in question was  moved slowly back and forth in the air then shot back down behind a nearby jetty.  We then observed the \"fireball\" like object maneuver above the jetty making swift movements along the length of it. At last the object slowly raised up into the air, positioned itself behind a nearby hill then shot up into the night sky and disappeared. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82352.html",
      "state": "OR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0f0",
      "summary": "Silver cylinder moving east west as fast as a satellite without any sound, wings or tail....looked like a shiny pipe.",
      "city": "newport",
      "shape": "cylinder",
      "date": "2012-09-24T00:00:00",
      "story": "Silver cylinder moving east west as fast as a satellite without any sound, wings or tail....looked like a shiny pipe. Silver cylinder moving east to west no sound no contrail going as fast as a satellite. An regular jet came right after it making noise and looking like it was hardly moving in comparison.  The cylinder was much higher but looked as big as the other plane ...  Just no wing or tail.&quot;..looked like a shiny pipe zooming along.....straight as an arrow.",
      "link": "http://www.nuforc.org/webreports/092/S92019.html",
      "state": "NH",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd414",
      "summary": "Two separate sightings over a few hours of multiple red orbs over the eastern carolina coast.",
      "city": "newport",
      "shape": "circle",
      "date": "2012-08-05T00:00:00",
      "story": "Two separate sightings over a few hours of multiple red orbs over the eastern carolina coast. Two friends and I were using a small boat to cross the sound between Emerald Island and the mainland to camp on a small island over night. We set out right near sunset, and arrived on the island right as it was getting dark. We were located on the unnamed island just north east of Lovett Island on the southernmost shore. We started to set up camp in a hurry, as it was getting dark fast. As we were setting up the tent, my two friends started to look up at the sky and told me to do so. Over the main land, what seemed to be quite some distance away, was a glowing red orb slowly moving through the sky. It looked as if it was passing the auxiliary landing field for the local military base from the North, heading northeast. It looked as if it may have been traveling at the same speed as a helicopter, but we could hear no noise. It continued moving down the inland shore until we could no longer see it in the distance. We discussed what it may have been, but could not come to a conclusion. We haven’t seen anything like it before. A few hours later is when an even more astounding sighting occurred after we set up camp and settled in. About two hours after settling in we ingested 25i-nbome, a legal hallucinogen. I know this might diminish the credibility of my witness for the following sighting, but I wish to report it either way. Might I also add that I could tell a difference between what was real and what was a hallucination. We were now sitting on a blanket looking at the stars facing south, southeast. One of my friends was in the tent having an argument on the phone. My friend again, with a surprised voice told me to look up. We both saw the same thing. There were three glowing red orbs, just like the one from earlier, heading in the same direction, this time over Emerald Island. Again, they were heading northeast towards Morehead city. From our perspective they were in the shape of a triangle with one UFO in front and the other two following. They kept this formation for around 40 seconds before the lead UFO broke off ahead of the others. Its glow began to dim before finally disappearing.  The other two were still bright and slowly moving down the coast. One orb seemed to drop three smaller colored orbs out of its bottom which fell quickly to the ground. This detail, however, I am unsure of because of its similarity to a hallucination. The three UFOs were very clear however.Suddenly a fourth red orb appeared coming from the ground (or ocean on the other side of the island). It rose in an arc shape before reaching the altitude of the other two. They moved in small increments with the trailing craft mimicking the same movement from behind as if it were being tugged by the leading two craft.  They moved down the coast like this as well before fading out of sight. Again the only detail that I believe may have been a hallucination was the orbs falling from one of the UFOs to the ground. Our third friend did not witness! this sighting because he refused to leave the tent. After this, the night was relatively calm with no more activity.",
      "link": "http://www.nuforc.org/webreports/090/S90757.html",
      "state": "NC",
      "duration": "around a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd46e",
      "summary": "Out of nowhere fireball appeared and disappeared.  Red/Orange in color.",
      "city": "newport",
      "shape": "fireball",
      "date": "2012-05-13T00:00:00",
      "story": "Out of nowhere fireball appeared and disappeared. Red/Orange in color. I was sitting on my deck around 7:30 pm talking to my employee and my son.  Out of nowhere behind them above the tree line a red/orange fireball appeared.  I said to my son and employee..\"What is that?\"   They both turned to witness the fireball only for it to just dissappear in a matter of seconds.   I have yet to see it again and to this day wonder what it could have been......it exploded and imploded.  Was quite strange!! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88325.html",
      "state": "NC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4a9",
      "summary": "2 fireball objects changing to triangle objects pulsing orange light flying overhead at purgatory chasm in Newport.",
      "city": "newport",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "2 fireball objects changing to triangle objects pulsing orange light flying overhead at purgatory chasm in Newport. Me, and my cousin were at Purgatory Chasm near second beach. I Noticed what looked like 2 embers of a fire coming up over the trees. They looked to be moving straight up, and as they got higher they started to take a triangle shape. It was a subtle change not really noticeable. They were glowing orange, but in the center of the object there was a pulsing light. It was pulsing like a slow heartbeat. the speed stayed steady, and there was no sound being emitted. My cousin literally thought it was debris from fireworks until they went straight up, then flew overhead. both objects just faded into the sky, and dissipated. I Thought the first one went into the clouds, but when the second one followed it faded before it reached the clouds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90654.html",
      "state": "RI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd817",
      "summary": "One bright red light, not flashing, traveled from north to south about 1,000 ft above us.",
      "city": "newport",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "One bright red light, not flashing, traveled from north to south about 1,000 ft above us. It was the night of the 4th of July, 2011 in Newport, Oregon, along the Central Oregon Coast. My friends and I were on my boat, moored at the marina, watching the fireworks display over Yaquina Bay. The display ended around 10:30 pm.  I noticed a bright, solitary red light in the sky to the north.  It was traveling north to south, directly towards us, and I believed it to be an airplane; except the light was not flashing, and was much larger than lights on a plane.  I watched the light for about a minute, waiting to see flashing or other colors with it.  But there were no other lights or colors. I pointed it out to one of my friends who had remained after the fireworks display.  He and I watched this bright red light coming in our direction for about two minutes, trying to determine what it might be.  We considered it was probably a light from a Coast Guard helicopter.  That wasn’t the case. Within about four minutes of first noticing the light, it was finally directly overhead, at an altitude of about 1,000 feet.  We then knew it was not an airplane, or a helicopter.  It made no sound whatsoever. It appeared to be traveling faster than any plane that would have been flying overhead.  Almost immediately after it passed us, the light became smaller and dimmer, appearing to be less than half the original size. It seemed to be traveling more than twice as fast once it was south of us, than when it was coming towards us. Within about 20 seconds after passing over us, the light seemed to shrink until it was completely gone. We have no idea what was generating that bright red light thatwe were watching for almost five minutes.",
      "link": "http://www.nuforc.org/webreports/089/S89760.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bda43",
      "summary": "Horizontal white light moving at amazing speed.",
      "city": "newport",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "Horizontal white light moving at amazing speed. About 10:30 pm on june 14th 2012 a bright white light shot horizontally across near Diamond Lake Wa accross the sky in what looked like a south direction.  We have witnessed satellites and planes and shooting stars frequently but this was some kind of flying craft and it was going faster than anything I have ever seen. It was unexplainable and going perfectly horizontal. This light had no explanation whatsoever and I and my witness have never seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/090/S90108.html",
      "state": "WA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb43",
      "summary": "6 Orange Fireballs",
      "city": "newport",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "6 Orange Fireballs On 9-11-2012 at approximately 9:32 PM, I had just gotten home from a friend’s house about 3 blocks from my home in Estral Beach, Newport, Michigan.  I was getting out of my vehicle when I noticed a HUGE orange glowing ball coming from Lake Erie.  I hurried up and ran in the house to get my husband.  We both ran outside and were in awe at what we witnessed.  There were a total of 6 HUGE orange glowing balls that looked as if the end was on fire.  They came in pairs but they were not very close to each other.  There was no sound and they looked to be as big as a vehicle.  They were much lower than any aircraft I have seen.  We called several other people in our community to go outside and witness this.  Several witnesses said that there were small “search” planes in the area and over Lake Erie very shortly afterwards.  We live only a few miles from Fermi Nuclear Plant.  This is the first time we have ever seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/092/S92696.html",
      "state": "MI",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be3d3",
      "summary": "Bright light in the sky",
      "city": "newport",
      "shape": "light",
      "date": "2012-06-20T00:00:00",
      "story": "Bright light in the sky My girlfriend and i were sitting by the river when we seen this tiny bright light vertically cross the night sky i didn't notice it for about 5 seconds until my girlfriend said hey look at that shooting star, I was draw to it saying babe its a jet plane which i came to find out wasn't!!  its speed increased as it covered the entire skyline coming from the west going east, it disappeared into the darkness but not soon after that a flash of light lit the sky from the say way the ball of light traveling.    NEWPORT, WA",
      "link": "http://www.nuforc.org/webreports/089/S89614.html",
      "state": "WA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be4af",
      "summary": "I saw a red fire ball that I thought was a plane on fire coming down diagonally from the sky.it landed in the ocean at first beach in N",
      "city": "newport",
      "shape": "circle",
      "date": "2012-07-04T00:00:00",
      "story": "I saw a red fire ball that I thought was a plane on fire coming down diagonally from the sky.   It landed in the ocean at first beach in Newport.  I was about to call the news but another person at the beach had called the police because they also saw the fire ball hit the water.  After it hit the water it continued to glow for a few seconds and then disappeared. ((NUFORC Note:  Date above was flawed.  We have amended it to reflect a sighting on July 1st.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90318.html",
      "state": "RI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be64d",
      "summary": "Dark stationary object w/ no lights; some type of stat. undercarriage.  ((NUFORC Note:  Report from Air Traffic Controller.  PD))",
      "city": "newport",
      "shape": "disk",
      "date": "2012-06-08T00:00:00",
      "story": "Large dark stationary object with dark stationary object. From Newport RI next to the Coast Guard Station at the Oceancliff resort, looking west toward Jamestown RI a half hour before sunset.   I and ((name deleted)) (my wife’s brother in law) observed a dark stationary object in the western sky, silhouetted against a clear sky.  I estimated it to be 10 to 15 miles away so it was a large craft.   It had no lights and it appeared they have some type of stationary dark stationary object.  It looked to be about 2000 feet.   I was not able to get a good camera shot of the object as it was approaching dusk and hard to see. ((NUFORC Note:  Report from Air Traffic Controller.  Date in July 2010 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89434.html",
      "state": "RI",
      "duration": "3 to 4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be72b",
      "summary": "Strange lights that we cant explain as known aviation",
      "city": "newport",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "Strange lights that we cant explain as known aviation 5/5/2012 My husband and I went for a drive to see the ‘supermoon’ that night.   About 21:30, I pulled into the town boat launch to look at the water.  We immediately noticed 2 bright lights in the sky to the northeast.  It looked like two planes flying side by side but the lights were bright orange.  They seemed to move in tandem at about the speed you might expect a plane to fly.  Because of the strange color, we got out of the car and watch the lights.    Suddenly, a third light appeared  some distance behind the other two, also flying north to south.  The first two crossed about 1/3 of the sky line, then stopped moving in the sky, just seemed to sit there.  There was no sound.  The first two lights dimmed and went  out in a span of about 5 seconds.  Then the light in the back, which never made it as far as the first two, also dimmed and disappeared.  We could see stars throughout this event.",
      "link": "http://www.nuforc.org/webreports/088/S88825.html",
      "state": "ME",
      "duration": "3 - 4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bfadf",
      "summary": "Slow moving white light with red sphere rotating tightly around it, disappears into thin air.",
      "city": "newport",
      "shape": "circle",
      "date": "2012-12-20T00:00:00",
      "story": "Slow moving white light with red sphere rotating tightly around it, disappears into thin air. During observation of stars at a local beach, where the land is low for miles and a majority of the sky is unobstructed, we noticed a slow moving white light with a rotating red sphere around it. We could not tell if the red was a solid or a light but it appeared to be rotating in a vertical position tightly around the white light.  Flying height was similar to small aircraft, appearing to be about 1 mile horizontally and 1 mile vertically from our viewpoint.  No flashing lights or strobes were seen.  No other colored lights were seen except for the white and red.  Object was moving from East to West horizontally.  It never appeared to be floating or moving upwards or downwards.  No noise was heard from the object.  One or two small aircraft were also flying in the sky at the time and this object did not compare to the small aircraft lighting. Once noticed, we watched the object for about 30-60 seconds and then the lights completely shut off or object disappeared in thin air.  From our viewpoint object was about 45 degrees above horizon, well above any distant landscape.  We could not find it after that even though the sky was clear and unobstructed. Both observers are college educated and one is an amateur astronomer.",
      "link": "http://www.nuforc.org/webreports/094/S94771.html",
      "state": "RI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c00d1",
      "summary": "Two people witnessed five lights floating in formation, absolutely silent, headed from northeast to southwest over my hometown of Newpo",
      "city": "newport",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "Two people witnessed five lights floating in formation, absolutely silent, headed from northeast to southwest over my hometown of Newport, Oregon.   At first we saw just one of them as it came into view over the top of neighborhood buildings.  We thought it was a helicopter floodlight or maybe searchlight since we live right on the coast.  But it didn't look like the same color as the normal U.S. Coast Guard helicopter searchlights that we see from time to time here.  My girlfriend and I stood up at the same time to walk out to get a better look, and we could see that there were five of these \"lights\" floating by in formation.  They looked like \"fireballs\" and they were flying not directly over us, but close enough to get a good long look.  They were flying at about the same altitude as helicopters or other aircraft might fly at, and flew faster than something just drifting by, like a balloon or something.  They did not make any sudden changes in flight pattern, they just went silently past us and headed southwest out over the Pacific Ocean.  We just stood there in amazement and wondered what we were seeing, while trying to capture with our cell phone camera.  We did manage to get around 10 seconds of these strange lights pretty good.  On the recording, it looks part fireball and part weird lights.  Very unusual!",
      "link": "http://www.nuforc.org/webreports/097/S97563.html",
      "state": "OR",
      "duration": "3:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17a9",
      "summary": "Object in night sky lands/communicates with Vega.",
      "city": "newport",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "Object in night sky lands/communicates with Vega. On 5/11/14 at approximately 23:45, I was soaking in my hot tub facing South.  The Moon was 2 days shy of being full yet there was still plenty of stars to see on that clear night. I noticed a couple quick flashes directly under the Moon and quickly came to the conclusion it was a satellite.  Then, I saw the object heading East and knew right away it was moving too fast to be a satellite.  After about 3 seconds, the object shot 90 degrees and suddenly stopped.  I thought to myself, \"way too fast to be anything man made yet too slow to be a shooting star or other space garbage.\"  Not to mention, it didn't 'burn out'. At that moment, I knew it was not of this world.  The object moved up and down and then headed to a bright star.  I later learned from my phone app, Google Sky Map, the star was Vega located in the constellation Lyra.  I could barely see the object as it seemed to closely orbit Vega.  About three minutes later, the object headed North and I lost sight of it. The whole sighting was as if I was looking at a dim star/satellite that was moving at different speeds.  All I can think of is how fast that object must have been going to travel the distance it did in such a short period of time.   Also, if it was a craft of some kind, how could I see it with the naked eye?  My only conclusion is it travelled through some worm hole?  Maybe it wasn't a craft but a form of energy?  I am reporting this in hope that someone else saw it too.  Very interested in if anyone has any thoughts on what I saw also.",
      "link": "http://www.nuforc.org/webreports/109/S109617.html",
      "state": "OR",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1bf9",
      "summary": "Diamond or shield shaped object above cross country  ski trail",
      "city": "newport",
      "shape": "diamond",
      "date": "2014-06-24T00:00:00",
      "story": "Diamond or shield shaped object above cross country  ski trail Saw it when I was skiing on the rail trail that was heading toward Claremont.  Snowing a heavy wet snow at the time.   Saw movement about 300 yards ahead on the trail.  Looked like small black ants moving about with a black box type of thing.  Thought they might be snowmobiles?   Looked up and saw a diamond or more like a English shaped shield.  One side was a reddish color, the other side was metallic colored. It moved into the tree line then disappeared.",
      "link": "http://www.nuforc.org/webreports/110/S110468.html",
      "state": "NH",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1cae",
      "summary": "Numerous orange lights drifting inland from over the ocean.",
      "city": "newport",
      "shape": "light",
      "date": "2014-06-20T00:00:00",
      "story": "Numerous orange lights drifting inland from over the ocean. This observation took place after midnight around 12:30 am but I couldn't get the time entered correctly in box provided. I live across HiWay 101 not far from the beach.  I went out on my balcony to smoke a cigarette and looked towards the ocean through the trees surrounding my home and I noticed some orange round lights drifting through the sky.   At first there were maybe 5 or 6 of these lights.  As I continued to watch more and more lights appeared coming from the area of the beach and ocean.  At one point there were probably 20 lights visible to me.   As I looked towards the horizon more of these lights appeared.   In all I would say there were 50 or more of these lights.   My background is Psychiatric Emergency Specialist, and I am also a Social Worker.",
      "link": "http://www.nuforc.org/webreports/110/S110246.html",
      "state": "OR",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2325",
      "summary": "I was at my place of work where I have a perfect veiw of Newport and Cincinnat. It was five till six in the morning and I happend to lo",
      "city": "newport",
      "shape": "unknown",
      "date": "2014-04-04T00:00:00",
      "story": "I was at my place of work where I have a perfect veiw of Newport and Cincinnati.  It was five till six in the morning and I happend to look out the window and I saw a very big bright white light hovering 5-600 feet above Newport.  It was still dark and the light coming from the object prevented me to see exactly what it was.   It did not move for about 15 minutes.  When it did start to move... the object shut it's lights out and I was no longer able to see it.   It would then reappear after a couple of minutes and everytime it started to move, it would shut its lights out.   The object would continue to do this for about 35 minutes, until finally it disappeared altogether.  I was extremely shaken by this... I've never seen any type of aircraft behave this way.",
      "link": "http://www.nuforc.org/webreports/108/S108205.html",
      "state": "KY",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2343",
      "summary": "Orange oval floating light on ocean unaffected by waves speeds up and slows down on the water.",
      "city": "newport",
      "shape": "oval",
      "date": "2014-04-11T00:00:00",
      "story": "Orange oval floating light on ocean unaffected by waves speeds up and slows down on the water. Two friends and I were having a bonfire on the beach at seal rock in Newport.  There was a bright orange light (the same color orange as our fire) out behind this rock in the ocean. You could see the brightness of the light just beyond the top of the rock.  The light then moved on top of the rock at which point we assumed it was someone that had built a fire just like us.   Slowly the light moved off the rock and made its way across the ocean.  It did NOT bob in the waves, waves did not crash over it but yet it seemed to be floating right there on the ocean.  The light would speed up and slow down randomly.  It was a constant orange glow unaffected by the waves of the ocean and it eventually went around the bend of a giant rock and disappeared.",
      "link": "http://www.nuforc.org/webreports/108/S108511.html",
      "state": "OR",
      "duration": "~1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b4a",
      "summary": "Single orange silent light.",
      "city": "newport",
      "shape": "light",
      "date": "2014-11-14T00:00:00",
      "story": "Single orange silent light. Single solid orange lit object silently flying south to north from Prouty Drive towards Lake Memphremagog.  Maybe 100-200 feet up going steadily at what appeared to be about 50-60 mph.  Clear skies at dusk traveled just above and then into the leafless tree tops away from me.",
      "link": "http://www.nuforc.org/webreports/115/S115297.html",
      "state": "VT",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e9a",
      "summary": "Slow moving 30-60+ amber lights heading northeast of Lake Memphremagog.",
      "city": "newport",
      "shape": "rectangle",
      "date": "2014-08-22T00:00:00",
      "story": "Slow moving 30-60+ amber lights heading northeast of Lake Memphremagog. To the northeast of Lake Memphremagog my fiancé was driving home and said that I should come outside.  She told me that she had observed all of the floating amber colored lights for approximately 5 minutes before she arrived home.  I went outside and saw the drifting to the northeast with others entering from the horizon on the northwest.   There were dozens of the amber colored lights and their altitude was below 5000 feet, as it is very cloudy and a little foggy outside.",
      "link": "http://www.nuforc.org/webreports/112/S112520.html",
      "state": "VT",
      "duration": "5-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3daa",
      "summary": "A daytime cigar/saucer shape object that did not look like an airplane",
      "city": "newport",
      "shape": "cigar",
      "date": "2015-07-10T00:00:00",
      "story": "A daytime cigar/saucer shape object that did not look like an airplane Cigar shape daylight object.  Has distinct cigar, almost saucer shape outline, not shape like a usual airplane.  It was above tree line, but too far away to see detail.  I normally would not report this, but it had unusual shape.  It was white color and straight, not tilted.  It was moving slowly but lost sight as it moved away.  It may have been a manmade object of some sort but no binoculars to get a closer view.  Anyways, the unusual design of the object is the reason I reported it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120232.html",
      "state": "ME",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42d3",
      "summary": "It's movements, no sign of jet fuel, no sound, intense bright light with no rays... my heart is a pounding.",
      "city": "newport",
      "shape": "circle",
      "date": "2015-04-17T00:00:00",
      "story": "It's movements, no sign of jet fuel, no sound, intense bright light with no rays... my heart is a pounding. We were riding on a tractor headed to were another pasture is opened up.  When we got passed the treed line I saw a star like light just hovering and pulsating.  I said to W2, \"That's odd, it's pulsating.\"  Then in stopped.  I mentioned that it stopped, then it started again.  Then it seriously was like we jumped it. It seemed as if it had picked us up on rader and it was busted. It then went to my right and sort of toward two o'clock.  Then it swooped back toward it's starting point.  As it did, it seemed to spin around and this intense white white white light shines, right into my eyes, and W2's.  But, it doesn't light up around us or the surrounding sky, like a lighthouse would.  As quick as it shined it kept spinning to it's previous pulsating light. It came in circular form in the object.  Like on a belt; from it's left rear, around the front of it, so bright, then to the right and behind.  But only once.  It was like, for the moment the light was right on, it was the only focus. W2 said, \"It was like a photographer, five feet in front of you.  And that's about how long it was there, just a flash.\"  It then kept going to the left at a stable speed, keeping a line, until it was gone.  So W2 and I finally come back to the house and are talking about it outside when W3 comes down.  We start telling him about it, and this light starts coming back across the sky, left to right. W2 and W3 saw it turn and head toward the two o'clock direction where it was going to go when we first came upon it. I saw it disaper into the trees. It wasn't too far off.  A jet plane flew over around the same time and it seemed further away than this thing. It's movements, no sign of jet fuel, no sound.  Intense bright light with no rays...  My heart is a pounding.  It was too dark for my phone to catch anything.",
      "link": "http://www.nuforc.org/webreports/118/S118348.html",
      "state": "ME",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4568",
      "summary": "Green ball or cirle of light no sound flying horizontally 5-10 seconds then disappeared in open sky.",
      "city": "newport",
      "shape": "circle",
      "date": "2015-12-03T00:00:00",
      "story": "Green ball or cirle of light no sound flying horizontally 5-10 seconds, then disappeared in open sky. I was walking along the sidewalk heading west as something caught my attention to the right.  There was an object about 200 feet high traveling east to west.  I stopped and stared at it, the object was a ball or circle of green light with no sound.   As I stood there it flew horizontally for 5-10 seconds then disappeared in open sky.",
      "link": "http://www.nuforc.org/webreports/124/S124381.html",
      "state": "NH",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ce5",
      "summary": "Flying disk and unidentified life forms seen in Newport, Oregon.",
      "city": "newport",
      "shape": "disk",
      "date": "2015-09-02T00:00:00",
      "story": "Flying disk and unidentified life forms seen in Newport, Oregon. My experience took place on August 22nd, 2015, at about 2:00am in Newport, Oregon.  My husband and I were sitting on the balcony of our fourth story hotel room, enjoying each other and the ocean.  I saw what appeared to be a shooting star appear from the side of our hotel and said, \"Look!  A shooting star,\" so my husband saw it also.   After a second, I realized it was white and disc shaped.  It appeared to be smaller and a whole lot closer, maybe about the elevation a drone would have been at.   It was angled downward and slightly towards the ocean as it slowly fell.  We kept watching as it as it changed angles and speed, darting directly parallel to the ocean.   As it continued to travel, it slowed again making a boomerang type movement, then darted up to the shore.  It was nearly directly in front of my hotel room and approximately 3 feet above the ocean, it moved slowly back and forth over a few feet of length directly parallel to the shoreline.  It appeared to fade in and out of vision a few times, then reappear a short distance ahead of where it was.  It was as if it kept travelling the same speed and distance, but was fading in and out.   Directly underneath, it appeared 3 beings with white faces that appeared to glow.  They were very visible, even in the dark. After about a minute, the disc disappeared, but the beings remained, and they were directly aligned. From the fourth floor I could not judge size exactly.  These beings had dark bodies, it was easy to see their movements.  They would bend down to the sand, or sit down, then get back up, all at the same time.  They stayed in formation, most times a line, and pretty soon they multiplied.  Nothing flew in or out, they just appeared. 3 became 6, 6 became 8 and at final count there were about ten.   My husband had decided to go out and see up close what was there.  I watched as he made his way down to the ocean.  The beings appeared to become smaller, my husband said he saw that as well.  He said there was a strange energy as he got closer to them.  What he saw were about 10 large birds that were not sea birds.  He was able to walk up closely to them, but they did not startle.  He then shooed them, and they flew off.  When he did that, from the fourth floor, I was able to see that as soon as they moved they were flying.  That means if anything would have flown into view, I would have seen it clearly. I am not looking for scrutiny or publicity, so I would really appreciate if this post could be kept confidential.  This event lasted about 40 minutes in total, but i did not want to take my eyes off of them to go and get a camera.  I figured they could have vanished any minute and I wanted to see as much as I could.  I have additional details that I did not put in this report.  Please contact my husband or me with further questions. Much Respect, ((names deleted))",
      "link": "http://www.nuforc.org/webreports/121/S121528.html",
      "state": "OR",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5162",
      "summary": "T-shaped craft traveling offshore that was absolutely not a helicopter or airplane of any sort",
      "city": "newport",
      "shape": "other",
      "date": "2016-02-11T00:00:00",
      "story": "T shaped craft traveling offshore that was absolutely not a helicopter or airplane of any sort At approximately 5:15am, I witnessed what I can only describe as a UFO traveling in a SW direction over Newport, Oregon.  I was located roughly 3 miles south of the local municipal airport and was outside stargazing before going to sleep, when I noticed a light and what appeared to be the underside of a vehicle lit from below traveling overhead. My first instinct was to get excited, thinking I was viewing the ISS traveling past. I knew that at those altitudes, they are usually still lit by the sun while other areas are in pitch black.  I then realized that this object in no way resembled the ISS and would have been far smaller if it were. Being near the municipal airport, I then tried to guess if it was a plane or helicopter, but the object consisted of a single light (approximately as bright as Sirius) and a main body that split into a “T” shape that appeared lighted from below.  It seemed to be traveling low, but there was no sound at all – we normally have helicopters flying overhead and can hear them very clearly, especially when all other daily traffic is gone.  The “T” shaped section was moving approximately 30-45 degrees off axis, so I knew it could not be a plane. Located along the coastal highway, I watched as this object moved into the tree line.  I was unable to grab a picture with my camera phone, so I jumped in the car to a lookout point along the ocean about .5miles away.  By the time I pulled in and got out (about 2 minutes max) it had already disappeared, having flown off over the water in a west-southwest direction. I’m a scientist for Oregon State University, and have seen many type of aircraft, but this was nothing I know about.  When calling the local police station to ask if anyone else had reported anything, they said they had not heard anything of that nature being called in.",
      "link": "http://www.nuforc.org/webreports/125/S125762.html",
      "state": "OR",
      "duration": "<2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6221",
      "summary": "moving light in the sky",
      "city": "newport",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "moving light in the sky At about around 5:30 am on 9/27/2016 i had notice a rather strange light in the sky,  as soon as i noticed it started moving towards the east from where i was looking as if it had notice me see it.  I have witness several other times strange lights moving in the sky as well in the early mornings and have failed to report them.  They seem to just fade out as if it started to move either east or going straight up or turning off a light.  I know this couldn’t be an airplane because it would have the standard blinking lights and it was not cloudy outside as i could see the stars around this particular light i seen when it vanished,  It wasn’t a meteor because this thing didn't fall towards the ground it just moved a bit and the light on what i have seen just faded out.",
      "link": "http://www.nuforc.org/webreports/130/S130278.html",
      "state": "AR",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c67de",
      "summary": "Bright orange ball, in western sky.  Then disappeared.  Near Orion's belt.",
      "city": "newport",
      "shape": "circle",
      "date": "2017-04-07T00:00:00",
      "story": "Bright orange ball, in western sky.   Then disappeared.   Near Orion's belt A large orange red shape in the western sky....seen from Newport over west side of bay.   At first thought it was a planet, but over bright, near belt of orion. Then disappeared. ....off my bucket list....saw a ufo",
      "link": "http://www.nuforc.org/webreports/133/S133302.html",
      "state": "RI",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b10",
      "summary": "Large bright white star, 8+ orbs and one large plane/shuttle that we have never seen before.",
      "city": "newport",
      "shape": "circle",
      "date": "2017-02-03T00:00:00",
      "story": "large bright white star, 8+ orbs and one large plane/shuttle that we have never seen before. Jan 25, 2017 at 0300,  Spouse and I went riding around starting at 0120 after going to bed early.  The stars were extremely bright out, and we had seen more than twenty deer, with multiple raccoons, hogs, the normal country back road animals.  We have been doing this on and off the past two weeks and nothing seemed out of ordinary.   We decided before going home to go to a hidden place we found early on that was secluded off of hwy 1125 and Speights Road.  Car turned off, husband had the night vision and was sitting out of the window, my window down occ.  Flashing my light.   I had seen a bright star but initially didn’t think anything of it.  I layed my head on the car door and stared at the stars for a second then would turn and turn my flashlight on again.  This time the brightest largest bright white light/star but it was moving slightly just enough to notice from like being in a box and bouncing off the sides.   I called out to my husband two or three times quietly, then knocked him in the leg.  He climbed back into the seat.  I pointed at it and said, “Is that what I think it is?”  He was quiet and just looking then said, “Look at these coming in.”   Four circular, hazy, orange, orbs came up to the left of the bright “star.”  The orbs went from a straight line to a chevron form two or three times before noticing there was more orange orbs coming from behind us.   The bright star moved closer but stayed just below the tree line, looked like when the star blinked the orbs changed formation.  When number 8-9 orbs showed up I was too nervous to stay any longer, but never got the feeling of being threatened.  We were able to see them until very close to 287 and just before town there was a very large plane/shuttle that crossed from our right to our left at a fairly slow speed for a “plane.”  The back of it had red and green lights on the back of it.  Once we went over the overpass/287 we didn’t see them anymore.",
      "link": "http://www.nuforc.org/webreports/132/S132328.html",
      "state": "TX",
      "duration": "20-30"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d7a",
      "summary": "Sighted a disk/saucer shaped craft with rotating lights at 4:30 heading to Newport.",
      "city": "newport",
      "shape": "disk",
      "date": "2016-12-15T00:00:00",
      "story": "Sighted a disk/saucer shaped craft with rotating lights at 4:30 heading to Newport. My mother and I were traveling in a car towards Newport at 4:30 PM, when a moving light caught my notice.  My mother was only able to take a short look at the object as she was driving the car at the time.  I watched it for ten minutes, searching over possible explanations for the strange object.  It lacked the consistent blinking and red and green light color common to planes.   The altitude at which the object maneuvered, I would estimate, was like that of a plane (39,000 feet), possibly lower.  The object moved fairly quickly and was lit by white/yellow light which appeared to rotate.   I lost sight of the object when it moved behind a large cloud and apparently disappeared.",
      "link": "http://www.nuforc.org/webreports/131/S131694.html",
      "state": "ME",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c74ed",
      "summary": "Bright white flashing.",
      "city": "newport",
      "shape": "light",
      "date": "2017-05-06T00:00:00",
      "story": "Bright white flashing We were driving back to Detroit from Ohio, and along 75 north, a bright white light appeared in the West skies..  It got slightly bigger as it seemed to get closer to the ground. It lit up the cloud and tunrded it bright white, where it then looked like a disk.   After it did that it seemed to have literally just dissapeared.  A few seconds of still watching the sky in shock, it appeared again and it got closer, had pushed thru the clouds, and appeared to have blinking lights of some kind.  Literally it shot off after about 3 minutes of it moving thru the sky",
      "link": "http://www.nuforc.org/webreports/133/S133898.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ba1",
      "summary": "Two red orbs the first one came down the beach line up in the sky at night and then it just went straight up into the sky and disappear",
      "city": "newport",
      "shape": "circle",
      "date": "2017-10-19T00:00:00",
      "story": "Two red orbs the first one came down the beach line up in the sky at night and then it just went straight up into the sky and disappeared within a second and then the second Red Orb follow the beach line and look like it was coming right at us and then went straight up into the sky and disappeared",
      "link": "http://www.nuforc.org/webreports/136/S136798.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ef8",
      "summary": "Cigar-shaped object, uncertain of color, had white, green & red counter-clockwise traveling lights, moving slowly at daybreak.",
      "city": "newport",
      "shape": "cigar",
      "date": "2018-05-10T00:00:00",
      "story": "Cigar shaped object, uncertain of color, had white, green & red counter-clockwise traveling lights, moving slowly at daybreak. Cigar-shaped object with white, green and red counter-clockwise traveling lights, in that order, seen in the air over Narragansett Bay, in the area of Newport Bridge & US Naval Base.   It slowly traveled the same short route five times, from west to east & returning to the west.  On the third trip east, it was half way and appeared to go north towards Bristol, but immediately returned south and headed east, again.  On its 5th and final trip, headed east, it disappeared from site.",
      "link": "http://www.nuforc.org/webreports/139/S139790.html",
      "state": "RI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8499",
      "summary": "Metallic cigar-shaped obj.  ((anonymous report))  ((NUFORC Note:  No photo forwarded.  State not indicated by witness.  PD))",
      "city": "newport",
      "shape": "cigar",
      "date": "2018-08-10T00:00:00",
      "story": "Metallic cigar-shaped object. On a earlier date (October 5th, 2017), I went outside to take a picture, for reasons I don't even know, but later next year (5/28/18) I was looking through my photos carefully, when I spotted something on the photo that I took a year earlier.   The object is pretty much a cigar shaped thing and was metallic.  The object I assume is pretty high altitude judging by the original photo.  Sadly, I can't remember what the object was doing since it was a while a go. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142410.html",
      "state": "",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c86d6",
      "summary": "Strange flash in the sky during meteor shower.",
      "city": "newport",
      "shape": "unknown",
      "date": "2018-08-17T00:00:00",
      "story": "Strange flash in the sky during meteor shower. Was watching the Perseids meteor shower around 5am EDT looking to the ENE about 45 Deg up from the horizon seen a flash and sparks.  Unknown if the Meteor hit something or blew up?  No meteor streak just before a strong white flash and a few white/green sparks in one spot in the sky.",
      "link": "http://www.nuforc.org/webreports/142/S142709.html",
      "state": "TN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9902",
      "summary": "I was watching for satellites when I saw 3 in a triangle formation.  Moving in the fashion of a satellite, no blinking light. ((anon.)",
      "city": "newport",
      "shape": "triangle",
      "date": "2019-10-04T00:00:00",
      "story": "I was watching for satellites when I saw 3 in a triangle formation.  Moving in the fashion of a satellite with no blinking light and in high orbit.  All moving at the same speed but in a triangle formation.  Whatever it was it was not a solid formation we could see stars between the formation.  It did not block out light from other stars. it could have been satellites all in Orbit together flying in a v but I highly doubt that.",
      "link": "http://www.nuforc.org/webreports/149/S149278.html",
      "state": "PA",
      "duration": "1 minute"
    }
  ]
}