{
  "city": "norfolk",
  "fetch_timestamp": "2025-07-12T14:35:38.258291",
  "record_count": 47,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b425c",
      "summary": "Dim star that moved sharply,  and intentionally",
      "city": "norfolk",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "Dim star that moved sharply,  and intentionally At approximately 3:15AM on a spring morning, in 1998, I stepped outside from my assigned housing unit at Massachusetts Correctional Institution at Norfolk to have a cigarette.  I looked straight up, because the facility is well lighted, both inside and out, making star gazing less than spectacular.  I happened to focus on what I believed to be two ordinary stationary stars. One star was of medium brightness, and the other star, at the 3:00 o'clock position, was very dim, just half as bright, and about the distance of a quarter held at arms lenght from the other star.  Suddenly, the dim star, just a speck of light, made sharp, angular manuevers, all within close proximity to the other star.  I remember exclaiming to myself \"holy mackerel, that thing is moving\".  I nearly ran inside to get my work partner, but I was afraid to lose track of it, so I just kept watching. Then the pin prick of light made a circular move, which brought it to the opposite side of the stationary star, to the 9:00 o'clock position. These moves only lasted 4 to 5 seconds, maybe a moment more or less. It hesitated for a split second, and then headed south.   I had the presense of mind to start counting: one-one thousand, two-one thousand, three-one thousand, four-one thousand, five-one thousand, six-one thousand, gone!!!  over the southern horizon, where I lost sight of it at about 15 degrees over the horizon.  This speck of light had no sound and no tail.  It never flared brighter or dimmer. This speck of light, which I perceived to be very high in the atmosphere, crossed half the night sky in six seconds!!  It did not blink.   After making its manuevers and going south it did not accelerate, but simlpy arrived at its intended speed and went absolutely straight.   This once in a lifetime observation has annoyed me since it happened and I'm pleased to report it. I have since retired from that line of work.  I look forward to spending many pleasant summer nights observing the the night sky and watching for stars moving in ways that neither the stars or our known military craft should be able to do. Sincerely,  ((name deleted)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49707.html",
      "state": "MA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b46ed",
      "summary": "Loud, hovering oscillating never heard before sound.",
      "city": "norfolk",
      "shape": "unknown",
      "date": "2019-08-23T00:00:00",
      "story": "Loud, hovering oscillating never heard before sound. Heard an oscillating sound that sounded like it was coming from outside hovering around my neighborhood for a few minutes.  I didn't get to see anything, but this was like nothing I've ever heard before.  It was really loud at one point and then proceeded to grow more distant as it went away.  Immediately after, I heard a jet like sound fly over.",
      "link": "http://www.nuforc.org/webreports/148/S148061.html",
      "state": "VA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b49b3",
      "summary": "Moving line of lights close together in line formation",
      "city": "norfolk",
      "shape": "formation",
      "date": "2019-06-07T00:00:00",
      "story": "Moving line of lights close together in line formation There were about 20 aircrafts shaped like the size of stars because they were so far away and they were in a line formation moving South east.  Spread out line with one following far in the rear away from others.  Was in a steady motion about the same as an aircraft but it could’ve been an aircraft because of the number of objects and how close they were.  Colors were ranging from orange to a yellow-white. ((NUFORC Note:  We have corrected the date above.  We suspect an overflight of the SpaceLink satellites.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146357.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e8b",
      "summary": "Bright light moving along the sky heading 57 degrees NE.",
      "city": "norfolk",
      "shape": "unknown",
      "date": "2019-04-08T00:00:00",
      "story": "Bright light moving along the sky heading 57 degrees NE. Saturday, March 23rd, 7:59 pm, Norfolk, VA. A bright white light slowly passing over my house heading 57 degrees NE. The light was very high in the sky.  Possibly higher than an airplane could go but I am not too sure.  I could not see any FAA lights, wings, or anything, for that matter, other than a very bright light, moving somewhat fast in the sky, for how high up it was.",
      "link": "http://www.nuforc.org/webreports/145/S145509.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4eaf",
      "summary": "Extremely loud bang, light spotted in sky.",
      "city": "norfolk",
      "shape": "light",
      "date": "2019-05-09T00:00:00",
      "story": "Extremely loud bang, light spotted in sky. My girlfriend and I were laying in bed and heard this extremely loud boom noise.  Was looking outside to see if I saw a car accident due to the noise sounding very close.  Looked in the sky and say a glowing light moving left to right in an almost perfect semi circle.  The speed changed as the craft moved and at times it would almost look like it was just hovering.  During breaks in the clouds you could see that the light was brighter, but then would go behind cloud cover again.",
      "link": "http://www.nuforc.org/webreports/146/S146038.html",
      "state": "VA",
      "duration": ">10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ef1",
      "summary": "Norfolk Naval Base UFO sighting.",
      "city": "norfolk",
      "shape": "light",
      "date": "2019-04-08T00:00:00",
      "story": "Norfolk Naval Base UFO sighting Was pulling into the parking lot near the piers on Norfolk Naval base.  I glanced out my window (looking south) and seen what appeared to be a shooting star, but it never diminished or faded away.  It looked like a white tic tac and had a greenish glow and short tail behind the object and was moving silently and quick (500mph +) across the sky.  It went from over the piers to out of sight in less than 10 seconds.  Pulled out my phone and captured a video, but it's not visible on the replay and I don't have special programs to enhance the video.",
      "link": "http://www.nuforc.org/webreports/145/S145486.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6eec",
      "summary": "No lights, no trail, no haze around the object, no beams , no change in color, no landing , no sound,",
      "city": "norfolk",
      "shape": "cigar",
      "date": "2008-06-12T00:00:00",
      "story": "No lights, no trail, no haze around the object, no beams , no change in color, no landing , no sound, I heard a loud engin sound and didn't see anything in the sky.  I kept looking the sound went away and I saw a cigar shaped aircraft with NO WINGS fly from  Northeast direction toward the Southeast.  The craft was very high but I could clearly see separation between the front half and a dark band and it looked as if the back half was separate but attached sort of like two short cigar shapes made of what I would think of a dull aluminum.  There was a large dark band at the rear of the first part.  It was really high and I could see it clearly.  No wings and it was going what I would think of as slow and I kept the object in my view  thinking I could get my cell phone and have enough time to get a picture.  I looked down and looked up it was gone it should have been in my view at least 30 seconds more the way it was moving.  If it was a plane it wouldn't have been gone that fast.  It just didn't seem to move across the sky that fast it was a clear sky.  I put my head down and looked back up in a spit second and it was gone.  The change in speed was not something a regular plane could have accomplished.   Which brings me back to it had no wings! This is the second time I have seen something in the sky from my back yard.  I saw a sphere a few years ago around this time of year.  Crazy isn't it. I am just a regular person that believes in God and as God is my witness I saw what doesn't seem to be anything I have ever seen on TV before.  I really don't like star wars type of stuff so I don't know if it is something that the movies has copied.",
      "link": "http://www.nuforc.org/webreports/063/S63777.html",
      "state": "MA",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b7123",
      "summary": "Unidentified Object Hovering over Interstate 264, Norfolk, Virginia",
      "city": "norfolk",
      "shape": "cigar",
      "date": "",
      "story": "Unidentified Object Hovering over Interstate 264, Norfolk, Virginia I was driving to work on 7 February 2007, from Virginia Beach to Norfolk Virginia.  As I was driving, coming close to my exit (Interstate 564).   As I was driving, this bright flourescent light in the sky caught my attention.  As I continue to drive, I observed this object in the sky.  I could not stop, because I was in the far left lane, and traffic was heavy that morning.   At first, I thought it was a helicopter, shining it searchlight, but this flourescent light was too soft (I wasn't blinded by it).  This light shone exactly like a strobing light, but no flicker was present when it caught my attention in the sky. This object appeared to be a long cylinder (cigar shaped).  As I continue to drive and look at the flourescent light, it was very soft to my eyes.  I also caught a glimpse of a red light under the belly of the object (center of the object).  I tried to determine if this was a helicopter, but I would know if this was a helicopter by the sound they make, but this object produced no sound.   It maintain it stationery position for at least 1.5 minutes before I had to exit Interstate 264.  I tried to see if the object from Interstate 564, but wasn't able to see the object anymore from my new position.",
      "link": "http://www.nuforc.org/webreports/055/S55241.html",
      "state": "VA",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ca0",
      "summary": "It was a ball of opal or white with a little pink and green sheen to it.  Not metal.  No sound and it was pretty close to a plane.",
      "city": "norfolk",
      "shape": "sphere",
      "date": "2006-07-16T00:00:00",
      "story": "It was a ball of opal or white with a little pink and green sheen to it.  Not metal.  No sound and it was pretty close to a plane. I was looking up in the sky and I saw what looked to me (I am not trained) a military jet and just beneath it I saw what looked like a white/opal/colored sphere.  It was going pretty fast.  At first I thought it may have been a weather balloon but after much thought it was moving much too fast for that.   crazy don't you think?   I never believed in UFO's.  Made fun of people that did.  Maybe it was something that the military is working on???? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51195.html",
      "state": "MA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9292",
      "summary": "Two daytime  sightings of two different types of objects in the same general area 12 days apart.",
      "city": "norfolk",
      "shape": "sphere",
      "date": "2009-08-05T00:00:00",
      "story": "Two daytime  sightings of two different types of objects in the same general area 12 days apart. The last week of June I saw what looked like a party Gift balloon floating across the sky from west to east. It was alternating from red to gold and silver. There was no sound and it did not rise as a helium balloon would. Afterwards I realized it was taveling in a crosswind south to north unaffected. The 2nd week of June I saw 2 white lights come together from different directions do a little dance (as they say) and take off in different directions. 1 went due North and the other went due East. Neither of these were very fast moving, just steady.",
      "link": "http://www.nuforc.org/webreports/071/S71139.html",
      "state": "VA",
      "duration": "90 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b9356",
      "summary": "Did not notice the strange objects only when checking pictures when returning back home from holiday",
      "city": "norfolk",
      "shape": "cigar",
      "date": "2010-05-12T00:00:00",
      "story": "Did not notice the strange objects only when checking pictures when returning back home from holiday taken from Norfolk botanical gardens overlooking norfolk international airport. objects were not seen only when checking pictures on the pc and croping them close can u see the strange objects. My son he is 25 was for a 3 week visit to USA and he is an avid photogropher and his hobby is photographing airplanes. when croping the pictures these strange objects stood out but they are certainly not airplanes or birds.  He",
      "link": "http://www.nuforc.org/webreports/075/S75286.html",
      "state": "VA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9a3d",
      "summary": "lights in my home that seemed intelligent and not a ghost",
      "city": "norfolk",
      "shape": "light",
      "date": "2009-05-12T00:00:00",
      "story": "lights in my home that seemed intelligent and not a ghost I had previously seen A UFO either last year over the house next door which was reported and investigated.  Earlier this month I am not sure of the exact date I was cleaning my kitchen island and happened to look down my hall. I saw this light. I wouldn’t call it a ball of light.  I would say it was like large sausage shaped lights entwined into each other it was a sunny day and my hallway is dark it came from my bathroom, I would not say it floated it seemed to have a motion like the sausage lights were moving within the shape of a rounded off cube.  There were no hard edges and the lights within the shape moved as it was going from one room to the next. At first thought I thought it was bluish lights on some of these sausage shapes and some were perfectly white.  Luminescent.  It seemed to hover for a second and I had a strange feeling it was intelligent. I know that people are starting to think I am crazy.  That is okay by me.  I just know that someone out there has seen something like this. I have also had some crazy stuff happening at home.  Something said something in my ear while I was lying down.   My dog who was beside me heard it and started to bark like there was someone in the room.  It was loud and I could feel it down my ear canal.  I have been researching to see if someone had died in this house but I have come up with no explanation. I think all this started to happen in the last few years when I saw a round object in the day sky go over my backyard. It had a military plane a few hundred feet above it. My husband was in the living room with me when I watched the handle on my sun porch move and the door opened.  He heard the handle and went over to check it.  No explanation for that either.  I am getting scared as I am alone a lot. I am not crazy.  I am just an average person who is an open book and doesn't care if you believe me.  But I do think it should be documented. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69746.html",
      "state": "MA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba475",
      "summary": "A FLASH/BEAM OF LIGHT DIRECTLY OVERHEAD IN CLEAR SKY (NO SOUND)  ((NUFORC Note:  Possible meteor.  PD))",
      "city": "norfolk",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "A FLASH/BEAM OF LIGHT DIRECTLY OVERHEAD IN CLEAR SKY (NO SOUND) Me and my coworkers were working the night shift in Norfolk, VA, tonight and we stepped outside for a smoke.  We were in a small covered gazebo talking and laughing when we witnessed what we thought was a flash of lighting directly overhead (we heard nothing).  The weather is of concern to us because we are forecasters so we all stepped out of the covered area to see where the lightning could have come from.  There were almost clear skies and no storm clouds in any quadrants.  It could not have been lightning.  I went inside while to others headed to a lookout above the building where they claimed to have seen a ball of light in the distance take off out of sight in the blink of an eye.  I cannot confirm the second part but the first I was there for.  About 20 minutes after coming back into the office local news stations from Marland to North Carolina began reporting similar sightings.  Some interesting facts that occured just after the incident are millitary aircraft taking off and seemingly patroling the area. I later called the observation tower near the airfielf where I work and asked if they had witnessed anything and the lady said she could not confirm or deny anything at the moment.  It seemed by her tone that she had been told to say that for whatever that is worth. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Possible meteor.  Several reports received.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69439.html",
      "state": "VA",
      "duration": "3 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3bb315",
      "summary": "UFOs spotted on I-264 into Norfolk VA",
      "city": "norfolk",
      "shape": "oval",
      "date": "2011-01-05T00:00:00",
      "story": "UFOs spotted on I-264 into Norfolk VA A and I friend were driving on I-264 from Portsmouth to Norfolk to catch I-464 to Chesapeake when he pointed out 3 objects in the air to our left with the city of Norfolk on the immediate horizon.  I joked before I actually looked.  When I did look, I could not identify what these were.  There were three black/metallic objects hovering mid air and rotating at a very high rate of speed on their horizontal axis.  The objects were large in size and unlike anything I ever seen before.  The objects were also in a very tight formation.  Other cars noticed the objects, as there were brake lights illuminated in great number ahead of us.  My vision of the objects became obscured by trees for a matter of three seconds.  The objects were gone. It took us about another 5 seconds to relocate the objects which were now directly over downtown Norfolk, but now were 4 in number.   I watched for another 5 seconds and the objects... for lack of a better description zoomed away at a VER! Y high rate of speed.",
      "link": "http://www.nuforc.org/webreports/079/S79326.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc391",
      "summary": "Red and white lights flashing egg  shape object making zig zag circular movement",
      "city": "norfolk",
      "shape": "egg",
      "date": "2012-01-12T00:00:00",
      "story": "red and white lights flashing egg  shape object making zig zag circular movement Bright red and white  flashing egg shaped craft around 2:am.  Observation thinking that it was an airplane but after 20 min of circular and zig zag movement, we conclude that this was not an airplane but rather something strange",
      "link": "http://www.nuforc.org/webreports/086/S86210.html",
      "state": "VA",
      "duration": "20"
    },
    {
      "_id": "64d005f478aba2ec5a3bc618",
      "summary": "More that one siting over the last five years.",
      "city": "norfolk",
      "shape": "fireball",
      "date": "2011-08-21T00:00:00",
      "story": "More that one siting over the last five years. I already reported this under another shape.   I saw two fireballs glide by and there was no pyrotechs around.   It happened at 10 and 10:30.  We have had several things happen overhead and I was concentrating on the structure in the sky it had nine lights on either side with the end lights shining at an angle then in the center three lights of the nine there were lights beside it and inside those three center lights was a single light with more of a blue color hue.   I was looking at that for a few hours it was overhead and I questioned whether it was a satellite.  But last winter we had a circle made in the snow in our backyard.  My husband woke up and looked out into the yard and I tried to take pictures and a video.  I just got some of it on film.   A few years ago I had a ball of energy move from my bathroom into my hallway and hovered there. It was energy moving inside itself like balls of light that stretched and moved into each other and hovered ther! e looking at me.  It was crazy because I thought to myself I am not going to follow you because I don't want to die.   I felt it knew what I was thinking.   A few years earlier I saw a cigar shaped UFO and was told it could have been an experimental rocket.  I don't think so because it was flying over a populated area and had no fins and changed direction.  A few years before that I saw a sphere with a military plane directly above it.  I know something is going on out there.",
      "link": "http://www.nuforc.org/webreports/083/S83237.html",
      "state": "MA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bca4c",
      "summary": "July 31 @ approximately 10 and 10:30 pm watching the night sky and saw two separate balls of light very large streak across the sky.  I",
      "city": "norfolk",
      "shape": "light",
      "date": "2011-08-07T00:00:00",
      "story": "July 31 @ approximately 10 and 10:30 pm watching the night sky and saw two separate balls of light very large streak across the sky.  I have a great binocular that are for viewing the sky at night but this I saw with my own eyes.  My husband didn’t see either event.    I also am wondering what a satellite looks like because there was an object I saw with the binoculars that had a light in the middle nine lights on either side with bright lights emanating out of the end lights like a flash light and three lights on the outside centered with the middle light.      Is this a satellite?   I can’t be sure but the two balls of light streaking across the sky came from that direction.   Plus does the satellite stay stationary?   I put together a diagram but the light is emitted from the longer rows of lights outward and the middle light was more of a blue smaller light.  It was stationary for most of the night.  But balls of light streaking from that direction happened quickly.  Not sure if it came from this object.",
      "link": "http://www.nuforc.org/webreports/082/S82872.html",
      "state": "MA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1d5",
      "summary": "Disk Shaped Object Observed in Storm Cloud Formation Over Norfolk, Virginia",
      "city": "norfolk",
      "shape": "disk",
      "date": "2012-10-30T00:00:00",
      "story": "Disk Shaped Object Observed in Storm Cloud Formation Over Norfolk, Virginia strange gray disk shaped object flying east to west in storm cloud formation above Norfolk, Virginia.  The object made no sound.  No severe weather occurred.  The object appeared to be intelligently controlled due to the motion and erratic pattern and the fact that the object moved up, straight and up into the clouds.  I had the feeling the object or UFO was trying to avoid being seen as it consistently maneuvered into the cloud formation.  This object was observed from a moving vehicle (Car), Sunday September 9, 2012  between the hours of 2:30 pm-3:00 pm, sunday September 9, 2012.",
      "link": "http://www.nuforc.org/webreports/093/S93323.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bde07",
      "summary": "Cylindrical object with green and pink flash of light...",
      "city": "norfolk",
      "shape": "changing",
      "date": "2012-05-13T00:00:00",
      "story": "Cylindrical object with green and pink flash of light... At approximately 20:15 Eastern Standard Time I was driving with my Son in a northward direction and at the intersection of Abingdon Circle and Chesapeake Blvd.   At about 40 degrees in the air directly in front of us we saw a dark cylindrical object moving from our right to left.  The object had 5 even lights horizontally with a sudden giant flash of green light changing into pink and the object transformed into a triangular shape and disappeared.  The entire event was approximately 2 seconds.",
      "link": "http://www.nuforc.org/webreports/088/S88373.html",
      "state": "VA",
      "duration": "20:15"
    },
    {
      "_id": "64d005f478aba2ec5a3be1f1",
      "summary": "Bright and super fast spot of light traveled 45 deg and then right straight up in the sky",
      "city": "norfolk",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Bright and super fast spot of light traveled 45 deg and then right straight up in the sky I was walking out of the Naval Exchange store on the approximate date of Dec 20, 2011, around 8 pm at night and i looked up in the Southern sky and saw a very bright light travel from left to right at a 45 degree angle (lower to higher).  Then it went straight up at very fast rate of speed and disappeared.  There was no stoppage from moving 45 deg to going straight up.  It appeared as a very bright light off in the distance    There is a large Naval Airfield and USAF base in the area but I worked on Navy jet aircraft and spent my whole life in the aviation world and i have never seen anything travel this fast and make such a angular turn.   And it didnt fit in any aircraft traffic pattern for the bases and it was for sure not a flare.    As i said before i know aircraft very well and spend a lot of time in the aviation world and this event left me shaken that night.  Havent seen anything like it since. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87231.html",
      "state": "VA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be79e",
      "summary": "Triangle shaped",
      "city": "norfolk",
      "shape": "triangle",
      "date": "2012-03-13T00:00:00",
      "story": "Triangle shaped Was taking my dog out and saw a v-formation overhead a few hundred feet up.  At first I thought that it was a classic geese or duck flying formation as one of the sides even seemed to collapse momentarily.  The factors which changed my mind was that there seemed to be lights coming off of the formation. There was absolutely no noise coming from this object on a perfectly quiet morning.  There was a good southerly tail wind that morning and the object seemed to pick up speed as I continued watching it.",
      "link": "http://www.nuforc.org/webreports/087/S87332.html",
      "state": "VA",
      "duration": "1 minute or less"
    },
    {
      "_id": "64d005f478aba2ec5a3bf03b",
      "summary": "Two or three lights shoot across sky over naval base!",
      "city": "norfolk",
      "shape": "unknown",
      "date": "2013-09-30T00:00:00",
      "story": "Two or three lights shoot across sky over naval base! I took my pup to go outside last night and I was admiring how I could see the sky through all the light pollution n all of sudden there was a two maybe three white lights that literally shot out of nowhere.  Now I would say it's a comet or meteor but I've seen those n thier a hell of alot slower.  This thing practically warped to the other side of the sky in a split sec but there was no tail no sound nothing but some lights.  Also, I happen to live a stones throw away from the naval base.  Like gate 4 is in my backyard. But as soon as I saw that I grabbed my dog n ran in.  As for myself I adore watching the shows on tv about this stuff but I can't be seeing that in real life, way to real for me lol",
      "link": "http://www.nuforc.org/webreports/102/S102314.html",
      "state": "VA",
      "duration": "Split second"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2c0",
      "summary": "Rectangle object that had several lights.",
      "city": "norfolk",
      "shape": "rectangle",
      "date": "2013-08-30T00:00:00",
      "story": "rectangle object that had several lights I saw an object that I had seen a few years ago.  When I saw it before I was looking straight up and saw an object that was rectangle with a center light that was brighter than the others. It had several rows of lights beside the middle light and at the corners it had lights that beamed out to the sides of the object.   I was watching the meteor shower on the 11th of Aug after midnight.  I saw just over the tree line Zhumella sport optical and his eyesight is bad and he couldn’t see it.  I can’t explain it.  I wish someone would tell me why I see them every few years?  And no one else sees them.",
      "link": "http://www.nuforc.org/webreports/101/S101209.html",
      "state": "MA",
      "duration": ">1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bf354",
      "summary": "Video taped 20-25 bright amber colored objects slowly moving in the night sky that slowly faded as they increased in altitude.",
      "city": "norfolk",
      "shape": "circle",
      "date": "2013-07-03T00:00:00",
      "story": "Video taped 20-25 bright amber colored objects slowly moving in the night sky that slowly faded as they increased in altitude. I was walking my dog last night when I turned around facing north east and noticed about 8 amber lights in the night sky that were scattered yet in a rough formation.  These objects were so noticeable and obvious I literally noticed them out of the corner of my eye while looking towards my dog on the ground.  I immediately pulled out my iPhone and began to video tape what I saw.  As I video taped I noticed that the objects were not completely stationary but were very slowly moving in what appeared to be my direction (sw) yet increasing in altitude at the same time.  They can be best described as amber colored, yet bigger and closer than (in earths atmosphere) regular stars in the sky that moved very slowly.  As I filmed I noticed they would move closer towards me, gain altitude and they would randomly fade out one by one.  As they were fading below them through the trees I kept seeing more appear sometimes 2-3 at a time that were much brighter at they're lower alt! itudes and seemed to fade as they climbed in altitude.  These objects made absolutely no sounds, and moved in no erratic motions, yet didn't have any characteristics of any man made aircraft I have ever witnessed.  In all I saw/video taped around 20-25 of these at first bright glowing objects that would eventually fade away and be replaced by more almost immediately.",
      "link": "http://www.nuforc.org/webreports/098/S98526.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf427",
      "summary": "Bright orange light traveling in sky without sound over Norfolk, VA 8/13/13",
      "city": "norfolk",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Bright orange light traveling in sky without sound over Norfolk, VA 8/13/13 Driving home I noticed a bright orange light in the sky, we pulled over to the side of the road and it went directly over us without making any sound.  I could not see any \"shape\"; as it was traveling.   There were two neighbors outside who also witnessed it.  We watched it travel into the distance until it disappeared.  Then within 5 minutes, getting back in our vehicle and only traveling to our home to park, which was one block away, we notice another one coming from the same direction the first came from, it looked exactly the same and took the same path as the first one. I video taped the second.",
      "link": "http://www.nuforc.org/webreports/097/S97145.html",
      "state": "VA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf41d",
      "summary": "White lights, V-formation jetted thru sky then turned left and disappeared",
      "city": "norfolk",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "White lights, V-formation jetted thru sky then turned left and disappeared Saw v-formation of white lights high up in the sky, formation turned to left then disappeared ---- sky was partly cloudy, bright stars, bright moon, could see big dipper.",
      "link": "http://www.nuforc.org/webreports/095/S95453.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfcf1",
      "summary": "Yellow Light magnitude = to Jupiter. Location: approx 5 Degress South of Vega/Altair (Mid) axis. I was taking",
      "city": "norfolk",
      "shape": "light",
      "date": "2013-07-22T00:00:00",
      "story": "9:45pm EST, July 13th 2013.  Yellow Light magnitude = to Jupiter. Locatio approx 5 Degress South of Vega/Altair (Mid) axis. I was taking our dog for his late evening trip outsiide.  Notice what I thought was a planet but knew there had been no planets in this area of the sky recently.  Our last trip out with our dog is alway plus or minus 30 min of 10pm. I took my eyes off the object for a few seconds to watch our dog and looked up anff focused on the \"light\" just as it departed in a curved upward angle of 1-2 on the clock dial and whisped out off sight with accelerating speed.  It was amazing.  I grew up in Florida in the late 50's thru Mid 70's.  As a youth was an avid fan of Nasa, Aviation, and Astronomy.  We lived within 15 miles of MacDill AFB. This was no jet's afterburner glow.  This was a craft of some type.  It had no audio signature.  Our 65lb Huskey was very excited for the next 45 minutes.",
      "link": "http://www.nuforc.org/webreports/100/S100225.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c02ed",
      "summary": "Noticed 2 bright red lights in the sky. One appeared to be moving towards us and the other seemed to be stationary.  The stationary obj",
      "city": "norfolk",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "Noticed 2 bright red lights in the sky.  One appeared to be moving towards us and the other seemed to be stationary.   The stationary object was a very bright reddish orange color, the other appeared to be red.  They were very bright and almost looked like there was fire inside of them.   The stationary object started moving to the right and closer to us about the same time the one that was initially moving started gaining altitude and eventually disappeared.    Then we saw a third light that looked to be shot off the ground and to the left, gaining altitude very quickly..it initially looked yellow but when it got up close to the other it appeared to be the same red/orange color.   They both started moving to the right, gaining altitude and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94927.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c123c",
      "summary": "~50 bright tiny light steadily moving to same direction NE to SW.",
      "city": "norfolk",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "~50 bright tiny light steadily moving to same direction NE to SW i watched them move very steadily for at least 30 minutes.  They were not combustion engine, it was dead quiet.  Closest thing comes to mind is satellites, but why 50 of them following each other?  They were far away, above the clouds.  I live next to a huge naval base and they chemical spray here all day everyday,  My bet is to cloud the sky so we can't see, plus the negative health effects of course.  I don't drink, smoke nor use drugs.",
      "link": "http://www.nuforc.org/webreports/106/S106023.html",
      "state": "VA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c279d",
      "summary": "Purple light in sky.",
      "city": "norfolk",
      "shape": "circle",
      "date": "2014-10-03T00:00:00",
      "story": "purple light in sky driving down road and saw a purple light up in sky and after about 2 or 3 minutes it disappeared and was no where to be found ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114009.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c299b",
      "summary": "Cigar-shape flashing white during daylight moving vertical spinning.",
      "city": "norfolk",
      "shape": "cigar",
      "date": "2014-09-25T00:00:00",
      "story": "Cigar shape flashing white during daylight moving vertical spinning Staring out window to east, a long vertical shape about 10 miles away 30,000 feet moving slowly vertically Flashing white light the full length of the object seemed to be spinning counterclockwise and flash came after every spin.   Didn't move away, just up slowly. Could not get good video through window.  Very bright light to see on a sunny day.  Lived here 50 years have seen every type of aircraft didn't fit any I have seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113695.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d9d",
      "summary": "Bright blue light hovering around old airport.",
      "city": "norfolk",
      "shape": "light",
      "date": "2014-08-29T00:00:00",
      "story": "Bright blue light hovering around old airport My fiancé and I we’re driving home by the old Norfolk airport (basically a large empty field with a runway).  She was looking up at the stars over the airport when she yelled at me to pull over.  I did, and she then pointed out a blue light in the sky over the tree-line.  The light was small at this distance, it hovered in place for a few seconds, then moved right, and immediately reversed direction.  She started filming on her iPhone. I then decided to try and get closer to where it seemed to be hovering.  I sped down a few streets trying to narrow down its location.  We ended up near the Norfolk ice rink, where we found other people filming this light. We pulled over behind one car with two guys filming the light, and there was also a guy out of his van which he left in the middle of the road.  There were 5 of us standing there watching this light hover directly above us, slowly moving towards the woods.  The light was constantly changing direction above us.  After about 3 minutes of filming, the light moved towards the woods and that was last we saw of it. \tWe could not make out the shape of the object due to the night sky being the only point of reference behind the light.  We could make out four bright lights that seemed to be on the bottom of the object.  Two were blue and two were red, giving off a purplish hue in between.  The lights were in a square formation.  There was absolutely no sound coming from the object.  Due to all of these factors and attributes, we could not determine the size or distance of the object.  It could have been large and far away, or small and up close.  The whole encounter lasted approximately 15 minutes, with roughly 3 minutes of recorded video.",
      "link": "http://www.nuforc.org/webreports/112/S112914.html",
      "state": "MA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3386",
      "summary": "Dark rectangle with tan squares no lights heading south to north no noise low enough I could see tan on the bottom.",
      "city": "norfolk",
      "shape": "rectangle",
      "date": "2015-03-20T00:00:00",
      "story": "Dark rectangle with tan squares no lights heading south to north no noise low enough I could see tan on the bottom yet not lit up at all.",
      "link": "http://www.nuforc.org/webreports/117/S117828.html",
      "state": "NE",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3553",
      "summary": "V-formation seen over Norfolk, Virginia.",
      "city": "norfolk",
      "shape": "formation",
      "date": "2015-03-20T00:00:00",
      "story": "V formation seen over Norfolk, Virginia I went outside for a cigarette.  Looked up to the stars like I always do.  I thought it was a wisp of cloud moving, but as I kept watching it was a formation of white dots moving across the sky.  I kept watching to count about 20 of these white \"star-like\" points of light.  They were moving in a loose line but as i watched i could count two next to each other as they slowly moved closer in to a distinct \"V\" formation.  At some points it was hard to count them because it looked as if they over lapped.   The formation moved at an accelerated airplane speed.  I was facing North-North-East as they moved North-North-West.   After about 12 seconds they disappeared out of side over a tree and far away.  From my 60 degree angle it appeared that they were closer to to the Norfolk Naval Base as i did not see them over-head.  If this was a flock of geese i dont know why it was so easy to spot them and why they were lit up.",
      "link": "http://www.nuforc.org/webreports/117/S117907.html",
      "state": "VA",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c412a",
      "summary": "Saw orange object flying over my head no sound but the light almost appeared to flicker like a candle. Moved in a straight line and ste",
      "city": "norfolk",
      "shape": "circle",
      "date": "2015-05-13T00:00:00",
      "story": "Saw orange object flying over my head no sound but the light almost appeared to flicker like a candle.  Moved in a straight line and steady pace.  Like a satellite dose only much lower. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118891.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c413f",
      "summary": "We were off the coast of the eastern seaboard, not 100% sure but I think we were off the Carolina's. The boat was doing work ups getti",
      "city": "norfolk",
      "shape": "circle",
      "date": "2015-04-30T00:00:00",
      "story": "We were off the coast of the eastern seaboard, not 100% sure but I think we were off the Carolina's.  The boat was doing work ups getting ready for deployment, we had a full deployment crew. Me and a couple of other ET's heard some of the watch standers on the island talking about seeing something crazy, they said something about trying lock on to it with the Nato Sea Sparrow Director's onto the object.  Me and a handful of guys on the night shift ran up to the O-10 where the watch standers were watching it.  They had the mounted Binoculars trained on the object.  I thought they were mistaking two stars one of which looked like a pulsar (due to my pretty extensive knowledge of astronomy).  The object then appeared between the two stars again, the other guys saw the object as well.  We all thought we might be imagining it, asked each other a couple of times if they saw it too.  We all agreed that it was there. When I first noticed it, I thought I was imagining it.  How could a star disappear then reappear right in front of me?  I watched it through the mounted binoculars changing colors between blue, white, purple, and pink at high speed, it kept pulsing. It seemed to stay motionless, the problem was that the altitude was just high for any of us to make out exactly what it looked like, from our vantage point we could see that it may have been hovering and possibly moving but just can't say for sure.   After about 5 minutes of viewing the object as we were all trying to get a look at it, a bright flash filled the sky in the location of the object, it looked like it shot with an incredible speed and was gone.  We were traveling North, the object was northeast of our Northerly heading.  Our speed was approximately 15 to 20 knots. The three watch standers at there post reported that two similar objects had come out of the main relatively stationary object and then rejoined the main object. During my time watching the object CIC (Combat Information Center) was trying to get a radar lock on the object with the Nato Sea Sparrow Missile Directors.  The directors (which are radar directors, fire control radar) kept trying to lock onto the object then it would drop back down to the horizon, the OS's (Operation Specialists) trying to drive the director back there again.  Every time they would drive to get a lock the lock would fail and the director would be driven back down again.  It seemed to me that the object was overriding the directors drive control or that the radar receiver was being over powered and being forced by internal programming to protect its receiver, (to get away from the source of the electromagnetic radiation) it could have been over-driven by the object being to close but more than likely the object was jamming the radar.  I can't say weather it was jamming the object passively or actively, just that the radar was being jammed. After the sighting I checked the SPN-43 and SPS-49 radar in CATCC, neither of them had a radar return, although at that altitude the chances of a radar return are very slim. I tried to report it to my chain of command, they laughed at me and said that we didn't see anything.  We probably just excited, I didn't expect that reaction especially when CIC reacted the way they did.",
      "link": "http://www.nuforc.org/webreports/118/S118702.html",
      "state": "VA",
      "duration": "1 hour total"
    },
    {
      "_id": "64d005f478aba2ec5a3c6701",
      "summary": "Transparent chevron shaped craft with six faint lights flying over the Elizabeth River",
      "city": "norfolk",
      "shape": "chevron",
      "date": "2017-04-07T00:00:00",
      "story": "Transparent chevron shaped craft with six faint lights flying over the Elizabeth River On October 21st, 2015, I was working as a security boat captain providing security for a warship docked at BAE shipyard on the southern branch of the Elizabeth River, at approximately 130 a.m, myself and the one crew member aboard my vessel witnessed a very bizarre craft in the skies above downtown Norfolk.  The craft was flying in a southerly direction from directly over the waterside area of downtown Norfolk, proceeding towards and over the Norfolk Naval Shipyard.   It was a beautiful night and the skies were very clear, as we could see many of the star constellation.  We were enjoying the night talking about the two CH-60 helicopters that had flown overhead thirty minutes prior, when we spotted six faint orange or yellowish colored lights in the sky, judging only from its lights; as we could not see any structural definition, we believe based on the formation of lights that it was chevron shaped.  As the craft flew directly overhead of us, the faint lights were ! no longer visible and the craft was completely transparent, and did not have any discernible aircraft marking lights; which was very strange considering the fact it was flying through an extremely busy corridor.  We noticed a few other planes flying over in their normal landing procedure, strobes on as well as landing lights lit up, as we commonly see in the skies near Norfolk International airport.  I am retired military and my training as a stinger missile gunner required me to be able to identify all aircraft by their silhouette at any angle,  This was not any known aircraft I had ever seen, perhaps the most striking aspect of the incident was the complete silence surrounding it.  In viewing several commercial airliners after the incident occurred making their normal approaches at lower altitudes and taking note of the size they appeared based on our perspective, we estimate the size craft to be about 3-4 times larger than a normal commercial jet-liner.   The entire scene last! ed about 30 seconds. I have never witnessed anything like this! before, and I cannot even begin to  imagine the sort of technology needed to make a craft completely transparent, as well as totally silent.",
      "link": "http://www.nuforc.org/webreports/133/S133436.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c54",
      "summary": "My photo was taken 12-29-16 at 4:17 pm in the parking lot at the Norfolk Navy base in Va.  I was taking a photo of a group of helicopte",
      "city": "norfolk",
      "shape": "rectangle",
      "date": "2017-01-06T00:00:00",
      "story": "My photo was taken 12-29-16 at 4:17 pm in the parking lot at the Norfolk Navy base in Va.  I was taking a photo of a group of helicopters and a bright light popped out of the clouds and I looked up and snapped this photo.  Then it was gone.  It is big.",
      "link": "http://www.nuforc.org/webreports/131/S131940.html",
      "state": "VA",
      "duration": ".01"
    },
    {
      "_id": "64d005f478aba2ec5a3c6dbb",
      "summary": "I  stood  at  the  kitchen  window  and  just  froze, I  couldn't  believe  what  I  was  seeing .",
      "city": "norfolk",
      "shape": "circle",
      "date": "2017-06-15T00:00:00",
      "story": "I  stood  at  the  kitchen  window  and  just  froze, I  couldn't  believe  what  I  was  seeing . It was  round  red light  flying  around  twenty feet over the ground.  It flew horizontal  across around  fifty feet and  just  disappeared.  It was  in the  center of an apartment complex.",
      "link": "http://www.nuforc.org/webreports/134/S134498.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f0e",
      "summary": "Solid red light moving quickly through the sky and stopping to hover at irregular intervals",
      "city": "norfolk",
      "shape": "light",
      "date": "2017-08-17T00:00:00",
      "story": "My fiancé and I witnessed a solid red light, moving quickly through the sky, and stopping to hover at irregular intervals.  The red light was bright and steady–not flashing/blinking like normal aircraft lights.  During one of the stopped/hovering moments, a greenish light began to intermittently blink on and off somewhat similar to aircraft light but with a slower transition between on/off. During one of its hovers, the red light seemed to split into 2 red lights, at which point the green strobing light was turned off.  A plane passed by in the general vicinity, but above the light, and it seemed to react by suddenly dropping altitude very quickly.  Once the plane had passed, the 2nd red light disappeared/turned off and the green strobe resumed.  The light then drifted slowly in the sky momentarily and then accelerated towards downtown Norfolk at about the speed of a helicopter until it was out of sight. It could have possibly been a drone but the abnormal flight behavior, time of night, speed and distance covered made me skeptical of that. It’s hard to estimate the altitude of the light, however it was well below the clouds and normal flight paths of aircraft in the area. Our backgrounds:  I am a graphic designer, she is a medical professional at a local hospital.",
      "link": "http://www.nuforc.org/webreports/135/S135674.html",
      "state": "VA",
      "duration": "~15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6f97",
      "summary": "Me and my girlfriend noticed a bright red ball of light in the sky head out over the Chesapeake Bay in the direction of the E shore.",
      "city": "norfolk",
      "shape": "fireball",
      "date": "2017-08-11T00:00:00",
      "story": "Me and my girlfriend noticed a bright red ball of light in the sky head out over the Chesapeake Bay in the direction of the eastern shore.",
      "link": "http://www.nuforc.org/webreports/135/S135554.html",
      "state": "VA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c70bf",
      "summary": "Cylindrical object spotted in Norfolk.",
      "city": "norfolk",
      "shape": "cylinder",
      "date": "2017-08-04T00:00:00",
      "story": "Cylindrical object spotted in Norfolk. I was in my backyard with my 2 year old son around sunset, and we were looking at the moon, when we noticed in the sky at high altitude in close proximity to the moon (about 4 o'clock) a cylindrical type object with long panels extending the length of both sides of it that appeared to be hovering in the sky.   At first I thought it was a plane but I observed no contrails and then thought that maybe it was a satelite or the ISS, however after about 5 minutes, it vanished from view.   There were no clouds in the sky and the object did not move from its location, it literally just vanished.",
      "link": "http://www.nuforc.org/webreports/135/S135461.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c746a",
      "summary": "Saw a silver reflective disk object hovering high above tree line over Virginia Beach Blvd and North Military Hwy.",
      "city": "norfolk",
      "shape": "disk",
      "date": "2017-05-15T00:00:00",
      "story": "Saw a silver reflective disk object hovering high above tree line over Virginia Beach Blvd and North Military Hwy. ((NUFORC Note:  Time and/or date in report appear to be flawed.  We have amended the date.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134120.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8178",
      "summary": "UFO fireball very low flying, very fast, silent",
      "city": "norfolk",
      "shape": "fireball",
      "date": "2018-03-02T00:00:00",
      "story": "1 UFO fireball very low flying, very fast, silent.  Took only minutes to go from directly overhead to the furthest reaches that my eyes could see to the horizon. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138967.html",
      "state": "VA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fbf",
      "summary": "Saw what seemed like a something on fire shooting thru the sky with a trail.  ((anonymous report))",
      "city": "norfolk",
      "shape": "fireball",
      "date": "2018-11-24T00:00:00",
      "story": "Came out of HRBT towards Hampton and saw what seemed like a something on fire shooting thru the sky with a trail.  About 10 sec the trail diminished and it was just a red ball of light.  It then faded out but about a minute later the light reappeared but was smaller.  I could tell it was traveling away from me. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143811.html",
      "state": "VA",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9346",
      "summary": "Bright star like object seen in the sky winks out of existence",
      "city": "norfolk",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Bright star like object seen in the sky winks out of existence I was out in my front lawn taking out the trash of which I was looking up at the sky at the constellations as I usually do when I am out.  I noticed a very bright light in the sky that looked to me like Jupiter however it was in the wrong spot.  At first I was thinking it could be a drone or something but it was above the clouds and their appeared to be a couple of planes flying in the same vicinity as well.  After a minute or so the light just blinked out as if a light switch was turned off and then there was nothing there.",
      "link": "http://www.nuforc.org/webreports/149/S149986.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c959b",
      "summary": "Bright Object in the sky.  ((anonymous report))",
      "city": "norfolk",
      "shape": "egg",
      "date": "2019-12-19T00:00:00",
      "story": "Bright Object in the sky It was the middle of the day.  Clear blue sky.  The object appeared.  It seemed as if the sun was hitting it just right.  It was high in the sky and very bright.  Egg or Cylinder in shape but not very large.  It appeared for 12 seconds ...disappeared for 3 seconds.  Then reappeared for 4 seconds before disappearing for good.",
      "link": "http://www.nuforc.org/webreports/151/S151324.html",
      "state": "VA",
      "duration": "15 seconds"
    }
  ]
}