{
  "city": "oakland",
  "fetch_timestamp": "2025-07-12T14:32:42.909271",
  "record_count": 69,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b419e",
      "summary": "Bright light in woods moves toward witness; witness was left disoriented.",
      "city": "oakland",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Bright light in woods moves toward witness; witness was left disoriented. I think that this happened in the spring/summer of 1982. It might have been 1983, but I am pretty sure that I had just completed my first year of college and I have a vague memory of feeling irresponsible about missing too many days of work at my part-time job. I have to admit that I can't pin this down exactly. I know it happened no earlier than 1982 and no later than 1984. There were green leaves on the trees; the temperature was neither particularly hot nor cold.  I had a close friend who was several years younger. I think I was 19-20 years old, so she was 16 or 17. Her father was a boy scout troop leader, and he, her mother, and other adults were taking their troop camping at Swallow Falls State Park, near Oakland, Maryland. (Here is the url for more information: http://www.dnr.state.md.us/publiclands/western/swallowfalls.html.) She was a bit of a problem teen, and there was no way that her parents were going to let her stay home alone while they took the troop to Swallow Falls. She had to go, but they told her that she was allowed to bring a friend. She asked me and I agreed to go along.  Looking at the Swallow Falls camping maps, I believe that we camped in the Youth Group Loop. I’m not sure exactly where on the loop we were positioned (http://www.dnr.state.md.us/publiclands/maps/msfmap.html), but my gut tells me we were in camp site number 2 (http://www.dnr.state.md.us/publiclands/maps/sfyg.html). I am sure that no one was in camp site 3, but I am not clear if any one was in camp 1. I have no recollection of seeing any other campers outside our party during the entire trip.  The camping loop went fairly deep into the forest of huge old trees. On the first night, there was a heavy rain storm. My friend and I were sleeping on the ground in a small two-man tent. We were utterly miserable; our tent was damp and leaking. It kept raining into the next day, and in fact, by the evening, it was absolutely pouring. We decided to spend the night in her father's car. It was parked facing the loop road, next to the encampment. My friend, who was a tiny person, took the backseat, and I planned to sleep in the driver's seat in recline.  I recall that we sat in the car talking for hours while the rain pounded the car. I don’t remember thunder or lightning, just driving rain and some winds. I don’t think the car had a lighted clock. (Now that I think about it, I’m not sure cars had lighted clocks in the early 1980s.) But I guess it was around midnight.  At some point while we conversed, I noticed a light through the front windshield.  I can remember that it illuminated the hard streaks of rain hitting the glass.  We both stopped talking, so I assume that she also saw the light. I never turned my head to look at her in the back seat as the light wended its way toward us. It was yellow-greenish and about as bright as a car headlight pointed full on very bright. It did not have a defined shape because of this brightness, but I assume its core was round. It moved smoothly, about 3-5 feet from the ground, swerving gently a few times to avoid trees. I remember wondering whether it was a car on the muddy loop coming from camp 1. Then I thought, \"Maybe it’s someone walking with a really bright lantern.\"   My last memory of the light is as it reached the front of our car.  I retain an image of it crossing in front of us, as if it was going to follow the loop out of the woods to the parking area.  But I can’t recall it actually doing that.  I think I saw it start to illuminate the tents that were to my right.  The next thing I remember is disorientation then turning around to my friend to say, \"That was weird.\" The two of us immediately picked up our conversation from before the light appeared.  After that night in the woods, I didn’t think about the odd light for years. I don’t recall ever mentioning it to anyone until the early 1990s, when I read a description of ball lightning.  How it can glide and make unusual maneuvers. I decided that was what we had seen and mentioned it to my husband and friends.  When I was in my 30s, my friend visited from Arizona, where she then lived. I asked her if she remembered that night in the car. She did, except for the light. In her memory, we sat in the car talking in the driving rain until we fell asleep.  Now, after another decade of consideration, I’m no longer sure what I saw was ball lightning and lean more toward a UFO-type experience or that I am simply misremembering an event with a rational explanation: a car; a camper.  I have to rule out it was a vehicle for several reasons. First, there was only one light, not two, although I concede it could have been a car with one headlight. But I don’t remember a car. Second, the only source for a car would have been camp site 1. From where I sat, site one would have been at approximately 1 o’clock. I would have been at roughly 7 o’clock. My memory is of the light coming toward us from about 10 o’clock, out of the woods. I don’t remember seeing camp site 1 occupied. If it was, and this was a car from that site, why would they drive the long way around the unpaved, muddy loop in the storm to exit into the parking area?  Was it a person with a lantern? It might have been someone armed with an incredibly bright light, but I don’t remember a person. I’ve wondered if it was someone from camp site 1 walking to the toilets. I personally have no memory of the bathhouse that is shown on the youth group loop detail, however, a site 1 camper would again be taking a very long route to get to the toilets, through driving rain on a muddy trail.  I also wonder about the disorientation I felt. I don’t know exactly what time it was when the light appeared, so I don’t know if we were missing time, but something felt wrong. I also wonder why my friend and I never discussed it, and why I barely recalled the incident until I read the description of ball lightning years later. I don’t remember any other experiences that could be construed as abductions. Perhaps they were coming for her? We had a falling out in the late 1990s and no longer are in touch or I’d ask her if she has had further experiences. Aliens? A one-headlight car? Another camper? Ball lightning? I don’t know what I saw that night and I never will, I suppose. It’s been bothering me so much recently that I thought I should file a report. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49873.html",
      "state": "MD",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4377",
      "summary": "Daylight sighting late afternoon on the \"Ides of March\"...from Route 208, Bergen County....",
      "city": "oakland",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "Daylight sighting late afternoon on the \"Ides of March\"...from Route 208, Bergen County.... Travelling by car from Oakland, NJ to Fair Lawn, NJ on Route 208 South. (Actually So-East.) 208 runs from Oakland through Franklin Lakes then Wyckoff, Hawthorne, Glen Rock and Fair Lawn.  Through the front windshield I spotted an unusual object roughly triangular in shape ahead and to the left. It was daylight and the object was easily seen though quite small. I would guess it was maybe 1 to 2 miles high. There was a lot of rush hour traffic, especially in the opposite lane and I would guess it was seen by many others.  As I travelled through Wyckoff the object shifted more to my left due to my movement. The object did not appear to be moving but I could not detect its motion due to my own.  By the time I was in Hawthorne, still on 208, the object was off to my left, and it was closer to me. It somewhat resembled a tent with 2 'lines' hanging below it. I don't mean lines like a kite, but short lines dangling just below it.  I finally went passed it and had to turn my head up and back to the left to see it and it finally was too difficult to drive and look at the same time.  It was too high to be a kite, and resembled nothing I had ever seen in the sky before. It did not appear to be a hot-air baloon. That thought didn't even occur to me at the time.",
      "link": "http://www.nuforc.org/webreports/049/S49845.html",
      "state": "NJ",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b46b2",
      "summary": "Flyby of strobing aircraft over bay area",
      "city": "oakland",
      "shape": "unknown",
      "date": "2006-05-15T00:00:00",
      "story": "Flyby of strobing aircraft over bay area Inconsitent strobing, strong, white light passing over bay area heading southbounds. Definitly not an aircraft of any type. Approximate altitude unknown; it was at high elevation.  Flyby took only 30 seconds. No noises heard.",
      "link": "http://www.nuforc.org/webreports/050/S50525.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b591c",
      "summary": "I saw a helicopter-size and silent object with a belt of lights rotating around it hovering over a park at night.",
      "city": "oakland",
      "shape": "oval",
      "date": "2008-06-12T00:00:00",
      "story": "I saw a helicopter-size and silent object with a belt of lights rotating around it hovering over a park at night. I was walking on the sidewalk on the right side of the street heading west on 34th street from Telegraph Ave towards Martin Luther King Junior Blvd. I was passing a small park and noticed flashes of light. I turned and saw a dark object as big as a helicopter hovering over the park. It was silent and less than a quarter of a mile up in the sky. There was this belt of tiny irregular-flashing lights that would move around this big, dark oval object.  The UFO started to go higher in the sky and it moved slowly back and forth like how you could swing a pendulum.  It was now about half a mile in the sky and gradually started to move North-East towards Berkeley. Never have I seen something like this before. It was shocking, and I want to know if anybody else saw it. I’m glad I found this website to share this sighting of a UFO which I always thought was as a funny thing until this past Monday night, it is now certainly no joke to me.  I am into astrology and astronomy, so I look into the sky a lot at night. The most amazing things I have seen are meteor showers, but now this is the top of the list.",
      "link": "http://www.nuforc.org/webreports/062/S62657.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e97",
      "summary": "u.f.o sightin in oakland california, object tries to drop lower to the ground",
      "city": "oakland",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "u.f.o sightin in oakland california, object tries to drop lower to the ground My friend and i were drving her boyfriend home {i was driving, she was in the passenger seat and he was behind her) in oakland california, not so far from 106th ave, when we stoped at a stop light. My friend, her boyfriend and i were talking previously about a movie they had just went and seen, just then, my friend looks up into the sky and ask's me \"is that a plane?\" i looked up into the sky and i saw a disk shape figure, and it had yellow/orange lights moving from left to right going at a medium speed. i thought to myself that could be a plane, but planes have lights that guide it to where its going. there was no light and there was no movement. it just stayed in one place. and i asked her \"is that a u.f.o?\" and she kept tellin me she dont know she dont know... so then i looked at it more, i stared at in staying in one place. and i seen the whole shape of it.. it was like a disk with an upside down U on it. i remember i kept staring at it even when the light turned green, i stayed. All of a sudden the shape started lowering, not like it was landing like a plane, because a plane goes to land in strait forward line, this object was hovering in one place with it circleing, and then it started dropping real slow. strait down. my friends boyfriend, in the back seat kept telling us we were lying, but he opened his door and stuck his head out of the car, and saw the u.f.o also. he seen how scared i was and he told me to drop him off where we were, and he got out the car, as i turned the corner out of the gas station, i looked to see if the object was there and it was gone. it dissapeared. i believe this was a u.f.o. I have seen show's about u.f.o's and i heard they only go on the other half of the united states.. and they go to farms... but this is oakland, CALIFORNIA... no farms... no open area, just the regular city. and also, there was no planes in the sky, tjere was no noise like a plane, and this object was really close to us... enough to see the exact shape of the object.",
      "link": "http://www.nuforc.org/webreports/052/S52511.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b75c0",
      "summary": "Silent and  Unknown.",
      "city": "oakland",
      "shape": "unknown",
      "date": "2007-02-24T00:00:00",
      "story": "Silent and  Unknown A friend  and I were sitting near a lake at her campground when I noticed a bright light across the lake, it wasnt moving just sitting there. I asked her what it was and she just laughed and said a UFO.  I laughed also but then the light disapeared,I asked her if she seen where it went and she  said uhhh no then it reapeared again I panicked and got up  and she  told me to wait and watch it,It then started to move towards us over the lake  I jumped up and just watched  as it came closer, there was a very bright light  that was very blinding ,there was no noise following it so we knew it wasnt a  helicopter or anything. As it passed over us( which was right over the tree line) we began chasing under it ,As I was looking up  the light was so bright but you could kind of make out little lights on the sides of it I was running under it but triped and fell over a rock ,while my friend was helping me up  we both looked up and it was gone ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55416.html",
      "state": "ME",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7610",
      "summary": "I saw a fireball drop rapidly in the sky in front of me then obviously shoot away and disappear.",
      "city": "oakland",
      "shape": "fireball",
      "date": "2007-02-01T00:00:00",
      "story": "I saw a fireball drop rapidly in the sky in front of me then obviously shoot away and disappear. While exiting on Grand Ave. from 580E, I witnessed a silver fireball suddenly appear in the sky above and straight ahead of me, approx. 50-100 away.  It fell very rapidly in a slight arc, then it plainly shot away, ahead of me, and disappeared.   For that fraction of a second that it shot away, it became smaller in size before disappearing.   The fireball effect was impressive enough, but I wouldn't have thought it nearly so odd had I not seen that effect of an actual object traveling away from me. I was coming home from my work as a veterinary nurse.",
      "link": "http://www.nuforc.org/webreports/054/S54762.html",
      "state": "CA",
      "duration": "2-3 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b764c",
      "summary": "30 small round objects floating horizontally in circular formation",
      "city": "oakland",
      "shape": "oval",
      "date": "2007-08-07T00:00:00",
      "story": "30 small round objects floating horizontally in circular formation Driving North on I-580 near to the Oakland Zoo.  My mom pointed out a weird bird formation in front of us.  She thought it looked strange because they were all staying together almost in a circular form and we both thought that birds usually don't fly like that together.  As we got closer, we thought it was balloons because of the way they moved up and down, but the strange thing was if they were balloons they didn't go up into the air.  The stayed within the circular pattern and seemed to hover or float horizontally.  Of course neither of us had a camera. I verbally explained it to my dad and he said it may have been a bunch of balloons all tied together which is what it almost looked like...but what are the odds of 30 balloons staying together and not floating straight up into the air.  I am writing this because we were on the freeway and the \"UFO\" was very visible and not too high above us.  Someone else had to see it!!",
      "link": "http://www.nuforc.org/webreports/057/S57860.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d11",
      "summary": "disk shaped figure with flashing lights in a pattern, at about 7:45pm on december 1st 2006, it hovered for about 5min then disapperared",
      "city": "oakland",
      "shape": "disk",
      "date": "2006-12-07T00:00:00",
      "story": "disk shaped figure with flashing lights in a pattern, at about 7:45pm on december 1st 2006, it hovered for about 5min then disapperared it was already in the air when we noticed it, round and flat - like a big disc. couldn't see the color, maybe metal? maybe white? i don't know but it was flashing patterns of light. hard to explain.we were in traffic over the bay bridge...other people driving in cars next to us saw it and were freaking out. it was hovering...3 lights would flash, then 6, then it 3, then 6, then it would light up, then it went dark and shot accross faster than any plane i've ever seen. it hovered again, flashing the weird light patterns...it hovered for like 5 minutes or so and then it was gone.",
      "link": "http://www.nuforc.org/webreports/053/S53848.html",
      "state": "CA",
      "duration": "around 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8547",
      "summary": "large fireball with tail",
      "city": "oakland",
      "shape": "fireball",
      "date": "2009-03-19T00:00:00",
      "story": "large fireball with tail I was going home from babysitting with my grand children. I have about a 20-30 minutes drive home. It was dark and cold, and the road I was driving on is near a park area. There have been many deer accidents on this road, so I always go cautiously especially after dark.  While scanning the empty fields on both sides of the road, I noticed a fireball in the sky to my left. It was very large. Behind the ball of fire, was a tail. I believed it to be a meteorite, but had never seen one so large. A shooting star, it wasn't. I slowed down to about 20-30 miles an hour.  The road was dark, and no other travelers either way. I should have stopped the car, but knew there was no place to pull over. I watched the road and the fireball. The fields on the left had been harvested, so my view was clear. The fireball was going the same direction as I was, perpendicular to the road.  I watched it for about 3-5 minutes. The fireball went behind some distant trees, then it was gone. I believed it to crash. There were also 3 blinking \"strobe like white lights\" ahead of the fireball, which I assumed to be on towers of some kind in the distance. The fireball crashed before these lights.  I haven't been able to locate these strobe lights since. I looked for them, knowing they would be my reference point.  A few weeks later I saw on the news that Canada had a meteor crash to the ground. From the video that they showed,  it looked exactly like what I had seen...except mine was more red and orange. Also in the Canadian video, the ground and sky lit up on impact. My fireball did not make any light when it hit the ground.  (assuming it hit the ground) If you have information on a meteor in my area, please let me know. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69028.html",
      "state": "IL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8753",
      "summary": "Strange light over Oakland during the day.",
      "city": "oakland",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Strange light over Oakland during the day. I took my daughters to the park and laid in the sun enjoying the cool breeze looking at the party cloudy sky when I saw what I believed to be a chem. trail. That’s what got me looking up in the first place. I then noticed a light traveling north. The color was orangish and seem to pulsate. It was traveling in the opposite direction of the wind, though  at different altitudes the wind could travel in another. I would say it was 15,000 to 20,000 feet high. The speed wasn’t very fast.  I tried to get another park goer to see it but it went behind a passing cloud. The other party reported to me that he has noticed strange lights in the sky for the massed few months in the area as well.",
      "link": "http://www.nuforc.org/webreports/070/S70505.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c91",
      "summary": "Green flash.  ((NUFORC Note:  Possible hoax?  PD))",
      "city": "oakland",
      "shape": "fireball",
      "date": "2008-10-31T00:00:00",
      "story": "Green flash. The object was in the West heading North, fast. It started out a glowing green the stopped after about 40 seconds and started to blink red. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65596.html",
      "state": "ME",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f48",
      "summary": "Huge bright blue circles above Oakland for a few seconds, reappeared 1 mi south 2 sec. later then vanished.  Definately not a plane.",
      "city": "oakland",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Huge bright blue circles above Oakland for a few seconds, reappeared 1 mi south 2 sec. later then vanished.  Definately not a plane. It was about 1 AM and my girlfriend and I were sitting in my backyard in the Oakland hills looking at the view towards downtown Oakland.  Out of nowhere a gigantic, extremely bright circular blue light appeared over the Piedmont cemetary.  It was so bright and sudden that we both at the same time said \"Whoah what is that!\"  It was easy to see the light there because the cemetary is one of the only areas in the cityscape that is completely black at night.  At first i thought it could be cops in the cemetary shining lights or a helicopter, but after about 1 second it was obvious that it was neither. The light was huge, bright blue, circular, and had defined edges. It even lit up some of the trees directly around it. Then for a split second it looked like there could be two circles.  This only lasted for about 3 seconds and just as fast as the huge light had appeared it disappeared.  Then the weirdest part happened.  About 1-2 seconds after the circle(s) disapp! eared, another blue circle (or possibly the same one) appeared at least one mile away to the south.  This time it was merely a flash for about one second after which it disappeared for good.  I cant stress how huge and bright blue this circle of light was, and how defined its shape was.  Looking at the view it was about the size of one of the houses around it.  I couldnt see any sort of craft, just the bright solid light light. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73055.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8fe9",
      "summary": "Oakland, CA  bright silver white light traveling north west downward toward the San Francisco Bay",
      "city": "oakland",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Oakland, CA  bright silver white light traveling north west downward toward the San Francisco Bay I am a 55 year old female college professor.  I was sitting in my living room watching T.V. in front of the northern facing picture window when out of nowhere a bright moving light traveling through the sky caught my eye.  No one else in my home witnessed the event - could not get to the window fast enough.   The sighting lasted approximately 3-4 seconds.  The object was a bright silver white light traveling northwest downward toward the San Francisco Bay.   1st thought it was a private aircraft but then the light (large brilliant silver white, maybe 12 ft. in diameter from my vantage point) shone so brilliantly then instantaneously disappeared.  It seemed to be a light in and of itself.  Not a light coming from a separate source.   Approximate height from ground--100ft. and approximately ¼ - ½ mile away.  Also thought it could have been a falling star but too low to the ground.  The date and time of this sighting is Feb. 1, 2009 7:38 p.m. PST.  Clear night sky and a little over a quarter moon.   There were aircraft flying much higher and farther away in the sky (very probably approaching or departing S.F. International or Oakland International airports). ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68391.html",
      "state": "CA",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b941e",
      "summary": "flying object hovered then began to glide across the sky without any noise",
      "city": "oakland",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "flying object hovered then began to glide across the sky without any noise My friend Sanjeevi saw an unusual single white light hovering in the sky in south Oakland perhaps further south of it.  We were standing on his front porch looking out smoking a cigarette looking at Oakland from his house.  At first I thought it was a radio tower or a building that we had never saw.  But the light remained motionless for a couple minutes.   Then it began to slowly rise and glide through the sky.  Then it began to turn and come our way.  At that time I thought it was a helicopter because the shape was elongated from the side view with a white light near the front and a red flashing light near the back of the object.    Then it made its way closer to use and I saw what appeared to be the underside of the rectangular oval object and there were two white lights in towards the middle of the object and four red lights symmetrically aligned on the edges of it.   The saucer at that point was no more than a couple hundred feet away from us and in the air gliding without making any noise what so ever.  We sprinted down the street to follow where it was going but the terrain eventually made it impossible to see where it was going.",
      "link": "http://www.nuforc.org/webreports/067/S67285.html",
      "state": "PA",
      "duration": "5min"
    },
    {
      "_id": "64d005f478aba2ec5a3b985f",
      "summary": "White light over San Francisco Bay observed from Downtown Oakland",
      "city": "oakland",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "White light over San Francisco Bay observed from Downtown Oakland While driving in the south direction of the 880/980 freeway (MacArthur Maze area), I noticed one bright white light in the sky.  The light was southwest of my location, approximately 45 degrees from the horizon.  The light moved down quickly and disappeared in less than a second.  The light was lower than the fog cover.  It moved much much faster than any other air traffic that was in the area. Other aircraft observed were a helicopter and planes landing/taking off from the Oakland Airport..",
      "link": "http://www.nuforc.org/webreports/066/S66031.html",
      "state": "CA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b82",
      "summary": "Clear blue sky on Sunday morning. Very bright light at high altitude, probably about 6x brighter than Venus, but not larger than a very",
      "city": "oakland",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "Clear blue sky on Sunday morning. Very bright light at high altitude, probably about 6x brighter than Venus, but not larger than a very bright star, moving slightly faster than satellite pace. First spotted almost directly overhead, moved east at steady pace for 5 minutes, no exhaust trail or reflective variations in brightness.",
      "link": "http://www.nuforc.org/webreports/070/S70153.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f32",
      "summary": "Three transluscent, reddish-colored, orbs in a perfect triangular pattern fly overhead at a constant speed.",
      "city": "oakland",
      "shape": "triangle",
      "date": "2010-02-14T00:00:00",
      "story": "Three transluscent, reddish-colored, orbs in a perfect triangular pattern fly overhead at a constant speed. This day, January 30, 2010 at approximately 19:00 hours, I as well as two others were witness to a UFO flying overhead. At the base of the Oakland Hills, myself as well as three other friends, were on the outdoor deck of a penthouse on the fourth floor of an apartment building. Our focus was on the horizon just over the hills due to the reason that a friend mentioned that the moon rises so quickly at night over the hill. While we were waiting as we observed the glow of the moon thru the fog rolling over the hill, two of the three friends went into the house (the residents of the apartment.) I remained outside because at 25 years of age I had never witnessed the moonrise before. While the other and myself were anxiously waiting for the moon to peak over the hill he shouted, “ A UFO, a UFO!!!” I immediately looked to where he was pointing and I saw a triangle shaped object. It was three translucent reddish-colored orbs in a symmetrical “pyramid” shape. The top! of the triangle, the point, was at the head of the direction it was moving. It was moving at a higher rate of speed at an altitude higher than that of planes that regularly fly over the same area. Its rate of speed during the sighting never wavered. It remained at a constant speed throughout the sighting. At the time it was in our field of view, there was not one other plane or object in the sky. The only things in the sky in view were the stars. When he shouted, the male resident of the apartment raced out to the deck (back patio) and immediately saw the UFO. He was the only one who said he “heard” it. Myself as well as the other fellow who first observed the object did not hear anything. It was just “gliding” thru the sky. I have never seen anything like it. It was funny or odd to me that several minutes after the sighting, as we were all in amazement of what we had just observed, I noticed the sky began to fill up with airplanes flying overhead. This was odd to me due to the fact that when the UFO was in the sky there were no other objects present except the sky and stars. Several seconds soon after the UFO traveled out of our field of view, is when planes began to fly in their respective patterns overhead.",
      "link": "http://www.nuforc.org/webreports/074/S74245.html",
      "state": "CA",
      "duration": "5-10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ff9",
      "summary": "Strange mirage disturbance flying through the sky at high speed over Oakland California.",
      "city": "oakland",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "Strange mirage disturbance flying through the sky at high speed over Oakland California. I witnessed what looked like a ships wake in the sky It was transparent/mirage like in appearance, as if someone dragged a ball though the water by a string  viewing it from beneath the waves.  I only noticed it when it moved, seemed to have been there at a stand still as its movement drew my attention to it. The disturbance only lasted for a ½ second to 1 second traveling east to west at a very high rate of speed. There was no light emitted, just an area that wasn’t as dark as the surrounding sky. For the last year or so I have noticed strange happenings in the areas night sky. From lights that can only be seen with a pair of binoculars coming head on towards each other at extreme altitude, (approx. 80,000ft.)   only to have one disappear as they meet, to flashes of light that just appear and then disappear just as fast. These strange sightings have captured my attention that I keep watching nightly for them. Unfortunately they happen too fast to photograph and are too far away to zoom in on. I will try to anyway, someone needs to see these things. Glad to have a someone to report this to. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67675.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3ba159",
      "summary": "Triangle of lights speeding accross the sky from Oakland, CA",
      "city": "oakland",
      "shape": "triangle",
      "date": "2010-04-13T00:00:00",
      "story": "Triangle of lights speeding accross the sky from Oakland, CA I went outside for a smoke at around 1:10 AM this morning. I was looking at the stars facing southwest, when something caught my eye. I quickly looked over and in 1-2 seconds I saw 4 lights moving at an incredible speed past the roof of my house. I quickly ran around to the side of the house to see what it was. For the next 2-4 seconds I clearly saw 3 lights forming a triangle speeding across the sky directly south. There was also a light right in the middle of all 3. There was a large distance between the lights, because at the speed they were moving, they stayed in perfect unison probably 5-6 miles apart from each other. I'm not sure whether or not these were rim lights to some large craft, but it seems unlikely since the distance between them stayed in a perfect triangle. If this is the case, the craft must have been absolutely huge. The speed of this object was approximately (and I'm guessing here) 10-15x faster than the airplanes I observed in the sky over the SF Bay Area during the minutes after the sighting. I can't stress enough that this thing was moving INCREDIBLY FAST!  The night sky during the event was very hazy, with the lights from San Francisco making it hard to see the stars. I lost sight of the object in the haze traveling southward. The lights also appeared to be speeding up. For the past year, I lived outside the city, and saw many shooting stars during the night and early morning. I am absolutely certain that these lights were not shooting stars. I hope this report is of use to someone. Cheers -((name deleted))",
      "link": "http://www.nuforc.org/webreports/074/S74936.html",
      "state": "CA",
      "duration": "4-6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba51c",
      "summary": "rectangular shaped object over Oakland, CA",
      "city": "oakland",
      "shape": "rectangle",
      "date": "2009-05-12T00:00:00",
      "story": "rectangular shaped object over Oakland, CA I was walking on my boat dock in Alameda, CA when I saw a rectangular shaped object traveling over the City of Oakland, CA.  The object was translucent with a haze around the edges. At first I thought it was a large piece of plastic floating in the air, but it maintained its shape and course.  The object floated up and down changing altitude about 100-200 feet each way.  The object started in the area of the Mormon Temple and disappeared for several seconds in low rain cloud before emerging and continuing west.  I lost sight of the object around the vicinity of the Bay Bridge.  Approximate altitude was 1000 feet based on the height of the East Bay Hill in the background.  It appeared to maintain its heading throughout the sighting.  No lights or other reflections were observed.   This area is in the vicinity of the Oakland International Airport, but I did not see any other aircraft in the area.",
      "link": "http://www.nuforc.org/webreports/069/S69912.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba98e",
      "summary": "First Friday Oakland, CA UFO sighting",
      "city": "oakland",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "First Friday Oakland, CA UFO sighting Saw 5 orange lights in a rectangular pattern with one in the center.  It was moving in a SE direction, very slowly and made no sound.  Then it quickly took off and disappeared.  It was only what seemed to be about 5 stories above us and about the size of a large car. I normally would not report these sightings but my brother who was standing next to me saw the same exact thing as well as a few other people.  We were in a crowded place for 1st Friday in Oakland and was amazed that with all these people only a handful of us saw this thing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78995.html",
      "state": "CA",
      "duration": "5 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bad93",
      "summary": "Orange orb hovering over Bay Area. ANother appears and approaches, and hovers then dissapears. .Moves upand down , dims in/out",
      "city": "oakland",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "Orange orb hovering over Bay Area.  Another appears and approaches, and hovers then dissapears. .Moves upand down , dims in/out   Last night I saw a bright orange orb hovering in the sky. I was standing on my back porch which is 1 story off the ground. I live in the center-most area of my city (Oakland, Ca) and according to Google satellite my street is 400 ft elevated (I live on a hill).  The orb looked as if it was roughly between 10 and 20 thousand feet off the ground,. I was standing on top of a chair, and with doing so it looked like it was in my direct line of sight, but way across town (I was facing NW).  It seemed to be getting brighter then it would dim out then come back, and it was moving up and down very slowly, then it would stay it one spot. The size of it was small compared to the moon, but large compared to a star.  I saw another orb appear that was not bright as the first, and it slowly drifted towards the first orb making its way directly on top of it.  It then stayed then and got very bright, so bright that they almost looked like one.  The second orb then dimmed out )but! still visible) about a minute later and drifted away in the same direction it was going and disappeared (it went in a straight line).  I zoomed in with my camera and the shape of the object looks like a geometric Pac-man shape.  The original orb stayed in the sky for about 20 minutes (that I saw of it that is)  periodically dimming out then getting bright again. Eventually it drifted slowly away and disappeared.",
      "link": "http://www.nuforc.org/webreports/078/S78535.html",
      "state": "CA",
      "duration": "approx. 20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0a7",
      "summary": "Fireball outside my den window 2 witnesses",
      "city": "oakland",
      "shape": "fireball",
      "date": "2011-03-23T00:00:00",
      "story": "Fireball outside my den window 2 witnesses My wife (who was six months pregnant at the time) and I were sitting in our den watching television at around seven in the evening.  Our tv is elevated and in a nook and is between two six foot by three foot windows.  I was sitting on one couch and my wife in the loveseat, they are set up with one long couch directly facing the tv and the loveseat to the left along the wall.   Suddenly and without warning, I noticed a beach volley ball sized fireball right outside my window just hovering there...totally stunned, I stared at this object for a good fifteen seconds before it flew away at an extremely high rate of speed....by that I mean shot out of a cannon speed....basically it disappeared but I saw a glowing streak as it left....probably my eyes trying to catch up....very very bright flaming ball...I looked at my wife and asked her if she just saw something outside our window...I didn't tell her what I saw bc I wanted to make sure she wasn't being lead by my s! tory...we described exactly the same story....from two different angles in the room.... My house is in a new subdivision and I am on a corner lot...on one side I have a vacant lot and the other is a house but it was vacant as the owners were both doctors and were transferred...so basically I am saying that there is no reasonable explanation for this...it was literally ten feet from us and two feet outside our window! Our backyard is fenced and locked from the inside also...after my daughter was born we filmed on our phone an orb hovering over my daughters bed in back and forth patterns...definitely not random movement as would be expected with dust particles or something picked up by the night vision cameras...also it instantly disappeared when my wife cracked the door to see if she could see it with her own eyes....I have no idea what to think of these occurrences! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80528.html",
      "state": "TN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb189",
      "summary": "I was standing on my roof around midnight and saw a flying object no more than 3000 Ft in altitude travelling south silently and at a h",
      "city": "oakland",
      "shape": "cylinder",
      "date": "2011-03-10T00:00:00",
      "story": "I was standing on my roof around midnight and saw a flying object no more than 3000 Ft in altitude travelling south silently and at a high rate of speed. It seemed to leave a wispy, narrow trail in its wake, but the trail wasn't a jet contrail. Craft was not illuminated and had no flashing lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80230.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4be",
      "summary": "Fireball in Oakland California",
      "city": "oakland",
      "shape": "fireball",
      "date": "2011-01-05T00:00:00",
      "story": "Fireball in Oakland California On Sunday December 26,2010  Me and my family had stoped on a stoplight  When i seen a spherical fireball oject in the air for about 45 Seconds then suddently it moved into a cloud.I attemped to record the object but it wouldent apear in the Camera.",
      "link": "http://www.nuforc.org/webreports/079/S79385.html",
      "state": "CA",
      "duration": "45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bb890",
      "summary": "OAKLAND UFO 7/9/2010 HAVE PIC",
      "city": "oakland",
      "shape": "cylinder",
      "date": "2010-07-28T00:00:00",
      "story": "OAKLAND UFO 7/9/2010 HAVE PIC Report #1 As recorded from >52 yr. old female, yard maintenance worker, lives in Oakland and one other person see other report #2 \"On 7/9/2010 between 1:00 & 1:30 PM in the Oakland hills on Grandview Dr in the hiller highland area Above the Claremont hotel (see map) I saw a long ,brown ,straight , u. f. o. moving over Oakland ca.  Heading west towards the bay. By the time I got my camera out it was in front of the sun. it was climbing in altitude and slowly turning north.  It was moving about as fast as a blimp but it was as big as two and a half commercial jets end to end.  Or from my eye view about 2\" long. it seem to be about 12000 feet up. Report #2 Last Friday, July 9th at around 1pm, I witnessed an aircraft hovering in the sky for a few minutes while speaking with Evva.  I thought it was hovering at a height much higher than consistent with commercial airliners landing or having just taken to the sky. I was standing at 1390 Grand View Drive in Berkeley and it seemed like the aircraft was directly above us.  The color of the aircraft was dark brown or black and shaped like a perfect cylinder, with neither any tapering at either end or anything resembling the wings of an airplane.  The end of the aircraft looked like the color chrome, but that may have been the sunlight glinting off of it.  Based on the altitude I estimate the aircraft was hovering at, it seemed like it's size was much larger than a commercial aircraft. After a few minutes, the aircraft reoriented itself from an original position consistent with the hull of an airplane flying horizontally to one flying vertically, while still holding almost the exact same position in the sky.  I then departed and did not see the aircraft any further.",
      "link": "http://www.nuforc.org/webreports/076/S76705.html",
      "state": "CA",
      "duration": "15 MIN"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfce",
      "summary": "At least 3 lights seen moving/changing colors from Berkeley CA.",
      "city": "oakland",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "At least 3 lights seen moving/changing colors from Berkeley CA. Looking toward San Mateo from a high level porch in the Berkeley hills, at least 3 lights were seen by 2 of us. At first, I thought it was wonderful to be seeing three planes at varying distances at just such an angle. Then they did not move and they were changing colors ( red, blue, yellow, orange, green if I remember correctly ). They began moving at sharp angles and sometimes seemed to come together.  \"I saw three electric prisms, Goliath in size, perform a Voltron dance in the distant sky.\" This is what I wrote in my journal. It's not meant to sound poetic. It's just the clearest way of explaining what I saw.",
      "link": "http://www.nuforc.org/webreports/086/S86124.html",
      "state": "CA",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc6e0",
      "summary": "well i was just outside looking at regular aircraft (live near airport) then i see 5-7 shiny flying spheres about 4000 ft in the air ,",
      "city": "oakland",
      "shape": "sphere",
      "date": "2011-10-25T00:00:00",
      "story": "well i was just outside looking at regular aircraft (live near airport) then i see 5-7 shiny flying spheres about 4000 ft in the air , it was at sunset so you could really see them shinning",
      "link": "http://www.nuforc.org/webreports/084/S84684.html",
      "state": "CA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc82f",
      "summary": "BLACK TRIANGLE CRAFT WITH LIGHT THAT WERE SQUARE",
      "city": "oakland",
      "shape": "triangle",
      "date": "2011-10-25T00:00:00",
      "story": "BLACK TRIANGLE CRAFT WITH LIGHT THAT WERE SQUARE I WENT OUT ON THE BACK PORCH TO LET MY PUPPY OUT TO USE THE BATHROOM WITH MY GIRLS SON AND THE WEATHER WAS NICE NO WIND NOTHING CLEAR SKIES AND HE SAID I WISH I COULD BE ABLE TO GO SEE A STAR OR BE A STAR SOME THING TO THAT EFFECT. I SAID OH YEAH WHY IS THAT AND LOOKED UP AND WAS LIKE HMMM THAT'S AND CLEAN PRIVET JET, BUT THE WAY IT WAS BLACK AND TRIANGULAR SHAPED I WAS LIKE WAIT! WHAT KIND OF ENGINES ARE THOSE? IT WAS THREE LIGHTS SQUARED IN SHAPE IN THE FRONT AND THREE ON ONE SIDE IN THE BACK AND THREE ON THE OTHER GLOWING LIKE STREET LIGHT OR A DIM LAMP LIGHT IN A SQUARE SHAPE WITH A BLACK SQUARE SPACE IN THE MIDDLE LIKE A LID  TO LET THE HEAT OUT. WHEN I SEEN IT I TRIPPED ON ALL THE LOGICAL EXPLANATION LIKE THAT MIGHT OF BEEN THE STEALTH BOMBER, OR AN FANCY AIR PLAIN, BUT THERE WAS NO SPEED OF LIGHT AFTER SOUND, NO JET ENGINE NOISE NOTHING, AND THIS THING WAS MOVING FAST IT WAS HIGH UP LIKE A JET PLANE TRAVELING LONG DISTANT GOING TOWARDS LOS ANGLES BUT ! BIG IN SIZE I EVEN SAID MAYBE IT WAS THE CONCORD PLANE.... IN THE BAY AREA NAWWWW!I SEARCH IT ON GOOGLE AND THE LAST TIME ONE WAS SEEN ON THE SAME DESCRIPTION OF LIGHT BUT SHAPE WAS IN JUNE.....",
      "link": "http://www.nuforc.org/webreports/084/S84762.html",
      "state": "CA",
      "duration": "10 SEC"
    },
    {
      "_id": "64d005f478aba2ec5a3bd51c",
      "summary": "4 Orange lights seen over Oakland, CA - Interesting maneuvers and disappearance.  First time sighting!",
      "city": "oakland",
      "shape": "circle",
      "date": "2012-08-05T00:00:00",
      "story": "4 Orange lights seen over Oakland, CA - Interesting maneuvers and disappearance.  First time sighting! I was driving northwest on I-580 between Park blvd. and Lakeshore Ave.  While exiting onto Lakeshore, I saw 4 very bright orange lights in the sky to the west, heading southeast toward me.  My first reaction was that they were a string of planes on their way to land, which is a common sight in the bay area.  They were below the cloud cover, which is relatively low (touches the hilltops), but I couldn’t see any sort of shape to them.  A fourth that was hanging back abruptly caught up, bobbing ad looping as it went. At this point I had run through all the options.  Based on their speed, I am convinced they were “aircraft“, but  they were making turns and altitude changes that appeared unearthly.  They started to turn to the east rather quickly, at which point I couldn’t look anymore, considering I was driving.  After finding a parking spot, I ran out of the car and looked up, only to find one craft slowly moving west to east.  As it sat in the sky, I got a good look at it: Orange orb with yellow edges, no apparent solid shape.  It was larger than Jupiter in the night sky, but definitely smaller than the moon.  It jogged around for a second then seemed to go straight up, fading out through the cloud layers. I saw two men talking where I had stopped, and when they separated I pulled one over to look at what I was seeing.  He was somewhat interested, but figured it was a helicopter and walked back inside his home.  Well, after what I saw, I can safely rule out helicopters, airplanes, or anything inanimate like &quot;Chinese lanterns&quot;.  These things were moving all over the place in their flight path, and were at times going faster than the F-18's that were flying over for the 4th of July.  It was surreal to see the way they moved, it is difficult to put into words. I never thought I would see something like this over my home town.",
      "link": "http://www.nuforc.org/webreports/090/S90686.html",
      "state": "CA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bde38",
      "summary": "Brilliant Orange Light Streaks Horizontally Across the Night Sky in Oakland, CA - Sept 16, 2012",
      "city": "oakland",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Brilliant Orange Light Streaks Horizontally Across the Night Sky in Oakland, CA - Sept 16, 2012 Brilliant light appeared at stationary point in sky and began to streak across the night sky horizontally with great velocity.  The light, as it acclerated, expanded turning bright orange then deep baby blue breaking up into smaller lights and disappearing.",
      "link": "http://www.nuforc.org/webreports/092/S92845.html",
      "state": "CA",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdeee",
      "summary": "Dark undulating circular blob over Oakland",
      "city": "oakland",
      "shape": "changing",
      "date": "2012-07-04T00:00:00",
      "story": "Dark undulating circular blob over Oakland Driving up 880 freeway Saturday afternoon, I saw an indistinct blob in the sky, it was roughly oval shape, but seemed to have some sort of rippling effect. Object appeared to hover or move very slowly in distance. It did not appear to be a blimp (irregular shape, didn't reflect any sunlight). Traffic was moving slow, so there was some time to observe it, but I eventually lost it as it was somewhat low on horizon. I should note that there was an Giants-A's baseball game going on in Oakland at the time.",
      "link": "http://www.nuforc.org/webreports/090/S90130.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdef4",
      "summary": "Floating flat disc seen in Oakland, CA.",
      "city": "oakland",
      "shape": "disk",
      "date": "2012-05-13T00:00:00",
      "story": "Floating flat disc seen in Oakland CA Upon exiting a store, my husband noticed a dark colored object in the sky and pointed it out to me. This object was floating about two miles away and was relatively close to the earth in comparison to an airplane that was also flying near by.  At first, I was convinced that it was a kite or something, but as it came nearer it became obvious that it wasn't a kite or balloon or anything that could float for so long on its own.   We stood watching it in the parking lot of a Home Depot for about 5 minutes as it came directly above us.  It was clearly a very, very flat surface and was actually moving quite slowly, as if being carried by the wind.  Yet, the air was still and there was no strong wind whatsoever to propel it.  It tettered back and forth from side to side, but for the most part, we could only see the bottom of the aircraft. We watched it until it was out of sight. It was still very light outside, yet no one else seemed to see it.",
      "link": "http://www.nuforc.org/webreports/088/S88491.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be237",
      "summary": "Strange brights lights above Oakland Zoo",
      "city": "oakland",
      "shape": "changing",
      "date": "2012-09-24T00:00:00",
      "story": "Strange brights lights above Oakland Zoo Husband saw odd light flash into clear sky high above Oakland zoo.  Appeared to be very high in the sky and remained in a relatively fixed position.  At first it appeared to be a thin line of reflected light but changed to more of a pinpoint after several minutes.  Wife also watched after the first two minutes and both of the couple watched the light hover high in the sky above Oakland for about 30 minutes.  During that time it moved position only slightly - drifting roughly north west.  Two other lights appeared and approached the first light during the time it was hovering and then gradually disappeared by apparently moving higher into the atmosphere out of sight of the couple. Honestly, as wife did not see initial appearance of the light she was skeptical about the origin of the object in spite of the fact that it remained essentialy stationary high above the sky of the Oakland Zoo, suggesting theories of weather balloons, etc. as the origen of the light.  However, after watching the object appear as a shiny stationary dot for approximately 30 minutes she was startled to see the light thin to a white line and then disappear in a bright flash.  The entire event took place in a clear blue sky above a very active air space and normal planes with contrails passed far below these lights throughout the event.  The sudden appearance and disappearance of the object as well as its apparent ability to remain stationary high in the sky was extremely unusual.",
      "link": "http://www.nuforc.org/webreports/092/S92997.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bedb1",
      "summary": "White cigar shaped above Oakland airport",
      "city": "oakland",
      "shape": "cigar",
      "date": "2013-08-30T00:00:00",
      "story": "White cigar shaped above Oakland airport Around 5pm on Monday July 27th, 2013 I looked out my window and saw a very slow moving white cigar shaped object in the sky.  I am in Oakland, close to Lake Merritt, the object was East of me, almost above Oakland airport, going North.  It did not seem to glow or anything, it was simply white against the grey background of the clouds.   At first I thought it was an elongated blimp of some sort, as it seemed larger than a plane, but flying way too slow to be a plane.  Then it sort of shrunk itself from end to end to the point of disappearing in a matter of 5 seconds, tops.  The whole event lasted 20 to 30 seconds.",
      "link": "http://www.nuforc.org/webreports/100/S100624.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf997",
      "summary": "On a clear night, a large, bright light appeared, dove rapidly, then rapidly ascened, and left.",
      "city": "oakland",
      "shape": "light",
      "date": "2013-09-09T00:00:00",
      "story": "On a clear night, a large, bright light appeared, dove rapidly, then rapidly ascened, and left. We were home in the Montclair section of Oakland on a clear night when this very, very bright light came toward us from the Golden Gate Bridge direction (heading East).  It stopped over the area around Grand Ave. and Highway #580.   After about 10 seconds it made a very swift dive south easterly and disappeared behind the hill area above the Mormon Temple.  After a few seconds (about 5 seconds) it came back up at the same speed that it had used to descend.  This speed is maybe 3 to 5 times faster than an airplane's speed.  It hovered a few more seconds and then left.  There was no noise what so ever.  The light was the same color as the landing lights we seen on planes every night.  It did not blink or shut off.",
      "link": "http://www.nuforc.org/webreports/101/S101882.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd49",
      "summary": "Brilliantly colored Orange/Red Circle travelling E to W in Oakland, TN on July 14, 2013.",
      "city": "oakland",
      "shape": "circle",
      "date": "2013-07-22T00:00:00",
      "story": "Brilliantly colored Orange/Red Circle travelling E to W in Oakland, TN on July 14, 2013 On July 14, 2013 approximately 21:00 (9:00pm), I observed along with others an orange/red orb.  I was talking to my neighbor and glanced to the east.  I noticed a big orange/red ball.  I asked my neighbor what that was, and he said probably a firework, since someone was shooting off a few in the distance from where we were, and we could see them.    We kept watching silently.  We noticed it was moving towards us. When it was passing, I told him that wasn’t normal.  He said no it wasn’t.  We both said we have never seen anything like it.  It had no sound, nor a tail.  I viewed it very well.  It didn’t have a white glowing light nor an open place in the bottom like Chinese lanterns have. I got an excellent view of the east, north, west and bottom of this object.  IT HAD NO OPENINGS WHATSOEVER!  Brilliant orange red color.  I did focus on it’s rim after it passed by me to see if I saw anything emitting from the sides.  I did see a little energy, one might call it. My close up look revealed that it did not flicker like most you tube videos of orbs do.  It was very bright, but didn’t hurt my eyes at the moment looking at it.  I didn’t have to squint like looking at the sun makes one squint.  It was a big ball traveling across the sky.  It seemed to be intelligently controlled in my opinion.   I have not ideal what I saw, but I can tell you in my opinion what I  believe it wasn’t due to the close up view I got of it.  It has been suggested it was a Chinese lantern.  I have looked at Chinese lanterns on you tube.  There is no comparison to what I observed.  There was no white light.  It was perfectly round like the moon.  I know it was not a falling star, nor a piece of space junk that fell from orbit.  I witnessed a piece of Russian space junk falling and it looked like a plane on fire with a long tail.   This orb looked more like a ball of energy, perhaps one might say an orange round moon traveling.  The color was not flickering.  I didn’t see any white or black spots.  The color seemed the same all over, just brilliantly colored.   I didn’t see a triangle or any other shape within or outside of it.  I observed it long and close enough to honestly say in my opinion it wasn’t a Chinese lantern which skeptics want one to believe. There is a place that makes flares on the east side of Oakland.  I sometimes see them testing early in the morning off in the distance from our house.  They fall down.  I’ve seen enough of those to know it wasn’t a flare.  Besides it was on a Sunday night, and I’m sure they were closed.  They don’t travel at a constant speed and altitude either. As the object traveled past, I didn’t feel any weird feelings within my body.  I probably wouldn’t of noticed any weird feelings since I was so fixated on the object in question.  Again, it had no openings on the east, north, west nor bottom of object.  I could see it most clearly.  If it landed on top of the house or in front of me, I could not have viewed it any better. I called the National Weather Service in Memphis, Tennessee this morning.  The gentleman said the surface winds were out of the east at 10 mph.  Speculating winds aloft were out of SE 500 feet and above.  He said they didn’t keep a record of winds aloft, so he was going by what it has been lately with winds out of the east.  I didn’t like hearing winds out of the east, because that doesn’t help me with my case as to what I actually viewed.  The skeptics reading my report will suggest it was a Chinese lantern, which in my opinion clearly wasn’t.   Before saying that I would say it was a ball of energy coming from the fireworks.  I feel so strongly it wasn’t a Chinese lantern due to the great views I had of it on the east, north, west and bottom sides. Whatever it was…. The color was very pretty.  I don’t see Chinese lanterns having such a brilliant orange / red color.  It wasn’t like it was lit up inside an object.  The object was the light itself. Everything I have written is my honest opinion.  I will say the altitude of the object was perplexing to me.  I can’t give you  an altitude, but I can tell you it was big enough and close enough for me to see everything I needed to see.",
      "link": "http://www.nuforc.org/webreports/100/S100293.html",
      "state": "TN",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd4a",
      "summary": "Orange / Red Orb in Oakland, TN traveling at constant speed and altitude on 07/14/13 appx. 21:00.",
      "city": "oakland",
      "shape": "circle",
      "date": "2013-07-22T00:00:00",
      "story": "Orange / Red Orb in Oakland, TN traveling at constant speed and altitude on 07/14/13 appx. 21:00. Approximately 21:00 on Sunday 07-14-2013 I along with others my neighborhood in Oakland, Tennessee, observed an orange/red orb traveling at a constant speed and altitude.   I noticed someone had shot off a few fireworks in the far distance.  I saw a bright light between where the fireworks were being shot and where I was located.   At first we thought it was a firework.  As we watched it, we noticed it was moving towards us.  It seemed to be at a low altitude or either it was very big and gave that impression. It passed overhead and therefore I got a good view of it.  The orb was circular like the sun and moon.  It was very bright, but it did not cause me to squint to look at it as the sun does.  It didn't have a tail, nor make any sound. It didn't have any other colors in it nor did it flicker like the ones you see on you tube videos.   After it passed over, I made a point to look at the rim to see if I saw anything emitting around it.  I did notice a little energy, I guess you can call it, but only when I looked hard at the rim after it passed. It was not a Chinese lantern as some may suggest.  I got a good look at it probably between 2 and 3 minutes, especially when it passed overhead. I know it was not what has been suggested it might have been to me. I had no funny feeling in my body as it passed over, just amazement.   That happened night before last and tonight I have a sore throat, gee I hope that orb didn't give me something! :o)  I'm joking, but I'm also serious about that last statement!   If anyone has seen this orb or any other in Oakland, PLEASE report it to an online UFO reporting site.  I'm sure all of us that have had the opportunity to see one of these orbs would love to see how many others in Oakland and across the country that have actually gotten to see one.  I'm wondering if it is a good or bad thing seeing one...I'm honestly having mixed feelings. What are they?  Are they good, evil, just a ball of energy, a secret government! project or what?",
      "link": "http://www.nuforc.org/webreports/100/S100235.html",
      "state": "TN",
      "duration": "~2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c03ca",
      "summary": "Blinking, stationary light.",
      "city": "oakland",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "Blinking, stationary light. Stationary blinking light in the sky, directly overhead.  Blinked every 60 seconds.  Went to get camera, and it was gone.  Looked to be at least satellite altitude. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95948.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c79",
      "summary": "Orange lights ORB silent and odd movement with VIDEO.",
      "city": "oakland",
      "shape": "unknown",
      "date": "2014-02-27T00:00:00",
      "story": "Orange lights ORB silent and odd movement with VIDEO I witnessed a very bright orange light appear into the sky.  The light changed from bright to dark orange almost in a pulsating fashion.  Its movement was silent and gracefulty made its way across the night sky at times slowing and moving faster.  I was having a smoke on my balcony as i always do around this time of night.   As fast as I could I grabbed my smartphone to try and capture a video. its not the best video but its what i saw and its un-edited.  This \"ORB\" was in the sky  It was in the sky about 75 seconds (The ORB came from the direction of the Oakland Coliseum home of the A's & Raiders and came towards my place next Lake Merritt) before i was able to get my phone out and record the next 26 seconds on video, so in total it lasted about 1 minute 40 seconds.   I stopped to call my wife and tell her to come out and look but as soon as i dialed and looked back up it was gone.  I waited outside for 15mins never to see it again.  VERY STRANGE. Next about 30 mins or so later spoke to my neighbor whom said he and his wife and 4 kids saw the same thing.…",
      "link": "http://www.nuforc.org/webreports/107/S107354.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c148c",
      "summary": "Triangular black object with red lights seen over Alameda",
      "city": "oakland",
      "shape": "triangle",
      "date": "2013-12-23T00:00:00",
      "story": "Triangular black object with red lights seen over Alameda A very large, black triangular craft with red lights on its perimeter, was seen maneuvering west of my home at 13th Avenue and 20th street, in the direction of Alameda or the Bay.  (Monitoring the weapons cache at the old Naval Air Station?)  I estimate it was 1/2 mile above the ground and maybe 2 miles away.  It had 3 sides, with red lights. Last night was crystal clear, yet this object appeared blurry. It made sharp and quick turns.  My intuition leads me to believe \"they\" were looking for someone or something. I continued to watch, covered in goose bumps, for approximately 2 minutes. Both of my dogs were frightened.  The smaller dog wanted me to pick her up.  My other dog wanted nothing more than to just go home.  They have never shown fear to a vehicle, especially a vehicle in the sky. It's ascent left me feeling it is not ours.  As it took off skyward, it  did so keeping the \"hull\" square to the ground, travelling virtually in a direct vertical line.  Its color also changed to an orange color.  This craft was completely silent.",
      "link": "http://www.nuforc.org/webreports/105/S105490.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c160a",
      "summary": "Intense, stationary bright light in SF Bay Area sky.",
      "city": "oakland",
      "shape": "light",
      "date": "2013-10-23T00:00:00",
      "story": "Intense, stationary bright light in SF Bay Area sky. I noticed an intensely bright light in the sky.  It was so intense there was no flickering or change in intensity.  It was completely stationary, absolutely no movement whatsoever.   I took pictures with my phone so not the best images but can share with interested individuals.  In perfect altitudinal alignment was another light.  Less intense and smaller.  Its light twinkled with varying intensity.  This second light was also stationary. I can assure you that these lights were too high up in the sky to be beacons for aircraft. It's possible that they were stars but every star I've ever looked at \"twinkled\" of flickered.",
      "link": "http://www.nuforc.org/webreports/103/S103253.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c20a8",
      "summary": "Two pulses of bright green light in western sky over Oakland, CA, late night Thursday (1:00 AM 6/6/14).",
      "city": "oakland",
      "shape": "other",
      "date": "2014-06-06T00:00:00",
      "story": "Two pulses of bright green light in western sky over Oakland, CA, late night Thursday (1:00 AM 6/6/14). While walking in a westerly direction in Oakland, CA, just after 1 in the morning, the night of Thursday, June 5, 2014 (thus technically ~1:05 AM June 6, 2014) there was a very quick, very bright green flash of light in the sky , due west-to slightly west-northwest, apx. 30 degrees above horizon.  It was followed about 10 seconds later by an identical band very bright green double flash of light. There was a bank of clouds right at that spot in the sky rolling in as is common from the bay. It looked very much like the intense lightning that illuminates from the inside of clouds in monsoon type storms (common in other areas, but rare in this part of California), but there was no sound whatsoever, during or any time after either double flash.  There was no precipitation.  I heard another person who was out on the street exclaim as I saw the second flash. It also looked like the illumination of fireworks, but again, no sound at all, and just the two bright pulses of green light.  It was impossible for me to tell if it was coming from the ground or from within or behind or above the bank of clouds.  No movement, just the two pulses, separated by about 10 seconds.  Then I was inside so wouldn't have seen any more if there were.",
      "link": "http://www.nuforc.org/webreports/110/S110002.html",
      "state": "CA",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c287b",
      "summary": "Cylinder shaped object hoovering within 80 feet of me on a clear evening sky.",
      "city": "oakland",
      "shape": "disk",
      "date": "2014-08-29T00:00:00",
      "story": "Cylinder shaped object hoovering within 80 feet of me on a clear evening sky. I was in the military on active duty with the Coast Guard in Oakland, CA, but on Governor's Island, which is an estuary.   I was on a second floor barracks facing south when I looked out the window and saw a disc shaped object hoovering above a building across the street from my barracks window.  The object was only 20 feet above the building which gave me a perfect viewing.  I opened the window and looked at how close this object was.  I saw no windows but multicolored lights circumnavigating the object like you would see on an outdoor theater displaying the features at the show.  The disc reminded me of a football shape.   I shouted at a guard passing on the same side of the street to come across the street and look up.  He witnessed it as well.   I ran down the stairs of the barracks to alert the watchman and by the time we both observed this object we saw it jet upwards at an angle with no sound and disappear into the night sky like an open shutter on a camera, leaving a trail of light behind it.   I have been an avid UFO watcher with interest since I was a teenager.  I have shared this story with hundreds of people and even an astronaut that visited our neighboring community several years ago.  He walked on the moon and said he had witnessed UFO's himself.  I am a true believer!",
      "link": "http://www.nuforc.org/webreports/112/S112963.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a50",
      "summary": "Two Objects Give Off a Bright Flash High in the Sky While Moving at Speed.",
      "city": "oakland",
      "shape": "light",
      "date": "2014-10-10T00:00:00",
      "story": "Two Objects Give Off a Bright Flash High in the Sky While Moving at Speed. At precisely 20:20 hours, I looked up into the sky, and high in the night sky, I would say many miles up, I saw two objects of some sort, which were clearly distinguishable as being individual objects, simultaneously emit a pure white flash, and then move in tandem at speed in a N/w direction.  I saw a single bright flash of light at a similar time and location about a month ago. ...  I am 6o years old, with no time for games. ...  These were not conventional aircraft.",
      "link": "http://www.nuforc.org/webreports/114/S114315.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a88",
      "summary": "Glowing flame like red object.",
      "city": "oakland",
      "shape": "oval",
      "date": "2014-11-06T00:00:00",
      "story": "Glowing flame like red object. A Red Flame like glowing center area with red spikes running from front to back and side to side( x-like)shape with oval flame center.  Traveling from north to south with one course correction over San Pablo Ave. area just north of downtown Oakland, CA.  The object seemed to be at a mid to low altitude (it was in front of the background scattered clouds).  The object seemed to make no sound.",
      "link": "http://www.nuforc.org/webreports/115/S115079.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d78",
      "summary": "Saw a bright red light at a high elevation, moving slowly westward, then turn 90 degrees heading South and fade behind a tree line. It",
      "city": "oakland",
      "shape": "circle",
      "date": "2014-08-22T00:00:00",
      "story": "Saw a bright red light at a high elevation, moving slowly westward, then turn 90 degrees heading South and fade behind a tree line.   It moved and turned like no aircraft I've seen before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112555.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c352e",
      "summary": "Cigar shaped ufo seen falling to earth ion Oakland.",
      "city": "oakland",
      "shape": "cigar",
      "date": "2015-01-26T00:00:00",
      "story": "Cigar shaped ufo seen falling to earth ion Oakland it was 1/8/15 at 0715 hrs in the morning.  I was having a cigarette scanning the sky looking in the eastern sky. I saw something at about 45 degree in the falling towards earth at a very sharp angle, like if it was the hands of a clock, it would be facing seven o clock. It was traveling incredibly slow.  So slow, that I didn't know whether this was a contrail from an earlier plane or whether it was moving.  I had to use the telephone wire as a reference marker to make sure it was moving.   Once I realized it wasn't a contrail, a plane flew near it, on its own trajectory, giving me an immediate reference to the movement of planes.  As it started falling past the tree limbs it did something really funny.  It seemed to have compressed, almost like an accordion into itself and seemed just hover in the sky.  Watching this sent chills down my spine because it's movement was one I have never encountered in my life.  It wasn't a meteor because the speed was too slow.  Nothing could just fall from the sky at the rate it was falling.  The velocity was just too slow.   And it wasn't a plane.  I took a video, buts it's poor in quality, but I did take a few photos that didn't turn out so badly.  Please feel free to contact me if you are interested in seeing them. ((NUFORC Note:  E-address provided by witness is defective.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116902.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3607",
      "summary": "Bright light small explosion or crack then turned red and didappeared",
      "city": "oakland",
      "shape": "fireball",
      "date": "2015-02-06T00:00:00",
      "story": "Bright light small explosion or crack, then turned red and didappeared. Bright light going straight down then turning red by the tail right before disappearing.  Viewed from Jack London square",
      "link": "http://www.nuforc.org/webreports/117/S117075.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c38b4",
      "summary": "Saw what I thought to be a blimp in the sky. It actually reminded me if the H(L? ) helium blimp at first. I was facing the sith western",
      "city": "oakland",
      "shape": "oval",
      "date": "2015-01-07T00:00:00",
      "story": "Saw what I thought to be a blimp in the sky.  It actually reminded me if the H(L? ) helium blimp at first.  I was facing the sith western sky when this happened.   It floated for a few seconds which made me think it was some sort of helicopter, with the sun reflecting a bright orange reflection off it.   When it started moving up down left and right with ease and fluidity, I knee it could not be eirg.",
      "link": "http://www.nuforc.org/webreports/116/S116448.html",
      "state": "CA",
      "duration": "2.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c38d0",
      "summary": "Bright orange sphere seen over Oakland, CA",
      "city": "oakland",
      "shape": "sphere",
      "date": "2015-01-09T00:00:00",
      "story": "Bright Orange sphere seen over Oakland, CA. It was about 17:15 in the evening of January 1st, 2015.  I was walking west down my street in Oakland, CA.  The sun had just set behind the buildings in front of me but there was still a lot of light outside.   I noticed in the sky something that was bright orange, almost fire like.  I thought it was a blimp, but it moved differently.  Its movement was fluid, not jerky, and it seemed to move around in all directions with great ease.  At one point It must have turned in an orbit, like a planet turns, because it seemed like the orange glow was a reflection of the sun off a silver looking sphere in the sky.   I took my phone out, took a picture, and then started recording it.  I recorded for about two minutes until it dissapeared.  The video goes blurry because the autofocus was on.   Initially when I saw the object, it seemed to hover at the hight of what planes fly at, but within two minutes it was so much higher.   Here is the link to the video:  http://youtu.be/YIfWstTjGkQ ((NUFORC Note:  We spoke with the woman who submitted the report, and she seemed to us to be quite eloquent and sober-minded.  Because of the nature of her employment, we suspect that she is a very good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116558.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c437c",
      "summary": "Bright light that later appeared to be more like a rocket over the bay area; enormous chemtrail.  ((NUFORC Note:  Rocket launch.  PD))",
      "city": "oakland",
      "shape": "fireball",
      "date": "2015-11-19T00:00:00",
      "story": "bright light that later appeared to be more like a rocket over the bay area with an enormous chem trail that was bell shaped my husband saw a bright light with an enormous bell shaped chem trail in the sky.  I saw the chem trail from east heading west towards the Pacific Ocean.  Far above the vapor was a rocket like craft thousands of feet up.  It went at a 45 degree angle towards the west above the bay area from the east heading west towards the pacific ocean. the bell shaped vapor was huge and smaller vapors were above it. when I saw it, I did not see the bright light.  he thought it was a helicopter at first with a search light.  But, when I looked, it clearly seemed more like a rocket going up into the atmosphere and he agreed with me at that point in time that that is what it looked like.  We don't have a camera or iPhone to photograph it. ((NUFORC Note:  U. S. Navy ICBM launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123647.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c48b7",
      "summary": "Extreme light.  Huge smoke trail  behind object.  Light suddenly vanished. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "oakland",
      "shape": "",
      "date": "2015-11-12T00:00:00",
      "story": "Extreme light.  Huge smoke trail  behind object.  Light suddenly vanished, as it hit upper atmosphere. ((NUFORC Note:  News media report a test launch of an ICBM missile from the U. S. Navy USS Kentucky submarine.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123644.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c54c2",
      "summary": "15 min bright light that tried to break apart vanished when airplane approached and light has been seen multiple times.",
      "city": "oakland",
      "shape": "light",
      "date": "2015-12-17T00:00:00",
      "story": "15 min bright light that tried to break apart vanished when airplane approached and light has been seen multiple times. Saw a stationary light to the south.  Almost looked like it was trying to break into smaller lights. An airplane went into the same vicinity and when it got close the light just vanished and never came back.  What we thought was a star just disappeared and I know stars don't do that.  It never came back.  We have been seeing a.strange light everyday at dusk.",
      "link": "http://www.nuforc.org/webreports/124/S124710.html",
      "state": "KY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5638",
      "summary": "Orange orb, silently crossed sky over Oakland, NJ, wsw to ene.",
      "city": "oakland",
      "shape": "circle",
      "date": "2016-07-22T00:00:00",
      "story": "orange orb, silently crossed sky over Oakland, NJ, wsw to ene I saw an orange light.  high in the sky, it moved slowly acrossed the sky from wsw to ene  it made no sound, it was bigger than any airplane light, and disappeared over the horizon of trees by my house",
      "link": "http://www.nuforc.org/webreports/128/S128518.html",
      "state": "NJ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c60da",
      "summary": "Flashing lights in triangle form above I-80 in Oakland.",
      "city": "oakland",
      "shape": "triangle",
      "date": "2016-09-30T00:00:00",
      "story": "Flashing lights in triangle form above I-80 in Oakland. Flashing lights in triangle form above I-80 in Oakland.",
      "link": "http://www.nuforc.org/webreports/130/S130167.html",
      "state": "CA",
      "duration": "don't know"
    },
    {
      "_id": "64d005f478aba2ec5a3c6386",
      "summary": "Woke up in a field that is impossible to get to.",
      "city": "oakland",
      "shape": "",
      "date": "2016-08-25T00:00:00",
      "story": "Woke up in a field that is impossible to get to. Ok so.  I fell asleep in my car on sycamore and west st in Oakland ca ...  At around 10 pm . I awoke at 6 am roughly in a field up by grizzly peak which is a few miles away in a park I e never been too.  I had no shoes or socks on my feet.  I woke up laying on my back with my arms spred  out to my sides .  I was in a huge field full of tall weeds . There was no trail to where I was .  My feet were clean along with the rest of me .  Than I started to walk back .  As I got up to the road I looked back to see a definite trail where I had walked only one.  By the time I just got up to the road I was covered in burles and weeds (so I have no idea about how any of it happened but especially how I could have got to the middle of the field and be totally clean) by the time I walked back to my car a few hours later my feet were destroyed.  I have NEVER SLEPT WALKED BEFORE and even if I did for some insane reason there's NO WAY I could have made it there without being cove! red in weeds and had bloody feet .  This has bothered me so much lately I have no memory of anything but when I think about it my heart starts racing like ALOT so I have to sit down and recompose ... This is the strangest thing to ever happen to me.   When I got back to my car all my things were locked inside including my keys my shoes and socks were there as well even tho when I went to sleep they were on my feet ...  If u have any idea what I should do about this PLEASE HELP ME  I have lost a lot of sleep over this I'm scared to fall asleep now and I'm a 29 year old man ..  Have you ever herd of something like this before ??  Also I had strange marks on my hand that r still  visible..  Like a scar ... Sooo strange and very scary I just gotta find out how this happened it's destroying me . ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128962.html",
      "state": "CA",
      "duration": "Unsure"
    },
    {
      "_id": "64d005f478aba2ec5a3c73e6",
      "summary": "It glowed blue for 3 seconds and dragged a line of light and then disappeared.  ((anonymous report))",
      "city": "oakland",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "It glowed blue for 3 seconds and dragged a line of light and then disappeared. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134161.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c73e7",
      "summary": "It glowed blue for 3 seconds, and dragged a line of light, and then disappeared.  ((anonymous report))",
      "city": "oakland",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "It glowed blue for 3 seconds, and dragged a line of light, and then disappeared. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134346.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7849",
      "summary": "Me my wife and children see a very bright light in the Southern sky that hovered for a couple minutes. Then all of the sudden it flew o",
      "city": "oakland",
      "shape": "circle",
      "date": "2018-01-12T00:00:00",
      "story": "Me my wife and children see a very bright light in the Southern sky that hovered for a couple minutes.  Then all of the sudden it flew off very fast, faster than any plane or helicopter.",
      "link": "http://www.nuforc.org/webreports/138/S138345.html",
      "state": "NB",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7eae",
      "summary": "Was it a UFO?  Was it alien? I don't know but it was crazy weird.",
      "city": "oakland",
      "shape": "light",
      "date": "2018-05-10T00:00:00",
      "story": "Was it a UFO?  Was it alien?  I don't know but it was crazy weird. This evening, we were watching stars, and planes flying overhead, from our deck.  We then saw a bright orange light coming from the southwest direction.  It was constant and not flashing; it did, however, have streaks or lines of light arcing from the top and bottom.  It was very bright and seemed large given the distance and the amount of light.  It did not fly in a straight path as several times it seemed to \"wobble\" side to side before continuing forward.   After approximately 15-20 seconds of this the light seemed to waiver back and forth then suddenly disappeared completely.  We took photos and video but given that it was with a cell phone they are terrible quality.",
      "link": "http://www.nuforc.org/webreports/139/S139729.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c87a5",
      "summary": "Viewed a star-like object higher than a plane would fly, flanked by 6 less-bright 'stars' of light traveling around it.",
      "city": "oakland",
      "shape": "formation",
      "date": "2018-07-13T00:00:00",
      "story": "Viewed a star-like object higher than a plane would fly, flanked by 6 less-bright 'stars' of light traveling around it. i was blowing bubbles with my son around 7:45 pm tonight and looked up and saw a light that appeared too high to be an airplane.  i thought perhaps it was a planet as it was glowing brightly.  I could tell it was moving, but quite slowly and could make out six less bright lights glowing around it.   They were traveling southeast all in tandem, though the six lesser lights seemed to move slightly as well, but all seemed to be traveling around the main star.   I called my partner to see it and he confirmed and saw it too.  i cannot say for certain it was a ufo, but it certainly was unlike anything I've ever seen in the sky.",
      "link": "http://www.nuforc.org/webreports/142/S142152.html",
      "state": "CA",
      "duration": "~25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8c79",
      "summary": "Two strange lights in the South Eastern sky in S.F. Oakland bay area.",
      "city": "oakland",
      "shape": "light",
      "date": "2019-02-01T00:00:00",
      "story": "Two strange lights in the South Eastern sky in S.F. Oakland Bay Area. Today 1/24/2019, at approximately (18:49) 6:49PM -8 GMT, I was outside observing the night sky as I often do, I noticed two bright objects that were out of place in the constellation Orion.  They shimmered from orange to bright white.  Orion was rising in the south eastern sky and these objects were flying in a wedge formation just below the feet of Orion.  \"There shouldn't be anything that bright there!\"  I thought to myself.  The objects were more luminous then our brightest star Sirius I also thought which drew my attention to them in the first place.  The lead object was even more so then the trailer.  This viewing lasted approximately ten seconds.  The first object slowly dimmed out of sight still high in the sky, I'd say 30 degrees from the horizon. Then the other about one to two seconds later.  The movement seems to give me an indication to altitude in my opinion.  I view the night sky almost on a daily basis and have seen many things such as satellite's, meteors, high flying military and passenger aircraft.  I cannot say what they were or were not. I can only say THESE LIGHTS WERE VERY STRANGE INDEED!  If anyone else in the San Francisco/Oakland California bay area happened be out at (18:49) 6:49PM observing the south eastern sky and saw this event please don't be afraid to speak up.  I almost didn't want to say anything due to the stigma that go's with \"U.F.O.'s however we all do need to know what's flying above our heads. Special thanks for the encouraging words to and that you do for the truth, Peter Davenport",
      "link": "http://www.nuforc.org/webreports/144/S144650.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d5a",
      "summary": "Cylindrical light",
      "city": "oakland",
      "shape": "cylinder",
      "date": "2019-01-11T00:00:00",
      "story": "During flight Hawaiian Airlines from Honolulu flight #HA 48 Thursday Dec 29th object appeared during flight descent around 9:10 pm. Of the right wing, a cylindrical light object rose quickly in diagonal direction above Oakland and surrounding city then hovered for 5 mins or more.  It rose and moved in a projection that was unusual in how quickly it turned and ascended diagonally.  It then hovered in one spot for over 5 minutes.  Our plane turned into descent and we lost sight of it.",
      "link": "http://www.nuforc.org/webreports/144/S144340.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d71",
      "summary": "Orb like shape changing light remaining at speed and altitude of plane 30 mins before landing.",
      "city": "oakland",
      "shape": "light",
      "date": "2019-01-17T00:00:00",
      "story": "Orb like shape changing light remaining at speed and altitude of plane 30 mins before landing LOCATION: on a plane heading in Oakland CA, had to be 30 mins before landing. .WITNESS: not only person who saw it, the person in front of me saw it and also took pictures. SIGHTING: looked out the window because the person in front of me thought they saw something strange.  There was an orb of light following the plane out of the right side a decent distance from the wing.  It was level with the plane and we were still at an altitude that wHere no man-made object was build as well as being over unoccupied land.  it stayed generally the same distance for the 13 minutes it remained with the plane and changed altitude and shape once or twice. we went through a few clouds and it followed, we went through one big cloud and it was gone. THOUGHTS: thought it was strange and went quickly went through what it could be but nothing made sense. could not have been a star bc it was not at the right location. could not have been a building bc there was none and it remained at a high altitude and stayed with a plane going at least 300 mph. was not light from the plane because it was white and did not blink.  It was not a mechanical light. REACTION: thought it was cool and made me think of doc Australian skies. thinking of that as I watched it I made some notes and took a few pictures.",
      "link": "http://www.nuforc.org/webreports/144/S144501.html",
      "state": "CA",
      "duration": "13 Mins"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d81",
      "summary": "It was an orange circle with a bright white light on the bottom interior And was 30 to 50 feet in diameter. ((anonymous report))",
      "city": "oakland",
      "shape": "circle",
      "date": "2019-01-24T00:00:00",
      "story": "It was an orange circle with a bright white light on the bottom interior.  And was 30 to 50 feet in diameter. It was north of my home and low with no sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144634.html",
      "state": "TN",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c919d",
      "summary": "Appear to be a star moving as fast a stealth without noise.  I pointed to the object an it slowed then disappeared.",
      "city": "oakland",
      "shape": "diamond",
      "date": "2019-12-01T00:00:00",
      "story": "Appear to be a star moving as fast a stealth without noise.  I pointed to the object an it slowed then disappeared.",
      "link": "http://www.nuforc.org/webreports/149/S149734.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9163",
      "summary": "So it was the night of the 5th I was getting ready to go to the store and I was looking at the sky cuz you was very clear that night an",
      "city": "oakland",
      "shape": "diamond",
      "date": "2019-12-01T00:00:00",
      "story": "So it was the night of the 5th.  I was getting ready to go to the store and I was looking at the sky cuz you was very clear that night and I just so happen to see a shooting star and I was wowed I've never seen a shooting star before I think I'm seeing things move but not anything that close-up I actually saw it fits out or whatever that close to me and then shortly after that I'm looking up and I see something that appears to be a star but it's moving across the sky like it was almost like a shooting star happen and then directly from the place where a phased out as I'm looking into something that appears to be like a star and going across the sky in about 2-3 minutes I watched it go all the way towards Emeryville and the sky was it passed under stars and it look just like a star but starts don't move that way so it's been kind of messing with me for a couple of days it's very playing over and over my head so I thought that I was just say something about it",
      "link": "http://www.nuforc.org/webreports/149/S149567.html",
      "state": "CA",
      "duration": "2-3 minutes"
    }
  ]
}