{
  "city": "oklahomacity",
  "fetch_timestamp": "2025-07-12T14:26:03.201682",
  "record_count": 103,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b42a2",
      "summary": "Dark shiny cylinder",
      "city": "oklahomacity",
      "shape": "changing",
      "date": "2006-05-15T00:00:00",
      "story": "Dark shiny cylinder I was at work on the afternoon of May 28th 2004 when I noticed out the window that a worker across the street was outside looking north into the sky.   I looked and observed (I know this sounds crazy) a blurry object the shape of a yoyo.  The outer parts were dark with the inner part being lighter.  This object was motionless.  It then came into focus as it rotated and became a long shiny dark cylindrical shape.   I ran outside to get a better look.  It took me less than 5 seconds to get outside, but by that time it had vanished.  The worker across the street said it had come rapidly from the east to the point were it became motionless.  It was not a balloon, a helicopter or a plane.   To this day I still cannot quit thinking about what it might have been.",
      "link": "http://www.nuforc.org/webreports/050/S50033.html",
      "state": "OK",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b4468",
      "summary": "Two hovering orange circles drop third orange circle over oklahoma.",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "Two hovering orange circles drop third orange circle over oklahoma. My girlfriend and i were driving home when both of us noticed three \"planes\" within a mile of each other directly north of our location. We both have an interest for all thing abnormal and interesting so we kept our eyes on them hoping. One of the objects did turn out to be a plane and veered off from the location while the other two orange lights remained, hovering in the air. We stopped on a very slow overpass to watch further because they had been hovering in the same place for well over a minute. We watched as one of the lights began to get brighter and brighter and slowly drifted around in mostly the same place, it just sort of floated. The second object began to slowly fade out until it was no longer visible. Just as we were fixing to start the car and leave (she had to be home by 22:30) the one still hovering seemed to have a new seperate ship drop from its side. The first ship then began to lower until it was no longer visible over the city lights and trees. After it was gone the new ship began to glow brighter and brighter just as the first did. We watched this ship hover in place for around 2 minutes until it finally began to lower and dissapeared just as the first had. All three ships were orange/yellow in color similiar to the color of a street light. They were circular and generally had very little movement probably only travelling back and forth within a miles radius. They did have some horizontal movement but like i said they always stayed within a mile of where we first sighted them. The sighting occured in Oklahoma city, OK. I have contacted the news to see if anyone else noticed them last nite. The only thing that i can possibly think of to debunk what i saw is that the location i saw them is about 45 miles west of tinker air force base which has been known to test new planes, but even still i highly doubt they would of been testing anything like what we saw.",
      "link": "http://www.nuforc.org/webreports/049/S49992.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4838",
      "summary": "I was on S. Miller Ave. and S.W.61st St. walking north .The UFO heading West towa..rd Will Rodgers World Airport. I heard a helicopter,",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2019-08-23T00:00:00",
      "story": "I was on S. Miller Ave. and S.W.61st St. walking north.  The UFO heading West toward Will Rogers World Airport.  I heard a helicopter, so I looked up .  When I did I saw that the helicopter was flying higher than they usually do.  I noticed a flash go past the helicopter. That's when I saw a ball or sphere.  They were going in opposite directions.  Like if to be playing a game of chicken.  As it passed, the sphere looked to be close enough to gauge a measurement.  From what I could guess it looked to be half the size or just a tad smaller than that to the cab of the helicopter.  This is your standard size the police and news use.  I watched as the helicopter would fly in a circle keeping up with but keeping a far distance . Huge circles what might be 2 mile circles. stay high really high up.  The sphere was fling slow and it seemed to spin.  I say that because the sun would reflect off of it in increments.",
      "link": "http://www.nuforc.org/webreports/148/S148273.html",
      "state": "OK",
      "duration": "00:02"
    },
    {
      "_id": "64d005f478aba2ec5a3b4dad",
      "summary": "Black oval object in sky flashing blue lights that \"winked-out\" followed by a circling jet and then three helicopters.",
      "city": "oklahomacity",
      "shape": "oval",
      "date": "2019-04-25T00:00:00",
      "story": "Black oval object in sky flashing blue lights that \"winked-out\" followed by a circling jet and then three helicopters. My son and I were playing tennis at Memorial Park (1150 NW 36th St, Oklahoma City, OK 73118) on April 19th, 2019.  It is an azure blue, cloudless sky with light north winds and was approximately 67 degrees Fahrenheit.  My son was on the south side of the court facing north and I was on the north side facing south, and the sun is directly to the west of us at about 60 degrees.  I’ve included a Google Earth Map image of our line-of-sight (UAP-1.png). Off to my left side (southeast) in the background right above the tree line at about 40 degrees (the tree line is roughly 250-300 feet from us), I see a bright blue flash and look in that direction (UAP-2.png).  My first thought is that someone let go of a blue Mylar helium balloon, and that I’m seeing the sun’s light reflecting off the surface.  I point at it and tell my son exactly that.  It moves from east to west (left to right from my viewpoint) and passed behind the trees so he doesn’t see it at first.  He backs up to the net as I move up to it and point in the direction.  I tell him it’s about to pop up from behind the tree and it does.  Only this time it has moved closer (at about 45 degrees) and is a black oval with two intermittent synced blue flashing lights on either side.  It stops moving in the sky (UAP-3.png).  Movement from point to point was approximately 12 seconds. So now we think we are looking at a drone, but it is really way up in the sky, and doesn’t have aircraft navigation lights of red and green, just the dark, but bright blue similar in color to Dell computer system lights.  The blue is darker than the blue sky but also brighter than the sky when they flash.  It stops directly above the trees (but not actually above the tree because it is obviously way in the background behind it). Then it flashes brighter than any of the other times and it winks out and disappears (UAP-4.png).  My son says, “Where did it go?” Puzzled by how a drone could just disappear, I pull out my phone and note the time.  It’s 5:37 PM CST.  We continue searching the sky for about another twenty seconds.  Granted, from the time I saw the first flash and it disappeared was only about thirty seconds.  So almost a full minute from the first sighting, at 5:38 PM CST, a jet races from the east to west on about the same plane as the object and makes a bank toward us going north and flies a loop right around where the object disappeared so that it ended up flying back to the east in the same direction it had come from.  The plane was high enough that I could not make out what it was or how many engines it had.  It was too fast for a prop plane.  The plane itself actually gave us perspective the size of the oval.  At first when we thought it was a drone, I was thinking that it was two or three feet across.  However, after seeing the jet in the same place in the sky, the oval had to be the size of a car because it was s! lightly smaller than the jet.  The jet leaves the same way it came (UAP-5.png). We realize that with all the people at the park playing tennis and basketball around us, we are the only ones to witness this in the sky.  We keep watching the sky to the southeast.  At 5:43 PM CST, directly behind us coming from the northwest, a low flying red with white trim helicopter (300 or 400 hundred feet above us) races overhead in the same direction as where the oval disappeared (UAP-6.png).  It moved so fast that it cleared us and was gone in about three seconds.  Fast enough that we could not make out what was written on it.  The only two helicopters that I’m familiar with in this area that are that color are a news channel helicopter and the med-flight helicopters used by hospitals. At 5:51 PM CST, a second helicopter, one farther west of us, also flies to the southeast in the direction where the oval disappeared.  This one is the KFOR Channel 4 News helicopter.  I can read it clearly on the side and it takes about ten seconds for it to come into view and cross the sky out of view heading southeast. At 5:55 PM CST, a third helicopter, this one’s way farther east of us and heads to the southeast in the same direction as the others.  This one is black with red trim, but is too far away to make out who it belongs to. As each incident occurred, I noted the time, descriptions, and directions.  I did not get any photographs as everything happened so quickly, but I logged it all in my phone to refer back to later.  It could be completely coincidence and that none of this is connected.  I could not find out any info regarding why these choppers were heading where they were going.  There was no stormy weather for storm chasing. I have included drawings where I have recreated to the best of my knowledge keeping the proportions as close as I remember them to be. The resolution is high enough that you can zoom in on the areas and see the details and colorings of the object. As a side note, Tinker Air Force Base is in Midwest City and in the vicinity southeast of Memorial Park in Oklahoma City about 15 miles away.  My guess is that what we saw was even farther south than the military base.  Will Rogers Airport is in Oklahoma City and is southwest of Memorial Park by ten or so miles.  Having said that, we are used to seeing all kinds of planes coming and going all the time, and even the occasional drone.  I don’t know what this was.  I’m not calling this a UFO, through it certainly is an UAP to me.",
      "link": "http://www.nuforc.org/webreports/145/S145759.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4dac",
      "summary": "Black oval object in sky flashing blue lights that \"winked-out\" followed by a circling jet and then three helicopters.",
      "city": "oklahomacity",
      "shape": "oval",
      "date": "2019-04-25T00:00:00",
      "story": "Black oval object in sky flashing blue lights that \"winked-out\" followed by a circling jet and then three helicopters. On April 19th my dad and I witnessed a possible UFO in the sky.  My dad and I went to go play tennis and arrived at a park with several tennis courts at 5:00.  We played until my dad pointed out a shape in the sky.  He told me to come over and look up.  I looked and saw a black oval.  My dad thought it was a balloon until it started blinking blue.  We then thought it was a drone hovering in the air.  It stayed in place for a little until I looked away for a second and it was gone. My dad said he saw the “drone” give a big flash of blue light and disappeared.  We started speculating to what we witnessed.  We thought the idea of a drone flying away really fast in a split second was unrealistic. \tLater a jet flies overhead towards where the “drone” was.  For the next several minutes helicopters fly in the same direction.  A news helicopter, a red helicopter with white letters, and a red and black one all fly by in that direction.  After that nothing else happened, but left a lot of speculation of what we witnessed.",
      "link": "http://www.nuforc.org/webreports/145/S145757.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5364",
      "summary": "Large object moving West to East (light bars) with blury darkness around them.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Large object moving West to East (light bars) with blury darkness around them. June 27, 2006 at 10:40 I was in my back yard smoking (facing South). I looked up at the sky and noticed a light to my(right) West. At first I thought it was just a flash of light in my eyes. I blinked a few times. I followed the obeject as it moved from West to east for about 4 seconds. The lights were dim but obvious. I would estimate that it was 4 to 5 miles high(based on the dimness of the lights). The size of the object would be about the size of a pencil if held out at arms length.  There was no blinking of the light and the light ran the entire length of the object.  The object was blurry. My reaction was WTF???? as I watched it disapear into the glow of the City lights in the East.  I live between Tinker AFB and the Oklahoma City airport and am used to seeing all types of aircraft going by, to include blimps and helicopters. This was NOT a normal aircraft.  I am submiting an animated gif of what I saw. I created this using photoshop. The Animation recreates what I saw fairly good except for how high the object seemed to be. The size and speed and brightness are pretty accurate.  My animation:   http://www.freewebs.com/mikebo2/Music/Animation%20What%20I%20saw.gif   I reported this to MUFON and they did a follow up \"phone-interview\".  I later created this animation and wished to share it in hopes of finding anyone else who has witnessed the same or simular phenominon.  Thank You for your help",
      "link": "http://www.nuforc.org/webreports/051/S51826.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b59e3",
      "summary": "Two UFOs spotted in Oklahoma City",
      "city": "oklahomacity",
      "shape": "cigar",
      "date": "2006-10-30T00:00:00",
      "story": "Two UFOs spotted in Oklahoma City I saw two objects traveling in what appeared to be formation. They were whitish in appearance, not shiny or bright white. There was no sound and no contrails. They were moving slowly from SSE to NNW. After viewing them for about 20 seconds I ran to get my husband (who is an aeronautical engineer) to see them, by the time we returned only one was visible and it was soon obscured by trees, I believe the other one was already obscured by the time I got my husband out there, he was not able to locate the last one before it disappeared into the trees. There were large cloud formations all around and the ground temp indicated by my thermometer was about 97 degrees. There was no wind. Obviously I have no idea of the altitude of these craft. I would also like to say that I worked for the Air Force for 27 years and I know an airplane when I see one, these were not airplanes!",
      "link": "http://www.nuforc.org/webreports/051/S51903.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b59c5",
      "summary": "UFO sighting in Summer of 1963 or 1964 in Oklahoma City",
      "city": "oklahomacity",
      "shape": "light",
      "date": "",
      "story": "UFO sighting in summer of 1963 or 1964 in Oklahoma City. I was at the Lakeside Country Club Teen Dance on a weekend during the Summer of 1963 or 1964, located off Portland and 63rd street on Oklahoma City.  The dance was held outdoors around the swimming pool area. About 10:00 p.m., the band stopped playing and everyone gathered around the pool, looking at these strange lights hanging in the Northern sky.  There were about 4 or 5 of the white cicular lights hovering in the sky but not moving.  Everyone tried to reason what they could have been, but no one has an explanation for them.  Alcohol was not allowed on the premise. Most of the kids (150 or so) were from Casady, John Marshall and Putnam City High Schools. This sighting was the talk of the schools for serval weeks.  I have always believed to this day they were UFOs and still do. What prompts me to report it now is the news yesterday the ex-governor's UFO sighting in Phoenix and the French releasing their UFO information.  What the ex governor saw is exactly what I saw. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55871.html",
      "state": "OK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b96",
      "summary": "Spider webs fall from sky",
      "city": "oklahomacity",
      "shape": "unknown",
      "date": "2007-11-28T00:00:00",
      "story": "Spider webs fall from sky I went out side at approximately 3:00 pm today and notice spider webs falling from the sky.  My little boy who attends a school close by also noticed them during lunch recess.  The spider webs ranged from small clumps to long strangs about 30 feets long.  They seem to be carried thru the air for many hours, and covered telephone polls and other vertical objects.",
      "link": "http://www.nuforc.org/webreports/059/S59165.html",
      "state": "OK",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e30",
      "summary": "Triangular light formation suspended high in air",
      "city": "oklahomacity",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "Triangular light formation suspended high in air Shortly after 6:00 AM, sometime in September of 2006, I was heading east on my way to work along I-40, just north of \"Stockyards City\" where I-40 turns northeast for a ways before heading back east. I noticed a formation of lights suspended at what I estimated to be a couple hundred yards to a half mile off the ground, about 50~100 yards north of the highway.  I no longer am positive about the exact pattern or number of lights, but what I do remember is either a cluster of three white lights forming a close triangular at what I took to be the tip of the triangle at the east, or else a single white light at the east--either way I took that to be the front of the craft. At what I took to be the rear--the west end--were a row of about five lights, lined north-to-south. They were not uniform in size or shape, that is, three or four were red, with one of these beings smaller than the others, and one other of these lights was white--I don't remember its relative size. Between these two \"ends\" of the object were other lights, reddish or even a little orange; two or three of them, a little smaller than most of the lights at the rear. As an electrician, I noticed that the quality or type of light emitted from all of these lights did not seem the least bit unearthly; they were certainly not flourescent, a little brighter than what one might expect from normal incandescent bulbs, more like the intensity and quality of shine that one sees with halogen lights.  I was navigating the east-to-northeast curve in the highway while looking at this thing, trying to both stay in my lane and make out an outline of the object. I was not able to see a solid shape--just the pattern of the lights. I told my friend, sleeping in the passenger's seat, to look but he was groggy and not awake enough to understand until we were well past the spot. He did not see anything, and went back to sleep.  I have seen airplanes fly parallel to I-40 on their way west to land at Will Rogers Airport. But (a) they fly much higher than the thing which I saw, (b) their lights flash, this's did not, (c) they speed past even at their higher altitudes fast enough to recognize their movement from my truck, this thing was clearly stationary, (d) the pattern and number of lights did not match what I am familiar with from conventional aircraft--for example, the two or three lights I saw in the middle were spread too far apart north-to-south for this craft to have had a standard airplane shape. (e) from the intensity of the light, it was clear that this thing was far lower than any airplanes. (Again, the lights were neither flashing nor moving, and I noticed dust particles floating through the lightbeams immediately below the sources of light.)  While I don't doubt that advanced civilizations may exist which could travel here from their own worlds, I also don't necessarily ascribe what I saw to otherworldly technology. Maybe it was a test flight of some fancy new  military plane from the local Tinker Airforce Base. I don't know. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54235.html",
      "state": "OK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b68a9",
      "summary": "A bright white light flashed in the sky, and a dark object flew away from where the light source had been.",
      "city": "oklahomacity",
      "shape": "flash",
      "date": "2007-02-01T00:00:00",
      "story": "A bright white light flashed in the sky, and a dark object flew away from where the light source had been. There was a bright flash of white light, low in the sky. I saw it between a tree and at first I thought it was the moon untill it went away. When I looked where it had been there was a black shape moving in the sky. It was oval shaped with bottom portion hanging down like a fin.",
      "link": "http://www.nuforc.org/webreports/054/S54166.html",
      "state": "OK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6dbd",
      "summary": "My daughter and me both saw a couple of flashed that coincided with the transit of the space station.",
      "city": "oklahomacity",
      "shape": "flash",
      "date": "2008-02-14T00:00:00",
      "story": "My daughter and me both saw a couple of flashed that coincided with the transit of the space station. We were on the north side of Oklahoma City at 7:30 on the night of the 30th of January.  My daughter and me were out in order to watch the transit of the space station.  The Space Station was due to pass by on the north at about 7:30pm that night.  We waited until the space station came by.  As the space station approached from the West and just as the station passed due north we both noticed a bright flash at about the same level as the space station.  Then we noticed another flash at the level below the space station.  This happened just as the space station approached due north of our location.  Just after the second flash, the space station disapeared behind the earths shadow as the Sun was at 20 degrees below the horizon at this time.",
      "link": "http://www.nuforc.org/webreports/061/S61332.html",
      "state": "OK",
      "duration": "3 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f81",
      "summary": "stationary red light viewed over Oklahoma City, Oklahoma.  ((NUFORC Note:  Possible sighting of Sirius, possibly?  PD))",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2008-03-04T00:00:00",
      "story": "stationary red light viewed over Oklahoma City, Oklahoma At approximately 8:30 PM CST on 2/19/08, my daughter telephoned to say that she, her children and her husband were outside watching a strange object in the sky. She stated that the object was round and had a red light circling the object and a had a red light located underneath the object blinking off and on. She stated that they had watched the object stay in a stationary position in the sky for approximately 30 minutes. We discussed the various possibilities, including a helicopter, airplane, balloon, etc. All these possible explanations were rejected by my daughter and her husband. The object was about the height of an airplane coming in for a landing. The possibility of a balloon was rejected because the object started moving in a northerly direction (against the wind) and then moved back into the original position. She asked if I could see the object and when I looked out my window, there it was! I watched it also and we continued to speculate about it. It then started moving North again and then disappeared. We were wondering if anyone else in Oklahoma City saw this object and reported it. ((NUFORC Note:  Possible sighting of Sirius, possibly?  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61725.html",
      "state": "OK",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b747d",
      "summary": "Group of orange glowing lights, flying and darting around in the sky, yet staying together in a group",
      "city": "oklahomacity",
      "shape": "formation",
      "date": "2008-01-21T00:00:00",
      "story": "Group of orange glowing lights, flying and darting around in the sky, yet staying together in a group Seen around 5:15 pm Oklahoma City, OK.  Just got off work, was walking torwards my car and happened to look up at the sky.  What I saw was 15-20 tiny pin dots in the sky flying around together in a group or cluster.  They seemed to be alluminated by something and were a glowing orange/red color.  They were very high in the sky.  Flying around similar to the way a group of birds would.  But there is no way they were birds because they were too high in the sky to be able to be seen.  I know these objects were extremely high in the sky because an airplane flew over head about 60 seconds after they were gone and it was about the same distance up, (maybe a little lower) and was much larger.  Whatever I saw must have been large in size to be able to be seen at this altitude.  After realizing that I might be a witnessing an UFO, I decided to watch one of the objects flying around.  So I focused on one of them....it did a few zig zags and loops and then completely vanished.  So, I decided to get someone to witness what I was seeing.  I went back into the building and found a colleage of mine, and brought them out to see what I had seen.  When I looked up, there was nothing in the sky.  Absolutely nothing, whatever I had seen was gone.  It did not take me more that 15-20 seconds to find my work colleage. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61003.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b76b1",
      "summary": "Oval-shaped white object flew across north Oklahoma City and disappeared. Helicopter appeared to look for it seconds after it vanished.",
      "city": "oklahomacity",
      "shape": "rectangle",
      "date": "2007-08-07T00:00:00",
      "story": "Oval-shaped white object flew across north Oklahoma City and disappeared.  Helicopter appeared to look for it seconds after it vanished. Hello, Was idly staring out my fifth-floor window overlooking downtown Oklahoma City looking north when a white object that appeared to be round was zipping across the city from west to east.  It went behind an apartment building and emerged on the other side and then disappeared in front of a cloud. Then, about 15 seconds later, I see a black-colored helicopter come in from the east and stop at the very spot where this object had vanished. It hovered there for about 20 seconds and then went back east and out of my line of vision. One thing about this object is that it seemed to be revolving on its axis, because it would go white and gray and white again. Very strange. I would add that two days earlier, around the same time, I was 20 miles south in Norman, Oklahoma having lunch with my father-in-law, when I saw a bright object of similar size traveling in much the same fashion.  The difference was is that it seemed to leave a short \"exhaust\" trail or something behind it before disappearing in front of a cloud. I should also note that Tinker AFB is not far away from both sighting locations.",
      "link": "http://www.nuforc.org/webreports/057/S57869.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b78f6",
      "summary": "Orange \"V\" shaped lights fly overhead without making a sound.",
      "city": "oklahomacity",
      "shape": "triangle",
      "date": "2007-08-14T00:00:00",
      "story": "Orange \"V\" shaped lights fly overhead without making a sound. On August 14, 2007, my son and I went outside to watch the meteor shower.  We live in an apartment complex, and the surrounding lights in the complex were too overbearing to view the meteor shower.  We then walked to the street where there is no ambient light.  I was looking North-East in the direction that the meteor shower was supposed to appear.  Suddenly I saw a meteor.  My son did not see the meteor.  I directed my son in the direction that the meteor was in.  Almost immediately, we both saw this set of orange lights fly over head from North-East to South-West.  It sort of resembled 7 orange birds flying in a “V” formation.  The object made absolutely no sound!  We didn’t see it coming over the horizon, it just appeared.  Almost like the lights just came on.  We tried to follow it, but it disappeared over the South-West horizon.  But it was again almost like the lights just turned off.  Maybe you have to be directly under the object to see the lights.  I’ve seen many pictures of this type of craft before, but never in my life did I think I would actually see it myself.  It scared my son pretty bad, so we went inside and did not watch any more of the meteor shower.  I'm sure that if someone else was watching the shower that they too would have seen this craft.  Having my son with me confirmed that I was not out of my mind.",
      "link": "http://www.nuforc.org/webreports/058/S58165.html",
      "state": "OK",
      "duration": "10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a19",
      "summary": "zig-zagging red light in the clear night sky",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "zig-zagging red light in the clear night sky My wife looked outside a south-facing window that was facing SSE into Oklahoma City.  She saw a moving red light that moved east to west across the clear night sky.   At about 30 degrees up from the ground, the red colored-light appeared to zig-zag.   There was an unusual amount of helicopter and large aircraft traffic in the area at that time.",
      "link": "http://www.nuforc.org/webreports/054/S54954.html",
      "state": "OK",
      "duration": "120 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a25",
      "summary": "Two OKLAHOMA UFO sightings",
      "city": "oklahomacity",
      "shape": "changing",
      "date": "2007-04-27T00:00:00",
      "story": "Two OKLAHOMA UFO sightings It was late in the evening (out in my backyard), the sun had almost finished setting. There were two objects in the sky apart from each other.  One was moving slightly, for the remainder of the report this one shall be called:A.  The other one shall be called: B.  A was moving slightly, in a circle. B stayed still but it changed shape.  B was like a half-moon at first, but later it looked like two objects and it started moving slightly.  Both objects remained in this manner.  Both were bright. The other 3 witnesses (besides myself) were in a backyard, around the same area. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56341.html",
      "state": "OK",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b7cf2",
      "summary": "A bright stationary light similiar to Venus that lasted about 5 seconds, then disapeared as if behind clouds.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "A bright stationary light similiar to Venus that lasted about 5 seconds, then disapeared as if behind clouds. A bright light was seen on the north side of Oklahoma City at about 6:45 in the morning.  The Sun was coming up, but it was still mostly dark.   The light was stationary.  It looked like Venus, very bright it's location was North of Oklahoma City at about 11:00 due north.  It appeared as though a cloud appeared in front of the light and it flickered then went out completely after about 5 seconds.   Witness waited for the light to reappear on the other side of the cloud, but then it was observed that there were no clouds in the area.  Witness waited until the sun lite apeared more visible, it was clear there were no clouds in the area, and still the light never reappeared.",
      "link": "http://www.nuforc.org/webreports/053/S53095.html",
      "state": "OK",
      "duration": "5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7de8",
      "summary": "Pulsating colored lights, southern sky, Oklahoma City. June 22 2009",
      "city": "oklahomacity",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "Pulsating colored lights, southern sky, Oklahoma City. June 22 2009 I noticed a pulsating light in the sky south of Oklahoma City earlier tonight. Through 10x25 binoculars I could see alternating colored lights flashing red, green and what appeared to be a gold color. There was what looked like a constant bright white light present as well. I first saw the object low in the sky and over the course of 3 hours it seemed to wander around. It would stay in one spot for 45 mins or longer then move in small partial circles or short moves horizontally and vertically. At one point I stopped watching for about 1.5 minutes while changing positions to view from and it had either moved quite far, like from 3 o'clock to about 10 o'clock on the horizon, or I was seeing another one in that location. I looked in first location trying to determine if it was indeed the same object. I could only see the one, now much higher on the horizon. It appeared to be the same object I was watching a minute before. Over the next hour it slowly kind of wandered (for lack of a better word) south until I could no longer see it.",
      "link": "http://www.nuforc.org/webreports/070/S70628.html",
      "state": "OK",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b8506",
      "summary": "while waiting for pizza object spotted in sky lasted about 6 min.",
      "city": "oklahomacity",
      "shape": "unknown",
      "date": "2009-01-10T00:00:00",
      "story": "while waiting for pizza object spotted in sky lasted about 6 min. At 8:00p.m. on the 17th I saw a string of  lights strobe  just to the southeast. At first I thought a plane, but I was startled enough to call my friend outside to see and he told me what I feared , that it was a ufo. The craft was hovering and slowly moving south , toward the airport. From my point of view I could see the red lights of a water tower stand still as this object moved in the background, from one side of it to the other, like it was moving further and further away the whole time strobing the length of the craft sort of giving it a shape it happened this way until about 8:08p.m. when it moved out of sight. About 25 min. later I saw two planes flying in formation which is weird because I never see that sort of thing, except for at an air  show, or on T.V. and the thing about those planes that caught my eye was that they strobed at the same time and stayed at the same altitude, flying the same length apart for what looked like the whole city . Later that night about 9:15 p.m. I was returning home from dropping off my friend, driving east on N.W. 30th street crossing N. Rockwell and saw what looked like a fighter jet parallel with N.W. 30th  flying directly west it was very low. And had very bright lights ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66963.html",
      "state": "OK",
      "duration": "4"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d01",
      "summary": "Craft with lights but no sound",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2010-02-14T00:00:00",
      "story": "a craft with lights but no sound I was setting on my deck having a smoke, something caught my eye to the southwest just comming past the back of the house. Couldn't see the overall shape, too dark. Just the back lights. 2 triangle shapes at either end with numerous white lights around the triangle, showing their shape and 2 lights inbetween the triangles flashing a red light between the two. But what really made me wonder about it was, it was flying just along the treetops, very low to the ground, moving slow and it made no sound.",
      "link": "http://www.nuforc.org/webreports/073/S73733.html",
      "state": "OK",
      "duration": "60 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b90b8",
      "summary": "Possible booster streams in a state with launch sites I've been able to find.",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "Possible booster streams in a state with launch sites I've been able to find. First off, I'm not assuming this is extra-terrestrial.  I think it might have been some kind of rocket, and am primarily looking for ways to check and see if any known launchings were taking place on November 6, 2009, at about 6:50 pm CST near Oklahoma City.  I don't know how to look for that kind of information, since searches online aren't bearing much fruit.  I was driving home with my boyfriend, and for about seven minutes, we drove towards a little pink dot near the sunset.  From far away, I asked my boyfriend what he thought it was, and he guessed maybe Venus.  However, as we got closer, the object got significantly larger.  We only traveled about two miles, so I don&#8217;t think this thing would have been particularly high in the sky.  When we saw it at its closest, it appeared to be two white streams being emitted from a single tiny black dot situated above the streams.  That dot flickered orange frequently.  I&#8217;d pass it off as a jet using its booster from Tinker Air Force Base, but this object did not appear to move.  My boyfriend said it looked like it might be moving slowly upwards, which would make sense if the streams were coming from thrusters.  Unfortunately, I had to turn the car at that point, and we couldn&#8217;t see it anymore.  It had gone from near the horizon to almost directly overhead as it got larger, and once we turned, it was obscured by the car roof.  I rushed home, which probably took about five minutes, grabbed my camera, and ran back out...  But we couldn&#8217;t find it again.  I saw an airplane flying on the horizon near it, when it was still too small to distinguish the streams.  The plane was much smaller than the shape, even then, and looked farther away.  I could also see the plane moving, while I could not observe the object moving.  It seemed terrestrial to me, maybe a rocket taking up a satellite or something.  I just don&#8217;t know where would be close enough to launch something like that, for it to be close enough to visually change so significantly in size after driving only a couple of miles.  If there is anywhere I can check records of what&#8217;s been launched when and where, I&#8217;d really like to check out whatever it was that I saw.  Location information:  When we lost whatever it was, we were facing West and turning South on N 122nd and Memorial in Oklahoma City.  Image information:  I couldn't get a picture, but I did a couple of quick illustrations.  The first shows the shape from far away, when we first saw it, and the airplane behind it.  The second shows how it looked when we saw it at its closest.  I don't see where to attach them to this, but I will email them to the address provided.",
      "link": "http://www.nuforc.org/webreports/073/S73135.html",
      "state": "OK",
      "duration": "About seven minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e71",
      "summary": "Unknow fast moving light",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "Unknow fast moving light On March 16 2009 at 1:00 am  I saw a bright orange light flash across I-40 near the 169 exit or mile marker.  This is a few miles south of Harrah, Okla. I was shocked and the other two people with me were also.   The light was traveling north at a speed faster than any thing I have ever seen.  Sighting only lasted a few sec and very close to ground.",
      "link": "http://www.nuforc.org/webreports/069/S69351.html",
      "state": "OK",
      "duration": "2 to 3 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e92",
      "summary": "Large oval or triangular metallic object hovering in OKC",
      "city": "oklahomacity",
      "shape": "oval",
      "date": "2009-01-10T00:00:00",
      "story": "Large oval or triangular metallic object hovering in OKC I was driving southeast on NW Expressway at about 3:45 AM and to the East there was some object in the sky.  It appeared to be either oval or triangular in shape and was lightless. The only light that was present was the streetlights reflecting off of what looked like a metal hull. I kept going the same way until I came to a car stopped on the side of the road with two people standing outside staring at the object.  I stopped and got out and asked them how long it had been there and what it was, they said that it just showed up out of nowhere and they didn’t know what it was.  After about 30 seconds of us standing there the object moved further east very rapidly until it was out of sight.  We decided to go further down the expressway to see if we could catch another glimpse of it. After about a mile it came into view again for about 1 minute before it flew off even faster than before and we lost all site of it. We talked about what we had seen for a couple of minutes and were honestly just wierded out by the situation.  We decided that there was no reason to call authorities so we said our goodbyes and headed our separate ways. This is not the first time that I have seen an object near or around NW Expressway but it is the first time that anyone else has seen in and it was bigger than ever before.  In all honesty I believe that it was some alien spacecraft, there’s no other way I could explain it.  This was definitely the strangest thing I have ever seen in my life.  If anybody else saw this besides us I would love to know.  Thanks.",
      "link": "http://www.nuforc.org/webreports/067/S67573.html",
      "state": "OK",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fbb",
      "summary": "Me and my children where coming home as we drove up in the drive way we seen a lights going real slow in the sky and it was going so sl",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2009-08-27T00:00:00",
      "story": "Me and my children where coming home as we drove up in the drive way we seen a lights going real slow in the sky and it was going so slow that we thought it was a plane or helicopter and then I noticed there where no lights in the front the lights where coming from the bottom it seemed. We got out of the car and it sat still and there was no sound in the sky like a helicopter or plane. It slowly turned to the east and it disappeared into the darkness the lights where red, green and a little yellow.",
      "link": "http://www.nuforc.org/webreports/071/S71697.html",
      "state": "OK",
      "duration": "10 MIN"
    },
    {
      "_id": "64d005f478aba2ec5a3ba093",
      "summary": "I saw a light in the sky then another light eminated from it and fell to the earth when it reached earth the object in sky went out.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "I saw a light in the sky then another light eminated from it and fell to the earth when it reached earth the object in sky went out. Hi nuforc staff this is a first for me and i feel silly actually going to the trouble to send this report, but i cant help what i saw on the evening of wednesday december 24 .  First i must say that i have seen what i believed to be a ufo several years ago (5 or more)  that was three very bright lights in the shape of a triangle.  There were muptiple witnessness that saw the object that simply disapeared after a few seconds.  So in saying that, since that incident i have become obsessed in watching for ufos or anything that could not be explained.  I have become an avid skywatcher and have not seen anything out of the ordinary since, until now.  After this incident i searched online for the proper way to report this type of thing and i found this is the way to go. On the evening of Wed. Dec 24 2008, after trying to return a christmas gift i was heading home in the major metro and just before i reached my destination i witnessed a large strange orange light in the NNW sky ahead of me.  I just happened to stare long enough approximately 6-8 seconds to witness another much smaller light that appeared to be the exact same color as the larger light eminate from the larger one and slowly float to the earth in a straight line.  When the smaller light appeared to reach the ground the light in the sky just disappeared. My first impression when i saw the light was an airplane but i remember thinking quickly the plane has dirt inside the light because of the odd color.  Then when the smaller light appeared out of the other i was quickly thinking that sparks were coming out of the plane and i was witnessing a plane malfuntion or crash.  Then when the second object never flickered and went to the earth at the same slow speed and as soon as it seemed to reach earth the object in the sky simply went out, i knew i was seeing something unordinary.  So i pulled off the side of the road and stopped to look for a plane or helicopter.  I stared at that part of the sky for anything flying and seen absolutely nothing.  The background was nothing but sky with a few high level clouds.  I hope to talk to any representative who wishes to hear this account in person.  THIS IS NOT A HOAX.  follow ups will be granted and wishfully expected.",
      "link": "http://www.nuforc.org/webreports/067/S67614.html",
      "state": "OK",
      "duration": "10-15 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3ba736",
      "summary": "Group of round silver objects traveling across sky and reversing direction .",
      "city": "oklahomacity",
      "shape": "",
      "date": "2009-04-14T00:00:00",
      "story": "Group of round silver objects traveling across sky and reversing direction . A large grouping of round objects that were traveling towards the nothwest . The objects would disappear and reappear within 20 to 30 second intervals . We thought they were a bunch of silver balloons tethered together but they would break apart from one another and then regroup . They were much too high to be birds and were round in shape . We followed them by car several miles north and watched as they reversed direction and began traveling back towards the southeast . Then as suddenly as they appeared they disappeared.",
      "link": "http://www.nuforc.org/webreports/069/S69576.html",
      "state": "OK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad4c",
      "summary": "Upside-down landing carrier, about 40-50 feet in length.",
      "city": "oklahomacity",
      "shape": "rectangle",
      "date": "2011-01-05T00:00:00",
      "story": "Upside-down landing carrier, about 40-50 feet in length. Was driving to wife's grandmother's with my wife, looked up because there was a large craft in the air above us.  It made no noise, looked like an upside-down landing carrier.  It was heading east of us, 89th Street and Pennivania Ave.  It was traveling at a slow speed, and it stayed in viewing distance for about 5-10 minutes. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79466.html",
      "state": "OK",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3badfa",
      "summary": "Unusual spacecraft 15 feet above me.  Did not hover, it was stationary, solid matter, as though it were a solid fixture.",
      "city": "oklahomacity",
      "shape": "changing",
      "date": "2010-08-24T00:00:00",
      "story": "Unusual spacecraft 15 feet above me.  Did not hover, it was stationary, solid matter, as though it were a solid fixture. Explanation is two pages long.  Will e-mail you with the attachment.",
      "link": "http://www.nuforc.org/webreports/042/S42532.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3a9",
      "summary": "It was motionless, then moved forward very fast, did a loop-the-loop, then flew away at about a 15' degree angle",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2011-02-18T00:00:00",
      "story": "Small red light,observed from west.  Very fast.  It was motionless, then moved forward very fast, did a loop-the-loop, then flew away at about a 15' degree angle ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80016.html",
      "state": "OK",
      "duration": "10-12 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bb57e",
      "summary": "Circular, bright orange object flying north in the sky that fell apart and disappeared.",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2010-08-24T00:00:00",
      "story": "Circular, bright orange object flying north in the sky that fell apart and disappeared. Observers were two teenage girls about to go to college.  We were sitting in a park facing north when one of us noticed a strange light moving across the sky.  It was circular and bright orange and it was going north.  It was quite a bit larger than a star, but smaller than the moon.  It was moving faster than the plane that was going east, although we don't know how close the plane was to the object.  We saw it moving for about fifteen seconds, and then it paused in midair for about thirty seconds.  Then about a third of it broke apart and fell.  The light then disappeared.",
      "link": "http://www.nuforc.org/webreports/077/S77091.html",
      "state": "OK",
      "duration": "55 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb8b1",
      "summary": "Bright bluish light. that vanished",
      "city": "oklahomacity",
      "shape": "unknown",
      "date": "2010-07-28T00:00:00",
      "story": "Bright bluish light. that vanished On July 18th, at around 2:30 am, I was standing out on the steps of my back door talking to a friend of mine on the phone.  I was looking up at the night sky when in an eastwardly direction about 45 degrees from the horizon, when I thought I saw a very bright star. This sparked my curiosity because I had never seen a star that bright before.  After about 5 seconds the star faintly pulsated once, and then grew brighter in intensity.  After it grew brighter the light shrank into itself and disappeared.  The light was a darker blue, not the normal blue you see in any celestial body.",
      "link": "http://www.nuforc.org/webreports/076/S76661.html",
      "state": "OK",
      "duration": "9 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb9a6",
      "summary": "Circular craft blinking red, yellow, orange, green,  blue.  ((NUFORC Note:  Possible twinkling star, or celestial body, perhaps?  PD))",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2010-07-28T00:00:00",
      "story": "Circular crafts blinking red, yellow, orange, green, and blue My husband and I had just got done watching a movie when we decided to go out to our apartments pond area.  It has a nice open space where the stars are visible with a picnic area that you can sit at.   We went out wanting to enjoy the nice weather and have a romantic ending to our night.  It was around midnight when we went, walked to the back of the pond and sat down.  We where there for aproximately 10 minutes when I looked up saw something circular blinking in the sky. The object was towards the south of us flying lower than an airplane would, and it was blinking red, green, orange, blue and yellow, something an airplane would not do.  I urged my husband to look at it, and he agreed that it was not a plane.   The object was not moving at all, as if it where hovering.  We both at the time just kind of blew it off a bit,joked about it being a UFO we lit a cigarette, and looked up and it was gone.  This is when we began to freak out and get real serious about it, realizing that we where talking about it and observing it for at least 10 minutes without it moving, and then it just disappeared. We continued to scan the sky when I noticed the same looking object to the west of us.  Appearing about 5 minutes after the other one dissapeared.  It had the same blinking colors, only the distance seemed closer, and lower than before.  We kept watching it hover in place, shift to the left and right real fast, and then at moments it would stop flashing colors and turn a yellow-orange color.  It also would get distant and then come closer.   My husband then noticed to the north another one, by this time I am really freaking out, and almost in tears because I cant believe my eyes.  My husband on the other hand excited about what he is seeing.  My husband watched the one towards the north as I watched the one to the west.  We would report back and forth to eachother what they where doing as we watched.  My UFO then shifts right then zooms left leaving a trail of light behind it then dissapears in a split second.  If i would have blinked I would have missed it! Im still not sure where it d! issapeared to. Since the UFO I was staring at had disappeared we both continued to watch my husbands, which was not moving at all.  It was just flashing red, orange, green, blue, and yellow.  I looked over in the direction where the one I was observing disappeared, and it reappeared!  They where both there in the sky again, one to the north, and one to the west.  The one that I was watching seemed as if it would get distant, and then come closer, contunuing to shift right to left and up to down.  My husbands seemed to stay in the same spot not getting closer or farther.  As we observed them seperately we would continue to report back and forth to eachother what they where doing. This all came to an end at about 2:40 p.m. when all the sudden mine turned yellow-orange, then his did too.  Then mine started blinking colors, then his did too.  Then all the sudden both of them began to get distant and higher extremely fast together(still in their seperate directions of west and north), then they both just disappeared.   We stayed until 3:00 to see if they would come back, but they didnt, so we walked to our apartment. From what we collected and witnessed, it seemed as if the two crafts where comunicating back and forth with their lights because one would blink lots of colors then turn to a yellow-orange color, then the other would do the same.   And it also seemed as if the one I was watching was on a mission, as the other one was on the lookout.   We collected this because mine was doing all the moving and his was just still. I had a very hard time getting to sleep after having experienced this.  My husband was very excited about our experience, and was releived that he now knows life on other planets exist.  He seemed pretty calm about it, but still said that he was a little freaked out.   I have never been a believer in aliens and UFOs, but I now honestly have to say, that after experiencing this, I am a believer.  Nothing could explain or justify what we saw. ((NUFORC Note:  Possible twinkling star, or celestial body, perhaps?  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76761.html",
      "state": "OK",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bb9f6",
      "summary": "Inverted craft 40+ft long over North Oklahoma City  hovering  moving and changing directions",
      "city": "oklahomacity",
      "shape": "cylinder",
      "date": "2010-07-28T00:00:00",
      "story": "Inverted craft 40+ft long over North Oklahoma City  hovering  moving and changing directions Last Sunday evening 7/25/10 my wife and I were sitting out on our patio and notice in the west as the sun was sitting  we saw what looked like a inverted air craft hovering and  rotating also moving slowly to the south.   I went and got my binoculars and when we looked through them I was amazed to see it had strange shape wings and a upper fuselage with what look like 4 engines on the tail.  All this was in the inverted position like it wanted to land some where.  I call for my son to view this and he also wittiness this.   I watched this for 10 to 15 minutes, then craft went up at least 2000ft and then started moving to the north west as it picked up speed.  The craft seem to be in the 40 to 50 ft range; tall. I could tell because it was fairly close to the TV towers, each painted section is 100 ft so I could gauge this a bit.   After this was over I'm sure others saw this since we live in North Oklahoma City.  Also there was no enging noise, the craft was a matt black as best i could tell.  My wife was scared and my son was a little shaken over the event.",
      "link": "http://www.nuforc.org/webreports/076/S76814.html",
      "state": "OK",
      "duration": "15 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbb9",
      "summary": "Loud grinding/saw like noise woke and startled me.",
      "city": "oklahomacity",
      "shape": "unknown",
      "date": "2011-10-10T00:00:00",
      "story": "Loud grinding/saw like noise woke and startled me. Summer  Night 2001  Oklahoma City,  I was sleeping in my bedroom and was suddenly startled and woken by an extremely loud sawing/grinding sound like a jet airliner was crashing into our one story house. I am not sure if the back yard was illuminated or not as we lived next to an alley with street lamps behind a shopping center that also had security lights on the back of their building and light would emit into our yard over our 6 foot privacy fence. I awoke to an extremely loud sawing noise that made me jump a little up in my bed and I was extremely terrified. I looked at my alarm clock and noticed it was showing 3:16 am.  Which struck me because I had recently converted to Christianity and I immediately thought of John 3:16 (for god so loved the world that he gave his only begotten son). I then immediately felt like something or someone might be in the house and coming to me.  I heard the door that leads out to the garage and to the back yard door open and shut. I was so frightened that I did not move but laid in my bed in fear. It took me a long time to go back to sleep. I kept thinking about all this and also asked my uncle who was my room mate and owned the house if he had gone anywhere early in the morning and he said no.  I knew he had gone to his room to go to bed a few hours before me so I was puzzled at the door sound.  I started to chock my experience up to a religious event and possibly a religious experience where I might have been visited by angels at 3:16am as a religious omen, but cannot explain why I was so terrified at the thought of them coming in my room after the grinding/saw sound.  It’s like subconsciously I new what that sound meant and it horrified me. I must disclose that I had two previously weird events before that I recalled. One was in 1997 while I was alone at night working security at an apartment complex overnight. It was early in the morning around 2 or 3am and a bright light shone down on my car as I sat in it. I got out after a few seconds to see what the light was looking for. I live in Oklahoma City and it is very common to have OKC. P.D.’s “Air One” police helicopter searching the area for suspects fleeing a crime scene. When I looked up at the light it was so bright I couldn’t make out what I was looking at, but the weirdest part was it made no sound and that freaked me out because I didn’t believe the police were using some conspiracy theory “Black Helicopters.” I remember I felt freaked out and went into the complex a moment later after the light left. I just wanted to get near other people so I felt safer. Since then I have seen strange anomalies a few times like cluster formations of what I thought were stars in a clear sky and then suddenly break out in different directions and disappear. When I would see this I would go immediately inside my house and turn on the T.V. and try not to think about what I saw as it scared me.  I have also had fits of sleep paralysis from time to time where I would swear I saw silhouettes near the bed moving around and I was completely terrified and couldn’t wake myself. I just chocked it up as sleep paralysis after some internet self diagnosing.  I feel like I have been visited and know things but can’t remember what it is.  I hope I am not to hallucinating any of these experiences because that would indicate possible mental illness and I don’t feel like I have mental health issues.  These occurrences felt genuine and not willed by thought but sudden instances. Thank you ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84354.html",
      "state": "OK",
      "duration": "2 or 3 min.?"
    },
    {
      "_id": "64d005f478aba2ec5a3bc27a",
      "summary": "A series of red lights moving south to north.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "A series of red lights moving south to north. Low on the horizon, I saw a series of red lights moving from the south to the north.  At first I went out to smoke and then notice 20-30 red lights headed north bound.  I ran inside to grab my video camera and ran back out and noticed the number of lights was less about 10 and they seemed to be forming into a V shape and then slowly disappeared.  This took place in north Oklahoma City, looking east. I do have video footage.  All I have to say is that it was exciting yet frighten...",
      "link": "http://www.nuforc.org/webreports/084/S84100.html",
      "state": "OK",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd0f",
      "summary": "((HOAX??))  I saw a circular object spinning in the stars.  ((NUFORC Note:  We are uncertain whether the report is a serious one.  PD))",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2011-06-27T00:00:00",
      "story": "I saw a circular object spinning in the stars I was at my cousins house spending the night.  i went swimming at like 12:00.  i was watching the sky and i said to my cousin hey whats that?   What i saw was a circular object with lights in a circle, it made large boom like thunder, but i knew there was no storms.  it was spinning in the air into the stars.  i went inside because it was creepy",
      "link": "http://www.nuforc.org/webreports/081/S81935.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd2da",
      "summary": "We saw a low-flying, brilliant, orange object flying silently and steadily from SSE to NNW and are sure it wasn't a traditional craft.",
      "city": "oklahomacity",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "We saw a low-flying, brilliant, orange object flying silently and steadily from SSE to NNW and are sure it wasn't a traditional craft. My husband, son and I were outside watching nearby fireworks at 10:35pm CST and from the SSE we saw a brilliant orange hovering object heading to the NNW.   We thought it was a local helicopter but as the craft approached it was silent and brilliant in color, like a burning ember.   It was not close enough to discern a clear shape, but seemed almost circular.  It flew in a very controlled manner at a consistent altitude and speed.   The speed was like that of a helicopter also.  The altitude seemed to be somewhere between 8,000 and 15,000 feet.  Difficult to really estimate the altitude because of our uncertainty of the nature of the craft.   After it had passed over us and was almost out of our vision field we noticed that the brilliance seemed to weaken just a bit, but then reappeared as it continued on its path to the NNW.   The duration of our siting was probably 1 minute, or slightly more.   We are certain it was not an airplane, nor a helicopter, nor a satell! ite or slow burning shooting star or firework.  We have never seen a flying object like this.   We do not consume alcohol, nor drugs and have excellent vision and judgement.   We are sincere in submitting this report.   Thank you. ((ADDENDUM FROM WITNESS)) This is a supplemental report to my initial report, per Peter Davenport's request.    We called the local National Weather Service to obtain wind direction at the time of our siting last evening.   At 10:00pm CST the ground wind direction was approx 150-degrees or SE heading NW.    The balloon was flown at 7pm CST for higher elevation wind at 3,000 feet and it was reported at 160-degrees or SE, almost a bit SSE, heading NW.    Also, I failed to submit in my initial report that I called a local news channel this morning to see if others may have sited or reported the same thing we saw.  They said yes, they received one phone call reporting this same object at the same time we saw it.   Thank you. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/090/S90474.html",
      "state": "OK",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd81b",
      "summary": "Street lamp appearance, orange flashing, extremely fast, silent...phone lost signal.",
      "city": "oklahomacity",
      "shape": "flash",
      "date": "2012-07-04T00:00:00",
      "story": "Street lamp appearance, orange flashing, extremely fast, silent...phone lost signal. Driving down 36th and may caught offguard by a streetlight shaped and sized object that was orange and flashed 2 times in and out. About 2 am. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89831.html",
      "state": "OK",
      "duration": "2 - 4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd94d",
      "summary": "Multiple silent red orbs under power over Oklahoma City, approx. 5 min. duration.",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2012-10-30T00:00:00",
      "story": "Multiple silent red orbs under power over Oklahoma City, approx. 5 min. duration. Red spheres travelling from SE to NE spaced out in linear pairs from the area of Tinker AFB.  Constant speed. No sound.  Pairs would travel in a straight line, either blink out or disappear into the overcast ---  then a gap of a few seconds and another pair would appear and follow the same pattern.   My son and I stood in a restaurant parking lot and watched for approximately 5 minutes, then they were all gone.    Have never seen anything like it in my life and have seen lots of craft landing and taking off from Tinker AFB.",
      "link": "http://www.nuforc.org/webreports/093/S93506.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc8e",
      "summary": "Hello, I am a 52 year old male and live in central OK. I build custom cars and motorcycles for a living and work in a private shop",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Hello  I am a 52 year old male and live  central Oklahoma. I build custom cars and motorcycles for a living and work in a private shop on the outer northwest edge of Oklahoma city.  During these hot months I will work late at night and early mornings to beat the heat. On Saturday, july 21, 2012, at approximatly 10:00 pm I was headed to work.  At about three miles out from the shop I noticed this mass of lights ahead to the west and northwest.  I was coming from the east and noticed more and more of the lights as i progressed toward the west.  I was on W. Memorial ave between N. Rockwell ave. and N. Council Rd. As I approached Council road that is when i saw the most lights at one time. They were a glowing red/orange that did not flash but seemed to appear and disappear according to the angle you were veiwing them.  By then I had my phone out and was attempting to record these lights while trying to get safley off the road.  The large group of lights were in some type of triangular formation headed straight west, there were approximatly 15 to 20 lights in this formation and the angle of view would be 25 to 30 degrees.  As the large group went out of sight there were smaller groups, say 4 or 5 lights and i saw three of these smaller groups.  These are the ones I captured in the first video and were coming from the north headed south then turned to the west and followed the large group that was out of sight by then. I then proceeded to the shop, off of Memorial rd. and County line rd. where i shot the second video.  In this video i had turned out the outside lights around the shop hoping to have less light interferance. while filming this  video i was facing dihttp://www.youtube.com/watch?v=VFJD6AUgp18rectly to the south . The lights that i captured here were headed straight west. My angle of sight was again 25 to 30 degrees. The weather conditions that night were clear skys. according to the National Weather Service out of Norman Oklahoma. At 10:00 pm the wind was @ 5 mph out of the east and the loft, which was checked at 6:00 pm was out of the northeast @ 15 mph at 3000 ft. http://www.youtube.com/watch?v=6GVI1yTHUHU     http://www.youtube.com/watch?v=VFJD6AUgp18 Here are the two videos i captured and posted on youtube. Best wishes",
      "link": "http://www.nuforc.org/webreports/091/S91120.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd1a",
      "summary": "Lights Over Oklahoma City/Edmond Area",
      "city": "oklahomacity",
      "shape": "triangle",
      "date": "2012-10-30T00:00:00",
      "story": "Lights Over Oklahoma City/Edmond Area I was on Waterloo Road just west of Kelly in north Edmond, Oklahoma.  I noticed six to eight lights in the southern sky hovering over the Oklahoma City area.  At first, I thought the lights were in an unconventional pattern.  However, when I got home, I drew the pattern of lights on a sheet of paper, and I noticed the next day that the pattern of the lights is similar to the Big Dipper.   I got out of my car and took three pictures with my cell phone.  The pictures are dark, and I cannot see the lights on the photos.   I got back in my car and headed south on Kelly.  I continued to clearly see the lights that were hovering in the sky.  I then noticed that three to four of the lights had moved north and were suddenly very close to me in the Edmond area (just west of Kelly).  The objects flew right over my car (to the right/west), and I watched them as I continued to drive.  At first, I thought the objects were helicopters because they appeared to be moving fa! irly slowly.  As they came closer, I realized their shape was triangular.  As they flew over, they did not make any noise.  Each object had mostly white and some red lights on the bottom.  The lights were in rows and appeared to outline the entire bottom of the object.  They continued to move north out of my view.",
      "link": "http://www.nuforc.org/webreports/093/S93717.html",
      "state": "OK",
      "duration": "10 to 15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be11d",
      "summary": "Ball of lights",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2012-11-04T00:00:00",
      "story": "Ball of lights Around 715 pm November 1st  I was lying in bed when I noticed something bright like a star or a meteor falling or descending straight down from the sky it was moving very slow to be a meteor or airplane I then past a blue smaller looking star as it keep moving down the blue ball of light started to move straight up this was over by Wiley airport in Oklahoma city I watched it for 15 to 20 seconds before I lost it in the tree line the blue ball of light I can still barley see in the sky it looks like it’s moving away and disappearing if anyone else has seen this please let us",
      "link": "http://www.nuforc.org/webreports/094/S94021.html",
      "state": "OK",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be273",
      "summary": "((HOAX??))  Ufo was dancing in the sky over lake hefner",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2012-08-19T00:00:00",
      "story": "Ufo was dancing in the sky over lake hefner ((NUFORC Note:  Date is flawed.  Possible hoax?  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91850.html",
      "state": "OK",
      "duration": "Ufo"
    },
    {
      "_id": "64d005f478aba2ec5a3be295",
      "summary": "I did not see any kind of space craft!, but I did see a very bright slash of light exactly in the shape of diagonal line.",
      "city": "oklahomacity",
      "shape": "flash",
      "date": "",
      "story": "I did not see any kind of space craft!, but I did see a very bright slash of light exactly in the shape of diagonal line (like the trail of a jet, but this one was far too low in the sky and it was not like any sort of light that I had seen before....but I'm positive that it was not any sort of natural phenomenon...atleast did not look like one?    Anyway, I just thought I'd share this information...as this happened on my way back from houston to Oklahoma state university in Stillwater where I used to study. What I saw looked like some really small(almost the size of a car/slightly bigger...but it was really close to the road and looked like whatever it was it was heading up from almost 25/30feet of the ground and left a short tail of bright white light behind which looked like a fast flash of a very bright laser light in the middle of the nowhere as that stretch of the highway had no lighting and had small dunes on the left and right and no shops or anysort of activities happening at that time though I have seen some workers around that area during the day some times with a lot of trucks and digging machines.  Nothing got to do with the light but just thought the information would help.  I did not stop my car when I saw the light but I did slow down as I got a sudden fright looking at the light, as it was so out of the blue.",
      "link": "http://www.nuforc.org/webreports/005/S05397.html",
      "state": "OK",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3be7d1",
      "summary": "Rectangle transparent object sitting above HW I-35 stationary  red & green lights on corners no sound",
      "city": "oklahomacity",
      "shape": "rectangle",
      "date": "2012-05-29T00:00:00",
      "story": "Rectangel transparent object sitting above HW I-35 stationary  red & green lights on corners no sound I was on I-35 right before the 66th st exit going North, me and my girlfriend noticed an object in the sky sitting above the highway. Looked like a helicopter from a distance but the closer we drove to it the more it semed like something else. As we drove under the object on the highway continuing to follow speed limit.  We notice no sound was coming from the object and it was stationary transparent alomst but reflected light from the street lights on the bottom.  rectangel in shape two red ligts on one end with a space in between and two green lights on the other end. it was trying to pose as a steet light or helicopter light skeem.  We went to drive around back to it for further detail but when we got back to the spot the craft had already vanished. We think it was observing the cars on the road. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89165.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be7e3",
      "summary": "Huge circular craft high in the sky.",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2012-03-13T00:00:00",
      "story": "Huge circular craft high in the sky. While at work, I went outside to smoke and noticed just an outline of one side of a cirlce moving above the clouds.  While I can't say how high it was, it was definately very high above the clouds.  It looked to be about the size that the moon would look in the sky.  I  had a bay door above my head and used it as a reference to assure that this was actually moving and that I wasn't seeing an optical illusion from the moovement of the clouds.  It was most definately moving in a northwesterly direction. And it was most definately gigantic.  I hurried to retrieve my camera from my car but it was behind the clouds by then.",
      "link": "http://www.nuforc.org/webreports/087/S87336.html",
      "state": "OK",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bf111",
      "summary": "Multiple, spherical orange lights seen over Oklahoma City",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "Multiple, spherical orange lights seen over Oklahoma City From the patio of a restaurant on Lake Hefner in Oklahoma City at approximately 22:30 I saw what appeared as 4 orange spherical lights traveling from North to South, spaced much like aircraft approaching an airport for landing, except they all appeared to be at the same altitude.  The speed appeared to be consistent, at first, with an aircraft.  However, there were no red or green wing tip lights and no strobe.  I estimated the altitude to be approximately 4,000 feet. I kept my eyes peeled on the objects hoping to get a more detailed look as they got closer, but before the first object was closer than +/- 2 miles, it began to ascend at approximately a 35° angle to the horizon.  The orange color faded and the size of the object diminished until it took on a star-like appearance and within a few seconds disappeared.  The three objects following took the exact same path. Moments later there were three more orange lights which took the exact same path.  Following that, a few moments later, there were three more.  Two took the same path as the previous 7, but the third disappeared from view due to obstruction of line of site by buildings, and appeared to take a different path. There was no noise associated with these objects and they were never close enough to clearly delineate a shape.",
      "link": "http://www.nuforc.org/webreports/098/S98441.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c12b5",
      "summary": "Nearby nighttime viewing of brightly lit saucer in South Oklahoma City.",
      "city": "oklahomacity",
      "shape": "disk",
      "date": "2014-01-30T00:00:00",
      "story": "Nearby nighttime viewing of brightly lit saucer in South Oklahoma City. I live near the woods at SE25th and High Street, just West of I-35 in Oklahoma City.  I walked out into my back yard around 11pm to get some firewood for the overnight, and saw a low flying craft coming from the South, just a few hundred yards away right above the treetops.  It caught my attention because it was so low and had far too many lights for an airplane, as I could see around six or so bright white lights across the leading edge.  I soon noticed it had “points” of light coming out the bottom, so I put a hand over one eye to check that it wasn’t just blurred vision from the cold night air as it came into full view, unobstructed by the trees, and it was not blurred vision –I checked both eyes as it slowly approached.  As it drew nearer, passing due North, East of my position, the bright lights were also visible down the side of the craft, just as they had been from my view of the leading edge, and the “points of light” appeared to be multi-colored cones of light, three or four of them, coming from the bottom of the craft like a cone, with the point downward.  I continued to watch it pass at a few hundred yards away in the pitch black sky, and believe it was a saucer shape with large bright white lights surrounding the outer edge, the “points of light” pointing from the flat bottom center of the craft at a length of ten or twelve feet toward the ground.  From the rear of the craft I could see flashing lights in various places on the craft –none of which behaved like airplane lights, nor were they properly colored –just white lights. I believe it to have been a typical “flying saucer shape” like two tea cup saucers stacked together, possibly with a spacer in between, where the large bright white lights would have been.  I would estimate it to have been about thirty feet across. It flew absolutely silently.  Moved much too fast to be a blimp, but seemed to merely float in the sky, silently, slower than an airplane, but crossed my field of vision inside of thirty seconds, covering probably a mile or so before my view became obscured by buildings and trees in my  own yard.  This thing was close by, and not the first unusual craft I have seen appear to come from these woods over the many years of living here. ((ADDENDA FROM WITNESS)) 1.  Oh, yes -the 29th would be the correct date. I just glanced down at the corner of my screen for the date.I just saw the thing -so -adrenaline! 2.  I would also like to let you know that the \"multi-colored cones of light\" were shades of blues and greens. ((END ADDENDA))",
      "link": "http://www.nuforc.org/webreports/106/S106761.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1299",
      "summary": "Bright ball of light observed near Hobby Lobby warehouse.",
      "city": "oklahomacity",
      "shape": "flash",
      "date": "2013-12-02T00:00:00",
      "story": "Bright ball of light observed near Hobby Lobby warehouse. Driving in vehicle heading southbound on S Council just past SW 29th Street when a very bright ball of light could be observed.  The sun was bright with no clouds.  Airplanes were clearly visible with their condensation trails. The ball of light was extremely bright even with the brightness of the sun and it being a clear day with no clouds.  The bright light was observed minimizing in size and it appeared to leave line of sight heading in the South direction.",
      "link": "http://www.nuforc.org/webreports/104/S104820.html",
      "state": "OK",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1488",
      "summary": "2 Amber Orbs Above Lake Overholser Area",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2013-12-05T00:00:00",
      "story": "2 Amber Orbs Above Lake Overholser Area 2 bright Orange or Amber colored Spherical crafts aligned horizontally.  They appeared to be about 1/4 mile or less apart from each other.  The 2 crafts made no sound.   After a couple of minutes of watching, one craft disappeared.  The remaining craft was still visible for about 30 seconds until it ascended straight up and out of sight.   This occurred while walking with my son and his friend in NW OKC. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105036.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c14ad",
      "summary": "Round",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2013-12-05T00:00:00",
      "story": "I was driving on I-35 coming from Ponca City, OK towards Norman/Oklahoma City, OK, around 7:30 pm and it was pitch black outside with a pretty thick fog, so it was nearly impossible to see any signs or landmarks...or even drive.  Myself and other cars were going around 45-55 mph due to the fog.   All of a sudden I see a bright orange-ish light, thinking it was the moon.. maybe an eclipse of some kind.  As I drove closer to the light I realized it was not the sun/moon and it had a prominent shape to it.  It was round and divided up (like a calzone looks).   The sky completely lit up bright orange!  It was so bright it looked like it was at the peak of the day. I kept driving and there were more maybe 10 altogether.   These were not moving, just stationary in the sky and I did not hear any sound coming from them.  Not blurry, not far away, VERY PROMINENT SHAPES!!!   This was around marker 170-180 (I didn't look because I was so scared at the time but it was in that range)   After driving underneath these object all of the cars proceeded to drive around 95-100+ mph out of that 'area'. I also called 911 which transferred me to highway patrol and they said they would \"send someone out there\" but seemed to have no knowledge of any projects with an aircraft like that being out there at that time.",
      "link": "http://www.nuforc.org/webreports/105/S105032.html",
      "state": "OK",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1cc3",
      "summary": "Large brightly lit object plummets from the sky in NW OKC",
      "city": "oklahomacity",
      "shape": "triangle",
      "date": "2014-07-04T00:00:00",
      "story": "Large brightly lit object plummets from the sky in NW OKC NW OKC off NW Expressway and Penn, I saw a very brightly lit inverted triangle-shaped object plummet from the sky.  It went behind trees, but I looked intently incase something happened when it hit the ground, but saw nothing.  It's hard for me to guess size because I have no idea how close it was to me, but I observe planes in that same area of sky all the time and this was at least five times bigger than planes appear.",
      "link": "http://www.nuforc.org/webreports/110/S110784.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1dec",
      "summary": "Quickly descending and then slowly moving, lit, object in NW okc sky.",
      "city": "oklahomacity",
      "shape": "egg",
      "date": "2014-06-27T00:00:00",
      "story": "quickly descending and then slowly moving, lit, object in NW okc sky. Object descended from empty, unseen space at rapid rate in NW OKC.  Stopped approx. 10,000-20,000 feet above the earth, and slowly moved SW (appeared to be rotating).   Craft had multiple \"clear\" light bulbs on the edges of its bottom, as well as some more bulbs at different depths into the craft. the undercarriage was visible but very complex and indescribable.   No sonic boom, surprisingly, due to rate of descent.  Though it is still tonight, there was a brief but large amount of wind 20-30 seconds following objects descent.  This wind lasted for 20 seconds.",
      "link": "http://www.nuforc.org/webreports/110/S110604.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c242d",
      "summary": "Bright flash SW OKC.",
      "city": "oklahomacity",
      "shape": "flash",
      "date": "2014-03-27T00:00:00",
      "story": "Bright flash SW OKC Two very bright flashes coming from the west.  Bright enough to light up interior of vehicle.   No thunderstorms nearby.   Did not hear thunder.",
      "link": "http://www.nuforc.org/webreports/108/S108111.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c24fe",
      "summary": "Orange/Reddish flying object seen in the Oklahoma City area.",
      "city": "oklahomacity",
      "shape": "changing",
      "date": "2014-11-06T00:00:00",
      "story": "Orange/Reddish flying object seen in the Oklahoma City area. It was unbelievable.  Orange redish object in the sky.  Started oval shaped.  After watching for many seconds, it began to change shape.  Growing longer, but thinner.  After two to three minutes of being very visual, quickly faded away and disappeared into the sky.  About a mile down, I saw a second object in the sky, not the same one.  I saw them both In the sky at the same time.  It happened almost exactly the same as the first.  My best friend was in the car with me and witnessed the exact same thing I'm describing.",
      "link": "http://www.nuforc.org/webreports/114/S114540.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2596",
      "summary": "Small stationary shiny metallic object high in atmosphere with 3 orange rotating and revolving lights, white cone shaped tail.",
      "city": "oklahomacity",
      "shape": "cone",
      "date": "2014-11-06T00:00:00",
      "story": "2:50 pm, small stationary shiny metallic object high in atmosphere with 3 orange rotating and revolving lights, white cone shaped tail The object appeared high in the the north east sky above Oklahoma Cities Asian District.  It meandered randomly in the sky, often appearing motionless for about 25 minutes before it drifted away and disappeared.  It had 3 orange lights in the shape of a triangle that were spinning while also rotating around the perimeter of the craft.  It also had a white cone shaped tail pointing towards the ground.  It was observed through binoculars by 2 witnesses, and with the naked eye by several others.",
      "link": "http://www.nuforc.org/webreports/114/S114950.html",
      "state": "OK",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c294b",
      "summary": "An usual co-incidence with an amazing bright sphere falling or just moving towards the ground.",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2014-11-06T00:00:00",
      "story": "An usual co-incidence with an amazing bright sphere falling or just moving towards the ground. I had departed my place of work at 7pm  Oct. 31 and Halloween evening.  I had noticed that there was a half moon in the very dark South East sky.  I drove North from SW 74th  on Santa Fe street towards SW 59th  and about half the distance I suddenly saw a very bright very white spherical object seem to move very fast at a descending angle of about sixty degrees towards the East.  It lasted about three to four seconds and then vanished.  I thought it could not be a meteor because it was so bright and white and I have seen many meteors in my time.  It may have been something that crashed but lost its brilliance before doing so.  Just a few hours earlier I was taking to a man about the year 1958 and I had said that that was the year that the Russians had managed to launch a satellite into Earth orbit … it was called 'Sputnik'.  But the next day (Nov. 1St  today) I looked it up on Wikipedia and found out it was launched in 1957 and fell to Earth in 1958.  Anyway! it seems like an odd coincidence that I would even have the discussion about the first satellite, __  and then just hours later see this strange brilliant white object move in the dark sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115063.html",
      "state": "OK",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a02",
      "summary": "UFO over Oklahoma.",
      "city": "oklahomacity",
      "shape": "changing",
      "date": "2014-10-10T00:00:00",
      "story": "UFO over Oklahoma Just after 12:30 on lunch hour I had gone outside to the designated area to smoke.  I turn to the north eastern part of the sky and see this cylinder shaped object moving at a slow speed from north to south.  It's about the size of a quarter at arms length and pure white in color.  When it got just past halfway middle of the sky it appeared to change shape, like the front half had slowed down and the back end had to catch up and it had a more cigar shape.  Its direction changed to a slow arc toward the sun.  Then in an instant it starts to shape shift probably because the sun was reflecting off of different surfaces, it gave the appearance of rapid movement back and forth and from side to side violently, it would appear in one spot then disappear and instantaneously appear in another spot near to where it previously was then again and again and again maybe 7 or 8 times  looked like it had a different shape each time while continuing in the same direction.  T! hen it shifted 3 or 4 times more only less rapid and growing brighter as it approaches the sun.  It stops at a distance of about a dime held at arms length from the sun and by this time is as bright as the sun like a mirror held up to it, only much smaller.  It stays in that place for about five to six seconds then it appears to back away a little and all of a sudden it's not glowing any more, it is still close to the sun and should be still glowing but it's not, it has stopped reflecting any sunlight at all and  become a darker greyish color thin horizontal bar shape, much less visible than when I first saw it but can still be seen.  It held that position briefly, then it punches out, to a dot in the sky then gone.  I was oblivious to time but I think 4 minutes or so. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114380.html",
      "state": "OK",
      "duration": "~4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b5d",
      "summary": "Group of light orbs in sky  during the day.",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2014-11-26T00:00:00",
      "story": "group of light orbs in sky  during the day was at Hefner park,   looked up at a plane flying by,  but also saw tiny white orbs or something round in shape.  they kept going on and off,  thought they were flock of birds,  but these were way too high,  and going faster than birds.   they didn't have wings.  they were following each other, until they finally disappeared.  tried to take pictures and video but it was too bright.... man. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115620.html",
      "state": "OK",
      "duration": "30  seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d2f",
      "summary": "Three consecutive fireballs with boom white light at an angle toward the earth, the size of road signs at a quarter mile distance. Last",
      "city": "oklahomacity",
      "shape": "fireball",
      "date": "2014-10-03T00:00:00",
      "story": "Three consecutive fireballs with boom white light at an angle toward the earth, the size of road signs at a quarter mile distance.  Lasting all of 15 seconds.   I thought someone was shooting, but I never saw a gun do that nor a meteor do that.",
      "link": "http://www.nuforc.org/webreports/114/S114167.html",
      "state": "OK",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f8b",
      "summary": "Orange lights over Oklahoma City.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2014-08-31T00:00:00",
      "story": "Orange lights over Oklahoma City. I had gone outside to look for a satellite which was supposed to be fairly bright.  As I was looking for it I saw a very bright, very orange light moving much faster than a satellite but much slower than a meteor.  It arced across the sky on a S-N trajectory and finally disappeared rapidly well above the northern horizon.  Then I looked up and saw another one on a what  I would say was a parallel trajectory.  Both were significantly brighter than the brightest view of the ISS I have seen and moving much faster.  There was absolutely no noise. I watched the second one disappear in the same manner.  I went back in the house to tell my wife and was was totally astonished at what I had seen.   After 2-3 minutes I went back outside and there was another one moving overhead.  I called my wife to come look and by the time she got to the door it was past the roofline from where she was when she said, \"I see it!\"  There was another one moving in the same path.   I saw a total of 4 and she saw 1.  There was no trail left by any of the 4.  The bright orange color stayed constant on all 4--no flickering or pieces separating--until they finally disappeared quite rapidly above the norther horizon.  The final two disappeared well above the horizon. I spotted the first one at 8:54 PM central time, the second at ~8:56, the third at ~8:59 and the fourth at ~9:00. ((ADDENDUM FROM WITNESS)) Yes, the correct time is 8:54 pm central time.  Sorry for the error.  I will be curious to see how many other reports there were of these same objects.  ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/113/S113044.html",
      "state": "OK",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c30bc",
      "summary": "Very bright white light moving at high speed west to northeast with no flashing colored lights.",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2014-08-08T00:00:00",
      "story": "Very bright white light moving at high speed west to northeast with no flashing colored lights. Bright light moving at high speed from West to Northeast.   Was a bright light with no colored light or no flashing lights.   Never saw a green or red light.  Much brighter by 10 times than satellites.  Not a high altitude aircraft.  Was as bright or brighter than the brightest star out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112125.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c334c",
      "summary": "White, red, and green lights hover over OKC.",
      "city": "oklahomacity",
      "shape": "unknown",
      "date": "2015-03-20T00:00:00",
      "story": "White, Red, and Green Lights Hover Over OKC. \tAt around 7pm, and I was running out to the car to grab groceries.  As I was walking out of the garage, I noticed a moving light in the sky.  It appeared high enough and fast enough to be your average passenger plane, although I couldn't make out a shape I could only see the lights.  The lights, which were white, had and unusual flicker to them which caught my eye immediately.  I reached into my car to grab some groceries and when I looked back in the sky the craft was now hovering.  My roommate came outside to grab some groceries, when i pointed it out she could tell as well that it unusual.  We watched it for about 10 minutes and it did nothing but flicker its lights and hover.  We finished grabbing groceries and went inside for a few hours. \tI came back out about 2 hours later and the craft was still out, but had moved a large distance to the east.  It was now darker, but I could clearly see the same flickering only this time there were white, green, and red lights.  The craft did nothing more than flicker its lights and hover.  I watched it with a camera this time for some magnification.  The lights seemed to be in a triangle shape, thought I could still not make out a shape of a ship.  The craft seemed to be slowly moving south and after about 10 minutes I went back inside. \tAfter 1 more hour, I came back outside, it was about 10:30-11:00pm, and far to my south was the same craft with the same white, red, and green flickering lights.  It was almost past my horizon line at this point, but the flickering was easy to spot.  The craft seemed to be slowing moving further south still.  At no point during any of the spottings did the craft make any sound.  When I look back on it, almost seems like it was trying to hide in the stars, with the way the lights were flickering, and watch the city. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117822.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3673",
      "summary": "They're here and always have been I know I've seen them and talk with them we r not along.",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2015-01-16T00:00:00",
      "story": "their here and always have been i know I've seen them and talk with them we r not along I live in Oklahoma city in 1975  my husband and my chile and myself I was going to the store and look up over our house and their it was just their I ran back inside to tell my husband and it pass over the house I've never told anyone until now I'm getting old and I just have to say they are here and always have been I've been on their ship and they have been with me even as a chile. I have so much to say but this is enough for now their was just one but their were more in side you could see them from their windows",
      "link": "http://www.nuforc.org/webreports/116/S116718.html",
      "state": "OK",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c36a6",
      "summary": "Driving on interstate 40 through OKC when me and my wife noticed 2 huge clear lookig crafts in the sky... Then 2 more joined.. There wh",
      "city": "oklahomacity",
      "shape": "disk",
      "date": "2015-02-06T00:00:00",
      "story": "Driving on interstate 40 through OKC when me and my wife noticed 2 huge clear looking crafts in the sky...  Then 2 more joined..  There where 3 smaller ones and one huge one...   It was so big but so high in the sky it had to have been the size of 5 plans put together..  We followed these crafts for probably 50 miles on I40 west..   Not once even getting close to them but other small blue lights where also chasing them..   As the sun set we lost sight of them.",
      "link": "http://www.nuforc.org/webreports/117/S117104.html",
      "state": "OK",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c39ce",
      "summary": "Shiny small fast moving object in Oklahoma City",
      "city": "oklahomacity",
      "shape": "changing",
      "date": "2014-12-18T00:00:00",
      "story": "shiny small fast moving object in Oklahoma City my husband and I left Walmart from grocery shopping and was heading east on Hefner Road. I saw a very bright but small shiny object high up in the atmosphere/sky. it was moving very fast and I asked my husband \"what is that\".  he said it has to be a jet or a meteor but we kept watching it and it was moving very fast and stop all of a sudden.  we pulled to the side of the road to continue watching it as it stood still in the sky and then it started disappearing slowly.  we both were speechless and laughed about we had just seen a UFO we had never seen anything like it before.  I wish I would have recorded it it was amazing",
      "link": "http://www.nuforc.org/webreports/116/S116046.html",
      "state": "OK",
      "duration": "01:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c411e",
      "summary": "White, flat UFO in South Oklahoma City.",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2015-05-22T00:00:00",
      "story": "White, flat UFO in South Oklahoma City I was driving east on the Southside of Oklahoma City, when I saw what I thought was a white bird.  I then realized that it didn't have any wings to flap, and it was very still.  It was briefly going south when I saw it, and it, and then disappeared into thin air.  It had nothing to hide behind, but it was there one second and gone the next.  It was white in appearance, and not very large, but was maybe 150 feet away from me?  There was no doubt in my mind that it was a UFO.  There were some clouds behind the object, and that's how I knew it had disappeared into thin air.  Like I said, it was white and sort of flat and long.",
      "link": "http://www.nuforc.org/webreports/118/S118961.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4171",
      "summary": "Stood in driveway of home looking up at stars... noticed a small light moving towards what I thought was a planet glowing because it wa",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2015-05-13T00:00:00",
      "story": "Stood in driveway of home looking up at stars... noticed a small light moving towards what I thought was a planet glowing because it wasn't twinkling light stars do.   As light entered into brilliance of light from planet I waited to see if it would come out the other side.  It did, or so I thought.  It was actually the larger object of two moving. .. as the large orb passed across the smaller star... it stopped. .. then blinked out... completely vanished.   Ever since then I've been getting feeling of being watched. ..  do not wish to be contacted. .. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118927.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c44dd",
      "summary": "Traveling out of Oklahoma City in an empty grass field to my right I was looking and noticed spinning lights. Within seconds the orb li",
      "city": "oklahomacity",
      "shape": "triangle",
      "date": "2015-10-29T00:00:00",
      "story": "Traveling out of Oklahoma City in an empty grass field to my right, I was looking and noticed spinning lights.  Within seconds the orb like ship was taking off, and appeared with white fluorescent lights.",
      "link": "http://www.nuforc.org/webreports/122/S122904.html",
      "state": "OK",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c49a4",
      "summary": "Unkown formation over OKC.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2015-10-29T00:00:00",
      "story": "unkown formation over OKC While sitting on my front porch, I spied two large flashing Red lights (separated by 1/4 appx) being followed by a conventional jet aircraft.  They were traveling due east and appeared to be at least 50,000 ft(or higher as there was no noise) in altitude and traveling at a higher rate than normal Airliner traffic.  I could clearly see the red/green wing lights of the Jet, but the lead objects only had one very large distinctly red light apiece.  They appeared to be flying an erratic but albeit relatively straight line due east...  Clear crisp cool night with a rising full moon and a North wind of only 3-4mph.  Unlimited visibility cloudless sky...",
      "link": "http://www.nuforc.org/webreports/123/S123180.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5130",
      "summary": "At 3:30 on in February 9th 2016, I stepped outside to smoke a cigarette and my 2yr old said she saw a &quot;plane,&quot; note that she",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2016-02-11T00:00:00",
      "story": "At 3:30 on in February 9th, 2016, I stepped outside to smoke a cigarette and my 2-yr old said she saw a \"plane.\" At 3:30 on in February 9th, 2016, I stepped outside to smoke a cigarette and my 2 yr old said she saw a \"plane,\" note that she calls everything planes if it flies high in the sky,  I proceed to look east and that's when I saw the object. It was a Large Silver Circular object that had what looked like a dome with 2 large lights or windows.  The object flew from left to right, away from me.  It made no sound. When I first saw it I knew 100% it was not a plane or a helicopter because we have heavy air traffic directly above our house.  My first though was \"oh my god that was a ufo I have to report it!\"  The object continues its E to SE flight path until I could not longer see it because the the trees.  And I then called the hotline number.",
      "link": "http://www.nuforc.org/webreports/125/S125730.html",
      "state": "OK",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c510c",
      "summary": "Stationary star-like object that completely turned on and off at regular intervals.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2016-02-04T00:00:00",
      "story": "Stationary star-like object that completely turned on and off at regular intervals. I saw a stationary star-like object in the SSE sky that completely turned on and off at regular intervals like an airplane light.  While it was visible, it twinkled like a star would do before fading to a yellowish hue and disappearing while still flashing. It was of similar color to Sirius but not quite as bright and was about 25 or 30 degrees above the horizon.  It looked exactly like what a star would look like if somebody were turning it on and off like a light bulb once per second. Airplane lights aren't this bright and don't twinkle like a star.  Sirius rose an hour later. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125526.html",
      "state": "OK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5275",
      "summary": "Floating titanium, metallic, football-shaped UFO seen up close.  ((NUFORC Note:  Witness is former Boeing empl.  PD))",
      "city": "oklahomacity",
      "shape": "egg",
      "date": "2016-01-23T00:00:00",
      "story": "Floating titanium metalic football shaped UFO seen up close over a lunchtime gathering. (This was previously reported years ago and it is shown incorrectly in your database as occurring on 7 January 1980, rather than correctly on 7 June 1980.  Please revise.)   I was part of a group having lunch at a Wendy's restaurant with 8 others.  I was a local college student.  One man had his Ph.D. in history.  Two were recent high school graduates with one of them to enter MIT 2 months later.  The others were high school students who though they watched the UFO, didn't seem at all much interested in what was happening. The restaurant was in a shopping center parking lot on the south side of I-240, facing north, about 150 feet due east of South Pennsylvania Avenue.  I and three others were positioned inside at the table next to the window facing north.  The others in our group were scattered towards the middle of the dining room. The weather was above 90F with a clear blue sky and a stiff southerly wind blowing between 20 and 30 mph.  This location was directly between Will Rogers International Airport 3 miles to the west/southwest and Tinker Air Force Base about 7 miles to the east. The professor at my table looked out the window and said: \"Look at that!\"  We looked up and out the window to the north across the frontage road and the highway to see a floating object just on the other side of the highway.  It was hovering about 25 feet above a field and no more than 200 feet due north of us.  The field to the north side of the highway was at least a 20 acre vacant field with houses on the north side of the field, Pennsylvania avenue on the west side, and the I-240 highway on the south side.  The field nowadays has been built up with several businesses.  Many cars sped along the highway, and I didn't notice one car slowing down to look at the object. The object was easy to size relative to the cars speeding by and was a football shaped, titanium colored metallic appearing \"egg shaped football,\" about the width of a stretch limousine, while not as tall.  Picture it in the proportion of a football with no visible means of propulsion engines.  It appeared to be morphing on the left and right side in a way that it was slightly narrowing and then lengthening.  The titanium colored skin appeared to be rotating on the horizontal axis and then next on the vertical axis.  All of this again while morphing in width from end to end.  I must say I have no idea exactly what it was as I've never seen anything like it. The object was, as I've stated, floating above the field in a stationary position while we commented on it.  The professor stated that this was the second time he had seen something like this as the previous sighting was many years previous when he lived in Springfield, MO.  He then was driving outside of town with another man and they saw a cigar-shaped object above their car.  No further information on that cigar object is available. Before continuing, the reader must understand that I was a builder and flier of radio control model airplanes and knew extensively all the particulars of aerodynamics.  I later after college worked for Boeing in Industrial Engineering and Manufacturing Research and Development. I first thought \"could this be a reflection in the glass?\"  So, I cupped my hands around my face against the glass pane and it looked the same.  I then got up and went outside into the parking lot and it looked the same without any sound, other than the howling south wind.  I knew in no way could it be a balloon of any type with that wind howling as such and the object remaining stationary.   I next walked about 50 feet due west to get a different sight angle relative to the sun.  It looked the same.  I even waved at it to cross over the highway towards me!  It didn't move.   After about 1 more minute, it started slowly moving straight west parallel to the highway about 5 mph.  I went inside.  We watched it continue west about 150 feet until it got to Pennsylvania Avenue, and it curled to the north.  It traveled north on the east side of the street and started inclining at about a 2 degree ascent while gradually gaining speed.  I'd estimate it was eventually moving at nearly 60mph.  It continued straight north until it disappeared out of site over the city. Years later, I worked with many manufacturing techniques and materials at Boeing.  We manufactured titanium parts using a \"super plastic forming\" method for the V-22 Osprey and F-22 Fighter, which resulted in much the same appearance as I saw reflected in the outer skin of that UFO.  No skin seams or rivets - just one smooth continuous outer skin surface.  Another manufacturing method that comes to mind is the now popular 3-D printing.",
      "link": "http://www.nuforc.org/webreports/125/S125408.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5793",
      "summary": "Light stationary in sky.  Became bright then faded. Approximately 20 seconds later vanished completely.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2016-07-08T00:00:00",
      "story": "Light stationary in sky.   Became bright then faded.  Approximately 20 seconds; later vanished completely.",
      "link": "http://www.nuforc.org/webreports/128/S128306.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c595b",
      "summary": "Orange light moving across sky.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2016-05-26T00:00:00",
      "story": "Orange light moving across sky Husband and I were out back looking at the moon and Mars.  I had my phone out using skymap.  Suddenly we noticed a bright orange light under the moon right by Mars, took a pic, then a video. It moved from east to west, completely horizontal - way below the clouds.  No sound, no smoke trail.  Car alarms were going off. When it got to the far west in about 40 seconds, the light blinked out but the object could still be seen against the clouds until it got lost behind trees.",
      "link": "http://www.nuforc.org/webreports/127/S127431.html",
      "state": "OK",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c1b",
      "summary": "Very large orange light in the sky with the moon to the south east of Oklahoma City, Oklahoma.",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2016-04-01T00:00:00",
      "story": "Very large orange light in the sky with the moon to the south east of Oklahoma City, Oklahoma. Me and son were driving by the  state capitol and saw a red light in the sky to the east.  The light was the top half of a sphere.  The object was bright orange and phased out after we looked at it for about 10 seconds.  The moon was to the south of the object.",
      "link": "http://www.nuforc.org/webreports/126/S126561.html",
      "state": "OK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fdf",
      "summary": "Was standing outside with my boyfriend as it was about to storm. I was taking pictures of the sky and we thought something seemed kind",
      "city": "oklahomacity",
      "shape": "unknown",
      "date": "2016-09-30T00:00:00",
      "story": "Was standing outside with my boyfriend as it was about to storm. I was taking pictures of the sky and we thought something seemed kind of odd about some of the clouds and things just seemed a bit off.  Later, while reviewing the pictures I'd taken, I noticed a couple had something in them I hadn't seen with my naked eye at the time.  http://m.imgur.com/a/hM3Lg",
      "link": "http://www.nuforc.org/webreports/130/S130187.html",
      "state": "OK",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c61a6",
      "summary": "Witnessed a white, perfect circle, moving quickly through an otherwise clear sky.",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2016-10-13T00:00:00",
      "story": "Witnessed a white, perfect circle, moving quickly through an otherwise clear sky. I looked out my work window in far south OKC (near Moore) and observed a bright, white perfectly circular object moving quickly in the sky.  The sky was clear, blue and free of any clouds.   I went to tell someone else and as I did, the object ascended higher and disappeared.",
      "link": "http://www.nuforc.org/webreports/130/S130569.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6165",
      "summary": "I thought I saw an aircraft circling but it looked more like a thick mist it kept moving and changing....it looked close to the airport",
      "city": "oklahomacity",
      "shape": "changing",
      "date": "2016-09-22T00:00:00",
      "story": "I thought I saw an aircraft circling but it looked more like a thick mist it kept moving and changing....it looked close to the airport.",
      "link": "http://www.nuforc.org/webreports/130/S130006.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c680a",
      "summary": "circleler object with whitem red, green lights moving in a circle and then saw another object apear and go inside object with lights.",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2017-04-07T00:00:00",
      "story": "circleler object with whitem red, green lights moving in a circle and then saw another object apear and go inside object with lights. In the SE sky over Oklahoma City, OK, around 23:00 saw circle object with white, red, green lights moving in different directions.  At one time saw a 2nd object enter the larger 1st object.  Stayed in sky for over 1 hr.  Object would move around at one time signed bright white light straight at us then after that is when we saw another object enter larger one.",
      "link": "http://www.nuforc.org/webreports/133/S133335.html",
      "state": "OK",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6806",
      "summary": "Small, square, shiny objects circling like paper falling.",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2017-04-07T00:00:00",
      "story": "small squre shiny objects circling like paper falling The sky was blue except for 4 contrails from aircraft.  No storms were called for that day and winds were probably 7mph at the time.  I was walking at the park on the trail and saw a Drone flying above the park.  I stopped to look at it but it turned.  I continued to walk.  Then the drone came back into my view.  When I looked up to see the drone, something flashing in the sky to the left of the drone caught my attention.   At first, I thought it was birds, but realized that they objects were too high up to be birds.  The objects began to descend.  It was then I realized that there were at least 6 or more objects.  They were square and for a second I thought they were ticker tape pieces of paper flying in the blue area of the sky.  But then they began to circle each other and move in away that made me realize it was not paper.   The color of the squares were a translucent white and reminded me of mother of pearl.  The objects circles and flittered around for a minute but then! went up into a contrail.  They kind of disappeared at that point then someone asked me what I was looking at and when I looked back up they were gone or had blended into the contrail.  I could not see them anymore.",
      "link": "http://www.nuforc.org/webreports/133/S133333.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c3c",
      "summary": "Flare-like object, like a fireball with no tail.",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2017-01-06T00:00:00",
      "story": "Flare-like object, like a fireball with no tail. On Thursday 26 October 2016, at 1910, sighting occurred in Oklahoma City around NW 50th & Portland Avenue.  Three of us were on our way to a family function, when we were getting in the vehicle 1 of us looked straight up into the sky & witnessed a BRIGHT orange flare like object. \tThe object moved in a straight line traveling north, I observed the object through binoculars.  Another took several photographs. \tFrom the time I observed this object, straight overhead, until we could no longer see it was about 3 minutes.  At the time this occurred there were no stars visible. \tWe immediately contacted a local tv station & newspaper.  The next day we contacted NORAD & the local astronomy club. \tCommon opinion amongst my little group is that it was a satellite reflecting the sun.  Although, no satellites were listed to be visible at that time.",
      "link": "http://www.nuforc.org/webreports/132/S132001.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c70d4",
      "summary": "Extra bonus 4th of July 2017 in Oklahoma City.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2017-07-14T00:00:00",
      "story": "Extra bonus 4th of July 2017 in Oklahoma City. After going into the backyard to watch the fireworks, we saw two light hovering above the firework display.  Another appeared below it and to the right.   We recorded 15 minutes of it with a cell phone.  It was flashing non-stop between red, green, and white.  We thought it was a helicopter, since it did not move at all for almost the whole time, but we could not hear the rotor.  It was pretty loud during the firework display, but in between the fireworks we should have been able to hear if it was a helicopter.   Another flashing object appeared under it and to the right.  That object was flashing at about half the speed of the first one.   A third object flew across the sky, but the camera phone was unable to pick it up.  We both saw the third one fly through the smoke of the fireworks.   I have it recorded, and would happily email it to your team.  The problem is that the video is 1.86 GB in size, and I have no idea how to send a file that large.",
      "link": "http://www.nuforc.org/webreports/135/S135064.html",
      "state": "OK",
      "duration": "15+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c71b0",
      "summary": "Light appears over South OKC and seemingly defies physics by disappearing between light pulses and reappearing miles away.",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2017-07-07T00:00:00",
      "story": "Light appears over South OKC and seemingly defies physics by disappearing between light pulses and reappearing miles away. Sitting on first floor apartment porch behind my mother and with two of my mother's work friends around 21:00, the sky was mostly dark with a small hint of sunlight left.  I noticed a bright red light out of the corner of my right eye hovering over another apartment building.  Not right over the complex, but a couple of miles East of our location.   I turned my head to look in that direction, as I turned my head the red light went away and became a small white blinking light.  It hovered in the same spot for a bit before moving. When moving, the light pulsed out and it reappeared in another spot.  Each time it moved, it moved West towards our apartment complex.   There was a pillar blocking my mother's view, so she didn't notice it until it was almost directly over the complex.  I hadn't said anything to her at this point thinkng it would disappear and I wouldn't be believed.  As it stopped and hovered over the complex, my mother and I stared at it without words, she was still unaware I had been watching it way before she noticed it.   Then it started to pulse green and as it did, its light grew bigger and brighter, along with some sporadic movements around the area in which it had been hovering.  Finally it moved in the same manner, seemingly jumping from spot to spot between light pulses towards the North and out of view.  Multiple times before its seemingly laws-of-physics-defying movements to the North. my mother vocalized her thought that it must be a helicopter before its light turned green.  Needless to say, her helicopter theory was shot down as our jaws dropped in awe when it seemingly disappeared and reappeared miles away.  Certainly no human could endure that type of acceleration and G forces without being fatally injured.   No actual object was viewed, just the light.   This was both mine and my mother's first UFO experience.",
      "link": "http://www.nuforc.org/webreports/134/S134935.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c78ce",
      "summary": "Was enjoying lunch at an Oklahoma City restaurant, looking out at clear, blue sky. Jets were flying by and leaving white contrails behi",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2017-12-14T00:00:00",
      "story": "Was enjoying lunch at an Oklahoma City restaurant, looking out at clear, blue sky.  Jets were flying by and leaving white contrails behind. Suddenly, as the contrail dissipated, a spherical, black object \"popped\" out of it and seemed to \"fall\" from a great height toward the earth.  As it did, it seemed to change color from black to a silvery white, before I lost sight of it.",
      "link": "http://www.nuforc.org/webreports/137/S137766.html",
      "state": "OK",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7973",
      "summary": "Went outside to smoke to cigarette,heard the  police helicopter flying in the distance an looked up an seen 4 dim Orange light flying i",
      "city": "oklahomacity",
      "shape": "formation",
      "date": "2017-11-03T00:00:00",
      "story": "Went outside to smoke to cigarette,heard the  police helicopter flying in the distance an looked up an seen 4 dim Orange light flying in staggered formation quietly.  Anyone else catch them? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136922.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c805b",
      "summary": "I saw 3 UFOs in the westward sky.",
      "city": "oklahomacity",
      "shape": "disk",
      "date": "2018-03-23T00:00:00",
      "story": "I saw 3 UFOs in the westward sky. I was headed west on I-40 out of Oklahoma City and saw 3 disk like shapes ahead of me.   This occurred around 6:30pm.  I saw these for the remainder of my drive for about 3 miles to Yukon, OK. The sky was light and these 3 UFOs were solid lights in the sky and they were not moving just hovering.",
      "link": "http://www.nuforc.org/webreports/139/S139172.html",
      "state": "OK",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c81a4",
      "summary": "Red balls of light fly low over residential area.",
      "city": "oklahomacity",
      "shape": "sphere",
      "date": "2018-01-25T00:00:00",
      "story": "Red balls of light fly low over residential area. Eight red ball of light flew together, low, just above the tree line. The lights passed across Council Rd., heading West.  I saw them just before I turned West, into my Addition.  I watched them and kept an eye on them as I passed each block. Looking South down each street I passed; they were there.  I accelerated to 45 MPH to get home and retrieve my camera.  They kept up with my speed.  I turned South onto my street, I saw them flying slowly over the trees at the end of the block. I pulled into my driveway and jumped out.  I heard my next door neighbor's front door shut, I ran over and knocked; saying, \"You've got to come out and see this!\"  He and his friend were witnesses to these lights.  We watched them, their comment was, \"Those aren't planes,\" as there was no sound coming from them!  I then ran to my house and got my camera, they had thinned out and were now heading North.  I filmed them. (in viewing my video the red balls looked as if they were tumbling).  After filming I didn't see them anymore.   I got in my car and and drove South, to the other side of the addition.  I saw one in the sky heading West.   I drove onto the main road and did a U-turn, parked on the side of the road.  I got out ready to film, I saw it disappear.  It was gone, like that!   I posted my video to YouTube.  I have the video as evidence.   https://www.youtube.com/watch?v=7z27zZcS_Lw ((ADDENDUM FROM WITNESS)) Dear Mr. Davenport,  I appreciate you getting back with me so quickly.  I've filmed lanterns before and they will emit a swaying, flickering light from inside.  Also, lanterns will rise in altitude.  These red lights kept their same altitude; 40 to 50 feet above the ground. They were flying (west) close together for 5 blocks,  (They also kept up with my speed increase).   They started spreading out and heading North, when I came back out with my camera and filmed them, they were continuing North, then completely disappeared; lanterns don't do that.  That's when I drove to the other side of my addition to see if there were anymore.  I saw one in the sky and it disappeared as I started to film.   I've had several UFO/UAP  experiences and only reported two sightings, this one with y'all and one with MUFON that happened in 1970, (quite significant).  I've been filming since 2012 and have captured many anomalies with my camera and night vision.  In 2016 I started my own Meetup Group, OKC UFO.  It has been therapeutic for me and other members, as we need an outlet to share our experiences and try to understand the UFO phenomena.  Makes life interesting, defies logic and challenges our reality for sure! Sincerely, ((name deleted)) ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/138/S138519.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c822b",
      "summary": "Pulsating orange light with a odd circle figure that disappeared",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2018-01-18T00:00:00",
      "story": "Pulsating orange light with a odd circle figure that disappeared. Heading to friends house while riding with him he noticed the light orange light in the sky down the street from his house.  Once we got out of the car, the 3 of us stand there and watch this huge orange light in the sky off the to northwest this orange light was pulsating in the sky getting brighter and dimmer as with that there is a small object just below it that’s moved side to side and disappeard but the orange light in the sky was still pulsating. ((NUFORC Note:  We spoke via telephone with the witness, and he attested to the accuracy and reliability of the report.  He stated that he has video, and will send it to our Center, to corroborate his report.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138386.html",
      "state": "OK",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8748",
      "summary": "Gold cheverons flying in deep space",
      "city": "oklahomacity",
      "shape": "chevron",
      "date": "2018-07-13T00:00:00",
      "story": "Gold cheverons flying in deep space Two Golden Cheverons flying in formation from south to north in the eastern sky.  I saw them in my telescope.  They were very far away but left flecks of gold in their path.  Like a sparkler has anybody else seen hem? ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  Time is not indicated by the witness, and she provides no contact information  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142137.html",
      "state": "OK",
      "duration": "Few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c88c0",
      "summary": "Object sitting in the sky not moving",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2018-06-21T00:00:00",
      "story": "Object sitting in the sky not moving I had walked outside to check my mail and when I was walking back I looked up to West and observed an object in the sky.   It was far away and very high up with bright white lights on the bottom and what looked to be a red light on top.  It was not moving and sat in the same place in the sky for several minutes.   I went back inside and got my phone and came back out to take a picture of it.  I took several pictures using my IPhone 7 and watched it for about 5 more minutes.  It still did not move, did not get further away or closer.",
      "link": "http://www.nuforc.org/webreports/141/S141879.html",
      "state": "OK",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8903",
      "summary": "SEVERAL LIGHTS ACROSS THE BOTTOM NOT BLINKING",
      "city": "oklahomacity",
      "shape": "cone",
      "date": "2018-06-15T00:00:00",
      "story": "SEVERAL LIGHTS ACROSS THE BOTTOM NOT BLINKING IT HAD LIGHTS AROUND BOTTOM OF VESSEL AND I COULD SEE SHADOW OF THE TOP.  COULD NOT TELL EXACT SHAPE.  HOOVERED FROM MIDNIGHT UNTIL 3:30AM AND I SHOWED MY ROOMATE AS HE WAS LEAVING FOR WORK AT 3:30AM.  LOOKED AGAIN AT 4:15AM AND DIDNT SEE IT.",
      "link": "http://www.nuforc.org/webreports/141/S141815.html",
      "state": "OK",
      "duration": "3.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c8928",
      "summary": "Quiet, steel, flying saucer shaped vehicle flew to me and friend. It came from North. Flew South to us. But di",
      "city": "oklahomacity",
      "shape": "disk",
      "date": "2019-09-06T00:00:00",
      "story": "SW 15th & Indiana okc ok  Quiet, steel flying saucer shaped vehicle flew to me and friend. It came from North. Flew South to us. But didn't seem to come from miles and miles away. .....  Seemed like it just came into our view from another side of black sky wall.  Just came out and was in view. It approached slowly  Then in clear view about as high as  building (30-40 stories) hovered as if facing us.  And was about 2 city blocks distance north. We were its focal point. We were 15 & 18.  No alcohol or drugs ever used.  Pure, welcoming,  No fear. Curious. The night was clear, quiet.  Neighborhood asleep. We kept looking at it.  It just stayed there as if eyes on us.  Then a super bright white light beam was down on us before we knew it.  We could see the direction of beam was exactly shining on us.  But when we looked on our arms, legs each other.....there was no light. When we looked in front it was ending on us  It was not behind, or beside. It was directly from the vehicle very high intensity bright light beam. It remained exactly on us. But not visible on us. For about 45 minutes total  Then retracted. And saucer retreated backwards from where it came. Straight. Back North & before very far disappeared again like going back through a curtain . I have always joked to my children I was an alien. Higher intelligence. Not like the rest. No human attachment. Paranormal experiences with orbs, visions. Energy sillouettes. Premonitions. Clairvoyant. I just know things. And funny thing is....I haven't thought about this until a friend was speaking on the subject of UFOs last night.  It has been 40 years since I saw it at age 15. I'm 55 now. Thank you. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148657.html",
      "state": "OK",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b14",
      "summary": "lights floating in the air",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2019-03-14T00:00:00",
      "story": "lights floating in the air This is an old one, but I want to tell it.  I worked afternoons in Oklahoma City and was commuting  back home down the freeway one night.  There was a lot of traffic going both ways. I was heading east on I40 near Choctaw OK and noticed a couple of lights off to the left, north of the freeway, up in the sky.  At first, I thought it was an airplane as Tinker AFB was about 5 miles away, I just went past it minutes earlier.  Here I was, driving down one hill and heading back up another, when I noticed a pair of lights that were stationary up in the sky, north of the freeway.  Just floating maybe a hundred feet up or two hundred. I thought it was weird, because I thought it was incoming aircraft like right next to each other in the sky.  Maybe 50 feet or a hundred feet apart.  Way too far apart to be a helicopter.  They did not move at all, and I thought maybe it was a work crew on a cell tower, with lights, but drove back to work the next day in the daylight and there ! was no tower there, or anything else.  Then a couple of nights later I saw the same thing, same area but south of the freeway.  My buddy was retired Air Force,  I asked him did the Air Force have anything like it and he just shook his head no. I opened my window, and tried to see it, but traffic was moving fast so I just drove on.  All I could hear was the traffic and the wind. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145069.html",
      "state": "OK",
      "duration": "Few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8c63",
      "summary": "Glowing lights or orbs in NW Oklahoma City.",
      "city": "oklahomacity",
      "shape": "circle",
      "date": "2019-02-07T00:00:00",
      "story": "Glowing lights or orbs in NW Oklahoma City. December 23, 2015, at approximately 10:07 PM, l was in the area of NW Expressway and Council Rd,.  I was getting out of my car in the neighborhood and observed several glowing lights, no noise or sounds of any kind moving around in the sky.  Some moved fast, or circular motion, flickered on on off and moved in ways unexplainable.   It caught the attention of everyone in the neighborhood and we all began to film but we did not see anything on the news about any events or light shows on tv.  We though maybe the flame bag hot air things that will float up, but these moved in circles, circle in shape, moved fast , slow, backwards...every direction and angles.  The strangest thing I've ever seen. Any ideas?",
      "link": "http://www.nuforc.org/webreports/144/S144772.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8c5e",
      "summary": "Flying object seen over Oklahoma City.",
      "city": "oklahomacity",
      "shape": "changing",
      "date": "2019-02-01T00:00:00",
      "story": "Flying object seen over Oklahoma City. Driving home from Edmond, saw a weird shaped cloud.  It was like when a jet takes off leaves the cloud going from small to large.  But this was backwards, the cloud looked like it came from above the clouds and coming in.   My wife saw this white diamond light shape in the sky next to it hovering/sitting still.  As we are driving home, it disappeared and reappeared.  Then she said it's moving up it's going up, she started taking a video of it.  It appeared as if it was moving up at a high rate of speed, then it slowed down.  She recorded for awhile, then it vanished.   I pulled into a gas station to see clearly but it was gone.  At one point it changed colors, it was bright white like a lamp, but then turned black and back to white again.",
      "link": "http://www.nuforc.org/webreports/144/S144641.html",
      "state": "OK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d07",
      "summary": "A large Photographed Triangular UFO over Oklahoma City.",
      "city": "oklahomacity",
      "shape": "triangle",
      "date": "2019-01-24T00:00:00",
      "story": "A large Photographed Triangular UFO over Oklahoma City. A large Triangular object with three lights on each side.  You could see the actuall ship, not just the lights.  I have a  photo of it.   It hovered and stayed for 45 minutes and just completely vanished.  The strange thing is that this same UFO was spotted in 2017 in the same area.  It seems to come every 2-5 months.   It made no sound.  It was very noticeable, but nobody seemed to pay attention to it.  None of the lights blinked or turned off.",
      "link": "http://www.nuforc.org/webreports/144/S144592.html",
      "state": "OK",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fdb",
      "summary": "Object headed N and quickly made a correction into the S direction unlike any plane I have ever witnessed.  ((anonymous report))",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2018-11-24T00:00:00",
      "story": "I observed one aircraft which looked like an ordinary airplane as far as I could tell.  I heard a loud roaring and when I finally caught sight of the aircraft it was headed north and quickly made a correction into the southern direction unlike any plane I have ever witnessed.    Seconds after that I lost sight of it, but could still hear the very loud engine sound.  Seconds later I witnessed a contrail a ways from my last sighting and it appeared in a dash like pattern and the engine sound continued for a few more seconds and then suddenly stopped.  Again, this may sound mundane, but it corrected itself in the opposite direction so quickly, I've never witnessed this and I have attended many airshows over my lifetime.  I watch planes a lot in the sky because I have always had a fascination with them. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143833.html",
      "state": "OK",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c93a5",
      "summary": "Looked like a meteor appeared out of no where",
      "city": "oklahomacity",
      "shape": "flash",
      "date": "2019-12-01T00:00:00",
      "story": "Looked like a meteor appeared out of no where something just appeared in the middle of the sky over Choctaw and shot straight down to the ground like a meteor.",
      "link": "http://www.nuforc.org/webreports/150/S150329.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c9480",
      "summary": "Multiple ongoing encounters with triangular objects that have un-fathomable speed.",
      "city": "oklahomacity",
      "shape": "other",
      "date": "2019-12-19T00:00:00",
      "story": "Multiple ongoing encounters with triangular objects that have un-fathomable speed. Hi I have witnessed craft every night now for 3 months I know that may sound crazy but it very true I am a very sane person to tell the truth I never believed in this stuff. 3 months ago I began noticing starange lights in sky . I started climbing on the roof at night one night I woke up on the roof after falling asleep and all around me was a smoke or cloud like substance that had a weird smell and I looked and not 10 feet from my face to my left was a very very large craft it looked as if it was made from black glass very sleek . I was very shocked that it made no sound. It slowly backed up about 50 yards and very fastly was gone at first I thought it disappeared but it just zipped off well without sound. Since then I have saw other types of craft and also more of the triangles also. The craft are coming progressively closer each night about 2 weeks ago I started seeing another style of craft very close every night I’m not really sure why me why they are n! ear me but every night even when I leave my home I see the triangle ships follow me through my whole trip. I had contacted mufon when all this all began at first the ships used to stay farther out but mufon sent a investigator who was amazed and confirmed the sighting of these craft. Now these craft come substantially closer every single night for the last 3 months these ships always has some type of cloud substance around them I believe they somehow create this stuff because it help conseal  them. Something I might also add ever since contacting mufon I have also been seeing a lot of drones following me which I believe could be government drones I see a very large drone a lot very very close and this drone is a large square platform type drone with a wheel at all four corners and it has multiple cameras the difference in these drones and why I believe they are government is these things are semi loud to extremely loud and all the exterterestial craft is silent. I’m not sur! e of your procedures but I hope they are different because I w! as very disappointed in how my experience with them was very underwhelming. I decided to reach out to ufo center because yesterday I believe I was possibly abducted for the second time, I contacted mufon after the first. I don’t remember but small bits but the whole day is missing for both me and my girlfriend the first abduction I had a small incision on the back on my head and she had something protruding from her ear lobe. This time she had no marks but I have a small incision to my lower left back.",
      "link": "http://www.nuforc.org/webreports/151/S151274.html",
      "state": "OK",
      "duration": "Continues"
    },
    {
      "_id": "64d005f478aba2ec5a3c9806",
      "summary": "Fastest lights ever seen",
      "city": "oklahomacity",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Fastest lights ever seen I saw a beam of light moving faster than I've ever seen anything move before, going several directions, moving in a way no machine could. I thought it may have been lights used for advertising but the directions and speed this was moving in was not only impossible but also wouldn't make any sense.",
      "link": "http://www.nuforc.org/webreports/151/S151632.html",
      "state": "OK",
      "duration": "2 seconds"
    }
  ]
}