{
  "city": "omaha",
  "fetch_timestamp": "2025-07-12T14:32:31.148091",
  "record_count": 125,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b42a1",
      "summary": "ufo spotted near hospital during labor and tornados.",
      "city": "omaha",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "ufo spotted near hospital during labor and tornados. I wa the only witness as far as i know I was in labor with my youngest child he was bor at 4:20 the following morning there were tornado warnings and a large thunderstorm in the area at the time I was looking out the window to try and relax and i saw it .  I didnt say anything at the time because i thought it was the drugs I was on but I found out later that they had given me drugs at least 3 times and. after the event it was as if my body was rejecting them I could feel all the pain of my labor and the hospital still doesnt know why .  the nurse said they had given me enough drugs to put me to sleep or enough so that i wouldnt be able to walk for at least a week. I asked my boyfriend at the time if he could see it to and he didnt even look they just closed the blinds. but before they could i saw a lighting strick just bounce off it and hit a light pole.",
      "link": "http://www.nuforc.org/webreports/050/S50158.html",
      "state": "NE",
      "duration": "5 min.s"
    },
    {
      "_id": "64d005f478aba2ec5a3b4494",
      "summary": "UFO seen as low as 65 feet!!!!!!",
      "city": "omaha",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "UFO seen as low as 65 feet!!!!!! I was on my way home, and was driving on the interstate. I saw a bright light almost 3 miles away but could'nt tell what it was.   About 2 miles ahead, I could see something hovering above the interstate overpass.  And as i came closer, I could see that it was only maybe 90ft. in the air!  I could see people standing outside and other people slowing down, almost to a complete stop just to look at it.  It had 3 lights on it, and all were at the front of the aircraft. The colors were red and a bright floressant white color.  The aircraft it self was probably about 35-45 ft. in width, and to be honest, I really can't tell what color it was. The color of it was almost midnight or camoflauge.",
      "link": "http://www.nuforc.org/webreports/050/S50247.html",
      "state": "NE",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4625",
      "summary": "Troubles With Unexplained Laser Beams",
      "city": "omaha",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "Troubles With Unexplained Laser Beams My wife and I have been seeing during the day a few strange oval shaped type craft above our home, they appear to be using the Sun as a form of absorption if that makes any sense whatsoever.  We have called numerous individuals as well as several agencies without any help in return. During the day they appear on film and we have them recorded, yet to the plain ordinary eye they are not visible. When my wife and I first seen them we were filming our 6 year old son flying his kite when we first noticed them.  The same evening when this first occurred we had an experience that is still ongoing. At first we assumed that a child had a laser pointer, we seen a red laser enter into our master bedroom and literally bounced off our walls, our 6 year old son yelled at the same time and had the same red beam of light in his bedroom and that evening needless to say he slept with us.  We cannot explain this without coming across as insane, yet we are getting no help in regards to whom we have currently contacted. We now see these red beams during the day in our home and after trying to record them on film they disappear. Our son is petrified due to he stated that these red beams were talking to him and after we asked him what he meant he stated they were spelling out words as well as language to him.  I will not go into any detail as to what these beams have spelled out, we are in fear that it will get worse if even possible at this point in time. They claim to not be from Earth, furthermore they claim to do us harm.  We are at a dead end and ready to move and we are searching for anyone else in or around the Omaha area who has witnessed anything similar. These beams have been everywhere in our home and the troubling thing is what they spell out.  Again, in closing,  we only hope someone here might have had any similar problems with these types of beams and what have you done to stop them? We are one step away from moving. The language they have expressed through writing for a better word has been anything but friendly.  When these beams enter our home our 6 year old son knows right away, directly above our home we hear a very loud humming, almost a whirling sound.",
      "link": "http://www.nuforc.org/webreports/050/S50404.html",
      "state": "NE",
      "duration": "2 Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b4674",
      "summary": "Triangular-shaped, low-flying aircraft hovering over Omaha city street.",
      "city": "omaha",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "triangular-shaped, low-flying aircraft hovering over Omaha city street. Triangular shaped object with white lights around the perimeter hovering over North 52nd Street about 16 blocks north of Dodge Street.  Driver ahead of my daughter (who reported the sighting) stopped the car and stuck his/her head out the window to watch.   The vehicle moved off and my daughter came home only a couple of minutes past curfew, so I'm sure she wasn't abducted:) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50510.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4c06",
      "summary": "VERY FAST circular object in SE Illinois headed North at high altitude. SUDDENLY turned VERY BRIGHT while enlarging!",
      "city": "omaha",
      "shape": "oval",
      "date": "2019-06-27T00:00:00",
      "story": "VERY FAST circular object in SE Illinois headed North at high altitude. SUDDENLY turned VERY BRIGHT while enlarging! Observed from patio with my girlfriend.  VERY fast circular object at what seemed to be very high altitude.  Headed directly North straight overhead.  Had a faint white color until it suddenly produced an impressive VERY BRIGHT light appearance  from the oval shape and enlarging the size of the object 3 times the original size.  The brightness lasted approx 3-4 seconds and then went back to the faint white color again.  Object maintained its super fast speed throughout the process and quickly disappeared from naked eye observation while continuing its direct North heading.  The event prompted us to find a way to report it as it was quite profound and something neither of us has ever seen (we are in our 50s).",
      "link": "http://www.nuforc.org/webreports/146/S146998.html",
      "state": "IL",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5235",
      "summary": "U.F.O hovering over trees in Nebraska",
      "city": "omaha",
      "shape": "oval",
      "date": "2008-06-12T00:00:00",
      "story": "U.F.O hovering over trees in Nebraska I was 13 years old when I had my one and only true U.F.O sighting/experience. It was around 10:30pm when my mother, brother and I had just gotten home from an event. We lived on a horse shoe street which was somewhat surrounded by tall trees (50 feet plus). We had just pulled in the drive way and as we were getting out of the car my mother says \"What is that?\" and as plain as day hovering about these tall trees was a U.F.O. My brother says that’s a flying saucer. There is no doubt to what we are seeing. This is visible no more than 200 feet away. This saucer length had to be at least 6-8 maybe more diesels long all lined up together. I was amazed at what I was seeing. I just could not believe my own eyes. This saucer hovered over these trees for 5-10min. It had several white lights around the outer part. After 5-10min it began to rise slowly and I mean slowly and with in a few seconds it took off at an angle leaving just a tracer of its path and it was gone. I can close my eyes today and see it all over. I will NEVER forget. I look to the sky all the time hoping to see one again.  Also, I myself have experience what I believe was an alien encounter. I believe this occurred after the sighting not sure of the date/time but there was light outside. I was sitting in my bed reading a book and my back is to the bed room entrance. So, I’m reading and I feel 3 taps on my left shoulder and mentally I’m assuming it’s my brother and as I turn and look over my shoulder I see a white figure with an oval shaped head and black oval eyes and I freaked out . I jumped up and ran out of my house. I’ve seen this figure described on television by other people whom have claimed of seeing aliens but some people say its grey or some color but what I saw was white. It freaks me out to even think about it. I believe there are chosen people to see the things we see and I feel bad for the people that will never truly believe and know that we are not alone. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63262.html",
      "state": "NE",
      "duration": "5-8min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b37",
      "summary": "Bright light over west Omaha at 11:45pm Oct. 5th.",
      "city": "omaha",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "Bright light over west Omaha at 11:45pm Oct. 5th. Friday night on October 5th. I was driving home from a friends house and was traveling south on I-680. At about 11:45pm I was just about up to the Dodge Street exit when I noticed an extremely bright blue white light low in the sky. This object had no tail or contrail and was moving way to quickly to be an aircraft in a tower controlled airspace (TCA). I saw none of the red or green lights associated with conventional aircraft either. The object appeared to fly over the interstate then pitched up a bit before it went completely dark. I raced home and checked the Heavens-above website for any satellite or ISS overflights of the area at that time. I could find nothing flying over Omaha for that time period. I was able to see the ISS flying overhead at about 7:40pm on Saturday night October 6th. It was not anywhere near as bright nor was it moving as fast as the object I had seen the night before. I reported the friday night sighting to a friend who is a MUFON investigator and he suggested I also send a report to this website.",
      "link": "http://www.nuforc.org/webreports/059/S59202.html",
      "state": "NE",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5bf5",
      "summary": "\"V\" shaped pattern of 10-12 white lights, moving south in omaha NE",
      "city": "omaha",
      "shape": "triangle",
      "date": "2007-11-28T00:00:00",
      "story": "\"V\" shaped pattern of 10-12 white lights, moving south in omaha NE \tI was sitting in my backyard looking at stars. What looked like a moving \"V\" shaped pattern of stars caught my eye. I was amazed and had to stand up and get a closer look. I could see the UFO to the east, moving south at a constant speed. There were about 5 or 6 white lights down the two lengths of the \"V\". It was approximately 2-3 miles away. I could only see the lights, no silhouette. As a street light blocked my view, I could no longer see it.",
      "link": "http://www.nuforc.org/webreports/059/S59179.html",
      "state": "NE",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5df7",
      "summary": "Possible abduction level  3 encounter",
      "city": "omaha",
      "shape": "cigar",
      "date": "",
      "story": "Possible abduction level  3 encounter   I was 9 years old and I woke up hearing a humming noise from outside. I walked into the living room and my mother was peekink out the front bay window. I looked and saw a cigar shaped object hovering above a house one block away. Almost as suddenly as I saw it it quickly took a higher position in the sky and then vanished. My mother and I do not remember retuning to bed. mY MOTHER TOLD ME NOT TO TELL ANYONE....THE NEXT DAY THE NEIGHBORHOOD HAD MANY AIRFORCE VEHICLES AND UNIFORMED PEOPLE GOING TO MANY HOUSES.",
      "link": "http://www.nuforc.org/webreports/060/S60505.html",
      "state": "NE",
      "duration": "unkwown exact duration"
    },
    {
      "_id": "64d005f478aba2ec5a3b61c8",
      "summary": "10:05p.m.in driveway witnessed strobing red/white lights moving from n.w to east in manner unlike no aircraft",
      "city": "omaha",
      "shape": "unknown",
      "date": "2006-10-30T00:00:00",
      "story": "10:05p.m.in driveway witnessed strobing red/white lights moving from n.w to east in manner unlike no aircraft in driveway just got off phone and from the north west and 1/4 distance up from horizon white and red lights caught my eye(popping like camera strobes)moving eastward ,was unlike aircraft lights that move in steady flashing fixed location on an airplane,these were brighter, faster,and jumping around going forward then back at distances and speed unlike any airplane as it moved eastward trees blocked view so i ran inside house ,yelled to mom to follow and went to are deck  which is on roof ,was again i was able to view these lights along with mom,as they traveled east they were getting dimmer and dimmer as if they were climbing upwards then faded from sight a little over 1/2 across sky.are house is located in north omaha on hill top over looking missiouri river with epply air field in sight,i'm very familar with aircraft lights at night due to the flight pattern,these were not normal.called center right away and was directed to call faa they told me no millitary or comm.aircraft in area that it was >meteorites< i had seen,amused by there answer i called back center",
      "link": "http://www.nuforc.org/webreports/052/S52080.html",
      "state": "NE",
      "duration": "4-5min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6457",
      "summary": "VERY similar observation as Standing Bear Park from March 4th",
      "city": "omaha",
      "shape": "light",
      "date": "2008-03-31T00:00:00",
      "story": "VERY similar observation as Standing Bear Park from March 4th The previous Nebraska entry for March 4th...although written rather differently than I would have....matches ours almost exactly.  We could see ours with the naked eye however.  They were VERY high altitude, in space it seemed to us.  A \"mother ship\", with smaller, faster ones doing maneuvers around \"it\".  They were star-like in intensity.   Our sighting was approximately 2 miles from Standing Bear Park. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62116.html",
      "state": "NE",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b6609",
      "summary": "main object which formed small cluster/moved and changed rapidly. red, bright pink. blue.  ((NUFORC Note:  Possibly Sirius??  PD))",
      "city": "omaha",
      "shape": "formation",
      "date": "2008-01-21T00:00:00",
      "story": "main object which formed small cluster/moved and changed rapidly. red, bright pink. blue. My son looked out the back door. around 10:00 p.m. last evening wednesday night. I gabbed my camera. noticed object in the sky. main shape looked like a craft, with bright lights. behind it.  pink blue, red, I zoomed and recorded 5-6 objects coming off the main object oval light shape. they danced around the sky and moved at a fast speed, then returned to the main object. Like children dancing around the main ship or object. again thursday night, around 9:30-10:00 p.m My son saw them again. He took another picture of the objects. they trail then moved togther as one object.when I blew them up on the computer. they appear to be bright lights. one pink, one round (blue color) the other red, and main object bigger then the others appeared to bigger then the others. I took them with digital camera still and video.  ((NUFORC Note:  Possibly Sirius??  We have amended the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60396.html",
      "state": "NE",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b675b",
      "summary": "Green speedy circle over 100th Street and I-80 in Omaha, NE travelling east bound",
      "city": "omaha",
      "shape": "circle",
      "date": "2008-03-04T00:00:00",
      "story": "Green speedy circle over 100th Street and I-80 in Omaha, NE travelling east bound I was heading east down I-80 and I looked up to the sky around 100th street.   I saw a green circular light about 500 to 1000 feet off the ground.   It then immediatedly accelerated hard covering 1 1/2 to 2 miles in under one second.   The light then disappeared and I don't know if it turned or what happend.   The skies were perfectly clear and I tried to look for reflections that may have caused this effect, but I did not see any.",
      "link": "http://www.nuforc.org/webreports/060/S60581.html",
      "state": "NE",
      "duration": "few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b695d",
      "summary": "Wishbone frame over southwest Omaha, emerging from clouds.",
      "city": "omaha",
      "shape": "other",
      "date": "2007-11-28T00:00:00",
      "story": "Wishbone frame over southwest Omaha, emerging from clouds. Witnessed two flat, noiseless objects within five minutes of each other. They appeared to have a skeletal, wishbone like frame and moved across the sky like a glider might move. We could not make out any defined body but there did seem to be some kind of dark area within the frame. The back end or tail had no real definition it seemed to almost fade into the sky. The crafts were in sight for approximately ten seconds each, before we lost sight of them. These two crafts came out of what appeared to be high altitude cirrus clouds, moving in a east-southeasterly direction. The clouds were long, thin and transparent, localized to a specific area in the sky. The clouds themselves seemed to last no more then two hours in duration. I noticed them at eleven pm central time and had completely vanished out of sight at about one fifteen am. The crafts seemed to emerge directly out of the cloud bank(?) both crafts heading in a southeasterly fashion.",
      "link": "http://www.nuforc.org/webreports/059/S59596.html",
      "state": "NE",
      "duration": "10 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b69a1",
      "summary": "White light flies over Omaha",
      "city": "omaha",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "White light flies over Omaha Monday (9/04/06) evening I had stepped into my brothers backyard with his 18 month old daughter in my arms.  It was dark and the moon was high and to the left as I faced south.   As soon as I stepped out of the house, the first thing I saw was not the moon, but a very bright, fast moving, white light in the sky.  It was as bright as the moon and at first I thought it was the police helicopter with it's searchlight on.   It took only seconds for me to realize that was not what I was seeing.  My niece, whom I do not count as a witness due to her age, could not stop pointing at it.   Once I realized this was no ordinary craft, I yelled in the house for my brother to come out and see it.  In doing so, I alerted the entire house.  In all, 4 adults, an eleven year old, and my 18 month old niece all saw the phenomena.   The light moved across the sky from west to east.  It moved in a fairly quick, yet consistent speed.  It only varied course slightly when it appeared to be manuevering to it's left and right.   In all, the light was visible for about 1 minute.  At it's end, it disolved into the distance.   We then stayed outside for about half an hour to \"star gaze\".  In that half an hour we saw several commercial flights at various elevations, a satellite in orbit, and the police helicopter did fly over (without searchlight)and was obvious to us that if the helicopter did fly over we would have definately heard it.   Ruling those things out, we came to two possibile conclussions; 1 )it was an outer worldly craft, 2) being that we live in Omaha, we are accustomed to seeing craft from the S.A.C. airforce base (B-2 Steaths, fighter jets, etc...).  However, this craft made no banking turn to where the base would be located and seemed to dissapear once it passed the moon.   We are fairly certain that this was no government aircraft and are just curious to see if you have heard of any similar reportings in this area.   This was my second personal encounter, the first took place in 1990 and was no where near as i! mpressive.   Thank you for your time.",
      "link": "http://www.nuforc.org/webreports/052/S52371.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e6d",
      "summary": "white flashes and red laser beams",
      "city": "omaha",
      "shape": "flash",
      "date": "2006-12-07T00:00:00",
      "story": "white flashes and red laser beams We were at the time a new family to Sarpy county, my job had brought my family to Sarpy County and following what now has occurred, needless to say we are heading back to Missouri.  One evening my wife witnessed something of what appeared to be at the time white flashes in our bedroom that was coming through our window. These bright white flashes were continual and only appeared in the early hours of morning.  After the third day of this going on we had contacted our neighbor and asked him if he had seen any unusual white flashes in the early morning hours and he looked at us like we were insane.  My wife including our three children ended up sleeping together until we found out what these white flashes were, only problem is other things started happening. Around two and three in the early morning hours we started hearing a low hum similar to a vibration, so I took my ladder out and climbed up on our roof and seen no cable interruption. In my line of work I work for an electrical company but I will not mention which one out of the fear of possible retaliation.  My wife as well as my eldest child felt our home was haunted but something kept telling me differently, for example one evening we heard such a loud noise like a jet blast but throughout the entire sky and to this day I have never heard such a loud noise and hopefully we never will again.  These white flashes seemed to subside to only then be replaced by what appeared to be a red laser type of beam. This beam for a better word would spell out threats on our bedroom wall as well as through our house, again emphasizing that my wife said our home was haunted.  Then it happened, one evening the threats started getting worse and we started to see a few circular objects in the Southern sky and after contacting more than just a few local officials, for the most part each one felt we had lost our minds.  They and by they I am referring to whoever or whatever was using these red beams started writing on our walls information that no one had any access to and it started to cause a very prominent divide in our family.  Some of the words that to this day still standout were such words as die, filthy, leave,  you cannot make us leave, Norma [my wife felt maybe a correlation to Marilyn Monroe?], they whoever they are mentioned they still are visiting others who they have talked to before and they wanted me to go public which I refused and that seemed to anger them worse.  This red beam went as far as naming each member of our family and each evening it grown worse. The writing started lasting later into the morning and longer, personally I started losing more sleep as each day passed until finally we had enough and we now are staying with friends until we move back to Missouri where my wife has family.  When this red beam was writing, it would also make direct contact to my wife on her body including myself and we could feel heat from it. After it started leaving marks on my wife in the form of small burns around her head, neck, ears, and along her legs. That is when we moved to a friends home that I met after moving to Sarpy county.  I want to tell anyone who may be reading this that I am an electrician by trade and in no way shape or form have I in my entire life ever have dealt with anything like this and to those others who these things refer to, my family who are dealing with this, our heart goes out to you.  To all the officials we contacted I would like to end this by saying thank you for nothing.",
      "link": "http://www.nuforc.org/webreports/053/S53406.html",
      "state": "NE",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3b7230",
      "summary": "I saw a semi-circular object with bright yellowish/orange lights that rapidly flew away in Omaha.",
      "city": "omaha",
      "shape": "circle",
      "date": "2007-04-27T00:00:00",
      "story": "I saw a semi-circular object with bright yellowish/orange lights that rapidly flew away in Omaha. At 6:35 I was driving Westbound on Underwood street at about 66th street. I saw a semi-circular outline in the sky with yellowish/orange lights. I did'nt get the best look as I turned the corner towards Dodge St. As I turned West on Dodge I saw it again but now it was further in the distance. Then as it moved SW very quickly and was out of sight in a matter of seconds.",
      "link": "http://www.nuforc.org/webreports/056/S56056.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7373",
      "summary": "Silver Object/Flash Appears in Sky- Disappears, then Reappears",
      "city": "omaha",
      "shape": "flash",
      "date": "2007-04-27T00:00:00",
      "story": "Silver Object/Flash Appears in Sky- Disappears, then Reappears Driving home from work traveling west, I noticed a silver object/flash in the south southwest sky. We had clear sunny skies. I watched it for about 5 seconds then it disappeared. About 20 seconds later it reappeared in the same area and was again visible for 5 seconds. It disappeared as before. I thought at first it could be an airplane, but I noticed a small plane a few moments later and it was a lot different that this. This object appeared then disappeared as if it was never there to begin with. I would have dismissed this as my imagination except it reappeared.",
      "link": "http://www.nuforc.org/webreports/056/S56106.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7363",
      "summary": "Star Light resembling craft in formations of 3 and huge megaship over  Standing Bear.",
      "city": "omaha",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Star Light resembling craft in formations of 3 and huge megaship over  Standing Bear. Normal visual occurance of the light orb's sighted over Omaha during any clear night since Novembor 07.  Through binoculars, saw many mini lights fling out of larger star like object like so many star cinders into the night.  These \"cinder\" stars would swarm the orginal bright mother star like moths to a light bulb.  3 different formations of 3 each were spotted shortly there after floating above us.  We were around Standing Bear Lake as usual.  Through the binoculars star a fixed formation of stars shift in unison as if in a breeze.  They would shift for west to east, Then south, back west, then north again.  This uniform shift feature could only be seen with the binoculars looking straight up.  Unseen to naked eye.  Had the impression that this huge uniformity connected all the naked eye light orbs.  Estimated size of this new larger light craft could easily be 5 square blocks of craft below the low level cloud layer roughly 4,000 ft up.  Quite silent, and beautiful.  To the casual observer, un noticeable.  Look up Omaha.  They are here EVERY night.  Numerous cesna like craft attempted to fly through these formations and left after 19 minutes.",
      "link": "http://www.nuforc.org/webreports/061/S61996.html",
      "state": "NE",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b73b8",
      "summary": "Very fast moving object!!!!!!!!",
      "city": "omaha",
      "shape": "oval",
      "date": "2007-08-14T00:00:00",
      "story": "Very fast moving object!!!!!!!! My father and I were outside gazing at the stars one night. I was about 12 years old.  The image never left my mind... An oval shaped glowing object raced across the sky above us.  I didn't make any noise, it just flew east to west in the sky.  I was facing south when it happened.  The sky was clear that night and no clouds were present so it could not have been a reflection of light off anything.  I seen it plain and clear!!! A trail of light was behind it from probably traveling so fast!  It dissapeared into the night in about 2 seconds. It was probably 100ft up in the sky. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58043.html",
      "state": "NE",
      "duration": "2 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b64",
      "summary": "Group of  very dim lites-moving North to South   NO shape was defined!!!",
      "city": "omaha",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Group of  very dim lites-moving North to South   NO shape was defined!!! 0 0 0 0   Stacked like this, moving North to South 0 0 0 0 I enjoy star gazing,on the nite of Oct.13 at approx. 21:15 while looking at the Andromeda area- M-31 in particular, I had this stack of very dim,almost yellowish lites come into my 7-50 binoculars field! This was not any of the following: aircraft,balloon-it was 32degrees at time and dark-blimp-helicopter-these objects made no sound whatsoever!But they were moving quite fast from North to South,I thought for a second that they might be geese,stopped tracking for a second,but they left my field of view to fast to be geese!!",
      "link": "http://www.nuforc.org/webreports/052/S52948.html",
      "state": "NE",
      "duration": "25sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b7d3a",
      "summary": "Silver ball hovering over street/ shot up",
      "city": "omaha",
      "shape": "sphere",
      "date": "2006-12-14T00:00:00",
      "story": "Silver ball hovering over street/ shot up I was taking my trash out to the curb this morning. I rolled the can to the curb and started to turn around, when something caught my eye at the top of our street about 50-75 feet away.  The object was a small silver ball about the size of a mini basket ball.  It appeared to be hovering about 1 to 2 feet off the ground from the angle I was looking at it.  The first thing that came to mind was that I was seeing stuff. As I had just woke up for work about 45 min ago. I just sat there looking at it for about 30-40 seconds or so trying to refocus on it thinking that my eyes were playing tricks on me.  Soon I thought what the hell is that, and started walking up the street.  As I was walking up the street I thought that it could be a small Mylar balloon.  But then I thought that a balloon would be moving and this thing was sitting still.  As I got about 30 or so feet from it.  It shot strait up so fast that it looked like it was fired out of a gun. It went out of sight with in 1-2 seconds.   It never made any noise, and had no lights; it was just a metallic ball. It really kind a freaked me out.  This is the first time that I have ever seen something that I could not explain.  I am still kind of confused.  I am dead set that my eyes were not playing tricks on me.   I was telling one of my employees about this morning and he said that I should report it.  I had no idea who I should report it to.  So after a Google search I found this site.   However this thing was not a flying saucer, so I am not sure that it should be here or not.",
      "link": "http://www.nuforc.org/webreports/053/S53870.html",
      "state": "NE",
      "duration": "60 -80 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8823",
      "summary": "Willowcreek Park, Omaha, UFO sighting - June 19,  2009",
      "city": "omaha",
      "shape": "changing",
      "date": "2009-08-05T00:00:00",
      "story": "Willowcreek Park, Omaha, UFO sighting - June 19,  2009 We were at the park around 9:45pm on Friday, June 19, 2009 when the four children we were with started shouting and telling us to look at the “fireball” in the sky.  When we (2 adults) turned to look at where they were pointing (to the east) we saw a fairly large, brightly lit “flying craft” in the sky just above the treetops and houses moving towards us.  I first assumed it was a prop plane flying low, but immediately realized it was not the shape of an airplane (or firework or comet or military plane, etc). It was a boxy-circular shape (somewhat trapezoidal at first), very brightly lit with an orange-yellow light.  The entire craft was covered with a haze that seemed to diffuse the perimeter edges, which is why I can’t put a name to the shape.    There was a brighter spot of light in the center of the object. It was moving towards the park clearing, but when the kids started shouting and pointing the craft stopped moving forward and began to hover.  It hovered for several seconds, and then began moving back – to the east – in the direction that it was originally coming from.  As it got smaller it seemed to change into an elongated oval, then in an instant it was just gone!  Two of the children said it was as if when they started pointing and shouting, the craft “noticed them” and stopped moving towards us.    It was pretty close to us, but there was no noise.  It was totally silent.  In all, we watched it for approximately 20 seconds.  The children saw it for about 5 seconds longer because they saw it first.",
      "link": "http://www.nuforc.org/webreports/070/S70615.html",
      "state": "NE",
      "duration": "20-25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a44",
      "summary": "the stealth ufo using antigravitic technoligies",
      "city": "omaha",
      "shape": "other",
      "date": "2010-04-13T00:00:00",
      "story": "the stealth ufo using antigravitic technoligies    i was riding i a car going west on the interstate i eaghty going west bound thruogh nebraska near the usgs place in nebreska.  a plane that looked kind of like the steulth b-2 flew over head very slowly. i first saw it when i was riding down the interstate west bound on i 80 the driver pulled over on the interstate to the shoulder and stopped. i asked him why are you stopping because on can only stop on the freeway in an emergency .he said i am stopping because there is a ufo flying see it.  the stealth like ufo flew over real slowly as if it was anti gravitic and defieing gravity. it was as big or bigger the the wing span if a seven fifty seven airline.it was painted stealth grey and had white zenon visability lights on it it had eaghteen lights on it. ((NUFORC Note:  We are unconvinced as to whether this is intended as a serious report.  Date may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74609.html",
      "state": "NE",
      "duration": "89 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8aa4",
      "summary": "Triangular object observed",
      "city": "omaha",
      "shape": "triangle",
      "date": "2010-04-13T00:00:00",
      "story": "Triangular object observed Triangular shaped object observed moving silently across the sky at night.  Observers were waiting for a small private fireworks show when it was spotted.  Initially it appeared as if three slightly red stars were moving in unison, then the observer realized that light in the background was disappearing and reappearing on the other side as the craft moved, signifying that it was a solid object.  The sides were about 2.5cm or an inch at arms length.  The object was a black, right isosceles triangle with a slightly red light at each corner.  There was also a very faint red ring at the center that was not immediately noticeable being about a quarter to a third of its overall size.  I can't give a directional orientation, but it moved across the sky totally silent with a constant speed.  The sighting lasted around 5 minutes.",
      "link": "http://www.nuforc.org/webreports/074/S74724.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f44",
      "summary": "I was taking my two dogs out for the last time in a lightly tree covered dog run behind my apartment complex garages when I saw a giant",
      "city": "omaha",
      "shape": "",
      "date": "2010-04-13T00:00:00",
      "story": "I was taking my two dogs out for the last time in a lightly tree covered dog run behind my apartment complex garages when I saw a giant almost square blue flash. It was amazing, It appeared to the west and looked very close to my location. I could not see the bottom of the flash because of the garage impeding my view. The size of the flash was amazing, It was easily the size of a small house. There was dead silence and my two dogs did not react at all. I used to be a fireman and have seen my fair share of transformers exploding and other such events. This was completely new to me. No power was out anywhere that I could tell in the apartment complex or the housing division behind it. I have never seen anything like this in my life. The color was almost a purple blue with what could have been a trick of the eye a reddish border. It flashed like lightning but always seemed to be solid never blinking out.",
      "link": "http://www.nuforc.org/webreports/074/S74416.html",
      "state": "NE",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9001",
      "summary": "Strange orange orb on 10/31",
      "city": "omaha",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "Strange orange orb on 10/31 Went trick or treating with some friends and saw a strange orange light (orb) in the sky.  We watched it for about 3 minutes as it moved around and than it disappeared.  About 30 minutes later it reappeared and moved acrossed the sky and than disappeared again.  Later that night probably an hour or so later we saw it again however this time there were 3 of them.",
      "link": "http://www.nuforc.org/webreports/073/S73118.html",
      "state": "NE",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8fdf",
      "summary": "Bright white light turned red and dissappreaed, later a \"wave\" of small lights from the same spot",
      "city": "omaha",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Bright white light turned red and dissappreaed, later a \"wave\" of small lights from the same spot On November 22, 2008 at 18:10 Central time myself, a preschool teacher and both of my parents, a nurse and a small business owner, were outside and witnessed a very big and very bright white light moving in the sky.  It moved from west to north-east and suddenly turned red.  Then seemed to accelerate rapidly and vanish from sight.  We live within two miles of Epply Airfield and have seen a lot of airplanes and this was no airplane.  It was a solid white light, silent and moving very rapidly before it turned solid red and disappeared. About 20 minutes later I was still outside looking for something else to happen when I saw what could only be described as a wave come from the spot that the light disappeared.  It came from one spot and spread out only going both directions horizontally.  It looked almost like a flock of birds but it was going in two different directions and was moving very fast.  There was no sound to it and I lost sight of it over the horizon.",
      "link": "http://www.nuforc.org/webreports/067/S67090.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b90b2",
      "summary": "I was looking up at around 23:00 northwards, and saw what appeared to be a rainbow-colored, as in changing colors, up in the sky. It st",
      "city": "omaha",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "I was looking up at around 23:00 northwards, and saw what appeared to be a rainbow-colored, as in changing colors, up in the sky. It stayed for a while, drifting slowly, then shot of towards the west, and it was gone. I heard a small bang, but the person next to me didn't see or hear it.",
      "link": "http://www.nuforc.org/webreports/073/S73142.html",
      "state": "NE",
      "duration": "About 30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b996e",
      "summary": "bright light moving fast and just dissappeared",
      "city": "omaha",
      "shape": "light",
      "date": "2010-06-23T00:00:00",
      "story": "bright light moving fast and just dissappeared At approximately 11:28pm June 11, 2010, I was on my deck and saw a bright white light (almost as if you were looking into a flood light) approching from the south that I thought was an airplane, as we have many that fly over our house.  At closer look it was very high in the sky, no sounds were audible, and no blinking lights, or shape were visible.  The light appeared to be very high and seemed to change directions from approching to reversing and it ascended upward very fast and then the bright light just disappeared without a trace(as if someone just turned off the flood light).  I have no idea what it was but I have never seen any known aircraft travel at those speeds to not be visible that quickly. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75749.html",
      "state": "NE",
      "duration": "15-20sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d92",
      "summary": "Walking on the South campus of the University of Nebraska at Omaha. Was chased by Diamond shaped UFO which was approaching towards me.",
      "city": "omaha",
      "shape": "diamond",
      "date": "2010-05-12T00:00:00",
      "story": "Walking on the South campus of the University of Nebraska at Omaha.  Was chased by Diamond shaped UFO which was approaching towards me.  I sheltered myself by running to South campus building.  It was horrible.  It was beautiful looking ship but really horrible when they were approaching towards me.  Scary.  I wish aliens negotiate with government before becoming themselves available to general public ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75281.html",
      "state": "NE",
      "duration": "4 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba102",
      "summary": "A white aircraft, almost resembling a commercial airliner, vanished before my eyes. The aircraft did not posess normal characteristics.",
      "city": "omaha",
      "shape": "cigar",
      "date": "2009-08-27T00:00:00",
      "story": "A white aircraft, almost resembling a commercial airliner, vanished before my eyes. The aircraft did not posess normal characteristics. I have never experienced an incident in which the sight of something unfamiliar in the sky has compelled me to believe it to be foreign to Earth. However, I do seriously entertain the idea that there is intelligent life elsewhere in the vast depths of space, albeit with a small dose of skepticism. I do not want to jump to the conclusion that what I just encountered was truly an alien aircraft, but it's behavior puzzled me. At around 18:40 PM on Tuesday, August 18th of 2009, I was at work and decided to take a break for a cigarette. I was seated on the loading dock, facing south, when something in the sky caught my eye. The sky was very clear, almost cloudless, and I distinctly saw a white shape, which I first believed to be a normal commercial airplane, traveling west. After further inspection I realized that the object did not resemble any airplane I had seen before, as it had no markings on it. It also didn't have any distinct shading, by that I mean to say that I could not concretely identify any appendages that would normally be visible, such as the wings. It was also traveling at a higher speed than a plane like that normally seems to move. It was quite far away, and I do not have the best eyesight. I could not hear the roar of any engine, but that is most likely due to the distance. Also, there was no cloudy trail left behind in the craft's wake. While I was still inspecting the object, keeping it in my line of sight, it vanished. I got off the loading dock so I could have a better view of sky above me and searched for the object, but I could not find it.",
      "link": "http://www.nuforc.org/webreports/071/S71736.html",
      "state": "NE",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8f7",
      "summary": "Multiple triangle-shaped, silver objects in night sky.",
      "city": "omaha",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Multiple triangle-shaped, silver objects in night sky. This event occurred in the summer of 1979.  I distinctly remember that it was dark and that there was cloud cover.  My estimation is that it would have been approximately 22:00.  At the time, my family was living in the Millard community in Sarpy County, just outside of Omaha, Nebraska. On the evening of the event, my brother and I had been allowed to stay up late, as we were waiting for our mother to return from a shopping trip.  Our house had a large picture window in the living room (facing west), and our couch was situated with its back against the window.  My brother and I had been kneeling on the couch facing backwards, allowing us to look out the picture window. After several minutes, I noticed what appeared to be a bright object in the western sky, and that it was moving east at a high rate of speed.  As the object became closer, I noticed that it was triangular shaped and silver in color.  I also noticed that there were several similar objects, traveling in single file, all flying at the same speed and in the same direction.  Each object was flipping end-over-end, at a rate of approximately 1 flip every 2 seconds. As I previously mentioned, there was cloud cover on the evening in question.  The objects were all flying below the cloud cover.  They also appeared to be maintaining a very constant altitude, despite the fact that they were flipping.  I’d have estimated that the objects were flying at an altitude of approximately 2,500 feet and that they were roughly 150 feet in length. The objects were silver in color and were clearly visible, yet did not appear to have any lights.  Rather, their surfaces were simply illuminated, as if the skin of each craft was its own light source.  Their flight path took them directly over our house, so I was able to get a good look at them as they flew over.  They made no sound at all, had no obvious vapor trails or exhaust and did not flash, blink or pulse any light.  The skin, however, did appear to \"shimmer.\"  The best description I could offer for this \"shimmering\" would be to take a very reflective piece of foil, crumple it into a ball, unfold and flatten the foil, then shine a flashlight at the foil, moving the light quickly across the foil’s surface. In total, 4 of the objects passed overhead, at the rate of 1 every 15 seconds or so.  The total duration of the event, from our first noticing the objects to them passing over our house and out of view, was about 2 minutes.  That was the first and only time that we saw the objects. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77748.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baac1",
      "summary": "Bright white light crossing the sky",
      "city": "omaha",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Bright white light crossing the sky   My wife and I were sitting in our back yard in Omaha, NE,. enjoying the evening.  We observed a light in the sky traveling form the northwest toward the southeast.  We watched the light for about 15 to 20 seconds before it dimmed and disappeared.   The light was bright white at first I thought it might be an airplane with its landing lights on as bright as it was but as it moved away from us we could not see any strobes or anti-collision lights then it started to dim and was gone.  The time was 0148 UTC or 2028 local time.   The weather is 80 degrees and the sky clear the course of the object would have put it north of Offutt/Sac AFB.  This was no aircraft that I have seen before. I am an aviation enthusiast and amateur astronomer.",
      "link": "http://www.nuforc.org/webreports/077/S77790.html",
      "state": "NE",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bab1a",
      "summary": "Red light over NW Omaha moving south to north before fading away completely.",
      "city": "omaha",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "Red light over NW Omaha moving south to north before fading away completely. Ball of red light moving from South to North for about a minute.  It seemed to stop, then move North again, before stopping again and suddenly starting to fade, until we could no longer see any light.  I would say the dimming seemed to happen in about 1 minute. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77907.html",
      "state": "NE",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bab78",
      "summary": "Weird boomerang releases spheres, lights.  ((NUFORC Note:  We do not know if this is intended as a serious-minded report.  PD))",
      "city": "omaha",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Weird boomerang releases spheres, lights. A large boomerang shaped craft released lots of small silvery-white spheres.  The spheres glowed blue along axis lines, like laditude and longitude.  They pulsed rythmicly and went off in all directons.  One that came close was somehow absorbed into a high voltage (700kv aprox) power main.  Then threr was a flash of light and heat, the power went out momentarily, and it was over. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  We do not know if this is intended as a serious-minded report.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78041.html",
      "state": "NE",
      "duration": "34 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bac66",
      "summary": "Observing the first orbits of Echo 2 radar-reflective satellite through a 50 power telescope, I saw a \"lesser light\" perhaps spherical,",
      "city": "omaha",
      "shape": "sphere",
      "date": "",
      "story": "Observing the first orbits of Echo 2 radar-reflective satellite through a 50 power telescope, I saw a \"lesser light\" perhaps spherical,white in color and unchanging, approach the satellite, fly parallel,for a few seconds, circle the satellite 3 times, then fly off in a manner/ direction consistent with the direction of approach. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79358.html",
      "state": "NE",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bacfd",
      "summary": "Omaha NE    I'm can't be the only one who saw this!!!",
      "city": "omaha",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "Omaha, NE     I'm can't be the only one who saw this!!! my girlfriend and I just got out of the hottub at out apartment's and where walking back to my truck when we noticed a bright orange ball moving _slowly_ across the sky, then it stopped...  there where no red lights no white lights... nothing flashing at all...   just a very very bright orange light, then it faded away like it was moving directly away from us...     make of it what you will but that is exactly what happened and I'm sure _someone_ in Omaha saw it as well     someone has to have!. ((NUFORC Note:  Flaw in original date.  We assume the source of the report intended to record the date of October 17, 2010, and we have amended the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78431.html",
      "state": "NE",
      "duration": "00:01"
    },
    {
      "_id": "64d005f478aba2ec5a3bad16",
      "summary": "object/lifeform floating silently in our house glided into next room",
      "city": "omaha",
      "shape": "",
      "date": "2011-01-05T00:00:00",
      "story": "object/lifeform floating silently in our house glided into next room How do I go about reporting an alien sighting?   My husband thinks I am nuts, but the night after we moved into our house, we were sleeping in our living room and for some reason I woke up in the middle of the night and there was this \"thing\" floating a couple of inches from our ceiling.  It was silent, about 6-8 feet from where our mattress was, and about 3 feet in length.  It looked like several small orbs clustered together on a sort of plate, with several tentacles hanging down.  It just hung there for several seconds, then glided silently into the other room.  After about 30 seconds or so, I finally worked up enough nerve to check on the kids in their bedrooms and there was no evidence anything was ever in our house......  I know I was awake and not dreaming.",
      "link": "http://www.nuforc.org/webreports/079/S79332.html",
      "state": "NE",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bae95",
      "summary": "Four orange  objects flying in East sky from South to North.",
      "city": "omaha",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "Four orange  objects flying in East sky from South to North. Looking to the East sky towards four orange lights appeared out of nowhere.  We watched as they flew from the South to the North.  One by one three of the four objects dimmed until we could only see one.  We lost sight of the fourth object the further North it moved, due to houses and trees blocking.  They seemed to be moving very rapidly...too fast to be a typical plane.  This is my second sighting, last sighting, with same people was 9/19/10.",
      "link": "http://www.nuforc.org/webreports/079/S79062.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2e7",
      "summary": "brighter then every star and planet then slowly dimmed to nothing",
      "city": "omaha",
      "shape": "",
      "date": "2010-11-21T00:00:00",
      "story": "object entered dim became brighter then every star and planet then slowly dimmed to nothing.",
      "link": "http://www.nuforc.org/webreports/078/S78799.html",
      "state": "NE",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb556",
      "summary": "Bowl or saucer shaped craft in a playground",
      "city": "omaha",
      "shape": "disk",
      "date": "2011-02-23T00:00:00",
      "story": "Bowl or saucer shaped craft in a playground I was sitting at the dinner table with my children, who did NOT witness this.  I had a clear view out of my livingroom window from this vantage point, and saw what I assumed was a reflection of my saucer-shaped livingroom light fixture.  I didn't pay it much attention until I saw this 'reflection' increase in brightness.  It began to project beams of light to the ground, from its perimeter.  After a few seconds, the beams retracted back into the craft and individual lights around the outside of it began to blink out in a circular pattern until nothing was left visible.   At this point, I ran to the window and could see nothing.  The craft was across the street from my house, to the left of a small storage shed at a playground.  There was nothing in this area that could have made any sort of light, muchless a display like what I saw.  I noticed that from where I was sitting, my livingroom light does not reflect in this window at all.. and even if it had, the c! raft was shaped like an upside down shallow bowl, and my light fixture is not turned in this manner.",
      "link": "http://www.nuforc.org/webreports/080/S80168.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb6f1",
      "summary": "Orange Ball brightness of street light, low altitude, no sound, heading West then South, slow, lost visual.",
      "city": "omaha",
      "shape": "fireball",
      "date": "2010-08-24T00:00:00",
      "story": "Orange Ball brightness of street light, low altitude, no sound, heading West then South, slow, lost visual. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77246.html",
      "state": "NE",
      "duration": "2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb7b1",
      "summary": "Bright white light moves across sky towards the north then turns east",
      "city": "omaha",
      "shape": "light",
      "date": "2010-08-30T00:00:00",
      "story": "Bright white light moves across sky towards the north then turns east I saw a bright white light moving north then moved to the northeast horizon. The light made no noise or flashes seemed to be a twice as bright as venus",
      "link": "http://www.nuforc.org/webreports/077/S77438.html",
      "state": "NE",
      "duration": "3min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb9ec",
      "summary": "Bright orange circle object heading North behind clouds.",
      "city": "omaha",
      "shape": "circle",
      "date": "2010-07-19T00:00:00",
      "story": "Bright orange circle object heading North behind clouds. Looking to the west, there was a beautiful sunset with this really unique cloud.  I was admiring the bright orange red shining up through the clouds.  It was then I saw a bright orange circle object heading North through the sky and fly behind the clouds.   Not sure what it was but I was taken back as it didn't seem to have the characteristics of anything I would expect to see.  Not ruling out a plane but it didn't appear anything like one.   Unfortunately I was driving and by the time I got to stop and watch the cloud, I didn't see the object again.   Hope someone else saw this as well and can shine a light on this. Thank you ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76598.html",
      "state": "NE",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb17",
      "summary": "Orange lights over Omaha Nebraska.  Not fireworks!",
      "city": "omaha",
      "shape": "circle",
      "date": "2010-07-06T00:00:00",
      "story": "Orange lights over Omaha Nebraska.  Not fireworks! We were on the lake watching fireworks when I noticed a glowing orange object in the sky.  This object moved right to left, then stopped.   After flying for a minute or 2, the flow stopped and the only way I can describe it is a can of chewing tobacco dark in color flying through the sky.  It disappeared behind some clouds.  10 or so minutes later I and my entire family on the boat saw the same thing, but now there were 3 of them.  This time they did not stop glowing orange.  This went on for 5 min.",
      "link": "http://www.nuforc.org/webreports/076/S76182.html",
      "state": "NE",
      "duration": "10-15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbea",
      "summary": "Football shaped glowing orange light drifts straight across sky, west to east,  to the top of a very tall TV tower and then disappears",
      "city": "omaha",
      "shape": "oval",
      "date": "2011-12-12T00:00:00",
      "story": "Football shaped glowing orange light drifts straight across sky, west to east,  to the top of a very tall TV tower and then disappears Orange \"football\" shaped light drifts west to east across the night sky towards a TV tower. The orange light goes out when it appears to touch the top of the TV tower  Date: February or March 1969 (approximate; certainly between Feb 1 and May 1 of 1969)  Time: Near Midnight. Location; West suburbs of Omaha, Douglas County, Nebraska, USA  Visibility: Very Good, crystal clear atmosphere on the ground and up to the cloud base. Overcast sky with very high ceiling providing an opaque, starless, moonless background. Situation: Omaha, Nebraska has three very tall TV transmission towers on a hill on North 72nd Street and Crown Point Drive. These towers are about 1200 feet in height from base to the top. They are situated on one of the highest hills in the Omaha area, between Military Ave. ( a north-west to south-east diagonal street) on the south,  and Crown Point Drive (an east-west running street) on the north, with North 72nd Street (a north-south running street) immediately to the east.  The towers are arranged in a more or less North - South line. They are each about 600 feet apart, so the south tower is a total of about 1200 feet from the north tower. The middle tower is offset to the east about 200 feet, though most people think the  three towers look to be in a straight north - south line with each other. Line of sight: Clear, unobstructed view. My line of sight with the towers was almost exactly 45 degrees south-west to the north-south running line up of the towers. I was almost exactly six miles due south-west from the towers. Distance: I was almost exactly six miles due south-west from the TV Towers. Size of “UFO” , my guess, explained below, is that the UFO was somewhere between 50 to 100 feet long. Shapw: It was shaped like an American football; strongly pointed at both ends and completely symmetrical. As it traveled the pointed ends were front and rear. It traveled in a very flat, straight horizontal line. Appearance: The UFO was shaped like an American football. It was a bright, glowing, uniform orange color; much the color of true neon light (not “florescent” neon colors). It glowed steadily with no pulsation or variation in brightness or color. I was driving North on 132nd Street (a north-south running street), just north of Pacific Street (an east-west running street) traveling slightly up hill. That hill on 132nd St. crests just a few hundred yards north of the Pacific Street intersection. As I crested the rise I could clearly see the three towers as outlined by their red blinking warning lights. I was intimately familiar with this stretch of road as I grew up very near there. Again; I was driving and looking due north. I had to look to the right to see the towers as I crested the hill. I saw something I’d never seen before. A small orange light the shape of an American football was slowly drifting from west to east towards the towers. The “football” was moving in a perfectly flat horizontal line and the long axis of the “football” was horizontal, like a football would be if being thrown. To me it looked just like an orange neon light in both color and the way it glowed; very fascinating and pleasant to look at, neither too bright nor too dim. I laughed as reminded me of a florescent orange Nerf Football, though it truly was illuminated. This orange glowing “football” was traveling in a perfectly flat horizontal line, and apparently from my position,  headed directly towards the top-most tip of the northern most TV tower. As there were no other cars on the road, I stopped the car and turned off the headlights leaving only the parking lights on, so as to minimize any extraneous light. I sat there watching this “football” for probably no more than 30 seconds (certainly less than a minute.) until it, apparently from my view point, drifted right up to where the leading tip of the “football” touched the top tip of the north TV tower and then it (the “football”) blinked out, went dark, never to reappear. This left no visible outline. It was as if the “football” just disappeared. I sat there for probably an additional five minutes waiting to see if the “football” would reappear, but it did not. There was NO effect to the TV towers. The red safety lights on all three towers continued to blink normally the whole time. There was NO flash when the \"football\" touched the tower. The orange glow of the \"football\" never varied, never pulsed; it simply went out when it touched the tower. I was absolutely fascinated by this and not the least bid frightened or disturbed, but then again, it appeared to be a fairly long way off from me. Now, granting that I was six miles from the TV towers and it was night, so all I could see were the blinking red safety lights on the towers and the constant orange glow of the “football”, I cannot say for certain how the “football” actually lined up with the TV towers or where it actually was physically with relation to the towers; BUT, from my vantage point it appeared that the “football” was at the very same altitude as the top of the north tower and that the “football” drifted right up to the top tip of the north tower and then went dark when it “touched” the tip of the tower. Having said the above; if the “football” actually did touch the top of the tower, and then gauging its size in proportion to the tower, I would say that the horizontal length of the “football” would have been between 50 (fifty) to 100 (one hundred) feet in length.",
      "link": "http://www.nuforc.org/webreports/084/S84875.html",
      "state": "NE",
      "duration": "thirty seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd34",
      "summary": "Triangle Object",
      "city": "omaha",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "Triangle Object I reported numerous Discs sighted back on June 22nd 2003 (see Nuforc.org). Since then I have constantly watched the sky with binoculars or naked eye and have seen numerous objects over the years. I dont have the best camera but decided to try and take zoomed in photos now and then of objects I have seen. The camera that took the photos in regards to this report is a Digital with zoom that uses a floppy disk for storage. I have debated wheather or not to file this report and submit the photos since I want to be absoultly sure that what is reported is accurate and not a waste of anybodys time.  The only manipulation that I have done on the photos submitted is to invert color & or zoom in & or sharpen in order to try and get the best view possible of the objects. I would love if Mufon or someone could enhance them better. This was a clear sunny day late afternoon. Sitting on my deck looking up at approximately a 60 - 80 degree angle - approximately 5 or 10 degre! es to the west of South. Offutt AFB is 10 - 15 miles to the SE. Millard Airport is 1 mile straight south. Omaha Eppley is 15 miles to the North East.  I was a jet mechanic in the Navy and am quit familiar with military and commericial aircraft. I have learned the incoming and outgoing flight paths for the above facilities.  I am guessing that the objects I observed and took photos of are approximately up around 30 - 40 thousand feet as they were hard to see with the naked eye but able to watch with binoculars and they still appeared to be distant. When I took the photos - I didnt know if the pictures would turn out or not let alone capture anything since the objects seemed so far distance.  The most common factor in the photos is the small green circular light. I first noticed the triangular object (which was hard to distinguish its shape at the time) and took its picture which I was supprised to see the triangular shape and more important to see a cicular area on the bottom o! f the craft which appears to be some sort of propulsion emissi! on. The two object photo - was one object then two, were there and then were gone. I know what I saw, I know what I took pictures of and I know what the pictures are showing; I know that the objects are not any type of commericial or military aircraft that I have ever seen before. No matter if you are a skeptic of UFO's or a believer in UFO's as I am - here are the pictures for you to view and decide for yourself what the objects are. Mufon or NuForc are encouraged by me to analyize these photos in depth because I would like to know what they decide the objects in the pictures might be. Mufon or NuForc are welcome to contact me for any additional questions or investigation.",
      "link": "http://www.nuforc.org/webreports/085/S85417.html",
      "state": "NE",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0c1",
      "summary": "Very fast triangle type object",
      "city": "omaha",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Very fast triangle type object I was on my way home from work tonight, and for the first time ever, I saw something completely unexplainable.  At about 9:15, it moved South East.  I noticed it just over 144th and Pacific area (For people familiar with the area) and if I was to explain what it seemed to look like....  It had a triangle like end  abiout 40 degree angle and a much more gradual triangle on the other end about 20 degrees.  I could not see any details on what it actually looked like as far as color because it was dark, but it had about 5-6 little white/yellow lights and one red light.  Besides the overall shape and complete lack of sound, it was the size of a large airplane and when I noticed it, it was too close not to make a sound.   The lights did not blink but did seem to turn off for a couple seconds and come back on which was also strange.  The most strange thing I noticed was the way it flew, it seemed to go side to side and up in down almost like a kite but still flew am! azingly fast.  Seemed to cross about 5-6 miles in about 30 seconds but didnt seem to move like that. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83887.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc45e",
      "summary": "Boomerang shape, color hard to describe like hard mist",
      "city": "omaha",
      "shape": "chevron",
      "date": "2011-10-10T00:00:00",
      "story": "Boomerang shape, color hard to describe like hard mist My husband was on the phone outside at approx 9:45 PM when spotted it above our house, he banged on the door for me to come out and pointed it out to me.  It was boomerang shaped, the color was very hard to decipher I would describe it as being like a hard shear curtain color, hard mist... very hard to describe.  It was moving very slow, and levitated in one place for about 5 seconds, moved to the right, then continued to move forward (which would be east from our home) then it was gone.",
      "link": "http://www.nuforc.org/webreports/084/S84248.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc4ac",
      "summary": "Fireball moving from north to south over downtown Omaha",
      "city": "omaha",
      "shape": "unknown",
      "date": "2011-08-07T00:00:00",
      "story": "Fireball moving from north to south over downtown Omaha.  Either circled or a second object passed 2 min later.   Definitely large flames  come off an object but the shape and size  of the object was hard to detect. ((NUFORC Note:  Could not have been a meteor, which are not visible for three minutes.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82937.html",
      "state": "NE",
      "duration": "3 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc5cf",
      "summary": "The object was moving abnormally, with orange rectangular lights around the sides of it that went dim and then very bright.",
      "city": "omaha",
      "shape": "circle",
      "date": "2011-08-21T00:00:00",
      "story": "The object was moving abnormally, with orange rectangular lights around the sides of it that went dim and then very bright. When my girlfriend and i were out on her third floor apartment balcony watching fireworks on the horizon, we noticed a circular object fly into view, moving back and forth, then stopping, hovering, high above the interstate, then moving away and disappearing very quickly. About 5 minutes later, it reappeared, moving back and forth, then hovering for approximately 10 minutes above the same part of the interstate before quickly disappearing into the sky.   The object had rectangular orange lights around the sides of it, moving in a circular motion, that appeared to go dim and then very bright, almost looking like an orange star.  We had a chance to examine it enough that there were no red blinking or white lights on it, as we normally see on a helicopter or airplane, it was flying much lower than airplanes we had previously seen flying over this area, and it wasn't moving in a way a helicopter would, as in circling an area.",
      "link": "http://www.nuforc.org/webreports/083/S83045.html",
      "state": "NE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc715",
      "summary": "A translucent helicopter shaped craft flew under the cloud covered skies for a moment and then was gone.",
      "city": "omaha",
      "shape": "teardrop",
      "date": "2011-10-10T00:00:00",
      "story": "A translucent helicopter shaped craft flew under the cloud covered skies for a moment and then was gone. We were smoking cigarettes outside our apartment building when we looked up and saw a helicopter shape translucent in nature zip under the cloud covered skies. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84399.html",
      "state": "NE",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7b5",
      "summary": "I noticed the craft as it had just passed over Rt 1. i brought my semi to a stop and shut down the engine. the craft was very large,as",
      "city": "omaha",
      "shape": "chevron",
      "date": "2011-10-19T00:00:00",
      "story": "i noticed the craft as it had just passed over Rt 1. i brought my semi to a stop and shut down the engine. the craft was very large, as wide as 300ft and at an altitude of approximately 2-300ft up.  as it moved away from my position i could see the shape of the craft as it became visible in the light of the full moon, as it blended with the night sky and had no blinking lights. i had noticed 2 red lights on the leading edge of the craft for without those i would not have seen the craft. it was moving very slowly. i estimate craft speed at 40-50mph. also it did have a very deep sound that i am not able to describe. not a droning sound but a solid quiet roar.as the craft reached a distance from me of about a quarter of a mile it nearly invisible in the night sky, but i could still detect its movement. i restarted my truck and took off. i traveled more than seven miles before i encountered any other traffic. the object left me with an impression it was piloted an! d very old.",
      "link": "http://www.nuforc.org/webreports/084/S84508.html",
      "state": "IL",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc91e",
      "summary": "reddish orange lights traveling in same path from Northwest to South in Omaha, NE",
      "city": "omaha",
      "shape": "unknown",
      "date": "2011-10-19T00:00:00",
      "story": "reddish orange lights traveling in same path from Northwest to South in Omaha, NE In Omaha, Ne, on October  16, 2011 approximately 7:30 pm I went outside to move my car from my driveway into the garage.  As I was pulling in I looked up at the sky and noticed a strange light appearing out of the northwest and moving towards the south. It was quite bright and seemed to move very smoothly across the sky.  I first thought it was a plane but it seemed to have too much red and orange colors on it.  As it continued to move south , I grabbed my cell and called my neighbor and told her to come out into her front yard.  When I hung up I saw another light appear out of the Northwest and start moving in the same path as the first.  As the first moved further to the south, I was able to get a better look and it seemed it had fire coming from the bottom of it which caused the orange-ish-redish  color – above the orange it was a bright white but I couldn’t really distinguish a particular shape. Then there was another light appearing out of the northwest (now 3 in total) that started following the same path as the first two – they seemed to all gather in the south hanging suspended.  I tried taking a picture with my cell phone but no luck.  My neighbor was looking as well and trying to take a picture with her cell phone.  I think there were 2 more lights appearing and moving the same direction. I then ran into the house to get my camera and by the time I got back out there, my neighbor said they were “all gone”.  She then asked me if I had seen them form a triangle in the south but I didn’t as I had run into get my camera.",
      "link": "http://www.nuforc.org/webreports/084/S84606.html",
      "state": "NE",
      "duration": "3 min approx"
    },
    {
      "_id": "64d005f478aba2ec5a3bd08e",
      "summary": "Unidentified orange lights observed over West  Omaha.",
      "city": "omaha",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Unidentified orange lights observed over West  Omaha. At the intersection of 156th street and Military Road I observed two clusters of orange lights. The first cluster was composed of four lights. The lights were roughly one mile south of my position and traveling west. Three of the lights formed a triangle that seemed to retain its shape as it moved. The fourth light's position relative to the triangle seemed to shift as the cluster traveled west. The second cluster of three orange lights passed overhead my position at the same time. This cluster was also traveling west. The lights seemed to be moving independently. I did not observe any aircraft position lights associated with these lights that were much closer to my position than the first cluster. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92226.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0db",
      "summary": "Metallic, green sphere hovering in the sky in the daytime just south of the Dodge Street Exprsway, Omaha, NE",
      "city": "omaha",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Metallic, green sphere hovering in the sky in the daytime just south of the Dodge Street Exprsway, Omaha, NE On Saturday afternoon, June 30, 2012, I was driving east on the Dodge Street expressway and saw a green, metallic sphere about 50 feet in the air on the south side of the road in front of the apartments around 180th & Dodge.   At first I thought it was a telephone line buoy that they use to warn airplanes of high lines, but when I got closer to it, it was not attached to anything. It was hovering in the sky and then it seem to float fast from east to west and then hovered over the field on the west side of the apartments.  As I drove on eastward, it went out of sight so I don't know how long it was there. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90961.html",
      "state": "NE",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd154",
      "summary": "First time seeing a UFO in the Daytime!",
      "city": "omaha",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "First time seeing a UFO in the Daytime! Ok its the 4th of July and ya there are alot of fireworks flying around.   So as I stood in my backyard flying towards me very low to the ground was this glowing orange red fireball with a white light on it.  It wasnt dark yet and fireworks dont fly this slow or straight.   Im standing there watching this thing fly overhead thinking doesnt anyone else see this thing.  I normaly always have a camera but my phone camera suddenly stopped working as I tried to get some pics.  Then all of the sudden it disappeared.",
      "link": "http://www.nuforc.org/webreports/090/S90780.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1c3",
      "summary": "An orange glowing ball the size of the moon was moving across the sky and split in to two and took off into the night sky!",
      "city": "omaha",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "An orange glowing ball the size of the moon was moving across the sky and split in to two and took off into the night sky!",
      "link": "http://www.nuforc.org/webreports/092/S92097.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd28d",
      "summary": "3 slow moving, diamond shaped crafts flew in a strait line from N to S over the city.",
      "city": "omaha",
      "shape": "diamond",
      "date": "2012-10-30T00:00:00",
      "story": "3 slow moving, diamand shaped crafts flew in a strait line from N to S over the city. I was star gazing in a park when I noticed three crafts flew in a horizontal line flying west. They were appr. 2 miles apart.  white flashers and red flasher and slow moving. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93089.html",
      "state": "NE",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd969",
      "summary": "Huge ball of light came up from the ground and shot into the atmosphere",
      "city": "omaha",
      "shape": "fireball",
      "date": "2012-11-19T00:00:00",
      "story": "Huge ball of light came up from the ground and shot into the atmosphere ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94226.html",
      "state": "NE",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc67",
      "summary": "Disappearing object.",
      "city": "omaha",
      "shape": "disk",
      "date": "2012-11-19T00:00:00",
      "story": "Disappearing object While I was stopped at a red light, something in the sky caught my eye.  There was a cylindrical shapped object which was flying to the south.  Due to the reflection of the sun I was able to determine that this object was cylindrical in shape.  It then stopped moving from what I could tell.  At the very moment it stopped it became an extremely bright white and simply disappeared.",
      "link": "http://www.nuforc.org/webreports/094/S94343.html",
      "state": "NE",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd3c",
      "summary": "There was a lighting that was coming down and then stopped and dissappered in mid air.",
      "city": "omaha",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "there was a lighting that was coming down and then stopped and dissappered in mid air. We was driving on soresen parkwaywwere coming across some streetlight & i saw I circular lighting come down and i said \" mom do you see that \" and she said \" yes\" and she stopped the car and then it dissappered in mid air.  It looked like a firecracker but with no sound or explosion.  And we proceeded driving .",
      "link": "http://www.nuforc.org/webreports/088/S88343.html",
      "state": "NE",
      "duration": "10sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bdfe2",
      "summary": "While running in the early morning, a friend and I witnessed an object flying at a low altitude emitting an orange glow behind it.",
      "city": "omaha",
      "shape": "other",
      "date": "2012-11-19T00:00:00",
      "story": "While running in the early morning, a friend and I witnessed an object flying at a low altitude emitting an orange glow behind it. My friend and I were running this morning, 11/16/2012, the same route we run every Friday at that time.  It was still dark, stars were out.   Out of the corner of my eye I caught movement and a light.  I looked up and some type of craft was passing in front of my line of sight.  It was a dark half-circle shape I believe and had an orange glow behind it across the entire back of the object.  The orange glow tailed out behind for a short distance and there seemed to be occasional sparks within the glow.    The object continued past moving to the southwest, maintaining a constant altitude which was fairly low in the sky.  Neither one of us heard any sound coming from the craft.  It seemed to be moving at a high rate of speed but was easy to follow across the sky until we lost it over the hill.  My friend’s initial thought was that it was a meteor, but I didn’t get that feeling at all.  It was maintaining a constant altitude and seemed to be banking slightly to the! Southwest.",
      "link": "http://www.nuforc.org/webreports/094/S94518.html",
      "state": "NE",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be02f",
      "summary": "Four fast moving tear drop shaped objects high up over Omaha,NE.",
      "city": "omaha",
      "shape": "teardrop",
      "date": "2012-08-05T00:00:00",
      "story": "Four fast moving tear drop shaped objects high up over Omaha,NE. It lasted approximately 2 seconds.  I looked up and saw four translucent teardrop shaped objects moving from the southeast to the northwest.  They were moving quick and at slightly differently trajectories.  (They were fanning out from each other.)",
      "link": "http://www.nuforc.org/webreports/091/S91305.html",
      "state": "NE",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be177",
      "summary": "Large rectangle 168th blondo Omaha ne",
      "city": "omaha",
      "shape": "rectangle",
      "date": "2012-11-04T00:00:00",
      "story": "Large rectangle 168th blondo Omaha ne At first sight it appeared to look like a pair of bright white headlights in the sky with a flashing red light on the back when it turned 90* to the west.  It was heading from approximately 156 and blondo and we saw it coming toward 168 and blondo.  Flying low - the altitude of a helicopter.  When we got closer, and were practically underneath it we looked up.  No noise made by the craft completely silent. Very large rectangle shape with mini white and red lights underneath. It turned sharply to the southeast and took off.  The last time we could see it it looked like a string of white lights in the sky moving rapidly toward the dodge expressway. Side note: think we saw the same crafts about 45 mins earlier at 156 and dodge area. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94028.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be1d3",
      "summary": "I saw a bight light that appeared to follow me from south Omaha to west Omaha on Satruday 9/22/2012",
      "city": "omaha",
      "shape": "cylinder",
      "date": "2012-09-24T00:00:00",
      "story": "I saw a bight light that appeared to follow me from south Omaha to west Omaha on Satruday 9/22/2012 9/22/2012 6:30 am – 6:50 am  I was leaving my house in south Omaha to go to work on Saturday morning. It was exactly 6:30 am on the clock in my car.   I noticed a very, very bright night kind of hovering over the sky above the house.   In perspective, it looked like it was right over the point in the attic of the house.   So I back up and as I back up, this light goes straight up vertically right over the house, moving higher into the sky.   I noticed….and stopped... When I stopped, it stopped.   Then I put the car back in drive and moved back into the driveway, the light followed and dropped back down, moving closer.   I did it again and the light followed each time. Then I started thinking, maybe it is a police helicopter of something.  So I back out again and pulled out as I normally do, still seeing this light moving with me.   I went to the end of the drive and began to pull out on to the street.  Curiousity had a hold of me at this point so I put the car in park and got out again.   The light had moved over horizontally again as if it was following me. I noticed the time was now 6:50 am, which seemed was crazy,  time just flew, I did not realize I had spent so much time watching this bright light. So I get back in the car, and drive away.    I drove 2 blocks over and 4 blocks up which took me to the stop sign at 23rd and F street.   I  put the car in park again and got out to see if I could see the light.   It was there, right above the street ,  definitely following me.   I wasn’t afraid or anything, I just kept thinking, what the heck is this. So I was getting back in the car and I saw a man going to his car….I kind of waved to him and I asked him if he could see this light…he kept saying no, but there is no way anyone could miss this light.   I told him to  follow the tree  line and look again.  He said no and got in his car. So I got back in my car and proceeded to work.   I work off of 120th and Maple.   When I got to work, I glanced up quickly to see if I see anything and I did not. So a few minutes later, a coworker arrived, she had picked up breakfast and her hands were full, so I went to the door to help her gather her things.   The light was there. I asked her if she could see it and she did.  She said she thought it was a black hawk helicopter  and did not seem too impressed, but by now, it was lighter outside and it did not look as spectacular  and of course she did not see it move across the sky as I did. I have no clue what this was but I asked it to make us treat each other well and the take care of the world better……………..oh and I also asked it to make me rich and skinny….just in case it was something out of the ordinary and could hear me.",
      "link": "http://www.nuforc.org/webreports/092/S92976.html",
      "state": "NE",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be249",
      "summary": "Two mysterious red lights hoovering across the providence. lasted about 4 minutes.",
      "city": "omaha",
      "shape": "light",
      "date": "2012-11-04T00:00:00",
      "story": "Two mysterious red lights hoovering across the providence. lasted about 4 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94081.html",
      "state": "NE",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be2c6",
      "summary": "Two mysterious red lights floating across the sky, it lasted about 4 minutes and suddenly dissapeared.",
      "city": "omaha",
      "shape": "other",
      "date": "2012-11-04T00:00:00",
      "story": "Two mysterious red lights floating across the sky, it lasted about 4 minutes and suddenly dissapeared. Theyre was 2 red lights floating across the sky, they seemed to come from the middle of no where and suddenly kept coming closer and dissapeared, it was two flashing lights I took a glimpse and they were both shaped like saucers. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We suspect that the sighting took place as night, so we have amended the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94082.html",
      "state": "NE",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be387",
      "summary": "A hovering large, rectangle-shaped object with lights over the 150th St. area just south of Dodge Exprsswy",
      "city": "omaha",
      "shape": "rectangle",
      "date": "2012-10-30T00:00:00",
      "story": "A hovering large, rectangle-shaped object with lights over the 150th St. area just south of Dodge Exprsswy Between 144th and 156th street exits on the Dodge Expressway, I saw a large object in the sky.  It was a large rectangle shape and all across the front, it had bright white lights.   Underneath the craft, you could see what looked like a faint light coming from inside the object.  At the back, was a red light.   It came from the Southwest and hovered over about 150th St., on the south side of Dodge for about three minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93960.html",
      "state": "NE",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be60a",
      "summary": "4 objects flying into storm",
      "city": "omaha",
      "shape": "other",
      "date": "2012-05-29T00:00:00",
      "story": "4 objects flying into storm I was watching a set of severe thunderstorms coming in from the south. My house faces west and have a view of horizon.  Observing the storm I looked up and saw a red/orange light traveling southwest.  The object was very low traveling under cloud level.  The light faded and I could a black structure still traveling at same altitude heading into the storm.  After the first object disappeared I soon saw a second light coming from NE to SW.  The object followed in the same path and appeared to mimick the first object.  This happened twice again to make it four objects.  These were traveling against wind heading into storm.  They were all maintaining same altitude above cloud line.  Estimated 1500-2000 ft.  Very intense experience.  I've lived near air traffic my whole life and this was no plane. Made no noise!  Not balloons or lanterns because of maintained altitude!   WOW!!!!!!!",
      "link": "http://www.nuforc.org/webreports/089/S89058.html",
      "state": "NE",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3be68e",
      "summary": "This is the second time I and my friend seen this object the first one was in April can't remember the exact date and the one I saw yes",
      "city": "omaha",
      "shape": "triangle",
      "date": "2012-06-08T00:00:00",
      "story": "This is the second time I and my friend seen this object the first one was in April can't remember the exact date and the one I saw yesterday on June 6th 2012 it was a triangle shaped object with round lights and it just went on strait no noise at all very silent the first time I saw it split up and disappears and this time it didn't it just faded alway in the night sky I tryrrd to film it but my iPod was dead that's all I know and please help me out I and my friend are really scared",
      "link": "http://www.nuforc.org/webreports/089/S89396.html",
      "state": "NE",
      "duration": "5 to 8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be75d",
      "summary": "Omaha,Nebraska eye witness sighting orange and red light that flashed white light small red lights flew over and two red lights flew",
      "city": "omaha",
      "shape": "light",
      "date": "2012-06-14T00:00:00",
      "story": "Omaha,Nebraska eye witness sighting orange and red light that flashed white light small red lights flew over and two red lights flew I went outside my apartment building at 4 am on 6-12-2012.  I live in Omaha Nebraska.  I looked into the northwest sky and had noticed an orange and red light high in the sky. I could not tell how high in the sky it was.  It looked like it was the size of Venus when it was viewable in May 2012,  But it was too low in the sky to be Venus.  To gauge the distance I would have to say it was, at least from my perspective, least five miles northwest of my corner of 19th and Douglas st. As I looked at it it would pulse orange and red. Sometimes it would flash a bright white light.  It just hovered in the sky motionless.  After walking three blocks west on Douglas which took about 10 minutes in a casual walk, I had noticed a bright red light, a much smaller light, had flew from the south and flew in an arch over the orange and red light and I had lost track of it.  After that happened about 15 minutes later I saw two red lights flying side by side heading east.  I could hear a helicopter flying around behind me but I could not see it.  I saw the red lights that flew together as they passed over my head.  They did not blink or flash they were at a constant glow.  The red was like the color of crimson. I looked back at the red orange light in the sky still motionless.  I watched it for about 15 more minutes and there was no movement, I could still hear helicopters, but they were not close to the object as I could tell.  I walked back to my apartment, which took about 10 minutes and went to the roof of my building. There are eleven floors on my building and I went to the roof, which opens at 5am.  I went to the roof to see if I could still see this light.  It was still there.  From higher up I could see that it was far too low in the sky to be celestial.  The sun was starting to come up and it was harder to see but it was still there.  I cant quite gauge the distance from me it was, but if I may submit a photo showing the building and where it was in the sky in relation to the building it would be easier for me to explain. It slowly moved northwest and slowly disappeared from sight. Sighting ended about 5:15am on 6-12-2012",
      "link": "http://www.nuforc.org/webreports/089/S89554.html",
      "state": "NE",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3be7cc",
      "summary": "Bright lights moving across the sky.",
      "city": "omaha",
      "shape": "light",
      "date": "2012-05-29T00:00:00",
      "story": "Bright lights moving across the sky. We first noticed a bright light that was flashing in the sky. It flashed 2 - 3 times and then stpped. The light then resembled a small star and did not appear to be moving. A second bright light light showed up 10 minutes later, but located more directly overhead and was constantly bright(not flashing). The second light appeared to be moving slightly in circular motions. About 10 minutes after the second light appeared, the first light that resembled a small start suddenly flew across the sky and the two lights began to move around eachother very noticeably. The two lights were far too distant to be any type of aircraft.  They resembled stars. They also changed directly rapidly and moved in circular motions.  I have not seen air planes or other flying objects move like this.  Also, the smaller light that moved across the sky, moved very quickly within a second or two. I can't imagine any object that is capable of moving this fast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89152.html",
      "state": "NE",
      "duration": "30mins"
    },
    {
      "_id": "64d005f478aba2ec5a3be918",
      "summary": "East to west movement of a circular obj. reddish orange light...this object shot upwards twords outerspace....then returned for another",
      "city": "omaha",
      "shape": "circle",
      "date": "2012-05-29T00:00:00",
      "story": "est to west movement of a circular object redish orange light...this object shot upwards twords outerspace....then returned for another minute then shot back up.",
      "link": "http://www.nuforc.org/webreports/089/S89271.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be920",
      "summary": "Red glowing light seen over West Omaha sky evening of 05/28/2012",
      "city": "omaha",
      "shape": "circle",
      "date": "2012-05-29T00:00:00",
      "story": "Red glowing light seen over West Omaha sky evening of 05/28/2012 Hello, this event just took place on 05/28/2012 from the time period 21:25 to 21:45.I was going to the bathroom 2nd floor in a house that is on a fairly good sized hill.Sitting on the toilet looking out the window i was looking and when appeared a bright red light above the tree line.I watched this red light which traveled slowly and methodically without blinking or moving wildly.It seemed it was looking for something or was programmed on a slow paced circular pattern above the area of the city.At that time i called for my brother to come see what i was looking at.  He ran upstairs and we watched it together.  The red light started to dim and then slowly faded completely.We could still see the darkness of the craft,i threw open the window and could hear no motor or any type of small engine sounds coming from that area in the sky.It then slowly moved out of my line of sight and disappeared.I then ran downstairs and outside the backdoor,down on the lawn so we could! see better.  It was around 5 minutes standing outside waiting when almost ready to go inside because of biting misquitoes when another red light very similar to the first light appeared in the same area as when i saw the first one. This object looked brighter and moved very similar but the light stayed consistant this rime never fading,it was almost cigar shaped like a torch but then became smaller and more cylyndrical like a circle.We watched until it slowly and methodically disappeared westward towards the horizon.It was less than 5 minutes again when appeared in the same vacinity as the first two,a massive bright torchlike shaped cigar which was 10 times brighter than the first two.Following very close near that location was an immense bright &quot;white&quot; light from a mid-sized what appeared to be a military plane headed towards my direction,toward the military base-Offutt/Space-Strat Com. Bellevue,Nebraska.The red object then floated slowly and traveled in a similar ! pattern as the first two,it traveled this slow pattern again h! eading w estward toward the horizon.These lights seemed to be individual separate lights.Never blinking or flashing just the first mentioned which faded then re-appeared.I think it was probably a military test craft or drone,just my opinion but I wanted to make sure i wrote this report as quickly as I saw it asap.Thank you.",
      "link": "http://www.nuforc.org/webreports/089/S89253.html",
      "state": "NE",
      "duration": "21:45"
    },
    {
      "_id": "64d005f478aba2ec5a3bede8",
      "summary": "3 v-shaped objects.",
      "city": "omaha",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "3 v shaped objects 2 very fast moveing V-shaped objects moving from north to south, and 1 that followed probably 1 min or so later all objects were the same color like silvery whitish no lights on the crafts did i see, the last object was very big in size and im not even gonna guess, maybe someone else seen it as well. clear nite sky, no clouds ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97142.html",
      "state": "NE",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf53a",
      "summary": "2 ufo's following black car down I-80.",
      "city": "omaha",
      "shape": "sphere",
      "date": "2013-09-09T00:00:00",
      "story": "2 ufo's following black car down I-80 I was stareing at a golden ball driving down I-80 going to pick my mom up from work an I noticed that the golden ball I looked at was following me. I stopped on the side of the interstate 2 or three times an when I stopped the gold ufo ball would stop finally I was going west an I noticed it was still following.  I stopped on the side of the interstate threw ny hands up like what, i felt like it was a movie because there were 2 ufo's following me I sped off called my friend he said he couldn't hear me for a minute or so sped around area's with lots of trees so they couldn't follow an they disappeared by the time i went around neighborhoods. but it seemed to follow me off the interstate an when I existed it stopped following. I was in a black car. the object has never followed me in the red car, also I have seen the same thing just flying about 10,000 following firework smoke an after the boston terror thing I noticed there was a golden ball that day flashing ! from gold to red it was going up ames street west bound.If u watch the sky you see them all the time I have seen them going in every direction alot of the time they don't even stop they just fly right over my head one time we were walking an a ufo flew right over head from west to east. I can say Ive seen them go every direction. I think they watch or mess with the people who don't believe because now that I believe there's something else out there they don't bother me any more.  Oh an I was the one that said I say a ufo above the tree in the back yard I forgot to say mark that the reason I noticed the ufo was mainly because I think my dogs were barking at it or at least they were barking towards the ufo I belive the ufo's are portals that aliens can enter our world threw an or they are camera's so they can see where to block the sun but they obvious like to mess with people some times if i think about them I will see a real bright gold right on top of my neighbors house then! when I look it disapaers. I also noticed that the day all of ! the star s were falling, there were the 2 that are always there an all of the sudden both of the balls of light went the opposite direction an diapered. that same day I went out west an saw a silver ball not far off the ground flashing from silver the dark or so you couldn't see it. It was flying around then disapered. I am always watching for activity. I think I would have seen alot more but I never knew about ufo's untill 4 years ago.",
      "link": "http://www.nuforc.org/webreports/102/S102036.html",
      "state": "NE",
      "duration": "10-15mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bf537",
      "summary": "Ufo right above tree 50-80 foot.",
      "city": "omaha",
      "shape": "sphere",
      "date": "2013-09-09T00:00:00",
      "story": "Ufo right above tree 50-80 foot. I was in my back yard looking at chem-things with my dogs when I noticed a golden ball or ufo above me neigh boors tree watching me. I couldn't believe it i walked over to the north an the ball went to the tree that was north of me.  I wanted to see what it was so I started moving my head left to right.  The ball did the same exact movement.   I went in the house to get a camera an I couldn't find the ball anywhere told the police they said nothing this was in west omaha. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102037.html",
      "state": "NE",
      "duration": "2-4 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bf58f",
      "summary": "Silver, cylindrical object seen over Omaha skies.",
      "city": "omaha",
      "shape": "cylinder",
      "date": "2013-10-14T00:00:00",
      "story": "Silver, cylindrical object seen over Omaha skies I saw a cylindrical object over the western portion of Omaha, NE on Tuesday, October 2, 2013 at approximately 13:55 hours.  It was silver in color, looked to be shaped like a cylinder and hovered in the sky for about two minutes or so and then it disappeared.  It looked like it was a large object, even though it was probably 5-6 miles away.  I can't say how long it was actually there since I didn't notice it until I was driving on Dodge Street heading west back to my office.  It could have been there for a much longer time.  But it was definitely there and then gone.",
      "link": "http://www.nuforc.org/webreports/102/S102934.html",
      "state": "NE",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6c4",
      "summary": "White craft with pink mist around it.",
      "city": "omaha",
      "shape": "unknown",
      "date": "2013-02-04T00:00:00",
      "story": "White craft with pink mist around it My brother was driving to downtown Omaha, and I had decided to take pictures of this weird cloud on my phone, because I had read somewhere that sometimes weird things will show up on pictures but not to the naked eye.   I took a bunch of pictures and when I looked back on them, only on a few and zoomed in, I could see a weird shaped craft.  I couldn’t see it with my naked eye, I had to take a picture of it to show up in the sky.   The craft looked like two spheres on top, and a figure eight design on the bottom.  The top two spheres looked like the front of a bra would and white, the bottom looked like metal.  There was a pink miasma that surrounded it but only in the picture as well.   The craft was very small, and I had to zoom in on the picture to see it clearly, but most definitely not a normal craft to see flying about.   It was flying not super low, but it wasn’t high up in the sky either.",
      "link": "http://www.nuforc.org/webreports/095/S95584.html",
      "state": "NE",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bffe8",
      "summary": "A object at what i guess 30 thousand feet take a sharp turn then disappeared",
      "city": "omaha",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "A object at what i guess 30 thousand feet take a sharp turn then disappeared I saw what I believe to be a aircraft at 30 thousand feet.  I wondered why it would still have its lights on.   At that moment it took a sharp right turn and disappeared.   It was a clear sky nothing else but stars and moon.",
      "link": "http://www.nuforc.org/webreports/098/S98956.html",
      "state": "NE",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c019c",
      "summary": "Loud humming sound off and on, unlike any type of plane, car or helicopter.",
      "city": "omaha",
      "shape": "unknown",
      "date": "2012-12-20T00:00:00",
      "story": "Loud humming sound off and on, unlike any type of plane, car or helicopter. I have not seen anything yet, but there is a loud humming noise that wakes me up between 3 AM and 5 AM every night lately.  It's indescribable really.  Doesn't sound like anything a human could make or produce from an object.",
      "link": "http://www.nuforc.org/webreports/094/S94877.html",
      "state": "NE",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c05f6",
      "summary": "Spuratic orange ball.",
      "city": "omaha",
      "shape": "sphere",
      "date": "2012-12-20T00:00:00",
      "story": "spuratic orange ball My friends and I were working late and one of the guys went outside to pee and saw a orange ball of light spuraticly moving in different directions.   He yelled loudly my name to come look at it and right when he raised his voice the object in the north sky instantly stopped moving    as I ran out side to look he said there's our UFO we had seen a week prior as it slowly hovered from north to south and as he shined his flash light  It sped away to the south and disappeared .  On this occasion we after he seen it it just stayed in place and almost acted like I was trying to be a star but moved ever so little up and down",
      "link": "http://www.nuforc.org/webreports/095/S95112.html",
      "state": "NE",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0763",
      "summary": "50 lights in sky over 72nd street attached to black silhouette.",
      "city": "omaha",
      "shape": "unknown",
      "date": "2014-01-10T00:00:00",
      "story": "50 lights in sky over 72nd street attached to black silhouette. I've lived in Omaha all my life, I've had my share of strange things happen to me but the night I saw this with my mother and friend it changed me, we were pulling out of my mothers driveway when we noticed around 50 lights all spaced out around 15ft apart from each other but moving simultaneously, we decided to follow whatever these things were heading north from 72nd and maple down 72nd street.  Once we got close and I meen literally 40 to 50 feet under it I saw that the lights were attached to a black silhouette of a craft that when it passed by stars they would disappear behind the darkness of this craft, it was bigger than anything I've ever seen in the sky, once it reached crown point on 72nd all the lights disappeared at once and I could no longer see the silhouette either, but the thing is I'm surprised that it wasn't on the news or anything, there were so many people out that night, we couldn't have been the only ones who saw this.",
      "link": "http://www.nuforc.org/webreports/105/S105963.html",
      "state": "NE",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c09a3",
      "summary": "Bright light traveling southeast over downtown Omaha. Thought maybe it was a Chinese lantern but it stopped and reversed course.",
      "city": "omaha",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "Bright light traveling southeast over downtown Omaha.  Thought maybe it was a Chinese lantern but it stopped and reversed course and then just disappeared.  No sound.  There was a plane in the same general area and it was traveling about twice the speed of the plane.",
      "link": "http://www.nuforc.org/webreports/105/S105534.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c51",
      "summary": "3 lights with no sound heard, traveling N to S in straight line formation.",
      "city": "omaha",
      "shape": "formation",
      "date": "2014-02-07T00:00:00",
      "story": "3 lights with no sound heard, traveling N to S in straight line formation Before proceeding, a brief personal history.  I am 59 years old, and a 36 year veteran Police officer in the Dallas TX. area.  In the Military in the 1970's I was in search radar, both air and surface, and am trained in aircraft recognition and performance. I work in the Dallas metro area, but live about 140 miles NE of Dallas near the small town of Omaha Tx.  My house is 8 miles from any town, and its very dark at night, the sky is alive with stars, and the Milky Way blazes across the sky at night. On the listed date and time, I walked out of my house to get something out of my car,  which was parked in front of my barn about 150 feet from my house.  As is my usual habit, I looked up at the sky.  As soon as I looked towards Polaris, I saw 3 lights traveling in a straight line formation, or follow the leader formation.  Since they were only lights, I could not tell the altitude.  From my perspective they were about half the size of a pencil eraser, and again from my perspective, they were approximately 1 foot apart from each other.  The lights were brighter than the stars and were brilliant white.  It is very quiet at my place , and I often hear airliners flying at 30+ thousand feet as they pass over my house as a low roar.  These lights produced no sound at all that I could hear. I cannot estimate the speed at which the lights were traveling since I don't have an altitude to base it on.  However they traversed the sky from North to South till out of sight in about 15 seconds. I don't believe these were satellites.  I know what objects in orbit look like as they pass overhead.  These lights were traveling too fast. 3",
      "link": "http://www.nuforc.org/webreports/106/S106797.html",
      "state": "TX",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cee",
      "summary": "Silent huge triangular ship flies right over highway 65 North.",
      "city": "omaha",
      "shape": "triangle",
      "date": "2014-01-16T00:00:00",
      "story": "Silent huge triangular ship flies right over highway 65 North. My mom & I were driving from Harrison AR. to Springfield, MO.  My niece had just been transported there a day after she was born.   I was driving on Highway 65 North almost to Omaha, AR.  It was a nice night and I had my sun roof open.  I was watching the traffic when I noticed that the traffic was slowing down.  I was asking my mom if she could see the reason for the traffic slowing down?   Now I can't really remember who said, \"Look at that flying over the mountain!\"  We were just in \"awe\" of what we were seeing.  Now, the traffic coming and going from the state line had come to a complete stop!  An airship, dark gray in color, shape like a triangle, was flying over the mountain with a white light from the center as if it was scanning the country side, searching for something.  It was like 3 football fields wide as well as long.   As it was flying above us very slowly, there was NO noise coming from it.  We were amazed as we were looking at it thru th! e sunroof.  My mom was commenting on how low it was flying.  It was solid!  It looked too amazing to be true.   The light that was searching the mountain & field turned off right before the light got to the highway.  We sat there just watching it.  There was NO noise at all when it flew over us!   Everybody just sat there & watched it until it flew out of sight!   That night will forever be ingrained in us!  We believe!:)",
      "link": "http://www.nuforc.org/webreports/106/S106306.html",
      "state": "AR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1dc5",
      "summary": "Strong flashing light reversing its course in flight.",
      "city": "omaha",
      "shape": "light",
      "date": "2014-06-13T00:00:00",
      "story": "Strong flashing light reversing its course in flight. Watched a distant light that I thought at first was a high flying aircraft.  It was making a jagged flight path and flashing a red, green, white, and yellow light at a very high rate.  The light finally straightened out and flew over the roof line of the house.   I didn't think too much of it until the light reversed its course and flew backwards along its same path flashing more intensely as it did so.  The light then stopped in its bath then moved forward again back over the roof line at a much higher speed and disappeared over the roof line.",
      "link": "http://www.nuforc.org/webreports/110/S110013.html",
      "state": "NE",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d92",
      "summary": "High, very bright steady light moving in a very strange square pattern then disappearing.",
      "city": "omaha",
      "shape": "light",
      "date": "2014-06-20T00:00:00",
      "story": "High, very bright steady light moving in a very strange square pattern then disappearing. Very bright, steady light appeared to be somewhat high.   Moving east to west then did an abrupt 90 degree turn south, then proceeded to move in a kind of soft edged square pattern for maybe 1 minute, before just disappearing.",
      "link": "http://www.nuforc.org/webreports/110/S110352.html",
      "state": "NE",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2689",
      "summary": "Green streak of light came down to earth, thought to be a meteorite, then slowed down blinking red light before disappearing near groun",
      "city": "omaha",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "green streak of light came down to earth, thought to be a meteorite, then slowed down blinking red light before disappearing near ground level",
      "link": "http://www.nuforc.org/webreports/114/S114771.html",
      "state": "NE",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2701",
      "summary": "Saw vehicles decelerate from FTL flight then split into formation",
      "city": "omaha",
      "shape": "formation",
      "date": "2014-10-10T00:00:00",
      "story": "Saw vehicles decelerate from FTL flight then split into formation I stepped outside and began to stargaze, my daughter was with me. From the North a light white fuzzy streaked and decelerated. it blinked into existance, it then opened up into an echlon formation with 9 indivudual lights on all sides of the triangle and proceeded on a direct southern course. it was out of sight in no time at all.",
      "link": "http://www.nuforc.org/webreports/114/S114212.html",
      "state": "NE",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c296a",
      "summary": "Light Sighting.",
      "city": "omaha",
      "shape": "light",
      "date": "2014-08-29T00:00:00",
      "story": "Light Sighting Leaving the grocery store I looked up and saw a flying light in the sky.  It looked like a flying light.  It was not flashing it was steady light.   I watched as the light went in and out of the low clouds.  It seemed to fly in a large circle around the area twice, then on its 3rd approach to my area, it disappeared instantly.   I saw no light or object.  I waited but it did not reappear. I did take a cell phone video of it on its 2nd approach, however its not good footage as my cell phone couldn't zoom in on it very well.",
      "link": "http://www.nuforc.org/webreports/112/S112868.html",
      "state": "NE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b76",
      "summary": "Red light in southwest.",
      "city": "omaha",
      "shape": "unknown",
      "date": "2014-09-25T00:00:00",
      "story": "Red light in southwest. We saw a low traveling dark red light moving slowly from west to south for 7 mins, the object slowed down to almost a stop and then faded out.  The object had no strobes or landing light, it was a consistent red color until it faded out. ((NUFORC Note:  Witness provides no contact information.  We have changed the time, to reflect a nighttime sighting.  Possible hoax, we wonder.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113741.html",
      "state": "NE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2dd5",
      "summary": "Originally I was a little skeptical about Aliens and UFO's, but I definitely seen something unusual over downtown Omaha around 7:40 A.M",
      "city": "omaha",
      "shape": "triangle",
      "date": "2014-09-18T00:00:00",
      "story": "Originally, I was a bit skeptical about aliens and UFO's, but I definitely saw something unusual over downtown Omaha at about 7:40 A.M. on September 16, 2014. I was actually coming from Council Bluffs, Iowa.  Everything was very foggy and I seen lights from no where.  I was with someone and they said, \"That's a UFO.\"   I originally thought a building was on fire or that an aircraft had exploded.   Shortly after, I begin thinking about the possibilities and explanations of the sighting, the object begin hovering around and more lights begin to turn on.  I would say the sighting lasted about 45 seconds to a min.   After the lights begin to cut off and on it slowly begin to drift east towards Iowa.  The speed of the object begin to pick up, and after I blinked, it was gone.   It wasn't until about 5 minutes after the event did I realize this could have been something that was extraterrestrial.  It was shaped like a diamond though, not the circular traditional shape.   Unfortunately, I don't have pics or video. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113625.html",
      "state": "NE",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e36",
      "summary": "Flashing green, red, white lights moving unpredictably.",
      "city": "omaha",
      "shape": "triangle",
      "date": "2014-09-18T00:00:00",
      "story": "Flasing green, red, white lights moving unpredictably. Viewed from back porch.  Three flickering lights white, green, red moving in unpredictable patterns slowly seeming to move further away over the course of 30 minutes.  No clear trajectory.  Flashing unpredictably in a triangle formation. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113650.html",
      "state": "NE",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c30fa",
      "summary": "Glowing lights sometimes all at once hovering close to humans on ground was very quiet maybe less than 100 miles from ground.",
      "city": "omaha",
      "shape": "unknown",
      "date": "2014-08-08T00:00:00",
      "story": "Glowing lights sometimes all at once hovering close to humans on ground was very quiet maybe less than 100 miles from ground . Hello, i was looking outside my front house indoor windows when I noticed a big two story shaped UFO it was multiple colors glowing: red, green, orange, yellow, blue and it was glowing different colors really fast one min they all were dark no lights just dark.   I noticed same time this happened it went hyper speed fast to few miles from where it had been, also it was very quiet it was pretty low around lots of witnesses I don't think anyone noticed it.   It was closer to people than you'd expect was just hovering but had activity with lights glowing nearly all at once.  It turned to same color as clouds and disappeared which freaked me out.  I kinda think it sensed me looking and took off.",
      "link": "http://www.nuforc.org/webreports/112/S112205.html",
      "state": "NE",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3579",
      "summary": "Omaha UFO.",
      "city": "omaha",
      "shape": "triangle",
      "date": "2015-02-20T00:00:00",
      "story": "Omaha UFO. I was driving West, around 80th on Maple Street in Omaha, NE, when I noticed I bright white light in the sky. The light looked like a huge star.  I started watching the bright light and than it started to dim.  I kept watching it to see if maybe it was a helicopter or a airplane and I noticed red lights on the perimeter that were shaped like a triangle.  The craft moved to the North at a slow rate of speed.  I didn't hear any sound coming off the craft.  It was nothing like anything I have ever seen before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117289.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3dd6",
      "summary": "((HOAX??))  Omaha aliens?",
      "city": "omaha",
      "shape": "other",
      "date": "2015-07-03T00:00:00",
      "story": "omaha aleins? red and blue then white flash light hovering around lake st then changing green with a red flashing light hovered up down then up and stayed in one spot then slowly disappeared behind trees no sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  We have changed the time above, to reflect a nighttime sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119894.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c430d",
      "summary": "Sighting of V-shaped UFO less then 100' from my deck.",
      "city": "omaha",
      "shape": "other",
      "date": "2015-10-16T00:00:00",
      "story": "Sighting of V shaped UFO less then 100' from my deck. Craft appeared cloaked in a cloud shape and moving slowly from North to South.  I was standing on my deck facing east on the third floor of my apartment building.  It was approximately 50' to my left when I spotted it and no more then 10' above me.  As it slowly moved and came abreast of me it changed shape into a solid form.  It was dark or grey in color and seemed very large.  Maybe 50'to 75' across in a V shape.  There were no lights and a very faint wind sound.  I couldn't see the front, only the V shape of the wings.  It continued moving slowly south and changed back to a white cloud shape. It passed right above a tree and simply disappeared.",
      "link": "http://www.nuforc.org/webreports/122/S122826.html",
      "state": "NE",
      "duration": "4:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c45d7",
      "summary": "Harmonic projection appeared as two units on street as  glimmering  objects that moved at a high rate of speed and disappeared as I ca",
      "city": "omaha",
      "shape": "unknown",
      "date": "2015-11-12T00:00:00",
      "story": "Harmonic  projection appeared as two units on street as  glimmering  objects that moved at a high rate of speed and disappeared as I came upon their location by accident. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124005.html",
      "state": "NE",
      "duration": ">30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4aeb",
      "summary": "Strange \"V-shaped\" glowing orbs.",
      "city": "omaha",
      "shape": "formation",
      "date": "2015-10-02T00:00:00",
      "story": "Strange \"V-shaped\" glowing orbs. I was leaving Council Bluffs via Broadway onto the interstate to Omaha.  As always, I see the skyline of downtown omaha.   Just above the silhouette of the First National Building, I see a white \"V\".  It appeared to be a plane with vapor trails but could not distinguish a plane from it.  Then I saw a bright light that appeared to be a star, but it went from bright, to dim, then disappeared.   At the same time the \"V\" appeared to be dropping, not going away from me as an aircraft should.  Then another \"star\" appeared in a different area of the sky, but still around the \"V\".   Once again it repeated the cycle as the one before it: bright, dim, then disappeared.  By the time I got to my exit at 30th and Dodge, a third \"star\" was starting what appeared to be the same cycle, but I lost it after the horizon went behind the tree line by Boystown/Creighton hospital.  By the time I got to the top of Cuming and 40th the \"V\" was starting to go below the tree line further west without any more sightings of the \"stars.\"  During the drive from Council Bluffs the \"star\" locations were as follows:  9 o'clock of the \"V\",  6 o'clock of the \"V\" and 3 o'clock of the \"V\", almost exactly.",
      "link": "http://www.nuforc.org/webreports/122/S122437.html",
      "state": "NE",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d3a",
      "summary": "Omaha UFO seen floating above building",
      "city": "omaha",
      "shape": "disk",
      "date": "2015-09-11T00:00:00",
      "story": "Omaha UFO seen floating above building I was in my living room on my phone, I was looking out to see the weather and then I see something above (what I think is a government building), it was floating there for a good minute or so, it was twinkled like a star but it was orange/red and way too close to be a star.   Then it started to move real slow away from the building, I looked away for one second then poof, it was gone. I'm a 16 year old highschooler, and I accidentally fell asleep all evening, which is why I was up at 1am.  I wish we could post pictures because I took some but oh well. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121835.html",
      "state": "NE",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c52e7",
      "summary": "Entire city lit up with light and a huge boom! The entire city is talking about it and several news stations are covering it.",
      "city": "omaha",
      "shape": "light",
      "date": "2016-01-05T00:00:00",
      "story": "Entire city lit up with light and a huge boom!  The entire city is talking about it and several news stations are covering it.   There are several links to video. ((ADDENDUM FROM RADIO LISTENER)) Hi there.  I was listening to \"coast to coast AM\" and I heard you ask about it.  Yes I was ending a date that night about 1:22am and I was scraping her windows while she was in her car.  All of a sudden I seen a reflection like the police helicopter just shined their lights on me I turned around and nothing.  She asked \"what was that light?\"  I said, \"I don't know\".  I did not hear a boom, but some other did from what the news said.  All I know is that-that light was bright!!!  Like I said, I thought the police helicopter shined their light on me, and not even two seconds later, it was gone.   In the morning they were talking about it on the news and did say some people heard a boom. I personally didn't and I was outside.  Btw the date went great but she lost interest later on down the road.  Thanks, ((name deleted)) ((END ADDENDUM)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124895.html",
      "state": "NE",
      "duration": "brief"
    },
    {
      "_id": "64d005f478aba2ec5a3c5693",
      "summary": "Silver disk flies level across sky, at low altitude, before dusk.",
      "city": "omaha",
      "shape": "disk",
      "date": "2016-06-24T00:00:00",
      "story": "Silver disk flies level across sky, at low altitude, before dusk. It was mid summer in the Early 90's and my father, brother and I were playing catch in our backyard in northwest Omaha.  I was around 9 or 10 at the time.  We all spotted a silver disk flying very slowly to the north or northeast at a low altitude.  It was still daylight out but it was nearing night time, and it was a perfectly clear summer day. We lived close to Interstate 680 and Fort street, and the disk appeared to be floating, maybe 2 to 3 miles beyond the interstate.  I did not see any lights on the craft, but my father thought he saw some.  I simply remember the shape of the craft.  It appeared to have a distinct upper section and a smaller lower section.  Depending on the distance, the craft did not look very large I would have to say it was no larger than 60 feet across and 15 to 20 feet top to bottom.  The disk traveled perfectly level for a long time and made no sound whatsoever.  It then began to speed up and it then passed beyond our vision after about 6 minutes. I remember not knowing what the craft was but thinking it was unique and cool.  I had spent much time at epply airfield because my dad worked there for a long time and I had not only flown on commercial airplanes but I had been near them and seen them close up on the ground many times.  I have never in my 30 plus years seen anything fly where this disk flew. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127932.html",
      "state": "NE",
      "duration": "6-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5aae",
      "summary": "((HOAX??))  Beautiful sunny day with a lot of clouds; noticed that a certain cloud was a little out of place.",
      "city": "omaha",
      "shape": "unknown",
      "date": "2016-04-15T00:00:00",
      "story": "It was a very beautiful sunny day with a lot of clouds but they were fluffy white clouds I was sitting on the top balcony of my apartment as I'm sitting there enjoying a cigarette I looked up in the sky and noticed that a certain Cloud was a little out of place it wasn't that it was not what was supposed to be it looked more like it was pixelated like it was a cloaking device or something so I never saw the shape of the think I set there and watch this for ten minutes even looking away and going back to a just make sure my eyes weren't playing tricks on me as I started to stare at it more more I washed it move around a little and then all the sudden it kind of like disappeared in the other clouds so I couldn't see this pixelation thing I don't think I'm crazy but I've been looking to see if anyone else kind of had this thing and I've seen other reports but not quite like this please help me figure out what this was ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126727.html",
      "state": "NE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6676",
      "summary": "Black ufo spotted on a late night drive.",
      "city": "omaha",
      "shape": "circle",
      "date": "2016-08-02T00:00:00",
      "story": "Black ufo spotted on a late night drive. Black circle with red lights flashing round the side with one green light at the top that was blinking.  Moved slowly then picked up speed when we started following it.  Disappeared after that.  Couldn't find where it went.",
      "link": "http://www.nuforc.org/webreports/128/S128966.html",
      "state": "NE",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c680f",
      "summary": "I saw 3 rectangle-shaped objects flying in the sky, while I was outside, approximately 11:00 PM.  ((anonymous report))",
      "city": "omaha",
      "shape": "rectangle",
      "date": "2017-03-10T00:00:00",
      "story": "I saw 3 rectangle-shaped objects flying in the sky, while I was outside with my friend at my campfire, approximately 11:00 PM.  And my friends dog was barking like crazy.   We saw it heading toward Ouffut AFB.  These craft were flying very low, and I don't know if anybody else noticed them beside me and my friend.  They couldn't be airplanes, or even helicopters.  They made a very strange humming sound.  They weren't drones either, because they were too big.  That is all I remember.  But it still is spooky! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132859.html",
      "state": "NE",
      "duration": "2 minutes?"
    },
    {
      "_id": "64d005f478aba2ec5a3c683b",
      "summary": "I witnessed an flying circle floating low, then started going high into the air as it kept moving.  ((anonymous report))",
      "city": "omaha",
      "shape": "circle",
      "date": "2017-04-20T00:00:00",
      "story": "In the morning of Tuesday 4-18-2017.  I witnessed an flying circle floating low then started going high into the air as it kept moving.   It was a small circle dark in color no lights no nothing. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133681.html",
      "state": "NE",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6bf2",
      "summary": "1/17/2017 Omaha, NE, ball of light erratically moving!  ((NUFORC Note:  Possible sighting of Venus??  PD))",
      "city": "omaha",
      "shape": "fireball",
      "date": "2017-01-19T00:00:00",
      "story": "1/17/2017 Omaha, NE, ball of light erratically moving! It was a little after 7:30pm, I was warming up my car & noticed something in the sky that I first thought was maybe a super bright star-so I took a few pics & started recording.  Then when the \"star\" started moving erratically, I knew it wasn't a star!!",
      "link": "http://www.nuforc.org/webreports/132/S132218.html",
      "state": "NE",
      "duration": "3 minutes ?"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e4b",
      "summary": "Red/green light craft seen flying irregulary over Omaha.  Rapid acceleration and deacceleration.",
      "city": "omaha",
      "shape": "unknown",
      "date": "2017-07-07T00:00:00",
      "story": "Red/Green light craft seen flying irregulary over Omaha.  Rapid acceleration and deacceleration. Rapidly moving object seen over Omaha.  Changed between green and red lights when moving.  Object could stop and remain stationary in the sky.  Object was able to accelerate very rapidly and could ascend/descend very quickly.  Estimated top speed: ~700mph",
      "link": "http://www.nuforc.org/webreports/134/S134716.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e5b",
      "summary": "Red light moving rapidly across the sky in all directions at immense speed.",
      "city": "omaha",
      "shape": "light",
      "date": "2017-07-07T00:00:00",
      "story": "Red light moving rapidly across the sky in all directions at immense speed. Sighted at plane height over Omaha, Nebraska.  We watched from a hill and initially spotted it as a small, stationary, red ball of light.  It would occasionally switch to a blinking green light and then back to red.  After looking at it for some time, it rapidly moved to the left, stopped, and it changed to a blinking green light. It then ascended in the blink of an eye (literally).  As soon as you blinked, the light was an immense distance higher than it had been a second previously.   We could see it ascending through the clouds so quickly that it could've climbed out of our sight in probably two seconds.  It then turned back to a static red light (stopped flashing) and darted to the right across the entire sky.  It was moving so quickly that we had to sprint to keep up with it.  It covered the whole horizon.   It then paused on a dime, shifted slightly to the left, and began a fast descent until it disappeared from sight into storm clouds.  Only one light was observed.  It was so high in the sky, and so erratically moving, that we could not place it as any normal object.  We have never seen a normal object move so quickly and at such a high height.   It was also quite far away, so for it to look as though it was moving so quickly, it must have been going at an unfathomably rapid speed.",
      "link": "http://www.nuforc.org/webreports/134/S134715.html",
      "state": "NE",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c73c6",
      "summary": "((HOAX??)) About 1:30am I joking told some friends we were gona go to a meditation spot I knew of to try to make contact with aliens..",
      "city": "omaha",
      "shape": "unknown",
      "date": "2017-06-09T00:00:00",
      "story": "About 1:30am, I joking told some friends we were gona go to a meditation spot I knew of to try to make contact with aliens.. when we were loading into the car we are a bright green and white flash.  (Within a few milk seconds) my first thought was, ooh a shooting star, but it's green, of course mid thought before I could speak it changed direction loops around in a circle and crashes straight down.  It's 15 miles north of Omaha city limits past HW 75.  We got to see it and snap pictures for all of about 6 minutes after we found where it crashed before military personal from Offuett FAB showed up and told us that it was a federal investigation and we had to leave.  (We were going to try to get a piece of it bit knowing what it was but it was metallic much metal with green and white glow, and it crashed into a 60 year radius hollle in the ground and it was way to hit to approach.  There is no spot for pics on this site, the shape of it looked melted but partially like a pyramid facing up and another pyramid facing down into the same shape and and oval piece of molten iron or uranium or something. ((NUFORC Note:  We spoke with the source of the report and he sounded to us to be sincere.  However, we have attempted to contact him again, and he does not return telephone messages.  We suspect that the report is a hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134432.html",
      "state": "NE",
      "duration": "30 minutes+"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b64",
      "summary": "Line of lights that are flashing and blinking orange, yellow, green, blue.  ((NUFORC Note:  Possible sighting of Sirius??  PD))",
      "city": "omaha",
      "shape": "unknown",
      "date": "2017-11-09T00:00:00",
      "story": "It's a line of lights that are flashing and blinking all around it I can't tell what shape it is but they are orange yellow green blue white red and it has been there for almost 3 hours in the sky southeast stationary from the city of Omaha. ((NUFORC Note:  We suspect a sighting of the star, Sirius.  We have corrected the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137171.html",
      "state": "NE",
      "duration": "1100"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b4d",
      "summary": "Triangular lighted high speed flying object",
      "city": "omaha",
      "shape": "triangle",
      "date": "2017-11-03T00:00:00",
      "story": "Traingular lighted high speed flying object Object had triangular lights.  Flying fairly low, slightly above tree line.  As I approach it seemed to coming towards my vehicle.  I came to an intersection and paused as the object passed the intersection and paused.  When I turned the corner the object quickly started coming in my direction and seemed to pass above my vehicle before I reached my destination.  The strange part is the object did not appear to turn around it just flew one direction and then started flying in the opposite direction.",
      "link": "http://www.nuforc.org/webreports/137/S137030.html",
      "state": "NE",
      "duration": "5:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c83bd",
      "summary": "MADAR Node 132",
      "city": "omaha",
      "shape": "",
      "date": "2018-10-18T00:00:00",
      "story": "MADAR Node 132",
      "link": "http://www.nuforc.org/webreports/143/S143514.html",
      "state": "NE",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c83c3",
      "summary": "MADAR Node 132",
      "city": "omaha",
      "shape": "",
      "date": "2018-10-18T00:00:00",
      "story": "MADAR Node 132",
      "link": "http://www.nuforc.org/webreports/143/S143513.html",
      "state": "NE",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8554",
      "summary": "SOUTH OMAHA LOOKS LIKE ABOVE offit air force base spinning sphere orange looks like drone. ((NUFORC Mote:  Mars?  PD))",
      "city": "omaha",
      "shape": "sphere",
      "date": "2018-08-10T00:00:00",
      "story": "SOUTH OMAHA LOOKS LIKE ABOVE offit air force base spinning sphere orange looks like drone of sum sort that is for scanning I-80/I-29 Bellview area.  THERE EVERY NIGHT TILL MORNING. ((NUFORC Mote:  Mars?  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142350.html",
      "state": "NE",
      "duration": "6 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c87d0",
      "summary": "Greenish light going through the sky, then a burst of light out the back and took off faster then disappeared.",
      "city": "omaha",
      "shape": "teardrop",
      "date": "2018-07-13T00:00:00",
      "story": "Greenish light going through the sky, then a burst of light out the back and took off faster then disappeared.",
      "link": "http://www.nuforc.org/webreports/142/S142172.html",
      "state": "NE",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c87ce",
      "summary": "Saw a UFO.  ((anonymous report))",
      "city": "omaha",
      "shape": "chevron",
      "date": "2018-07-13T00:00:00",
      "story": "Saw a UFO I was driving and I saw a circle looking thing lit with a green light.  It was moving parallel to the ground and at a speed way to fast to be a helicopter of plane. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142175.html",
      "state": "NE",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8af5",
      "summary": "I caught direct visual and watched a boomerang shaped craft fly from a NNW to S path.",
      "city": "omaha",
      "shape": "chevron",
      "date": "2019-09-06T00:00:00",
      "story": "Stepped outside before heading to bed.  I was looking up to see if the big dipper was in view that late.  The sky was clear and cloudless. Out of the northern horizon I caught movement.  I caught direct visual and watched a boomerang shaped craft fly from a N-NW to south path.  What I found to be unsettling: dark smoke color, no navigational lights, no sound at all - mid-low altitude, no more than 10,000 feet in altitude.  Speed was alarming as it took 5-7 seconds to cover the direct route.  The shape was nothing I have seen.  It was not a flying wing.  Chevron is close, boomerang is in my opinion the best way to describe.  Thin but congruent, rounded wingtips, no fuselage.",
      "link": "http://www.nuforc.org/webreports/148/S148641.html",
      "state": "NE",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d53",
      "summary": "Large bright object that was low on the horizon was pulsating in a stat. position steadily changing color.((NUFORC Note:  Sirius?  PD))",
      "city": "omaha",
      "shape": "light",
      "date": "2019-01-17T00:00:00",
      "story": "A large bright object that was low on the horizon was pulsating in a stationary position steadily changing color. On January 3rd, 2019, at approximately 22:30 to 23:00, I observed a large, stationary object low in the southeast sky.  My girlfriend, a person on YouTube and I all observed it.  At first glance the object could have been mistaken for Venus but it was too large.  As a process of elimination, I verified that there were no planets or major stars at that location with Google night sky and manual observations of celestial bodies.  I also eliminated the possibility of aircraft easily as there were several commercial aircraft flying at different altitudes and directions.  All the aircraft were very small in comparison. The object appeared to be round but pulsed brightly in a fashion that made it look like it was flaring the light in a sort of diamond shape.  The object cycled through multiple colors at a steady rate and exhibited a range of color beyond what is seen on commercial and private aircraft. There was no sound but I can't say for sure it was silent as it seemed to be several miles away across the city.  I assumed that this object had to have been seen by more people than myself due to its size, color shifting and duration that it was visible.  I scanned the local news the following day and none of them mentored it.  I did find a video on YouTube of someone else that did see it, and they shot a video of it with their phone.  I didn't stay out to see the object disappear but the person shooting the video did.  They filmed it until it just vanished from sight.  It didn't fly away.  It faded from view while never moving during the entire episode. I will attempt to upload the video or link it for you to review.  I didn't try recording it myself because my phone camera doesn't zoom out to distances that far well and the video from the other person I found does not properly show exactly how large and brilliant the object actually was. YouTube link, https://m.youtube.com/watch?v=Wt8HH8DKlv0&t=44s",
      "link": "http://www.nuforc.org/webreports/144/S144456.html",
      "state": "NE",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f55",
      "summary": "Large, oval/rectangle shaped craft hovering for a few moments, before disappearing. ((anonymous report))",
      "city": "omaha",
      "shape": "oval",
      "date": "2018-11-24T00:00:00",
      "story": "Large, oval/rectangle shaped craft hovering for a few moments before disappearing. It was sometime around 11 at night, maybe early 12, and me and a group of four friends were heading through Omaha, Nebraska.  We were in the suburbs, close to downtown but not in it, but I could see over the houses into the big city area.   There was an oval/rectangle shaped craft in the sky, with two lights on the sides of it, but that was it for lights.  I thought at first it was an airplane, but after a few moments of staring at it I realized it couldn't have been.  It was hovering around the tops of the buildings, and was staying pretty still.  I watched it for a few moments, before we passed by a treeline, and I lost sight of it.  When we re-emerged, the craft was gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143700.html",
      "state": "NE",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9502",
      "summary": "My wife and I saw a red dot appear in the eastern sky as we traveled east on Harrison Street",
      "city": "omaha",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "My wife and I saw a red dot appear in the eastern sky as we traveled east on Harrison Street east of the intersection of 180th street.  The dot was illuminated for about 3 seconds and disappeared.  The Eastern sky appeared completely clear.  The object appeared to move very slightly from North to south and veered easterly before disappearing.  The object appeared at about 120 degree angle juxtaposed the rising full moon in the eastern sky.",
      "link": "http://www.nuforc.org/webreports/150/S150695.html",
      "state": "NE",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c96c9",
      "summary": "Unusual fast moving object overtaking ISS",
      "city": "omaha",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Unusual fast moving object overtaking ISS This evening, Dec 10th, 2019, I was observing the track of the ISS over Omaha, Nebraska from 5:36 pm local time to 5:42 local time.  The ISS track was from the northwest to the southeast.  As the ISS came to a point high in the sky, I observed another object overtake the ISS, and nearly on the same path as the ISS.  The object was moving across the sky much faster (perhaps 5 times faster, or even more) than the ISS.  It passed the ISS within a degree or two about when the ISS was overhead, and continued on to the southeast.  The object did not maintain a constant brightness, rather it became visible for perhaps 3 or 4 seconds and then faded out for several seconds, but on a repeating and consistent basis, as if it were tumbling.  It appeared to be a point source and did not have lights (strobes, rotating beacon, navigation lights, etc.)  that would be representative of an aircraft.",
      "link": "http://www.nuforc.org/webreports/151/S151481.html",
      "state": "NE",
      "duration": "2 minutes"
    }
  ]
}