{
  "city": "pembroke",
  "fetch_timestamp": "2025-07-12T14:37:12.443620",
  "record_count": 17,
  "pages_fetched": 0,
  "api_calls": 1,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b45f8",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-08-23T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/148/S148157.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4650",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-08-23T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/148/S148156.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b466e",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-08-23T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/148/S148155.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b46c9",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-08-23T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/148/S148154.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4865",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-07-25T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/147/S147652.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b488a",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-07-25T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/147/S147646.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4894",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-06-07T00:00:00",
      "story": "MADAR Node 110 ((ADDENDUM FROM SOURCE)) 05/23/19 09:13 pembroke nh s/b 09:01 instead of 09:13 ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/146/S146653.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b49a4",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-07-12T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/147/S147498.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4b6a",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-07-05T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/147/S147259.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4ffd",
      "summary": "I noticed a very very bright round object pass us to the left traveling from the East heading West.",
      "city": "pembroke",
      "shape": "circle",
      "date": "2019-03-29T00:00:00",
      "story": "Sun was just starting to come up, sky was clear and we (my daughter and I) could see the moon very bright to our left as we were driving.   I noticed a very very bright round object pass us to the left traveling from the East heading West.  I have never seen anything fly so fast, and it seemed to just drop beyond the horizon, almost as if it landed somewhere idk.  We thought maybe it was a missile or something, but it didn't have a tail.  Strange, to say the least, and scary.   I'm 48 yrs old and have never ever seen anything like it in my life.",
      "link": "http://www.nuforc.org/webreports/145/S145376.html",
      "state": "MA",
      "duration": "<1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0d8",
      "summary": "An oval hover craft was above one of the buildings in Pembroke. It has lights going around in a circle. It went in a circle one more ti",
      "city": "pembroke",
      "shape": "oval",
      "date": "2011-05-02T00:00:00",
      "story": "An oval hover craft was above one of the buildings in Pembroke.  It has lights going around in a circle.  It went in a circle one more time and it stopped, it sat there and hovered for about 3 seconds, and it zoomed away, it just dissapeared.",
      "link": "http://www.nuforc.org/webreports/080/S80989.html",
      "state": "VA",
      "duration": "23 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be6c0",
      "summary": "Witnessed 2 red lights in formation proceeding slowly NW to SE.  After covering about one third of the sky they suddenly went out toget",
      "city": "pembroke",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Witnessed 2 red lights in formation proceeding slowly NW to SE.   After covering about one third of the sky they suddenly went out together.  Never reappeared.",
      "link": "http://www.nuforc.org/webreports/087/S87265.html",
      "state": "NH",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f14",
      "summary": "Aircraft with 10-15 yellow orange lights on it all evenly spaced apart went across the sky.",
      "city": "pembroke",
      "shape": "circle",
      "date": "2014-02-21T00:00:00",
      "story": "Aircraft with 10-15 yellow orange lights on it all evenly spaced apart went across the sky. On the tree line in the backyard there was a glowing yellow orange dot about the size of planet venus, when it appeared in the sky.   At first I thought it was planet Venus, but the object seemed to be slowly getting bigger.  I stepped away for a minute and then looked back about 5-10 seconds later and the object was a bit higher in the sky.   It was 10-15 lights all the same size in a circular shape.  The lights were circular, yellow orange in color, and all spaced about equally throughout the circular shape.  The object was a bit bigger than the average plane I see in the sky and closer to the size of a blimp.   During this sighting my headphones were on a very low volume and I did not hear any sound coming from the aircraft which I can usually hear if I see a helicopter or plane.   Other awake members in the household, although they did not see the object in the sky, did not say to hear anything at this time.   The object moved across the sky at about the speed of a plane and was going in a diagonal line.  I watched the aircraft until I was out of window space.",
      "link": "http://www.nuforc.org/webreports/107/S107226.html",
      "state": "MA",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c232b",
      "summary": "3 large slow quiet planes flying low over Pembroke to Boston",
      "city": "pembroke",
      "shape": "triangle",
      "date": "2014-04-11T00:00:00",
      "story": "3 large slow quiet planes flying low over Pembroke to Boston 3 honest & credible witnesses saw 3 low flying (approximately 1000ft.) Aircraft 15mins after midnite for about 50 mins.  They flew at approximately 100mph and defined logic how they stayed airborne.  Being so large and slow.   When we first observed as we were stargazing at Mars (since it was the one night Mars was closest & brightest its been) we noticed a large Coast Guard Search Plane sized plane fly from north to south.   15 mins later a bright spotlight appeared and came from the west to the east. Then banked in a large slow sweep and headed north.  Directly up the coast from Duxbury towards Boston. I had a clear view over the pond at end of my street.   We clearly heard passenger plane type engines as they passed by.  They were 10 times quiter than any jet or plane ive.   And i live within 20 miles of 4 airports. I've heard many planes jets & helicopters in my 34 years at the same address.   All 3 witnessses have 20/20 vision and excellent hearing.  We beleive they are manmade aircraft.   However, 2 appeared to be large rectangle shape planes, with short, broad wings.  The last to go over our heads directly was spearhead shaped and flat on bottom like a Stealth Bomber.  Simular sized to a Stealth bomber.  Very strange. Lots of bright strobing red, yellow and bright white lights on all 3. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108487.html",
      "state": "MA",
      "duration": "50 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c45fd",
      "summary": "String of 5 to 6 equidistant red to orange lights moving north east across I-16 above Pembroke, Georgia, near Ash Branch Road exit.",
      "city": "pembroke",
      "shape": "formation",
      "date": "2015-10-29T00:00:00",
      "story": "String of 5 to 6 equidistant red to orange lights moving north east across I-16 above Pembroke, Georgia, near Ash Branch Road exit. I was traveling westbound on I-16, just west of I-95, on a very clear and star-filled evening around 7:55 pm.  Rather low to the horizon, I spotted a moving row of blinking lights similar to small airplane lights.  I was curious as to how the 5 to 6 planes were traveling so precisely one right after the other and as I got closer I realized they weren't airplanes but flashing lights of some kind.  I exited I-16 at Ash Branch Road to try and get better view.  It was as if they were on a string equidistant from one another.  The row of lights was traveling north west to south east over I-16.  Fort Stewart and Hunter Army Airfield are in the general vincinity. This had little soto the north to north east direction.",
      "link": "http://www.nuforc.org/webreports/123/S123014.html",
      "state": "GA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a59",
      "summary": "MADAR Node 110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-09-12T00:00:00",
      "story": "MADAR Node 110",
      "link": "http://www.nuforc.org/webreports/148/S148770.html",
      "state": "NH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c9529",
      "summary": "MADAR Node  110",
      "city": "pembroke",
      "shape": "",
      "date": "2019-12-01T00:00:00",
      "story": "MADAR Node  110",
      "link": "http://www.nuforc.org/webreports/151/S151061.html",
      "state": "NH",
      "duration": ""
    }
  ]
}