{
  "city": "peoria",
  "fetch_timestamp": "2025-07-12T14:37:18.558158",
  "record_count": 80,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b413a",
      "summary": "In Peoria Arizona, I saw a cigar shaped craft floating above the neighborhood 500 feet up silent, emitted brilliant colors,",
      "city": "peoria",
      "shape": "cigar",
      "date": "2019-04-18T00:00:00",
      "story": "In Peoria, Arizona, I saw a cigar shaped craft floating above the neighborhood 500 feet up silent, emitted brilliant colors, Peoria Arizona - 2009 - On my way home from work - normal evening - as I turned onto my home street i saw a huge huge craft floating above the neighborhood in front of me.  It was cigar shaped, but had a huge bulge in the middle (I used to call it a pregnant joint - if you are familiar with how that would look - skinny on the ends but bulging in the middle.  It made no noise at all and had circular shapes on the front which emitted different colored lights - like it pulsated the lights - orange to red to green to blue.  They were the most brilliant colors I’ve ever seen it’s hard to describe how perfect the colors were.  It was huge like an aircraft carrier in the sky.  It was floating and did not move at all.  I parked in my driveway and ran inside to tell my Roomate.  By the time I was outside, it was gone but there as a trail of haze.  I will never forget it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)",
      "link": "http://www.nuforc.org/webreports/145/S145723.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b421c",
      "summary": "I thought it was a red light on a helicopter.  It was moving really fast through the sky.  ((anonymous report))",
      "city": "peoria",
      "shape": "light",
      "date": "2019-03-21T00:00:00",
      "story": "When I first looked up I thought it was a red light on a helicopter.  It was moving really fast through the sky and i thought maybe its a satilite.  Then i thought maybe its a UFO and it stoped moving right there in the night sky.  I watched as it zoomed past orions belt (from my perspective on the sky) and stopped again on the (left side of the sky facing west.  It zoomed back to the right (south) and stoped for another 5 seconds.  I watched it zoom around stopping and going for about 2 minutes.  Then it went up and zoomed down in a confusing spiral toward the earth nearby.   In a panick, I yelled for my Fiance, I had to run about 50 ft inside to shake him awake.  When we got outside, it was still there in the sky above the neigborhood zooming around.  It looked like it was over the neighbors house at one point hovering.  I watched as it split into two red lights whith a single green dot between and then morphed back into the single red light then zoomed into a far neighborhood (Northwest) as it seemed to fall to the earth.   I tried to finish watering my garden after my husband went inaide i saw it zoom west from the Northeast of my house as if above a nearby neighborhood. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145221.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b437d",
      "summary": "It seemed like it was about to crash....then it suddenly dissapeared.",
      "city": "peoria",
      "shape": "fireball",
      "date": "2006-05-15T00:00:00",
      "story": "It seemed like it was about to crash....then it suddenly dissapeared. I was waiting at the bus stop and I seen a glowing ball of light in the distance it was falling straight down towards the earth. At first i thought it a air plane of fire and about to crash, but before it hit the ground, it suddenly dissapeared! about three seconds later it reappeared in the upper right side of the sky from where it dissapeared. Once it reapeared, it started to glide around the sky at great speeds, yet it did it so gracefully. It continued to disappear and reappear at random locations. It continued to do this for about 10 to 15 minutes the it dissapeared one last time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49701.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e8f",
      "summary": "Surprised by diffuse appearing object.",
      "city": "peoria",
      "shape": "cigar",
      "date": "2019-05-09T00:00:00",
      "story": "Surprised by diffuse appearing object On Sunday, May 5th, I was on my boat at Lake Pleasant, Arizona.  I had spent the night on the boat and was almost ready to go back to the dock.  I was about ¼ mile north of the 4 lane launch ramp at the north end of the lake.  At 8:30 am I was drifting with a slight breeze from the north, pushing me toward the dock to the south.  I had a line in the water, fishing, with a large brimmed hat and polarized sunglasses.  The weather was sunny and clear, typical Arizona. I glanced up, looking south, and noticed what I at first thought might be some spiderwebs caught between my fishing rods, which were mounted on either side of the console.  Whatever it was, it was diffuse, and somewhat hard to distinguish, much like the sun looks glinting off spiderwebs.  Its relative size was about that of a full moon, about the size of an aspirin tablet at arm's length.  It was completely stationary.  After a few seconds I thought what I was seeing might be some reflection hitting my sunglasses.  I moved my head up and down, trying to determine where a reflection might be coming from.  At that moment the object moved on a level horizontal path toward the west, out of my visual range, in a fraction of a second.  The acceleration was so great that by the time the object had moved to the right edge of my vision, I could no longer track it.  At that moment I realized what I had witnessed.  There were some people in kayaks, a couple of guys fishing and some other boats to the north and east of my position. The environment was quiet, and I heard absolutely nothing that could be associated with the object – it was completely silent. I would estimate that it was about 40 degrees in elevation and on a bearing of 180 to 200 degrees. Object size and distance were impossible to determine. The object appeared somewhat like two slightly elongated top hamburger buns, with the bottom bun inverted. There was a slight darker band separating the top and bottom sections. Width to height was about 3 to 1. The overall impression was that of a light weight, white fabric, almost with some translucent quality to it. I did not detect anything unusual looking through my polarized sunglasses.  I am an experienced UFO researcher, yet it was not until the object shot out of sight that I realized what I had seen.",
      "link": "http://www.nuforc.org/webreports/146/S146033.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5fc7",
      "summary": "Dark object moving papidly to the east",
      "city": "peoria",
      "shape": "chevron",
      "date": "2007-11-28T00:00:00",
      "story": "Dark object moving rapidly to the east I was at work taking a break at about 2:30 AM CST, im kind of a astronomy junkie so I was looking at the stars, when I saw some movement out of the corner of my eye. I could barley make it out at first, but as it got more over head I could see that it was a boomerang shaped object, moving very fast, made no noise and there were no visable lights. I watched this object as it headed towards the east until I lost sight of it, the whole thing lasted about 10-15 seconds. afterwords I tried to figure out what I had just seen and couldnt come up with anything other than a UFO.",
      "link": "http://www.nuforc.org/webreports/059/S59345.html",
      "state": "IL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b64e0",
      "summary": "5 white dots racing upwards from downtown Phoenix area, moving at different speeds, then fading in to the night",
      "city": "peoria",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "5 white dots racing upwards from downtown Phoenix area, moving at different speeds, then fading in to the night I was in Peoria at a night club with friends on the patio and someone pointed to the sky where we saw several faint white dots maybe just south of downtown phoenix, but very high in the sky.  It was roughly 9:30pm.   There were 5 lights that I could make out.  Very faint.  They were traveling upwards it seemed, and they were traveling at different speeds, as if they were a family walking with a few child stragglers trying to catch up.  I had no explanation, and soon they just faded still travelling upward.   I was dumbfounded people could just discard it and go back to dancing--this was my first time seeing anything in the night sky that couldn’t be explained.  And trust me, I’d prefer an explanation that could set my mind at ease.   But I’m certain the human race still has much it does not know and cannot understand--even with the modern science and technology.",
      "link": "http://www.nuforc.org/webreports/060/S60465.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b69f4",
      "summary": "An item moving at an incredible speed in a straight line with no sound.",
      "city": "peoria",
      "shape": "other",
      "date": "2008-06-12T00:00:00",
      "story": "An item moving at an incredible speed in a straight line with no sound. The evening of May 31 was perfect. Off to the north of Peoria a large storm was passing by, far enough away to provide us a grand show  of lighting as we sat in front of the Northmoor Observatory on Leo Donovan Golf Course in North Peoria. Two of us were there in the daylight waiting for it to get dark. It was our turn to show the public around the evening sky as members of the Peoria Astronomical Society. We were watching the storm when a dark moving shape appeared in the periferal vision of my left eye. The black circle was approaching from the west. At first I thought it was a goose flying toward the pond behind the observatory. We had seen a couple take off from there a little earlier. But, as it got closer I could not see any wings. My observing partner was engrossed in watching the storm and had not noticed this object coming right at us. I called his attention to it. “Is that a balloon?” he said. My thought exactly. But, we both quickly realized this object was moving very fast, and in a straight line. “Could a balloon move in a straight line that fast?” I said. We both quickly concluded that did not seem plausible to us. We each looked at our cell phones. It was 8:40 p.m. When the object passed over us we saw a different shape. It had looked round while coming toward us. As it passed overhead we saw it looked like a capital B laying on its side. And, as it passed overhead it tilted slightly to the south showing a streak of gray, but the color was flat, not reflective. There was not any sound We looked at each other and watched the item disappear into the horizon to the east never altering its speed as far as we could tell or its direction. I am a newspaper editor and amateur astronomer. My observing partner is also an amateur astronomer.",
      "link": "http://www.nuforc.org/webreports/063/S63695.html",
      "state": "IL",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b56",
      "summary": "Flash of light thought to be a UFO",
      "city": "peoria",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Flash of light thought to be a UFO 9pm - backyard of my house...my cousin and I were going outside to smoke a cigarette...I looked up to the sky it was a clear night with good visibility i could see the stars and planes very clearly...i saw the stars twinkle with there faint blue color.  Then my cousin said to me hey look at the jet (take it I live by Luke air force base) I looked at what he was pointing to and I said what that plane (I was looking at what seemed to be a bright star moving south to north east)...he’s said no that one(talking about the jet)..then I said what about that one (talking about the light I was seeing) he then saw the light too...he said that isn’t no plane it doesn’t have any flashing lights...I told him it was probably a plane then it just kept moving north east then it was exactly east of us and then disappeared ...we kept looking at the place where it disappeared then out of nowhere it got very bright brighter than a star get probably about 3 times as bright....once we saw that it started moving south then it got bright again and disappeared.",
      "link": "http://www.nuforc.org/webreports/057/S57579.html",
      "state": "AZ",
      "duration": "5-10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6da6",
      "summary": "round ball, different colors, vanished, traveling in a few directions",
      "city": "peoria",
      "shape": "fireball",
      "date": "2007-04-27T00:00:00",
      "story": "round ball, different colors, vanished, traveling in a few directions Firey round ball and the first one shot down and straight back up and vanished. Second one shot up went in a circle clockwise and reversed in the same pattern shooting green, red and blue sparks out the back and then vanished. Size was very large and seen in the night sky off the 101 west of Olive Avenue.",
      "link": "http://www.nuforc.org/webreports/055/S55888.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b0e",
      "summary": "glowing light in sky",
      "city": "peoria",
      "shape": "light",
      "date": "2007-02-24T00:00:00",
      "story": "glowing light in sky It was an odd sight that looked to be out in space rather than here on Earth.  It was a Pin shaped light with distinct sharpness.  There were no clouds in the area it appeared.  The long skinny light was positioned perpendicular to the horizon and did not touch the ground.  It appeared as a comet almost but there was no distinct fading of the light at any one point.  It was bright throughout the object and didnt have a tail.  Many calls were phoned into local tv stations and even the local museum but the only answer that was given was space junk.  Space junk wouldnt be able to create that perfect shape/light and remain in the same spot for the time period it had.  it appeared in the southeastern sky.",
      "link": "http://www.nuforc.org/webreports/055/S55258.html",
      "state": "IL",
      "duration": "30 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b7c07",
      "summary": "V-shaped array of soft-white lights, between 7 to 11 of them, flying silently in a straight line with no discernible relative motion.",
      "city": "peoria",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "V-shaped array of soft-white lights, between 7 to 11 of them, flying silently in a straight line with no discernible relative motion. Saw a boomerang V-shapped formation of about 7 to 11 soft-white lights flying silently from west to east.  No visible craft per se, just the lights.  No strobe light, no red/green wingtip lights, no colors, no flashing.  No turn, bank, pitch up or down.   No way to judge size or altitude.  Traversed about 45 degrees of the sky while it was visible, at an elevation angle of about 75 degrees, from west of my location to east of my location.   Initial impression was that it was a flock of white birds (e.g., geese) slowly flying in formation perhaps 100 feet above my house's roof, but then I realized that there were no flapping wings, no relative motion between the white spots whatsoever, and no ground lights capable of illuminating anything like that -- had to be self-illunminated.   Disappeared rather suddenly, but not instantaneously, as it moved away from me.  I speculate that it might have been a B2 \"flying wing\" bomber if they had no typical civil aircraft running lights, an array of between 7 to 11 soft-white lights on the leading edge, and were capable of virtually silent motion.  I do live just a few miles NE of Luke AFB, AZ.   I was in a spa (hot tub) at the time, so its noise could have been masking quiet sounds from the object, but I routinely easily hear normal propeller, jet and helicopter sounds when they fly nearby while I'm in the spa.   Could have been a very large object or formation of objects very high up (although there was no discernible relative motion between the lights whatsoever), or something much smaller and much lower.   If it was something the size of a B2, it could only have been a few hundred feet in altitude.",
      "link": "http://www.nuforc.org/webreports/053/S53073.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba189",
      "summary": "Silver, solid, egg shaped object heading NW.",
      "city": "peoria",
      "shape": "egg",
      "date": "2010-06-03T00:00:00",
      "story": "Silver, solid, egg shaped object heading NW. Silver, egg-like object heading Northwest across the sky in broad daylight during heavy traffic. No visible windows, lights, wings, etc. Flying at the height  and speed you would typically see a helicopter flying but it was very clearly something other than a helicopter.  I was driving at the time so it was hard to get a good look at it. Disappeared behind some trees and neither I nor my two passengers were able to spot it again. I am used to observing all types of planes, helicopters and even jets (Luke Airforce Base) flying around here in the West Phoenix Valley, but this air craft was unrecognizable. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75665.html",
      "state": "AZ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba270",
      "summary": "Odd shaped aircraft seen over Peoria IL",
      "city": "peoria",
      "shape": "other",
      "date": "2009-01-10T00:00:00",
      "story": "Odd shaped aircraft seen over Peoria IL I saw this craft in the air over downtown Peoria, IL, moving from southwest to northeast in a straight line.  It must have been a half-mile in altitude and never changed direction. It was moving very slowly, as if simply being blown by the wind and it made me think it was a balloon for a long time, albeit a very large and strangely shaped balloon.  It was shaped like a parenthesis (with the arched part up and was dark gray. I would estimate its length at 30 feet and its height 5.  I was really amazed that I could see it for so long and I even saw it through binoculars but am still uncertain as to what it was if not a UFO. Like I said earlier, an odd-shaped balloon is the only thing that comes to mind, as it seemed to be floating with the wind. It never changed its position however, as a balloon might, as it stayed steady in the air except for occasionally rocking slightly to one side. It eventually drifted over the river and out of sight.",
      "link": "http://www.nuforc.org/webreports/067/S67873.html",
      "state": "IL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba619",
      "summary": "Flash and streak of green shoot across the night sky.",
      "city": "peoria",
      "shape": "fireball",
      "date": "2008-08-12T00:00:00",
      "story": "Flash and streak of green shoot across the night sky. Noticed a flash and a streak of green shoot across the sky while driving home.  Thought it might have been a firework, however there were no residual sparks falling towards the ground. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65042.html",
      "state": "AZ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baa11",
      "summary": "My wife and I were star gazing at approximately 10 to on September 1, 2010. At about 10:10pm with a crystal clear sky, I noticed a roun",
      "city": "peoria",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "My wife and I were star gazing at approximately 10 to on September 1, 2010.  At about 10:10pm with a crystal clear sky, I noticed a round kind of dark dot in the sky to the west.  I pointed this out to my wife and she saw it immediately.  The object came closer and closer and it appeared to be an irregular shape, the shape of a police badge.  No lights were on this object and it did not make any noise.   As it went overhead we could see that it was a subdued color illuminated by the reflection of the city lights. It looked to be a muddy, brown color.  From our point of view, it seemed to be very large, moving in the horizon. It quickly left our view, moving a west-to-east direction.  We saw the bottom of the object as it went over us.  It looked eerie; it was a muddy brown color with a little pink reflected from the city lights.  It went directly overhead and it was definitely an irregular shape, the shape of a police badge.  The whole spotting time was approximately 1½ to 2 minutes in duration.  It was going horizon to horizon and looked like the size of a full moon. The trajectory was close to perfect, going west to east.   The next morning I spent my time on the phone trying to see if anyone else had reported anything, so far I haven’t heard anything.",
      "link": "http://www.nuforc.org/webreports/078/S78006.html",
      "state": "AZ",
      "duration": "11/2-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bac01",
      "summary": "October 8, 2010 8:05 PM  We were at a back yard barbeque. We looked up to the west sky approximately at 45-50 degrees from the horizon",
      "city": "peoria",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "October 8, 2010, 8:05 PM  We were at a back yard barbeque.  We looked up to the west sky approximately at 45-50 degrees from the horizon and saw what we first thought was a meteor entering the atmosphere. There were actual orange and yellow flames coming from the object for about 5 seconds. Judging by the size of the flames the object must have been fairly large.  The flames went out and an oval object appeared.  It was translucent and an orange/yellow color.  The object did not move for about 30 seconds.  The oval object’s orange/yellow color or light went completely out and than a white light appeared as though it was a star in the night.  The object then moved in a straight line left for several seconds and then moved right in a straight line as well, also several seconds.  It then stopped for several seconds then went straight down vertically for about 15 seconds and then went west and disappeared into the horizon. The weather conditions that evening were clear skies with low humidity. The moon was not out. I have been in Phoenix since 1976 and have seen many falling stars and meteorites fall from the sky. None of them ever did what we saw that night.",
      "link": "http://www.nuforc.org/webreports/078/S78334.html",
      "state": "AZ",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bae22",
      "summary": "Two people see UFO hovering at a distance of 10 feet.",
      "city": "peoria",
      "shape": "disk",
      "date": "2010-08-24T00:00:00",
      "story": "Two people see UFO hovering at a distance of 10 feet. I heard Peter Davenport on the 07-29-10 episode of Coast to Coast AM and decided to submit my story. Headline: UFO at a stone's throw  This story takes place in 1992 in Illinois. My friend and I were parked facing north at night in the summer on a small concrete bridge over a small creek in rural Illinois.  We were not quite ready to go home and wanted to continue our conversation about \"girlfriends.\"  The weather was cloudy and misty.  We could see sheet lighting in the distance.  My car windows had droplets of water on them.  I sat in the driver's seat, my friend sat in the passenger's seat of my Ford Escort. The creek bridge had cement guardrails that were almost perfectly level with where the car windows started.  I suspect this was a purposeful choice by the architect. The road continued on north to a T-section about 1/4 down the road.  Beyond that intersection was a large hill that spanned for miles in each direction.  Approach to the creek bridge was as if going down a slight hill, and the incline continued on for awhile and then began sloping up again toward the T-section.  We were of a slightly higher altitude than the cornfields directly to the left and right front of us that bordered the creek.  The border of the creek was a slight hill that blocked view of the field beyond to our right (2 o'clock).  Over our right shoulders at about 4 o'clock (direction), was four-story tall mound/hill left over from an old gravel pit that had trees and brush all over it.  This mound followed the other creek border for about a half a mile to the east. So from our perspective, we could not see the field to our right front, nor see beyond over the hill over our right shoulders.  The creek was essentially bordered on both sides with land that stretched out as far as the eye could see.  It was here that we watched the lighting in the distance.   I could see the lightening from tens of miles away over the top of the distant hills, but there was additional light coming from closer up.  At first I just dismissed it as ball lighting, but I could see the light illuminating the mist just above the hill.  I could not see into the field where the light seemed to be coming from, just the effects of the light on the trees on the border of the creek.  I stopped my friend from talking and said, \"Friend, why is that lightening going on and off with a beat.  Nature is not that exact.\"  I began snapping my fingers to the rate of the light from the field going on and off.  On, snap, off, snap.  It was a perfect beat (I am a musician).  I tol! d my friend to roll down his window and just as the window rolled down, a craft popped out from behind the hill.  It was level with us, and we were approximately at most 10 ft from the craft.  I could have easily jumped on top of the craft from the side of the bridge without straining myself. I was speechless.  At the time I was morally opposed to the idea of alien spacecraft.  My family were strict Christians who specifically were taught at our denomination that humans on Earth were the only organic life in the universe.  I was 100% against the ideas of aliens existing.  Yet, here before me and my friend was this totally silent craft, about the size of a large SUV, hovering, silently. I broke the silence by startling loudly, \"THAT IS NOT A UFO!\"  At the time that I said that, the craft was just a little past us.  The craft was almost directly to our right, but a little farther past us at that point.  It abruptly changed course (as if it heard me) and either turned off its lights, put on a cloaking device or did something else because it seemed to just go right into the opposite hill, but more likely it just went \"dark.\"  I revved up my engine and drove away very fast.  My perspective on everything had just come crashing down in one fell swoop of time no more than 3 minutes long. I got to my house, where my friend's car was, and he asked me to follow him back home (because he was too freaked out to go over that bridge alone).  So I followed him home.  By the time I got back to the bridge, my fear had gone down, and I was filled with wonder.  The storm had passed, so I parked on the bridge again alone, turned on a Cure CD and sat Indian style on the roof of my car, searching the landscape and the sky for anything out of the ordinary. Nothing.  Silence. Oddly, it was from that moment on that I started to experience the phenomenon known as \"synchronicity.\"  As I drove back to my house that night, I though, \"what if when I get home my family has been abducted!\"  I got home and went to my parent's bedroom and listened for breathing.  Nothing, so I turned on the light and the bed was empty and made, at like 2 a.m.!  I ran to my sister's rooms and they were all empty too.  I was freaked out so I just collapsed in bed, thinking in the morning this will all be resolved. I awoke to a call from my mother that the family left town unexpectedly that evening to visit relatives. Description of the craft:  Closure took over in my perception of the craft, so my brain processed the craft as looking like the time machine in Back to the Future (big fan at the time).  It was the only way my brain could process a floating silent vehicle, that and it also did look a lot like that craft.  It had a metallic brushed reflective surface, with an area like a car where the \"people\" were transported, and then a front and back section much like our engine and trunk section.  It as the classic saucer shape, but without the dramatic flaring sides.   It had lights in various places on the exterior but it all happened so fast and I was so stunned that I couldn't tell you the exact placement, but my friend who had no such \"stunned\" effect because he was already a believer, said he saw lights in the back, front, top and bottom of the craft. For now, any contact, I would prefer it to be done via email. ((NUFORC Note:  Date of incident in 1992 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76907.html",
      "state": "IL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb26f",
      "summary": "extremely intense white light unmoving 30 minutes",
      "city": "peoria",
      "shape": "light",
      "date": "2011-01-05T00:00:00",
      "story": "extremely intense white light unmoving 30 minutes Stationary object of intense light, with a corona of light beams around it, it wavered In intensity on a very slow cycle,  it was observed on a 25 minute car ride across  Three public freeways, at 5 am on Tuesday 14 december 2010.  Satellites and a few bright stars were visible and were noticeably dimmer than the object.  The object was low On the horizon, lower than the satellites, but was stationary.  From the west it was above The eastern/southeastern sky toward chandler/ahwatukee. Trip originated at 101w and I10 and ended at 52nd st and Broadway and the object was observed for another 15 minutes but was not visible when the sky lightened at dawn. The corona was remarkable, not a solid circle of glow but 5 or 6 strong arms Of light coming off of it that were several times longer than the object itself. After 15minutes that dimmed for a minute or two and then was bright again.",
      "link": "http://www.nuforc.org/webreports/079/S79293.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bb419",
      "summary": "String of lights in Phoenix area",
      "city": "peoria",
      "shape": "unknown",
      "date": "2011-02-23T00:00:00",
      "story": "String of lights in Phoenix area One evening in early December, 2010, my husband and I were entertaining some guests on our back patio in north Peoria, Arizona.  As I was gazing at the sky, I noticed a string of about 3-4 bright amber lights in what looked like a line formation moving toward us from the west in a northeasterly direction.   I thought the lights looked strange, so I focused on them and noticed several more of these lights coming up behind the others from over a mountain to the west.  I then pointed them out to the others and we all became very excited and inquisitive wondering what they could be.   For the next 10-15 minutes or so, it seemed like an endless stream of lights coming one behind the other.  As they came closer to the east, we listened to hear if maybe they were Air Force jets, but we could hear absolutely nothing.  I’m estimating that there were upwards to 19 or so lights that we counted over a period of about 10-15 minutes.   Everyone agreed that these lights looked odd and didn’t appear to be aircraft we had ever seen before, especially since they were amber colored and had no white or red lights on them that we could see.   As we continued to watch, the lights seemed to change direction and began to head southwest until we could no longer see them.   I turned on the TV hoping to hear something about these strange lights, but I never did.   Were these aircraft from Luke Air Force base or were they something else entirely.  Have you received other reports about these lights or know what they were?   Thank you. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80123.html",
      "state": "AZ",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb453",
      "summary": "Quick moving ball of light in NW Phoenix Valley",
      "city": "peoria",
      "shape": "flash",
      "date": "2011-01-31T00:00:00",
      "story": "Quick moving ball of light in NW Phoenix Valley Though our front (south facing) window, we saw a ball of light fly though the sky.  It moved almost at the speed of a shooting star, but was EXTREMELY bright.  Additionally, it was no more than 5000 feet in the air.  There was no sound.  We ran outside immediately after seeing the object, and there was no sign of a vapor trail or the craft. Again, this was FAR too bright and large to be a shooting star.  The light was not a \"fireball\" light, like a meteor, but was more so a self-contained light.",
      "link": "http://www.nuforc.org/webreports/079/S79686.html",
      "state": "AZ",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb608",
      "summary": "((NUFORC Note:  No information provided by witness.  PD))",
      "city": "peoria",
      "shape": "formation",
      "date": "2011-01-31T00:00:00",
      "story": "((NUFORC Note:  No information provided by witness.  We suspect that the time above is flawed.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79823.html",
      "state": "AZ",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbab3",
      "summary": "((HOAX??))  13 orange fireballs",
      "city": "peoria",
      "shape": "fireball",
      "date": "2010-07-10T00:00:00",
      "story": "13 orange fireballs My friend a dentist saw last night 13 orange balls flying south east in the sky between peoria illinois and canton illinois at aprox. 9 pm July 8, 2009.   Three unknown witness of my friend also stopped and along the road to witness this. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD)) ((NUFORC Note:  Peculiarly, the source of the report indicates that the date of the sighting is approximate, even though the report was submitted just one day after the alleged event.  Possible hoax, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76359.html",
      "state": "IL",
      "duration": "5-10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7be",
      "summary": "Bright burnt orange object moving at the speed simular to Space Station but bigger",
      "city": "peoria",
      "shape": "",
      "date": "2011-10-10T00:00:00",
      "story": "Bright burnt orange object moving at the speed simular to Space Station but bigger Seen this on October 8, 2011 at 21.15 central time. I will describe this as best I can.  For lack of anything else we have seen like this I will use the Space station for comparison.  Seen at an altitude less then a commercial airplane. My wife and I are avid Sky gazers and regularly catch the Space Station when able to view. First let me say what it wasn’t.  This was not the Space Station, even though it went across the sky at the Speed of the Space Station. Nor was it at the altitude of the Space Station.  This was much closer, half the height of the highest commercial plane.  The Space Station, even at it’s lowest points on the horizon is a bright white and shiny, with straight definable edges and moving super fast across the sky.   My wife and I seen a Bright, deep burnt orange colored  ball with No tail, such as a shooting star, moving through the sky. Darker at the center, slightly lighter at the leading edge. We were sitting behind our house on the west side facing north.  The object came from the East South East direction across the north end of our house.  moving North at about 30 to 35 degrees at it highest point, in comparison to our regular sightings of the space station.  The object  was around 3 times the size of the Space Station at it’s closest point right after it came out from behind the house and diminished as  moved away toward the north.. Don’t’ think it was a space craft, it never changed direction or speed.  Don’t’ think it was a comet or shooting star, it had no tail, yet it looked hot, glowing as if still burning hot from entering from outer space. I don’t know what this was but after passing Peoria Illinois, someone, Some Where between Rockford, Il. and Chicago, Il. Had to of seen this also.   This was one of the most highly visible skyward events we have ever seen. And that is saying something for us, because within the last week or so we seen a shooting star moving east to west that brightened our  backyard before burning out. We were not looking up at the sky at the time, it was our yard getting brighter that made us look up to notice this object. I hope someone else out there enjoyed the bright burnt orange object in the sky tonight. We sure did!",
      "link": "http://www.nuforc.org/webreports/084/S84434.html",
      "state": "IL",
      "duration": "2.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5c2",
      "summary": "My wife and I were sitting on our back porch facing north in our home in Peoria, when we observed a fireball that looked like a comet o",
      "city": "peoria",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "My wife and I were sitting on our back porch facing north in our home in Peoria, when we observed a fireball that looked like a comet only very large and close.  This fireball went out and then then appeared to be just plane lights, with a red light and a white strobe, just like any other plane at light.  Something then dropped from this object, whatever it was had a white light.   At first we believed it was a plane burning up with a piece that fell off, but whatever it was appeared have a small white light on it, not like a burning object falling.  That object did not appear to fall as fast as something falling to earth.  It could have been something dropped with a parachute with a light attached.   We watched it with appeared to be plane lights which then appeared to fly in a circle for about a couple of minutes.   Then it straightened out and headed in the direction of Sky Harbor airport in Phx, descending as would a normal plane coming in for a landing. This whole time we believed it might be a plane with some serious mechanical problems, but whatever it dropped was out of the ordinary and we couldn’t find any mention of any unusual occurrences on any news reports.",
      "link": "http://www.nuforc.org/webreports/093/S93357.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd932",
      "summary": "FLASH/BRIGHT ORB LIGHT DIMS AND BRIGHTENS THEN FLASH AND REPEATS THE PROCESS THEN GONE",
      "city": "peoria",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "FLASH/BRIGHT ORB LIGHT DIMS AND BRIGHTENS THEN FLASH AND REPEATS THE PROCESS THEN GONE ok i'm going to sound crazy but i swear on my life and everything i know as truth, i just saw something in the sky over arizona, i saw a flash then i noticed it, a small orb looking glowing object,it got brighter and then dimmer and then flash it got big as a close star then it shrunk but kept its brightness then it it dimmed and hit a 90 degree angle and was gone.  ok i know how i may sound but there is no way it was a plane cause plains go by my house all the time and the altitude at wich this was flying ,no theres no f-n way it was a plane, i watch the stars almost every night and i never in all my life seen anything that distinct, wow i cant stop thinking about it. im not saying ufo but i saw something, ok i need a drink and i dont drink at all,crazy wow, sorry i just had to tell someone.",
      "link": "http://www.nuforc.org/webreports/087/S87932.html",
      "state": "AZ",
      "duration": "around a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bda08",
      "summary": "Dozens of pink and white orbs and a morphing triangle in the Arizona sky",
      "city": "peoria",
      "shape": "changing",
      "date": "2012-05-13T00:00:00",
      "story": "Dozens of pink and white orbs and a morphing triangle in the Arizona sky This afternoon about 12 pm (daytime) I noticed an airplane flying overhead moving to the west, and happened to look up. Beneath the aircraft and to the right of it, below it, I witnessed an egg shaped orb hovering about mid-sky.  I went inside to retrieve my binoculars (10x50 5.5 degrees H-15) and I could plainly see two orbs.  One was black and the other was pink or salmon pink in color. The distance was est. 5 miles down range approx.. acute 45 degrees and maintaining position in mid heaven as we faced West. The black orb suddenly dropped near the ground, rose up and then moved rapidly out of view.  The pink orb or egg shaped ball remained in place.  I gave the binoculars to my wife and she watched for about a minute before the pink orb moved rapidly to the lower left of the lens view, and then wisped very quickly to the right of view (northward) and disappeared out of view over the horizon.  Moments later we both saw no less than five objects that appeared to ! be round balls of light.  These balls of light began making erratic movements apparently with no intention.  Several other translucent objects appeared during this time and had the appearance of round luminous plasma, were pinkish in color, and each one had a notch at one end of them.  They looked like a pie with a piece missing.  At times the larger objects would turn facing us and were at least as large as a quarter or a fifty cent piece by binocular view.  Very plain to see. During this time, there appeared to be a meteor storm (streaks in the sky, a sort of white vapor) except for the fact that the streaks moved or skipped vertically in the sky and seemed to defy physics.  After several hours of watching these orbs of light or saucers, moving all over the sky in different directions and formations, and at varied speeds, at about 1:50 pm. what looked like a plasma orb, translucent and pink in color,floating at high altitude and changing shape, began moving toward our house very slowly at about mid sky. Upon reaching a point about a mile(?) downrange and hovering at about 80 degrees overhead, the object suddenly accelerated and flew directly over our neighborhood at what looked to be about 2,000 feet up. Within 5 minutes we heard the sound of F-14's from the local air base firing up. Moments later Four F-14's took off in the same northward direction as the craft had. The events may not be related, but it did add a lot of suspense to the situation.  Observed this at about 3 pm An object, triangular in shape, inverting itself. Looked like red lava in the middle encased by pink triangle, pulsating. Moved slowly to the east, just overhead , then vanished.  After five hours of watching these objects they eventually thinned out to just two or three random sightings, and then just stopped showing up altogether at about 5 pm. This total display lasted 5 hours, from 12 pm. until 5 pm. We heard no sounds associated to these objects and did not meet any aliens, nor do i personally know any aliens.  This accounting is absolute truth as best as I can describe or understand it.",
      "link": "http://www.nuforc.org/webreports/087/S87991.html",
      "state": "AZ",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd6c",
      "summary": "Round, bright red lighted objects of 10 or so, very quiet, flying south to north over Peoria, Illinois on 9/15/2012.",
      "city": "peoria",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "Round, bright red lighted objects of 10 or so, very quiet, flying south to north over Peoria, Illinois on 9/15/2012. There were several round red and orange lighted objects in the sky, flying from the south to the north.  They were silent, not in any formation but traveling a moderate speed.  The lights flashed and made them most noticeable in the night sky.   What were they?",
      "link": "http://www.nuforc.org/webreports/092/S92820.html",
      "state": "IL",
      "duration": "2:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd64",
      "summary": "Two sets of flickering orange lights in triangular form (6 lights total) seen over Rt 6 between Peoria and Chillicothe, IL, 9/15/12",
      "city": "peoria",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "Two sets of flickering orange lights in triangular form (6 lights total) seen over Rt 6 between Peoria and Chillicothe, IL, 9/15/12 At approximately 20:15-20:30 of Saturday, September 15, 2012, I and another were driving NORTH from PEORIA, IL toward CHILLICOTHE, IL on ROUTE 6.  As our vehicle got further from the city, the treeline allowed us to see what was previously obscured: two sets of what appeared to be TRIANGULAR LIGHTS. The two sets of lights were EAST from our location. We were very confused and fascinated at first, uncertain of what we were seeing. My companioned asked, &quot;Are those stars?&quot; But I had mistaken them as lights of communication towers. However, we quickly both understood neither was correct, as:  -We were unable to see any stars due to light pollution from being near the city. -There are no communication towers in that specific spot or at that specific elevation. -The set of lights nearest to us were found to be slowly moving.  There were two triangles, very large and very peculiar ih their shape and position in the sky. It was enough that we immediately knew we were not witnessing something normal. We have traversed Route 6 many times at night and never have seen these before. Both sets had three individual lights which flickered or twinkled like fire or a very bright star. The color of the lights was ORANGE-RED. We pulled over on the side of Route 6 and turned off our lights to get a better view after approximately two minutes of witnessing the phenomenon.  By this point, the lights furthest from us (Figure B in my illustration) were either too distant/sunken behind the tree line to see, or had very peculiarly suddenly disappeared. Either way, we were unable to see Figure B any longer. Figure A (the nearer set), was drifting very slowly toward our location. NO SOUND was issued from the lights. I strained to see any more details, but was unable to. I was unable to see any visible lines or structure of any kind between or connecting the lights. I was unable to determine the make or nature of the lights, other than that they resembled fire of some kind, orange and flickering.  Unfortunely, I am not equipped to determine how high the lights were, but am able to say they were below a thin and scattered/spotty cloud cover.  One by one, they began to slowly fade. First the light nearest us, and then the two behind at the further end of the triangle. The lights dimmed very slowly and then went completely dark. We were unable to see anything again after that, and after waiting for a moment, once more turned on the vehicle's lights and resumed our drive.  I distinctly recall seeing a program on television a year before about triangular sets of lights a few years back in Tinsley Park, which is a few hours from this location. From the amateur footage and photographs I saw on the television, these lights matched them very well. I wanted to obtain a photograph or video footage as proof of the objects, but the triangles' lights were not bright nor large enough for my phone to be able to capture among the surrounding darkness.  No visible moon was present at the time.  After pulling alongside the road, the remaining lights were visible for approximately 2-3 more minutes, making the total window of visibility at approximately 4-5 minutes.",
      "link": "http://www.nuforc.org/webreports/092/S92846.html",
      "state": "IL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdeab",
      "summary": "There were many small yellow light in the sky hovering north and aircraft headed north east objects move slowly across the sky all acro",
      "city": "peoria",
      "shape": "formation",
      "date": "2012-08-19T00:00:00",
      "story": "There were many small yellow light in the sky hovering north and aircraft headed north east objects move slowly across the sky all across the sky very high up as if it were a fleet of aircraft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91816.html",
      "state": "IL",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be0e1",
      "summary": "Orange orb over peoria il",
      "city": "peoria",
      "shape": "circle",
      "date": "2012-08-19T00:00:00",
      "story": "Orange orb over peoria il While we were watching the meteor shower last Sat night/Sun morning (8/11, 8/12), we saw some strange orange glowing orbs that lingered in the sky for nearly a minute.  I know there were a lot of people out watching the falling stars that night, so someone else had to have seen it.  Google searches turn up nothing.  Wondering where would be some good resources to find out more about this, or some other eyewitness accounts. We've already checked ufosnw.com and ufostalker.com. Appreciate any help you can give.",
      "link": "http://www.nuforc.org/webreports/091/S91834.html",
      "state": "IL",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be1d8",
      "summary": "Red Orange spheres seen in Peoria Il",
      "city": "peoria",
      "shape": "sphere",
      "date": "2012-11-19T00:00:00",
      "story": "Red Orange spheres seen in Peoria Il My husband and I were out to take our dog for her last potty break of the night at 11:00 pm when he pointed out a strange arrangement of lights north of us.  The lights were red and orange in color and brighter than any star in the sky.  The sky was clear and the stars were visible and the lights I saw were not stars or Chinese lanterns.  The lights were arranged forming a round x, five for each curved line, then more lights, four that I was able to spot.  I probably missed a few because I was trying to record it with a cell phone camera that did not capture a thing.  The four lights seemed to launch from below and join the moving x, then all the lights that were forming the curved x disappeared. After that, only three were left that just moved upward north and vanished into the sky.  This beautiful occurrence lasted only 5 min.",
      "link": "http://www.nuforc.org/webreports/094/S94590.html",
      "state": "IL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be1db",
      "summary": "Pattern of orange/red round objects seen over Peoria, IL at about 11:00 PM on 11/17/12",
      "city": "peoria",
      "shape": "diamond",
      "date": "2012-11-19T00:00:00",
      "story": "Pattern of orange/red round objects seen over Peoria, IL at about 11:00 PM on 11/17/12 On November 17, 2012, at approximately 2300 hrs, my wife and I exited our apartment in Peoria, IL to take our dog out for a short walk.  Shortly after I stepped outside, I observed several (approximately 5 or 6) orange or red round objects in the sky to the north of our apartment.  For purposes of orientation, I can say that the objects were visible north of the intersection of Allen Rd. and Willow Knolls Rd. over that area’s car dealerships (Lexus, Toyota, Nissan).  The objects were in some sort of pattern, possibly a diamond shape.  At first I thought the pattern looked like a fireworks display of some sort, but I heard no explosions.  In fact, I did not hear any noise at all coming from the area.  I pointed the objects out to my wife and she began trying to take photos and video with my cellular phone.  Unfortunately, upon review of the video, the objects were not visible.  We also saw a male exit a vehicle up the road (unknown how many passengers we! re in the car) from our apartment to look at the objects, but we did not speak to each other. As we continued to observe the objects in the sky, we noticed that some of the objects would suddenly fade away.  However, we also saw new orange/red round objects rising up from the ground in the same area north of our apartment.  While they were ascending, I noticed that the objects hovered in a manner that was somewhat similar to helicopters. But, I have never seen helicopters move quite like this and I can’t imagine why helicopters would be forming patterns in the sky at night.  The rising objects then joined the other objects before they also vanished.  By about 2305 hrs, all of the objects were gone.",
      "link": "http://www.nuforc.org/webreports/094/S94589.html",
      "state": "IL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be660",
      "summary": "Several bright lights seen just above tree tops before quickly changing direction and disappearing",
      "city": "peoria",
      "shape": "triangle",
      "date": "2012-06-20T00:00:00",
      "story": "Several bright lights seen just above tree tops before quickly changing direction and disappearing At approximately 9:20 pm on 6/17/2012, my daughter and I were driving home after getting off work.  As we got half way down our street we noticed a low flying object with 8-10 bright, white lights and 1 red light (on the end).  The object looked triangular.  There was no sound.  As we pulled into the driveway we stopped to watch it just above the tree line.  The object turned “on a dime” and at a high rate of speed took off in a different direction and disappeared.",
      "link": "http://www.nuforc.org/webreports/089/S89690.html",
      "state": "IL",
      "duration": "2-3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3be6fd",
      "summary": "3 lights in formation NW of Peoria, AZ.",
      "city": "peoria",
      "shape": "formation",
      "date": "2012-06-20T00:00:00",
      "story": "3 lights in formation NW of Peoria, AZ. Was walking my dog and looked to the West/Northwest and saw 3 orange/yellow lights in a horizontal formation.  They were several miles away, possibly over Wickenburg.  The light on the left of the formation would zip off to the left (south/southwest) and another would arrive on the right of the formation.   They did not stay illuminated for more than aminute at a time, then would gradually fade away.   I witnessed this happen twice, approximately 5-10 minutes apart.    It was approxomately 9:45 pm Pacific time, 95 degrees with no wind and no cloud cover.",
      "link": "http://www.nuforc.org/webreports/089/S89717.html",
      "state": "AZ",
      "duration": "1 minute - two times"
    },
    {
      "_id": "64d005f478aba2ec5a3be794",
      "summary": "Blue Light Seen Hovering Over West Wing Mountain, Peoria, Arizona",
      "city": "peoria",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Blue Light Seen Hovering Over West Wing Mountain, Peoria, Arizona We live in the West Wing development, near West Wing Parkway and Black Rock Boulevard. Our home is approximately one mile south of West Wing Mountain which is located in the West Wing Mountain Preserve.   About 5:15am this morning, Wednesday, February 22, I took our three dogs out into the backyard.   Looking north, towards West Wing Mountain, I noticed a blue light which appeared to be hovering several hundred feet above the highest peak.  One of my dogs seemed to notice the light as well, as he gazed towards the light.   After maybe twenty seconds, the light increased in its intensity for about five seconds before returning to its previous lower brightness.  I would say that the light increased its brightness by a factor of four or five.  It repeated that pattern of temporarily increasing its brightness three times.   Then, after another twenty seconds or so, it suddenly disappeared as if a switch had been thrown.  My dog then acted very agitated and wanted to go back! inside our home.  The light did not move at any time we were watching it and there was no sound of any kind coming from its direction.   A few seconds after the light disappeared, a commercial jet aircraft flew over our home headed from Phoenix towards the northwest.",
      "link": "http://www.nuforc.org/webreports/087/S87313.html",
      "state": "AZ",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0bd",
      "summary": "Bright color changing light that shifts positions quickly, disappears and reappears over Peoria.",
      "city": "peoria",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Bright color changing light that shifts positions quickly, disappears and reappears over Peoria. Bright white light that shifted left and right very quickly, turned red.  Dimmed out then reappeared several times in original spot over West Peoria sky.  Has been seen on other occasions by same witnesses .",
      "link": "http://www.nuforc.org/webreports/100/S100977.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0af",
      "summary": "Weird loud noise then flashing bright white lights over Peoria, AZ March 25th 1:45AM.",
      "city": "peoria",
      "shape": "unknown",
      "date": "2013-05-15T00:00:00",
      "story": "Weird loud noise then flashing bright white lights over Peoria, AZ March 25th 1:45AM It was 1:45am Monday morning March 25th (Peoria, AZ) - I couldn't sleep - I was listening to some music while lying in my bed trying to fall asleep. I heard a weird noise getting louder outside my window to the north. I cannot describe the sound (it was something I have never heard before - maybe like a machine) but it got louder over the music I was playing. I immediately got out of bed to turn the music off so I could figure out this sound I was hearing. I got up out of bed, the sound stopped, I was now facing my other bedroom window to the south (all blinds were closed).  As soon as the sound stopped, I saw brilliant white flashing lights outside my window.  It was like 50 strobe lights turned on for about 5-10 seconds. The only word I can describe this would be &quot;spectacular.&quot; Everything happened so fast and the brilliance of these white lights seems unearthly to me... I called two police stations in the morning to see if there were any reports of this unusual phenomenon, but there were none reported. I cannot imagine no one seeing this display of flashing lights, although it only lasted for 5-10 seconds. I am making this report to see if anyone else experienced this occurrence...",
      "link": "http://www.nuforc.org/webreports/096/S96781.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8be",
      "summary": "I saw too floating fire ball like objects floating in the sky.",
      "city": "peoria",
      "shape": "fireball",
      "date": "2013-10-14T00:00:00",
      "story": "I saw too floating fire ball like objects floating in the sky. I was driving home and I looked out my window and saw two fire ball like shaped aircrafts.  It didn't have any colors or lights that airplanes had, and they where floating in the sky and then dimmed out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103199.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf8fe",
      "summary": "Light Formation Seen Over West Wing Mountain, Peoria, Arizona.",
      "city": "peoria",
      "shape": "light",
      "date": "2013-06-02T00:00:00",
      "story": "Light Formation Seen Over West Wing Mountain, Peoria, Arizona. Last night, while taking the dogs out for the night, I noticed a bright white light over West Wing Mountain, which is here in Peoria, AZ.  The light suddenly burst into several smaller white lights which then began to move around each other.  When the light &quot;burst&quot; there were glowing streamers briefly projected out from the original light, which gave the initial appearance of a pyrotechnic.  However, after about a minute, they all suddenly disappeared. Another minute or so went by and then three white lights re-appeared in the same location as the previous lights.  These three were of a brighter intensity and continued to move around each other, but the movement was much slower than earlier.  After about two minutes, these three then suddenly disappeared as well, as if a switch were thrown. After a short delay, several more lights appeared, but this time there was about ten to twelve of them.  They were of different intensities and were of differing colors, red, blue, yellow and white.  These were also moving around, but at a quicker speed, like the first appearance.  The movement was deliberate, as if they were circling each other, but the entire formation itself remained stationary.  The lights disappeared about a minute later and did not reappear again. This is the second time that I have seen an unknown light over West Wing Mountain.  In February of 2012, I saw an unknown blue light early one morning, which I reported to the center later that day.",
      "link": "http://www.nuforc.org/webreports/097/S97952.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa1a",
      "summary": "12/31/12  20:32 Peoria AZ Orange Burning Orb.",
      "city": "peoria",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "12/31/12  20:32 Peoria AZ Orange Burning Orb Wife and I of 26 years had just got into the Hot Tub, as I sat back I noticed a BURNING ORB. Never made a sound of any kind during the sighting. My first thought was hey look someone set off some fireworks, kinda early in the evening for that.  I had innitial thought firework due to the altitude of the object not being very high from the ground.   But my wife had noticed that this wasn't a fireworks rocket because in was gaining altitude and speed as it crossed the sky directly over head from West to East.   I then noticed its speed was quiet fast as it traveled just to where it was going to be obscured by trees.   It stopped changed from a bright Orange flame color to white flame and shot straight up in the air and vanished",
      "link": "http://www.nuforc.org/webreports/095/S95694.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfba7",
      "summary": "LARGE CIRCULAR BRIGHT LIGHT AT DUSK IN ARIZONA",
      "city": "peoria",
      "shape": "circle",
      "date": "2013-09-09T00:00:00",
      "story": "LARGE CIRCULAR BRIGHT LIGHT AT DUSK IN ARIZONA UPON GOING INTO THE BACKYARD, I WITNESSED A LARGE CIRCULAR LIGHT IN THE NORTHEASTERN SKY.   I CALLED TO MY HUSBAND TO COME AND LOOK AS HE TOO WAS IN THE BACKYARD.  IT DIDN'T APPEAR TO BE MOVING.  IT WAS LARGE AND CIRCULAR.  IT WAS DUSK AND THE SUN STILL SHINING.  THERE WERE MANY CLOUDS IN THE SKY AND NO STARS VISIBLE.  THIS OBJECT WAS CLEAR AND VERY BRIGHT.   I GRABBED HIS PHONE TO GOOGLE IF ANY REPORTED INCIDENCES WERE PUBLISHED AS I WAS CONFUSED AS TO WHAT IT COULD HAVE BEEN.  AS I WAS SEARCHING THE INTERNET, MY HUSBAND BEGAN TO SAY, \"ITS GOING UP... IT'S GOING UP.\"  WITHIN A MINUTE IT WAS GONE.  THE ENTIRE SPOTTING WAS APPROXIMATELY 2 MINUTES BEFORE THE LIGHT WAS GONE.",
      "link": "http://www.nuforc.org/webreports/101/S101862.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc02",
      "summary": "Fireball in sky, slowed to a complete stop, then dimmed out in the night sky.",
      "city": "peoria",
      "shape": "fireball",
      "date": "2013-09-30T00:00:00",
      "story": "Fireball in sky, slowed to a complete stop, then dimmed out in the night sky. My girlfriend and I walked out on the south balcony, she said \"look, a plane on fire.\"  Object was not an aircraft, no light blinking (red/green/or anti-collision light.)  Object appeared to be on fire, bright orange glow, looked like heading north from the Estrella Mountain range then East, slowed to a stop, then dimmed out as if it was heading up, no sound heard, no other aircraft in area.  Took some pic's with my camera phone, will post.  Approx. time 10:20-10:23.  This is the second time I've seen this type of object in the Peoria, AZ area, first time was in January 2013, also reported.",
      "link": "http://www.nuforc.org/webreports/102/S102702.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd24",
      "summary": "Unexplainable loud noise.",
      "city": "peoria",
      "shape": "unknown",
      "date": "2013-07-03T00:00:00",
      "story": "unexplainable loud noise Loud pulsating \"woor-woor...woor-woor...woor-woor... woor-woor\" noise.  Extremely loud, low frequency sound.  Our dogs went crazy and we went to see what it was but saw nothing.  The noise stopped and then started up again for about 10 seconds and then stopped again.  It's hard to describe how loud  and intense this was.  Like it was coming from our backyard.  We are used to jets from the AFB but this was not a fighter jet sound.  No explanation… ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98865.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfdd7",
      "summary": "Several stationary orange lights in sky west of Peoria, in a descending arc which dissappeared in twos after a short period of time.",
      "city": "peoria",
      "shape": "formation",
      "date": "2013-10-14T00:00:00",
      "story": "Several stationary orange lights in sky west of Peoria, in a descending arc which dissappeared in twos after a short period of time. We were traveling north on Rt. 8 just north of Farmington Road at 9:15 p.m.  We saw what at first appeared to  be orange street lights above the ridge to the west and I thought it was strange that street lights had been installed along the top of the ridge.   As the view cleared of trees we realized they were much higher in the sky than we first thought.  We lost sight of them behind the trees as we drove so we u-turned and stopped in the clearing.  Three other cars had also stopped to look.   They were  5 to 6 bright orange round lights in sky, west of Peoria, stationary in a descending arc.  They were unusually bright.  They began going out, or disappearing, in twos.  The last two went out more slowly, it seemed as if they were traveling away at a high rate of speed, we could see them growing fainter as they got further away.   We u-turned again and continued north, there was a jeep and a few people standing outside the trailer park and we stopped to ask what they thought this was.  They then pointed out that there were three more orange lights north of where we saw the original lights.   These also disappeared quickly.",
      "link": "http://www.nuforc.org/webreports/103/S103193.html",
      "state": "IL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfef6",
      "summary": "3 white dot triangle.",
      "city": "peoria",
      "shape": "triangle",
      "date": "2013-06-02T00:00:00",
      "story": "3 white dot triangle 3 round white lights form of a triangular moving from northwest sky looked as If It was moving downward lasted1 hour ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98176.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c09aa",
      "summary": "Two back to back flying black/grey dimensional circles moving rapidly and holding steady focusing then flying away!",
      "city": "peoria",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "Two back to back flying black/grey dimensional circles moving rapidly and holding steady focusing then flying away! Seen the first object dimensional coming rapidly while sitting out in my back yard, it was rotating changing colors grey and black, then paused as it focus with a black circle steady movement for about 2-4 minutes then flew away the second one did the same, however stayed in focus black circle position longer about 5 minutes    I was able to capture the flying object on my phone!",
      "link": "http://www.nuforc.org/webreports/107/S107694.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c78",
      "summary": "Saw two different bright orange oval objects in the sky.",
      "city": "peoria",
      "shape": "light",
      "date": "2014-02-27T00:00:00",
      "story": "Saw two different bright orange oval objects in the sky. I was on my way back from dinner at 11:34 pm on Friday, February 21, 2014, and I looked to my right and out of my window   I saw a bright orange oval shaped object in the night sky.  For a second I just thought it was a plane flying over the sky.  I soon began to study the flying object and notice that it was moving in circles and was very bright.   I turned into my neighborhood and behind my house up in the sky I noticed another orange flying object moving in a circular motion as I pulled into my garage.   I went inside to get my father and my brother.   About 2 minutes later, we ran back outside across the street and by that time, the object had disappeared.",
      "link": "http://www.nuforc.org/webreports/107/S107338.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c1238",
      "summary": "8 orange balls move across the sky.",
      "city": "peoria",
      "shape": "sphere",
      "date": "2013-11-20T00:00:00",
      "story": "8 orange balls move across the sky. At approximately 8:30 pm me and a friend were outside facing the N.W. when 2 orange lights bigger than a quarter came across the sky.  They were parallel to each other and traveling at the same speed.  I ran inside and got my 3 other roomates came out and they continued moving south together.  There was no noise at all nor blinking lights like seen on every aircraft in the sky.  Then when the first two started fading out to the far south another two lights appeared in the same location as the first.  They followed the same flight path as the first two and by this time a neighbor had come out and witnessed the second pair. We could not hear any noise at all from them.  Then when those two were in the south 4 more of the same lights came from the exact location but they came one at a time along the first flight path.  The lights all disappeared when they got in the southern part of the sky.  I've seen aircraft in the sky but this was definitely not a helicopter flares or airplanes.  I called 2 news stations and searched endlessly to see if any explanation could be found.",
      "link": "http://www.nuforc.org/webreports/104/S104372.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2195",
      "summary": "((HOAX??)) Sighting of UFO April 20, 2014 in Peoria AZ at 8:32pm Circle shape Red, Blue, and Yellow colors.",
      "city": "peoria",
      "shape": "circle",
      "date": "2014-04-24T00:00:00",
      "story": "Sighting of UFO April 20, 2014, in Peoria AZ at 8:32 pm  Circle shape Red, Blue, and Yellow colors I was out on the side of my house watering my plants.  I hear this sound and I look up to see a UFO I was in shock of what I was seeing.  I took my Ipod out and started to take pictures.   As I was taking the pictures the colors and the look was not that good so I started to video it.   As I was it moved so fast that it scared me so I ran in the house getting my son and husband to see what I'm seeing.  We all was able to see it.   It was circle red, blue, yellow colors.   We watch it go down don't know were it went. ((NUFORC Note:  We contacted the witness via telephone at the number she provided with her report, and she stated that she couldn't talk, because she was in court.  She denied having submitted the report.  Possible hoaxed report??  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108837.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c2583",
      "summary": "Disk shaped object flying fast across the sky stayed in straight line did not shift or change flight path. Object was black in color an",
      "city": "peoria",
      "shape": "disk",
      "date": "2014-11-06T00:00:00",
      "story": "Disk shaped object flying fast across the sky stayed in straight line did not shift or change flight path.  Object was black in color and moved faster then anything I've seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114979.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2651",
      "summary": "Fireball sightings in Peoria, Illinois.",
      "city": "peoria",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "Fireball sightings in peoria, Illinois my boyfriend and I were in the McDonald's drive thru when I noticed this large orange light shooting straight up into the sky FROM THE GROUND.  We have both been ufo fanatics for a while now and still have not seen one until tonight!!!  We have video and everything of it! On YouTube. Anyway...  We followed it with my phone while in the car and after looking at the video we took, it showed another one appeared right next to the first one and went in these crazy fast diagonal directions and then disappeared into the sky.  It's a freaking ufo people. We are not the only people on this earth :)",
      "link": "http://www.nuforc.org/webreports/114/S114789.html",
      "state": "IL",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c276d",
      "summary": "Looks like a starship out of SciFi movie",
      "city": "peoria",
      "shape": "triangle",
      "date": "2014-10-10T00:00:00",
      "story": "looks like a starship out of SciFi movie Notice a small light in the sky holding stationary at the 12 o'clock pos.  Took a look with my binoculars it didn't look to be spherical got the 4 1\\2\" telescope and looked at it.  It looks like it has structure shapes and it was triangle shape with some reflective surfaces. While trying to lock on to this object with the scope noticed a red dot (not illuminated but looked to painted red) off to right of the main objects.  The main object behaved like a balloon but looked nothing like any balloon I have ever seen thru my scope.",
      "link": "http://www.nuforc.org/webreports/114/S114320.html",
      "state": "AZ",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a84",
      "summary": "It was Nov. 23 around 9 o'clock I'm a sky dweller so I look up at the uh sky alot very often u know and this time I uh see a star u k",
      "city": "peoria",
      "shape": "fireball",
      "date": "2014-11-26T00:00:00",
      "story": "It was november 23 around 9 oclock im a sky dweller so I look up at the uh sky alot very often u know and this time I uh see a star u know and it was moving faster then plane and it illuminated and turned back into dimond this isnt a joke u know im vrry serious about situataion and this isnt first time many many more times this has happend to me and not just star shaped I mean fireballs in the sky and very very close it didnt freak me out I was just cunsern and I still am and will be for rest of my life (and this no name is bullshit I know what I saw and im not ashamed).",
      "link": "http://www.nuforc.org/webreports/115/S115598.html",
      "state": "IL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c2c4f",
      "summary": "I saw a UFO, then, it disappeared!",
      "city": "peoria",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "I saw a UFO, then, it dissapeared! The shape and color looked just like a star, however, it was two to three times bigger than a star!  This is why it caught my attention. It began to navigate vertically at a fast speed. Then, while still hight up in the sky, it suddenly stopped and dissapeared!  When it stopped, it appeared as if it had landed on something because the shape became a bit flat from the bottom and  bit of  splash of lights came out through the bottom right and left hand side, then it dissapeared. My husband saw an actual , odd shaped, spaceship about 2.5 years ago around the same area.  He saw it during daylight!  It was just up there, not moving! It disappeared while he was looking at it!  He didn't want to tell anyone because he didn't want people to think he's crazy!!  He's definately NOT crazy! ((ADDENDUM FROM WITNESS)) Sorry. It was yesterday,  11/05/2015 ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/115/S115169.html",
      "state": "AZ",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c32f5",
      "summary": "At about 8:25 pm or 20:25 hours, i looked up at the sky while working, due to a vivid red light at the corber of my eye. I looked up an",
      "city": "peoria",
      "shape": "fireball",
      "date": "2015-03-13T00:00:00",
      "story": "At about 8:25 pm or 20:25 hours, I looked up at the sky while working, due to a vivid red light at the corner of my eye.   I looked up and there was an object, which at first i thought was a meteor coming down, so I waited to see if it would tear in pieces, like it would regularly would of it was a meteor, but this had no color like to a meteor it was vivid red not orange or yellowish parts.  So then this object stopped moving i would say it stopped near the 101 close to Phoenix Cardinals stadium.  So when it stopped, two smaller red things came out of it directly going down to the city!   I was recording all this at the time but when i tried to look back at it, it was gone!  The recording only shows when I am bearly going to move my camera up to record these lights!  Anyhow when these two lights go down the bigger object turns white, like glowing supper bright and it keeps going west for about a 2 to 5 second distance in the air and it drops another object which als! o goes straight down to the city, mean while the bigger object disappears at an extremely fast speed!  Then the first two objects come back up and also disappear!  Air craft then started appearing around the same area! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We wonder whether this is a serious-minded report, or an attempt to hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117636.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c32f6",
      "summary": "3 orb lights slowly formed a perfect triangle in the Phoenix suburbs night sky.",
      "city": "peoria",
      "shape": "sphere",
      "date": "2015-03-13T00:00:00",
      "story": "3 orb lights slowly formed a perfect triangle in the Phoenix suburbs night sky. 3 glowing yellow/orange orb sphere like floating lights hovered in the sky in a diagonal line for a minute then slowly formed into a perfect triangle for a few seconds.  One light then disappeared and the other two moved around the sky slowly until they both vanished soon shortly after.",
      "link": "http://www.nuforc.org/webreports/117/S117685.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3412",
      "summary": "20 orange orbs over Peoria, AZ.",
      "city": "peoria",
      "shape": "circle",
      "date": "2015-03-26T00:00:00",
      "story": "20 orange orbs over Peoria AZ About 8:30 PM, on the 21 of March 2015, my son was leaving to go to a friend’s house, and came back in the house and stated that there were weird lights in the sky.   My friends, the wife, and I went outside to see what he was looking at.  In the sky there were 5 orange orbs in line traveling to the east just over my house.  They would fade away and more would come up over the horizon in the western night sky.   These didn't look like flares (no smoke, no streaking tail and they were traveling slowly).   As many as 20 came over the house in 30 minutes before fading out.",
      "link": "http://www.nuforc.org/webreports/117/S117970.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c376c",
      "summary": "I was smoking a cigarette in my back yard looking in the sky when i see a triangular shaped craft hovering in the sky emiting 8 lights",
      "city": "peoria",
      "shape": "triangle",
      "date": "2015-02-06T00:00:00",
      "story": "I was smoking a ciggarette in my back yard looking in the sky when i see a triangular shaped craft hovering in the sky emiting 8 lights The object was triangular in shape and emitted 8 bright orange/red lights that flickered like a fire at a distance.  The craft hovered for about 5 minutes making no noise and maintaining a perfect altitude.  It was not a conventional air craft and was not flairs being dropped.  I was in my back yard looking out towards Luke air force base and I am positive it was no aircraft of ours.  The lights were spherical in nature and were brighter then the construction lights at the near by gravel mine.  I'm very concerned about this.  All of the dogs and coyotes were going crazy.  I also filmed the craft.",
      "link": "http://www.nuforc.org/webreports/117/S117146.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3990",
      "summary": "Amber sphere breaks up into multiple fragments, 2 seperate repeated events.",
      "city": "peoria",
      "shape": "other",
      "date": "2014-12-22T00:00:00",
      "story": "Amber sphere breaks up into multiple fragments, 2 seperate repeated events. Early on the morning of December 21, 2014, I had noticed a bright flickering amber-colored light in the North horizon.  I watched it fly south, toward my direction, in a non-linear fashion until it was practically right overhead, still slightly to the North.  The single light dimmed temporarily before flaring up and breaking up into 3-5 different pieces that all went separate directions at different speeds.  When the original light broke up, it brightened immensely and seemed to fall apart, with the separate pieces having tails similar to a small fireball.  Some stayed illuminated, some dimmed to faint red dots barely discernable from the night stars.  After about 15-20 seconds, all of the lights had dimmed to blinking red dots flying in separate directions. About 2 minutes after this event occurred, another amber-colored light appeared on the Northern horizon, in the same exact area and followed the same general path in the sky. The flickering amber light flew to the same general area that I had seen the previous one in, and broke apart in the same manner as the first, dispersing fireball-like lights in separate directions that all eventually turned into blinking red lights.  The lights changed direction and speed, but never fast enough to seem like a shooting star or something falling into our atmosphere. I was compelled enough to call the local Non-Emergency line to report this incident, and they actually dispatched two units to my house fairly quickly, within 10 minutes of my call.  I was surprised to say the least.  By the time they had shown up, the lights were gone and I was left defending my sobriety and right state of mind.  After a few minutes describing what I had seen, the police jovially dismissed me by stating, \"Sadly enough, I don't have the Magic School Bus, and I can't fly up there and investigate what you saw.\"   I actually appreciated his humor and thanked him for his time.",
      "link": "http://www.nuforc.org/webreports/116/S116133.html",
      "state": "AZ",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c43ec",
      "summary": "Very bright in the sky through clouds glowing haze around it hard to make out.  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "peoria",
      "shape": "cone",
      "date": "2015-11-19T00:00:00",
      "story": "Very bright in the sky through clouds glowing haze around it hard to make out. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123779.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c43fd",
      "summary": "Round bright white light with large aura/haze surrounding the light completely. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "peoria",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "Round bright white light with large aura/haze surrounding the light completely, moved slowly from south to west then turned back south, faded and disappeared. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123822.html",
      "state": "AZ",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ec9",
      "summary": "3 spherical objects hovering close together in the sky then leaving area",
      "city": "peoria",
      "shape": "sphere",
      "date": "2016-03-11T00:00:00",
      "story": "3 spherical objects hovering close together in the sky then leaving area My mother, father, and myself were sitting in the spa in our backyard when my father caught sight of something in the sky to our west.  He drew our attention to 3 spherical objects hovering in the western part of the sky from our home.  The objects just hovered there for what seemed like several minutes before departing at a fairly high rate of speed to the south and disappearing.  No sound was noted by any of us from these objects. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126195.html",
      "state": "AZ",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ecd",
      "summary": "Slow moving chevron-shaped object with multiple lights over our house moving north-south",
      "city": "peoria",
      "shape": "chevron",
      "date": "2016-03-11T00:00:00",
      "story": "Slow moving chevron-shaped object with multiple lights over our house moving north-south I was 16-years-old and our family (myself and my parents) lived in Peoria, Arizona at the time, just off of 75th Avenue and Peoria Ave.   I believe it to be nearly 8:15 P.M. when I walked outside, anticipating the arrival of a friend from school.  Movement caught my peripheral vision, causing me to look up.  What I noticed surprised me a great deal.  Over my head, traveling quite slowly at, I'd estimate maybe 20mph, was a very large seemingly solid V-shaped object, marked at intervals by slightly yellowish-whitish round lights.  I was so taken aback by this silent figure, I stared very intently and noticed that in between these lights, it was not possible to see stars, which, to me, indicated that the lights were part of some craft, which I had never before seen.  It was a very clear night, and stars were visible in other parts of the sky.   I was so surprised, I turned around and walked back through our courtyard to get my father, who I was certain could conf! irm what I was seeing.  I walked in and explained to him what I saw and that he needed to come outside, but by the time we both arrived back in the courtyard, the lights were much further away and we couldn't examine it further.   My friend later arrived and stated that he, too, had seen the strange formation of lights and watched it disappear on the horizon to the south, which had been the direction it was traveling when I'd stood beneath it.   I'd estimate that it was maybe 800-1,000 feet above me, but shockingly silent.  I could hear no motor, no propulsion of any kind while standing beneath it as it made its trek from north to south over me.",
      "link": "http://www.nuforc.org/webreports/126/S126198.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ecc",
      "summary": "Dark triangle-shaped craft silently moved over house, traveling from north to south.",
      "city": "peoria",
      "shape": "triangle",
      "date": "2016-03-11T00:00:00",
      "story": "Dark triangle-shaped craft silently moved over house, traveling from north to south. I awoke and felt compelled to go to my bedroom window and immediately noticed a stark black triangle-shaped craft just above our home traveling in a north-south trajectory, rather slowly.   It seemed completely silent and had steady glowing red lights on the bottom along the sides of the craft.   It appeared to be quite large, not like an airplane but much larger by far.   It was in the pre-dawn hours of the morning, and the sun had not yet risen.   I watched the craft approach the horizon and disappear from view.",
      "link": "http://www.nuforc.org/webreports/126/S126199.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c508f",
      "summary": "Set of four lights flying in formation.",
      "city": "peoria",
      "shape": "light",
      "date": "2016-02-26T00:00:00",
      "story": "Set of four lights flying in formation. As we were driving east down cactus off to the left we saw a set of four lights moving fast.  Too close for planes or helicopters.  They moved in formation and made a sharp turn and headed east.   We tried to take pictures but they were blurred out by the street lights.",
      "link": "http://www.nuforc.org/webreports/125/S125955.html",
      "state": "AZ",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c52a7",
      "summary": "I had gone out for a walk at 3:00am Wednesday 1/13/2016 which is approximately a six mile walk I had turned right back off the street a",
      "city": "peoria",
      "shape": "light",
      "date": "2016-01-23T00:00:00",
      "story": "I had gone out for a walk at 3:00am Wednesday 1/13/2016, which is approximately a six mile walk I had turned right back off the street a little ways from my home when out of the corner of my left eye I saw a bright white sphere.   Thinking maybe it was a piece of a meteor or space junk falling to earth, I stopped to look and there was no fire ball or tail.   It flew over a house not to high up and stopped approximately in front of me about 50 foot foot in the air and approximately a 100 feet in front of me it sat there about 6 or 7 seconds where I could see some dark images as I looked at it straight on or even blurry",
      "link": "http://www.nuforc.org/webreports/125/S125375.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5817",
      "summary": "Weird maneuvers by bright lights.",
      "city": "peoria",
      "shape": "unknown",
      "date": "2016-06-16T00:00:00",
      "story": "Weird maneuvers by bright lights. Red and green lights appeared in the sky, I thought it was a helicopter.  Starting moving really fast and zig-zagging unlike a helicopter then the lights were red & white and it looked like it hid under a tree line.   Came back after a few minutes but went back down.   I started to think that a military craft should show up soon and sure enough one did.  This \"thing\" was moving fast acting weird going left and right appearing wobbly up and down and was quiet.  The only thing I could hear was a slight crackling sound like a fuse after it's lit.",
      "link": "http://www.nuforc.org/webreports/127/S127844.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a4a",
      "summary": "Big triangle flew over my house!",
      "city": "peoria",
      "shape": "triangle",
      "date": "2016-04-29T00:00:00",
      "story": "Big Triangle flew over my house! I noticed two series of red lights curved like a baseballs seams so I watched it fly directly over my house, I could only make out the triangle for a split second.  It sounded like one of the quiet military aircraft that frequents my area.",
      "link": "http://www.nuforc.org/webreports/127/S127076.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b91",
      "summary": "Glowing ball shaped object, flashing red/green/blue and very bright in the sky.  ((NUFORC Note:  \"Twinkling\" star?  Sirius?  Anon. PD))",
      "city": "peoria",
      "shape": "sphere",
      "date": "2016-04-22T00:00:00",
      "story": "A friend and I sighted a glowing ball shaped object, flashing red/green/blue and very bright in the sky.  It was lower to the ground than any stars but higher than planes would be.  The object did not move and kept flashing very bright for a duration of about 20 minutes. ((NUFORC Note:  \"Twinkling\" star?  Sirius?  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126968.html",
      "state": "IL",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6358",
      "summary": "Circular rotating solid light gets followed by solid red light, and at the same time a c130 takes off headed to same area.",
      "city": "peoria",
      "shape": "light",
      "date": "2016-09-09T00:00:00",
      "story": "Circular rotating solid light gets followed by solid red light, and at the same time a c130 takes off headed to same area. It all statted the first night with the kinda crappy videos i got Of what appeared to be a rotating light so much so that it was a perfect circle.  Luming from orange to red. It was very far off but still big enough to tell it was rather large. It hung in the sky for almost an hour before dissapearing off intonthe sky.  The second night 9/6/16 Walking outside at work at 10pm to do trash with a manager looking up to see the same circular light hanging in the sky in the same area but definitely a lot higher up, we looked at it for awhile and went to the dumpster, while waking back we could see it on the other side of the sky hanging there miles from where it was.  It had to have moved in the blink of your eye to have been able to get from where it was.  Once we rounded the corner of our building we noticed a larger solid red light moving in the direction of the circular light.  And then a c130 flew right over top of our building kinda gliding to the right of where ! the lights were.  It struck me as weird to see the c130 fly over ive never seen them take that path before. After watching the lights get closer and kinda dissapearing further up i had gone back into work.",
      "link": "http://www.nuforc.org/webreports/129/S129767.html",
      "state": "IL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a32",
      "summary": "Stationary bright white light west of Peoria, AZ.  ((NUFORC Note:  Probable sighting of Venus.  PD))",
      "city": "peoria",
      "shape": "circle",
      "date": "2017-02-17T00:00:00",
      "story": "Stationary bright white light west of Peoria, AZ.   ((NUFORC Note:  Probable sighting of Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132572.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a73",
      "summary": "Fluid formation flying disks.",
      "city": "peoria",
      "shape": "formation",
      "date": "2017-02-22T00:00:00",
      "story": "Fluid formation flying disks. My sister and I initially thought we were witnessing a bird migration, but the elevation was too high to be birds.  We then witnessed what looked like 10 circular craft, that were light in color, possible light silver or white, and were reflective, begin moving in a fluid formation that was like nothing we have ever witnessed.  They bobbed and weaved within one another so fluidity that we were sure we couldn't be witnessing anything man made.  They flew in this fluid formation for 10 minutes then completely disappeared.  There were no clouds in the sky for them to disappear into, and it was perfect weather with very little wind.  My sister and I were driving north on our way home from running errands and we turned west and watched them until they disappeared.  When we arrived home, we saw fighter jets flying around our area.",
      "link": "http://www.nuforc.org/webreports/132/S132745.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7418",
      "summary": "Friend and I saw an oval object omitting red/green light, followed it and at some point went 3+ miles within the span of seconds,.",
      "city": "peoria",
      "shape": "oval",
      "date": "2017-06-09T00:00:00",
      "story": "Friend and I saw an oval object omitting red/green light, followed it and at some point went 3+ miles within the span of seconds,. Around about 11:41 pm, my friend and I noticed a red dot while on the highway.  We decided to watch it further for a bit, thinking it was a plane but it remained stationary until we came close to a nearby lighted shopping center and saw that it flashed red and green.  Upon entering the shopping center, one of the buildings blocked our view of it, and by the time we backed up so we could see it was about 3-5 miles away within a few seconds.   We then proceeded to watch it until it disappeared miles away.",
      "link": "http://www.nuforc.org/webreports/134/S134488.html",
      "state": "IL",
      "duration": "12-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8150",
      "summary": "Entities in my home November 15, 2016.",
      "city": "peoria",
      "shape": "unknown",
      "date": "2018-02-22T00:00:00",
      "story": "Entities in my home November 15, 2016 Encounter with 3 beings: I awoke around 3 am to see 3 beings standing in my bedroom door.  They are translucent, soft light emanating from their bodies.  I sat up in my bed and I stared intently. My impression was a Mother with a child. She was tall and lean with olive-shaped dark eyes. She had long arms and she was without clothing. I could not make out any specific shapes we would call genitals.  Her mouth was narrow with an oval shaped face, no hair on the body.  The child entity stood next to the mother holding her leg.  The child came up to her hip in height.  I got the feeling this was a boy.  Same appearance only the head was shaped slightly smaller and stout with arms and legs.  The eyes were big and looking at me as if this was its first time seeing a human being. The third entity stood behind them. Same soft light emanating from the body. At this point, I could tell all 3 bodies seemed to be floating like a hologram. The 3rd entity was different in that on top of its head were these antenna with olive-shaped eyes. There must have been 8 or so of these attached to the head and looked like they were part of the scalp. I had the impression this being was a scout and the antenna were cameras. I went to get up out of bed and the beings turned their backs and floated down the hallway and just disappeared.  I thought ok, that was a strange experience. The next evening around the same time, 3 am.  The being with the antenna on the head appeared standing in my hall near my coat closet and hung onto the woodwork. I looked up and waved my hand. It matched my hand wave and a slight smile like a Mona Lisa Smile appeared on its face.  I went to get up and it disappeared. I could only describe the movement of the beings like watching seaweed floating in the ocean. They were opaque but I could see through them.  I remember feeling a joy in my heart unlike any other. An overwhelming sense of love and wonderment. It was a marvelous experience. I wish to remain anonymous. My family would not believe me, I have told 2 close friends. Whether they believe I do not care. I felt like I should share. I believe these beings are walking among us at this moment. Observing us. Maybe they are here to help or just waiting to pick up the pieces after we are gone. Sincerely,  A believer",
      "link": "http://www.nuforc.org/webreports/138/S138866.html",
      "state": "IL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8329",
      "summary": "7 red-orange orbs in Peoria, IL sky on 9/14/18",
      "city": "peoria",
      "shape": "circle",
      "date": "2018-09-27T00:00:00",
      "story": "7 red-orange orbs in Peoria, IL, sky on 9/14/18 First of all, I am not a night sky watcher, astronomer, UFO hunter, weather tracker or any form of such things.  I might watch a UFO documentary once in a while, but I want nothing to do with aliens, both fictional or non-fictional.  I happen to know a few of the constellations from school and my father.  I saw Neptune through a telescope once, out of state.  I know a little bit about weather but this is the extent of my experience with such things. I was crossing a parking lot to go home tonight and I saw a strange man cross my path.  I looked up and he turned to look at me.  When I realized he wasn’t interested in me, I just watched him for a couple seconds and then something caught my eye overhead of him. When I realized what I was seeing, I turned to see if the man was still around because I wanted to draw his attention to the lights but he was already gone. I looked up to see two reddish-orange orbs flying upward in the north sky.  I just stopped to watch them.  Usually, there are planes that cross this path going south to the nearby Peoria Airport.  The lights were big like the lights of a big plane nearby.  They were spaced far enough I thought they were the lights you see on either wing of a plane.  Only one problem, there was no plane in-between or attached to these lights. I watched them ascend, in a slight curve and then turn right (my left) and as they went over this one spot in the sky, they dimmed, almost turning white and completely fizzled out.  There was a single light coming up from the tree line, same kind of light but single.  I watched it ascend, also take a right turn and disappear in the exact location as the first two.  But again, before it completely disappeared there was another light ascending.  Also, these were doing this as in formation and pace and such. All together, there were the first pair of lights and then 5 single lights after -  7 lights total.  Every one of them disappeared in the exact same spot and in the same manner.  I was searching my brain for an explanation of what these were: planes, weather balloons, hot air balloons, falling stars, fireworks, comets, Chinese lanterns, helicopters, flares, you name it, I was thinking about it, and ruling each one out. I am colorblind with reds/greens/browns and can see these colors if the brightness and hue and lighting is just right. When Mars was visible people would say, “Look how red it is!”  And I could not see this for the longest time.  At one point, when it was at a different location, I was finally able to see a faint redness to it.  These orbs were very distinct, bright, true color-there was no question what color they were. Because I was coming home from a bunch of errands, I did not have my digital camera with me and I was not wearing a watch.  But it was somewhere between 9:00 PM and 9:30 PM and lasted close to 5-10 minutes. I was also questioning how the orbs just disappeared when I saw the first two and thought it was just a plane turning and making it skinnier from the angle.  I also thought about the fact that maybe this set of lights went into/behind a cloud.  But it didn’t take me long to realize, there’s no clouds! I could see the big dipper to my front left, another constellation (forget the name) to my front right and I could see a cluster of stars and individual stars where these lights kept disappearing. I scanned the sky to see when I would see the lights again and it was evident that when they looked like they fizzled out, that was the last I was going to see of them.  It almost gave the impression they went into a door, portal or whatever it was, to make them disappear.  I waited after the 7th one for almost 5 minutes to realize that the show was over. The thing too, is that had they turned to make it harder to see them, they would have eventually straightened out and I would have seen them again.  This did not happen.  I rushed home, set all the stuff down, grabbed my digital camera and went back out there.  I waited around another 10-15 minutes; I was hoping to see something again but nothing else happened. I called NBC WEEK 25 to inquire about this sighting and was transferred, but no one answered and it did not go to voicemail to leave a message.  I then decided to E-mail them but no one has responded as of yet.  I have also been scouring the internet for the past two days, to see if anyone posted this sighting, to no avail.  I really want to know if anyone else saw these and possibly know if these orbs are indeed UFO’s or drones or something else.  I only know they are nothing I have ever seen before. One last thing I would like to point out is that when I was back out there with my camera, a plane went overhead that was very high-the height of a cross-country flight.  And I could see it fairly well, the blinking lights, the movement and such and the orbs I had seen earlier made this plane pale in comparison.",
      "link": "http://www.nuforc.org/webreports/143/S143136.html",
      "state": "IL",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c852d",
      "summary": "Bright, White, Long, Huge Cylindrical Object above my place.   ((anonymous report))",
      "city": "peoria",
      "shape": "cylinder",
      "date": "2018-08-10T00:00:00",
      "story": "Bright, White, Long, Huge Cylindrical Object above my place. I had just come home from a movie.  I literally got out of my vehicle and looked up and there it was.  I would say it was the size of 6 C4 Transport planes side by side.  It was almost dusk but still light out.  It was glowing white super bright.  It moved very slow over my place.  It was big and long, too.  Then slowly it left and was gone like disappeared.  I would say it was about 1 or 2 football fields in height above me or maybe 20 stories to 40 stories above me.  I clearly make out the color, dimensions.  No sound at all whatsoever. Unfortunately,  I didn't get the opportunity to record my phone was shut off. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142377.html",
      "state": "IL",
      "duration": "5-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c852e",
      "summary": "((HOAX??))  Long, big, bright White Cylinder over my place in daylight.  ((anonymous report))",
      "city": "peoria",
      "shape": "cylinder",
      "date": "2018-08-10T00:00:00",
      "story": "Long, Big, Bright White Cylinder over my place in daylight I had just gotten home from a movie.  It was still daylight.  I got out of my car and saw it.  Large, Bright White, glowing, long Cylinder.  It was approaching my place above.  It was as long as 6 C4 Transport planes put together.  Height of it probably two tractor trailers (the part that stores stuff in) in height put together.  It made no sound and extremely slow.  It was maybe 20 stories above the ground maybe less or maybe the length of a football field up above me.  I watched it clear in an opening in the trees and once it cleared the opening was gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142421.html",
      "state": "IL",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b45",
      "summary": "Seen black metallic rectangle,three feet wide and four feet long electric blue plasma under it that went in and out every four seconds.",
      "city": "peoria",
      "shape": "rectangle",
      "date": "2019-03-14T00:00:00",
      "story": "seen black metallic rectangle,three feet wide and four feet long electric blue plasma under it that went in and out every four seconds.  Was about thirty feet from me and about 15 feet off the ground..  No sound at all . clear day no clouds move slow like glided.   went inside to show someone and  came back out, it was so fare away.  traveled n/e.",
      "link": "http://www.nuforc.org/webreports/145/S145085.html",
      "state": "AZ",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8cbb",
      "summary": "Orange orbs seen in the southwest skies of Peoria, AZ during the Superbowl 2/3/19.",
      "city": "peoria",
      "shape": "fireball",
      "date": "2019-02-07T00:00:00",
      "story": "Orange orbs seen in the southwest skies of Peoria, AZ, during the Superbowl 2/3/19. Two of us were walking through our neighborhood, when we saw two fireballs shooting up in the air slowly.  In under 20 seconds, one first dimmed to a speck, and then the second one, ten seconds later.   Then we continued to watch both specks split apart and travel over our heads until it was completely behind our heads.  They traveled from the above the horizon over out heads to what appeared nearly 100-120 degree angle.  The distance was amazing as well as the quickness the bright orange circular light died out, then continued to travel.",
      "link": "http://www.nuforc.org/webreports/144/S144766.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c94bb",
      "summary": "Bright lights in a straight line.  ((NUFORC Note:  Cluster of \"Starlink\" satellites.  PD))",
      "city": "peoria",
      "shape": "other",
      "date": "2019-12-01T00:00:00",
      "story": "Bright lights in a straight line Saw 6 or 7 lights in a straight line moving south East in a line together. They were bright at first then slowly faded but could still see them moving in a straight line until they faded out of sight.",
      "link": "http://www.nuforc.org/webreports/150/S150564.html",
      "state": "AZ",
      "duration": "5 minutes"
    }
  ]
}