{
  "city": "philadelphia",
  "fetch_timestamp": "2025-07-12T14:18:02.412632",
  "record_count": 163,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4230",
      "summary": "At approximately 5 am, i went to let my dog out my back door which faces north. Flying from the west to the east above the tree line I",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2019-03-21T00:00:00",
      "story": "At approximately 5 am, i went to let my dog out my back door which faces north. Flying from the west to the east above the tree line I saw a large, triangular shaped object edged with a line of blue lights, and below them, a line of red lights.  The lights did not look perfectly parallel to each other.   They angled away from each other to create a strange angle between what looked to be two surfaces.",
      "link": "http://www.nuforc.org/webreports/145/S145236.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b42b2",
      "summary": "clear view of a flying saucer,hovering, and beaming down a light.",
      "city": "philadelphia",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "clear view of a flying saucer,hovering, and beaming down a light. I observed a white beam of light.  At first, I thought it was a helicopter but when I went to look closer,I saw a classic saucer,gun-metal black, but I could see it clearly because a beam of light was coming down from the center of it.  It hovered there for 45 seconds or so, then it moved slowly east.  I could red lights around it. There was no sound. The light was the brightest  I have ever seen.",
      "link": "http://www.nuforc.org/webreports/050/S50211.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4487",
      "summary": "Clear, cylinder, objects around it hovering under airplane",
      "city": "philadelphia",
      "shape": "cylinder",
      "date": "2019-08-23T00:00:00",
      "story": "Clear, cylinder, objects around it hovering under airplane A clear cylinder underneath an airplane.  Gliding underneath it.  It kept up with the airplane. Kind of clear, cylinder, something around the middle of it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148174.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b44b3",
      "summary": "Philadelphia - Seen UFO",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "2006-05-15T00:00:00",
      "story": "Philadelphia - Seen UFO We were walking around Ben Franklin Parkway, on our way to the Franklin Institute, and my friend pointed to the sky and pointed to a \"blimp\".  I don't know what it is about blimps that always make people want to look up and watch them, but i looked.  I didnt really see a blimp though.  It looked like one, but there was no tail thing, no pilot area, and especially no ad on the side. Before i actually thought it could be something other than a blimp, it spun around horozontaly, and disapeared.  It was pretty freaky, and i think we were the only two to see it.  Does anyone here have answers?",
      "link": "http://www.nuforc.org/webreports/050/S50080.html",
      "state": "PA",
      "duration": "about a minute and a half"
    },
    {
      "_id": "64d005f478aba2ec5a3b4903",
      "summary": "Flying cigar-shaped saucer in Philadelphia, PA in 2002",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "2019-07-12T00:00:00",
      "story": "Flying cigar-shaped saucer in Philadelphia, PA in 2002 It was a clear day in the summer.  I was walking to the grocery store.  I noticed a flying cigar-shaped saucer in the sky.  It was moving fast like a jet and made no sound.  It had no wings, no windows, and it was shiny. It was flying low enough for me to get a good look at it to tell it was not an airplane or a toy of some sort.  I watched it fly for about 10 seconds until it was too far for me to see it.   I'm not sure when the date was, but it was a while ago.  I was in my early 20's,  I am 36 now.  I still remember that day because as I was watching it, I made sure not to forget about it.  It was a cool experience because I could not understand why it made no sound or had no wings and appeared to be just floating through the sky.  About a week later I was walking outside, I don't remember where to, and a jet was flying by in the same direction at about the same speed as the saucer was.  It was clearly a jet of some sort and loud as jets usually are (the sound was foll! owing the jet).  That's all I remember and I haven't seen anything like it since.",
      "link": "http://www.nuforc.org/webreports/147/S147427.html",
      "state": "PA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4c88",
      "summary": "Two shimmering objects in the morning sky hovering 100 feet apart very high up",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2019-06-27T00:00:00",
      "story": "Two shimmering objects in the morning sky hovering 100 feet apart very high up My bud and I were out smoking and he looked up in the sky and saw two shimmering objects in the sky above our building.  They were about 100 feet apart n hovering really high up.  They were too small to tell what shape they were.  They were moving across the sky very slowly keeping their distance the same between them.  It was in the morning as well.  They must have been spinning because we could see the reflection of the sun on them every couple of seconds.",
      "link": "http://www.nuforc.org/webreports/147/S147045.html",
      "state": "PA",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e43",
      "summary": "While at work house painting outside, saw a bright silver cylinder.  It appeared to be floating.  ((anonymous report))",
      "city": "philadelphia",
      "shape": "cylinder",
      "date": "2019-05-09T00:00:00",
      "story": "While at work house painting outside,  Saw a bright silver cylinder.  It appeared to be floating. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145929.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b515e",
      "summary": "An object followed my car parallel to me then stopped when I stopped & observed me for 5 minutes.",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "2006-10-30T00:00:00",
      "story": "An object followed my car parallel to me then stopped when I stopped & observed me for 5 minutes. I was driving along a road and noticed this object following parallel to me.  I pulled into a deserted parking lot, got out of my car and the object stopped, turned toward me, and dipped its front end.  I stared at it, and it observed me from about 50 to 60 feet from the ground.  The object was black and shaped like a helicopter, but had no working parts or lights.  The object started following me in Philadelphia, and stopped where I stopped in Bensalem.  It was a clear winter night.  After observing me it moved away quickly and disappeared in the sky. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52181.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5176",
      "summary": "Childhood sighting of disk witnessed by mother and sons.",
      "city": "philadelphia",
      "shape": "disk",
      "date": "",
      "story": "Childhood sighting of disk witnessed by mother and sons. This story was related to me by my first cousins once removed at my great-aunt's (their mother's) funeral.  It occurred during their childhood in rural Neshoba County, Mississippi.  Both are Air Force veterans and solid citizens.  I have absolutely no reason to doubt their word.  According to the observers (who are twin boys), they were about seven or eight years old, and out of school for the summer.  The rural mail carrier delivered the mail to their home somewhat near the end of his route, and usually arrived after 3:00 p.m.  Their home was located approximately 100 yards up a gravel driveway from the main roadway, also a gravel road at the time.  The twins heard the mailman approach the mailbox, stop, and then accelerate off to the next home down the road.  They asked their mother if they could go down to the mailbox and get the mail.  She allowed them to go.  They walked the 100 yards or so down to the mailbox, retrieved the mail and headed back towards the house.  When they were approximately half way up the drive (50 yards from their home), my great-aunt began yelling for them to \"run, run!\" in an urgent tone.  They ran towards her.  When they arrived at the front porch of their home, my great-aunt pointed towards the woodline on the other side of a field approximately 4-500 yards from their home.  Silently hovering over the woodline was a very large silvery disk, perhaps 100-200 feet or larger in circumference.  They observed the disk hover for approximately another four or five minutes.  It then took off at a very high rate of speed, accelerating as it gained in altitude.  It was out of sight in only a few seconds, and was entirely silent. My cousins told me that they were in awe of the object but, being children, they quickly resumed playing and had only the vaguest memory of both the object and the event for many years.  While reminiscing at a Thanksgiving dinner many years later (in the mid-1990s), my great-aunt questioned them both to see if they remembered the event.  They both recalled the event and had virtually identical recollections.   An older brother who was a test engineer at the Nevada Test Site until his retirement also recalled that the story was related to him shortly after it happened in the early 1950s. I am not aware of any other witnesses, nor am I aware of any graphic images such as photos, movies, etc., that exist of the incident.  If you need further details, feel free to contact me. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62711.html",
      "state": "MS",
      "duration": "ten minutes or less"
    },
    {
      "_id": "64d005f478aba2ec5a3b524a",
      "summary": "A FRIEND AND I WERE HANGING OUT. THE WEATHER WAZ VERY NICE WE WERE ON HIS ROOF OUT SIDE HIS  UPSTAIRS ROOM LISTENING TO SOME MUSIC.WE C",
      "city": "philadelphia",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "A FRIEND AND I WERE HANGING OUT. THE WEATHER WAZ VERY NICE WE WERE ON HIS ROOF OUT SIDE HIS  UPSTAIRS ROOM LISTENING TO SOME MUSIC.WE COULD SEE THE CITY FROM THE ROOF AND WE WERE JUST TALKING. I NOTICED A RED LIGHT IN THE SKY I SAID TO MY FRIEND DO YOU SEE THAT HE SAID YES WE BOTH THOUGHT IT WAZ A PLANE AT FIRST. IT WAZ AT A DISTANCE THE WAY IT MOVED WAZ  VERY SLOW THEN IT JUST CAME TO A STOP FOR ABOUT 10MIN THE LIGHT GOT BRIGHT AND RED AND YELLOW. THEN IT STARTED TO MOVE SLOWLY LIKE GLIDE THROUGH THE NIGHT SKY. AND IN A BLINK OF A EYE IT I MEAN AT SUPER SPEED SHOT UPWARD IN TO THE SKY. BOTH OF US WERE SHOCKED AND A LITTLE CONFUSED WHAT WE SAW BUT IT WAZ FOR REAL I WILL NEVER FORGET WHAT WE SAW THAT NIGHT!!!!!!!!!",
      "link": "http://www.nuforc.org/webreports/063/S63237.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5611",
      "summary": "Sting Ray Shaped UFO Over Philadelphia , PA",
      "city": "philadelphia",
      "shape": "disk",
      "date": "2008-03-04T00:00:00",
      "story": "Sting Ray Shaped UFO Over Philadelphia , PA It was on or about 1:00 am on Jan. 07, 2003, me and my wife were going to bed it was cloudy that day as I was getting ready to get into bed I decided to look out the window at the sky to see if it was going to snow , in doing so I notice a tiny little black ball looking object far up in the clouds so I kept my eye on it and it kept falling very fast , here it fell and it came down and stopped just above or yard right in front of our window it freaked me out thought it was going to crash but it didn't it stop in mid-air and it was wobbling side to side for at least a minute or two like it was trying to stabilize it's safe , as it was doing that I got a very close look at the craft , it made no sounds it had no lights it was pure black it had a hump on top center of the craft which look like and fighter jet's cock pit but it had no windows the craft was almost round it had the shape of a stingray, acttually if this craft was in the ocean I would have thought I saw a stingray , on the right and left sides of the cockpit /hump it had a oval shaped metal / silver plate with ridges on it, the craft also had two small tails on the back sides one on each side and one larger tail in the center back side between the two smaller ones, before the craft started to move over our house the bottom of the craft changed it's appearance to resemble the clouds above in the sky and then it move away very slowly as it past over our window and went over our house, I tell you it was so close if I was on the roof of our house I could have reach out and touched it. I didn't try to take a picture because I thought that if I would go for the camera I was going to lose sight of it, but I did got a very dam good look at it from all angles and saw every little detail of the craft, I did a rough drawing of the craft on my pc just to give an idea of what I saw. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61759.html",
      "state": "PA",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b05",
      "summary": "UFO Noise",
      "city": "philadelphia",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "UFO Noise For the past two weeks there has been a random unfamaliar noise coming from the woods. It sounds like nothing I have ever heard before, almost like a low pitch storm warning sound. It is coming from the woods which are pretty much desolate and vast. I called 911, and the operator told me a few officers reported hearing it, but none of them knew what it was. None of our neighbors could figure out what it was. I am a cement mason, and I am famaliar with the sounds of different machines, and the sound is neither machine nor human. It happens at random times throughout the day but at nighttime it gets real eerie and loud. The other night I came home at 4am and it sounded like it was above my roof at my house. I was seconds away from calling the cops. I do not know what is back there, but to my understanding if it is not human or machine, it just might be E.T.. or Jesus???",
      "link": "http://www.nuforc.org/webreports/051/S51564.html",
      "state": "PA",
      "duration": "Random"
    },
    {
      "_id": "64d005f478aba2ec5a3b5cfb",
      "summary": "May/2006 - Video: UFO Over Philadelphia?",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "May/2006 - Video: UFO Over Philadelphia? I spent the weekend in New Jersey and on Sunday, my father gave me a ride back to Philadelphia.  I drove, and he asked if I could stop down in Chinatown so he could pick up some tea and some new teacups.  I took 95-N and got off at the Washington Ave exit, and proceeded up Washington Ave to 7th St. A few blocks before I turned onto 7th, I was looking up at the clouds when I saw something just kind of sitting there in the clouds that I could not identify.  When we turned south on 7th St., we pulled into a parking lot just off the intersection and across from Pho Ha where my father wanted to stop. I decided to hop out and use the DV camcorder my folks bought for my girlfriend and I back in Novemember when our son was born, and started recording.  The quality is not the best, and there's a Vietnamese band playing in the background in part of the footage but take a look. It's clearly not an airplane or a helicopter.  Around 2:38, I zoom all the way out to show just how far away this thing is, and based on that (which you'll see), I don't feel confident that it's a balloon as from that distance, even with my good eyesight, I don't think I would have seen a regular balloon flying that high, that far away, with the late afternoon sun kind of in my eyes otherwise.  So by definition, it's a UFO. What exactly it is, I don't know but enjoy, let others know for enjoyment if you want, and leave some comments if you want.  I wrote about it on my website here - (http://phillybits.blogspot.com/2006/05/ufo-sighting-over-philadelphia.html)  Video can be seen here - (http://www.youtube.com/watch?v=tKEk5nu00lQ)",
      "link": "http://www.nuforc.org/webreports/054/S54298.html",
      "state": "PA",
      "duration": "3-1/2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f61",
      "summary": "Ball of fire streaks eastward over Phila., lands in Atlantic Ocean one mile from Resorts Intl.. ((NUFORC Note:  Meteor??  PD))",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2008-02-14T00:00:00",
      "story": "Ball of fire streaks eastward over Philadelpia, lands in Atlantic Ocean one mile from Resorts International right after Grand Opening Was on the corner of 6th and Reed in Philadelphia, with my uncle ((name deleted)) and neighbor ((2nd name deleted)), both now deceased. At about 8 P.M. on or about May 29th, right after the Grand Opening of Resorts International, In Atlantic City, New Jersey.  Was standing looking south on 6th Street,in Philadelphia, when this fireball streaked eastwardly,not more than a block from where I was standing at a height of less than a thousand feet. This fireball was huge, it changed colors faster than my mind could register from yellow to orange to green to blue but not in any special order and like I said it changed colors so fast I couldn't tell.  The next day in the Philadelphia Inquirer there was a report of the ball of fire landing in the Atlantic Ocean one mile off of where Resorts International is.  Which is about 47 miles from where I originally witnessed the ball of light. ((NUFORC Note:  Possible meteor.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61259.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6351",
      "summary": "V-shaped craft with 3 big, round, green lights",
      "city": "philadelphia",
      "shape": "chevron",
      "date": "2008-06-12T00:00:00",
      "story": "V-shaped craft with 3 big, round, green lights right after i was making a joke about aliens, in the corner of my eye, i seen some light outside my window.  I looked over and seen a Chevron shaped craft with 3 big, round, green lights that were very bright.  i rolled my computer chair back to my wall in fear and eventually pulled my blind down.  it looked like it was headed right for my window and i bet nobody else seen it outside. only a few seconds and was very quiet.",
      "link": "http://www.nuforc.org/webreports/063/S63234.html",
      "state": "PA",
      "duration": "few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6368",
      "summary": "10/26/07..Philadelphia.Pa..Oval..Silvery..about 200' long, in the Eastern Sky..",
      "city": "philadelphia",
      "shape": "oval",
      "date": "2007-11-28T00:00:00",
      "story": "10/26/07..Philadelphia.Pa..Oval..Silvery..about 200' long, in the Eastern Sky.. I was taking some Photos with my digital for an Appraisal Consideration.of a  house...when some children, playing, pointed to the sky and  yelled,,,Look At That..( I did'nt get their names).The kids ran to the next street...trying to follow it....I began to photograph the image...took seven digital shots of it,,,very clear..I would guess that it was about 5000 feet up...as high as a Plane getting ready to land..it was going rather slow..and made no noise...it took about a minute for it to travel about 30 degrees across the sky..I then lost track of it due to trees and houses..I did nothing with this,,because I want the right people to use this,,,Not Cover Up Artist....Photo's dont lie..I would guess that its the size of a medium sized plane,,,just a guess",
      "link": "http://www.nuforc.org/webreports/059/S59468.html",
      "state": "PA",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6789",
      "summary": "Object(s) over Philadelphia",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "Object(s) over Philadelphia Tuesday, March 13th, 2007 at 9:12 PM over Philadelphia, PA.  It was a clear night with access to a dark part of the sky, even with the brightness of the city.  For about 20 seconds traveling in a completely straight line from south to north was a triangular formation of 5 or 6 dull, white, circles.  I noticed them directly overhead and watched until they disappeared in the distance, going out of view.  They didn’t blink, fluctuate in light intendity or have any noise whatsoever.  I constantly see jets fly over heading to Phila. International Airport in one direction, and jets at a higher altitude heading in the opposite direction (going to Lehigh International Airport?).  These spots seemed to be much higher and moving much faster.  There were actually two jets moving within eyesight at the same time, leading me to believe these spots were higher and faster.",
      "link": "http://www.nuforc.org/webreports/055/S55723.html",
      "state": "PA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b69d4",
      "summary": "witnessed a bright green sphere and the colors was moving in motion",
      "city": "philadelphia",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "witnessed a bright green sphere and the colors was moving in motion ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  We do not know if this is intended to be a serious report.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61763.html",
      "state": "PA",
      "duration": "6 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b20",
      "summary": "I observed a triangular craft that had three bright white lights on each tip and a large red light in the center.  it was very close an",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "I observed a triangular craft that had three bright white lights on each tip and a large red light in the center.  it was very close and traveled moderately slowly.  It was headed in a southerly direction and then circled around and went in a northern direction.  As it traveled,the white light at the forward tip blinked out.  I have experienced many sightings but never one this close.  I sky watch as often as I can. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55803.html",
      "state": "PA",
      "duration": "About 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b0b",
      "summary": "3 lights in the sky",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "I was home alone and looked out the window to see if it was raining and i saw 3 lights in the sky really near the clouds, going above the clouds at times. They were flying in circles, not sure if it was 1 object changing lights or three different ones but probably 3. After about 10 minutes I only saw 2 spot lights in the clouds. Freaky!I'm never gonna forget this, BTW it didn't make any noise. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54608.html",
      "state": "PA",
      "duration": "5-10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6cb1",
      "summary": "MY WIFE AND I WAS ON OUR WAY TO OUR SON'S HOME WE WERE WALKING FROM THE CAR TO THE APARTMENT BUILDING AND ABOVE THE TREES IN FRONT OF U",
      "city": "philadelphia",
      "shape": "rectangle",
      "date": "2006-07-16T00:00:00",
      "story": "MY WIFE AND I WAS ON OUR WAY TO OUR SON'S HOME WE WERE WALKING FROM THE CAR TO THE APARTMENT BUILDING AND ABOVE THE TREES IN FRONT OF US WHAT AT FIRST LOOK LIKE A SMALE AIRPLANE BUT I NOTICE HAD NO SOUND WITH TWO LIGHTS ON THE OUTSIDE OF THE CRAFT AND A BIG PICTURE WINDOW LIKE A CAR ALMOST, THE CLOSER IT GOT YOU COULD SEE TWO BEING ON EACH SIDE OF THE CRAFT I SAID TO MY WIFE \"HAVE YOU EVERY SEEN A UFO BEFORE SHE ANSWER NO \" I POINTED TO THE TREE TOP SHE BRUSH OFF THE SIGHTING AND DID NOT WANT TO LOOK AS I LOOK ON THE BEINGS LOOK AT EACH OTHER THEN THE CRAFT THEN MOVE OFF (IN MY OPINION I HAD RESPONED TO AN ARTICLE ON THE NET ABOUT PLANT CHANGES I GOT AN E-MAIL IN RETURN THANKING ME FROM MY OPINION BUT THE STRANG THING WAS THERE WAS, THE PERSON WAS VERY SMART BUT COULD NOT TYPE SOON AFTER I SEEN UFO. I HAD SEEN UFO'S BEFORE BUT NOW FOR SOME RESON I'M SEEING A LOT MORE OF THEM WHAT WITH PHILADELPHIA I SEEN MORE HERE THEN IN A COUNTRY SETING WERE I HAD LIVE BEFORE ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50750.html",
      "state": "PA",
      "duration": "45SEC"
    },
    {
      "_id": "64d005f478aba2ec5a3b6dee",
      "summary": "Ar around 12:45pm, I heard the loudest noise in my entire life.  The noise was so strong it shook my windows.  Upon hearing it I went o",
      "city": "philadelphia",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "Ar around 12:45pm, I heard the loudest noise in my entire life.  The noise was so strong it shook my windows.   Upon hearing it I went outside to see if everything was okay, I live near the Philadelphia airport as I looked up to the sky, the direction would be the incoming flight path for planes coming in for landing) I saw a black, oblong object spiraling almost twirling downwards towards the airport.  It's cloudy out today, but I saw the object in clear view.  I saw no smoke or flames, at 12:50pm I saw three double-blade black helicopters fly in the same direction as this object.   I called the airport emergency line at 215-937-3111 and asked asked them if they had any recent air distress calls, the male stated no, I told him what I saw and he put me on hold he came back a minute later said he can't confirm any of the information and that if I wanted I could make a noise complaint.   I have never heard nor seen anything like this in my life, I would love to know if you get any other reports.",
      "link": "http://www.nuforc.org/webreports/052/S52496.html",
      "state": "PA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6eb7",
      "summary": "A triangular craft flew from east to west.The craft had bright white lights and one red light and was flying very low.There was no soun",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2008-01-21T00:00:00",
      "story": "A triangular craft flew from east to west.The craft had bright white lights and one red light and was flying very low.There was no sound made by the craft as it flew overhead.I have lived near a airport for over 45 years and have never seen a airplane that looked like this.",
      "link": "http://www.nuforc.org/webreports/060/S60748.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6faa",
      "summary": "Bright green light streaked quickly across the Philadelphia sky very early in the morning.",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2007-04-27T00:00:00",
      "story": "Bright green light streaked quickly across the Philadelphia sky very early in the morning. Me and my father were getting settled into the van early in the morning as he was getting ready to drive me to the hospital.  I was looking ahead out of the van window, and he was taking the club off the wheel when I saw a bright green light streak across the sky.   My father exclaimed, \"Did you see that?\"  It shot diagonally across the sky.   I would have thought that it was a firecracker of some sort, but it was very early in the morning.  It was still dark outside, but it was also very quiet.  If there would have been a noise, I believe it would have carried.   It also didn't leave a trail of smoke the way a firecracker does, and it was very quick.  It was there and then it was gone.",
      "link": "http://www.nuforc.org/webreports/056/S56246.html",
      "state": "PA",
      "duration": "a few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b710d",
      "summary": "Large green light traveling at rapid speed across the sky over Philadelphia, PA.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2008-02-14T00:00:00",
      "story": "Large green light traveling at rapid speed across the sky over Philadelphia, PA. I was driving over the Walt Whitman Bridge heading east and all of a sudden I saw a large bright green light travel across the sky heading north-east. Because I am not positive of the size of the craft, it is difficult to say exactly how high in the sky it was; but I would say it was approximately 15,000 feet up. The craft flew over in a path which seemed parallel to the earth, which lead me to believe that it wasn’t any kind of meteor. This certainly wasn’t a glare either…something traveled across the sky at a significantly rapid speed and then disappeared. Whatever it was, it was very large; the green light shone like a sunburst and was quite larger than any of the other lights seen on nearby aircraft.",
      "link": "http://www.nuforc.org/webreports/061/S61449.html",
      "state": "PA",
      "duration": "1.2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b77da",
      "summary": "cluster of lights in good formation traveling high in the sky over South Philadelphia, Pa..  ((NUFORC Note:  Possible hoax??  PD))",
      "city": "philadelphia",
      "shape": "formation",
      "date": "2006-12-07T00:00:00",
      "story": "cluster of lights in good formation traveling high in the sky over South Philadelphia, Pa. above 10th and bigler playground on the night of november 16, 1906 as i was sitting on the bleachers in the park at 10th and bigler streets in South Philadelphia, Pa. and as i lifted my head up in personnal prayer i was distracted momentarily by a bright cluster of lights in the sky above the clouds very high in the air. at first i thought it might be a plane but there were too many lights well formed in the shape of maybe a chevron moving very fast like in and out of the clouds but again very high in the sky. on second look i thought they might be a flock of birds migrating south for the formation was traveling in a southwesterly direction. however on second thought birds don't give off light. these were lights, well formed and bright like stars. i watched them soar through the clouds and finally dissapear from my sight. there were other planes in the area at the time but at a much lower altitude. i watched the skies many times at night time this event really caught my eye and my strict attention. i believe i saw something extraordinary and i have been talking about it since. i even waited to hear about someone reporting on the news or newspapers, but to no avail. hoping to hear something. until then i will keep watching. ((NUFORC Note:  Witness fails to provide e-address.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53622.html",
      "state": "PA",
      "duration": "5 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b61",
      "summary": "brilliant red oval object viewed from Port richmond Philadelphia",
      "city": "philadelphia",
      "shape": "oval",
      "date": "2006-10-30T00:00:00",
      "story": "brilliant red oval object viewed from Port richmond Philadelphia Object was flying low thru Fishtown area of philadelphia, followed to delaware river where object had already crossed into New Jersey. Object was oval in shape , brilliant red in color with blueish smaller lights above and below on the perimeter of object. Was being followed and or chased by  helicopters and small planes were circling object at a distance. once out of sight from ground , traveled onto Interstate 95 which runs parallel to river and elevated above ground level. Cars traveling North and south were slowing down to view object.",
      "link": "http://www.nuforc.org/webreports/052/S52922.html",
      "state": "PA",
      "duration": "30minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e09",
      "summary": "saucers in a line over Phila Pa.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "",
      "story": "saucers in a line over Phila Pa. I was walking northbound on the 2500 block of So. Beulah st. coming home from a violin lesson when i looked up and saw 7 or more round yellowish objects flying in line (tandem).  I was about 9 or ten years old.  The craft were flying from east and going west.  They were less than a mile high.  I ran inside to tell my parents and they said ohh it is probally truck mirror reflections. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71960.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ecf",
      "summary": "H-Shaped object seen hovering just above the tree line above the park behind our home.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "H-Shaped object seen hovering just above the tree line above the park behind our home. While reviewing the reports filed @ NUFORC for PA, I saw that in June 2009 there was the report of a \"H-shaped\" object filed that was seen near Pittsburgh.  My wife saw the same craft just last year but in Philadelphia. My wife was on her way home from work @ 23:45 and while she was stopped at a stop sign she noticed the craft in the sky hovering just above the tree line above the park behind our home.  The craft looked like a \"Tie-Fighter\" from Star Wars with 4 white lights on the near side & at least 2 white lights on the far side of the craft with a red light in the middle of the craft.  She lost sight of the craft behind some large trees.   When she got home several moments later she came out on our deck & asked me if the Police Helicopter was hovering in the area scoping out the park & I said about 45 minutes ago, but not lately.  My wife proceeded to tell me what she saw since I am a MUFON Field Investigator to see what my take was.  We proceeded to drive @ the neighborhood retracing her footsteps and to see if it could have been lights reflecting off her windshield and came up with nothing.",
      "link": "http://www.nuforc.org/webreports/072/S72657.html",
      "state": "PA",
      "duration": "1 to 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b81aa",
      "summary": "Oval shaped moon colored object that darts in and out of the clouds above my house,",
      "city": "philadelphia",
      "shape": "oval",
      "date": "2009-01-10T00:00:00",
      "story": "Oval shaped moon colored object that darts in and out of the clouds above my house, The object resembled the color of the moon.  It did not look like it lights on it. It flew back and forth, in and out of the clouds in a very rapid motion. At times, it seemed to stop and hover in a certain spot as if it were surveying a particular part of the sky. Then after a few seconds, it would zoom back and forth between the clouds again. This date was my first sighting. I am still seeing this unidentifiable object. I saw it again this morning in the same location. However, the time that I saw it this morning was much later than previous times. It was about 1 AM this morning. This is definitely not an airplane search light, flashlight, taser or anything of that nature. I fully well know the difference. I watch the skies often, and I've never seen anything like this before. I do find the experience quite exciting.",
      "link": "http://www.nuforc.org/webreports/066/S66637.html",
      "state": "PA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b828e",
      "summary": "Dense white unusual and persisten contrail with reddish fireball at tip resembled spacecraft reentry.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Dense white unusual and persisten contrail with reddish fireball at tip resembled spacecraft reentry. My wife and I were walking near the intersection of Second and Bainbridge streets in Philadelphia on a clear, cloudless late afternoon when I noticed a very dense and unusual contrail appearing above buildings to the SE, moving on a heading more or less parallel to the Delaware River, which runs ~SSW to NNE at that point.   The contrail seemed much wider and denser than a normal contrail, and had no gap in the center as is typical of normal airliner trails.  It was moving at about the normal speed of a high-altitude jet or perhaps somewhat faster, and seemed to be at the height of a normal jet at cruising altitude, but possibly higher - very hard to tell with no reference points.   At the head of the trail was a small but very obvious fiery reddish ball.  It may have been the reflection of the late-afternoon sun on a plane, but I've seen many, many airliners under these conditions and this looked different.  It twinkled and at no time did it appear to change intensity.  Usually a strong sun glint on an airliner will vary as the reflection angle changed, but this didn't.  It looked exactly like a giant reddish road flare making a dense smoke trail heading more or less toward northern New Jersey.   I say giant because of the size of the trail.  It is impossible to estimate the size of the object but it appeared comparable to the size of Venus or Saturn when they're at their largest and most visible.  A twinkling, starlike reddish road flare with an immense and persistent white smoke trail.  It was unusual enough that we stopped to watch it until it disappeared behind buildings.  It didn't change speed, heading, altitude or intensity, and the motion was very steady.  The smoke trail remained for at least several minutes.  My thought at the time was that it was a reentry of some satellite, or an unusual meteor.   I recall that there were some unusual meteor incidents in the time frame, but this was not the same as this one, for example: http://archives.cnn.com/2001/US/07/23/flash.boom/index.html http://www.meteorobs.org/maillist/msg22061.html  It was shortly before 9/11, if I recall correctly. There were no other contrails visible at the time, by the way. This was the most obvious thing in the sky. ((NUFORC Note:  Source indicates that the date of the sighting is approximate.  We are quite familiar with the individual who submitted the report, and we deem him to be an exceptionally capable, and reliable, witness.  Date is approximate, and may be amended, in the future.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67901.html",
      "state": "PA",
      "duration": "appx 5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b833f",
      "summary": "What did I see, a shooting star or is it something that moves faster then a plane!",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "What did I see, a shooting star or is it something that moves faster then a plane! I was sitting out side having a smoke and I was looking at the stars now. I am not one to believe in other life forms but the star shook and dashed away as if it was a bullet.. zoom it took off and its to far to see anything because I am on earth but looking up and seeing that really bright star move so fast makes me think again what was it really.",
      "link": "http://www.nuforc.org/webreports/072/S72555.html",
      "state": "PA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b83c6",
      "summary": "Kings Dominion Circle, seen at night five years ago",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "Kings Dominion Circle, seen at night five years ago This report is being resent since it pertains to the recent sighting in Virginia, Kings Dominion getting much attention now.   It was night and I witnessed small orbs of light moving like ballons up into the sky. Maybe twenty or thirty.  When they reached a point almost directly above my house, they formed a perfect circle, exactly like the one seen on the Kings Dominion video.  They hovered and spun like this for a few seconds before breaking up and moving off to the east.  This episode then repeated two more times with craft coming from the west and moving off to the east.",
      "link": "http://www.nuforc.org/webreports/070/S70563.html",
      "state": "PA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8670",
      "summary": "2 stars moving together separated by a distance of about 8 inches.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "2 stars moving together separated by a distance of about 8 inches. I was outside with my neighbor drinking beer in my yard. I saw Venus and several stars. Two of the stars I saw were moving together very slowly. The only reason I noticed this was because I saw them through the branches of a tree in my yard and watched them get blocked out by the bare limbs. I brought what I saw to my neighbors attention and he too couldn't explain it. It looked like one bright star and one dimmer start moving with it. It was the weirdest thing I have ever seen, but I didn't see any structure at all. It seemed to be higher than the thin clouds that were forming and we were able to watch it for about a full minute before they both vanished. Is there a place I can report this and also check to see if anyone else saw it? By the way, I live near 5th St. and Cheltenham Ave.",
      "link": "http://www.nuforc.org/webreports/067/S67956.html",
      "state": "PA",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a08",
      "summary": "Silver Object over Philadelphia airport",
      "city": "philadelphia",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "Silver Object over Philadelphia airport The Object was a silver round object that was hovering slowly.  It had a bright reflection coming off the sun",
      "link": "http://www.nuforc.org/webreports/065/S65503.html",
      "state": "PA",
      "duration": "20-30secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b4f",
      "summary": "UFO seen during June 27th fireworks at Penn's Landing",
      "city": "philadelphia",
      "shape": "formation",
      "date": "2009-08-05T00:00:00",
      "story": "UFO seen during June 27th fireworks at Penn's Landing During the June 27th fireworks at Penn’s Landing in Philly, my entire family consisting of four people including myself, witnessed an aircraft flying right by the fireworks until it was behind a building where it disappeared.  The craft was unlike an airplane because it had three lights which if you connected with a line would make a triangle.  In addition they were not blinking lights.  It’s hard to say whether the lights were from a single craft or three separate ones. Other members of my family dismissed it as an airplane or helicopter, but I don’t think one would fly right into the fireworks.  Perhaps, I am wrong and the aircraft was very far away and merely looked like it was in the fireworks but that still does not explain its unusual appearance and its abrupt disappearance. I don’t know if anyone else saw it, but someone else should have because there were tons and I mean tons of people out on the waterfront on both the Philly and Camden sides.",
      "link": "http://www.nuforc.org/webreports/070/S70974.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8df4",
      "summary": "dark gray object over the city of Philadelphia for 2 minuets",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "2009-08-05T00:00:00",
      "story": "On 7-4-2009 I observed a dark gray object over the city of Philadelphia for 2 minuets between 2:56am to 2:58am.  It was very high traveling from north to south  directly overhead and had no sound.  It had 2 lights, one on each wing that were not blinking and as bright as the stars around them.  The object blocked out the stars as it moved and you could just make out its silhouetted in the dark blue of the skies background.  It was elongated (Cigar shaped) with a bulge in the middle.  At arm's length it was the length of my thumb.  Just before I lost sight of it I observed it tilt up and it quickly faded into the darkness of the sky. In my opinion it was very large but I can’t give an estimate of its size or its distance.  I am 50 years old, I have been star gazing all of my life and have never seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/070/S70847.html",
      "state": "PA",
      "duration": "2 minuets"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f64",
      "summary": "The object is clearly visible  moving across many pictures taken from a stationary camera on a tripod.",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "2009-08-05T00:00:00",
      "story": "The object is clearly visible  moving across many pictures taken from a stationary camera on a tripod. While attending the 4th of July celebration and fireworks display in Philadelphia, Pennsylvania, From around 10:02PM to 10:22PM ET, I took many rapid fire photos of the fireworks display.  The camera was on a tripod and the shutter was released via remote.  Upon reviewing the photos, I noticed a long thin object with lights moving from right to left across many of the photos.  The camera was on a slow shutter setting to record the trails of lights from the fireworks and although the fireworks are streaking, the object is not creating streaks or trails. The lights on the object are clearly defined separately.  I was watching the fireworks live as they happened while only occassionally glancing at the display on the camera.  I never saw anything at all with my naked eye.  I have many photos with no objects in them, yet I have many series of photos with the object moving across the landscape.  I also have many photos of the same landscape taken during daylight hours which reveals no explanation for these objects and lights.  I have sent 2 photos to the director of the ufo reporting center for his examination.  The 2 photos are from a series of 6 shots taken at 10:08PM that show the object moving across the landscape.",
      "link": "http://www.nuforc.org/webreports/070/S70879.html",
      "state": "PA",
      "duration": "18 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b91a1",
      "summary": "moving light.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "moving light. Tonight while outside on the street I looked to the sky and saw what appeared to be a moving star.  At first I thought that this might be a satellite, since I have witnessed this before.  What set apart this sighting was the fact that the light did not follow a elipitcal flight path across the night sky.  This light followed what would be considered a normal flight path of a plane close to the horizon.  The light was not a airplane since no strobes were observed, and the light maintained a constant level even as it moved away from us.  The speed was constant and no erratic turns were observed.",
      "link": "http://www.nuforc.org/webreports/070/S70955.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9727",
      "summary": "I think it's important that Air Traffice from the Airport seem to stop during the display.",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2010-05-12T00:00:00",
      "story": "I think it's important that Air Traffice from the Airport seem to stop during the display. This was relayed to me, today, by my brother, who lives a couple of miles from the Phila Intn. Airport.  During the sighting, air traffic seem to  cease. He said the objects, triangle shaped,  seem to circle one another and had pulsing lights. There was no sound. They finally got a camera (evidently a small one and took a short video) I viewed the video on Youtube and it is not very good. He did say that his daughter then took a still photo with the flash on and that one of the objects flashed back. My brother, has lived in this house, near the airport, since his birth and stated that these were not any aircraft he had seen before, except for a similar sighting a year or two ago. He did call some of the local news stations. If you want to talk to my brother or one of the other witnesses, please email me, and I will forward your request. Video Link: http://www.youtube.com/watch?v=jVVnAJG9_kA&feature=player_embedded",
      "link": "http://www.nuforc.org/webreports/075/S75139.html",
      "state": "PA",
      "duration": "Approx.3 Hrs."
    },
    {
      "_id": "64d005f478aba2ec5a3b982b",
      "summary": "6 Light craft saw near art museum in philly.",
      "city": "philadelphia",
      "shape": "rectangle",
      "date": "2009-05-12T00:00:00",
      "story": "6 Light craft saw near art museum in philly. I was driving on the road leaving from philly, from the art muuseum. Driving along the river were people practice boating. Saw a craft with maybe 6 lights? (looked like search lights kinda real big) Fly slowly over the car, a few hundred feet up. Then over the hills to my left. No noise. In the afternoon. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69748.html",
      "state": "PA",
      "duration": "1 1/2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b984a",
      "summary": "3 disk shaped object's hovering over my house on may 16th 2010",
      "city": "philadelphia",
      "shape": "disk",
      "date": "2010-06-03T00:00:00",
      "story": "3 disk shaped object's hovering over my house on may 16th 2010 i live here in philadelphia PA and yesterday sunday night around 9:35pm i was in my back yard smoking a ciggarete..is was a very clear night i was watching some kids play basketball in the court's..i looked up an had noticed 3 disk shaped objects skimming just under the cloud line...these were not balloons or helecopter or an air plane...these 3 object's had no sound and were very precise in the movment..i called my sister to come out back to see what im seeing and they flew away.. how ever i did see all 3 objects very clear an the underneath of all 3 but am sorry to say i did not have enough time to grab a camera and my phone does not have a camera on it...they were very disk shaped objects with a white glow and underneath of all 3 i noticed they all had this same fadeded black aroura i guess where the engine would be or where it would give the craft its lift..i dont know how to contact you guys but this is what i saw on sunday at 9:35pm on may 16th 2010",
      "link": "http://www.nuforc.org/webreports/075/S75446.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9893",
      "summary": "Double set of pinpoint red/orange steady lights viewed at 200 feet distance, definitely craft.",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2008-08-12T00:00:00",
      "story": "Double set of pinpoint red/orange steady lights viewed at 200 feet distance, definitely craft. At 10 PM, I noticed an unusually bright, low altitude, slow moving light over New Jersey (I live near the Delaware River and my apartment looks towards NJ). I thought at first that it must be a plane, but as it got closer, I noticed it wasn't blinking.This is when it gets scary.It got close; about 200 feet away vertically; I saw clearly double row of red/orange lights; they were spaced apart at regular intervals; three on one side, and three on the other, with a secondary set above that; craft was clearly visible! It moved very slowly, maybe 10 mph. It continued it's straight line motion continuing west. In terms of city blocks, it was just one block northward.These lights never blinked. I have been trying to get confirmation from Atlantic City International and Northeast Philadelphia Airport, but noone noticed anything.",
      "link": "http://www.nuforc.org/webreports/064/S64605.html",
      "state": "PA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9919",
      "summary": "Pink Chevron trailed by two smaller craft",
      "city": "philadelphia",
      "shape": "chevron",
      "date": "2009-08-05T00:00:00",
      "story": "Pink Chevron trailed by two smaller craft Flying from the northwest to the southeast at possibly 10,000 feet, a large triangular or chevron shaped craft with hazy pinkish colored lights, hard to define, moved across the sky at a slow-medium speed with no noise.  This craft was trailed by two smaller craft which appeared as two pinpoints of light, possibly flying higher than the first.  None of the craft made any noise.  The event lasted maybe thirty seconds and three people witnessed it.",
      "link": "http://www.nuforc.org/webreports/071/S71166.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ab7",
      "summary": "the color of lights cannot be duplicated for a reason i cannot pinpoint. STRANGE",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "the color of lights cannot be duplicated for a reason i cannot pinpoint. STRANGE this is the second time in a 4 month period that i observed this exciting event. oddly enough both times were heavy overcast with very light rain and late in evening while walking dogs in a local state  park that is densely wooded. the dogs were even aware of the ufo hovering above us. at first it appeared as if it was only about 100 feet above us. at first i counted 4 lights giving it the shape of a triangle with the forht one in the center. the ufo had no sound yet my ears felt like they were ready to pop like when reaching a high altitude. the dogs felt discomfort as well. i never seen them lay down and cover their eyes. VERY STRANGE.my body had a feeling of extreme pressure in my chest as well. the lights were dim as if only emitting 50 watts and were like a yellow/orange with a pulsating look. i have never seen anything quite like this before. the odd part at the end of the sighting was both objects seem to have colided with each other to become one and then took off at the most incredable speed in one direction, only to stop after reaching a distance of about 200 feet and then coming back as if to get another look at us and then vanished.",
      "link": "http://www.nuforc.org/webreports/068/S68791.html",
      "state": "PA",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba133",
      "summary": "Flying Red Lights",
      "city": "philadelphia",
      "shape": "other",
      "date": "2010-02-14T00:00:00",
      "story": "Flying Red Lights Fast, Silent, Low Flying all Red Lights! Blinking, Flashing Bright red lights moving very quickly to the western direction. I did not hear any sound made at all from this flying abject. To me,  it did looked like a Flying Boomerang, fast, silent, and flying very low about 60 fl. up.  About 10 seconds, before it disappeared from my view looking to the West, at 10:50 PM Sunday February 7, 2010.  It did not looked like a Hellocopter or Plane! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74340.html",
      "state": "PA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba4b9",
      "summary": "Large ball of bright light shot overhead and disappeared over the trees on the distant horizon.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Large ball of bright light shot overhead and disappeared over the trees on the distant horizon. My friend and I were driving south on I-95 when a single bright light appeared in the sky above. Traveling parallel to the freeway, it shot across the sky from north to south, passing over us and the highway traffic at an indeterminate altitude. It was traveling at a rate too fast for any aircraft to be moving, going from directly above us to disappearing over the trees on the horizon in a matter of seconds. The object was a single ball of bright white light. It was not a vague bright spot in the night sky like a comet or a meteorite; it was bright like search light. Yet unlike an aircraft it cut across the sky at an impossibly fast speed before disappearing from view. There was no sonic boom, which I was expecting as a result of its extremely fast rate of movement.",
      "link": "http://www.nuforc.org/webreports/066/S66444.html",
      "state": "MD",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba70e",
      "summary": "It was a strange light that was followed by a mysterious noise.",
      "city": "philadelphia",
      "shape": "",
      "date": "2009-01-10T00:00:00",
      "story": "It was a strange light that was followed by a mysterious noise. On January 7th 2009 at approximately 12:45 A.M. (Eastern Standard Time) I was sitting in my bedroom at my computer desk working on a music project.  There is a window about 2 feet to the left side of my desk which I tend to glance out occasionally.   When I looked out the window I saw a flash of blue, which I initially thought was lightning.  Then It appeared to be getting closer and closer.  About 3-4 seconds later the light fully consumed my bedroom window and my whole room was lit up by this light.  I quickly jumped out of my chair and ran into the hallway, closing my bedroom door behind me.  Even when I closed the door and looked back the light had not subsided.  As far as I know the light was there for about 5-10 seconds.   I have seen my share of power lines going down and transformers exploding, but they flash and go out.  This was different than anything I have ever seen. After leaving my room, I immediately went to knock on my sisters door. She came out of her room in a panicked state and said, \"Did you hear that?\" We both ran downstairs into our moms bedroom and called 911. My sister then explained to me that the sound she heard was like a compressed boom, almost like a shockwave. As a side note I would like to add that 2 nights prior to this occurrence I looked out my window up into the sky and saw a bright light which was flashing red, green and blue. At first I thought it was a plane or a helicopter, but then I realized that the object was not moving. It was not a star and there is no way a helicopter could reach those kinds of elevations. I went to grab my camera which was on my desk and not even 5 seconds later the object was gone. From my window I have a really good view of the nights sky and there is no way a helicopter or plane could have disappeared from sight that quickly. ((name deleted)) Philadelphia, PA ((NUFORC Note:  We spoke with this witness via telephone, and we found him to be quite serious-minded and credible.  We strongly suspect that this is a very accurate report.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67902.html",
      "state": "",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba83d",
      "summary": "lastnite i saw a cylinder in the sky orange in color no tail  06/29/08",
      "city": "philadelphia",
      "shape": "cylinder",
      "date": "2008-07-05T00:00:00",
      "story": "lastnite i saw a cylinder in the sky orange in color no tail  06/29/08 last nite at 12:10 i saw something.It was a cylinder in shape it was not spinning just going across the sky .It took about 10 seconds to go across the sky.It was NOT AN AIRCRAFT i have worked at phila international airport fo over 10 years i know airplanes.Please did anybody ealse see it ?",
      "link": "http://www.nuforc.org/webreports/064/S64190.html",
      "state": "PA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba95b",
      "summary": "Clear plastic housing and white lights  made from another world seen in city at 300-350 foot distance",
      "city": "philadelphia",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Clear plastic housing and white lights  made from another world seen in city at 300-350 foot distance I noticed over New Jersey from the Pennsylvania side a bright white light.  Later, as it got closer to me, I couls see that it was actually several lights; they appeared as three \"headlight-type\" amber lights; it was still over the New Jersey farmlans but moving slow at an altitude of 100 to 150 feet.  Then to my complete surprise, the thing made itself known as it flew at rooftop level over the houses of Philadelphia just one small block north of my location; it was in the shape of a boomarang with six white lights , three under each segment.  It was not very thick maybe 10 or 15 feet. Ieasily make out the plastic housing for each light as well as the gray superstructure of the craft; it was dusk with just enough light to make out detail. It moved out of range by the time I had my camcorder in-hand.",
      "link": "http://www.nuforc.org/webreports/077/S77643.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bae7f",
      "summary": "Boomerang-shaped UFO sighted over Philadelphia at dusk",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2010-08-24T00:00:00",
      "story": "Boomerang-shaped UFO sighted over Philadelphia at dusk First I noticed one bright solid amber light approaching from New Jersey (I'd seen it before).  Then, as it got closer, I saw three triangular lights moving synchronously.   Then, after it crossed the Delaware River, I saw CLEARLY six white lights(three on each segment of the wing) attached to the bottom of a V shaped craft, moving very slowly, at almost rooftop level, only one block from my top floor apartment's location.   It made no sound; there was no electrical interference of any kind, the height of the object was small (@10 feet); defenitely not capable of carrying a crew; I got the impression it was a reconnaissance probe taking video of the city that passed underneath it.   Unfortunately I didn't have my Sony Handycam in-hand or I'd have the video to prove this sighting to you.   Also, you should know that this came one month after I observed a parabolic-shaped craft on April 13, 2008, and was reported to MUFON later.",
      "link": "http://www.nuforc.org/webreports/076/S76880.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5cc",
      "summary": "It started off with 1 light standing very still, afterwards it went to the west direction and came back with another light now it is 2",
      "city": "philadelphia",
      "shape": "light",
      "date": "2011-01-31T00:00:00",
      "story": "It started off with 1 light standing very still, afterwards it went to the west direction and came back with another light now it is 2 of them. I did not notice 1 of them that was strait in front of me untill it started going up on a slant and then it went so fast i could not keep up with it. the other 2 lights started following it but with a distance and then they shut of the lights and only blue, red, and a white light flashed from them ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79804.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb8c6",
      "summary": "Bright light in sky seen in Philadelphia.  ((NUFORC Note:  Possible sighting of Venus.  PD))",
      "city": "philadelphia",
      "shape": "light",
      "date": "2010-07-19T00:00:00",
      "story": "Bright light in sky seen in Philadelphia My wife & I were sitting out back in our yard as we also try to do.  We were sitting in our chairs facing south.  To the south/southwest she noticed a big shing light.  At first we thought it might be a satelite, but after further inspection, there is no way it's a satellite.  It was not a helicopter or plane either. We noticed numerour helicopters going to the area it was in, one at a time.  I do not know if they could see it.  We took pictures & a short video (a little dark though).  It was a pretty good night to see the stars, but this light was not nearly high enough to be a star.  Plus it had a cleary visible haze around it.  I would be suprised if no one reports this.......it was THAT noticable & unusual.  I do not know if it was \"alien\", but it is definately \"unidentifiable\" to me, making it a U.F.O. for just that reason. C- ((NUFORC Note:  Possible sighting of Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76444.html",
      "state": "PA",
      "duration": "30 minutes or so"
    },
    {
      "_id": "64d005f478aba2ec5a3bbae5",
      "summary": "Four solid red lights sighted north of Philadelphia moving south in no particular formation disappeared one by one.",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2010-07-06T00:00:00",
      "story": "Four solid red lights sighted north of Philadelphia moving south in no particular formation disappeared one by one. I was sitting on my roof when I saw four red lights in the western distance.  I was looking west over the Schuylkill River. The objects were flying south, possibly southwest.  At first I thought they were incoming planes (like when you see a row of planes following the same flight path) but there was no blinking light, only a solid red light for each object with no discernable flight pattern.  The objects were in no particular formation, they were randomly staggered to describe it best.  From my view they approached from the north making their way into my view from my building which blocked that part of the sky.  They were approaching my next visual obstacle, a tree, when one light seemed to disappear in the distance as if it went straight into the sky or due west away from me.  The other three lights then passed behind the tree.   I waited for them to reappear, but only one came out on the other side and then it too disappeared.",
      "link": "http://www.nuforc.org/webreports/076/S76046.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbdd",
      "summary": "Did this sighting have anything to do with my husbands illness?",
      "city": "philadelphia",
      "shape": "egg",
      "date": "2011-10-10T00:00:00",
      "story": "Did this sighting have anything to do with my husbands illness? the first week of October, 2008, my son, my husband and myself were sitting in my living room at about 8:00 pm.  We had sliding glass doors out of our living room that went directly into our backyard.   Suddenly our yard was filled with a bright bluish white light that got the attention of my son and myself.  When we looked out the door, a glowing egg shaped craft, that could only have held one or two beings, was gliding silently through our yard.   We live in the city so we do not have a huge yard.  After it passed out doors, I ran to the front winidow to see where it would go....but it never came out from between the houses, which leads me to believe it took off after we saw it.  Strange to me was the fact that although he was sitting with us...my husband did not see the craft.   Without listening to each others account, my son and I gave a description of what we saw to my husband.  We both saw the same thing.  I am an armed security guard at Independence Hall and have been trained to observe and report things that I see.  I dont think 2 of us could be crazy at the sametime.   Why didn't my husband see it?  I have no idea! The reason I've decided to report this now is that about 2 weeks after the sighting, on Oct. 14,2008, my husband was hospitalized with a very rare brain fungal infection.  His doctors had no idea how he  contracted it...as it appeared nowhere else in his body, as it normally should.   He was in a coma for 2 months before they could figure out how to treat it.  My husband died this past August due to this infection.  I cant help but wonder if this sighting, that he said he didn't see, had anything to do with it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84438.html",
      "state": "PA",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc167",
      "summary": "Bright oval shaped object seen in the skies over downtown Philadelphia, made a quick hook in the sky and disappeared.",
      "city": "philadelphia",
      "shape": "oval",
      "date": "2011-10-10T00:00:00",
      "story": "Bright oval shaped object seen in the skies over downtown Philadelphia, made a quick hook in the sky and disappeared. We were on my friend's rooftop deck in Philadelphia, PA, and I suddenly hear my friend say, \"Is anyone looking at this right now?\"   I quickly turn around, and look into the sky and see a bright, white oval shaped object getting brighter as it looked like it was coming closer to us.  As my friend and I observed it for a total of about 3 seconds, the object made a quick hook in the sky and disappeared.",
      "link": "http://www.nuforc.org/webreports/083/S83995.html",
      "state": "PA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2f3",
      "summary": "I videoed on my cell Phone little flashing blue lights for about 5 minutes. Also, the entire night sky would flash blue.",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2011-10-10T00:00:00",
      "story": "I videoed on my cell Phone little flashing blue lights for about 5 minutes.  Also, the entire night sky would flash blue.  After it was over there was a shiny orb that moved north.  It looked like a star flying across the night sky.  Absolutely no sound at all, even during the flashes",
      "link": "http://www.nuforc.org/webreports/084/S84150.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc597",
      "summary": "Two Circle Ufo's Flying At Extream Speeds",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "Two Circle Ufo's Flying At Extream Speeds the first Ufo Had a Circle Shape With A Bright White Light Moveing Towards the South West direction At An Extream Amount Of Speed And Made An Odd Sound As It Zoomed Out Of View.  About 60 Seconds Later Another Circle Shaped Object Flew In The Same Direction As The First Object But This Craft Was Glowing Red And As It Flew In The Same Direction About The Same Speed It Flew Extreamly Close To An Airplane Before It Zoomed Out Of View....",
      "link": "http://www.nuforc.org/webreports/084/S84335.html",
      "state": "PA",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc616",
      "summary": "Orange size Fire-like Glowing Sphere in Pennsylvania July 30, 2011.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2011-08-21T00:00:00",
      "story": "Orange size Fire-like Glowing Sphere in Pennsylvania July 30, 2011. I just heard you on C2C talking about July 30th in Pennsylvania and was quite excited.  I left my house just before 9PM on July 30th 2011 to ride to the store a couple of blocks for my house.  As I was approaching the store, I saw something flying down in the manner that a plane descends.  It was coming towards me very fast and as I concentrated my vision on it, it changed to a horizontal flight just about 20 feet above in front me and just flew right over my head.  It was about the size of an orange and looked almost like a glowing liquid fire, yellow orange in color.  It had no tail/trail.  I stopped my bike and by the time I placed my foot on the ground and turned around, it was gone.  I looked around and there was no sign of anything.  There was no sound at all.  There was a couple a few hundred feet behind me and I waited for them to reach me to see if they looked like they saw something, and it seems they didn't.  I mounted my bike and proceeded to the store. It! was 9:04 pm when I reached the store.  The whole event took place within a second or so. I am currently unemployed but I am a 6th Degree Black Belt in Classical Martial Arts of Okinawa and China.  I do not take drugs, do not drink alcohol and have no reason to lie. In fact, I posted the event on my Facebook as soon as i got back home.  My facebook name is Juku Cho.  Look for me and send me a friend request.  I'll accept you so you can see my post and my friend's responses.",
      "link": "http://www.nuforc.org/webreports/083/S83079.html",
      "state": "PA",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcabd",
      "summary": "Circularly moving lights around an \"invisible\" cylinder transforms into V triad of lights with a red and green tail lightI",
      "city": "philadelphia",
      "shape": "changing",
      "date": "2011-08-21T00:00:00",
      "story": "circularly moving lights around an \"invisible\" cylinder transforms into V triad of lights with a red and green tail lightI August 20, 2011.  12th and Locust, Philadelphia, Pennsylvania It was approximately 10:00 PM and my daughter and I were in the car waiting for a friend.  We were sitting and chatting when we heard a load noise that sounded like rubber hitting a fan, while simultaneously looking up and seeing an object.  The UFO were streams of moving lights that seemed to enclose a spool-shaped \"invisible\" form; there was a form but it was cloaked.  Both of us were staring at it and wondering out load what it was when we witnessed it tilt down towards 7:00 position, then fold backward and stretch out into a \"V\" triad of  lights, with a green (top) and red (bottom) light following directly behind the triad. It started to move slowly down 12th when we lost sight of it. I tried unsuccessfully to follow it.",
      "link": "http://www.nuforc.org/webreports/083/S83315.html",
      "state": "PA",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bd00c",
      "summary": "Black rectangled shaped object, polsating like a jelly fish, appeared and observed me.",
      "city": "philadelphia",
      "shape": "rectangle",
      "date": "2012-09-24T00:00:00",
      "story": "Black rectangled shaped object, polsating like a jelly fish, appeared and observed me. I was standing in the kitchen, I got an urge to go outside on the deck, I walked out and looked up and there to the right above the neighboring house was an object, it seemed to be coming towards me, maybe it was 100ft in the air.  It was silent, it look like a black rectangle shape, the rectangle was rolling or spinning, it moved slow, like it was in the water, I saw an aura maybe, a circle of energy or something around the object.  it seemed to be pulsating in the center. after i saw the object it then moved in a straight line in front of me above the neighboring house, the center  which seemed to be pulsating  was facing me with the black rectangle shape rolling around it.  it moved in front of me about 50 feet and then started to power up, it went up in the sky and sat in front of a cloud for about 10 minutes, it was spinning or rolling the whole time it was moving,it then went up, beyond the clouds and out of sight. It had no wings or propellers or anythin! g recognizable to anything. it moved like it was in the water. it seemed like it observed me. also it was around 6pm and sunny out.",
      "link": "http://www.nuforc.org/webreports/092/S92247.html",
      "state": "PA",
      "duration": "10-25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd138",
      "summary": "2 objects moving together across the sky during the day.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2012-08-05T00:00:00",
      "story": "2 objects moving together across the sky during the day. I was on the roof deck sometime late afternoon. The sun was starting to set but there was still plenty of light out. I happened to look up and saw 2 shapes in the sky.  I was looking toward the DE river, with the Philadelphia skyline to my left. There were 2 objects moving right to left across the sky. They did not appear to change speed or elevation, or their position in relation to each other. They moved across my field of view over the course of about 1-2 minutes.  I did not know how big they were so I could not judge how far away they were. The first object was sort of in the shape of an E with the E facing down at the ground.  It did not change orientation at any time.  The second object was in the shape of an elongated cylinder that was oriented horizontally relative to the ground.  It did not change orientation either. Both of the objects were the same color... I would describe it as a brushed stainless steel... there was no appearance of a polished finish. They did not behave like balloons.  They moved with very little change in elevation, and did not appear to move with the breeze.",
      "link": "http://www.nuforc.org/webreports/091/S91175.html",
      "state": "PA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3d6",
      "summary": "Orange sphear seen by myself and my wife over south philadelphia.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "orange sphear seen by myself and my wife over south philadelphia. After walk to corner store my wife called me on cell and asked me to come to front door . After making my way to door, she said look at the moon,(full moon at the time). Just under the moon was a bright orange ball moving slowly and changing course sharpley three times before moving out out of view. It also seemed to be dimming slowlly.  It seem to disapper before flying through cloud (not through cloud). We live in a high air traffic are near airport. This was no air plane or helicopter. It was silent. Manuvering like nothing I have ever seen.",
      "link": "http://www.nuforc.org/webreports/092/S92295.html",
      "state": "PA",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6c7",
      "summary": "Silent, oval, bright white craft in yard.",
      "city": "philadelphia",
      "shape": "oval",
      "date": "2012-07-04T00:00:00",
      "story": "Silent, oval, bright white craft in yard. That evening, my son, my husband, and myself were watching tv in our living room. I noticed a light in my backyard and my son and I both went to our sliding glass doors.  What we saw was incredible.  It was an oval shaped craft, completely immersed in a white blue light.  It looked like a single person (being) craft.  It was gliding slowly through our yard, and came within 10 feet of my house.  It was only 5 or 6 feet off the ground.  If we had opened the door we could have touched it. We watched as it cruised past our door, past next door and towards the break between the houses.  I ran to the front door waiting for it to reappear from the break but it never came out.  It had to have gone up.  There was absolutely no sound coming from it.  What was strange was that none of my neighbors claim to have seen it.  My husband must have dozed off because he didnt see it.  My son who was 25 at the time didnt believe in UFO's until that night. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89883.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bda91",
      "summary": "Parent & Child Circles on Sky.  ((NUFORC Note:  Possible advertising lights?  PD))",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "Parent & Child Circles on Sky On March 24th, 2012, was picking up my own cake delivery from Sams Club, Bucks County, PA was traveling towards I-95S. Noticed 6 Circular Dull Flash light Objects (UFO) with one Big Circle at the center and rest 4 Normal bright Circles at each corner of Big Circle and another Small Sparkling Oval Shaped UFO leading direction to follow my car.  I started noticing it when I took right onto US-13 S/Bristol Pike merging I-95S. 6 Circles followed my direction and small sparkling UFO was leading big ones. One the way it started raining, though I missed it, when rain stopped, again noticed it was following my direction, again I saw it. When I reached Philadelphia Downtown toward I-676 W/US-30, was heading for another pickup from Indian restaurant at University City, near UPenn & again when returning back I saw those UFO's it did not go away instead it was following me, wherever I go.  At last at 9:30PM I reached home to my Apartments near Philadelphia Museum of Arts,  These Circles were revolving and Circulating above my parking & my apartment, I called my wife to look out for circle from Balcony, she did saw the same circles, now the Big one remained dull and cloudy and we could see only half of it since it was positioned directly above my apartment but we could see rest 4 Circles and one Oval very bright shines ones like a Circular Aircraft - UFO's. It took a while 15 min approximately after I unloaded my things from my car, it disappeared in sky. Very remarkable experience.  but I don’t have any photos or it never clicked my mind to video record this, All I felt was strange and curious and surprised, I could notice myself I was became very much concentrated on what I was doing even I pushed myself out to call my wife to see from Balcony, I had a feeling of deep meditation and single mind directed on what I was doing at that moment when I got out of my car for unloading. I couldn't explain anymore or I don’t know how to explain this, it’s an experience.  Worst thing when this incident happened nobody was around me to look at, it’s a perfect time, I am not sure whether others noticed. I was searching for a official site to report this event. Thankyou www.nuforc.org.",
      "link": "http://www.nuforc.org/webreports/088/S88675.html",
      "state": "PA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3be3eb",
      "summary": "I saw alot of lights and helicopters etc , after.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "I saw alot of lights and helicopters etc , after. I had a feeling to look at my window thank god i always keep my iphone with me and i can get to the camera very quickly i will surely share my video. ((ADDENDUM FROM WITNESS)) I am very serious and it was took outside the window there was atleast 30 planes and helicopters also i saw what was tooken in the video and i dont believe it looks any diffrent from the way i saw this than in the video. i am a firm alien belever and if u wish to contact me you can i listed my number an ill give it to you again let me remind you im am 15 but i dont like hoaxes  . Again i think it is important to say that i had a feeling in my stomach like butterflies . Also if you have any more questions just ask. ((END ADDENDUM)) ((ADDENDUM #2)) Also it was pm and yes i did the see the objects flare up . I will start trying to get more things like this on tape. Also this isnt the first thing i saw that looked strange to me. ((END))",
      "link": "http://www.nuforc.org/webreports/093/S93025.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be3a3",
      "summary": "((HOAX??))  unidentified object mm n ts",
      "city": "philadelphia",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "unidentified object mm n ts 2 objects floating in the air close to each other that would not record on camera ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90263.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be3db",
      "summary": "Smaller craft came out of a slit in the sky above the roof tops in a residential neighborhood.  It was a darker brushed metal color.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2012-04-18T00:00:00",
      "story": "Smaller craft came out of a slit in the sky above the roof tops in a residential neighborhood.  It was a darker brushed metal color. Because it was such a long time ago, I am not quite sure the month of my siting, but I was with my girlfriend and it was the spring/summer of 1978.  We were starting 9th grade in the fall.  The location was northeast Philadelphia around the neighborhood of Tacony. Somewhere in between our two houses we were walking and saw an unusual light in the sky.  It wasn’t a star or a plane because it was moving erratically but was controlled.  For example the light moved from right to left a distance of several blocks in a second.  Then we saw it move north to south in a distance of several blocks in a second.  And so on.  We started running around the neighborhood following it. Somehow we found ourselves quite a distance from our houses, we were standing by a neighborhood school near Vandyke Street in Philadelphia.  It was a catholic school I believe.  We were looking up in the sky and we lost sight of it.  Suddenly, the craft came out of an invisible slit in the sky if that makes any sense.  The entire thing didn’t appear at once, it was as if there was an invisible door or envelope in the sky and something was coming through it. Now, it was not far up in the sky, it was about equal to the second floor of a row house.  Right above the roofs.  I did not find the shape described in the form that you have.  The best way I can describe it is if you put your two thumbs together and your index fingers together.  It’s sort of a square shape that was sanded down at the edges to make it more rounded. The color of the metal was something I had never seen before, the best way I can describe the color is like a brushed metal, not shiny.  It was a darker color.  There were no lights on the craft at this time.  When we saw it in the sky it was a light.   There was also no sound. As soon as I saw it coming out of the invisible slit in the sky I took off running behind the school building after I picked my bottom jaw up off the ground &#61514;  My friend stood frozen and just stared up at it.  I was peeking around the building looking at her. I don’t remember much after that except we walked home.  I was very late coming home.  It only seemed like an hour but I cannot remember what time I got home.  My mother was extremely angry with me especially when I insisted for days that I saw an unusual object in the sky which I followed and that was the reason I was late.  Actually for years after I insisted but everyone just laughed at me. It is strange but my friend and I never talked about what we saw after that.  You would think we would. I do not remember having any contact with any type of being.  I moved out of Philadelphia later that summer to another state but have since moved back to Pennsylvania but not Philadelphia. In my thirties, sometime late 1990s or 2000, I was home alone and I woke up, saw what looked like a strange being with a big head standing in my bedroom door way staring at me, I started screaming and then must have fallen back to sleep.  I’m not sure if I was dreaming or not. I never reported this at the time of my siting because I was young, and no one believed me.  I listened to you on Coast to Coast and you mentioned that you would welcome reports of sitings despite how long ago it may have happened.  Thank you. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87995.html",
      "state": "PA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3be952",
      "summary": "About 7:00 p.m., my wife and I had just got back from the market WE WERE WALKING UP THE STEPS TO OUR PORCH . I JUST H",
      "city": "philadelphia",
      "shape": "other",
      "date": "2012-03-13T00:00:00",
      "story": "MARCH 3 , 2012,  AROUND ABOUT 7:00PM  My wife and I had just got back from the market WE WERE WALKING UP THE STEPS TO OUR PORCH.  I JUST HAPPEN TO LOOK UP AND THEIR WAS AIR PLANE FLYING FROM THE WEST TO THE EAST.  AT THE SAME TIME I SAW 6 TO 7 ORANGE ORBS / UFOS { WHAT EVER YOU WANT TO CALL THEM } THESE ORANGE GLOWING OBS WAS FLYING MUCH HIGHER THAN THE AIRPLANE.  THE ORBS WERE FLYING IN FORMATION ON TOP ONE ANOTHER THEY WERE EVENLY SPACED.   THESE OBS WERE MOVING SO FAST THE AIRPLANE LOOKED LIKE IT WAS STANDING STILL.  THE ORBS WERE COMING FOR THE WEST HEADING EAST, WHEN THE ORBS GOT GREAT DISTANCE AWAY THEY ALL TURNED LEFT AND STARTED GOING NORTH UNTIL I LOST SIGHT OF THEM ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87550.html",
      "state": "PA",
      "duration": "20 second"
    },
    {
      "_id": "64d005f478aba2ec5a3be95f",
      "summary": "ABOUT 7:00PM OVER SKY OF PHILADELPHIA",
      "city": "philadelphia",
      "shape": "other",
      "date": "2012-03-13T00:00:00",
      "story": "MARCH 3 , 2012, AROUND ABOUT 7:00 PM OVER SKY OF PHILADELPHIA  My wife and I had just got back from the market WE WERE WALKING UP THE STEPS TO OUR PORCH .  I JUST HAPPEN TO LOOK UP AND THEIR WAS AIR PLANE FLYING FROM THE WEST TO THE EAST.  AT THE SAME TIME I SAW 6 TO 7 ORANGE ORBS/UFOS  {WHAT EVER YOU WANT TO CALL THEM } THESE ORANGE GLOWING OBS WAS FLYING MUCH HIGHER THAN THE AIR PLANE.  THE ORBS WERE FLYING IN FORMATION ON TOP ONE ANOTHER THEY WERE EVENLY SPACED .  THESE OBS WERE MOVING SO FAST THE AIR PLANE LOOKED LIKE IT WAS STANDING STILL .  THE ORBS WERE COMING FOR THE WEST HEADING EAST, WHEN THE ORBS GOT GREAT DISTANCE AWAY THEY ALL TURNED LEFT AND STARTED GOING NORTH UNTIL I LOST SIGHT OF THEM ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87551.html",
      "state": "PA",
      "duration": "20 second"
    },
    {
      "_id": "64d005f478aba2ec5a3beff8",
      "summary": "Pearl shaped ufo leaving smoke trail in photograph in downtown philly.",
      "city": "philadelphia",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "pearl shaped ufo leaving smoke trail in photograph in downtown philly A pearl shaped ufo leaving a smoke trail was discovered on a photograph i took in downtown Philadelphia.  I took random photographs that day and one was a photograph of a street sign ?mole Street\" against the clear blue sky.   At that time i didn't notice anything in the sky and really wasn't focused on that.  Only later did i see a white streak and zoomed in to see what it was.  I was very surprised that it showed this round white object with a a smoke trail behind it.   I computerized the image to see if it would resolve into an airplane and a contrail.  No matter what i did the round shape persisted.  i used some of the tools available to bring it in closer and in a sharper contrast. It is not an airplane,or birds, or a balloon, and is too round to be a meteor.  It is not flaw in the camera or lense.  I've never seen a ufo but apparently i took a picture of one completely by accident.",
      "link": "http://www.nuforc.org/webreports/098/S98490.html",
      "state": "PA",
      "duration": "short"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3bf",
      "summary": "No sound very smooth movement  flashing different colors then all the same separating then back together",
      "city": "philadelphia",
      "shape": "circle",
      "date": "",
      "story": "No sound very smooth movement  flashing different colors then all the same separating then back together I was a young girl my early teens I was out doors on a hot summer night it was clear.  I can,t remeber who got my attention but when I looked up ther was 6 to 8 lights off a distance like an air plane very close.  I knew then it wasn't normal.   I called my mother the sound in my voice brought her fast.  At first it looked like air plane lights, but then they separated and changed colors and went  back in formation like the air plane lights but only in that shape  I am now 67 years old and I have never  since seen any thing like it ....until one night while looking at t.v. the army guy detaitailed the same thing it brought back all my memory like yesterday.   I haven't shared this with many people but I got to document this before it's too late.  I know what my brothers and mom saw she's no longer with us, but its 3 of us left me being the eldest.   I am telling the truth and I will stand by it and decided to copy and  sign my name and let the world know what I saw. ((NUFORC Note:  Time and date are approximate.  We have assigned an arbitrary time and date, based on what the witness has written.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95019.html",
      "state": "",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf625",
      "summary": "2 fireball objects over philly.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2013-10-14T00:00:00",
      "story": "2 fireball objects over philly. Watched what I thought was a comet for about a minute move a little slower than a passenger airplane then realized how cloudy it was   I thought it was a plane on fire!  Red glowing object that seemed like was pulsating.   Me and wife watched until it became obstructed.  A minute later another one slightly smaller came from same direction at about same speed.  Watched it flicker then disappear going into northern area.   I don't believe in strange things but have not found an explanation.   Chinese lanterns don't go a that fast! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102971.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfdd1",
      "summary": "Single white light moving in plane filled sky.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Single white light moving in plane filled sky We were at an outdoor movie viewing in Clark park in west philadelphia.  It was a beautiful night, the sky was clear and the stars were vivid.  I kept looking up at the sky every time a plane passed by and there seemed to be a lot.  That's when I noticed a moving object heading southwest around 9:20 pm.  It looked pretty much just like a bright white light, and it moved slightly slower than the airplanes.  I noticed it did pass under a plane at one point, carried on for another 15 seconds or so, and then disappeared.  After that I didn't see any planes or other lights in the sky for a good ten minutes.  I was out there from 8:30 pm too 10:00 pm and saw at least 20 planes, all of which had multiple flashing and colored lights on them.  The other object was merely a bright white light which is why I kept sight of it until it vanished.",
      "link": "http://www.nuforc.org/webreports/101/S101564.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c031c",
      "summary": "SOMETHING FEW DOWN ONTO MY LAWN ON MAY 10TH, 2013.",
      "city": "philadelphia",
      "shape": "",
      "date": "2013-05-15T00:00:00",
      "story": "SOMETHING FEW DOWN ONTO MY LAWN ON MAY 10TH, 2013. ON MAY 10 LIGHT CAME UPON ON LAWN, I HAVE NOT IDEA WHAT IT IS, BRIGHT LIGHT, CHANGE SHAPE A COUPLE OF TIME.  THIS IS THE FIRST TIME I SEEN ANYTHING LIKE THIS BEFORE. AI HAVE IT RECORDED. WEBS BUT THE ARE NOT LIGHT SPIDERS WEB,  THEY LOOK LIKE LIGHTS. i NEERD TO SHOW SOMEONE THE VIDEO OF THEM.  THE LIGHT IS ON MY LAWN EVERYNIGHT BUT THE OTHER LIGHT IS NEW.",
      "link": "http://www.nuforc.org/webreports/097/S97735.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c04aa",
      "summary": "Dark, silent, boomerang shaped object seen by 3 in Philadelphia.",
      "city": "philadelphia",
      "shape": "chevron",
      "date": "2012-12-20T00:00:00",
      "story": "Dark, silent. boomerang shaped object seen by 3 in Philadelphia My friends and I were leaving a party at another friend's house around 2 am.  When we walked outside we immediately noticed how bright the stars were and how many of them we could see (We were in north central Philadelphia, near Temple university where even on the clearest nights you can hardly see stars because of the light pollution). We were all just taking a moment to look up at the stars, marveling at our freak ability to see so many. My friend remarked that he could see Orion's belt and that's about when I saw a dark, v shaped formation flying across the sky.  I though at first it was a flock of geese, especially since it was moving south east, but I quickly realized it wasn't. As soon as I said \"whoah, look at that planet\"; I realized it wasn't a plane at all, there were no lights on it and it was flying very low to the ground (maybe 600 or 700 feet in the air at most) it was also completely silent. (Just to be clear, we live near 2 air ports, we see taking off/landing planes all the time, daily, and this is not what they look like)   As soon as I pointed out the \"plane,\" then quickly corrected myself and said \"wait no, there's no lights on it, hold on..; it was out of sight.  It was moving silently, gliding, but it was moving at a pretty good speed.  My other two friends who had seen it confirmed how strange it was and we tried to run down the street to keep up with it, but lost sight due to the bright street lights and buildings in our way.",
      "link": "http://www.nuforc.org/webreports/095/S95008.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0822",
      "summary": "Orange Objects Ascending Over Philadelphia",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2014-03-18T00:00:00",
      "story": "Orange Objects Ascending Over Philadelphia. On the evening in question I was traveling northbound on 95 approaching the Aramingo avenue exit.  I saw to my right several slowly rising objects from the northeast in my peripheral vision.  I then focused my attention to the objects. I counted approximately 12-15 of them.  The objects appeared to be triangular in shape with a solid orange color.  There were no visible navigation, beacon, or strobe lights, which are required on all civilian aircraft, and usually on military aircraft as well.  I did not hear any sound from the objects, although I was traveling at highway speed and only briefly put the window down.  The objects slowly gained altitude.  I would estimate from approximately 150 ft AGL up to 12-1300ft AGL at which point I lost visual reference due to traveling in the opposite direction. They appeared to originate from an approximate heading of 040º magnetic on an outbound of approximately 235º toward the downtown area.  It appeared as if they remained in a tight formation of 2-3 craft in front, at a slightly higher altitude, 4 in a roughly arrow formation, and the remainder flew in sequence.  The overall formation reminded me of the uneven arrow which geese fly in when heading south for winter.  My passenger also witnessed the event and she continued to maintain visual reference while I returned my attention to driving.  I could see the objects in the rearview mirror for approximately 2 more miles until I exited the motorway.  Sky conditions on the evening in question were approximately 8 miles visibility, no cloud bases, and a light (&lt;5knots) wind.  There was no snow on the ground at the time, there was no snow falling at the time, nor were there reports of snowfall in the area.  I reviewed temporary flight restrictions, which would notify airmen of any launches or abnormal flight operations, and found none for the evening in question or the surrounding week.  My background is in aviation, and this is unlike anything I have seen in my career.  The lack of sound and slow speed makes me of the opinion that it was not a formation of fixed wing aircraft.  The lack of sound, abnormal lighting, and elevation also makes me skeptical that it could be a helicopter fleet.  I have made this report several months after the fact only because I did not get around to it and also because I have recently seen several videos online, from Philadelphia, which show almost exactly what I saw.  Having seen those, my opinion is even more so that what I saw was indeed abnormal. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107618.html",
      "state": "PA",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c088a",
      "summary": "2 of us saw a white ball of light traveling at a great deal of speed crossing I-95 near Philadelphia airport. After it passed little fl",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "2 of us saw a white ball of light traveling at a great deal of speed crossing I-95 near Philadelphia airport.  After it passed little flashing particles left in sky blinked for about a minute than faded.  Don't know what is was. Freaky ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107534.html",
      "state": "PA",
      "duration": "25 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3c08f9",
      "summary": "22:00- black sky, medium cloud cover. I was about to cross the street, but i looked up and noticed a soft white light heading northeast",
      "city": "philadelphia",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "22:00- black sky, medium cloud cover.  I was about to cross the street, but i looked up and noticed a soft white light heading northeast.  Helicopters and planes fly over my area all the time and I can plainly state that this was neither.  It was completely silent and moved very slowly.   I was so taken back by this \" light\" that I leaned against a brick wall to watch its movements.   Just as it was almost over my street, it slowly turned right and began to head east towards the river.   I felt really happy and aloof during and after I witnessed it.  I noticed that it kept getting brighter and dimmer and at one point saw a flicker if and orange light either on the right side or the underbelly of the light.   The light appeared to be circular, but mainly just a slow moving light.  Since I was already feeling crazy, I asked the light to turn on and off so I knew it was really there and I wasn't imagining things, but instead it slowed down directly overtop and in front of me and dropped a smaller white light that flickered down and immediately disappeared, at which point the larger light sped up, turned and orangey- red color, and sped away.   I should also mention that the street went from being filled to nothing during about a 5 minute time frame, and I believe I was the only witness on my street.   After the light passed and I crossed the street, cars and people started showing up again.  There you go!",
      "link": "http://www.nuforc.org/webreports/103/S103844.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0958",
      "summary": "Blue ball over Philadelphia.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "Blue ball over Philadelphia I seen a blue ball of light at 7:10 am while waiting for the bus the object was fairly close to the ground it was above these tree behind a house when I saw it it stood still for a second then it shot off at lighting speeds and as it was beganing to accelerate I seen a sight after effect or shadow of the craft",
      "link": "http://www.nuforc.org/webreports/103/S103594.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b18",
      "summary": "Loud boom represent thunder Wed., 2-19-14 proceed a few minutes later with some light source pink, blue and white entering my home.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2014-02-27T00:00:00",
      "story": "Loud boom represent thunder Wed., 2-19-14, proceed a few minutes later with some light source pink, blue and white entering my home. Wed., February 19th, 2014, experienced a very loud boom supposedly representing a thunder erupted in Philadelphia, PA.  The sound was so loud it made one think a sonic bomb just hit somewhere. Within a couple minutes I saw a beam of light enter my dining room window and something really colored pink, blue and white (about 8 ft. center oval shaped with two tails that narrowed) entered my living room a couple seconds while I sat on my couch observing in SHOCK and with a tail exited the living window as quickly as it entered from the dining room window. I felt tingling like a light electrical sensation around me during this observation.  Has anyone else reported anything like this?",
      "link": "http://www.nuforc.org/webreports/107/S107357.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c0b3f",
      "summary": "Blue white illuminated sphere with smaller spheres orbiting object",
      "city": "philadelphia",
      "shape": "sphere",
      "date": "2014-02-21T00:00:00",
      "story": "Blue white illuminated sphere with smaller spheres orbiting object I am sending this report in response to a recent sighting in Pennsylvania.  The report stated that the object looked like a star with another light going around it, the report is from Chester, PA, on 2/15/2014. This seems very similar to an object I have seen off and on over Philadelphia for many years.  I have shown this to others and have looked at it through binoculars, the object seems very stationary and does not move out of view from the sight of the binoculars as planets and other objects do. I would describe it as a bright  blue white object with lights spinning around it.  The smaller lights I would say are ¼ the size of the central object and can be red, blue and yellow and spin rather quickly around the center object in multiple directions.  The object also can seem larger or smaller and appear in different parts of the sky.  The object does not seem to move as a planet does or any other object I have ever looked at in the sky.  We have many helicopters and planes over Philadelphia and the object does not move the same way as them either.  The object I would say is very still and at times moves but not when I am looking at it. I have an interest in sky watching and have tracked planets across the sky and they move fairly quick past your view in a telescope or binoculars this object does not have any of those characteristics.  I have been seeing this since the late 80's and have seen it last year at times.",
      "link": "http://www.nuforc.org/webreports/107/S107146.html",
      "state": "PA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cc4",
      "summary": "Saw 4 objects like bright fireballs coming from east flying toward west didn't have make a sound like a helicopter or airplane then dis",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2014-02-21T00:00:00",
      "story": "Saw 4 objects like bright fireballs coming from east flying toward west.  Didn't make a sound like a helicopter or airplane.  Then disappeared into the sky.",
      "link": "http://www.nuforc.org/webreports/107/S107133.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d35",
      "summary": "Multiple bright orange objects over Philadelphia.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2014-02-27T00:00:00",
      "story": "Multiple bright orange objects over Philadelphia During a completely clear evening, I observed roughly 12 bright orange objects flying northeast across Philadelphia.   I initially spotted one by itself, which looked very different than normal airline traffic (which is almost non-stop in the airspace over my area).  The object was not blinking and there was no discernible sound.   Immediately afterwards, 4 pairs of the same type of object flew in the same direction/altitude/speed, followed by 3 more that flew over individually.   The strangest part was that some of them seemed to very quickly \"burn out\" and disappear before leaving my line of sight. This seemed remarkably similar to a sighting I saw posted on this site in Broomall just a few days ago.  My most logical guess was that these were helicopters at higher than normal altitude, but the lack of any sound has really puzzled me.  I have never seen anything like them. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107384.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f1d",
      "summary": "((HOAX??)) Six black UFO's over NE Philadelphia--blue and red lights.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "Six black UFO's over NE Philadelphia--blue and red lights. I saw six or more ufos flying over northeast philadelphia.  The crafts were circular but at closer expectation may have been in the shape of an aircraft.  They were black with red and blue lights flickering traveling northwest to east south.  They were flying somewhat high compared to other aircraft I've seen, human.  They were very noisey also like incredibly loins ((??)).   I'm not sure if they may have been military but still felt the urge to report.   Earlier in the day while inside a building, not my home, I heard the same noise and tried to look out a window but was unable to see anything.   This happened between 11am-3pm.",
      "link": "http://www.nuforc.org/webreports/107/S107898.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f95",
      "summary": "Fireball in Philadelphia.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2014-02-27T00:00:00",
      "story": "Fireball in Philadelphia. Saw a burning object screaming across the sky.  It was orange and had a sparky tail.  It was traveling south and falling at a much slower rate than it was traveling.   I ran across the street to follow it but ultimately lost it behind city buildings.",
      "link": "http://www.nuforc.org/webreports/107/S107446.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fe1",
      "summary": "3 red/orange flame-less lights seen hovering.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "3 red/orange flame-less lights seen hovering On New Years day, my wife and I went to Acme around 6pm, while we were driving home we saw 3 red lights in the eastern sky.  They weren't moving and had no blinking lights.  We thought they were around the 2nd street area given New Years celebrations. While we were driving around looking for parking, we kept checking for them. Two seemed to have dimmed and disappeared while a third, the lowest in the sky, was still visible. I also thought they may have been Chinese lanterns, but we didn't see any flame or flickering.  They were solid and bright and were staggered, one light at the top left, with the second and third lights closer together, much lower. I am also a UFO/Paranormal Investigator and have had other sightings and experiences.  This was the first sighting my wife and I had together.   I own and operate AlienstheTruth.com",
      "link": "http://www.nuforc.org/webreports/105/S105970.html",
      "state": "PA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c19e1",
      "summary": "Small orange orb flew from ground and over head.",
      "city": "philadelphia",
      "shape": "sphere",
      "date": "2014-07-11T00:00:00",
      "story": "small orange orb flew from ground and over head Small orange illuminated ufo took flew vertically from the ground at a distance of about 200 yards.    Once it reached a height of about 164 meters, it stopped rising and began flying horizantally.   The ufo took a flight path almost directly over top of us.   It proceeded until it left our line of sight.",
      "link": "http://www.nuforc.org/webreports/111/S111112.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ac6",
      "summary": "Orange ball of light drops something and then leaves.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2014-07-11T00:00:00",
      "story": "Orange ball of light drops something and then leaves. Me and My Father were on the porch talking, when I noticed an Orange light in the sky. I told my father, he turned around and saw it.   I then grabbed binoculars and aimed them at the object.  It looked like Saturn at first with a ring, then it turned and we saw what looked like a yellow light dropping out of the object.   Then, it went further away from us at fast speeds until it disappeared.",
      "link": "http://www.nuforc.org/webreports/111/S111189.html",
      "state": "PA",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ac5",
      "summary": "Solid, very vivid clean white glowing object at sunset.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2014-06-04T00:00:00",
      "story": "Solid, very vivid clean white glowing object at sunset Just approaching sunset, with still a decent amount of light in the sky, I happened to look up in the sky and spot an extremely vivid, pure solidly glowing (almost LED like) object.   Very pure clean white shade.  Its glow restricted itself from providing a defined shape, but it seemingly was that of of an extremely softened edges rectangle.   It stood out even more in the fact that it was so far away and high, yet still was of a decent size and vividness.   I pointed it out to my toddler, and then within a few more seconds, it went behind a cloud. I did not see it again, although I tried waiting for its to pass the cloud. ((ADDENDUM FROM WITNESS)) My apologies; this is my corrected time for the philadelphia sunset bright light sighting that was submitted only a minute ago. ((END ADDENDUM)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109634.html",
      "state": "PA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b4e",
      "summary": "((HOAX)) My sister was leaving my house and she called the family out side and we seen 7 fireball UFO and  then we saw the moon moving.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2014-06-20T00:00:00",
      "story": "My sister was leaving my house and she called the family out side and we seen 7 fireball UFO and  then we saw the moon moving. ((NUFORC Note:  We suspect that the submission is an attempt to hoax.  The source describes self in a fashion that seems incongruous.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110226.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c1b6e",
      "summary": "Bright flashing light in sky then strobes of flashes from ground.",
      "city": "philadelphia",
      "shape": "flash",
      "date": "2014-07-04T00:00:00",
      "story": "Bright flashing light in sky then strobes of flashes from ground. From balcony, noticed a bright light for a split second that seemed very high in the night sky.  Seconds after we noticed multiple flashes of light that seemed to come from the ground up (over a distance) maybe in New Jersey.   I am in Philadelphia but can see across Delaware river.  No booms or smoke and and seemed like a massive strobe.  Have seen this a couple times before but never really paid much attention.   Other people I have talked to have seen same flashes.  Very bizarre.",
      "link": "http://www.nuforc.org/webreports/110/S110797.html",
      "state": "PA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ecb",
      "summary": "5 huge lights in every direction of the skies",
      "city": "philadelphia",
      "shape": "other",
      "date": "2014-05-02T00:00:00",
      "story": "5 huge lights in every direction of the skies. when i looked out my window to the eastern sky i saw a huge oblong bright light.  when i ran outside i saw 4 more.  they didn't move and were in the part of the sky i look at everynight.  2 in northeast sky, one west, one south and one in the north sky.  my husband and i saw them and were in such awe.  i have looked everywhere for anyone who saw this event.  what i witnessed was so amazing and i can't figure out what it was.  i believe they were lined up in unison.",
      "link": "http://www.nuforc.org/webreports/109/S109064.html",
      "state": "PA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c23fa",
      "summary": "Bright orange/red fire ball moving east in the sky.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2014-03-27T00:00:00",
      "story": "Bright orange/red fire ball moving east in the sky.",
      "link": "http://www.nuforc.org/webreports/108/S108027.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2465",
      "summary": "Black triangle with orange glow behind it moving slowly across the sky in a way that defies science.",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2014-11-06T00:00:00",
      "story": "Black triangle with orange glow behind it moving slowly across the sky in a way that defies science. While walking to a concert at night, three of my friends and I saw a large black triangle in the sky.  It was moving very slow but seemed to be far away. It must have been massive to be that far and still seem so big.  The triangle wasn't flying like a normal jet would with a point forward.  It seemed to just be sliding across the sky in a way I have never seen before.  There was an orange glow coming from behind it.  The edges were extremely pointed. We couldn't believe what we were seeing.  I just remember looking at my friends to see the reactions on their faces and by the time I looked back at the sky the object was gone.  We heard no noises. One year later I saw the cover of a Flying Lotus (music producer) EP called \"Reset\" and the image on the front was exactly what I saw that night.   Years later we still have only told a handful of people because we know none of them will believe us. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115173.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c253f",
      "summary": "Green fireball. flash green real bright. then flew away faster then anything I ever seen before",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "green fireball. flash green real bright. then flew away faster then anything I ever seen before As I was walking home from the Chinese store with a friend, we seen A big bright GREEN ball ascended in to the sky really fast.  Stopped for 2 seconds, Then flashed green real bright.  Then flew away faster then anything I ever seen before.  I was freaking out. Because I am very aware of UFO's n always watch alien documentaries all the time, and I once saw something I thought was a UFO.  But this was very close, only about 3 blocks away I'd say. And its just so (I can't even explain the feeling) to actually witness it first hand, and so close. So had a really bad feeling about it.  Why in Philly?  A largely populated city where a lot of people are still out at 1 am.  That means they are started not to care if see. Which I believe is either a very bad thing.  Or a very bad thing.  No good can come of this. I even posted on a social media about it to see if anyone else seen it.  And my friend said he did. I didn't even give a description of it.  I just asked if anyone s! een that in the sky, and he said \"I seen it. It was a greenish light rite.  It flashed and I was waiting for the boom.  I almost ((deleted)) panicked .  I'm just so overwhelmed and needed somewhere to vent where I wouldn't sound crazy.  Cause like they all say \"I know what I saw\"",
      "link": "http://www.nuforc.org/webreports/114/S114613.html",
      "state": "PA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c26c1",
      "summary": "Cigar-shaped close encounter, brilliantly lit, appeared to be fusion powered like the Sun, size of city bus.",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "",
      "story": "Cigar-shaped close encounter, brilliantly lit, appeared to be fusion powered like the Sun, size of city bus. UFO June 25, 1965, Philadelphia, PA.  The UFO report I am making took place in Philadelphia on June 25, 1965. At the time I was eleven years old.  I am a retired Air Force Intelligence Officer (Major), and Veteran of The Gulf War. I was sitting looking out a window when I saw a large bright object descending at a fast rate of speed.  It was coming down at a 45% angle at perhaps fifty miles per hour.  I thought it was a rocket, because of its shape, a cylinder with rounded ends.  I ran and hid behind the couch away from the window.  I expected an explosion but heard nothing, so I looked out.  I saw the UFO hovering a block down the street over roof tops. The UFO had descended at 22nd Street, descending at the intersection of 22nd and Mount Vernon Street, moving North then stopping at 22nd and Wallace Street.  I was viewing the object from my Grandmother and Grandfather's 3rd floor apartment window at 643 North 22nd Street, Philadelphia, Pa, on June 25th, 1968. The UFO followed the outline of all the homes and buildings-opposite my side of the street, including a church.  It flew just feet above the roof tops. It would pause, descend, and rise, hovering about ten feet above all the roof tops.  It was as if it was viewing inside the homes.  It moved slowly traveling at walking pace. The UFO was the length of a city bus, with rounded ends, but wider in circumference.  It was a large cylinder, it had no markings of any kind, no wings, no visible engines, no windows. The entire surface was made up of a plasma field, like a close up image of the Sun.  These gases or ions spun and disappeared under the surface, diving and rising like a gas.  The brightness was intense.  It was composed of several colors, white, yellow and orange.  It reminded me of someone mixing giant cans of paint.  It was very beautiful but hard on the eyes because of its brilliance. At this point in my life I think what I saw then was a fusion powered ship. At one point I turned around looking behind me into the apartment and noticed the patterns of light also produced shadows on my Grandmothers walls.  The patterns it produced on the walls were dark with light edges.  The patterns matched the moving patterns of the vessel's surface.  The only thing I've ever seen similar are close up films of the Sun.  In addition to the swirling patterns of light I noticed it was layered in a dimple pattern that covered its entire surface.  The dimples appeared to vibrate but stayed in place like those on a basketball while plumes of gas rose and fell like filaments of a magnet.  This was truly amazing to see!  At times I used my hands to shield my eyes.  It was the brightest light I've ever seen and today I'm sixty years old, as of November 2014.  I was alone viewing the object.  My Grandfather was at work and my Grandmother went downstairs to another apartment for a short time. It approached my location stopping directly in front of me. I did not feel any heat.  At this point it was about 80 feet away, close enough to throw a ball to it!  I was able to observe this object for perhaps five minutes, in total, which seemed then to be a long time.  As I said it paused several times over apartments, then would move and stop again several times. Just before the UFO changed direction (descending, or rising, stopping or starting to move forward) it emitted a loud sound.  The sound always preceded its change in movement by about two seconds each time.  So I knew when it was going to move again.  The sound reminded me of a loud hiss from an old steam train.  I'm not saying there was steam just that the sound was similar to that or when a large truck makes releasing air brakes. Once the UFO got to the last building at the intersection of 22nd and Fairmont Streets it angled at 45 degrees, with its front end pointing up, it rose about fifty feet. I ran to another window on the side facing Wallace Street, so was able to watch it again.  It leveled off, then flew over the walls of the Eastern State Penitentiary, it picked up speed at about 35 miles per hour flying North.  It continued flying North at a level constant speed until I lost view of it.  This craft was definitely controlled by an intelligence. When my Grandmother came in I told her what I had witnessed.  We were both very religious, she had difficulty believing my story and asked me to swear by placing my hand on The Bible, which I did.  She was convinced and saddened that she had missed this wonderful sight by just minutes. That evening or perhaps the next night we watched a TV program that highlighted the vessel I had seen and their closer encounter with it.  The program was \"The Arthur Godfrey Show\", or one of his \"Specials.\"  Arthur Godfrey was a respected pilot, and was a colonel in the Air Force Reserve.  Arthur Godfrey and Frank Munciello another experienced pilot were flying in a small aircraft from New York to Washington, DC.  Their flight path took them over or near Philadelphia on the same day of my encounter.  Live on national TV Author Godfrey described that a brilliantly lit vessel followed and maneuvered around his aircraft.  He said it matched his course and speed.  He admitted he was scared of the vessel's close maneuvers until it finally veered off.  Arthur Godfrey was a well know TV producer and TV host.  His TV program was viewed by millions of Americans.  My grandparents and I knew he was describing the same vessel I had seen.  An account of Arthur Godfrey's story c! an be read on Ufodocarchiv.org. Later as an Intelligence Officer I often gave my squadron current intelligence briefings.  I was an Intelligence Officer of the 732nd Military Airlift Squadron at McGuire Air Force Base in New Jersey.  I served in this position for approximately ten years, including during the Gulf War.  During one briefing an Aircrew explained to me they encountered a Ball Lightening Encounter, also called Saint Elmo's Fire.  A sphere of charged particles entered the airframe of their aircraft while cruising at 40,000 feet.  The aircraft was a C-141 Starlifter.  The sphere about three feet in diameter entered the cockpit then floated inside the aircraft to the cargo bay where it hovered for a time then vanished.  They asked of I entered the airframe of their aircraft while cruising at 40,000 feet.  The aircraft was a C-141 Starlifter.  The sphere about three feet in diameter entered the cockpit then floated inside the aircraft to the cargo bay where it hovered for a time then vanished.  The entire crew witnesses the sphere and actually enjoyed the event.  They asked if I knew of any UFO sightings.  I then told them my story.  This upset my Squadron Training Officer who verbally reprimanded me, I was ordered to never speak about UFO's again.",
      "link": "http://www.nuforc.org/webreports/115/S115328.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c270a",
      "summary": "Brilliantly Lit Cigar Shaped Vessel 40 feet long - Hovered over roofs - looked like surface of The Sun",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "",
      "story": "Brilliantly Lit Cigar Shaped Vessel 40 feet long - Hovered over roofs - looked like surface of The Sun The UFO report I am making took place in Philadelphia on June 25, 1965. At the time I was eleven years old.  I am a retired Air Force Intelligence Officer (Major), and Veteran of The Gulf War. I was sitting looking out a window when I saw a large bright object descending at a fast rate of speed. It was coming down at a 45% angle at perhaps fifty miles per hour. I thought it was a rocket, because of its shape, a cylinder with rounded ends. I ran and hid behind the couch away from the window.  I expected an explosion but heard nothing, so I looked out. I saw the UFO hovering a block down the street over roof tops. The UFO had descended at 22nd Street, descending at the intersection of 22nd and Mount Vernon Street, moving North then stopping at 22nd and Wallace Street.  I was viewing the object from my Grandmother and Grandfather's 3rd floor apartment window at 643 North 22nd Street, Philadelphia Pa on June 25th 1968. The UFO followed the outline of all the homes and buildings-opposite my side of the street, including a church.  It flew just feet above the roof tops. It would pause, descend, and rise, hovering about ten feet above all the roof tops. It was as if it was viewing inside the homes.  It moved slowly traveling at walking pace. The UFO was the length of a city bus, with rounded ends, but wider in circumference.  It was a large cylinder, it had no markings of any kind, no wings, no visible engines, no windows. The entire surface was made up of a plasma field, like a close up image of the Sun. These gases or ions spun and disappeared under the surface, diving and rising like a gas. The brightness was intense.  It was composed of several colors, white, yellow and orange. It reminded me of someone mixing giant cans of paint.  It was very beautiful but hard on the eyes because of its brilliance. At this point in my life I think what I saw then was a fusion powered ship.  I'm also glad it did not damage my eyesight.  They sky was clear, it was a hot summer's day. At one point I turned around looking behind me into the apartment and noticed the patterns of light also produced shadows on my Grandmothers walls.  The patterns it produced on the walls were dark with light edges.  The patterns matched the moving patterns of the vessel's surface.  The only thing I've ever seen similar are close up films of The Sun. In addition to the swirling patterns of light I noticed it was layered in a raised dimple pattern that covered it's entire surface.  The dimples appeared to vibrate but stayed in place like those on a basketball while plumes of gas rose and fell like filaments of a magnet.  This was truly amazing to see!  At times I used my hands to shield my eyes. It was the brightest light I've ever seen and today I'm sixty years old, as of November 2014. I was alone viewing the object.  My Grandfather was at work and my Grandmother went downstairs to another apartment for a short time. It approached my location stopping directly in front of me.  I was in the third floor apartment. I did not feel any heat.  At this point it was about 80 feet away, close enough to throw a ball to it! I was able to observe this object for perhaps five minutes in total, which seemed then to be a long time.  As I said it paused several times over apartments, then would move and stop again several times.  It flew over the bell tower of The Olivet Covenant Presbyterian church (current name) at 22nd and Wallace Streets, just across from my location. Just before the UFO changed direction (descending, or rising, stopping or starting to move forward) it emitted a loud sound.  The sound always preceded its change in movement by about two seconds each time.  So I knew when it was going to move again.  The sound reminded me of a loud hiss from an old steam train.  I'm not saying there was steam just that the sound was similar to that or when a large truck makes releasing air brakes. It was strange hearing an anachronistic sound and seeing an advanced flying vehicle!  Once the UFO got to the last building at the intersection of 22nd and Fairmont Streets it angled at 45 degrees, with its front end pointing up, it rose about fifty feet. I ran to another window on the side facing Wallace Street, so was able to watch it again.  It leveled off, then flew over the walls of the Eastern State Penitentiary, (This spooky relic is now open to the public for tours) it picked up speed at about 35 miles per hour flying North. It continued flying North at a level constant speed until I lost view of it.  This craft was definitely controlled by some form of intelligence.  It was not a blimp,  I had seen these vessels before for the Philadelphia Army Navy games traditionally held in Philadelphia in those years. When my Grandmother came in I told her what I had witnessed.  We were both very religious, she had difficulty believing my story and asked me to swear by placing my hand on The Bible, which I did.  She was convinced and saddened that she had missed this wonderful sight by just minutes. That evening or perhaps the next night we watched a TV program that highlighted the vessel I had seen and their close encounter with it.  The program was \"The Arthur Godfrey Show\", or one of his \"Specials\".  Arthur Godfrey was a respected pilot, and was a Colonel in the Air Force Reserve.  Arthur Godfrey and Frank Munciello another experienced pilot were flying in a small aircraft from New York to the Washington DC area.  Their flight path took them over or near Philadelphia on the same day of my encounter.  Live on national TV Author Godfrey described that a brilliantly lit vessel followed and maneuvered around his aircraft. He said it matched his course and speed.  He admitted he was scared of the vessel's close maneuvers until it finally veered off.  Arthur Godfrey was a well know TV producer and TV host.   His TV program was viewed by millions of Americans.  My grandparents and I knew he was describing the same vessel I had seen. An account of Arthur Godfrey's! story can be read on Ufodocarchiv.org. In 1993 I happened across a book, \"The UFO Encyclopedia\" by John Spencer. On page 129 I read the account by Arthur Godfrey validating my sighting. Later accounts of Arthur Godfrey's story have been muddied. Some report the incident online as 1964, 1965 and 1966, some report it was during the evening, or say he was reporting an event he witnessed years earlier. The actual date he saw the vessel was June 25 1965, then he reported it in the evening. He was not in both places at the same time. As I viewed his broadcast myself, I was stunned at his anger and asking for an explanation as to what had happened. He was mad because this event had just happened, and was not years prior as some recent reports are now saying. I hope someone can track down a recording of that broadcast. I can recall to this day my Grandparents discussing me and what to do about the sighting. My Grandmother wanted to call Mr Arthur Godfrey who had just reported the sighting on national TV.  My Grandfather opposed it saying I would be tagged as the Flying Saucer Boy or some other bad thing that would only cause me harm. I remember my Grandmother wanting to talk to someone at The Franklin Institute Planetarium in Philadelphia. She wanted to know if others had reported seeing the vessel.  I stayed several weeks with my Grandparents, finally they told me not to mention it to anyone.  Years later, as an Intelligence Officer, I often gave my Air Force squadron current intelligence briefings.  I was an Intelligence Officer in the 732nd Military Airlift Squadron at McGuire Air Force Base in New Jersey,  I served in this position for approximately ten years, including during The Gulf War. During one briefing an Aircrew explained to me they encountered a Ball Lightening Encounter, also called Saint Elmo's Fire.  A sphere of charged particles entered the airframe of their aircraft while cruising at 40,000 feet.  The aircraft was a C-141 Starlifter.  The sphere about three feet in diameter entered the cockpit then floated inside the aircraft to the cargo bay where it hovered for a time then vanished. The entire crew witnesses the sphere and actually enjoyed the event.  They asked if I knew of any UFO sightings.  I then told them my story.  This upset my Squadron Training Officer who verbally reprimanded me, I was ordered to never speak about UFO's again.  I eventually retired from the military as a Major in 1997",
      "link": "http://www.nuforc.org/webreports/115/S115459.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c28bc",
      "summary": "From Phila. looking SE I observed an orange orb that traveled down and then away from my sight.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2014-10-03T00:00:00",
      "story": "From Phila. looking SE I observed an orange orb that traveled down and then away from my sight. On Sept.27th at approximately 5:45 A.M. (+/- 2 minutes) while viewing the south east skies (primarily more to the east vs. south) I noticed an orange orb under the star Regulus.   It appeared to travel straight down from Regulus to almost my viewing horizon and then travel south or distally away from my vantage point.  The orange orb continued on this path until finally dipping below my horizon and out of sight. I was able to apply both my 4x30 and 10x50 binoculars to the object.  This did not reveal any detail to enhance my description of the orb.  I played my Starry Night software and did not notice any satellites traveling in this pattern during this time period.  My background is I am a beginner star watcher with over a year sky watching experience.  I own a 4 x 30 and 10 x 50 range binoculars and a 100mm Orion tabletop telescope with the ability of 80x magnification at this time.",
      "link": "http://www.nuforc.org/webreports/113/S113960.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a31",
      "summary": "20+ fireball crafts flew over philadelphia and surrounding area. May have been military presence, but did not appear to have flickering",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2014-11-26T00:00:00",
      "story": "20+ fireball crafts flew over philadelphia and surrounding area.  May have been military presence, but did not appear to have flickering lights like most aircraft.",
      "link": "http://www.nuforc.org/webreports/115/S115573.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bea",
      "summary": "Lights flickering in the North Western Sky over Philly/Yeadon Area",
      "city": "philadelphia",
      "shape": "light",
      "date": "2014-11-14T00:00:00",
      "story": "Lights Flickering in the North Western Sky over Philly/Yeadon Area I was out in my yard in the evening getting my dog to do her evening ritual when I looked Northwest into the sky and saw some flickering lights.  I figured they were airplanes queued up for landing except I realized they were stationary.  They were not stars as they were flickering with high level of clarity as opposed to the way one would see a distant star flicker.  I noticed two of the lights were in sync so I figured then that maybe it was a tower that I just had never noticed before until other lights started to appear.  Some were moving very slowly.  Slow enough to be helicopters drifting as they hovered, but there was no sound and then more appeared.  Some disappeared and the two that were in sync went out of sync.  I noticed a total of about 10 lights.  I used my binoculars to see what I could but could only really make out balls of light as it was dark.  I did notice that at least one light was reddish while the others were mostly white. I went to get my wife to look and by the time she came out, the lights had gone from about 10 back to 2 and then a few planes came through the area and the lights disappeared.",
      "link": "http://www.nuforc.org/webreports/115/S115331.html",
      "state": "PA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c335a",
      "summary": "3 fast moving objects falling towards the earth during sunset with separate trajectories.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2015-03-06T00:00:00",
      "story": "3 fast moving objects falling towards the earth during sunset with separate trajectories. While driving from Cherry Hill, NJ, to Philadelphia, PA, at sunset we noticed the usual chemtrails but then we also noticed 3 objects traveling rapidly to the earth.  Each object had a small trail of smoke (different from chemtrails) that dissipated fairly quickly.  The three objects were very far away and it made it difficult to make out a shape.  We did notice each of the three had its own trajectory that appeared to originate from different locations but were traveling towards the horizon were the sun was setting.  They were traveling much faster than the usual plane in the sky.  The one closest to the horizon began to give off a spherical bright white light before it was not visible anymore.",
      "link": "http://www.nuforc.org/webreports/117/S117436.html",
      "state": "PA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3542",
      "summary": "Lights floating in distant sky east of Philadelphia, PA",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2015-03-06T00:00:00",
      "story": "Lights floating in distant sky east of Philadelphia, PA Observer:  Defense Contractor for US Military  Event:  My son and I attended the NHL Hockey game in Philadelphia between the Philadelphia Flyers and New York Rangers on 28 February, 2015, at the Wells Fargo Center.   While departing the game after it ended, at approximately 2315 at night, we observed multiple orange lights, perhaps 5-7 lights, in the distant Eastern sky, at an angle above the horizon, between approx. 35 and 15 degrees.  They reminded me of military flare used to illuminate the ground when shot into the sky or dropped by an aircraft.   They were in different heights and fairly close to each other in a vertical line.  There was some stagger to their order as they were not in a straight vertical line.   After watching for 2-5 minutes, they dimmed and then disappeared, while staying in the same spot in the distant sky.  They seemed to be floating and did not appear to be moving in any direction from our vantage point.  They were in line between the Wells Fargo Center and the flight path of airplanes landing from! east to west at the Philadelphia International Airport as the planes were visible crossing the vertical line of the lights",
      "link": "http://www.nuforc.org/webreports/117/S117543.html",
      "state": "PA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3508",
      "summary": "TIGHTLY GROUPED WHITE LIGHTS IN EAST SKY",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2015-03-26T00:00:00",
      "story": "TIGHTLY GROUPED WHITE LIGHTS IN EAST SKY Between 12:04 and 12:07 A.M. (not sure) on March 25, 2015, I witnessed the following from my back window in Philadelphia, PA, 19135:   In the East sky at an altitude of approx.. 60—70 degrees perspective from my second story window I saw a hovering set of three to four white lights (TIGHTLY GROUPED) which were parallel to each other and a middle blinking light centered below the other lights.   All lights were approx.. a (-2) apparent magnitude.   I then obtained my 10x50 binoculars and continued to view.  This did not bring about or yield any more detail about the hovering lights.  I could not see any specific structure supporting the lights.  Suddenly, the lights and any evidence they were there disappeared. There one second and gone the next!   I’m an amateur astronomer and familiar with aircraft navigation lights.  The entire duration of this sighting was about 30 seconds.   Any time I see and record spacecraft during the night I can verify that it was a satell! ite by using my software.  This was not the case.  This is a mystery.",
      "link": "http://www.nuforc.org/webreports/118/S118024.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3544",
      "summary": "Two green lights side by side moving in unison; apparently a single craft, gradually changing to red, then green, then vanished.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2015-03-13T00:00:00",
      "story": "two green lights side by side moving in unison; apparently a single craft, gradually changing to red, then green, then vanished. Just a few moments ago on the 3rd floor of my townhouse in South Philly facing City Hall exactly 2 miles away, I was putting my 3 year old son to bed.   He was over my shoulder looking out the window when he said, \"what's that?\"  Lots of helicopters and airport traffic pass over our heads on the way to the airport, and there's a helipad or two in the city so I'm quite accustomed to the aircraft in the area.  This one was intriguingly different.   I stood by the window to watch for about 2 minutes, then put him to bed, then ran up to our 4th floor deck, grabbed the binoculars and watched it for about 2 more minutes before it suddenly disappeared before my eyes.  \"It\" was two green lights side by side, kind of like headlights, but not blinking.  Usually you expect with aircraft to see white lights and/or red lights, and blinking.   The green was eye-catching.  It hovered west behind the Comcast skyscraper, then went UP, then wafted back east toward City Hall.  Then it turned red! Again no blinking, just both lights slowly changed to red.   It hovered around a bit as though circling City Hall, then turned green again, then gradually red, then like I said, right in front of my eyes, vanished.   I wondered if it was someone's toy drone or something but way too big and way too high for that, and way too bright in my opinion.   Wondering if anyone else saw it.",
      "link": "http://www.nuforc.org/webreports/117/S117728.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3682",
      "summary": "Just got this [5:16:36 PM]  https://www.youtube.com/watch?v=_g8YbADR1r8&feature=youtu.be UFO flotilla over Philadelphia, PA, December 2",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2015-01-07T00:00:00",
      "story": "Just got this [5:16:36 PM]  https://www.youtube.com/watch?v=_g8YbADR1r8&feature=youtu.be  UFO flotilla over Philadelphia, PA, December 27, 2014.",
      "link": "http://www.nuforc.org/webreports/116/S116268.html",
      "state": "PA",
      "duration": "10+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c37a8",
      "summary": "Three lighted object in triangle shape.",
      "city": "philadelphia",
      "shape": "triangle",
      "date": "2015-01-07T00:00:00",
      "story": "Three lighted object in triangle shape. In the back of our home in the Roxborough section of Philadelphia.  It was still dark, and I went to let the dog out because it was barking abnormally.  It never barks at this time, I simply thought it had to go relieve itself.   I opened the door and I heard a loud buzz, looked up and saw three lights in a triangle form.  They moved east very fast, but still within my sight line, then back west very fast and stopped in the air, I actually rubbed my eyes and looked back, screamed for the dog to come back, then went up to get my wife, she saw the same thing, this time we watched from our second floor balcony.  And they were making strange movements, nothing like an aircraft I have ever seen or known about.  Very odd experience.   We recorded it on my wife's cell phone.",
      "link": "http://www.nuforc.org/webreports/116/S116217.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a66",
      "summary": "Star-like object stationary for 2 hrs, then takes off at high rate of speed.",
      "city": "philadelphia",
      "shape": "sphere",
      "date": "2015-08-06T00:00:00",
      "story": "Star-like object stationary for 2 hrs, then takes off at high rate of speed My daughter, her husband, and I were sitting on her front step, at approx. 0130 on July 30, 2015.  We happened to notice a strange looking star-like object, maybe 45 degrees from the horizon.  We were looking north.  It was faintly flashing blue and red lights.\t    After observing it for a while, we started to notice tiny little lights going to and from it.  We got out the telescope, but having never used it before, it took us a while to find the object.  When we did, it appeared to be just a round white sphere.  We didn’t see any little lights with the telescope. The object didn’t move for approx. 2-2 ½  hrs.  As we were looking at the object, it took off at an extremely high rate of speed in an easterly direction.  There is a tree across the street, and I tried to run down the sidewalk to see where it was going, but by the time I got to other side of the tree, it was gone. Might I add that I was not a believer until I witnessed that.  I know that whatever I saw, was not from this world.  Even if I hadn’t seen it move, it might be different, but I saw it go from a complete standstill, to moving like nothing I’ve ever seen mover through the sky.",
      "link": "http://www.nuforc.org/webreports/120/S120860.html",
      "state": "PA",
      "duration": "2 1/2 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3c3cbd",
      "summary": "((Blimp?)) At first I thought it was a blimp but when I looked closer I saw that it was flat on the bottom.  Blimps aren't flat.",
      "city": "philadelphia",
      "shape": "oval",
      "date": "2015-07-03T00:00:00",
      "story": "At first I thought it was a blimp, but when I looked closer, I saw that it was flat on the bottom.  Blimps aren't flat, and it was flying at a rate of an airplane it went be hind a building and never came out on the other side.  Pictures attached. ((NUFORC Note:  Looks to us to be the Goodyear blimp.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119745.html",
      "state": "PA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e38",
      "summary": "Red and green lights over Philadelphia.",
      "city": "philadelphia",
      "shape": "disk",
      "date": "2015-06-24T00:00:00",
      "story": "Red and green lights over Philadelphia. Just before midnight when I was getting into bed I saw a bright red light outside my window.  I live on the 21st floor of an apartment building.  It was brighter than anything I've ever seen at night, so I walked to the window to take a look at it.   Off in the distance there was an object just hovering/floating.  It stayed in one spot for several minutes then it changed color from red lights to green lights.  After a few minutes it moved very quickly from one spot to another and just hovered in that spot for a few minutes.   I woke my girlfriend up to look and ran to the other room to wake my brother up also.  My girlfriend told me to take a video, but I didn't, thinking no one would believe me and not knowing that this website was out there.   After a few minutes it turned to red again and moved very quickly across the sky to another location.  After a few minutes the object started to drop down and disappeared behind a building that was in front of my building.  The object moved WAY too quick to be a helicopter or plane and just moved so effortlessly through the sky.   The colors were unlike anything I've ever seen and when they changed colors, it was like nothing I've ever seen.",
      "link": "http://www.nuforc.org/webreports/119/S119682.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3fb9",
      "summary": "3 disc shapes in unison fairmont park area phila.pa.",
      "city": "philadelphia",
      "shape": "disk",
      "date": "2015-05-22T00:00:00",
      "story": "3 disc shapes in unison fairmont park area phila., pa. Was at belmont/Fairmount plateau late at night near the bottom goin towards 76 E expressway and we saw 3 silent, bright, saucers moving slowy in unison, then still, then vanished! ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119091.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c441a",
      "summary": "We observed red lights coming from the west. At first there were just two or three. Within 15 minutes there were at least 25-30 silentl",
      "city": "philadelphia",
      "shape": "",
      "date": "2015-11-19T00:00:00",
      "story": "We observed red lights coming from the west.  At first there were just two or three.  Within 15 minutes there were at least 25-30 silently moving along and each group turned towards the south, where they changed formations and altitudes.  We took some pictures and a video.  These were NOT helicopters or any aircraft we recognized.",
      "link": "http://www.nuforc.org/webreports/123/S123791.html",
      "state": "PA",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c47b2",
      "summary": "Three lights faded in and out of view, changed from a triangle to a line formation, and disappeared.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2015-11-06T00:00:00",
      "story": "Three lights faded in and out of view, changed from a triangle to a line formation, and disappeared. Seen these once before from my east-facing window.  Three lights appeared in a triangle formation, faded in and out of view, changed to a straight line formation, and then faded away again.  They don't move much once in formation, they just hover.  Took several pictures as evidence, but of course they don't show much, as I couldn't see much myself.",
      "link": "http://www.nuforc.org/webreports/123/S123336.html",
      "state": "PA",
      "duration": "~1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a3a",
      "summary": "Erratic lights hovering over Philly suburbs.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2015-10-29T00:00:00",
      "story": "Erratic lights hovering over Philly suburbs. At around 2200 10/27/2015, as my wife and I arrive home in our apartment complex, we were discussing our issues, when I see a light moving across the sky and dismissed it as an airplane.  It had green, red, and yellowish/white lights running across it.  Couldn't tell the shape because it was behind some trees in the distance.   What caught both my wife and I's attention was that the lights returned to a position in the sky where we could see it behind the tree in a swaying manner.  Not typical for an aircraft, and after spending 10 years in the Air Force (Edwards AFB & Pentagon), I knew that was not normal not even for a helicopter to maneuver in such an erratic manner.   We lost sight of the object after it dipped down below the treeline in the distance. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123203.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4dd5",
      "summary": "Black balloon and another man in black.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2015-08-13T00:00:00",
      "story": "Black balloon and another man in black. November 2008, about 5 minutes past 8:00 pm.  I'm walking home alone from a friend's house.  Something catches my eye on the night sky.  It looks like it appears to be a black balloon drifting above the sheet metal factory that's located above my block as I'm thinking.   I keep my eyes on it with the intentions of watching the balloon until it drifted away and was no longer in sight.  But this object didn't do just that, it paused in mid air.  Once that happened, I slowly jogged closer to the sheet metal factory to get a much better view.  What I then seen in the sky was a perfect black circle with a thin white rim around it. Very still and not moving but floating above the metal factory.  I was the only person outside at the time.  On usually a bright busy street it seem very still and somewhat dark that night, for the circle to be darker than the sky.  My cell phone wasn't advanced enough to take a good photo of the object so I figured why waste my time trying to record ! for such poor quality.   I keep my eyes on the object for a good 15 seconds.  Suddenly, the white door beside the sheet metal factory on Wyncote avenue opens up and out came a African American male wearing all black.  Long sleeve black shirt, black pants, and black boots.  This man was standing directly under the object floating about the building.  He smoothly lit up his cigarette staring at me from across the street, but I gave him temporary attention and looked back up at the object.  Then in a quick second, the object disappears.  Not saying a word to the man in black across the street.   I anxiously run to my house and tell everyone the exclusive news.  This happened at the very exact location of me meeting the strange Asian like man in black.  This took place many months close to a year after my first encounter. ((NUFORC Note:  One of three seemingly credible reports from same witness.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120982.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4dd4",
      "summary": "Two strange encounters at the same location in Philadelphia.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2015-08-13T00:00:00",
      "story": "Two strange encounters at the same location in Philadelphia. It was like a black balloon darker than the night sky with a thin white rim around it.  I thought of someone releasing a balloon at the time but it was stuck in mid air, no cars riding pass on usually a busy street, no people just me and a strange black male wearing all black looking like a security guard standing across the street, but directly under the object, if you get what I'm saying.   This was in November 2008, but it still bothers me till this day.   At the same location, years later, I had an encounter with a strange pale looking Asian guy.  The location is Woolston Avenue and Wyncote, Philadelphia, PA, 19138, over top of a sheet metal factory that is still here today in August 2015.   My friends call me high and make jokes about me when I tell the story to them over and over, I just want to know what I am experiencing.  Call me ((name deleted))",
      "link": "http://www.nuforc.org/webreports/120/S120958.html",
      "state": "PA",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4dd3",
      "summary": "Men in black are real, no one can tell me otherwise.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2015-08-13T00:00:00",
      "story": "Men in black are real, no one can tell me otherwise My first strange encounter. A past girlfriend of mine has been evicted from her north Philadelphia apartment, with no where for her to go, I ask my grandmother, \"Can my girlfriend spend the night with us, since she has no where go?\"  My grandmom replied, \"No, she cannot stay here,\" which led to me and my girl leaving the house together and getting into her 1993 Buick lasabre that was parked at the very beginning of the block.  We could not figure out where to go at that time, so we both ended up dosing off and falling asleep in her car with the seats reclined back. To my surprise I wake up from hearing an aggressive knock at the dark tinted passenger window beside me.  The knock was similar to the way a police knocks on your window at a regular traffic stop.  I turned my head towards the window, I look up and see an Asian like man with very dark pitch black eyes, both of his eyes were black like some sort of demon staring right at us.   I reach for the handle to open the door and approach this strange looking person, and my girlfriend pulled back on me saying, \"Don't get out of the car, why ((profanity deleted)) do his eyes look like that?\"  In a scared tone.   So me playing the brave guy role at the time, ignoring my girlfriend I get out of the car anyway and approach this person.  Feeling slightly dizzy and drowsy like I would normally waking up out of a short sleeping session.  I'm literally standing about two feet away from this guy, directly looking into his eyes, thinking to myself, \"This is one ugly strange looking ((profanity deleted)).   His skin was so pale which made him look even weirder. He was dressed in a black tight fitting long sleeve black shirt, with black cargo pants and black footwear, and he was built like a small Asian guy with Asian like features.  The closer I'm moving towards him, the more jumpy this guy is acting but not in a aggressive way, more like a defensive way as if I was going to attack him. I ask him \" what's the problem?\"  And he responded in a soft low tone saying, \"Yea, man just go home.\"  I replied back wiping my dreary eyes still feeling dazed saying, \"I live on this block.\"  Then he replied for the second time saying \"yea I know, just go home man,\" like he was trying to help me out.  So I asked feeling slightly disturbed and annoyed saying\" so what are you a cop or something?\"  Then he replied back somewhat studdering with a slight snicker saying \" ye yea I'm a cop\".   I said \"ok\" as the guy turns his back to me and walk towards this vehicle that's double parked crookedly in th! e street I'm also stunned by the vehicle he gets in.  It's a white Hyundai, not just any average white Hyundai.  This was one of the most amazing, cleanest, spotless vehicles I've ever seen in my life at the time.  They look similar to the way they look now in 2015 but this was back in the 2007 or 2008 time period. The headlights on the car were extremely bright shining down the block opposite of me.  I mean these light were bright, and he was driving alone because I noticed no one else in the vehicle.  I got a good look of the front of the car and seen the tilted \"H\" symbol on the grill of the car.  That last how I know it wasn't a Honda, this was a Hyundai.  It was like a car in the future to me back then, and how they look now reminds me of this encounter every time I see one ride past. He then sped off down wyncote avenue and I got back in the car with my girlfriend.  She's asking me \"what did he say?  I tell her that he must've been an undercover cop and her car probably matched the description of another car used in a crime in my neighborhood.  With that said I flagged the situation away like it was no big deal and continued the rest of the night out with my girlfriend. What puzzles me about this, is the fact that no police badge was present at the time, no walkie talkies, no back up no weapon.  This guy was very gentle but intimidating. ((NUFORC Note:  One of three seemingly credible reports from same witness.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120992.html",
      "state": "PA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c50fe",
      "summary": "((HOAX??))  One or two bright green circles flashing darted through the sky, it scared the hell out of me. I live in the NW Phila..",
      "city": "philadelphia",
      "shape": "",
      "date": "2016-02-19T00:00:00",
      "story": "One or two bright green circles flashing darted through the sky; it scared the hell out of me.  I live in the northwestern Philadelphia and I saw the we lights in the southwest corner of my lawn. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125877.html",
      "state": "PA",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c516a",
      "summary": "4 orange lights seen moving W to E over Philadelphia. Two lights moving together at some distance suddenly got close to each othe",
      "city": "philadelphia",
      "shape": "light",
      "date": "2016-02-19T00:00:00",
      "story": "4 orange lights seen moving west to east over Philadelphia.  Two lights moving together at some distance suddenly got close to each other before disappearing.  Followed by two separate orange lights shortly, thereafter.   Reminiscent of planes or Chinese lanterns, but not quite like either. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125897.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c51b2",
      "summary": "Eight fire ball shapes flying west , north, and straight up, but calm manner.  They were focused.",
      "city": "philadelphia",
      "shape": "changing",
      "date": "2016-02-04T00:00:00",
      "story": "Eight fire ball shapes flying west , north, and straight up, but calm manner.  They were focused It was 8pm on Sunday bight, and my boyfriend called his son and myself outside.  Red looking fireballs coming one after another flying in the skies.  It was light orange, but more in vivid red color and round with the naked eye.  They were approximately 2-3000 feet in air.  Very, very visual.  Flying over our head.  One after another.  These objects were heading northwest . When I look up couldn't believe my eyes.  They just kept coming.  Furthermore, there were commercial planes heading east passing them.  However, it did not effect these strange anomolies, or crafts. Lastly, some disappeared west into clouds, as thou they flew straight up into the sky.  Mean while, others headed northwest direction with no sound, as well. Overall, I have pictures to post.  And, 49 years of life , first time I witmessed such a event!  Red balls flying north, west , and straight up!  The pictures are all different shapes and colors.  As I kept snapping.  Furthermore, i have a photo, from a family member, in Bucks County that I've been holding.  She sent them to me, the night they came over her yard,  which is not the first time.  These images are amazing!  She will remain anonymous.  In the end, I too have seen with my very own eyes, so I'm ready to release her photo now.",
      "link": "http://www.nuforc.org/webreports/125/S125574.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5299",
      "summary": "Flashing red/ green light, circling in sky. NE Philly.  ((NUFORC Note:  We suspect the time is wrong, but will check.  PD))",
      "city": "philadelphia",
      "shape": "",
      "date": "2016-01-20T00:00:00",
      "story": "Flashing red/ green light, circling in sky.  NE Philly I looked up at the sky like I do every night when I get off the train and yesterday I saw something Ive never seen before.  There was a small light, not too high, up in the sky, changing colors from red to an aqua green/blue.  It pulsed from color to color, having a solid red colors at times.  It never really flashed white and we couldn't hear a sound.   The path was a big circle, every once in awhile it was hover and head up higher in the sky but the entire time the colors would alternate and change.  Possible sound came from but I cant say for sure with the location I was in and the passing planes in the sky.  We had a friend keeping watch, and at one point a spotlight was on the object and soon after disappeared.",
      "link": "http://www.nuforc.org/webreports/125/S125281.html",
      "state": "PA",
      "duration": "3.5"
    },
    {
      "_id": "64d005f478aba2ec5a3c53d2",
      "summary": "Dark half oval flying over house, then disappearing into the dark sky.",
      "city": "philadelphia",
      "shape": "oval",
      "date": "2016-01-08T00:00:00",
      "story": "Dark half oval flying over house, then disappearing into the dark sky. A half oval the size of 2 or 3 row homes flew over the house, flying south east.  Slowly disappeared into the distance.",
      "link": "http://www.nuforc.org/webreports/125/S125142.html",
      "state": "PA",
      "duration": "4-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5467",
      "summary": "Craft seen with lights on top and bottom.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2015-12-21T00:00:00",
      "story": "Craft seen with lights on top and bottom. December 18, 2015     Sir:  About 17:35 CST, in the Northeastern quadrant of Neshoba county, Mississippi, I witnessed a craft of unknown size for about 2 minutes.  This was a little after sundown but still there was enough light for me to see my dog about 75 yards away.  I couldn't tell the shape because of the bright lights that were situated on the top and the bottom of the craft.  I watched it hover for the period of time stated and then entered my home to call for someone else to observe.  When I again exited my home the object was gone.  The appearance of the object, as far as I could see, was as though there was a straight line with three lights on top and three lights on bottom.  As I said, the lights were very bright and prevented me seeing any detail other than what has been stated.  From my position, I was looking approximately at a 30 degree angle and the object was about ¾  of a mile away.  After it was no longer in my view, about 7 to 10 minutes later,  a jet came from the north, heading in a southern direction.  To our NNE, about 50 miles away is Columbus Air Force Base.  To our SSE is the Meridian Naval Air Station, about the same distance.  I hope this helps. I have an MBA and a B.S. Degree in Secondary Education.  I was stationed at Redstone Arsenal, in Huntsville, Al as a meteorologist.  I used to own a Mercedes dealership.  I tell you these things to let you know that most people consider me sane.  Not that it should matter, I'm 66 years old.",
      "link": "http://www.nuforc.org/webreports/124/S124742.html",
      "state": "MS",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c55e2",
      "summary": "Bright white light disappears against bright blue sky",
      "city": "philadelphia",
      "shape": "light",
      "date": "2016-07-08T00:00:00",
      "story": "Bright white light disappears against bright blue sky Against a bright blue sky, there was a bright white light that was moving.  As it moved, it became smaller very quickly until it disappeared against the sky.  It was moving away from Earth, not parallel like a plane.  Within seconds, the light was gone.",
      "link": "http://www.nuforc.org/webreports/128/S128216.html",
      "state": "PA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5833",
      "summary": "Bright red/orange non pulsing lights observed over metropolitan area.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2016-06-10T00:00:00",
      "story": "Bright red/orange non pulsing lights observed over metropolitan area. Three very bright red/orange non pulsing lights observed over Northeast section of city 15 miles north of airport.  Two lights flew slowly in formation, rear light at about 4 o'clock position.  Third light circled first observed lateral to the two circled behind and disappeared.  Two lights tracked until they disappeared in clouds (clouds at about 5000 ft.)   One light may have had purplish non-pulsing light in center.  Lights were too bright to be navigation lights and wrong color for anti-collision strobes.",
      "link": "http://www.nuforc.org/webreports/127/S127725.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c59d1",
      "summary": "Round, white, lights in night sky above Philadelphia, PA, May 3, 2016.",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2016-05-10T00:00:00",
      "story": "Round, white, lights in night sky above Philadelphia, PA, May 3, 2016. On May 3, 2016, Philadelphia, PA, 8:39 PM, on steps of the Philadelphia Museum of Art, facing downtown, I took two photos with my Iphone.  The first is wide view.  The second is zoomed in, from the same step location, immediately after the first. I did not notice anything in the sky when I took the photos.  My intent was to get a photo of the city at night. Later when looking at the photos, I noticed the row of lights in the clouds.  I can assume reflection in the clouds, or reflection on the camera lens, but a few observations leaves some doubt.  The lights change position in relation to the buildings.  The lights keep their same relative size to the buildings. I take that to be the lights were in the sky above or beyond the buildings, and the lights moved in relation to the buildings. The other item is that the lowest light is brighter than the 7 above it. The sky was cloudy.  I estimate the distance from the photo position on the museum steps to the tall buildings in the photo is 6000 feet, scaling from a map. Please review the photos I emailed and let me know if you think the largest probability is that it was city lights reflecting, and how to discount the relative position change with the buildings.  If the clouds were moving and the lights were reflections, I doubt the lights would have maintained their relationship with each other.",
      "link": "http://www.nuforc.org/webreports/127/S127203.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c5a0e",
      "summary": "Wife and I were on Hwy 15 North 5-7 mi. outside of Philadelphia, MS, when we noticed a hovering group of 5-7 fireballs.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2016-05-10T00:00:00",
      "story": "My wife and myself were driving on Hwy 15 North five to seven miles outside of Philadelphia, MS, when we noticed a hovering group of between five or six  fireball  shaped objects.  These objects would separate almost instantly ! Also we were astonished at how fast these objects would  go from extreme altitudes to tree top levels  or even lower!   As we both have always been able to debunk anything UFO related this encounter baffled us and even frightened my wife to the point that we are now firm believers in UFO's.",
      "link": "http://www.nuforc.org/webreports/127/S127266.html",
      "state": "MS",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a3e",
      "summary": "Barbecuing on the deck Saturday night and was shocked seeing red flair like objects traveling at about 30 mph in no certain formation.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2016-05-06T00:00:00",
      "story": "Barbecuing on the deck Saturday night and was shocked seeing red flair like objects traveling at about 30 mph in no certain formation.  Going from south heading north. Got video.",
      "link": "http://www.nuforc.org/webreports/127/S127149.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a3d",
      "summary": "Orange orbs in groups of four or five flying in triangle or line.",
      "city": "philadelphia",
      "shape": "fireball",
      "date": "2016-05-06T00:00:00",
      "story": "orange orbs in groups of four or five flying in triangle or line April 30, 2016, at about 9:30 pm Philadelphia, PA.  I saw about five groups of orange yellow orbs flying over my street. They flew almost in line, one or two blinking as it went.",
      "link": "http://www.nuforc.org/webreports/127/S127120.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c8f",
      "summary": "Bright white object by Phila Airport High Up Across Sky",
      "city": "philadelphia",
      "shape": "other",
      "date": "2016-03-24T00:00:00",
      "story": "Bright white object by Phila Airport High Up Across Sky Observed near Phila. Int’l airport at 9:29 PM.  Probably a comet or debris covering a 30’ degree arc below the moon, from about high noon to about 2:30 in the sky east below the full moon.  Clear sky.  Stars.   Was white in color and went in straight line at a very rapid rate with no trail.  Then disappered without fallout or change in colors.",
      "link": "http://www.nuforc.org/webreports/126/S126491.html",
      "state": "PA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e28",
      "summary": "4 Bright White Cigar/Long Disc Shape - Traveling Slanted in sky - Dissapeared & Reappeared 3 jets chasing them -Witnessed by 2 in car",
      "city": "philadelphia",
      "shape": "other",
      "date": "2016-11-11T00:00:00",
      "story": "4 Bright White Cigar/Long Disc Shape - Traveling Slanted in sky - Dissapeared & Reappeared 3 jets chasing them -Witnessed by 2 in car On Saturday, November 5th, 2016, roughly some time between 5:15-5:45 PM EST, myself (driving) and another male occupant (passenger) in a moving car traveling South on  Route 1 in Northeast Philadelphia witnessed 4 objects in the sky that appeared to have either been being chased or observed by 3 military jets. It was at that point in the late day, when the sun is just starting to go down, so it was still very bright outside.  The sky was extremely clear, and there was not a  single cloud in sight anywhere to be seen. As I was driving South on Route 1 in Northeast Philadelphia, I was passing right at the area of Route 1 (Roosevelt Boulevard) and Oxford Avenue, and I was in the far  left lane of the middle lane. I just happened to look up at the sky in front of me and to the left, when I noticed what I right away assumed to be just a white cloud  stationary and not at all moving up in the sky. After passing Oxford avenue, I got stuck at the next traffic light.  I kept looking at the object and noticed that it was not moving at all, and that there were no  clouds anywhere in the entire sky.  As I kept staring at it, I thought it was a very starge looking cloud, and then very quickly realized it was not a cloud at all. When I realized this was not a bird, cloud, or an airplane or helicoptor, or any known aviation object I have ever seen before, I asked my passenger, \"Do you see that  up there?, What is that?\"  He was amazed just like me and we sat in traffic for about 30-90 seconds just staring at it. It was not moving at all, niether were we.  That  is how we know it was not moving. I was driving, and because we both were staring in confusion at just what exactly we were looking at, it never occured to either one of us to get a photo of it with  our phones.  I'm not sure it would have turned out anyway. We started driving again, and I could see it starting to move downwards, or in the direction coming closer to  the ground.  But it was very, very high up in the sky, and it was oviously very big. In front of me and to the left there were high trees, and we both lost sight of the object for a few seconds, then we saw it again after passing the trees off the side  of the road.  We came to another traffic light and were stopped.  And then thats when we could see it more clearly, and we had the trees as an eye-sight-marker, as the  object was in back of the foreground trees in our sight. So once we were stopped we could clearly see the object more visible in detail and how it was movong and traveling using the tree as a marker. It kept moving downward in back of the trees, and as soon as we started driving again, when we got out in the open more where the sky was more open and visible, thats when we saw them. 3 more  of the same exact kind appeared out of nowhere to the left of the first object we saw. We dont know if they were already there and were just obscured by the trees or not, but I only saw the one at first, when the viewable sky was all open for my vision. And like I stated above, it initially was not moving and was actually closer.  The more we drove in it's direction (South) the further away it became.  It was oviously  movong very fast. There were a total of 4 objects in the sky, and they were all the exact same shape and white-brightness, still not known if it was the sun refecting off the object, making it so bright during that time of day, at least thats how I percieved what I was looking at. My passenger said that the other 3 to the left just dissapeared and  then reappeared right in the air.  I did not see that myself. The Description of the Object: - It was a very bright-white, possibly from the sun reflecting off it's surface, and it was either the shape of a cigar, but it was tilted. And when it moved, it  stayed titled, no matter which direction it moved, the tilt stayed. Im not sure about the cigar-shape, but I would describe it more like this: If you took a frisbee  and looked at it directlyin front of you looking at the side, so you not seeing a circle, but the other way, it would look like a sstraight line, but slightly ovaled,  but then on top of that, tilt it so that the left end it pointed down and the right end is pointed up. There were no colors or visible features, but it was also very high and far away to be able to clearly see it. When I thought it was traveling downwards closer to the  ground, I really think it was traveling further away. That is how fast it was moving. It, and the other 3 just kept getting smaller and smaller, you could tell they  were moving very fast. And as it moved, like I mentioned, the \"tilt\" of the object never changed. Still driving, I looked to the right up in the sky to see if there were more of these things, and that's when I saw, very, very high up, 3 jets/planes of some kind,  looked to be classic silver/metal in color of a jet, traveling in the same direction as the objects. All 3 jets were moving what seemed to be slow compared to the  other 4 objects. Each jet was leaving a clear small air vapor behind itself which quickly dissapated. As soon as I turned my head away from the 3 jets to the right sky, I watched the 4 objects to the left start moving extremely fast, as if they just caught wind of the  3 jets coming their way. If these were, oviously, military jets sent up to observe or chase these objects, they would most likely have been sent from Willow Grove Air  Force base in Warminster, Pennsylvania, which was roughly 20 miles away from our driving location. They must have gotten there quick, because when I first looked  around after seeing the first object not moving at all, I saw nothing else anywhere. And the 3 jets were pretty high up. At this point we both observed the 4 objects, which seemed to be each about 2 miles apart from each other, and the other 3 further ahead now from the 1st object we  witnessed, traveling at great speed, still with the \"tilt\" not changing at all, all 4 objects within 3 seconds, just took off southbound at incredible speed, and then  they just dissapeared over the horizon. To describe the 1st object, as it was stationary and not moving in better detail, it just hung in the sky, like a cigar, tilted, shining very bright white, as if the  sun was reflecting off it, I am pretty good at judging distance with my eyes, so just a guess, I would say it was about 1-2 miles in length, and roughly about 5-6  miles away. I really wish I could have got a photo of it when is was just sitting there in the sky, but I was driving and it all happened to fast. This was the first time for both of us ever seeing an object we could both say was a UFO for sure. If it was a black-project type object, who knows. But we are  absolutely both sure of what we witnessed, and this was not a mistaken known aircraft. And also we both have never seen such a thing, or expected to ever see such a  thing in this area of Northeast Philadelphia where we were at the time. The entire thing was very strange.  We did look around at other drivers to see if they were looking up at it too, and we did not see anyone looking at it.  Although,  people were driving, it would have been hard to have witnessed it, unless you were stuck at a light, and just happened to look up. I even had my window rolled down with my head out the window, so I know my vision was not obscured in anyway.  That was it.  The objects vanished once they took off  southbound at an incredible high rate of speed, staying at their \"tilt\" in the sky, and 30 minutes later, the sun was gone and that was the end of it.  We witnessed nothing else afterwards as we drove in the opposite direction going home.",
      "link": "http://www.nuforc.org/webreports/131/S131039.html",
      "state": "PA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ea2",
      "summary": "Lights in the sky in Philly!!!  ((NUFORC Note:  Advertising lights.  PD))",
      "city": "philadelphia",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "lights in the sky in Philly!!! Saw central ball of light ,with four other lights coming from the center and returning back with random pattern the four lights went out from the central light above 200 feet spun clockwise and returned to the central light It was witnessed by myself, son in law next door neighbor and passing pedestrians .there was no sound no helicopters no flashing lights as a plane would have and there was nothing emmiting light from the ground.  whatever this was it was in the air. ((NUFORC Note:  Advertising lights.  We have corrected the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131602.html",
      "state": "PA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fe9",
      "summary": "A single orange light traveled in a slow, erratic, yet seemingly controlled pattern across the sky.",
      "city": "philadelphia",
      "shape": "sphere",
      "date": "2016-10-21T00:00:00",
      "story": "A single orange light traveled in a slow, erratic, yet seemingly controlled pattern across the sky.  After two minutes, the light went completely out.",
      "link": "http://www.nuforc.org/webreports/130/S130627.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6030",
      "summary": "Using my binoculars I witnessed a cigar shaped, rusty orange colored object fly from my south to east .",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "2016-10-27T00:00:00",
      "story": "Using my binoculars I witnessed a cigar shaped, rusty orange colored object fly from my south to east . Looking out my window while star gazing I witnessed a slow moving object travel from my south to my east at an altitude of aprroximately 65 degrees.  At first I thought the object was an aircraft.  Upon further inspection with my 10 x's binoculars there were no navigation lights however the craft was somehow illuminated.  Its color appeared a rusty orange.  Through the binocs the size of the UFO would be compared to a jet airliner.  I could not make out any exact details of the flying object except it was cigar shaped with what appeared to be solar panels or wings of some kind located around the middle of the its body. The evening was clear, the moon was not up yet and in or near it's last quarter phase. Conditions were favorable for star gazing.  My dilemma, since there were no lights on the aircraft, why or how was it illuminated? Looking through my binoculars (10 x's)the craft I saw was about the same size as a jet airliner. The UFO gave no emission or contrail. It had to be in at least a low orbit around our planet. That far away, looking through my binoculars it appeared to be the same size as a jet airliner.  The object had to be gigantic for it to appear the size as a jet airliner. How else could the object be illuminated if not from the moon's reflection.  I've seen, on many occasions, the ISS and never have been able to see any detail of that craft the way I did this object. So, here I am making a UFO report.",
      "link": "http://www.nuforc.org/webreports/130/S130802.html",
      "state": "PA",
      "duration": "55 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c60fe",
      "summary": "Outside about 7;30 pm on sat 9/24/16 cleaning and doing maintenance work at my auto repair shop in phila when I look up, its now dusk,",
      "city": "philadelphia",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "outside about 7;30 pm on sat 9/24/16 cleaning and doing maintenance work at my auto repair shop in phila when I look up, its now dusk, and see three, looked like burning pieces of paper or debris in the sky, all heading the same way.  2 of them went side by side the first one disappeared very slowy into the clouds. no engine noises whatsoever, or any other noise, not even a dog barking like all day.  the 2 that were side by side shot out some kind of bluish light, like they were looking for something or communicsting w each other then went up into the clouds.  you could see a blacklouette of them in the clouds.  3 more came from the same way as the first 3 but 1 either went the total opposite way, north, or it came down?  the other 2 were leapfrogging and going in the same direction as the first 3. then they would just stop.  they went right over my head and I was waving my arms and they stopped again.  after a brief moment, they proceeded, not a sound.  looked like 2 burning orange embers floating through the air.  COOLEST UFO EXPIERENCE IN MY LIFE SO FAR. they are here!  going back out now again, 8:30pm any body else see this,  I cant be the only one!",
      "link": "http://www.nuforc.org/webreports/130/S130191.html",
      "state": "PA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c64b4",
      "summary": "Flash of light falls from sky and disappears when it hits the ground.  ((anonymous report))",
      "city": "philadelphia",
      "shape": "light",
      "date": "2016-08-25T00:00:00",
      "story": "Flash of light falls from sky and disappears when it hits the ground. Walking home from dinner and drinks w/ friends at a local restaurant.  Met my roommate before leaving campus to head back to our apartment together instead of alone as it was getting late.  Walking back with my roommate, I saw a streak of light, that I thought was a helicopter crashing to the ground.   I grabbed my roommate's arm and screamed to make sure she saw it, and she agreed that she also had.  I had a drink with dinner and wanted to make sure I wasn't just seeing things, since she was totally sober, I knew what we had seen was real.   As we crossed the street to get closer to where the object had \"crash landed\" and there was nothing in sight.  On the object, there was a bright white light, that was streaked and almost had a tail, with a duller blue light at the end of the tail.  It had a similar shape to a stroke of a paint brush or something like that.  There was only one, but it was clear that it disappeared by the time it hit or got close to the ground. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129464.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c679f",
      "summary": "What did we all see?  Same craft, different night.  ((NUFORC Note:  Possible sighting of Venus??  PD))",
      "city": "philadelphia",
      "shape": "changing",
      "date": "2017-03-10T00:00:00",
      "story": "What did we all see?  Same craft, different night. My friend and I have just seen the same exact object in the sky that was described to us also by her sister and father earlier in the month, but did not believe it at the time.   Tonight it is 68°, no clouds.  Just a calm and warm night.  Appeared to be higher than aircrafts in altitude and distance, yet also seemed very large in size and almost translucent.  The craft looked like many contiguous circles changing formation with rope-like structures behind it, that could be described to as shaped like DNA.   Then continued to change shape to a round, arched object before getting out of view.  It moved slow the whole time, but was only in our sight for about 3 minutes. ((NUFORC Note:  Possible sighting of Venus??  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132937.html",
      "state": "PA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c67ff",
      "summary": "Small light travelling fast slows to mid air stop for another light to catches up and they both slowyou flewith away. Over center city.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2017-04-13T00:00:00",
      "story": "Small light travelling fast slows to mid air stop for another light to catches up and they both slowyou flewith away.  Over center city. Waking from a nap in the living room of my loft to a beautiful clear sky and Shiney City skyline with unlimited visibility.  Watching aircraft fly normal pattern I saw a small but bright circular light which looked like another aircraft beat an aircraft of similar size to a reference point and slow to a mid air stop.  Another light caught up to it and they slowly begin travelling together before disappearing above my building.   I have footage from my Android S7 phone.",
      "link": "http://www.nuforc.org/webreports/133/S133500.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c68fb",
      "summary": "I was at the corner of Allegheny and Kensington in Philadelphia waiting for the bus. It was approximately 8 am on 4/3/17  It was a love",
      "city": "philadelphia",
      "shape": "diamond",
      "date": "2017-04-07T00:00:00",
      "story": "I was at the corner of Allegheny and Kensington in Philadelphia waiting for the bus.  It was approximately 8 am on 4/3/17   It was a lovely morning and I was looking at the sky and clouds and saw a black object quite high.  I was facing north/northwest.  My first thought was that it was some debris floating on the air currents -  but it was not just floating along  - it was moving quite slowly from east to west.  The object was dark black, shaped like a wide diamond – or a square object on a corner.  It did not appear to reflect light – however I noticed a light that flashed about 4 times in the 10 minutes or so I was looking at it.   I asked a young woman , also waiting for the bus if she saw it – she said yes -  I asked her if it looked like a helicopter?  She said she didn’t think so.  I’m afraid I didn’t get her name, but if I see her again I will ask.  I did try to take some photos – but I don’t believe they show much since the object was so high up and I! ’d think, quite distant.  I can send them if it is requested",
      "link": "http://www.nuforc.org/webreports/133/S133409.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c69dc",
      "summary": "I noticed an extremely bright object ascend from below the horizon at a high rate of speed and in a perfectly straight line.",
      "city": "philadelphia",
      "shape": "chevron",
      "date": "2017-03-10T00:00:00",
      "story": "I was standing out front of my house, which is located on route 532 in NE Philadelphia, at 9:20 PM (EST).  I was speaking on the telephone when my eyes were drawn to the western sky above Philadelphia.  I noticed an extremely bright object ascend from below the horizon at a high rate of speed and in a perfectly straight line.  The object was made more clearly visible due to its brightness against the fully overcast night sky.   The object stopped its ascension and took an eastern line of flight.  Stopping after approximately 5 seconds of steady travel, the object made a 180° turn at which time it revealed having three bright white lights and one bright green light.  After the 180° turn, the object rocketed in a straight line path back to its original position above the western sky and then descended back below the horizon.   I stayed on the telephone with my fiancé for the entire duration of the sighting, and afterword made a phone call to the above listed hotline number.",
      "link": "http://www.nuforc.org/webreports/133/S133018.html",
      "state": "PA",
      "duration": ">1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c0d",
      "summary": "Solid/flashing light over the Atlantic Ocean.  ((NUFORC Note:  Report from commercial/ATP pilot.  PD))",
      "city": "philadelphia",
      "shape": "light",
      "date": "2017-01-12T00:00:00",
      "story": "Solid/Flashing light over the Atlantic Ocean. December 26, 2016.  While on a routine flight from New York to Miami, we saw a very unusual light.  We were in cruise at FL410, Mach .80, unlimited visibility with a temp of -55c, approximately 100NM off the coast near Atlantic City (close to Philadelphia), and on a true course of around 160.  Between 2130-2200 EST. I looked up I saw a very large and bright flashing light, which I brought to the other pilot’s attention.  His response when seeing it was pretty much the same as mine…. “What in the hell”… “What is that?”   The size of course is hard to tell.  The other pilot explains it as 3-4 times the size of the largest star around.  I think it was 4-5x.   The object was approximately 25-30 degrees up from our line of sight when I first saw it.  Its range of motion was between the horizon (from what I could see) to around 35 degrees up from our line of sight.  At first sight the light was approximately at our 1 o’clock position.  It moved to 12, 10, 11, back to 12.  At that time, the light appeared to move North, then south, at a pretty rapid rate.  Or I would describe it as closer and further from our position as the size seemed to get larger and smaller.  The light ended in the 1st position and then moved out east and once at our 10 o’clock position disappeared.  The other pilot stated he could see an! orange/red flash in between the white flashes.   We did flash our lights at it a few times and the other pilot believes it flashed back in sequence, I felt the return flashes were probably coincidental, but possible.  The flashing didn’t really appear to have any pattern.  The whole incident lasted a minimum of 10 minutes. Neither one of use have ever seen and/or heard of an occurrence like this.  We were going to report it to ATC, but mutually decided to let it be.  I have no explanation for what we saw nor does the other pilot.  We did try to video the incident, but it wasn't possible. Captain ((NUFORC Note:  We spoke twice via telephone with the source of the report, and he sounded to us to be both sincere, and sober-minded.  We suspect that he is a superlative, and highly reliable, witness.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132051.html",
      "state": "PA",
      "duration": "10 minutes plus"
    },
    {
      "_id": "64d005f478aba2ec5a3c72fd",
      "summary": "((HOAX??))  Four people saw an orange dot moving in different directions.  ((anonymous report))",
      "city": "philadelphia",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "Four people saw an orange dot moving in different directions. Four of us in South Philadelphia saw a strange orange light moving in different directions in the sky.  Looked like a star but it was bright orange. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134247.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c74f5",
      "summary": "The outline/shape of the disk and the lights underneath were very clear but the disk seemed colorless!",
      "city": "philadelphia",
      "shape": "oval",
      "date": "2017-05-11T00:00:00",
      "story": "The outline/shape of the disk and the lights underneath were very clear but the disk seemed colorless! Out for evening walk!  SURREAL!  Partial cloudy sky...  Moon behind us....  Out of no where, these flashing lights [red, amber, blue/green] appear in the sky, and this craft starts doing cartwheels, and other maneuvers!  It was at the lowest level of clouds but seemed no more than 300-500 feet above our heads!  Going straight [NE], then immediately turning left; goes a short distance and comes back to the right doing unbelievable wobble type moves while going in UNPREDICTABLE directions! VERY FAST!  Then takes off going W/NW and disappears into clouds!  As it takes off doing wobbly type maneuvers and lights flashing clear & bright a jet begins to streak across the shy from the direction the ufo came from and is on a straight line path towards this space craft but it never catches-up!  My wife and I both saw this very clearly!  Her eyes are MUCH BETTER than mine.....  I saw one craft [ship?] that was about the size of the moon and somewhat changed shape [round to oval] as it performed half-cartwheels, left to right.  My wife saw this and a smaller craft interact. ((NUFORC Note:  Source of the report elects to remain anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134057.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c75f3",
      "summary": "Definite sighting,  No question about.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2018-01-12T00:00:00",
      "story": "Definite sighting,  No question about. The object was small enough to be a butterfly- (definitely NOT an insect.)  It was \"bowtie\" shaped and the color BLACK. fast moving and seemingly attracted to the electronics in the household of which it was flying in.  SIDE NOTE;  Air traffic Seemed to be busier then usual.  Strange and disturbing indeed…",
      "link": "http://www.nuforc.org/webreports/138/S138334.html",
      "state": "PA",
      "duration": "~1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c7967",
      "summary": "Saw a vertical line of light. It didnt seem to move much at first. It began blinking turned to the right and held a diagonal position f",
      "city": "philadelphia",
      "shape": "other",
      "date": "2017-12-04T00:00:00",
      "story": "Saw a vertical line of light.  It didnt seem to move much at first.  It began blinking turned to the right and held a diagonal position for a moment before turning into 2 dot lights then reforming a vertical line.  Of light.  From my position it was on about 4 inches but it's a clear night and I know what I saw was not a plane or anything.  It stayed in the sky for 10 or so minutes and one by one all of the lights dimmed leaving one light on making it look like a light or star.  It was still there when I went to search for information about it.  When fully lit up, it looked like a vertical bar of light like a fluorescent light bulb.",
      "link": "http://www.nuforc.org/webreports/137/S137490.html",
      "state": "PA",
      "duration": "10-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a2b",
      "summary": "Very low dark slow moving object.",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2017-11-17T00:00:00",
      "story": "Very low dark slow moving object. Second sighting in 2 days, different craft.  Approximately 6:40 P.M. I Observed what can only be described as a gigantic dark, slow moving, silent object that’s only distinguishing feature was the reflection of the street lights on its surface.   As it continued to move N to N-E, I lost its outline as a result of the bright street lights.  It was very low to ground.   Moments later 2 helicopters seemed to fly over the exact area.",
      "link": "http://www.nuforc.org/webreports/137/S137209.html",
      "state": "PA",
      "duration": "Moments"
    },
    {
      "_id": "64d005f478aba2ec5a3c79f6",
      "summary": "Bright strobe lights in frantic pattern.",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2017-11-17T00:00:00",
      "story": "Bright strobe lights in frantic pattern. On 11/10/17, at approximately 830 pm, in the NE direction of the Port Richmond section of Philadelphia, we spotted a pattern of bright strobing lights that can only be described as frantic.   The object quickly disappeared over horizon.  Sighting lasted 1-2 minutes.  Cell phone video available.",
      "link": "http://www.nuforc.org/webreports/137/S137204.html",
      "state": "PA",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a6c",
      "summary": "Red lights.",
      "city": "philadelphia",
      "shape": "rectangle",
      "date": "2017-12-04T00:00:00",
      "story": "Red lights.",
      "link": "http://www.nuforc.org/webreports/137/S137549.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c5c",
      "summary": "Unkown bright object high in sky towards NW in Philadelphia, PA",
      "city": "philadelphia",
      "shape": "unknown",
      "date": "2017-10-05T00:00:00",
      "story": "Unkown bright object high in sky towards NW in Philadelphia, PA Me and my girlfriend were walking to our house after parking and spotted an extremely bright flicker of bright white light high in the sky towards the NW.  It was slowly moving and appeared to have a dull gray or black ring around it.",
      "link": "http://www.nuforc.org/webreports/136/S136497.html",
      "state": "PA",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cf9",
      "summary": "Lime green light flashed in the sky before going straight down behind some trees.  ((anonymous report))",
      "city": "philadelphia",
      "shape": "light",
      "date": "2017-09-21T00:00:00",
      "story": "Lime green light flashed in the sky before going straight down behind some trees when on unruh st and tackawanna st. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136192.html",
      "state": "PA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ee6",
      "summary": "Appeared in the N, slow approach, but flying horizontally to the east. 12 or so total.  Good photos. ((MUFON report))",
      "city": "philadelphia",
      "shape": "light",
      "date": "2018-05-04T00:00:00",
      "story": "Appeared in the N, slow approach, but flying horizontally to the east. 12 or so total. Good photos. Witnessed a bright red-orange light in the sky to the north, heading east, from the back yard. It was traveling linearly; horizontally to the east at a uniform speed.  Showed my wife before it blinked once and finally disappeared.  Another appeared.  And then a sequence of 4, like the letter C, came.  Then a sequence of 3.  My wife watched and shot footage in front of the house. One or two more single orbs flew by.  They flickered like fires and would blink in an out at what seemed like the end of their path, so they disappeared, but not behind trees or buildings.  They produced no sound. It did not seem like a full ship, to me, but a series of lights in the sky on the same trajectory.  I say this because the lights, from my vantage point, seemed random.  Not like the Phoenix Lights, which sound similar. (MUFON site has good photos)",
      "link": "http://www.nuforc.org/webreports/139/S139667.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c80fb",
      "summary": "~3 orb-like lights kept circling in random form, & then moving away, together.  ((NUFORC Note:  Adv. lights?  PD))((anonymous report))",
      "city": "philadelphia",
      "shape": "light",
      "date": "2018-03-08T00:00:00",
      "story": "3 or so orb like lights kept circling each other in a random form, and then moving away and the. Towards each other, then up and down, at first I thought it was projections from an event or facility, but I saw it on I-95 and it kept happening in the sky my entire drive into Philadelphia (stopped once I reached the airport).  So it couldn’t have been from one specific area as a projection.  My car was running funny (it’s brand new), but i didn’t have full control of the wheeI  felt there was a force that kept trying to swerve it just a tiny bit (not enough to cause an accident, just at random times my car would shift as if it was very windy but it wasn’t during that time.  Car twice made weird noise, and I could tell others on the highway were noticing the orbs too. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139067.html",
      "state": "PA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c81f6",
      "summary": "Tic-tac looking object very high in sky, with a jet plane behind it traveling southwest over central Mississippi 2:50pm.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2018-01-25T00:00:00",
      "story": "Tic-tac looking object very high in sky, with a jet plane behind it traveling southwest over central Mississippi 2:50pm. I was standing in the drive way of my house.  I looked up and noticed a jet in the sky with a long trail of smoke coming out the rear.  Then I noticed an object about 5 inches in front of it,  I'm standing on the ground.  It looked like two tic-tacs, one in front of the other, but almost touching.  It was traveling southwest.  This object appeared higher in altitude than the jet and moving a little faster.  It looked light in color, almost white.  But once the sun hit it appeared a very shiny silver almost like an led light.",
      "link": "http://www.nuforc.org/webreports/138/S138516.html",
      "state": "MS",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8593",
      "summary": "On 9/07/2018 I was standing in my yard. I was feeding my dogs when I looked up and saw a bright object that I could not identify. I kno",
      "city": "philadelphia",
      "shape": "sphere",
      "date": "2018-09-13T00:00:00",
      "story": "On 9/07/2018, I was standing in my yard.  I was feeding my dogs, when I looked up and saw a bright object that I could not identify.  I know it wasn’t a aircraft.  The object was probably 1500-2000 feet.  The object was bright white moving fast from south to north, around 10:00pm the object was not blinking.  You could see normal aircraft flying with the red and green lights around their normal cruising altitude.  It was probably visible for about ten minutes.",
      "link": "http://www.nuforc.org/webreports/143/S143087.html",
      "state": "MS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c86ff",
      "summary": "Long, black, rectangle.",
      "city": "philadelphia",
      "shape": "rectangle",
      "date": "2018-08-10T00:00:00",
      "story": "at 3:55 saw a large long black rectangle moving across the sky in Philadelphia, it was going in an east to west direction not super fast but at a good speed  I was in the Bridesburg section of Phila while driving south on Richmond St..",
      "link": "http://www.nuforc.org/webreports/142/S142596.html",
      "state": "PA",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8857",
      "summary": "Everyone was on a big hill, with not a lot of trees, so we could see the sky pretty clearly.",
      "city": "philadelphia",
      "shape": "other",
      "date": "2018-07-05T00:00:00",
      "story": "At the fireworks, everyone was on a big hill, with not a lot of trees, so we could see the sky pretty clearly.  On the opposite side of the hill to the fireworks was this tiny green light by itself, not moving.  About every five minutes it would change from green to red.  Then, at one point, a second one appeared near the other one and did the same with the colors changing.   After the grand finale of the fireworks, they turned red and shot across the sky together and onto the side with the fireworks.  Then they slowly went down above the distant treeline and disappeared",
      "link": "http://www.nuforc.org/webreports/142/S142072.html",
      "state": "PA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bb4",
      "summary": "Blue lights seen in sky of Philly!",
      "city": "philadelphia",
      "shape": "flash",
      "date": "2019-02-27T00:00:00",
      "story": "Blue lights seen in sky of Philly! We were driving home from New York to Abington when near the end of the trip, we saw the sky was blue, then there was a bright flash of blue light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144992.html",
      "state": "PA",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9251",
      "summary": "I have brief video of what looks like 2 white circles moving. We live bu airport and this is definitely not a plane",
      "city": "philadelphia",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "I have brief video of what looks like 2 white circles moving. We live bu airport and this is definitely not a plane",
      "link": "http://www.nuforc.org/webreports/149/S149851.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c932a",
      "summary": "There were strange lights floating in the sky it almost seemed like bags of light or flashes of light but they were definitely moving p",
      "city": "philadelphia",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "There were strange lights floating in the sky it almost seemed like bags of light or flashes of light but they were definitely moving purposely in a direction",
      "link": "http://www.nuforc.org/webreports/150/S150076.html",
      "state": "PA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9403",
      "summary": "specks of light traveling in the pre dawn crisp clear night high altitude and velosity.",
      "city": "philadelphia",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "specks of light traveling in the pre dawn crisp clear night high altitude and velosity. Philadelphia Pa recent observations: 11/8/19 5:30 am. Back yard in N W Philly. 66 Y O male A clear night sky looking up I see a speck of light moving South my perception of the distance and speed of the speck of light suggested it was not a plane no blinking lights. It was not following the typical flight paths of commercial airways I am accustomed to seeing. Observed until it faded from visual site. Turning my view North I see another same brightness and velocity as before this light heading east and again this one observed until it faded from view. My observation previously at around the same morning hour on a clear crisp morning in the back yard looking north I noticed a speck of light traveling south with a more erratic change in its vector a very subtle zig zag if you will. Observed until the speck of light visually changed into what I would call something similar to a small round mint lifesaver candy and instantly vanished from view.",
      "link": "http://www.nuforc.org/webreports/150/S150467.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c942d",
      "summary": "Clear Saturday night , fall, hiding in the trees",
      "city": "philadelphia",
      "shape": "disk",
      "date": "2019-12-19T00:00:00",
      "story": "Clear Saturday night , fall, hiding in the trees On the boulevard coming home from Oxford Valley Mall on a sat night around 9:30-10:00. In the tress that’s lined the Roosevelt Blvd going northbound, there was a disc shaped craft with lights spinning in the trees.  Multiple cars were stopped staring at this thing. We stopped & looked & drove away because we were afraid. This happened in the early 1980’s. My older sister , younger brother , me & my parents all saw this thing . There was no fair or carnival in that area during that time.",
      "link": "http://www.nuforc.org/webreports/151/S151408.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c959f",
      "summary": "Strange globe sighting--1969.",
      "city": "philadelphia",
      "shape": "sphere",
      "date": "2019-10-04T00:00:00",
      "story": "Strange globe sighting--1969. Thank you for allowing me to share my own story. Back in July 1969, I was a teenager of 16 yrs old. I was lying in bed semi-asleep, when a high-pitched sound started. This sound was like a pure sinewave tone, I would estimate around 10Khz to 15Khz. I thought it was the cheap table fan on the small table by the window - it was a hot night. So I went to shut it off, thinking the motor maybe needed oiling, and I'd do that the next day. My parents and sisters were alseep in their rooms, and I didn't want to wake them by going down the squeaky stairs to the basement for oil. When I shut the fan off, the noise continued, and seemed to come from outside. I walked over to the window, which was open, and looked out. What I saw was utterly amazing to me! Hovering motionless over Mr Allen's roof which was about 150 feet away, was this globe-like thing. It was about 5 or 6 feet in diameter, perfectly round, and was a dark greyish semi-shiney color. It just hovered there, not moving, and I kept hearing that \"whistle/tone\" that I mentioned before. There were no lights on it. I went to my parents bedroom and woke my mom up, but she complained that I was goning to wake my dad up - I told her to come to my room, she refused and told me to go back to bed and shut up. So I went back to my bedroom, and sat by the window, watching that thing, amazed by it. After about 20 minutes, it literally flew straight up in the air and disappeared, and instantly that sound stopped, like turning off a switch. The speed of this thing was almost instant, like 500 miles an hour I would guess. It just vanished! I weant back to bed, lay there and eventaully drifted off to sleep. But I'll never forget what I saw, and I know it wasn't a dream, because the next day mom confronted me about waking her up the night before. I've talked about this to others, and the usual response was typical - thay I was making this story up. But I know better. I'm not dumb. Thanks again for allowing me to share this.",
      "link": "http://www.nuforc.org/webreports/149/S149273.html",
      "state": "PA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c968f",
      "summary": "Spinning flying object in Philadelphia, silver and shiny like appearance.  Captured it on video",
      "city": "philadelphia",
      "shape": "cigar",
      "date": "2019-10-04T00:00:00",
      "story": "Spinning flying object in Philadelphia, silver and shiny like appearance. Captured it on video I saw a oval/cigar flying object on my way home from a football game.  I captured a video of it too.  It appears to be flying and spinning at the same time. It appears to be shiny, having a somewhat silver appearance.  I believe it was just one craft.",
      "link": "http://www.nuforc.org/webreports/149/S149454.html",
      "state": "PA",
      "duration": ""
    }
  ]
}