{
  "city": "pittsburgh",
  "fetch_timestamp": "2025-07-12T14:34:03.515185",
  "record_count": 142,
  "pages_fetched": 7,
  "api_calls": 8,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4330",
      "summary": "slow moving, chevron shaped object with brights lights on underneath of wings made no sounds.",
      "city": "pittsburgh",
      "shape": "chevron",
      "date": "2006-05-15T00:00:00",
      "story": "slow moving, chevron shaped object with brights lights on underneath of wings made no sounds. the object was traveling approximately 10mph and abut 200 feet high.  it had a body sort of box shaped with chevron shaped wings.  it hovered for about 5 seconds and then made an immediate 180 degree turn and continued along Route 19 about 6 miles south of Pittsburgh Pa.  We kept it in view for around 3 minutes and stopped to try and get a better look it turned again and continued in a North West direction.  It continued to travel at a slow rate of speed and at the same 200 ft above ground.  I put down the window of my vehicle and it emitted no sounds.  It appeared almost transparent at times.",
      "link": "http://www.nuforc.org/webreports/049/S49582.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b48c5",
      "summary": "UFO was going about 70 or more mph over a river.  It was gone within a blink of an eye.  It looked like a circle then a ring around it.",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2019-07-25T00:00:00",
      "story": "The UFO was going about 70 or more mph over a river. It was gone within a blink of an eye. It looked like a circle then a ring around it.",
      "link": "http://www.nuforc.org/webreports/147/S147571.html",
      "state": "PA",
      "duration": "A few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b1e",
      "summary": "Shiny silver disk or saucer over Mt. Lebanon, Pennsylvania, then disappeared.",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2019-07-05T00:00:00",
      "story": "Shiny silver disk or saucer over Mt. Lebanon, Pennsylvania, then disappeared Pittsburgh, PA. June 28, 2019:  I walked outside in my backyard to take my dog out at around 8:35 PM.  I could sense a storm coming over my way so I looked up into the clouds and noticed a super bright object.  The grey clouds were out in the distance, and the shiny object was right overhead.  It caught my eye at first glance - that’s how shiny it was.  I stared at it for five minutes and realized it could not have been a star nor a plane.  It was located way too high in the sky for it to have been a plane.  I’ve seen both of those things during a sunset and neither of those were what I witnessed. I was watching the object, which looked exactly like a UFO, for 15 minutes straight.  It was a shiny silver color, and it looked horizontally elongated, like a disk.  It did not move. At about 8:50 PM, I saw the shiny object disappear into plain sight.  Again, it didn’t move or anything when I saw it fade away.  It’s like it camouflaged itself right into the color of the sky.  I did not see it after that.",
      "link": "http://www.nuforc.org/webreports/147/S147151.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4c32",
      "summary": "There were 2 small round lights in the sky going towards each other at a medium rate of speed. No blinking lights and too far away/fast",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2019-06-27T00:00:00",
      "story": "There were 2 small round lights in the sky going towards each other at a medium rate of speed.  No blinking lights and too far away/fast to be airplane.  The 2 lights eventually flew right past each other and then disappeared.  Too close to each other to be normal aircrafts.  Too slow to be shooting star.  No reports of any asteroids or meteors.",
      "link": "http://www.nuforc.org/webreports/147/S147000.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d10",
      "summary": "Was on my back patio enjoying the evening when my mother said to look at the two strange objects in the sky. I looked and noticed the o",
      "city": "pittsburgh",
      "shape": "oval",
      "date": "2019-06-07T00:00:00",
      "story": "Was on my back patio enjoying the evening when my mother said to look at the two strange objects in the sky.  I looked and noticed the objects were gaining height and glowing orange.  Next thing, the one object drops out of sight while the other gained height and vanished.  A couple minutes later two more objects appear doing the same thing and then vanish.  Incident lasted about 12 minutes, including one more object appearing.   Thought it might be Chinese lanterns but watched videos of them and they didn't glow or perform the mannerisms of these objects.",
      "link": "http://www.nuforc.org/webreports/146/S146547.html",
      "state": "PA",
      "duration": "10-12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f40",
      "summary": "Clear sky, metallic like.",
      "city": "pittsburgh",
      "shape": "oval",
      "date": "2019-04-18T00:00:00",
      "story": "Clear sky, metallic like.   It was in the evening.  My friend and I were waiting outside and we see an oval type object that was metallic and was shining bright reflecting the sun as it set.  It came from the horizon and floated/flew behind a set of tree’s slowly and we couldn’t see it after that.  There was no clouds that day and we’re 100% sure it was not a plane, blimp, or helicopter.",
      "link": "http://www.nuforc.org/webreports/145/S145670.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f14",
      "summary": "I've came across sightings of a alien form flies and walks on the ground it's clear it comes in several differen",
      "city": "pittsburgh",
      "shape": "changing",
      "date": "2019-04-18T00:00:00",
      "story": "((name and phone number deleted)) I've came across sightings of a alien form flies and walks on the ground it's clear it comes in several different colors red with a clear back all white in clear they have no problem flying around people in daylight I've noticed them playing in a puddle of water they've been here for a while reviewing the camera work",
      "link": "http://www.nuforc.org/webreports/145/S145657.html",
      "state": "PA",
      "duration": "Pittsburgh"
    },
    {
      "_id": "64d005f478aba2ec5a3b546b",
      "summary": "Orange yellow sphere size of small house hovers above trees 50 feet away from young girl on country lane",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "",
      "story": "Orange yellow sphere size of small house hovers above trees 50 feet away from young girl on country lane Behind a small practice driving range being built by my dad,in a still countrified unpopulated outer suburb of Pittsburgh, we saw a very large orangish/red slightly pulsating sphere.  It was about as big as a small house, and it was about 50 feet away from us, hovering behind and above a group of trees where a one house country lane ends to becomes dirt path into the forest.  After remaining as a whole sphere for about 7 minutes it began to slowly disappear in unsymmetrical blotches over a period of about 2 minutes-appearing to me as if it were transmigrating into another dimension. ((NUFORC Note:  Date may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57902.html",
      "state": "PA",
      "duration": "7-10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5468",
      "summary": "Senior corporate pilot and company officers witness a peculiar object from the cockpit of a DC-3.",
      "city": "pittsburgh",
      "shape": "cylinder",
      "date": "",
      "story": "As Chief Pilot for ((name of major company deleted)), I flew a group of their top scientists from Teterboro, New Jersey, to Wright Field, Ohio, on May 15, 1952.    We were in a DC-3 at 8,000' on an IFR flight plan and about a thousand feet on top of all clouds.   Around 10:15 and about 110 miles East of Pittsburgh, my copilot spotted a strange object flying with us and about 500 feet off our left wing.  It was a black, shiny cylinder round on each end and it had no wings, empennage, engines or windows.   We called Pittsburgh Radio and asked if they had any aircraft in sight near us.  They reported none.   We called our passengers up. one by one, and asked if they could see anything.  They were shocked to see the object flying beside us.   The object shot ahead of us and waited for us to catch up.  It zig-zagged across our course for half an hour.  One of the scientists calculated its speed at 1,500 mph.  It ultimately disappeared ahead of us.   We were all sworn to secrecy by the ((senior company officer)) on board, ((officer's name deleted)), because we were on our way to secure the largest research contract in ((company name deleted)) history from the Air Force and, at that time, just about anyone reporting an UFO was considered to be a wacko.   We couldn't even discuss the event with our families.   I am now ((age deleted--eighties)) and retired after 17,500 hours of flying for the Air Force and for corporations.  My copilot and passengers are all deceased.  I simply want to go on record that I and seven cool, competent observers calmly observed this object and never reported it.   Incidentally, while I was at Wright Field I asked one of their senior pilots what the fastest USAF plane could fly at. The answer was: around 500 mph. I prefer to keep this report confidential. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate, and that he will check his flight logs for the precise date.  We spoke with this witness via telephone during a lengthy conversation, and we found him to be sober-minded, and we suspect that he is an exceptionally good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57512.html",
      "state": "PA",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3b54b6",
      "summary": "Saucer observed about 500 feet up moving into clear blue sky and flying square corners.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "",
      "story": "Saucer observed about 500 feet up moving into clear blue sky and flying square corners. After 2 morning job interviews in Pittsburgh a light rain had stopped with only clear blue sky and some low white cloud rolls were left not very high over the small hills beside the highway.  While driving south on PA Route 51 just a few miles from downtown Pittsburgh a movement toward the end of one cloud caught my eye.  When I looked up and saw it I figured it was a puff of black smoke and looked back at the road.  Then the movement which I could see out the top of the windshield on the passenger side caught my eye again and when I looked up I witnessed a round disc shaped object slip slowly from the cloud  into clear blue sky.  It was so obvious what it was I laughed and said aloud, \"Hey, you lost your cloud cover.\"  Judging by the size of a small plane's wing span of about 30 feet I'd guess that to be the same distance across this craft.  The craft was moving as if following a beam and was moving very slowly  sideways tilted away from me so I was viewing the bottom I'd think.  Shortly after losing the cloud cover and being only around 500 feet up it suddenly went to a higher altitude which would be about twice the height it was at or approximately 1,000 feet. There was no wavering or turning when it went higher, it went up at the same angel it was slanted at and moved in one motion, it did not start out slower, get faster then slow down to a stop.  The speed up to the higher level was at the same more accelerated rate, this movement took the craft away from where I was on the highway. I was now looking at it in the top middle of my windshield and where it stopped at it still had the same slow sideward movement.  It proceeded to go across the highway where I was watching it out of the top left of the windshield.  Then as suddenly as it went to a higher altitude it came back down to about the same level it was at when I first saw it but still had the same slant.  I watched out the driver's side window and observed it slide right into the end of another cloud.  This craft looked gray wi! th no li ghts or other distinguishing features and never changed its tip or slant and did not turn to go to a higher level or back down.  I think the most obvious thing about this sighting was the perfect lines or beams it was following with no wavering at all.  I received very good grades in Physics and I know even to this day that we do not have any type of propulsion system to make a craft fly like what I observed. ((NUFORC Note:  Date may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57681.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5df6",
      "summary": "Low UFO sliding out of a cloud into clear blue sky.",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "",
      "story": "Low UFO sliding out of a cloud into clear blue sky. Early morning drizzle stopped around noon, sky was clear blue with low white cloud rolls which were approximately 300 feet above the small hills of about the same height.  While driving south on PA State Route 51 a few miles south of downtown Pittsburgh just after noon a darker spot appeared in the end of one of these clouds seen at the top right of the windshield.  A quick look determined it was probably a puff of black smoke but another look was surprising to see a round saucer shapped craft slide out of the cloud into clear blue sky.  It was moving slowly from right to left bringing it closer but was tipped at about a 45 degree away.  Shortly after appearing in clear sky the craft went to a higher level about twice the height it had been at.  When it reached the higher level it still had the slow sideward motion and same degree of tip.  The motion to the higher lever was faster than the slow sideward movement but did not start out slow then get faster and slow down before stopping.  It was one smooth move and being tipped at that degree it carried the craft farther away and easily seen from the top of the windshield as it slowly crossed over the highway.  When it reached a point where it could be seen out of the driver's side window it suddenly came back down to about the same level it was when first seen.  The smooth fast motion back down was the same as when it went up and the tip never changed so it came closer.  When it stopped it still had the same slow sideward motion and it was observed sliding into the end of another cloud roll.  This craft never wavered and moved as if it was following a beam, when it went higher the craft maintained the same slant.  Assuming the visible part was the bottom of the craft no features,lights or sound was noted.  Judging by the height of the hills and clouds the size of this disc would be about the same as a small plane's wingspan.  Having recieved A's in Physics it was obvious this craft was moving with no propulsion system anyone had in 1965 an! d in fac t still do not today.",
      "link": "http://www.nuforc.org/webreports/061/S61127.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6530",
      "summary": "Transucent/transparent, crescent, uni-wing shaped object viewed through binoculars filling field of view",
      "city": "pittsburgh",
      "shape": "other",
      "date": "2007-06-12T00:00:00",
      "story": "Transucent/transparent, crescent, uni-wing shaped object viewed through binoculars filling field of view \tI must preface this report by saying that it is a secondhand account of this event.  It was observed and reported to me by my brother and his wife. I am 57, male, my brother is 55.  I am college educated at the master’s level. My brother works in technical design. \tI believe this sighting occurred on 10-28 or 10-29-2006 near 10 PM. in a suburb of Pittsburgh about ten miles from the center of town. A few weeks prior to this night my brother and wife went to a small observatory to view a comet. A couple of weeks later the comet had become bright enough to view with binoculars and on the evening  mentioned they were in their yard with binoculars, 7x35 and 10x50. The sky was dark and crystal clear without any cloud cover . \tAs they were both looking through binoculars trying to locate the comet at a position bout 45 degrees above the horizon, my brother suddenly sighted something for which he has no explanation. He told me that he immediately realized that he would probably only have a brief  time to view what he was seeing and became intense in an effort to observe and remember details. This is where his report gets kind of weird. \tThe main characteristic of  the object was, well, he said the best way he could describe it was,\"“It looked like the Romulan vessel (from the TV series Star Trek) when it would become cloaked (turning invisible).\"  He observed it for about seven to ten seconds.  During that time it was moving and changed direction twice.  The motion did not appear to be fast (unless this was much farther away than he realizes in which case the object would also be extremely large).  The first change in direction was about ninety degrees to the original motion and then ninety degrees back to the original path and then he lost sight of it. During this movement it moved toward him and overhead. \tWhen I asked him about it’s altitude, he was uncertain since there were no clouds,only stars, but said if he had to guess it was probably cloud level or lower. Later he calculated size and distance by measuring the field of  view in his binoculars at a known distance on land. The image he saw that night filled the entire view of his binoculars. He concluded if it was 200 - 300 feet it must have been about two to three thousand feet high or about one half mile. Closer and it would have been smaller. He heard no noise. Fartheraway and it would have to be larger. \tAt this point, he asked his wife if she had just seen anything. Her response after a moment of hesitation was, \"Well, it was kind of invisible.\"  He told her not to say another word, not wanting to bias his memory of the observation.  He asked her to come into  the house.  He got two pieces of paper and they went into separate rooms to draw what they saw. \tHe showed me the drawings.  They were simple outlines.  Remember that it was invisible. Also remember that they were both looking through binoculars and the object filled the entire field of view in his 10x50.  One thing that I noticed between their drawings was that the overall proportion of width to length were quite the same.  The overall shape and proportion resembled a crescent moon but not as curved, more elongated.  And rounded, not pointed at the tips.  The leading edge was curved and smooth, however, the back edge was less curved and both curves bowed forward in the direction of motion. \tAdditional detail noticed by my brother (looking through more powerful binoculars) but not his wife is as follows:  The back edge was serrated like a steak knife with seven points.  Along the entire front edge were what appeared to him as markings.  Each was a mirror image of the next and he described them as ornate curls as on a wrought iron railing or perhaps a curled animal’s horn.  This whole image appeared as translucent or transparent except for the details mentioned. \tMy brother could not come up with any possible explanation for what they saw. He definitely ruled out clouds, vapor trails, etc.  It was moving, changed direction and maintained the definite shape as described.  He was glad his wife was with him in that their mutual observation verified the reality of the sighting.  Otherwise, he feels that he would question and have a hard time believing that he really saw this (?). ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56551.html",
      "state": "PA",
      "duration": "7- 10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6676",
      "summary": "Two bright lights that did not move and that weren't there a minute ago.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Two bright lights that did not move and that weren't there a minute ago. My friend and I were on the roof deck eating dinner and star watching.  He had pointed out the big dipper to me, we looked away for a second then looking back I noticed two very bright stars that hadn’t been there a second ago.  I pointed them out to my friend and he commented on the fact that it was very strange.  From our position they were to the north northeast, one was right above the other but the top one was brighter.  As we watched the bottom one faded away completely and then a few seconds later the top one dimmed then faded away.   They did not move at all, there was no sound and there was no way it was an antenna or plane.  ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain anonymous; provides only e-address.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56661.html",
      "state": "PA",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b677c",
      "summary": "Bright yellow flying disk, dark center, observed flying over city of Pittsburgh Pa.",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "Bright yellow flying disk, dark center, observed flying over city of Pittsburgh, PA. My friend and I were walking through a local park in the city of Pittsburgh close to midnight on Sunday night.  We were heading west towards the park entrance, my friend was ahead of me.  We were going back to where he thought he dropped his cell phone earlier. As I was walking, I was looking up at the sky noticing how nice the stars looked, trying to pick out constellations.  After about a minute of star gazing I observed to what at first to be a bright, yellow in color, meteor streaming across the sky.  But while looking at the object I noticed there was no trail behind, I also saw that within the yellow glow that there was a very distinct disk shaped craft with a darker center (very solid looking).  I only observed it for about one to one and a half seconds max. The object appeared to stop, or rapidly slow down, at one point in midflight, (for a mille second) and continue its flight at the same rate of speed, maybe around 100,000mph.  I observed it flying at an altitude of 400-500 ft., moving silently, no noise at all , traveling in a straight path from the SSE towards the NNW.  I estimated its size to be about 250ft across. In the time I saw the object it appeared to clear about 30-50 miles (within 1-1.5 sec.). Unfortunately neither my friend, who was searching for his phone, nor the bum in the park could confirm my sighting, to my knowledge I am the only person who had seen the object. I am a custodian with the Pittsburgh Public Schools, a very \"normal\" person.  What I saw that night left me frozen in shock, I couldn’t move or speak, I even cried a bit (could have been due to my eyes being wide open from the experience). What I saw was real, I don’t know what it was but it was there.",
      "link": "http://www.nuforc.org/webreports/063/S63548.html",
      "state": "PA",
      "duration": "1-1.5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c48",
      "summary": "3 UFOs sighted over a nighborhood, moving in strange, irregular patterns.",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2008-06-12T00:00:00",
      "story": "3 UFOs sighted over a nighborhood, moving in strange, irregular patterns. Witness 1- I saw a planet or sphere shaped object. It was glowing red white, then blinked white twice again. It was also moving in an odd pattern as if it was having engine problems and started to shake.  Witness 2- I encountered or sighted 2 strange objects moving across the sky. The first object was shaped like an old fashioned UFO seen in movies. It was glowing green and white. It moved very strangely. It seemed to be spinning at about 60 mph and moved up and down in an irregular wave-like pattern. The second UFO I sighted was glowing white and was shaped as if a bulging pan. It also appeared out of thin air with a dim flash and shot like a bullet. It disappeared fast and also disappeared with a flash, but, this time the flash was brighter.",
      "link": "http://www.nuforc.org/webreports/063/S63731.html",
      "state": "PA",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b10",
      "summary": "I saw three black disk shaped UFOs moving at a constant speed during the day and they were at a very low altitude and moving very slow.",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2007-02-24T00:00:00",
      "story": "I saw three black disk shaped UFOs moving at a constant speed during the day and they were at a very low altitude and moving very slow. It was bright daylight when I saw three disk shaped craft in the air, against a bright blue sky.  They were black and flying at a very low altitude.  They weren't moving fast, in fact unusually slow for any aircraft, slower than even a bird would normally fly.  One could say they were hovering but moving at a very slow pace.  I was in the library studying for school at the time the sighting occurred.  I just happened to look out the window I was sitting next to, and there they were.  I also saw a light on the object.  I couldn't tell if there was a light on all three of them, but I only saw one light appear at a time.  The light may have been blinking, or I may have only seen it every so often because the object was rotating.  It was hard to tell what exactly happened although these objects were very close to me.  They changed directions like this while all three of them remained in a very tight formation all moving the exactly the same speed.  They did not slow down to move around one another or anything.  What really seemed out of the ordinary was that the objects were extremely close to one another.  At times it was hard to tell if there was more than one of them; not saying that they became one at any point, but that is how close they were.  The rotated around one another, perhaps in a circle each one taking turns being the lead craft.  They left my sight however as my view became obstructed by the edge of the building.  I then moved to another window to see them, but I did not see them again.  Also peculiar was that there seemed to be more jets than usual after I saw the objects.  Now I have just moved to the city about six months ago, but I know where the airport is and what it looks like when jets and planes leave for takeoff or come in to land.  I saw three different jets, too far away to tell if they were commercial airliners or fighter jets, but it was very unusual.  Usually when looking into the sky there may be one plane every ten minutes that one could see in the sky from where I was, for there to be three at once was very unusual.  They were flying at seemingly random areas of the sky, not anywhere near where they would be if they were coming in to land or were just leaving the airport.  The jets also seemed to be climbing in altitude at an unusually high pace, for whatever reason, but I do not think that commercial airliners would climb at this high of a rate.  Whether this had anything to do with the objects I saw, I do not know, but I do know that this alone was very unusual.  After I saw this occur, I went out again to see if anything else was out there, but there was no sign of any strange objects.  I then went inside while the jets were still flying above me.  I could not unfortunately get a picture of the objects as the camera I have on my phone is could not take a clear picture of the bright sky.",
      "link": "http://www.nuforc.org/webreports/055/S55242.html",
      "state": "PA",
      "duration": "2-3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b36",
      "summary": "Driving North on Route 60, near the Pittsburgh International Airport. Above the airport, and a little north, there was a bright reddish",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2007-02-01T00:00:00",
      "story": "Driving North on Route 60, near the Pittsburgh International Airport. Above the airport, and a little north, there was a bright reddish orange object in the sky.  It was motionless in the air.  After passing the airport, the object dissappered. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55038.html",
      "state": "PA",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e57",
      "summary": "It was a clear night in October, about 1994.  I saw a bright white “star like” thing in the sky. It was NOT moving. I was facing down t",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "It was a clear night in October, about 1994.  I saw a bright white “star like” thing in the sky.  It was NOT moving. I was facing down town Pittsburgh.  I was in the North Hills.  The bright light started to twinkle, as most stars seemed to do, but then it started to become larger and brighter, approx 3-4 times larger and much brighter, still NOT moving.  At this time, the object immediately condensed back into its original size and brightness and then shot horizontally at a massive speed to where it appeared to be over the south Hills.   It then halted for a micro second, and shot up vertically at a complete right angle into the clouds as fast as it went horizontally.  I never said anything about this until know, because people think you are crazy. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Date in October 1994 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72531.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b84e7",
      "summary": "A brief, bright light in Western Pennsylvania.  ((NUFORC Note:  Missile launch.  PD))",
      "city": "pittsburgh",
      "shape": "changing",
      "date": "2009-12-12T00:00:00",
      "story": "A brief, bright light in Western Pennsylvania. On september 19, 2009 at a few minutes before  8:00 PM,  in Cheswick, PA. - north of Pittsburgh - I saw in the southeast near Jupiter a very bright light with a hanging illumination like a Degas ballerina skirt.  It was near jupiter, about ten degrees east.  Four people from the Amateur Astronomers Assn. of Pittsburgh also witnessed this event.  It lasted only fifteen seconds. ((NUFORC Note:  Missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72798.html",
      "state": "PA",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d72",
      "summary": "Bright orange ball of fire hovers then snapped back up into the atmosphere at a high rate of speed",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "Bright orange ball of fire hovers then snapped back up into the atmosphere at a high rate of speed On Tuesday November 18, 2008 I decided to go back to my mothers’ home, the home I grew up in, after I left work at 8:00pm. She resides in Upper St. Clair, PA, a quiet suburb south of Pittsburgh.  I arrived at her home about twenty after eight in the evening. There was a very light snow on the ground. I went to the house, let myself in and found her in the kitchen. After making some coffee and sitting in the kitchen talking for about a half an hour, she went upstairs to change from her work clothes into her pajamas. I went to use the upstairs bathroom. The bathroom faces the front of the house and the road. She lives on a very quiet road with very little traffic, but numerous homes. Behind the house is a very dense wooded area that prohibits any light from coming up the hill from the road below. The road behind the house is about a ¼ mile from our home. I was using the bathroom sitting on the toilet when I heard her go down the stairs. As I was finishing up, I glanced through the venetian blinds as I have a millions times in the past when I was younger. What I saw has occupied all of my time awake and while asleep for the last 24 hours. The shadow of her home was cast on the snow, a perfect silhouette. No car lights would have been able to accomplish this because of how steep the hill and how dense the woods are behind the house, even with sparse leaves on the branches. I yanked up my pants up, zipper down and shirt untucked and bolted down the stairs. My mother was frozen like a statue staring out the back window. What we saw at that point we will remember for the rest of our lives. In the sky only about 10 yards above the tree line, there hovered a perfectly quiet but blazing ball of orange light. I would estimate it to be about 15-20 yards in width. Not oval or cylindrical, but perfectly round. It was very strong and not pulsating or shifting. It was not blinding us at all.  I looked back at the front window, this time from the family room and still saw the house silhouetted on the snow. I continued to stare out the back door that leads that leads to the raised porch as I opened the door. No sound, no heat, no vibration just this spectacular ball of light as I stood on the porch. I ran back in to get a camera down in the game room on the basement level. As I ran to the back door under the porch, the ball became smaller and smaller as it seemed to be yanked back into the sky at an extremely rapid pace. I never got a shot off. I didn’t have time to turn the camera on unfortunately. Today, she asked the next door neighbors, who are an older couple, they saw nothing. Nor did a woman she knows through church who lives on the hillside about 1 mile away from our home, directly behind the house. I believe what we witnessed was not of this world. This was certainly not a noisy helicopter or some child playing a prank. This was a real, tangible, perfectly silent ball of orange fire well above the tree line. If anyone in this area had a similar encounter from the evening of 11/18/08 I would be highly interested in hearing your account of that evening. Can anyone help us understand this?",
      "link": "http://www.nuforc.org/webreports/067/S67015.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b902a",
      "summary": "See above statmement.",
      "city": "pittsburgh",
      "shape": "",
      "date": "2010-02-14T00:00:00",
      "story": "See above statmement. Silver or white and very shiny.  No smoke trail.   Went out of site in a flash, almost like it became invisible!  It's a very sunny day, cold outside.   The neighbor down the street saw the same thing.  Unfortunately, no camera.",
      "link": "http://www.nuforc.org/webreports/073/S73811.html",
      "state": "PA",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b908b",
      "summary": "orange glowing sphere in sky hovering",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2008-08-12T00:00:00",
      "story": "orange glowing sphere in sky hovering Saw a strange orange glowing sphere in sky during fireworks, but not near or part of fireworks. Like nothing I have seen in the sky before. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64715.html",
      "state": "PA",
      "duration": "2-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9373",
      "summary": "daytime  sighting,  no  clouds  just  blue  sky  and  a  very  bright  white  light.  i  took  pictures",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2009-08-27T00:00:00",
      "story": "daytime  sighting,  no  clouds  just  blue  sky  and  a  very  bright  white  light.  i  took  pictures penn hills,  it was  a  clear  blue  sky,  no clouds  at all. a  plane  flew  across  the  sky  and  left  a  chem  trail  behind  it.  i  was  wondering  why  it  had  breaks  in  the  chem  trail.  i  never  saw  that  before.  it  was  like  the  plane  turned off  and  on,  several  times. \t\t\t\tso  i  looked  down for  a  minute,  and  looked  back  up,  and  there  was  this  bright  light  in  the  middle  of  one  of  the  gaps  of  chem  trail.  i  could  tell  it  was  not  moving,  cause \t    the  wind  was  blowing  and  the  trails  were  moving,  and  starting  to  fade.\t\ti  took  sum  pictures  with  my  cell  phone.\t\t\t\t\t\t        then  another  plane  was  flying  past.  it  was  realy  low, and  had  no  trail  behind  it.    The  plane  looked  orange  from  the  sunlight  on  the  metal.    I thought  to  myself,  that  pilot  has  to  see  it  to.  there was  nothing  else  in  the  sky.\tA  few  minutes  went  by,  and  \tthe  light  started ! to  move  up,  then  either  it  turn  its  light  off.  and  the  sunlight  was  hitting  it.   or   it  changed  color.  and  then  shot  strait  up.   i  was  wondering  if  it  would  be  on  radar.  and  can  you  find  out?",
      "link": "http://www.nuforc.org/webreports/071/S71675.html",
      "state": "PA",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9486",
      "summary": "Deep-Orange Pulsating Object flying slowly over a suburb of Pittsburgh",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2009-08-05T00:00:00",
      "story": "Deep-Orange Pulsating Object flying slowly over a suburb of Pittsburgh We were approaching the cemetery, taking the back road to a friend's house and I looked to the sky and saw what looked like a low-flying plane at first. The light coming off was a solid deep-orange, but also pulsated. The object was coming in our direction maintaining its height, and stopped almost seemingly noticing it was being watched. The objects color disappeared and a solid black sphere could be seen. The sphere moved back and forth a bit, slowly, and began to faintly light orange. Then the object stayed the black color, and traveled the opposite direction from which it came, seemingly flying lower as it traveled off. I also tried to take a video of the object but my cell phone would not pick it up!",
      "link": "http://www.nuforc.org/webreports/071/S71056.html",
      "state": "PA",
      "duration": "2-3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9496",
      "summary": "U.F.O. flew in straight line then Dissappeared behind the trees.",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2008-08-12T00:00:00",
      "story": "U.F.O. flew in straight line then Dissappeared behind the trees. Object flew above tree level with red, white lights. There didn't appear to have a sound. That is what me aware of a possible U.F.O. sighting. The U.F.O. then continued in a flight pattern then dropped behind the trees out of sight. I waited to see if the U.F.O would reappear but did not. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64452.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a98",
      "summary": "Three very intense pulses or flashes of light in the north suburbs of Pittsburgh,PA.  01/18/2010 1:30am.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "Three very intense pulses or flashes of light in the north suburbs of Pittsburgh,PA.  01/18/2010 1:30am. On January 18Th at approximately 1:30am, myself and my girlfriend observed three bright flashes of light in the sky.  We observed these bright flashes north of the city of Pittsburgh.   The light flashed very intensely with one to two minute intervals.  The night was cloudy and very overcast..  The light was so intense that it appeared to be an instant pulse of intense bright light.   So bright that it illuminated the entire area for an instant.  There was no sound.  We could not see anything in the sky.",
      "link": "http://www.nuforc.org/webreports/074/S74120.html",
      "state": "PA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba085",
      "summary": "Power went out and bright red and blue lights lit up the sky. Later, green lights flashed",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2010-02-14T00:00:00",
      "story": "Power went out and bright red and blue lights lit up the sky. Later, green lights flashed The power in the neighborhood wenton and off from 10pm- 4am. Since there is almost 2 ft of snow on the ground, it was still bright out.  A bright red and blue flash startled me when I was looking out the window (I thought it was police car) but since it is a state of emergency, no cars were allowed on the road. About 20 min later, a bright yellow flash shined in my room.  About an hour after that, a bright green flash seemed to light up our whole neighborhood. Right before each of these light anomalies, there was a sort of a revving of an engine sound and then the power would cut out.  We have all under the ground power lines as well as no light posts in our neighborhood.  When looking out our back window, a yellow light seemed to fly past us on 3 separate occasions",
      "link": "http://www.nuforc.org/webreports/074/S74297.html",
      "state": "PA",
      "duration": "on and off for 5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3ba844",
      "summary": "((HOAX))  orange white and red lighted rotating disk moving up and down then suddenly flew away at a very fast pace.",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2008-08-12T00:00:00",
      "story": "orange white and red lighted rotating disk moving up and down then suddenly flew away at a very fast pace My girlfriend and I were out on my trampoline, looking at the stars, when a orange and red rotating saucer was moving over the treeline. It was silent and was moving up and down for about a minute and a half and then took off very fast.  My boyfriend and I were jumping on his trampoline, I was facing the backside of him telling him a joke, when I didn't hear any repsonse for a while, I turned to see his face blank looking out at the sky. I than looked in the same direction as him and couldn't believe what we were both witnessing it turned out it was a rotating disk in the sky moving up and down with both red,white, and orange lights flashing at diffrent times. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  Possible hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65129.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8f8",
      "summary": "Two glowing disks seen over an Interstate highway in Western Pennsylvania.",
      "city": "pittsburgh",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "Two glowing disks seen over an Interstate highway in Western Pennsylvania. I was on my way home from a job interview (1980s approx.).  It was late at night, about 10pm or so. I was on I-79 (I think that is the name of the Interstate).   Suddenly, I saw two glowing disks floating over the mediam strip. I couldn't tell exactly how big they were, but they were huge and hovering just a few feet above some pine trees: approximzte altitude-40 to 50 feet.  I did not see any details, just their glow;they never moved. I was driving south at about 60mph and the sky was overcast.  In about 15 minutes I was past them and nothing else happened.  I checked my watch and did not notice any missing time.  It was a bitter cold night in January or February; I do not remember exactly. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78446.html",
      "state": "PA",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bacdc",
      "summary": "A large fast moving V formation of lights.  Appeared to be one craft, no sound.  Was only visible from my vantage point for about a min",
      "city": "pittsburgh",
      "shape": "formation",
      "date": "2010-11-21T00:00:00",
      "story": "A large fast moving V formation of lights.  Appeared to be one craft, no sound.  Was only visible from my vantage point for about a minute.  Traveling East over Mcknight Road near the Mcknight,Peebles, Babcock Blvd intersection.  Approx coordinates 40.56205, -80.02210 ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78415.html",
      "state": "PA",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad03",
      "summary": "Weird object (shaped like plastic bag) moving across sky.",
      "city": "pittsburgh",
      "shape": "changing",
      "date": "2010-11-21T00:00:00",
      "story": "Weird object (shaped like plastic bag) moving across sky. I was sitting at a table trying to get my computer to work while I was at my dad’s work building around 4:00 PM (or 16:00 PM military time).  I looked out the window and seen something moving through the sky.  I was watching it out of boredom, and I thought it kind of looked like a plastic bag.  Then I continued watching it, and I noticed it would go into the clouds.  So then I knew it couldn’t be a plastic bag because they just aren’t that big.  I walked and sat closer to the window to get a better view, and I watched it go all the way across the sky.  It was see through, a whitish tint, and a darker edge.  It moved weird (up, down, sideways, and circular motions) slowly across the sky (it started out on the right side of my vision, and moved to the left).  Then I went to go see my dad to ask him something, and I also brought him out to see what I had seen.  By this time it was gone (4:10 PM / 16:10 PM military time).  There was someone else in the room wit! h me, but they were reading while I was watching it.  I'm really angry I left my phone over my friends house, so in short, I couldn't take pictures.",
      "link": "http://www.nuforc.org/webreports/078/S78447.html",
      "state": "PA",
      "duration": "About 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bada7",
      "summary": "Red/Orange globe with flame tail moving across sky, stopping then reversing direction.",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Red/Orange globe with flame tail moving across sky, stopping then reversing direction. I observed an orange globe or light very high in the sky with an orange tail of the same color.  My initial thought was it was a comet or meteor because it was bright and had a flame trailing it.  At first it appeared to get closer and was moving horizontally at a slight downward angle then it appeared to just stop with the flame like tail diminishing as it did.  Then it began to move completely horizontal across the sky in the opposite direction it was initially traveling.  There was a group of people standing there and I wanted to stop to ask if “do you see this?” but they were in the middle of an argument.  I called my friend co-worker on the phone, somebody to try to correlate what I was seeing but by the time I completed the call the orange globe slowly started ascending into the twilight sky and disappeared.   I was driving and pulled off the road to watch the object.  Total time observed was about 2 minutes.  The time was exactly 9:24 PM by my cell ph! one history on Friday October 22.  Friday night was a clear crisp cloudless evening. I am a Chief in a branch of Public Safety for the City of Pittsburgh and have never and would never report something like this if I was not absolutely certain that what I saw could be explained away as a manmade object or a natural celestial occurrence.  I called the local TV station (WPXI in Pittsburgh) to ask if they had any reports of anything strange in the sky.  The person who answered sounded as if I was annoying him so I cut the conversation short leaving no other information.",
      "link": "http://www.nuforc.org/webreports/078/S78543.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bafc3",
      "summary": "glowing fireball seen in the sky over Pittsburgh, PA",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "glowing fireball seen in the sky over Pittsburgh, PA I was sitting on my front porch steps handing out candy when my boyfriend said what is that in the sky. We both wintnessed a bright orange ball of light that appeared to be glowing. I cannot estimate the distance but it was close. We live close to the PGH International Airport and I have seen commerical aircraft flying at a higher altitude. This object was stationary and made no sound. We watched it for approximately one minute and the object just disappeared. It is a clear night and there were no clouds in the sky at the time. My boyfriend and I are both adult professionals and we both cannot explain what it was that we saw.",
      "link": "http://www.nuforc.org/webreports/078/S78662.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3baff1",
      "summary": "On Decemeber 4th,2010 at 8 P.M in Pittsburgh, Pa, 14 unknown silent aircrafts flew over head and vanished.",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2011-01-05T00:00:00",
      "story": "On Decemeber 4th,2010 at 8 P.M in Pittsburgh, Pa, 14 unknown silent aircrafts flew over head and vanished. Myself and 4 witnesses were outside viewing an unknown aircraft that had no noise and only a visible red fire ball type effect. 14 consecutive air crafts would fly solo in about 5 minute increments and head to the same direction and vanish. They could not have been airplanes, helicopters, or even stealth jets. They were more discreet and two of them came very close to each other in a controlled and slowed motion, then parted ways because the other 12 begin to come into the picture. I am not a huge believer in ufo's etc, but this one was my first and am curious to know what it was or if there was any planned Auto Drone experiment going on or what not. Hope this helps!",
      "link": "http://www.nuforc.org/webreports/079/S79132.html",
      "state": "PA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5b5",
      "summary": "Circular object hovering over Route 60",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2011-02-18T00:00:00",
      "story": "Circular object hovering over Route 60 On Monday February 14, 2011 a large white circular craft was spotted hovering over Route 60 Steubenville Pike in Robinson Twp, PA at 6:05 PM.   Cars were pulling off the road to watch this object and into parking lots.  People were getting out their vehicles to view this wedding ring-shaped object with white lights encircling it.   After 5 minutes, it just took off at a very high rate of speed straight up!   My IPhone camera could not focus on it to get a picture since it was already getting dark.   It was not a commercial plane or helicopter because it was a circular shape even though this is about 15 miles from the airport.",
      "link": "http://www.nuforc.org/webreports/080/S80080.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb8e8",
      "summary": "Stationery for 20 min., when viewed through binoculars, it appeared as though it had lights around.  ((NUFORC Note:  Venus? PD))",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2010-07-19T00:00:00",
      "story": "Stationery for over twenty minutes and when viewed through binoculars, it appeared as thought it had lights around the craft It appeared as though it was a large bright light.  My husband and I knew it was too large and to close to be a star.  It stayed in the exact position for over twenty minutes.  We used our binoculars to see it more clearly. It appeared to be in a sphere shape but in looking thourgh the binoculars, it had many lights around the middle.  Almost as though it were a train with windows, if that makes sense.  It did not move for over twenty minutes. It was not a plane or a helicopter.. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  Veus?  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76482.html",
      "state": "PA",
      "duration": "twenty minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bba1b",
      "summary": "Medium sized circular object moving in a circular fashion while flashing vigorously.",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2010-07-06T00:00:00",
      "story": "Medium sized circular object moving in a circular fashion while flashing vigorously. I saw an object that was moving in a circular pattern.  It had red and white lights looking as If they were tied around a frisbee and someone threw it.  This object was level with the stars and there was only one.  It It was moving away from the observers.  Like upward and forward in motion.",
      "link": "http://www.nuforc.org/webreports/075/S75935.html",
      "state": "PA",
      "duration": "Aprox 2min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc397",
      "summary": "Five high-flying objects in a row with bright red lights over Pittsburgh.",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2012-01-12T00:00:00",
      "story": "Five high-flying objects in a row with bright red lights over Pittsburgh. Five high-flying objects, pulsing slowly from white to bright red, flew in a straight line from east to west over the western suburbs of Pittsburgh. They were too high to be headed to the airport, and it was too late (after midnight) for airport traffic or any kind of landing pattern. What made it eye-catching was the bright powerful red pulsing light on each, and the pattern, flying maybe a couple miles apart from each other in a straight line, that high up.",
      "link": "http://www.nuforc.org/webreports/086/S86198.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc71b",
      "summary": "Mock helicopter seen above city of Pittsburgh.",
      "city": "pittsburgh",
      "shape": "other",
      "date": "2012-01-12T00:00:00",
      "story": "Mock helicopter seen above city of Pittsburgh. I witnessed two very strange things this morning.  It was a craft that mocked a helicopter, but I noticed something was off with it.  It maneuvered much like a helicopter.  It had the directional lights on it, as well as a strobe light.  It was circling above the City of Pittsburgh, though higher than the buildings.  I couldn't see any body of the helicopter.  At one point, all of the lights turned off but one.  It looked much like a star in the sky.  Then all of a sudden, it turned into a VERY bright light that was painful to stare at.  It then proceeded to turn back on it's directional lights and strobe light. Just a few short miles up river on the Allegheny, I saw a similar craft.  It could have been the same, but would have had to move at a lightning speed.  It did the exact same thing with the lights as the first craft. I live fairly close to an airport.  I have seen planes and helicopters at night before.  I have seen them from all different angles and making many turns.  This was unlike anything I have ever seen before.  And again I stress, all I saw was the lights.  There was no body to either crafts. I would have taken pictures, but it was very dark, and I a passenger in a vehicle driving to work.",
      "link": "http://www.nuforc.org/webreports/086/S86485.html",
      "state": "PA",
      "duration": "15+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc86d",
      "summary": "Orange Glowing Objects Over Pittsburgh",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2011-10-25T00:00:00",
      "story": "Orange Glowing Objects Over Pittsburgh My boyfriend and I were driving home through Etna on Little Pine Creek Road, and saw at first about six of them as we were coming around the bend of the road.  They were orange glowing objects all in same general area, almost in a line, moving across the sky.  We both had never seen anything like this in all our life.  We traveled to the top of the hill on Marzolf Road to get a better view.  There ended up being about 10 of them, maybe more.  They were all moving in the same direction (S-SE), coming from the same direction(N-NW), moving very quickly, making no noise.  There were no blinking lights on them. We attempted to get video on our cellphone, but of course, cellphones don't make the best cameras for night video recordings or nighttime pictures.  It was a very interesting sight.  I am sure there is an explanation for the sightings.  I don't know if maybe they were weather balloons, perhaps.  I'll probably hear of it on the news sometime soon.  I'm sure! we weren't the only ones who saw these unusual objects.  Never saw anything like it, so I thought I should report it.",
      "link": "http://www.nuforc.org/webreports/084/S84717.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd68",
      "summary": "Observed 2-3 bright orange orbs just east of Downtown Pittsburgh",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2011-06-20T00:00:00",
      "story": "Observed 2-3 bright orange orbs just east of Downtown Pittsburgh Driving home from a family gathering, I spotted two orange orbs in sky above the Regent Square neighborhood of Pittsburgh—east of Downtown.   I told my husband to pull the car over, and we both watched the two orbs hover above; each \"meandering,\" moving slightly, but not in any particular direction.  They were both the same \"fire\" orange color and seemed to be very high above.   We watched both of these orbs for about two minutes.  Then, one disappeared.  We watched the second one for about 45 seconds, and then it too seemed to disappear before our eyes.   We pulled back on to the road to continue our drive home, and within the next minute I spotted what was possibly a third orb, or perhaps one of the two that saw previously, appear in a different part of the sky.   Just as we were about to pull over to watch the orange orb, it was gone too. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81857.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0f3",
      "summary": "Watched 2 craft in the night sky, one that went extremely fast, one that went extremely slow.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Watched 2 craft in the night sky, one that went extremely fast, one that went extremely slow. Watched as two abnormally bright lights hovered over a hill for approx. 5 minutes.  The lights became brighter and brighter until one of them shot off to the right at an extremely high rate of speed while the other stayed and hovered.  This is why I called in the 2nd witness to come look at what I was seeing.  We proceeded to watch this light for another approx. 5-10 minutes as it hovered in the exact same spot.  The light then began to move very slowly in the direction of my house. I then proceeded to run outside to get a better look.  When I did all I could make out was a craft that had 3 lights moving quite the opposite as the previous craft in that it was moving slower in the air than anything I had ever seen.  The main emphasis was that it did not make one single sound as it flew right passed my house.  The craft looked to me as a triangular shaped ship about 3-4 times the size of a 747 passenger jet. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90726.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3eb",
      "summary": "Orange \"fireball\" over bloomfield during Gallery Crawl",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "orange &quot;fireball&quot; over bloomfield during Gallery Crawl Bright orange orb moving over Bloomfield heading in a Southwesterly direction.  Looked like it was on fire.  Must've been moving fast because it shrank in size quite quickly as we ran to see it's flight pattern.",
      "link": "http://www.nuforc.org/webreports/090/S90600.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd401",
      "summary": "Fireball over Brookline, Pittsburgh, Pa.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Fireball over Brookline, Pittsburgh, Pa. I was driving North on Pioneer Avenue in Dormont/Brookline when I noticed it in the sky up and to the left of me.  The moon was on the other side of the sky.  I was driving and I could not stop to look or a picture.  I figured it may be a Chinese Lantern, however it seemed to be moving too fast for it to be moved only by wind.",
      "link": "http://www.nuforc.org/webreports/092/S92324.html",
      "state": "PA",
      "duration": "at least several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6a8",
      "summary": "Circling yellow light over Pittsburgh",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "circling yellow light over Pittsburgh I got home from work at approximately 11:30 p.m. on Saturday night, 10/06/12.  When I was almost at my doorway, I was distracted by a light in the sky.  It was a circular hazy yellow light.  It was cloudy and at first looked like it could be light emitted by a plane above the clouds, but it was too large.  I then noticed that the light moved in a circular pattern and quickly.  It was almost like a hawk circling above.  I stood and watched this occur for about 5-10 minutes.  Usually, there are people in and out of my apartment complex and I so badly wanted someone else out there to see the sight but no one came.  I then decided it wasn’t the safest thing for me to be standing outside at midnight by myself in the city with my attention solely on the sky, so I went inside.  I have no idea how long it was occurring prior to me noticing the light or how long it lasted after I went inside.  About 5-10 minutes after I went inside I realized I should have been able ! to see the exact same spot in the sky from my one window, but saw nothing when I looked out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93384.html",
      "state": "PA",
      "duration": "10 minutes plus"
    },
    {
      "_id": "64d005f478aba2ec5a3bd8d9",
      "summary": "2 objects bright red with aura flying across the pittsburgh night sky",
      "city": "pittsburgh",
      "shape": "other",
      "date": "2012-09-24T00:00:00",
      "story": "2 objects bright red with aura flying across the pittsburgh night sky 2 shapes that came across the night sky -  bright red with a lighter outline - one after the other.  Both seemed to fly across the sky from west to east - one flew right below a plane that was also going in the same direction. very distinct from the plane.",
      "link": "http://www.nuforc.org/webreports/092/S92570.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd9e5",
      "summary": "Saw what I believe to be some kind of a comet or craft",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2012-09-24T00:00:00",
      "story": "Saw what I believe to be some kind of a comet or craft I couldn't sleep so I awoke and was looking up at the stars like I always do when I saw some kind of a craft go shooting through the sky.  Since I live close to an airport and I see airplanes all the time I knew it wasn't an airplane because it made no noise and it moved too fast.  Also it made absolutely no noise so I took out my cell phone camera because I was going to video it if I saw it again but it didn't.  This may be nothing but the way it moved looked like it had some destination.  My dad was an airforce pilot in the Canadian armed forces and when we were camping in Italy many years ago my mother told me he and she were sitting outside enjoying the night when they saw an actual ufo either crash or land and since my dad is a pilot he knew about airplanes.  Keep in mind this was maybe 40 years ago so I have always believed in them.   Anyway I would like to know if anyone else saw what I saw. I know what I saw was real!",
      "link": "http://www.nuforc.org/webreports/092/S92619.html",
      "state": "PA",
      "duration": "a couple of seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf7c",
      "summary": "Two orange lights in sky over Pittsburgh",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "Two orange lights in sky over Pittsburgh September 20, 2012  I live in the suburbs of Pittsburgh, PA in the Borough of Castle Shannon, which is south of the city. On September 19, 2012, while talking on the phone in my sunroom, at around 10:00 p.m., I saw two, round, orange lights in the sky coming from the south east.  It looked so unusual because they were traveling so close to one another.  At first I thought it was a double reflection in the glass of my glass door.  This door is on the right side of my sunroom.  One light was following the other, moving at a slow steady pace.  The best I could describe them is two full moons, the size of which is when the moon is higher in the sky and not at the horizon.  These lights however were about as high as a low flying airplane going overhead. At first I thought maybe they were two airplanes heading towards the airport since they were in the part of the sky of the air traffic pattern I see so often.   However, the two lights were moving towards the north, which would be the direction of downtown Pittsburgh and not the airport.  I opened the glass sliding door to possibly hear a jet engine, but there was no sound at all.  It was a very clear night and you could see a lot of stars. I quickly hung up the phone and grabbed my camera which was close by.  I then went to another sliding door which faces the backyard to take pictures.  By this time it was directly over my backyard at about a 65 degree angle.  I didn’t have any lights on in the room I was in, so I frantically thought I was snapping pictures when I realized I was in video mode and was turning my camera off and on.  I then turned on the outside light to see my camera settings and then started taking a video clip.  The two lights were starting to fade in the distance and they were now looking white and not orange with my naked eye. I then went to my computer and started to search for any information I could find to see if anyone else saw this.  It was not reported in the news. Today I called KDKA, one of the local TV stations to see if anyone else reported seeing the two orange lights in the sky and they said no, I was the only one.  They would not be able to take me seriously unless they had more than one call. I checked a compass to see what the approximate directions the two lights traveling. To my best ability the lights I saw came from the southeast sky on the compass reading 27/150 traveling northwest on the compass reading 60/340. I would like to know what exactly I saw that night.  It was really strange.",
      "link": "http://www.nuforc.org/webreports/092/S92940.html",
      "state": "PA",
      "duration": "less than 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf9d",
      "summary": "Enormous black triangle, southeast of Pittsburgh, 1987/88.",
      "city": "pittsburgh",
      "shape": "triangle",
      "date": "2012-03-13T00:00:00",
      "story": "Enormous black triangle, southeast of Pittsburgh, 1987/88. Hello.  I have shared this story with a very few individuals, close friends who can be trusted.  I have also, more recently, shared it online, in emails to a few individuals, in hopes of getting some kind of (hopefully positive) feedback, possibly opening a dialogue with someone who has had a similar experience, but as yet to date, feedback has been minimal, and no dialogue.  I am certain there are others who have had similar experiences, but don’t know how to go about finding them.  At any rate, here goes:   Back in about 1987 or 1988, I was staying at a friend’s house.  I was doing some work on their farm, southeast of Pittsburgh, PA.  I was sleeping on the couch, when I had a \"dream\" that was not a dream.  Let me elaborate:  I was startled awake somehow, and had the instantaneous impulse to get up and run outside, onto the porch.  When I did, I saw an enormous black triangle hovering above, and slightly to the right (South) of the house.  There were no discernible lights, as I recall, but there seemed to be dome-like shapes along the bottom of the thing.  (craft? Ship?)  I don’t know how long I stared at it, but I became aware that it appeared to be sucking up trees from the ground and levitating them up into it somehow.  I started crying. Suddenly there was a blonde female there with me, about 5’ 4\" tall, straight blonde hair, like in the \"Swedish Bikini Team\" commercials, dressed in either black or dark blue close fitting flight suit type uniform.  I don’t recall any kind of emblems or markings on the uniform.  { I will note here that at that time I had not heard of the Billy Meier case.  I have only learned of it recently.}  I did not, far as I remember, actually see her descend from the vehicle, she was just kind of suddenly there on the porch with me.  I immediately felt reassurance, and an overwhelming sense of peace and calm.  She told me that everything would be alright, that they were going to put the trees back when they were done, that everything would be as it had been before, and that there would be no sign that anything had happened.  I looked into her eyes, (deep blue or maybe green, like a lake) and I instantly felt as though we had known each other for a very long time, maybe forever.  I knew her name then, though I don’t know it now.  She put her hand on my shoulder, and, \"Bam.\"  I was waking up on the couch again, startled.   I got up and ran outside, fully expecting to see a black triangle, but there was nothing in the sky except stars.  I stood there dumbfounded, thinking it must’ve been a dream, but it was no dream.  I know it wasn’t. I don’t know if she wiped my memory, and maybe it didn’t fully erase, (?) or if maybe I was allowed to remember only certain parts of the experience, or if I was supposed to believe that it was “just a dream.\"  I really wish that she would return again, the connection I felt was so profoundly deep. I will add that the area where the farm was is not far from a high-security government installation, the US Bureau Of Mines, which I don’t believe for a minute is actually a coal mine.  They have 12’, double-row, barbed wire fences surrounding the place, which were in place as long ago as the early 1980s, long before the heightened state of security in the post 9/11 era.  I had a friend who used to work there as a janitor.  A few of us decided to go and see him one day, there was a sliding gate which was open, and on a whim we just decided to drive in and see if we could find him.  Within about a minute, we were being closely followed by a dark blue Chevy Caprice Classic.  We kept on driving.  Then a white Chevy Caprice Classic pulled out in front of us, cutting us off.  Three men wearing black suits, black ties, and black sunglasses approached the car, and demanded identification.  One of them said, “State your business here.”  We told them we were looking for our friend.! He said, “This is a restricted area.  You have no business here.  Turn your vehicle around and leave immediately.”  Needless to say, we were scared shitless.  We were teenagers out for a ride on an otherwise uneventful day.  We turned around, with the blue car now in front of us, and the white car following us closely.  They followed us like that after we got back on the main road, for about a mile or so.  It was very weird.  Were they the infamous “men in black?” And, if so, why were they there?  Why would they need such a high level of security at a “coal mine” anyway?  I knew from then on that there was something not right about that place, it gave me the creeps, and I always tried to avoid it if possible. This incident took place earlier than the other one, approximately 1985 or so.  There have been other strange occurrences throughout my life, but these two stand out in my memory. My ex wife, some friends, and I were laying on a trampoline in a yard, stargazing.  We all remarked about this bright red dot, wondering if it was Mars, or what, when all of a sudden, it just shot off to the north northeast, zip!  We all said “Whoa, what the hell was that?!”  This was just after the time of the Hale-Bopp Comet. I have more, but I will wait for a reply on this first.  Namaste. My ethnicity is Native American/Celtic/Anglo-Saxon. My religion is Pagan, though I was raised Methodist. I am currently in my mid forties, at the time of the first incident listed, I was in my twenties, at the time of the second incident I was a teenager, at the time of the third incident I was around thirty. The memory of the first incident, though incomplete, is extremely vivid. I have strange, \"Post Apocalyptic\" dreams sometimes. I have a strong fear of \"Greys\", the pictures people draw give me the willies, yet I have no memory of ever seeing one up close. I don't know if I believe Billy Meier or not. I don't know if I really believe everything that Bill Cooper wrote in \"Pale Horse,\" but a lot of it makes sense.  I know the US government lies.  They cannot be trusted. I know that something is going to happen on 21, December of this year, 2012, I just don’t know exactly what. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87402.html",
      "state": "PA",
      "duration": "not sure"
    },
    {
      "_id": "64d005f478aba2ec5a3be04d",
      "summary": "Recurring sightings of 3 UFOs.  ((NUFORC Note:  Possible stars??  PD))",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2012-11-19T00:00:00",
      "story": "Recurring sightings of 3 UFOs Three objects seen from southside of pittsburgh.  One object appeared to be a bright white light that seemed to dim when planes flew in close proximity, and had two other unidentifiable objects on either side of it.  The two other objects appeared to hover, then move in a quick zig zag pattern.  These two objects appeared to have red, blue and green lights that appeared to pulsate.  Definitely was not a helicopter, commercial airliner or satellite.  Viewed these objects for approximately one hour.  These objects have been noticed by several neighborhood folks, and nobody has a logical explanation for these occurrences. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94538.html",
      "state": "PA",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be096",
      "summary": "Second sighting of orange orbs with green/blue lights since June 2012.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Second sighting of orange orbs with green/blue lights since June 2012. Identical to what we previously observed and reported on June 2, 2012, i.e. orange orbs with blue/green lights almost like a plasma ball.",
      "link": "http://www.nuforc.org/webreports/093/S93834.html",
      "state": "PA",
      "duration": "Watching for 20 minutes s"
    },
    {
      "_id": "64d005f478aba2ec5a3be3b6",
      "summary": "Mysterious lights over city of Pittsburgh.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "Mysterious lights over city of Pittsburgh. Looked like an airplane lights flying over the city of Pittsburgh, except it kept going back and forth, as well as hovering, over a distance of several miles.  Lasted a very long time.  This isn't the first time I've witnessed this over the last several months.  Lights appear out of nowhere, then after a good while, disappear in to thin air.  Light color was white, green and red, much like the navigation lights of an aircraft.  I attempted to take several photos, however, they were all blurred or too dark.",
      "link": "http://www.nuforc.org/webreports/091/S91890.html",
      "state": "PA",
      "duration": "30+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be42e",
      "summary": "Yellowish orange orb",
      "city": "pittsburgh",
      "shape": "oval",
      "date": "2012-06-20T00:00:00",
      "story": "yellowish orange orb It was an orangish orb with what look like two engines burning.  The craft went straight up, no drifting nor arcing.  I was able to validate the sighting with a pair of binoculars.  It faded until I could not see it any further.",
      "link": "http://www.nuforc.org/webreports/089/S89603.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be491",
      "summary": "Bright light on small disc craft January & October 1992 Bates & McKee Pittsburgh, PA",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2012-04-18T00:00:00",
      "story": "bright light on small disc craft January & October 1992 Bates & McKee Pittsburgh, PA This event occurred in south Oakland, near Bates & McKee Place, in Pittsburgh, PA. At about 11pm, on October 16, 1992, just after I reached up to turn off the lamp above my bed, my room was filled with dazzling yellow light, as bright as daylight.  Thinking a transformer had blown on the power lines on the next street, I got up to look out the window.  The light coming in between the curtains was warm to my skin, like sunlight.  The source of the light seemed to be very close to the window.  I, then, wondered if someone were on the roof of the neighboring warehouse, shining some sort of light around the roof.  Earlier in the day, I the dirigible had made a chugging sound, and this light source made no sound. When I opened my curtains, I saw a small, round, Oreo cookie-shaped vehicle, with a domed top and bottom.  In the center layer were small round lights on the outer ring of the craft.  The lights were amber in color.  From the bottom, emitted the singular, enormous light beam I had seen coming through my window.  The craft was about twelve to fifteen feet above my window and seemed to be about three and a half feet in diameter.  It was slowly ascending from the roof of the adjacent warehouse. By now, the light beam was no longer pointed towards my window, but had swung away from it, shining along the wall to the back garden and the adjacent warehouse that made an L-shaped wall around the garden.  It shone on the garden for a brief moment, then, swung back so that it was perpendicular to the craft.  Then, it retracted into the craft and the entire vehicle disappeared.  It had not made a sound. I woke my next door neighbor who reported seeing two beams of light coming through his window earlier, maybe 30 minutes before my experience.  He said that one beam had been blue and the other had been amber.  His windows faced the warehouse wall below where I saw the craft. He had been too tired to get out of bed to investigate. At this point, it was midnight and I could not account for an entire hour of my time. We went outside to see if we could see the lights or anything unusual, but we saw nothing.  No one on the street seemed to be looking surprized or paying any attention to the building where we had seen the light.  My neighbor climbed on the roof of the warehouse to see if there was evidence of something having been there, but he found nothing. The next day, the elderly woman who lived in the apartment directly above mine reported being frightened by the bright light shining in her window the night before.  She did not open the curtains to directly observe the light.  She had lived in the building for 40+ years and was terrified of this light that night, deciding, \"It was a sign from God!\"   Also, prior to seeing the light, my apartment had smelled strange, as if something hot and metallic were burning a bit.  I even checked my oven to see if the smell emitted from there, but it did not.  The other peculiar thing is that an electric alarm clock kept buzzing--not with the alarm sound, but with an electrical hum--in the hours directly preceding my sighting of this craft.  This clock was on a bureau beside the window from which I had seen the craft. Ten months prior to this experience, in mid-January 1992, a bright light had awoken me around 2am. (My room was normally very dark, sheltered from outside street lights.)   My boyfriend was staring at the light, but did not respond when I asked him what it was.  In this instance, I did not get up and investigate.  I was too frightened to get out of bed.  The light lasted a moment or two and went out. The next morning, my boyfriend did not recall seeing any light in the middle of the night. I think that this was the same craft perhaps visiting on two separate occasions.  The warehouse on which it was located stores food for a large local restaurant, but particularly houses many whole potatoes that are cut up to make a popular item at the restaurant.  My building and the warehouse were owned by the same person.  I did verify with the building maintenance personnel that no one had been on the warehouse roof with a light.  They all said that they had not been up there and that no light of that candle power was on the property, nor any other thing that could have looked like what was seen.",
      "link": "http://www.nuforc.org/webreports/087/S87780.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be6cc",
      "summary": "3 orange pulsating fireballs appeared abruptly and faded as if cloaking device used",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2012-06-14T00:00:00",
      "story": "3 orange pulsating fireballs appeared abruptly and faded as if cloaking device used",
      "link": "http://www.nuforc.org/webreports/089/S89512.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be932",
      "summary": "Triangled shape craft with bright red blue and white lights",
      "city": "pittsburgh",
      "shape": "triangle",
      "date": "2012-03-13T00:00:00",
      "story": "triangled shape craft with bright red blue and white lights Noticed very bright lights in the sky over Brookline, Pittsburgh, PA.  As I watched from my house & then the craft started coming closer to my house (in Dormont).  I believe it was triangled shape, flew over & then turned & flew around.  It did have white, blue and red lights on it.  Then in the distance again high in the sky I seen another very bright light larger than a star which I believe could have been another craft.  Never in my 58 years have I seen anything like this. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87446.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be8fd",
      "summary": "UNBELIEVEABLE SPEED",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2012-04-18T00:00:00",
      "story": "UNBELIEVEABLE SPEED CRAFT CAME FROM WEST TO EAST, I WAS SETTING ON MY PORCH HAVING A CIGERETTE AND I SAW IN SKY A VERY BRIGHT LIGHT TRAVELING AT A VERY GREAT SPEED FLYING FAIRLY LOW AND AT ITS EXIT IT DISAPPEARED INTO THE SKY ABOUT 6 SECONDS.UN",
      "link": "http://www.nuforc.org/webreports/088/S88274.html",
      "state": "PA",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bed35",
      "summary": "Sphere engulfed in a fireball.",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "We were driving down East 376 coming from Robinson Township Pittsburgh Pa and we seen a glowing orange object and as it flew by we could see it was a sphere engulfed in a fireball. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We assume that the alleged sighting occurred at night, and we have changed the time above.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100539.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bed24",
      "summary": "Bronze colored sphere with fireball seen as driving down East 376 towards Pittsburgh object was flying above us towards Robinson.",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "Bronze colored sphere with fireball seen as driving down East 376 towards Pittsburgh object was flying above us towards Robinson. I posted a few hours ago about an object my boyfriend, my daughter and I seen coming from Robinson Township Pittsburgh Pa heading home down 376 East towards Pittsburgh and we seen a glowing orange object ahead of us we didn't know what it was then as we drove under it and it was flying above us (heading opposite direction heading towards Robinson)we could see the object was a bronze colored metal sphere (which I forgot to describe that the sphere was bronze colored in my last report a couple hours ago)with a fireball it was a bright orange and yellow glowing fire ball you could see the flames..   We have never seen anything like this at first I thought maybe it was a plane on fire until we got a good view as we passed under the object then we thought maybe it was a meteoroid but it had no trail and it clearly looked like some type of bronze craft and had a fireball and it was actually flying like an aircraft being controlled it didn't look like anything we have ever seen before what ever this was it was on fire and it moved in a straight direct path.  It was not a Chinese lantern.  I'm hoping others who possibly noticed this in this area as well reports this and has a photo to share of it.  We don't know if there was sound because we had the windows up and radio on. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100564.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bed81",
      "summary": "Large red/orange balloon that appeared to be an APPARITION.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Large red/orange balloon that appeared to be an APPARITION. I saw a large red/orange circle about the size of a large, hot-air balloon hoover over the trees across from my boyfriend's apartment during dusk, located on West Liberty Avenue, Pittsburgh, PA 15226.  It appeared and within seconds disappeared down over the trees.   These trees are located high on the hill that line West Liberty Avenue in the Brookline area of Pittsburgh, PA.    All I can say is that it was not a hot air balloon.  I am a sky watcher; and never seen anything like it.  I know it was a UFO.  I saw only one.",
      "link": "http://www.nuforc.org/webreports/100/S100598.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bee85",
      "summary": "Possible UFO sighting",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Possible UFO sighting In total, 10 red lights moving across sky in a north to south direction.  No sound, decent rate of speed.  First two in a line, a minute break  then four in a line, another minute break and two more, then after another minute, a single, 30 second break then one more singular light.  I have video if needed ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100781.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0aa",
      "summary": "Fast moving object over the sky in Pittsburgh. 3/24/13.",
      "city": "pittsburgh",
      "shape": "diamond",
      "date": "2013-05-15T00:00:00",
      "story": "Fast moving object over the sky in Pittsburgh. 3/24/13 On the morning of 3/24/13 at about 12:05am my wife and I were coming home from a wedding when we arrived home I got out of the car and I looked up at the sky and was looking at a star when a dark fast moving large Marquise diamond/torpedo cigar shaped object passed in front of the star and came into me and my wife's view it had no lights but it did have a orange-ish aura or color up against the night sky.  Its was slient and was moving east very fast....  This took place in Penn hills, pa jus outside of Pittsburgh,pa.",
      "link": "http://www.nuforc.org/webreports/096/S96778.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2b3",
      "summary": "Very fast moving bright light and stopped so fast",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "vevy fast moving bright light and stopped so fast objects came over a hill very fast over a tree line amost looked like they came from the ground and traveled towards the sky upwards and diagonally and then stopped very suddenly.   The first 4 came about every 30 seconds and stopped in a group. They had a mostly red look and a little white look.  They were not flashing lights but appeared to be totally illuminated. then the lights went out and i didnt see them no more.   THEN about 2 minutes later two more came out and then vanished about 30 seconds later.  Couldnt tell what shape they were but appeared to be round.  They seemed to travel 20 more times faster then a plane would fly, and stop on a dime.  Objects made no sound at all. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96983.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2f9",
      "summary": "Watched this object fly over home and further till it was gone. Moved slower than an plane. At first I thought it was a plane that may",
      "city": "pittsburgh",
      "shape": "oval",
      "date": "2013-05-15T00:00:00",
      "story": "watched this object fly over home and further till it was gone.  Moved slower than an plane.  At first I thought it was a plane that may have had a engine on fire.  I ran outside with my husband and there was NO sound.   I live in the suburbs, so it is quite at this time of night.  No blinking lights like a plane would have.   All I could see is a red and orange flame like light. It seemed to flicker like a fire would.  But I could not see any vehicle.",
      "link": "http://www.nuforc.org/webreports/096/S96994.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf54f",
      "summary": "I'm conflicted. I had another sighting, and I was challenged by you of filing a false report.  ((NUFORC Note:  See comment below.  PD)",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2013-10-14T00:00:00",
      "story": "I'm conflicted.  I had another sighting, mr Davenport, and I was challenged by you of filing a false report. ((NUFORC Note:  We do not know who the source of the report, and I strongly doubt that I suggested that the individual's report was \"false.\"  We rarely have any idea which reports are sincere and accurate, and which are bogus.  PD))  This recent incidence happened while I was traveling to play golf, on 79 north going over the Glenfied Bridge.  Already filed a report.  On my way to meet a buddy at Olde Stonewall.  That's near Zelionople.  I leave from near Pitt International. I know my aircraft.  Former Navy Analyst.  Was one of two suits in a sea of white and gold bars in the Pentagon. Was a constant at Wings Over Pittsburgh.  Pilots of 16s and 18s couldn't believe what I knew. I know my stuff. I can differentiate just the sound of mil power vs commercial or private. Just find someone to confirm what I saw.  It was at 12:30 as I traveled north on 79 to Zeli.  It was less than a minute.  I was going 75mph over a mile long bridge.  I saw this thing going straight over Pittsburgh.  Seven miles by air away. Please find a confirm  Or then  tell me I'm right or don't contact. Also something in Amsterdam, NY.  Me and a friend were outside late at night.  He was smoking and I was having a chew. This craft, very high altitude, came over.  But every time it \"glowed\" it accelerated like crazy.  Much faster than regular commercial craft. We both just looked at each other, and said to each other we'd never seen such a thing.  There is an old AF base near there.  So don't rule that out.  In fact the A12/SR71 used to to have service there after twelve hour trips. This wasn't that.  No 16.  No 15.  No 22.  And no Hornet, whatever it was defied explanation. No noise. No goofiness.  Just a couple guys watching the sky.  Actually we were using his iPhone app to identify constellations and stars. So after you telling me I filed a false report, find some submission somewhere to verify my report of the abnormal object I saw over Pittsburgh. If anything you can find is false, then go back to your bunker.  You pissed me off.",
      "link": "http://www.nuforc.org/webreports/103/S103020.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf54e",
      "summary": "Driving across the Glenfied Bridge, northbound, saw an odd shape as i was looking southeast down the Ohio.",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2013-10-14T00:00:00",
      "story": "Driving across the Glenfied Bridge, northbound, saw an odd shape as i was looking southeast down the Ohio. It wasn't a plane.  It was low on the horizon.  No blimp either.  It wasn't on any approach to Greater Pitt International. It was in controlled flight about seven miles off.  I judge the distance from how far I can see down the river. I was going to play (bad) golf at Olde Stonewall.  1:22 tee time.  I never mentioned this to anyone, till now. Maybe someone else saw it. Too big for blimp or airplane or Kc135s or even a C5 or C17.  Much less a Hercules.  We get those types around here.  National guard base and refueling and airlift wing. And this was at least one week after a big mobilization by the guard. Don't take my word for it, hope you find other reports to verify mine.",
      "link": "http://www.nuforc.org/webreports/103/S103024.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf806",
      "summary": "I was sitting in my apt. SE side of Pittsburgh, and I had the fan in the window with the windows open",
      "city": "pittsburgh",
      "shape": "",
      "date": "2013-09-09T00:00:00",
      "story": "August 30, 2013, I was sitting in my apartment south east side of Pittsburgh pa and I had the fan in the window with the windows open and around 4:35pm  I herd a noise like a military jet  then after the noise left the daylight flashed like the lights in your house go off and come back on real fast ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.   PD))",
      "link": "http://www.nuforc.org/webreports/101/S101725.html",
      "state": "PA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf815",
      "summary": "My friend captured 3 images when leaving my home that evening roughly 45 seconds later. These images show a zoomed organge circled ligh",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "My friend captured 3 images when leaving my home that evening roughly 45 seconds later.  These images show a zoomed orange circled light in a still position, ten the 2nd photo is the light is a bright circle but looks bright like a star without zoom.  3rd picture is light flying away with a comet like tail flying diagonal upwards and away.   I feel the pics I have are based upon accurate information from my friend who does not tell stories.",
      "link": "http://www.nuforc.org/webreports/097/S97947.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb8e",
      "summary": "14-18 red orbs moving across Pittsburgh sky in similiar path.  Disappear or lights dimmed in about 4 or 5 minutes.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2013-07-14T00:00:00",
      "story": "14-18 red orbs moving across Pittsburgh sky in similiar path.  Disappear or lights dimmed in about 4 or 5 minutes. More than a dozen red balls/orbs silently moving in about the same path just South of City of Pittsburgh.   Have never seen anything move in such a formation with no noise, then simply disappear or the lights dimmed.   Just really odd. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99772.html",
      "state": "PA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc34",
      "summary": "A circular disc shaped object came from southwest to north, hesitated, shifted to Northwest.  It left no vapor trail and made no noise.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "A circular disc shaped object came from southwest to north, hesitated, shifted to Northwest.   It left no vapor trail and made no noise. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97599.html",
      "state": "PA",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe50",
      "summary": "On my couch watching Reds on direct tv (actually DVR)) I witnessed two circular craft lift from behind hill.  I'm 44.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2013-02-04T00:00:00",
      "story": "New years day.  On my couch watching Reds on direct tv (actually DVR))  I witnessed two circular craft lift from behind hill.   I'm. ((forties)). I was an analyst for the ((military)).  I know my stuff.  This was irregular.  I know my aircraft.  I also know balloons.  These were neither one.  They flew in formation, a lead and a 'wingman,' I suppose.   Please don't publish this part: I'm an ((name deleted)) graduate, junior year at ((name deleted)), graduated with honors.  Did a ((stint in the military)), as far as you know.  I was a ((businessman)) then got my ((degree)) from ((name and degree(s) deleted)).    Also a ((professional degree)).  ((Executive)) of two ((branches of financial company)) an thousands of separate accounts.   But I had to unlearn it all    Two craft at high speed, in classic formation.  Lead and wingman.  Circular.  Disk. Send me a pic of any craft.  Btw these were not balloons,  Check the air currents over Pittsburgh...West to East.  These things buzzed away East to West.  No noise.  Just bizarre. ((name and telephone number deleted)) ((ADDENDUM FROM SAME WITNESS)) Peter,  Mr. Davenport, we spoke today.  I know what I saw.  My experience lends me to know every type of aircraft, and ship, sub, and land vehicles and tanks, personnel carriers, etc. A \"gift,\" or not. I witnessed two grey circular disk craft.  One to two seconds. I can know a make or model of almost any man-built flying machine in a heart beat. By sight or/and sound. This rattled me. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/095/S95716.html",
      "state": "PA",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe77",
      "summary": "Three amber lights were moving slowly across the night sky of Pittsburgh a little before 10PM.",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2013-09-09T00:00:00",
      "story": "Three amber lights were moving slowly across the night sky of Pittsburgh a little before 10PM. I was driving with my wife and baby in the backseat when I noticed 3 amber lights moving slowly across the night sky.  I pointed them out to my wife.  They were not as bright as aircraft lights, but still clearly visible.  The lights seemed to be moving at the same speed and in the same direction.  I couldn't estimate how high up they were or how large they were.",
      "link": "http://www.nuforc.org/webreports/101/S101946.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0204",
      "summary": "Red-orange triangular object with large flames flying during fireworks display",
      "city": "pittsburgh",
      "shape": "triangle",
      "date": "2013-07-05T00:00:00",
      "story": "Red-orange triangular object with large flames flying during fireworks display While watching fireworks, I saw a large red/orange plane-shape (triangular) in another part of the sky, with orange flames coming out of the bottom. At first I thought it might be part of  the fireworks, but it was steadily flying in the opposite direction of the fireworks.  I thought it odd that it was so vibrantly colored and that it would be flying so close to a major fireworks display.  I tried to photograph it, but by the time I got my camera, it was too far away to properly capture it.  However, when I first spotted it, it seemed fairly close to the ground.",
      "link": "http://www.nuforc.org/webreports/099/S99639.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c03c2",
      "summary": "Flying fireballs.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "flying fireballs three orange fireball looking objects flying in a strait line then one by one burning out, but moving away like the lights just went off. no sound i see many of planes and shooting stars but these objects looked like they were flying like the same speed or a little faster then a plane would.   i have seen shooting stars and there usually really fast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98324.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0671",
      "summary": "Cluster of white lights above Pittsburgh.",
      "city": "pittsburgh",
      "shape": "changing",
      "date": "2012-12-20T00:00:00",
      "story": "Cluster of white lights above Pittsburgh My wife saw it first and pointed it out to me.  Over the next few minutes we watched a strange formation of lights that changed shape (or formation?)... morphed several times.  At first I thought it was a huge flock of geese (much bigger than any natural flock), but as if the &quot;geese&quot; emitted their own white light source.  From our point of view on Mt. Washington looking directly north the formation came into line of sight right above the confluence of the rivers at the point of downtown.  Approximate distance less than half a mile.  It then meandered above downtown going to the right and then to the left and back again before continuing in an eastern direction and picking up speed dramatically.  As it picked up speed it gained altitude and the lights flickered out of sight.  As for shape it changed, but it did maintain a V of sorts.  It resembled a cluster of stars.",
      "link": "http://www.nuforc.org/webreports/095/S95184.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0701",
      "summary": "Flashing lights near pittsburgh airport/robinson pa",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2012-12-21T00:00:00",
      "story": "Flashing lights near pittsburgh airport/robinson pa Driving on Campbell's Run Road between 10:45 and 11:00 pm on 12/20/12.    Heading west, me and the passenger in my car noticed three or four bright flashes of light coming from West-Southwest direction.  Lit up the sky like very bright lightning, but I saw no lightning bolts (at least from my vantage point which was somewhat of a valley.  The light seemed to have a green tint to it. I did not see any objects, just very bright flashes of light coming from the West-Southwest.",
      "link": "http://www.nuforc.org/webreports/095/S95381.html",
      "state": "PA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0836",
      "summary": "Flat black color, 6-legged, toy jack shaped, basketball-sized object on the ground melting snow in a squall",
      "city": "pittsburgh",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "Flat black color, 6-legged, toy jack shaped, basketball-sized object on the ground melting snow in a squall This report is about a snowy winter night in 1968, 1969 or 1970.  That is the best I can pinpoint the ‘ancient history’ from my past. The unidentified object was shaped very similarly to a jack in the child’s game of ‘ball & jacks’. It was on the ground, tilted so its low side faced the city.  It was flat-black color. Its circumference was slightly larger than a basketball. Toy jacks that I recall had 4 legs radiating outward from a center axis.  This object had 6 legs.  Two front legs were feet-on-the-ground, facing the city.  Two legs were a bit off the ground and to the left and right sides of the ‘face’.  Two ‘rear legs’ in the back of the ‘jack’ were off the ground facing uphill. It was an odd configuration because whoever saw it asked, at least instinctively, “How could 4 legs off of the ground be outweighed by the 2 front legs that were on the ground and tilted to face the city?”  This basketball-sized jack with the flat-black finish was sitting halfway up a hill in Grandview City Park in the Pittsburgh, PA. A neighborhood named “Mount Washington” overlooks Pittsburgh. Mt. Washington has two well known vantage points that gaze across the river at the downtown skyscrapers.  These vantages are Grandview Avenue and Grandview Park.  They are on opposite ends of the neighborhood. Grandview Avenue got lots of pedestrian and vehicle traffic.  Grandview Park got much less, especially during winter. The park has an observation deck near the main entrance.  Uphill from the deck, the park is ‘terraced’ by 3 service roads. Atop the hill are 2 huge water tanks.  The park’s lowest road is its main service road (no public access for vehicles].  It’s between the hill and the observation deck.  This road is 2 vehicles wide. There are 2 more single-lane service roads.  They are further up the hillside. The position of these roads gives a framework for the remainder of this report. The highest service road goes to the water tanks.  At its apex it was about 60 yards (175’) higher than the main service road.  The middle service road was about 40 yards (125’) above the main service road. I know these distances because on snowy nights I practiced playing football.  Specifically, while walking our family’s fearless German Shepherd, I played quarterback.  I threw snowballs at trees. They were adjacent to the service roads and spaced apart at intervals of 10 to 50 yards.  I knew the distances with respect to the same distances on a football field. Facing the water tanks and, thus, facing away from the city, the large hill is gumdrop-shaped.  At its base is the main service road.  The highest and midway, single-lane service roads curve across the face of the hill.  They intersect at the main road. This particular night I walked Duke (the dog) up to the top of the hill.  It was snowing medium hard.  We could see only the brightest lights of the nearest downtown buildings.  And those lights were fuzzy & foggy.  The same was true for visibility of the park’s service road street lights at the opposite end of the park’s main entrance.  Only the 2 of us were walking through the park. The snow was ankle deep to mid-calf, depending on drifts formed by the wind.  The snow was deep enough that the wind that whistled through the park during winter had not yet blown any spots bald to render them devoid of snow. We walked along the highest service road over the crown of the hill facing the city, walked down the hill to the midway service road, to double back to where we entered.  Duke was usually rambunctious and very curious.  He knew my game of snowball football. Sometimes, he liked to race me to where my snowball hit a tree.  That night we’d done some casual racing in the snow to about 10 trees. We got to one of his favorite places to race & run.  The next tree was about 40 yards away. He liked hearing “pop” when my snowball hit that tree.  He liked to take-off as he watched its flight.  But he didn’t on that night.  He shied away from hurrying toward that tree. He avoided the upside of the service road and stayed his leash’s length away on the downhill side toward the city. He usually preferred the uphill side because other dogs marked their spots on the uphill side. As we made our way toward the tree I’d just hit with a snowball, I noticed a depression in the snow on that service road.  I couldn’t yet see it clearly because the city lights and park street lights were dimmed by medium-heavy snowfall, but there was definitely something dimensionally odd about a point in the snow near tree I’d just hit. The nearer we got to my new ‘line-of-scrimmage’ (the tree), the more Duke was reluctant to continue. He always led the charge toward any new curiosity.  But he didn’t this time.  As I got nearer, I saw a circular black spot with almost no snow on the asphalt service road. Then I started seeing the jack-shaped, object dormantly sitting there. I got about 2-3 yards away from it.  Duke stayed with me although he had enough leash to go sniff it -- which he’d done with everything before and after our encounter with that object; put his nose right on or in it. I did not feel heat radiating from the jack, but heat had to explain why there was no snow in the radius around it.  I ventured to a bit more than an arm’s length away.  I picked up a pinch of the fluffy snow and sprinkled it toward the jack.  A bit of my sprinkling landed on it and was gone in less than 2 minutes.  It took only slightly longer to vanish than the regular snow falling on and around it. Meanwhile, I studied it as closely as I dared.  I saw no seams, nothing that resembled a hatch or window.  Yet I had the distinct sense that it was specifically facing the city lights; almost like admiring the view through the snow while enjoying the calm & silence of such a snowfall.  At the same time I had a definite sense of “Hands OFF!  Don’t touch!”   The center of the jack had the biggest pod/cylinder; both in diameter and height.  At the end of each leg were smaller-scale versions of the same pod.  The pods were approximately the same diameter as the legs that connected them to the center core.  If they were different diameters, then it was by a mere millimeter or less; measurable only with calipers.  Small as it was it didn’t seem spindly.  It seemed sturdy.  It didn’t seem hostile, but it wasn’t inviting or overtly friendly.  It emitted a sense (or invisible aura) of power . . . not energy, but of power. Duke inched nearer to it only as I did. I was his shield and security.  This was totally out of character for our fierce, fearless dog.  I’d always needed to restrain him. He was a trained attack dog that K-9 police gave us because he was too aggressive ~ until he encountered this jack. This whole encounter was 3-5 minutes. I stepped past the jack, threw a few more snowballs at my next possible (football receiver) trees, drifted back to the jack for one last look, and saw no changes.  Then we returned home.  My snowballs were unusually accurate that night; missing 1 or 2 of 75-80 throws.  The next day my brother took Duke for his morning walk.  I told him about the black jack.  He looked for it.  It was gone. But where I’d seen it there was a divot in the snow shaped like the bottom of a basketball. Thinking about it you’ve got to ask: “Why was all of the ground below it devoid of snow?  Why not only where just the front feet touched the ground?  How did the black jack get there?  Obviously, it didn’t walk or tumble there. Why were there no tracks or footprints in the virgin snow?”  That made no sense. It had been snowing for 2-3 hours.  Anyone/thing moving afoot through the park would have left telltale tracks. And, Duke very cautiously and tentatively stuck his nose only so close as if a spherical energy field was radiating outward from the jack, just 1-2 inches beyond the full length of the jack’s legs.  My observation was that Duke knew or sensed something to the effect, “That’s as near as you get!”  But maybe it was selective/smart shielding because snow was OK for touching the jack. These are my thoughts articulated today (November 2013) but at least subconsciously in my 15-17 year-old awareness during the encounter.  It was weird, semi-spooky, and it simply “didn’t add up”.  While looking at it I pondered picking it up and taking it home to show Dad (a master engineer of power plants, steel mills and water processing facilities).  But Duke avoided the jack as though it was the Plague -- a sign to duly consider.  And I had no idea of where to put it, what to do with it, and it ‘felt’ too strange. The jack looked different than all other UFO configurations/shapes that I’d seen before and that I’ve seen since.  I kind of have regrets about this probably dubious ‘opportunity’.  But I played it safe and I’m still alive to tell you about it. ----------- Completing the end of this report form . . .  Contact me if you want.  I can not accept (pay for) a collect call.  I don't prepay my phone with so much money.  Also, I did not see the object land.  It was already on the ground when I saw it.  Now, I live in Spain.",
      "link": "http://www.nuforc.org/webreports/104/S104287.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c08f1",
      "summary": "Round circles of light chasing each other in sky at high rate of speed.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "round circles of light chasing each other in sky at high rate of speed Rt 376 while traveling past Pittsburgh Airport I saw two round \"lights\" chasing each other going in oblong circles at a very high rate of speed.  They seemed to keep pace with my vehicle until I left the area.  The night was cloudy and they seemed to be above the clouds.  At first I thought they were searchlights in the sky but realized they were independent lights unto themselves.  How they could escape radar is beyond me as they were very close to the airport.  It seemed like a game to them.   No person could survive being in these craft as the \"G\" forces would be tremendous.   Strangest thing I have ever seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107826.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a18",
      "summary": "Saw 2 disc shaped white-ish blue objects floating in the clouds at night moving Around in very eratic movements. Circular zig zaging et",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2013-11-11T00:00:00",
      "story": "Saw 2 disc shaped white-ish blue objects floating in the clouds at night moving Around in very eratic movements.  Circular zig zaging etc  it lasted.for 5 minutes  When it stopped they disappeared and so did the cloudiness right along with it  They were saucer shaped but the entire objects were lit up  There was no signs of any lights being beamed up from they ground left. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103664.html",
      "state": "PA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ab2",
      "summary": "Saucer shaped object with orange lights.",
      "city": "pittsburgh",
      "shape": "disk",
      "date": "2014-02-07T00:00:00",
      "story": "Saucer shaped object with orange lights. I can remember my UFO sighting as if it happened yesterday.  It was September 7, 1970. 11:10 p.m. I was about to start my senior year in high school.  We lived on a main highway just up from a very bad intersection where there were always accidents.  (Seven miles south of Pittsburgh, PA.)    At 11:10 p.m. that night I was leaving one upstairs room to go into the bathroom when I noticed a light somewhat flickering on the sheer draperies.  I assumed it was another accident and the lights of a tow truck.  I walked to the window to look down at the intersection and saw nothing.  I realized the light was coming from above.  I saw a huge circular metal craft with lights on the bottom.  It silently was hovering over my side yard at a slight angle so that I could only see the bottom of it.  It was just above the poplar tree tops along the border of our property.  I got a very close up look at it.  The bottom was slightly convex and a matte colored dark metal.   There were what looked like semi opaque tempered glass panels on the bottom.  Similar to a bathroom window.  You can see light but glass is not transparent.  Those panels are where the amber lights emanated.  They were on constantly but yet had a slight pulsating flicker to them.  For some reason, although I don't know why, I thought it was due to the power source of the craft.   I saw it for approximately 15 seconds as it hovered silently.  Then, faster than I could blink my eyes, it took off at a 45 degree angle to the west.  I was so terrified and will never forget what I saw.   I am sending a drawing explaining what it looked like to the email listed on your website.   If you call me I can give you exact locations and any other info you might want. If it has any relevance I don't know, but I am was not very far from Bettis Atomic Power Laboratory.",
      "link": "http://www.nuforc.org/webreports/106/S106897.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b9e",
      "summary": "Three red lights moving in the sky.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2013-12-02T00:00:00",
      "story": "Three red lights moving in the sky. I saw three red lights in the sky and they were slowly moving upwards in a vertical line, then the lights would dim and I could make out a round object.  They would light up again, and move around, and then up and down.  I saw other people pointing up and looking at it, and then I did as well, this kept going on for at least two hours before I went in the house, not sure if they are still out there. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104629.html",
      "state": "PA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c2b",
      "summary": "Saw \"Fireballs\" in the sky last night.  Same as many other UFO video and sightings.  Have pictures.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2013-11-11T00:00:00",
      "story": "Saw &quot;Fireballs&quot; in the sky last night.  Same as many other UFO video and sightings. Have pictures. At approx. 9:15 P.M., I was on the phone with my mother and from behind the tall oak trees, I saw 3 very large fire ball looking objects in the sky.  They were flying relatively low, juxtaposed to the typical air traffic I see here. The balls were in a V formation, but were floating and flying at the same time... kind of swerving back and forth, but staying in somewhat of a V formation.  I could barely tell my mother I'd call her back.  Tried to hang up and get my phone camera set up. By the time I focused and clicked, all but one was gone.  Unfortunately, my camera picked up a dot.  They just \"went out.\"  They didn't fly away.  The sky was very clear and they definitely did not fly away.  They just disappeared. Called mom back in a freaked out state and was on the phone with her...  Maybe 3-5 minutes and saw another one coming from the same direction.  This time I didn't take time to say goodbye.  Got the phone working and when I aimed to take the picture, there were 4 lights on my screen and only 1 in the sky.  I kept snapping pictures, despite my disbelief. There were 4 on the screen and 1 in the sky. It too, just disappeared. All of them would sort of \"blink out.\"  Again, unfortunately my phone camera stinks, but I did get the fireball and when I expand the photos, the lights look round but the more they expand, they look almost like crescent moons, a fuzzy backwards \"C.\"   Upon further inspection, I realized that the 2 lights on the bottom of the screen, were house lights.  You can distinguish the other two, as they are much higher in the sky and have the exact same crescent shape upon expanding the photo.  I do not know if the second one appeared whilst I was focused on the other one. I searched and found a video of another sighting here in Pittsburgh from this past Aug. 2013. found on YouTube.  It's exactly what I saw.  Also found many videos from around the globe, with the exact thing I saw. I did not report it for fear of looking nuts and no one else (apparently) saw them or reported seeing anything.  I am a stay at home mother of 5 children and am the fourth generation on my mother's side, to live in our old farm house located on the outskirts of the City of Pittsburgh.  We have lots of land here, despite still being in the city. I know that what I saw was not normal.  We have regular air traffic flying overhead, as the airport is relatively close by.  I saw airplanes, shortly after these sightings.  These were not airplanes.  When I saw the exact same things, littered all over UFO sighting websites and YouTube, my heart sank further.  This scared me enough to be up all night researching and to now be reporting this. For some reason, I can't check the information below.  I would definitely like to be contacted.  I also have a story about my sister and I when we were kids.  Hesitant to share it online.",
      "link": "http://www.nuforc.org/webreports/103/S103596.html",
      "state": "PA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d53",
      "summary": "Craft zoomed past my windshield.",
      "city": "pittsburgh",
      "shape": "rectangle",
      "date": "2014-01-16T00:00:00",
      "story": "Craft zoomed past my windshield Me and my roommate at the time were leaving a friends house in my truck .  I left and made a left was coming down a hill.  There was a low flying object.  Rectangle shaped maybe tradition UFO disc with 4 huge lights not consistent with a aircraft I see planes all the time.  This object was not over head but visible thru the windshield moved from r to l across the windshield in view maybe half way cutting aross the window.   I looked at him and said you see that??  He said ya I seen it.  I said was it a plane?  He said idk what it was.  And won't answer to this day what it was.  There was from left to right square white light rectangle red light small space red rectangle white square.  This was NO blinking light that all air planes have.   We live between 2 airports but this thing was silent and zoomed across too fast.  And was gone!!!!  By the time I hit the corner. I obviously don't belive in \"god\" literally but I assure you this is 100% true story. I also have a video of a light orb on my security cameras for 8 Minutes  I don't know what it was but I have seen stink bugs spiders u name the bug I seen it on there this is something else.  The cat even watches it.",
      "link": "http://www.nuforc.org/webreports/106/S106341.html",
      "state": "PA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fe5",
      "summary": "Four orange-red lights over Pittsburgh, PA dropping smaller orange lights.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "Four orange-red lights over Pittsburgh, PA dropping smaller orange lights. On New Years Day, 1-1-14 at about 7:30pm EST, I stepped out onto my front porch.  I live about 5 miles north of downtown Pittsburgh, PA.  I just happened to look up at the sky (there were no stars this night) and saw two orange-red lights slowly moving through the sky side by side.  I thought it was a plane at first.  The two lights then separated from each other and slowly moved apart and then stopped completely and just hovered in the air.  Then, two more orange-red lights appeared right in the area of the original two.  There were now four orange-red lights hovering in the air, not moving at all and all were approximately the same size but, one of the original two lights was the biggest of all four.  Three of the four lights began disappearing and reappearing in roughly the same spot over the next 5 to 10 minutes.  During this time I used my compass on my IPhone and found that the objects were in the southeast sky (I also got some of the lights on video b! ut, it is a bit grainy).  The entire time these objects were disappearing and reappearing, one of the lights, the biggest one of the four, remained illuminated and appeared to slowly grow in size.  Then the large steady orange-red light began dropping smaller orangish balls of light from it.  It dropped about three smaller orange colored lights, which would travel straight down and then disappear after 2 or 3 seconds.  After this occurred, all four of the lights illuminated and moved slowly north, with three of them disappearing again.  The large steady orange-red light traveled out of direction with the other three and headed almost exactly in the direction I was standing at in front of my house.  When it began getting close enough where I could see the object really growing in size and see that there was more to the object than just the orange light, it disappeared.  This same light then reappeared about 30 seconds later, dropped one more orange colored light from it and ! completely disappeared. I watched this area of the sky for the next 20 minutes and may have briefly seen an orange light but, nothing like what I first witnessed.  I did see several helicopters in this area in the next 20 minutes but, I am not sure if the two are related.",
      "link": "http://www.nuforc.org/webreports/105/S105918.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fe7",
      "summary": "4 ufos in pittsburgh pa area.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2014-01-10T00:00:00",
      "story": "4 ufos in pittsburgh pa area. I saw three white lighted objects approach in nearly a straight line. They moved slowly, then entered a triangular formation.  After entering a triangular formation, two of the crafts elevated and disappeared one at a time slowly.  Over the course of 30 seconds, like winking out, but did not move.  The third remained. A fourth aircraft approached over the horizon moving quickly and left a reddish orange trail that dissappated quickly over approx 2 seconds.  It then hovered in approximately the center of the original triangle.  This craft hovered for approximately 2 minutes before it too winked out.  The forth craft appeared more red/orange.  The first group was all white.",
      "link": "http://www.nuforc.org/webreports/106/S106001.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c13ca",
      "summary": "Crafts zipping across the sky in Pittsburgh, PA.",
      "city": "pittsburgh",
      "shape": "formation",
      "date": "2014-01-10T00:00:00",
      "story": "Crafts zipping across the sky in Pittsburgh, Pa. I step out from my job and just happened to look up and saw a formation of about 4-5 crafts zip across the sky sort of like if birds flew by but much higher than birds fly.  The formation looked like a bird migration (diagonal) but I've never seen or heard of birds that glow in the dark.  It appeared as if the one on the rear of the formation started to break from the formation so they slowed down until it realigned and sped right back up.  I watched until I could not see them anymore.  The sighting lasted for about 30-45 seconds.",
      "link": "http://www.nuforc.org/webreports/106/S106116.html",
      "state": "PA",
      "duration": "Very fast"
    },
    {
      "_id": "64d005f478aba2ec5a3c1744",
      "summary": "Saw a silver/gray cigar shaped object in the sky, with white mist underneath it.  It did not have any wings, fins, or propulsion device",
      "city": "pittsburgh",
      "shape": "cigar",
      "date": "2014-06-04T00:00:00",
      "story": "Saw a silver/gray cigar shaped object in the sky, with white mist underneath it.  It did not have any wings, fins, or propulsion devices that I could see.   We were travelling on Interstate 79 towards Pittsburgh.   It was travelling in a westerly direction and it was the speed it was travelling that caught my eye.   My husband couldn't see it as he was driving.   I watched it until it was out of sight.  I have never seen anything in the sky that was that quick.",
      "link": "http://www.nuforc.org/webreports/109/S109553.html",
      "state": "PA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c17aa",
      "summary": "while driving with my granddaughter we saw bright light in the sky so I stopped the car to get a better look.  It was in a stationary p",
      "city": "pittsburgh",
      "shape": "oval",
      "date": "2014-06-04T00:00:00",
      "story": "while driving with my granddaughter we saw bright light in the sky so I stopped the car to get a better look.  It was in a stationary position in the sky and oval shaped bright white light in the center, small reddish lights at the bottom surrounded by a transparent sheer light with a definite oval shape.   It disappeared so I drove to the bottom of the hill and saw it again but in a different position.  There was a plane flying low and another higher up  I circled back up the hill and we spotted it again but in a different position to the extreme left of the original sighting again stationary in the sky.   We snapped a picture with our phone. The first sighting appeared as a bright white light in the center with a sheer haze around it. The last sighting the haze appeared to have changed color slightly and looked slightly blue I wasn't sure if I didn't notice the color the first time or not.",
      "link": "http://www.nuforc.org/webreports/109/S109566.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17d8",
      "summary": "It was during flyovers of a ww2 era bomber that was flying people over pittsburgh myself as well as others at the bill green shoping ce",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2014-07-11T00:00:00",
      "story": "it was during flyovers of a ww2 era bomber that was flying people over pittsburgh myself as well as others at the bill green shoping center observed 2 objects near the air craft myself being the first to notice as a freind pointed out the aircraft that he knew i wanted to see and suddenly i was like look it even has foo fighters and then realized there was something cleary of unkown origin ((NUFORC Note:  We spoke via telephone with the witness.  We are uncertain as to whether the report is a serious one.  Date is approximate.  Time has been corrected.  Witness stated that the event occurred on a Sunday, which was either the 7th or 14th of July 2013.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111260.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c18a5",
      "summary": "Several orangish orb-like lights appeared in succession and flew a distance and then turned off their lights one.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2014-07-20T00:00:00",
      "story": "Several orangish orb-like lights appeared in succession and flew a distance and then turned off their lights one by one. Several orangish orb-like lights (6-7) appeared in succession and flew a distance and then turned off their lights one by one as they progressed, often by becoming dimmer and flicking.  No sounds were made.   This is the second potential ufo sighting that I have seen, though the former was much different, with lights engaging in a sort of triangle-like formation with an additional barrel/molecule-like item. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111424.html",
      "state": "PA",
      "duration": "2-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c19b1",
      "summary": "Several fireballs (8 or more) moving NE in Pittsburgh.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2014-07-11T00:00:00",
      "story": "Several fireballs (8 or more) moving NE in Pittsburgh I was driving south on I-279 from Cranberry twp to bellevue, just north of Pittsburgh.   There were several fireballs moving in a north east direction.  Due to driving I was unable to observe for long period of time.  Appear very similar to other fireball sightings made on NUFORC over past several years.   A very similar sighting was made by my in laws in columbiana county ohio, august of 2013.",
      "link": "http://www.nuforc.org/webreports/111/S111238.html",
      "state": "",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c19e9",
      "summary": "5 or 6 lights in a straight pattern, fluctuating in intensity appeared and then disappeared in a very short time.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2014-07-20T00:00:00",
      "story": "5 or 6 lights in a straight pattern, fluctuating in intensity appeared and then disappeared in a very short time. I had a restless night and had trouble falling asleep the entire night.  I was laying on my right side and my bedroom window was behind me.  My dog was lying next to my back.  She got up and I turned to look at her and I seen that her tail was between her legs.  Something had spooked her and she does have a lot of sound phobias but I did not hear anything.  I am pretty well versed in canine behavior and body language and have been studying this subject for a while now as I am working towards a career in this field.  She jumped off the end of the bed and went to her “safe spot” underneath the bed. As she jumped, I noticed a bright light in my peripheral vision outside my window.  I turned my head and looked and saw a line of 5 or 6 lights in a straight line moving at a moderate rate of speed.  Maybe like 150-200 mph as a rough estimate.  It seemed like it appeared out of nowhere.   As I focused my eyes on it I noticed the lights were alternating colors of blue and white.  They were all fluctuating in intensity and were going from bight to very bright.  Suddenly, the craft just disappeared.  I didn’t see it take off, it just vanished.  I estimated it to be at an elevation of about 5-7 thousand feet.  I continued to look for the next 25 minutes or so but saw nothing.  The entire event lasted all but 2 seconds. This took place in the SSE direction and I live about 5-7 miles directly south of downtown Pittsburgh, Pennsylvania.   I turned on my smartphone 20 minutes or so after the sighting to see what the weather condition were.  It was cloudy with the cloud cover at 95% and the cloud ceiling was at 12,700 feet.  Temperature 72 degrees, humidity 68%.  Full moon.",
      "link": "http://www.nuforc.org/webreports/111/S111511.html",
      "state": "PA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ad6",
      "summary": "Orange orbs float over Pittsburgh.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2014-07-20T00:00:00",
      "story": "Orange orbs float over Pittsburgh Four orange orbs ascended over southside slopes viewed from south Oakland disappeared over Oakland neighborhood. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111572.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c86",
      "summary": "Bright orange glow very high up, could be a rocket.  2 people observed.  Ended very suddenly.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2014-06-04T00:00:00",
      "story": "Brite orange glow very high up, could be a rocket. 2 people observed. Ended very suddenly. Observed Larger orange glow.  Grabbed Binoculars, observed for another minute.  Had to be over 30,000ft.   Orange glow with small tail stopped very suddenly and was gone.  The Orange glow was like a halo with a brighter spot in the middle.",
      "link": "http://www.nuforc.org/webreports/109/S109730.html",
      "state": "PA",
      "duration": "3"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c71",
      "summary": "It was oval different tapes of blue and redish pink very big moved slowly than disappeared.",
      "city": "pittsburgh",
      "shape": "oval",
      "date": "2014-07-26T00:00:00",
      "story": "it was oval different tapes of blue and redish pink very big moved slowly than disappeared. ((NUFORC Note:  We have requested a more detailed report, and a report from the second witness.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111860.html",
      "state": "PA",
      "duration": "1.2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2119",
      "summary": "Bright orange lights in formation.",
      "city": "pittsburgh",
      "shape": "formation",
      "date": "2014-04-18T00:00:00",
      "story": "Bright orange lights in formation I was driving when I witnessed two bright orange lights moving in parallel silently low across night the sky.   The lights moved in perfect unison as if part of a single craft but too far apart to be anything I’ve ever seen.   Also the angle of the lights was wrong as one was above and in front of the other.  (The best way to describe it is fully extend your arm in front of you with your hand at a 45 degree angle.  As far as possible extend your thumb and little finger.  At the tip of your thumb and the tip of your little finger would approximate the formation).   It was 4:00 AM in the morning.   I stopped in the middle of the street and I reached for my phone to either call someone to corroborate what I witnessed and to take a picture.   By the time I woke the phone from sleep, the lights had vanished.  I’m relieved sort of to see other similar reports; I know I’m not nuts.  I’m not a UFO buff so I’d accept any plausible explanation. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108568.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2164",
      "summary": "4 lights moving in triangular formation at low altitude over Squirrel Hill, PA.",
      "city": "pittsburgh",
      "shape": "formation",
      "date": "2014-04-11T00:00:00",
      "story": "4 lights moving in triangular formation at low altitude over Squirrel Hill, PA. Four objects were seen form about a 30 degree angle.  They traveled above the trees through the night sky flying southeast or south.  Three circular lights appeared to be moving through the sky while maintaining a triangular formation.  Shortly after, one other light came from behind and followed the other lights.  A video can be seen publicly by following the link to youtube. http://youtu.be/Kdr9vmLXUy8",
      "link": "http://www.nuforc.org/webreports/108/S108421.html",
      "state": "PA",
      "duration": "1:01"
    },
    {
      "_id": "64d005f478aba2ec5a3c24c0",
      "summary": "String of Red Lights at Elevation, Spanning 40 Degrees, in the vicinity of the Allegheny County Airport.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "String of Red Lights at Elevation, Spanning 40 Degrees, in the vicinity of the Allegheny County Airport. We live in Pittsburgh west of the Allegheny County Airport (located in West Mifflin). My wife, walking the dog in our yard, noticed a string of uniformly spaced red lights at altitude (as one would expect a Life Flight helicopter to be) spanning at least 40 angular degrees. She called me to the yard, and I also observed them. I observed (at times using binoculars) that they appeared to be rising, in a spaced fashion, one after another, from a single point in the southeast and heading to the southwest. We estimated they were rising in the vicinity of the airport. One plane observed was perceived by us to be lingering in the area, but the plane, a commercial airliner or cargo plane, subsequently flew over our house, so the perception of lingering must have been due to a great initial distance and we observed it flying into the area. Towards the end of the event, we perceived helicopters to be flying in the area of the airport near the point we witnessed the lights ascending.  The lights were red, similar to radio tower lighting. The light to the southwest most point merely extinguished, and being distracted, but not seeing the others, they too apparently went out. My initial assessment is that they were some man made thing, such as \"Sky Lanterns\" lifted by balloon or the heat rising from a candle, but problems exist with this theory.  1. They were launched near the County Airport, which I would suppose to be forbidden for a legal launch, as interference to or confusion of air traffic may ensue.  2. To suppose that they were equipped with electrical power for lighting or being equipped with a candle should have provided the most recently launched light with the ability to travel from the southeast launch point to the southwest extinguish point before itself extinguishing, this clearly did not happen.  I returned to the house and alternately listened to a scanning radio for the police frequencies in my area of Pittsburgh and to Aircraft Frequencies collectively. Nothing was heard to indicate that any others had called to report this incident, nor were pilots, in their very brief communications, mentioning it.  I subsequently noted an establishment across the street from the County Airport as having a Grand Opening sign, but I'm not sure how old the sign is. I drove past the County Airport travelling to work, on following days, but did not notice anything to account for the lights. We perused the media for a hint of a man made cause, but found none. We found this reporting page as a result.",
      "link": "http://www.nuforc.org/webreports/114/S114645.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2af4",
      "summary": "Three fireballs seen hovering above Plum Borough school football  on Friday, September 12, 2014, in PA..",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2014-09-18T00:00:00",
      "story": "Three fireballs seen hovering above Plum Borough school football  on Friday, September 12, 2014, in PA. Around 9:35 PM on September 12, 2014, as me and my daughter and her friend were leaving our high school football game when it was over, I looked up and observed three balls of round  looking objects.  Two were following in a straight line, and the third one was lagging behind than the one in the middle moved quickly to the one at the far left.",
      "link": "http://www.nuforc.org/webreports/113/S113500.html",
      "state": "PA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2aff",
      "summary": "Two stars moving closer emitting a sparkling, shimmering object.",
      "city": "pittsburgh",
      "shape": "formation",
      "date": "2014-11-14T00:00:00",
      "story": "Two stars moving closer emitting a sparkling, shimmering object. while lying under the stars holding my neighbor's toy poodle next to a campfire, alone as he ran to the local store…I observed 2 lights growing brighter and what appeared to be closer coming from the west toward me.  They were parallel to each other, left and right, and completely level with one another.  As they appeared to grow closer, the left-to-right space between them increased  but they always remained level to one another.  once they became about 5-6 thumbs apart at arm's length, a sparkling light departed from them.  it looked like a firework with multi-colored sparkling lights in constant and consistent intensity and activity. red, blue, green, white.  sparkling and lively. it traveled off to the south with a steady and constant speed/trajectory. afterwards,  the two lights (star-like. if only gazing up quickly one would never realize their position was changing) seemed to back up, becoming more distant.  i said to them \"what is your intention\" over and over again.  i never saw the shimmering light again.  the two \"stars\" never deviated from their relate position to one another.",
      "link": "http://www.nuforc.org/webreports/115/S115203.html",
      "state": "PA",
      "duration": "10:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b4c",
      "summary": "5 red lights hovering over airport.",
      "city": "pittsburgh",
      "shape": "formation",
      "date": "2014-11-14T00:00:00",
      "story": "5 red lights hovering over airport. My father and I drove to Walmart in West Mifflin, I saw a group of strange lights over the airport, at first i thought it was a plane until I noticed they weren't moving, nor were the lights blinking.  The 5 lights seemed to be randomly scattered, then 3 of them made a triangle shape.  It then looked like the triangle turned in the sky, as one bottom light eclipsed the other.. then one by one, the lights slowly disappeared until one remained and that slowly faded away.  I knew it couldn't be a plane or helicopter.  I thought it may be Chinese lanterns..   But then I saw somebody saw something similar EXACTLY one month before me, same time and everything...that can't be a coincidence.",
      "link": "http://www.nuforc.org/webreports/115/S115311.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2ed5",
      "summary": "12 red lights over Pittsburg.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2014-08-15T00:00:00",
      "story": "12 red lights over Pittsburg In the Oakland area of Pittsburgh, 4 other people and myself watched 12 red/orange lights appear in the sky traveling from southeast to southwest until they were out of sight.   The lights did not blink, I was able to make a cell phone video of it.",
      "link": "http://www.nuforc.org/webreports/112/S112302.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c33b6",
      "summary": "I was driving and noticed a flying object thinking it was an airplane. But seeing it having bright red light and noticed it was getting",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2015-04-03T00:00:00",
      "story": "I was driving and noticed a flying object thinking it was an airplane.  But seeing it having bright red light and noticed it was getting larger and larger.  It was circular!  It was bright red.  Now, the strange thing was that around its paremeter, it had a softer red glow.   i pulled over,but could not get out for there was some cars going down the road.  However, the redness dissapated gradually, leaving the object just black,descending at a normal speed...not like a fast crash landing.  I have never seen anything like this before.  The area it was going down was toward Jefferson Hills in southwestern pa.",
      "link": "http://www.nuforc.org/webreports/118/S118164.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c363b",
      "summary": "Eastern Pittsburgh--Bright orange orb, slow-moving.  Blasts east, shortly followed by fighter jets.",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "",
      "story": "Eastern Pittsburgh--Bright orange orb, slow-moving.  Blasts east, shortly followed by fighter jets. Third party account: Grandpa kept telling us about this time where he was outside (with his kids, who were too young to remember) in eastern Pittsburgh.  It was in the 1960s.   In the sky, a large orange sphere floated into view slightly south in the sky.  It loitered for a minute or so, and then rocketed off into the eastern sky.  No noise, consistent acceleration.  Within 5 minutes fighter jets flew past following the path of the orb.   He promptly called the Air Force, and got on his HAM radio.   Do not recall what the explanation was. I've seen a couple similar reports here.  No mention of the fighters, though. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116637.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42c8",
      "summary": "Slow moving orange ball shaped objects fling from east to west across the sky.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2015-04-17T00:00:00",
      "story": "Slow moving orange ball shaped objects fling from east to west across the sky. I notice these orange ball shape things in the sky about 9PM at night. there were six of them a row.  Travelling from east to west extremely slow. They were close together . A medical helicopter flew under them travelling north to south and an airplane flew behind them from south to north.  They travelled so far across the sky and one at a time started to go straight up and disapeared in the sky.  It lasted about ten to twenty minutes.  The seventh one showed up some distance behind the six.  At about 9:30PM only one showed up doing the same as the rest.   At 9:45PM another did the same.  They were all orange in color and round like balls. It was the slowness of there movement that caught our sight.",
      "link": "http://www.nuforc.org/webreports/118/S118361.html",
      "state": "PA",
      "duration": "night"
    },
    {
      "_id": "64d005f478aba2ec5a3c44ae",
      "summary": "Blue ball in sky falling to ground, disappeared.  ((NUFORC Note:  Possible meteor?  PD))",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2015-11-26T00:00:00",
      "story": "Blue ball in sky falling to ground, disappeared Sunday November 8, 2015, I was driving south on I-79 on the curve between the Carnegie and Heidelberg/Kirwan Heights/Collier exits when a blue ball hovering in the sky caught my eye.  When I focused on it, it fell quickly straight towards the ground and disappeared mid-fall.",
      "link": "http://www.nuforc.org/webreports/124/S124297.html",
      "state": "PA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c461a",
      "summary": "Blue-green ball fell quickly from sky; disappeared",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2015-11-26T00:00:00",
      "story": "Blue-green ball fell quickly from sky; disappeared November 22, 2015, I was once again driving south on I-79, this time just south of the Bridgeville exit, when I saw a blue-green ball in the sky.  It was the same size as the blue one that I saw two weeks ago.  This one once again fell from the sky really fast once, I focused on it.  Once again it disappeared mid-fall.",
      "link": "http://www.nuforc.org/webreports/124/S124296.html",
      "state": "PA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4815",
      "summary": "Multiple blue light over skyscraper in Pittsburgh, PA.  ((NUFORC Note:  We suspect the lights are lens flares.  PD))",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2015-09-25T00:00:00",
      "story": "Multiple blue light over skyscraper in Pittsburgh PA Was in Pittsburgh on top of the parking garage in station square.  We was taking pictures of my girlfriends car with the city as the background.   After I got back in the car I was reviewing the pictures and noticed something strange in the sky.  At first I thought the reflection of the building might of been making the lights in the sky appear so I tried moving to other angles and objects never changed.   So I took a few more pictures and even zoomed in on a few.  If you look close on a few of the lights you can see that there is dark spots in the center of a couple of them.  I was posting to see if anyone else might of noticed these strange lights or if anyone knows what this might be. ((NUFORC Note:  We suspect the lights are lens flares.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122073.html",
      "state": "PA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b57",
      "summary": "Fireball came in from east and made sharp turn north.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2015-09-29T00:00:00",
      "story": "Fireball came in from east and made sharp turn north Viewed from south hills. 1 fireball came in from east.  Made sharp turn north. No sound.  There was a plane in the western sky that looked normal, this was different. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122325.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d1e",
      "summary": "Falling blue round object southern sky pittsburgh helicopters flying around area of possible sighting",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2015-09-11T00:00:00",
      "story": "Falling blue round object southern sky pittsburgh helicopters flying around area of possible sighting. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121816.html",
      "state": "PA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ed0",
      "summary": "((HOAX??))  Went out to walk dog an seen a huge round thing in the sky above Mr with yellow green an blue lights.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2016-03-18T00:00:00",
      "story": "Went out to walk dog an seen a huge round thing in the sky above Mr with yellow green an blue lights I took a picture an was scared so went back in the house.",
      "link": "http://www.nuforc.org/webreports/126/S126367.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c584f",
      "summary": "Orange, slow moving, maneuvering \"plasma-like\" fireball object.  Deliberate direction change.  Low altitude.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2016-06-16T00:00:00",
      "story": "Orange, slow moving, maneuvering \"plasma-like\" fireball object.  Deliberate direction change.  Low altitude. Noticed a bright orange light moving slowly west.  I would guess low altitude, a few thousand feet at most.  Absolutely no sound.  It appeared to radiate light \"strings\" (like the center of those plasma ball lamps) I ran outside to film it with my phone, but as you'd expect the quality is terrible as I couldn't get focus as close as I'd like to with an iphone. The object turned north fairly sharply, traveled a quarter mile or so and then accelerated northwest and out of sight. This object did not seem to be reflecting sunset, it seemed to be creating its own source of light.  This object was too quiet for a known (to me) engine powered craft at that altitude.   This object also was fairly nimble at maneuvering.  I would not consider its motion to be high speed (when viewed).",
      "link": "http://www.nuforc.org/webreports/127/S127883.html",
      "state": "PA",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5807",
      "summary": "Identified (sic. Unidentified??) small sphere next to jet airliner while flying near Pittsburgh.",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2016-06-10T00:00:00",
      "story": "Identified (sic. Unidentified??) small sphere next to jet airliner while flying near Pittsburgh. I was flying in a plane was descending to Pittsburgh Airport and was looking out the window.  I was looking forward out the window and saw a sphere approaching the plane going the opposite direction, moving fast, since we were going in the direct opposite. My first thought was, what is that up here, then it was abreast of the wing, then gone. I had a good look as it was close to the plane.  Round looking slightly reddish with one antenna sticking out that I could see and appeared to have others wrapped around the sphere.  It was not smooth in that sense. The whole event was a second or so but caught my attention.  I didn't say anything to the crew, as I departed, though I wanted to ask.",
      "link": "http://www.nuforc.org/webreports/127/S127793.html",
      "state": "PA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a03",
      "summary": "It was A Bright Light. It Would Move Sporadically. There Were Also Multiple Other Small Dim Lights That Would Move Very Fast In Multipl",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2016-05-20T00:00:00",
      "story": "It Was A Bright Light.  It Would Move Sporadically.  There Were Also Multiple Other Small Dim Lights That Would Move Very Fast In Multiple Directions.  It Was As If The Smaller Dim Lights Were Going Back And Forth To And From The Main Light As Bright As A Star.",
      "link": "http://www.nuforc.org/webreports/127/S127425.html",
      "state": "PA",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e80",
      "summary": "Saw 2 bright glowing orbs in Pittsburgh.",
      "city": "pittsburgh",
      "shape": "unknown",
      "date": "2016-11-11T00:00:00",
      "story": "Saw 2 bright glowing orbs in Pittsburgh. I was watching the walking dead when i glanced out the window and noticed 2 bright glowing objects in the sky.  At first i thought they were stars but I looked back I noticed they were slowly moving one directly up and the other slowly to the east.  I live in the path to the airport so I thought maybe they were planes in the distance, but they had red lights on them, they were simply bright light, I went out and watched them for 15 as they slowly kept moving, I noticed one start to get brighter and glow with a green hue i went back in to get my phone to try and get a picture but my camera sucks at night so I didnt bother.  I went back in to try and get someone to take a look with me but when i went back in they were gone. I live in the city I thought this was very odd I know what helicopters, stars and planes look like in the sky and this was neither.  I feel a bit weird even posting this but Mr. Davenport always encourges us on coast to post these things so im doing that now.",
      "link": "http://www.nuforc.org/webreports/131/S131064.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c614f",
      "summary": "Saw a triangle/chevron shape black and red craft flying over the clouds at a high rate of speed to the south",
      "city": "pittsburgh",
      "shape": "chevron",
      "date": "2016-09-30T00:00:00",
      "story": "saw a triangle/chevron shape black and red craft flying over the clouds at a high rate of speed to the south I was outside in my backyard feeding my infant i was facing south looking up at the clouds and also looking at a jet aircraft and all the sudden above the clouds which were at 25,000 feet after calling the pittsburgh weather service came from over head a triangle/chevron shape craft that was black and also had a red coloring on it flying what looked to be way faster than the jet craft just not stop in a straight line heading south. it was moving to fast for me to get my phone out i also had a child in my arms. the craft looked to be very large at the time i ran to the side of the yard and it was gone because of how fast it was traveling at the time.",
      "link": "http://www.nuforc.org/webreports/130/S130192.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c636c",
      "summary": "Very large, non-moving object northern sky at 340 deg.. It was like the largest non-twinkling star I've ever seen but it was too early.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2016-08-16T00:00:00",
      "story": "Very large non moving object northern sky at 340 degrees.  It was like the largest non- twinkling star I've ever seen, but it was too early to see stars, and if it was a planet it was way out of place!  Then it just went out.",
      "link": "http://www.nuforc.org/webreports/129/S129044.html",
      "state": "PA",
      "duration": "30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c635d",
      "summary": "Large circular light spotted in airspace above Consol Energy Center",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2016-09-15T00:00:00",
      "story": "Large circular light spotted in airspace above Consol Energy Center While on a FaceTime call, I noticed a bright light out the window, large and circular in shape.  It was being followed by two jets, but the lighted craft was silent.   It's not the first time I've seen it, it's shown up several (aprox. 3 times since the start of August) and tonight was the first time we've noted crafts following behind it.",
      "link": "http://www.nuforc.org/webreports/129/S129939.html",
      "state": "PA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c63ef",
      "summary": "Saw 3 red lights hovering in distance, about the height of typical aircraft. 3 red lights hovered in a triangular pattern, one by one,",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2016-09-02T00:00:00",
      "story": "Saw 3 red lights hovering in distance, about the height of typical aircraft.   3 red lights hovered in a triangular pattern, one by one, each light seemed to immediately disappear. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129600.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c64f1",
      "summary": "Shiny capsule-shaped object seen over Pittsburgh",
      "city": "pittsburgh",
      "shape": "cylinder",
      "date": "2016-08-02T00:00:00",
      "story": "Shiny capsule-shaped object seen over Pittsburgh As I was exiting my car in the driveway I saw a commercial airplane overhead making it's way to the Pittsburgh International Airport west of the city.  While looking at the plane I noticed a bright object below the plane traveling SE to NW, very slowly.  The object had no wings, was completely silent, and reflected the evening sun on what appeared to be a highly reflective surface.  Feeling the impulse to get a better look, I ran into my house to get my field binoculars for a closer look, but by the time I got back outside to the front of my house, it was nowhere in sight.  In my opinion, since it was traveling so slowly, it boggled my mind to have flown off so quickly by conventional methods.  This leads me to the conclusion that it wasn't anything conventional.",
      "link": "http://www.nuforc.org/webreports/128/S128655.html",
      "state": "PA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6670",
      "summary": "Three black objects seen in early evening sky",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2016-08-02T00:00:00",
      "story": "Three black objects seen in early evening sky It was just before dusk and my mother noticed 3 black objects in the sky.  At first she thought they were birds when she realized they weren't she called me to come take a look. We watched them for about ten minutes until they were out of sight.   There was one in the front that appeared to be higher then the other two.  Two of them were traveling at the same height and were in a straight line with one in the front and the other one behind it.   They seem to stay the same distance apart for the entire time we saw them.  They were traveling northwest.   The objects made no sound and had no lights on them.  We live in the South Hills of Allegheny county outside Pittsburgh.  I was able to get a picture of the three objects.",
      "link": "http://www.nuforc.org/webreports/128/S128940.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c66bb",
      "summary": "UFO zips across a double rainbow",
      "city": "pittsburgh",
      "shape": "other",
      "date": "2017-04-20T00:00:00",
      "story": "UFO zips across a double rainbow On February 24, 2016, I took a live photo on my iPhone 6s of a double rainbow.  I was looking at my old photographs and stumble across that one and held the screen to make the short gif start playing and noticed something strange eight little balls of white.  They float across the shot and then disappear sometimes morphing into fewer dots.  It all happens very fast,  I've taken a few isolated shots of the clip as well. ((NUFORC Note:  The photo shows several blurry white \"splotches,\" which we suspect may have been seagulls, although we cannot be certain as to the nature of the objects.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133714.html",
      "state": "PA",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6984",
      "summary": "((HOAX??))  Two strange red lights.  ((anonymous report))",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2017-03-10T00:00:00",
      "story": "Two strange red lights We were driving back late at night from a party, and we look up and there's these two strange flashing red lights and a strange sensation came over the two of us and I didn't catch a photo because of the strange sensation.   We circled back to look for it but by them  it was gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132989.html",
      "state": "PA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e40",
      "summary": "5 orbs appeared all with a reddish orange light.  There were 4 smaller 1 lrg.  No noise.  Flying over shopping center.",
      "city": "pittsburgh",
      "shape": "formation",
      "date": "2017-09-05T00:00:00",
      "story": "5 orbs appeared all with a reddish orange light.  There were 4 smaller 1 lrg.  No noise.  Flying over shopping center. I was driving East on Penn Ave..  As I approached Club One at 6325 Penn Ave, Pittsburgh, PA, 15206, I noticed initially 2 red balls in the sky, as if a group of helicopters were approaching.  Then I noticed 2 more.  There appeared to be 1 leading and the other 3 following.  But, they made no noise.   I pulled over in the parking lot that adjoins the gym near the McDonald's.  As I parked, I noticed them flying towards the townhomes across the street toward the Shadyside area.  I took a few pictures.  I was upset I couldn't get video because I just returned from vacation and didn't have enough space for video.   Then a larger one appeared which was about 2.5x's there size.  But I didn't think I captured it because of the lights from the McDonald's sign.   I also captured the 4 smaller ones, and unbeknownst to me, in the 1 picture with the illuminated McDonald's sign, if you enlarge it, you can see the shape of the actual object and the red going from back to front in a wave like  design.  But behind it, a few days later I noticed a blue glow.   When I enlarged the picture there appears to be a blue circular craft. And between the 1st one in that picture and blue craft their appears to be an irregular, rectangular shaped object that is not illuminated.  So there were possibly 7 total objects.   I have attached the 3 photos.  Please magnify for detail. ((ADDENDUM FROM WITNESS)) I am the 8/26 report from Pittsburgh- 5 orbs in a formation. .. time of event shld be bwtn 21:00-21:30 instead of 15:10 … ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/135/S135943.html",
      "state": "PA",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7291",
      "summary": "Red Round Glowing Light. Still except once made a small triangle. Maybe some orange lights. Disappeared by shrinking.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "Red Round Glowing Light. Still except once made a small triangle. Maybe some orange lights. Disappeared by shrinking. I saw a red light in the sky that was too large to be a planet as I was heading to the store.  To get a better look (because I was convinced I was looking at a plane or drone) I drove to view the object better.  It was late, between 10:30 pm and 11:00pm.  I pulled onto a dark street that overlooked a field were Kelton Elementary School once stood.  As I watched, What I 1st thought was moving was in fact still.  The object seemed to be glowing red (sometimes I thought I saw orange).  The size kept changing..it seemed to shrink a bit. At one point the red light moved, slightly in a triangle shape. The red light was too far into the sky to be a drone.  I did not notice any other lights in the sky, but for stars.  It was making me crazy that I had no one to witness this, and my cell phone was dead.  I suddenly saw 2 teenage girls in the field to my left.  I shouted down to them and asked if they too could see the light from where they stood (I was up higher on the street, and the field was below me).  At 1st they could not see it because they were looking in the wrong direction.  Once they spotted it, they both yelled...what is that.  All the sudden it began to shrink in size until it was gone..about 3 seconds.  They both started shouting what was that..thanked me for showing to them..and I drove off.  The light was too far away to be a drone and way too far in the sky.  Too see my vantage point, you can google Key Stone Oaks High School,  My Lebanon, PA.  I was parked on Delwood Ave. in Dormont, PA.  I'd say I was looking toward the Southern Sky when I saw it.  This is driving me crazy!!  What did I see?",
      "link": "http://www.nuforc.org/webreports/134/S134269.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7672",
      "summary": "Husband and I both saw 4 lights in the nortern skies over Pittsburgh Pennsylvania. They looked like 4 orangish stars in a row.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "Husband and I both saw 4 lights in the nortern skies over Pittsburgh, Pennsylvania.  They looked like 4  orangish stars following in a row, making no noise.",
      "link": "http://www.nuforc.org/webreports/138/S138119.html",
      "state": "PA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c77c7",
      "summary": "Aliens.",
      "city": "pittsburgh",
      "shape": "triangle",
      "date": "2017-11-03T00:00:00",
      "story": "aliens Not saucer shaped but more triangle shaped. 5 lights in a triangle shape. spotted it moving but next time it moved it went south and then straigh up and it was gone. No plane can move that fast. this was on october 15 2017 at 2:00 am.  I spotted it and my buddy looked and seen the same thing.  i have seen quite a few but this one was very visible and thru binoculars i seen all the lights along with a plane flying south east of it and it was higher than the plane",
      "link": "http://www.nuforc.org/webreports/136/S136869.html",
      "state": "PA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7847",
      "summary": "The children and I saw 3 red/good  dots in the sky in the formation of a triangle.  Disappeared, reappeared.  ((anonymous report))",
      "city": "pittsburgh",
      "shape": "triangle",
      "date": "2018-01-12T00:00:00",
      "story": "The children and I saw 3 red/good  dots in the sky in the formation of a triangle.  It disappeared for a while then reappeared and spread out a little.  It looked as if it was coming towards us.  My children are under 12 and everyone is a bit startled. ((NUFORC Note:  We have amended the time above to reflect an evening sighting, which seems more logical to us than a morning event.  Source of report elects to remain totally anonymous, and provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138346.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c78e2",
      "summary": "Flight of four half \"V.\"  ((anonymous report))",
      "city": "pittsburgh",
      "shape": "formation",
      "date": "2017-12-04T00:00:00",
      "story": "Flight of four half V. Saw 4 objects in half of a \"V\" formation, approximately 500 feet apart, and altitude of around 1000 feet above ground, traveling northeast at around 150 knots.  No sound noted.   Color and shape alternating between white sphere to multi-angular shape with color changing between lead grey to shiny sun reflecting silver.  The leading object always appeared in the angular shape.  Size of craft estimated to be 20 foot diameter. ((NUFORC Note:  Witness provides no information; elects to remain anonymous.  Hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137451.html",
      "state": "PA",
      "duration": "3 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7962",
      "summary": "TR-3B Astra?  ((anonymous report))",
      "city": "pittsburgh",
      "shape": "triangle",
      "date": "2017-11-17T00:00:00",
      "story": "TR-3B Astra? I was alerted to the presence of a low altitude helicopter.  I opened my window and looked up to see a helicopter at about 600ft. altitude flying directly below and behind a large triangle object at about 1500ft. altitude.  The helicopter and triangle object were traveling Eastward.  The helicopter was lit underneath and appeared to be military, possibly UH-1N.  The triangle object was very slow moving at about 50 knots.  The triangle made no perceptible sound.  The triangle had large, round, diffuse white lights on each corner, a large faint yellowish/orange light in the center, and a small strobing red light off center to the rear of the craft.  I estimate the size of the triangle to be about 300ft. from corner to corner.  The helicopter broke course and headed Westward at low altitude along the Allegheny river then down the Ohio river while the triangle continued slowly Eastward until out of view. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137263.html",
      "state": "PA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ae0",
      "summary": "Saw orange red glow in sky for several minutes.  ((anonymous report))",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2017-11-09T00:00:00",
      "story": "Saw orange red glow in sky for several minutes. In the southeast part of the sky, an orange glow/fog was “flickering” in the sky.  Light was red orange and kept fading and glowing brighter for a few minutes.  Could not capture it on video as it was too dark.  Was not a meteor or fireball.  Reminded me of project blue beam or a very unique event in the sky.  I’m a 25 year old musician with an obsession of occult and ancient information.",
      "link": "http://www.nuforc.org/webreports/137/S137125.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d23",
      "summary": "This report is just a collective of UFO’s I have seen in the past 2 years on top of this instance. I shall start with this instance. I",
      "city": "pittsburgh",
      "shape": "sphere",
      "date": "2017-09-21T00:00:00",
      "story": "This report is just a collective of UFO’s I have seen in the past 2 years on top of this instance. I shall start with this instance.  I am a kind of guy that when he sees something unexplainable like this, he just considers it unknown yet strange.  I have a balcony to which I go out to smoke.  Being as how I live in the city it is very rare to see stars.  So when I recognize something that reminds me of a star I stare at it (I love stars.)  Every time I see an unidentified glowing object or “flying object\" I stare at them to make sure I’m not crazy and or to validate the realness.  I went out to smoke and I noticed the “star” I was looking at was indeed not a star.  And it was seemingly moving against the laws of physics. As if it could go through time or something.  As I noticed that one I had noticed 2 others doing the same thing.  These bluish glowing orbs were moving short distances at breakneck speeds.  I have noticed these same phenomena in the past.  Even having intelligent adults look in wonderment.  That is all that happened in this instance.  The other must tell story is about a year ago during the late summer to fall months.  I had just got to my girlfriends mothers house (I lived there) and on the horizon my girlfriend, her mother, and I had witnessed a giant (10 times bigger than the moon perceptually) orange sphere.  It was almost exactly like the depictions of USO’s.  Except there was no large body of water anywhere near me.  My girlfriends mother just shrugged it off while I was so lost and curious.  There is constant sightings of UFO’s in my area.  We even had a woman In Pittsburgh last august make it on the news for seeing something strange  In the sky.  She calls the police and even the police think its weird.  Wish we could know what the phenomena is or is caused by.",
      "link": "http://www.nuforc.org/webreports/136/S136238.html",
      "state": "PA",
      "duration": "3-4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c862c",
      "summary": "Bright fast moving object disappeared into cloud then the cloud disappeared.",
      "city": "pittsburgh",
      "shape": "circle",
      "date": "2018-08-10T00:00:00",
      "story": "bright fast moving object disappeared into cloud then the cloud disappeared. On July 28th, 2018, my son and I were sitting on my back porch talking.  I happened to look up at the sky and I noticed a fast moving, bright object moving quickly across the sky.  The object was round and very bright.  It did not have any blinking lights on it, like planes do. The object was moving from the SW to the SE.  My son who is an adult also saw the object.  The sky was fairly clear except for a few big puffy clouds.  We could see very well as there was a full moon.  When the object came very close to this one cloud there was a bright flash of light as it appeared to enter the cloud.  It appeared to almost spark.  We never saw it exit the cloud and then the oddest part was the cloud that it entered totally disappeared.  It took probably less than 3 mins for this cloud to evaporate, we could see it disappearing. The other clouds that were in the sky stayed the same.  There was not any wind or storms in the area when this happened.  The other odd thing was several dogs started barking very loudly when this was happening.",
      "link": "http://www.nuforc.org/webreports/142/S142459.html",
      "state": "PA",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8657",
      "summary": "Pittsburgh ascending fireball.",
      "city": "pittsburgh",
      "shape": "fireball",
      "date": "2018-08-10T00:00:00",
      "story": "Pittsburgh ascending fireball 7.29.2018 Approximately 11pm, my wife and i saw saw a strange colored orange light in the sky.  We live 5 min from point state park at the mouth of the three rivers.  The object flew at a height of maybe 10k feet silently.  As it came more directly overhead it appeared to be a fireball....next the object began to ascend rapidly, at what appeared to be a direct line staright up like a rocket until it faded from view.",
      "link": "http://www.nuforc.org/webreports/142/S142460.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ab0",
      "summary": "Noticed a pair of very slow moving lights went out to street and observed it being followed by single light",
      "city": "pittsburgh",
      "shape": "",
      "date": "2019-09-06T00:00:00",
      "story": "Noticed a pair of very slow moving lights went out to street and observed it being followed by single light. Parallel lights 2 amber in color followed by single light also amber.",
      "link": "http://www.nuforc.org/webreports/148/S148585.html",
      "state": "",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b42",
      "summary": "Bright, twinkling light zig zagging over Pittsburgh",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2019-03-14T00:00:00",
      "story": "Bright, twinkling light zig zagging over Pittsburgh I saw a bright, twinkling light out of my bedroom window, which looked like a bright star, but too bright for an overcast night, so I went to the window to watch it, and after a few minutes, it began to move side to side, then up and down.  It also appeared to have a blue halo, but that could've been due to the weather conditions.  The movement looked like a drone, but I watched it for 40 minutes, and it first moved a distance away and kind of repeated the back and forth motion, then went further away until I could no longer see it, but it was ascending, not descending, so I don't think it could be a drone.  As it moved away, it also appeared that the light was rotating because I would think it was too far away to see, then I would see a glimmer of light every few seconds.",
      "link": "http://www.nuforc.org/webreports/145/S145114.html",
      "state": "PA",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b75",
      "summary": "Supermassive flash of light over Pittsburgh area.  ((anonymous report))",
      "city": "pittsburgh",
      "shape": "flash",
      "date": "2019-03-14T00:00:00",
      "story": "Supermassive flash of light over Pittsburgh area. I was driving home when the sky in front of me lit up bright orange and red.  It look as though someone had set an ICBM off right above the city of Pittsburgh.  It lasted for about 10 minutes, and it lingered as a massive explosion would, I am a vet so as soon as I saw it I braced for the boom, but there was never a peep. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145063.html",
      "state": "PA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ca4",
      "summary": "Consecutive dots of red lights pass over the sky’s of Pittsburgh PA",
      "city": "pittsburgh",
      "shape": "triangle",
      "date": "2019-02-07T00:00:00",
      "story": "Consecutive dots of red lights pass over the sky’s of Pittsburgh, PA. A series of red lights of dots pass over our heads between 7:18-7:21 pm.  Over 20 consecutive red dots of light went by very slow and low. There was no erratic movement.",
      "link": "http://www.nuforc.org/webreports/144/S144762.html",
      "state": "PA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e03",
      "summary": "Me and my parents were driving to my little sisters birthday party in Robinson. I look towards a ups compound/ office building. I see a",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2019-01-04T00:00:00",
      "story": "Me and my parents were driving to my little sisters birthday party in Robinson.  I look towards a ups compound/ office building.  I see a orb or some kind of light start to float up and it went up then it flew over us.  I looked towards my sister who I am one year older than I tell her “Did you see that?!”  Then she said “ I think...”for the rest of the day I’ve been wanting to report this but I am confused and scared please let me know about this.",
      "link": "http://www.nuforc.org/webreports/144/S144172.html",
      "state": "PA",
      "duration": "~7-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fa1",
      "summary": "Orange fiery object formation in sky over North Hills, Pittsburgh.",
      "city": "pittsburgh",
      "shape": "light",
      "date": "2018-11-24T00:00:00",
      "story": "Orange fiery object formation in sky over North Hills, Pittsburgh Coming home to the North Hills (West View) area of Pittsburgh.  Noticed bright, fiery looking balls in a mainly linear formation directly above and to the right of where I was driving.  At first thought they must be  some sort of radio towers, but they were very bright and appeared to be flickering. The lights (approximately 6 ) were  in a horizontal line, except for two, that were in a vertical formation to the other lights as shown below:   *  *                   *                                 *               *  *    They appeared to be stationary, and since I was close to home, I looked for them when I got out of the car but they were gone. ((NUFORC Note:  Asterisks' orientation to one another did not survive the transfer from our report form to our database.  Original shows four asterisks in a straight line horizontally, and two of them oriented vertically in the center of the formation.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143769.html",
      "state": "PA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c91d8",
      "summary": "Two lights, one white, one blinking red, travelling at the same speed  showed as its profle a triangular UFO-lights etched shape of it",
      "city": "pittsburgh",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "Two lights, one white, one blinking red, travelling at the same speed  showed as its profle a triangular UFO-lights etched shape of it On the night of October 9th 2019 at 21:00 EST, I witnessed a UFO at the Northland Public Library (300 Cumberland Drive, Pittsburgh, PA 15237).  The sky was clear and the moon was out (past full moon stage). I have frequented this library day and evening for the past 20 years and I’m familiar with the typical lights present at night. As I was walking to my car from the closed library, I noticed two lights at about 45° approaching from the Eastward direction travelling Westward.  The lights were separated a little less than 3° ; the top light was white while the bottom one was a red blinking light.  I wondered if they were stationary or moving so I got into my car and used the oil change reminder sticker on my inside windshield to measure; yes they were moving slowly and moving in together at the same speed. I got out of the car to observe and try to take a picture/video. After a minute, this slowly travelling object showed its profile to me; it was a triangular! -shaped UFO with lights (portal lights?) highlighting the whole shape of the UFO a total of about 1° width. The edges were not sharp, they were curved. After it passed, I hurried and drove to an adjacent church where I could get a better view. From this vantage point, I saw it calmly proceed in the Westward direction toward the horizon.",
      "link": "http://www.nuforc.org/webreports/149/S149709.html",
      "state": "PA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c92af",
      "summary": "Group of 3 red lights in a distance. They were grouped together and then split and moved to the right out of sight. About 30 seconds la",
      "city": "pittsburgh",
      "shape": "",
      "date": "2019-12-01T00:00:00",
      "story": "Group of 3 red lights in a distance.  They were grouped together and then split and moved to the right out of sight.  About 30 seconds later saw another red light coming from same place and went where other lights did.",
      "link": "http://www.nuforc.org/webreports/150/S150223.html",
      "state": "PA",
      "duration": "5 min"
    }
  ]
}