{
  "city": "plano",
  "fetch_timestamp": "2025-07-12T14:35:07.626968",
  "record_count": 42,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b46d5",
      "summary": "Big white flash in and thru my car",
      "city": "plano",
      "shape": "unknown",
      "date": "2006-05-15T00:00:00",
      "story": "Big white flash in and thru my car I was standing at a red light eastward on Legacy Drive at the Dallas North Tollway intersection, when suddenly I saw a big flash on top of my SUV and it illuminated the car on the inside as if someone had taken a picture inside the car with a big flash. It was a big white flash, I rolled down my window and looked  to the car nest to me and the other driver looked at me asked me \"what was that?\" ,  I shrugged my shoulders, looked above and saw nothing. I kept driving eastward on Legacy Drive and looking at the sky thru my sideview mirrors and also looking upwards outiside my window and saw nothing else.",
      "link": "http://www.nuforc.org/webreports/050/S50556.html",
      "state": "TX",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4850",
      "summary": "Unidentified Light - Color Changing and Flashing, Very Fast and Maneuverable beyond anything I've Seen - Plano, TX",
      "city": "plano",
      "shape": "unknown",
      "date": "2019-06-07T00:00:00",
      "story": "Unidentified Light - Color Changing and Flashing,  Very Fast and Maneuverable beyond anything I've Seen - Plano, TX At approximately 9:40PM on 05/21/2019, I observed a very unusual light, while looking north from my Apartment Complex in East Plano, TX.  To provide background, to the north of my apartment is a major thoroughfare of Aircraft flying West toward DFW Airport and Love Field in Dallas, TX.  I often smoke outside in the evenings and have seen all types of crafts, usually easily determining that they are Commercial Aircraft.  On THIS occasion, the light was different. First, the light was White and moved about half-way across the entire horizon from East to West.  It moved at a MUCH higher rate of speed than any plane.  There were planes in the distance to compare to.  Suddenly, it Stopped.  No slowing, as if a plane was turning… it just Stopped.  It proceeded to move directly Upward at a high rate of speed, and then back Downward at a slower rate.  This is definitely not any maneuver that can be performed by modern aircraft.  It was also quite a distance away.  My guess would be 10+ Miles North of me, possibly near McKinney, TX, but it is hard to determine . The light was Solid White to begin with, then began to flash, and then turned a solid Red.  The flashing was Extremely Bright for something that far away. I ran inside to get my Cell Phone to record the light.  When I came back out, the light was still there, and came above the horizon (so, it couldn’t be a drone… too far away.)  It continued to flash and then moved directly Upward.  It then moved to the East toward an Airplane that was flying East to West.  It seemed to mirror the speed of the plane, but was lower on the horizon.  Again it stopped.  The color changed to a Red from White, and it dimmed by a large amount.  The Light then became bright again and moved back to the West.  I continued to watch the light until it went below the Horizon. I see planes flying in this sky on a DAILY basis… and always keep an eye out for anything weird… this is the FIRST TIME I have ever seen anything like this.  I don’t know WHAT is was, but the movements were not something I had ever witnessed, nor do I believe that the maneuvers could have been completed by any craft with our technology. I DID video what I could, but my footage is grainy, and I’m not a good Camera-Man.  I do narrate what I am seeing.  In any case, here is a link to the Video: https://www.dropbox.com/s/huc2bl3elvlg3j5/0521192142.mp4?dl=0",
      "link": "http://www.nuforc.org/webreports/146/S146140.html",
      "state": "TX",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5993",
      "summary": "Multiple strange hovering lights seen in the night sky over Plano and Allen, Tx.",
      "city": "plano",
      "shape": "unknown",
      "date": "2007-10-08T00:00:00",
      "story": "Multiple strange hovering lights seen in the night sky over Plano and Allen, Tx. My girlfriend and I were driving home from a local eatery at approximately 10:30 PM on August 16th 2007. The eatery is located on Preston Rd just south of George Bush Tollway. The route we took was to head north on Preston Rd and enter onto George Bush Tollway heading east. As we continued this way and reached the vicinity of Coit Rd to Custer Rd we witnessed three strange looking lights in the sky northeast of our location. We first thought maybe they are lights attached to a pole for construction work purposes, but as we approached closer we realized they were higher in the air, but not as high as you might expect a plane to be travelling. We then thought they were low flying planes, but the lights appeared to be brighter than what i'm used to seeing and they did not appear to be moving. We continued to monitor the crafts as we transitioned from George Bush Tollway onto I75 heading north and noticed that there were more than just the original three crafts. As we made the change to I75 there were now 3 to the west, 3 to the east, 3-4 to the north, and 3 to the south as we traveled through Plano. On approach to the city of Allen, Texas we then observed 3 more in the distance to the north and 1 to the northeast. They all appeared to have lights like a plane would have ( red, blue flashing lights with a headlight), but the light seemed to always be facing us even as we changed directions and as mentioned before, they did not appear to be moving. Shortly after we arrived at our home in Allen, Texas I proceeded outside with my binoculars, but was unable to observe anything unusual within the airspace I was able to capture. My viewing space was limited due to homes and trees blocking most of my view. Was there some military action or police action? If so, then why was it not aired on the news? Was there excessive air traffic because of the Erin storm front? Again, why was it not on the news? I was not under the influence of any alcohol or mind altering drugs. I have no history of psychologica! l proble ms and was not excessively tired or drowsy. I have never seen anything like this in my life and have lived in the Dallas area for the large majority of it. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58226.html",
      "state": "TX",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b5bef",
      "summary": "Boomerang-shaped UFO over Plano, TX",
      "city": "plano",
      "shape": "other",
      "date": "2007-11-28T00:00:00",
      "story": "Boomerang-shaped UFO over Plano, TX My wife and I were sitting in our backyard stargazing in west Plano, Texas (such that it is) Tuesday night on October 9, 2007 when, at approximately 8:40 PM, we noticed a boomerang-shaped UFO flying from north to south almost directly over us. I guesstimate its altitude between 2000-3000 feet flying faster than the usual commercial air traffic. The craft had a grayish translucent color (like a jelly-fish), but was still clearly visible. It made absolutely no sound whatsoever. Its size in the sky was approximately 1.5-2\" held out at arm's length. The entire sighting lasted only 5-10 seconds before it was out of sight.  While this was not the most impressive UFO sighting I have had--I have had several UFO sightings over the past 40+ years--this was a first for my wife who, needless to say, was very excited at having finally seen one.",
      "link": "http://www.nuforc.org/webreports/059/S59802.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b675e",
      "summary": "A large glowing white orb of light the size of a car shot through the sky parralell to the earths surface.",
      "city": "plano",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "A large glowing white orb of light the size of a car shot through the sky parralell to the earths surface. A large glowing white orb of light the size of a car shot through the sky parralell to the earths surface lighting up all the clouds around it. It seemed to materialize then disolve out of sight.",
      "link": "http://www.nuforc.org/webreports/060/S60577.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c8d",
      "summary": "Strange hovering object with strobing light and air force jet on pusuite",
      "city": "plano",
      "shape": "rectangle",
      "date": "2007-06-12T00:00:00",
      "story": "Strange hovering object with strobing light and air force jet on pusuite I do not have a word processor so i will do my best to have acurate spelling. It was about 10:30 at night and me and my mother were on our way home from a close relatives house. We neared our house when we noticed a strange rectangular object floating in place. It had an extremely brigght strobing light and it appeared to be silver against the night sky. The strange thing i noticed was that the object had no sound. We stopped for a moment when i noyiced what appeared to be an airforce jet below it. The jet was obviously examining the object. As we pulled into the driveway, I ran to the front of the house just in time to see the object shoot up into the clouds with a streak of red and green light as if in a sci-fi movie and the airforce jet attempt to follow it. The total time the object was in the sky is 5 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56563.html",
      "state": "TX",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b723d",
      "summary": "Plano, Texas circular object with rotating flashing red lights",
      "city": "plano",
      "shape": "circle",
      "date": "2008-02-14T00:00:00",
      "story": "Plano, Texas circular object with rotating flashing red lights At approximately 8:20pm we stepped out to the backyard and we were admiring the clear night sky.  I don't know the constellation name but in the NNE sky I could see the triangle - 3 stars - and noticed a fourth and was surprised to see a fourth star?!  At about 10-15 degrees my daughter and I spotted an object that seemed closer to us than the stars. I would say perspectively it looked like it was about 15 miles from us. We looked around to see the airplane flight paths and watched that for about 2 minutes and decided it was not the same as an airplane.   We did not see this object move in any direction but we did see red flashing lights going around it in pattern almost.  The lights spinning around this object would speed up and then slow down.  We watched this thing for about 8-10 minutes and after the last cycle of flashing around this object it rapidly strobed may 6 or so times and it was gone.  About 30 seconds later we saw a dull white streak across the sky in a northerly direction and spotted another object in the North sky but it was glowing bluish somewhat hazy.  Just as the first object, it just disappeared after watching it for nearly 5 minutes.  About 2 or 3 minutes later, we spotted what looked like a military fighter jet flying in the direction we witnessed the first object - we could tell it was not a commercial jet because of it's profile.  It was flying fairly low - at least low enough for us to see the shape of the aircraft.  It is not common for military jets to fly over our house though there are several bases around us.  My daughter did attempt taking pictures of this second object, however, I'm not sure if that is what was captured. I can forward upon request.  We don't know what it was and we are hoping we weren't the only ones who witnessed this.",
      "link": "http://www.nuforc.org/webreports/061/S61515.html",
      "state": "TX",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7232",
      "summary": "Contrail with sharp angle direction change witnessed over Plano, Texas!!",
      "city": "plano",
      "shape": "unknown",
      "date": "2007-11-28T00:00:00",
      "story": "Contrail with sharp angle direction change witnessed over Plano, Texas!! I'm driving home from work east on 15th street approaching Independence Pkwy. when I notice a strange contrail in the sky. It was strange because it had a rapid and sharp direction change. It seemed to be originally travelling SouthWest and immediately transitioned to a straight up direction. I don't believe it was an optical illusion as far as the angle of observation is concerned. I DO HAVE PICTURES TO BACK UP MY STORY. I'm not an expert on contrails, but I have never observed one with such a sharp angle before. It seems to me that the G-forces would not be too forgiving on the occupants inside of the craft. I did see the craft travelling at the upward angle, but could not make out a shape and becuase it was daylight, I could not see any lights. The pictures were taken using my Motorola V360 camera phone and so are not the best photos, but you can clearly see the sharp angle. Any info on what vehicle could complete this type of maneuver would greatly be appreciated.",
      "link": "http://www.nuforc.org/webreports/059/S59942.html",
      "state": "TX",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b7384",
      "summary": "2 lights appear and become extremely bright then fade one by one into the dark night sky.",
      "city": "plano",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "2 lights appear and become extremely bright then fade one by one into the dark night sky. At approximately 7:00 pm on November 19, 2007, I was talking on the phone and looked up in the clear Southern night sky and noticed 2 faint lights moving slowly across.  I would say that they were approximately 200-400ft. apart and stayed in perfect alignment with each other while moving south.   As the two objects moved, one light started to become extremely bright and then the second light became equally bright.  As they continued moving south, the first light that became bright started to dim and disappeared completely, followed by the second light becoming dim and disappearing too.   I am constantly looking in the night sky and was a former Naval Air Crewmen and flew numerous missions while serving in the military.  I am very aware of what aircraft look like and there were no red lights, green lights, or a blinking strobe that are always associated with aircraft.   This is my first experience of an actual truly unidentified flying object in the sky. I am completely elated.",
      "link": "http://www.nuforc.org/webreports/059/S59949.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8735",
      "summary": "stationary small bright chrome light appeared then increased intensity then dissapeeared.",
      "city": "plano",
      "shape": "changing",
      "date": "2009-03-19T00:00:00",
      "story": "stationary small bright chrome light appeared then increased intensity then dissapeeared. On 01/13/09 4:25pm I was driving south on Eldamain rd. NE of Plano Il. I observed a stationary bright chrome looking light, small at first then bigger and brighter. Altitude seemed to be over a 1000’. As I continued to observe it looked to start moving east and then lost brightness and disappeared. I continued to look and see if I could see a plane or jet, there was nothing. This transpired within 20 to 30 seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68058.html",
      "state": "IL",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9326",
      "summary": "oval-like shape with little lights spinning around its perimeter",
      "city": "plano",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "oval-like shape with little lights spinning around its perimeter I was driving home with my children when I noticed something strange in the sky--I only say strange because it seemed to be tilting in place, almost like a kite.  It looked like a staight line of lights line at first, so I thought it was a plane but when it tilted I could see that it was an oval or disk- like shape.  It moved back and forth and up and down, so I decided to investigate by driving in its direction.   It was near Tinseltown movie theatre in Plano, actually about 200  meters above it...about 7 people were looking at it...one was an old man, there were also some young men wearing tuxedos (employees of the theatre?), and a couple of others...I thought, maybe someone is hiding somewhere and flying this thing just to see people sreactins but it moved so gracefully that it seemed real???  Has anyone else reported it--it just happenedwithin the last hour or so!  I can't remember what happened next, but as I was driving home to let my husband know, I spotted it again, this time in Carrollton, near my home.   It was far away, but it seemed to be lowering...I don't know if this was some kind of toy, but ity looked real, and too large to be a toy...about the size of two cars.",
      "link": "http://www.nuforc.org/webreports/067/S67240.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9da3",
      "summary": "Cylindrical craft  with 3 lights seen over Dallas, 10.09.08",
      "city": "plano",
      "shape": "cylinder",
      "date": "2008-10-31T00:00:00",
      "story": "Cylindrical craft  with 3 lights seen over Dallas, 10.09.08 At approximately 8:40 (central) on August 9th 2008, while driving East on the George Bush turnpike in Plano, Texas, my girlfriend and I observed 3 lights in the distance that appeared in a strange formation.  The lights appeared white, with no blinking lights to indicate an airplane or helicopter. The lights were stair-stepped, going from the bottom left to upper right. We exited the turnpike at Custer Road, and proceeded to do a U-turn to head South on Custer Road in the direction of the lights. By the time we had turned around (approximately 30 seconds) the object appeared noticeably close and the lights appeared to have changed formation.  The object was now moving towards us rapidly, and the lights had changed to be almost on top of one another, the largest or closest at the top. The object moved very quickly from South to North-Northwest, passing almost directly overhead and slightly in front of our car. The object appeared now as a long, dark, pencil shaped dark against the night sky, with 3 lights evenly spaced along it, one at each end, and one directly in the center. At this point the object appeared to be flying lower than the local flight traffic approaching Addison airport. The object then kept moving to the North-Northwest at a very fast speed, and we eventually lost it behind some trees. By the time we got to a patch of open sky the object was gone.",
      "link": "http://www.nuforc.org/webreports/066/S66155.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9dfc",
      "summary": "UFO in mid-day over Plano, TX.",
      "city": "plano",
      "shape": "oval",
      "date": "2010-06-23T00:00:00",
      "story": "UFO in mid-day over Plano, TX. I was outside looking at a plane and I suddenly noticed an oval craft about twice the altitude of the plane.  It was bright white and there was absolutely no cloud cover out  today.  The craft disappeared as I was watching it and then it suddenly reappeared at a lower altitude.  It disappeared a couple more times, being at a different altitude when it reappeared.  The craft disappeared one last time and didn't reappear.   This is not a hoax. I have always been a believer and I'm excited to say that this is my first sighting.  I watch UFO files often and I also did a presentation on intelligent life in the universe in Astronomy class.",
      "link": "http://www.nuforc.org/webreports/075/S75845.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba3cf",
      "summary": "I saw a star looking object moving around like a ship in the sky.  ((NUFORC Note:  Possible sighting of star??  PD))",
      "city": "plano",
      "shape": "unknown",
      "date": "2009-06-09T00:00:00",
      "story": "I saw a star looking object moving around like a ship in the sky. I was looking out in the sky because last night i saw what looked like a star the shot down out of the sky. Me and my boyfriend where looking out and I saw a bright bluish looking star, but I had a feeling it wasnt a star so I watched it and it moved. And i told my boyfriend to look at it. It stayed in the same general area but it would move up and down side to side, it would move in circles and it was moving around in the sky for a long time. We got his parents and they saw it too. We also saw about 8 flashes of light across the sky that looked kind of like shooting stars.  We also saw about 4 other stars that were moving like this. But we mainly watched the first one.  I watched it for about 2 hrs.  Part of that time the light got dimmer and dimmer and eventually disappeared but then it came back and it was moving around the sky a lot.  It was too far up to be a plane or anything.  And it wasnt a satellite because it moved around in circles.  It couldnt have been any earthly ships because our ships can't move around in circles and up and down like this thing was. ((NUFORC Note:  Possible sighting of star??  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70289.html",
      "state": "TX",
      "duration": "all night"
    },
    {
      "_id": "64d005f478aba2ec5a3bab95",
      "summary": "Collin County Sighting Plano, TX & Allen, TX",
      "city": "plano",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "Collin County Sighting Plano, TX & Allen, TX While walking my dog in Jack Carter Park in Plano, with clear skies, and many planes and stars above I turned to find what I thought was a very unusual plane coming towards me.  I was so in awe of the glowing blue lights with two large balls in front and center and very slowly changing shades of red, pink and magenta,  I just eagerly awaited it to fly over so I could describe it to some friends that work for an airline so they could identify it.  It just looked like a fancy private plane rimmed in neon blue lights to me. Then instead of flying over as I expected it darted backwards and upward in an instant to what seemed what have to have put in in Allen, TX, just north, flew amazingly higher, and of course became much smaller. Next it started darting up and down at unbelievable speeds and darting extreme straight right and left as it was lowered and raised again. Then it disappeared underneath the tree line. I waited for about 10 minutes and never saw it agai! n before returning home.  What I saw was absolutely plain and clear, there was nothing \"iffy\" about it to me, and there is no \"common\" explanation for it. Nothing would ever change my mind about what I saw. I was hoping it would make the news today...but I didn't see anything, couldn't even find a blog about it...So for whatever anyone would like to share, I thought this ought to be logged.  I know this would not be the popular thing to share in very Conservative Plano, lol....But I just wanted to share, I know I could not have been the only to see it.  So for whatever it's worth...this was my experience... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78098.html",
      "state": "TX",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad7a",
      "summary": "6 grey Cones in circle formation were still over Plano TX city Hall. No one but me saw them on a bus going west on 190.",
      "city": "plano",
      "shape": "cone",
      "date": "2010-11-21T00:00:00",
      "story": "6 grey Cones in circle formation were still over Plano TX city Hall. No one but me saw them on a bus going west on 190. I was riding Dart bus on 190 taking 75 exit to go south to Dallas on Central Expressway when I saw a formation of grey cones that were still in a circle over city hall on Avenue K.  No one on the bus saw them when I said out loud look at the cones in the sky over Plano.   When the bus took the exit they were out of sight.  I've asked around and no one has seen such a vehicle that did not move hovering over city hall.  The sky was over cast. A few days later, I was standing in my back yard one morning and 5 black small pyrimid military jets flew low over my home in formation shacking the ground under my feet with  loud engines noises flying from north to west flying upward into the sky.  I worked as a Human Service Spealist for FEMA from 1996 to 2001.  Office was located off I35. I got dizzy because I could feel ground moving from fault line in area.  A guy from Washington called me into his office and stated that I was a senseative and  not disclose to others beca! use they would not understand. I have seen stainless steel 5'x4' thin 1' thick triangular objects appear and disappear in the sky several feet away from me in Alvarado TX 6 years ago making a static noise when no one else sees them.   I could see the screws that held them together like a quilt of stainless steel pieces.  Three years ago I have seen orange basket balls size balls  of fire spew across the sky within several feet from me in Alvarado TX while visiting my family.  We all saw the balls of fire and hope some day to get a maginet on a stick and try to find them where they land in a field near a creek.",
      "link": "http://www.nuforc.org/webreports/078/S78931.html",
      "state": "TX",
      "duration": "uncertain"
    },
    {
      "_id": "64d005f478aba2ec5a3baddf",
      "summary": "Low ufo disc seen by 5 in broad daylight.",
      "city": "plano",
      "shape": "disk",
      "date": "2010-08-24T00:00:00",
      "story": "Low ufo disc seen by 5 in broad daylight. I was inside my home, and on the phone in the kitchen when I looked out my kitchen window and noticed a disc flying over the trees a few blocks away.  At first I thought it may have been a mylar balloon, but soon realized that was not so.  It glided gently over the tree tops to my left slowly. I told the neighbor who I was on the phone with, to go outside, and see what I was seeing as it was soon to pass over our street; \"Raintree\". She met me outside with our children, her two girls and my son, all young. We all watched as the disc crossed over our street a few blocks away and soon hovered in the air for a few minutes. It was amazing.  Then, slowly, slowly it went straight up. Very slowly, until it looked as small as a star in the day sky, which was bright, brilliant sky blue, with no clouds.  We watched it there for many minutes, and then it went back in the direction it had originally come from . Small as a star at that time. I called the naval air base an! d reported it.  They asked me questions. They agreed I had seen , we had seen a real ufo. It had no seams in the silver looking metal, I could see no windows. It made no sound, and I was not in a position to see a shadow.  That is the truth. The whole truth and not hing but the truth. So, help me God!!!!",
      "link": "http://www.nuforc.org/webreports/076/S76918.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0a4",
      "summary": "Large object in the sky/ black out",
      "city": "plano",
      "shape": "unknown",
      "date": "2011-03-10T00:00:00",
      "story": "Large object in the sky/ black out  500 Lights On Object0: Yes I was hiking with my dog through Suncreek Trail in Plano,TX, the trail opens up into a large area that spans about 10 acres with various paths.  As I was walking I noticed a very large shape in the sky, it was masked by the sky itself and the form could be made out only by the way the clouds where hugging around it. The shape never moved but the clouds did. It was large enough for me to question what I was seeing, so I decided to pull out my phone and take a couple of pictures. As I aimed the lens on my phone my vision closed to a black out, like I was fainting. I tried to shake out of it, and it seemed like a quick head rush and continued on my way, snapping other pictures as I went ( not of the sky though) in fact I never even looked back up ( very weird for me). When I got home I realized that I had not even thought about what had happened until almost an hour later. I went through my pictures and a solid chunk of them where not even there, but I vividly r! emember taking them.",
      "link": "http://www.nuforc.org/webreports/080/S80328.html",
      "state": "TX",
      "duration": "10-20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5e4",
      "summary": "Two UFO's one over the other.",
      "city": "plano",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "Two UFO's one over the other. I was walking on the paved trail at the nature center, when i reached the hill i saw what appeared to be two strange looking lines one above the other out on the western horizon.  These two lines somewhat resembled contrails but they were much shorter and didn't get larger with time the way contrails do.  I pointed these two UFO's out to a couple of other people and they informed me that UFO's were a common sight in that area.  I walked up a little bit higher in elevation and looked in the direction where i had previously witnessed the two UFO's and they were still there looking exactly the same as before -- no movement was discernable.",
      "link": "http://www.nuforc.org/webreports/078/S78938.html",
      "state": "TX",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bb728",
      "summary": "Red-Gold Orb over Plano,Texas.",
      "city": "plano",
      "shape": "light",
      "date": "2010-07-19T00:00:00",
      "story": "Red-Gold Orb over Plano ,Texas June 27. 2010 5:45pm. Still Daylight.  Periodic slight cirrus types of clouds were in the sky. I was in the pool at my friends house in Plano , Texas.  I looked up into the sky looking east and noticed a tiny pulsing REDish Gold spec of light in the air.  It was moving northward very slowly. The object was about the size of a head of a pin seen at arms length. I observed for about 5 minutes.  It stopped moving and stayed in a stationary position..  I said to myself that i am going to go to my car to get my digital canon camera.  And i did. When i got back it was hard to relocate the object at first but i finally was able.  It was sitting there for another 4 minutes and then slowly moved off to the north... Minutes later, I noticed another Goldish red orb in another area in the sky.  Basically overhead but  just a few degrees off to the south from just overhead...  It was larger  or lower and perhaps at the cirrus cloud height.  I took a few pictures with my canon camera..   Again it was still broad daylight and it almost seemed to glisten in a red gold type of light..  It was not close enough to tell if it was actually metallic or if it was a light.  I decided for some strange reason to turn the flash on the camera to on..  When I did that and took a photo.  The object that was standing stationary in the sky for about 5 minutes rapidly accelerated toward the southwest..   And then accelerated again and vanished. It was a two stage acceleration, going from still to rapid speed m then suddenly accelerates again to super fast and it was gone. When looking at the photo that I took,  and after I enlarged it,  looks  like all those other photos that you would see of UFOs in the national enquirer, and I laughed to myself.. To the naked eye it was more visible and did not represent any known aircraft.  It was neither a bird nor a balloon.  I did not know of any bird or balloon that will accelerate the way this thing did, or stay stationary they it did while being watched in the North Texas sky.. Photo to be sent in Email",
      "link": "http://www.nuforc.org/webreports/076/S76459.html",
      "state": "TX",
      "duration": "30 minutes for two events"
    },
    {
      "_id": "64d005f478aba2ec5a3bc17d",
      "summary": "Oval Greenish-White Light with sparks",
      "city": "plano",
      "shape": "oval",
      "date": "2011-10-10T00:00:00",
      "story": "Oval Greenish-White Light with sparks There was an oval light that had a hint of a lime green color.  It moved in a downward motion towards the ground that seemed about 1000 ft away.  It left a trail of orange sparks like a sparkler would produce which lasted about half a second.  There were less sparks than that of a sparkler. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84162.html",
      "state": "TX",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc6de",
      "summary": "V shaped objects, no lights, no sounds",
      "city": "plano",
      "shape": "triangle",
      "date": "2011-10-25T00:00:00",
      "story": "V shaped objects, no lights, no sounds I was exiting my car last night, Oct 20th, at approx. 11 pm when something caught the corner of my eye up in the sky. I looked up to see a V-shaped object that was silently gliding fairly slowly across the sky. It went out of my view so I changed locations only to see it make a large circle and then head back north. It was in sight for approximately 30 seconds then moved out of view completely and about that time a smaller object of the same shape and opacity shot from the south heading north behind it. At first I thought it looked like a flock of birds then realized that it was too perfect and when it circled around I got a better view. There were no lights and no sound. The objects were almost transparent, foggy kind of like a cloud but in a V shape and glided very eloquently and smoothly. I have never seen anything other than normal meteorites in the night sky. I was very excited yet perplexed. I do feel validated though when I read on the Examiner that there was another sighting extremely similar just a few miles away from me and only 30 minutes prior to my sighting last night.",
      "link": "http://www.nuforc.org/webreports/084/S84672.html",
      "state": "TX",
      "duration": ":30"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9ef",
      "summary": "Bright white light,, aliens, phenomena",
      "city": "plano",
      "shape": "unknown",
      "date": "2011-08-07T00:00:00",
      "story": "bright white light,, aliens, phenomena There was a bright light that seemed to accelerate toward the night sky at a 30 degree angle until the light disappeared.   No evidence of the sight but there was one witness that saw the same phenomena.   The angle the light disappeared was at an upward angle that seemed to be away from the earth.",
      "link": "http://www.nuforc.org/webreports/082/S82775.html",
      "state": "TX",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbb2",
      "summary": "A white light in the night sky brightened, faded, maneuvered unlike a star/plane/satellite and disappeared.",
      "city": "plano",
      "shape": "light",
      "date": "2011-07-17T00:00:00",
      "story": "A white light in the night sky brightened, faded, maneuvered unlike a star/plane/satellite and disappeared. It was around 22:45 on the night of 07/14/11 and my friend and I (both actors and musicians in our 20s) were outside smoking a cigarette.  I looked up at Orion’s Belt and noticed what I thought was a star moving North Northeast at a smooth, steady pace.  The light was the same color as the other stars in the sky, a bright white with no flicker.  As I inspected the light I noticed that it was too high up to be a plane around Dallas (my house is right underneath the regular flight patterns for incoming planes into Love Field and DFW Airports) and it was moving too slowly to be a shooting star.   I thought it might have been a satellite due to the size of the light and the steady speed, but after 10 seconds the brightness swelled (not like a flash, but like someone manually changing the intensity of an indoor LED light) and dimmed back down, with the light beginning moving in a small zigzag or spiral pattern before it disappeared.  To me it looked like it just faded out of sight but my friend saw the light get smaller in the sky until it was completely gone about 8-10 seconds later, like it shot up into the sky at speeds unmatched by man-made craft.   The entire encounter took about 20 to 30 seconds and occurred just below Orion’s Belt from our position. ((NUFORC Note:  We believe that the Orion Constellation is not visible during the summer months.  Object sighted may have been the reflection from an Iridium satellite.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82483.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfbdf",
      "summary": "5 Fireball objects in sky over far western Chicago suburbs.",
      "city": "plano",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "5 Fireball objects in sky over far western Chicago suburbs. I was driving south on Rock Creek Road in Plano, Illinois, just outside of town and witnessed 4 fireball looking objects coming from the western sky, the fireball looking objects were in pairs of 2 in the front and 2 following behind.  The 2 in the back were almost crossing paths at one point.  I proceeded to pull over and get out of my vehicle just outside of town near a corn field to get a better look.  I got out of my vehicle and watched 4 of them rise into the sky and changed from a orange color to a silver light as what looked like as they went higher in altitude and disappeared into the sky which was from my vantage point was almost straight up from where i was standing.  Then 1 more appeared from the same western direction the rest of them came from.  It disappeared in the sky almost at the same location in the sky as the previous 4 had done.  These fireball looking objects were bright orange and they DID NOT have oscillating lights like a airplane would have and did not produce any noise.  I was the only witness, I called family across town at 20:53CDT and my phone cut out in the middle of the call so i called again at 20:56CDT to see if they could see these objects but by time they answered the phone these objects had already disappeared in to the sky.  Unfortunately i did not get any pictures or videos of this event.",
      "link": "http://www.nuforc.org/webreports/097/S97407.html",
      "state": "IL",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d8d",
      "summary": "A v-shaped ufo that was translucent with a green tint traveling slowly.",
      "city": "plano",
      "shape": "other",
      "date": "2014-03-18T00:00:00",
      "story": "A v-shaped ufo that was translucent with a green tint traveling slowly. A v-shaped craft that appeared to be translucent with a greenish tent to it on the outer edges.  It had no sound and traveled very smooth and straight.  It also had a hazy, cloudy look to It.",
      "link": "http://www.nuforc.org/webreports/107/S107879.html",
      "state": "TX",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1169",
      "summary": "We saw a light approaching that changed direction and velocity and went away very fast.",
      "city": "plano",
      "shape": "light",
      "date": "2014-02-14T00:00:00",
      "story": "We saw a light approaching that changed direction and velocity and went away very fast. Blue/Red lights traveling towards us looking like an aircraft coming from NE like approaching like a regular aircraft with normal speed as usual.   Look like regular approach path to DFW then stopped and then started going towards NNE with increasing speed (very fast) and then disappeared on the horizon.   There was a sound like a jet but like a dull sound like the afterburn of a jet engine. Important thing is:  pink circle with orange in the middle and blue lights on the outer rim.",
      "link": "http://www.nuforc.org/webreports/107/S107084.html",
      "state": "TX",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c152f",
      "summary": "One hazy, glowing sideways diamond split into 2 smaller diamonds no noise at all.",
      "city": "plano",
      "shape": "unknown",
      "date": "2013-11-11T00:00:00",
      "story": "One hazy, glowing sideways diamond split into 2 smaller diamonds no noise at all i was outside walking my dog when i saw what i thought was a shooting star, but then it split into another object.  Both were giving off a faint glow.  Have never seen anything like this before in my life.  They did not make a single sound, which is what really freaked me out.  They were too close to the ground to be a plane or helicopter or anything else Human's have created.",
      "link": "http://www.nuforc.org/webreports/104/S104230.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c154c",
      "summary": "Yellow sphere observed by two people sitting still and then moving around before leaving",
      "city": "plano",
      "shape": "sphere",
      "date": "2013-10-23T00:00:00",
      "story": "yellow sphere observed by two people sitting still and then moving around before leaving While driving home from dinner at my parents house, my wife and I noticed a round oval looking craft in the sky that was mostly a yellow color (similar to a street light yellow) with little bright white lights around what looked like the center of the craft.  I thought that it was moving very slowly to be a plane and was way to high to be a helicopter.   I told my wife to pull the car over so I could see if the object was moving or not.  When she stopped the object was in fact not moving at all, it then started to move backwards and forwards for a few seconds and then stopped again.   After maybe a minute the craft started moving to what I believe would be its port side, assuming that the craft was facing towards our position, and moved just a little and then it seemed to jump forwards in the same direction it was heading and then stopped for a second and then took off.  It looked like something you would see in a sci-fi movie where it went into warp speed or something.   We watched for a few more minutes and did not see anything else in the sky other than the starts that were there.",
      "link": "http://www.nuforc.org/webreports/103/S103273.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f87",
      "summary": "((HOAX??))  Yellow light in sky, followed by creatures in my bedroom.",
      "city": "plano",
      "shape": "light",
      "date": "2014-06-13T00:00:00",
      "story": "Yellow light in sky, followed by creatures in my bedroom. Saw a yellow light in sky coming from the North around 12:30 am from my kitchen window.  Went to sleep and awoke around 1AM.  Saw a ball of light in the bedroom change into several hooded creatures who had grey skin.   I saw no more and blacked out.   The next morning I had unexplained scratches and bruises on my arms and back, along with a nosebleed. ((NUFORC Note:  We cannot certify that this report is a serious one.  We have attempted, on three occasions, to reach the witness via telephone, and we have been unsuccessful in our attempt to speak with him.  Possible hoaxed report, we wonder.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110096.html",
      "state": "TX",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c27ac",
      "summary": "4 bright white objects came together, remained stationary in a row for a time, moved away in different directions at different times.",
      "city": "plano",
      "shape": "light",
      "date": "2014-09-18T00:00:00",
      "story": "4 bright white objects came together, remained stationary in a row for a time, moved away in different directions at different times. A group of us were sitting at a table in the backyard on Mothers Day.  I was resting my head by leaning back in my chair.  I noticed 2 stationary white objects.  As I was watching, I observed another white object moving towards the other two, then a fourth.  I pointed out the objects to the other guests.  1 other saw all 4 objects and 2 others saw only 2 objects.  The 4 objects remained stationary, roughly in a line, for a period of time.  Then one object moved off to the south, then another moved off to the north.  The other two waited a period of time, then also moved off to the north and south.   I am a private pilot, an architect, and a business owner.  My wife, one of the observers, has a master's in psychology, and worked in corporate America for 18 years.  Another of the guests is a retired marine, working in some form of elite forces, now working in telecommunications.   The fourth observer is a stay at home dad.  I know how airplanes, choppers and other craft move! through the air.  These objects were at a high altitude, they were bright white easily seen in the daytime sky.  They did not move like an airplane.",
      "link": "http://www.nuforc.org/webreports/113/S113619.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b7b",
      "summary": "Orange flare that rose in the southwest sky and continued on overhead to the northeast until no longer visible.",
      "city": "plano",
      "shape": "fireball",
      "date": "2014-10-03T00:00:00",
      "story": "Orange flare that rose in the southwest sky and continued on overhead to the northeast until no longer visible. The object rose in the southwest sky and continued on overhead to the northeast until no longer visible behind the treeline. It wiggled side-to-side a little in its flight path but flew mostly straight. It was bright orange and crossed the sky quickly, in a matter of seconds. It looked like a firework at first, but didn't burst--it just kept going. ((NUFORC Note:  Date is flawed.  We have changed it, to reflect a sighting in September 2014, not October 2014.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114046.html",
      "state": "IL",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c69",
      "summary": "I was driving on the freeway and saw a bright blue light flying fast in the sky.. I pulled my phone out and started to record.. It was",
      "city": "plano",
      "shape": "triangle",
      "date": "2014-10-03T00:00:00",
      "story": "I was driving on the freeway and saw a bright blue light flying fast in the sky.. I pulled my phone out and started to record..  It was really low then it took a nose dive straight up.. and kind of slow down then turned bright white light and when it turned white it was like a triangle shape. ((NUFORC Note:  We suspect an evening sighting, and have changed the time.  Witness elects to remain totally anonymous, and provides no contact information, so we are unable to confirm the time.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114114.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c32c1",
      "summary": "Dim grouping of lights that changed shape as it moved over our house.",
      "city": "plano",
      "shape": "changing",
      "date": "2015-03-13T00:00:00",
      "story": "Dim grouping of lights that changed shape as it moved over our house. We went outside to see the mini moon and looked up and saw a grouping of very dim lights moving through the sky.  The arrangement of the lights shifted and had a very organic feel to it.",
      "link": "http://www.nuforc.org/webreports/117/S117620.html",
      "state": "TX",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c555c",
      "summary": "Crossed out white star that turned into a silver sphere with flat bottom.",
      "city": "plano",
      "shape": "sphere",
      "date": "2016-07-08T00:00:00",
      "story": "crossed out white star that turned into a silver sphere with flat bottom. REPORT DATE:  06-27-16 EVENT   DATE AND TIME:  APX FIRST WEEK IN MAY OF 2016 SOMEWHERE  BETWEEN 1 P.M. – 4 P.M. EVENT LOCATION:  PLANO, TX   I was watching the roof crew put on a new roof on a 2 story house.  It was an absolute clear bright blue day.  From the field of view, approximately 2 – 3” above the house view in the clear blue sky was a bright white star, so bright it was shaped like a cross.  Then it went up, turned into a silver ball with a flat bottom, then vanished.",
      "link": "http://www.nuforc.org/webreports/128/S128092.html",
      "state": "TX",
      "duration": "<30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f53",
      "summary": "Royal blue blinking lights in formation across North Dallas sky.",
      "city": "plano",
      "shape": "light",
      "date": "2016-10-11T00:00:00",
      "story": "Royal blue blinking lights in formation across North Dallas sky. At the park in the dark with my son we see a lot of aircraft.  Our neighborhood is in the flight path of passenger jets flying into Love Field in Dallas, TX.  We have a hospital a 1/4 mile from our neighborhood to the NW and helicopters fly in and land frequently.  But all of a sudden we see 4 royal blue blinking lights in formation.  Three were in an isosolese triangle shape and a fourth was off to the side.  They appeared to be higher than one of the incoming jets initially, about twice as high.  They were blinking in a perfect pattern one after another - all four lights about .5 seconds apart.  They flew slowly North over our neighborhood at the same height it appeared until it was so far north that they almost disappeared entirely.  After about 15 minutes they came closer and brighter again but were much higher up in they sky and were directly above us to the West.  The forth light was trailing further behind and took off towards the West without the three lights in triangle formation.  The remaining three continued to climb straight up until they became smaller and smaller until they disappeared altogether almost directly above where we were standing.  The night was completely still - no breeze or wind at all.  The lights made absolutely no sound.",
      "link": "http://www.nuforc.org/webreports/130/S130377.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6595",
      "summary": "I was out walking at night over at the park.  I rounded a corner and started walking down a hill when I noticed two bright orange color",
      "city": "plano",
      "shape": "circle",
      "date": "2016-08-02T00:00:00",
      "story": "I was out walking at night over at the park.  I rounded a corner and started walking down a hill, when I noticed two bright orange colored stars? in the southwest corner of the sky.   As I watched these two orange colored stars, the top circular shaped object started to vanish.  This higher craft did move slightly before it gradually vanished.   At first I thought these might have been planes, but I've never seen a plane, or light from a plane, simply vanish before my very eyes.   I didn't see the lower circular orange craft vanish, though I assume that it did as well.   When I got down the hill to the lower trail, I turned around and it was gone as well.",
      "link": "http://www.nuforc.org/webreports/128/S128744.html",
      "state": "TX",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c71ca",
      "summary": "Motionless small bright white dot in noontime sky northwest of Plano, Texas (DFW) sky vanished in an instant.",
      "city": "plano",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "Motionless small bright white dot in noontime sky northwest of Plano, Texas (DFW) sky vanished in an instant. This was a sighting that I experienced back in 1991, and although 26 years have passed, I thought I would document my experience here for the record.   On or about May 31, 1991, I was sitting in a recliner in my back yard by the pool.  The time was approximately 11:00 a.m.   Out of the corner of my eye I saw a bright small white dot in the northwest area of the sky.  I stared at this object for several minutes and it seemed to be at a very high altitude and just stood there motionless.   After staring at the object, I noticed a strange feeling as though they were surveying the entire Dallas/Fort Worth metroplex.  I also had a strange feeling as though they knew I was watching them.  It is hard to describe, but it seems there was some kind of telepathic presence.  It made me feel slightly uneasy.   After watching the object for approximately another five minutes, this bright small dot of an object just \"popped\" out of view.  One second it was there, the next, it was gone.  I happened in an instant.   Although the motionless standing there was unusual, the real unusual thing was the feeling that I experienced of our entire metroplex being under surveillance and my feeling that whatever it was knew I (and whomever else witnessed it) was watching. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134228.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fbf",
      "summary": "Daytime flying saucer that was in between its cloaking phase",
      "city": "plano",
      "shape": "disk",
      "date": "2018-04-13T00:00:00",
      "story": "Daytime flying saucer that was in between its cloaking phase On March 17, 2010, at approximately 11:32AM, I was going out to get lunch for my wife and son. I walked out to my car which was parked in our driveway.  As I started backing up I looked out of my driver’s side window after only backing up a few feet or so.  I saw a very strange object.  It was moving left, and then right, then left, and then right just going back and forth.  I started trying to think of what it might be while watching it for about 5 seconds.  I then realized that this was no ordinary object.  I got out of my car for a better look.  My neighborhood was fairly new so the trees were still not tall and didn’t affect my viewing.  A few seconds after I got out of my car the UFO started to move my direction.  It moved very slowly without any sound at all.  It was very low.  I literally could’ve thrown a rock at it and almost hit it when it passed over me it was that low. Description of UFO:  It’s very hard to describe.  It was shaped like a typical flying saucer, but the dome part of it was larger than the typical flying saucer photos you see on the internet.  It was also not silver or shiny in any way.  It looked tan or light brown and had little red dots on it.  As it flew slowly towards me I noticed that the top half of the craft was disappearing. By the time it had almost reached me most of the UFO had vanished and I could only see the very bottom part of the UFO.  As it passed over me, I saw the bottom of the UFO and I was just a dark black circle.  Did not see any kind of detail other than that and after a few more seconds the UFO had completely vanished. Summary: In my opinion the UFO may have had problems cloaking or have been in a transition phase of doing so. When it was flying towards me and the top half vanished I could only see blue sky behind it. That really freaked me out because I now know that a UFO can cloak itself and be completely invisible. So the shape of the UFO was definitely a flying saucer it just had kind of an odd shape to it, kind of bulky, not like a slick styled UFO. The red dots were not random but in rows on the craft going up and down. I should also mention around 05:30PM that same evening there was a black helicopter flying around my neighborhood and did circle around my house a few times. That was the only time I’d ever seen a helicopter around my neighborhood flying that low and I’d lived there for around 7 years at the time. Ever since this event, (it changed my life) I’ve been searching the internet and researching UFO’s to find a similar sighting or to see if anyone else had seen the same thing I did. I still haven’t found anything. I feel I may be one of the few people to ever see a flying saucer during its cloaking phase. I don’t know why it’s taken me so long to report this on your site. I did originally post it to MUFON a few days afterwards but they never contacted me.",
      "link": "http://www.nuforc.org/webreports/139/S139369.html",
      "state": "IL",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8960",
      "summary": "There was 1 circular object in the sky. It was moving around going higher than lower. This was at night. I am near Love Field airport.",
      "city": "plano",
      "shape": "circle",
      "date": "2019-09-19T00:00:00",
      "story": "There was 1 circular object in the sky.  It was moving around going higher than lower.  This was at night.  I am near Love Field airport.  Planes are around frequently.  This stayed around too long to be a plane.",
      "link": "http://www.nuforc.org/webreports/147/S147603.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c947d",
      "summary": "It was white long cylinder and moved away horizontally.",
      "city": "plano",
      "shape": "cylinder",
      "date": "2019-12-19T00:00:00",
      "story": "It was white long cylinder and moved away horizontally. This object was shaped like a long cylinder can. It was white and stayed in place for the 2 minutes that I observed it. I took a few pics and zoomed in to get a better look but it moved away horizontally growing East.",
      "link": "http://www.nuforc.org/webreports/151/S151544.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c96e3",
      "summary": "Me and my wife were driving home from the grocery store where I work when my wife ask me what the hell is that, I slowed the car down t",
      "city": "plano",
      "shape": "cigar",
      "date": "2019-12-19T00:00:00",
      "story": "Me and my wife were driving home from the grocery store where I work when my wife ask me what the hell is that,  I slowed the car down to look and at first I thought i saw a jet flying sideways but at second glance it was shaped like a cigar with two white lights and a blinking red light,  it was flying low but at jet speed.  There was no sound when it went over us disappearing in the horizon within 15-20 seconds.",
      "link": "http://www.nuforc.org/webreports/151/S151566.html",
      "state": "TX",
      "duration": "10 seconds"
    }
  ]
}