{
  "city": "providence",
  "fetch_timestamp": "2025-07-12T14:36:46.429610",
  "record_count": 41,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b6c64",
      "summary": "Elongated yellowish bar of light which pulsated as it travelled",
      "city": "providence",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "Elongated yellowish bar of light which pulsated as it travelled In slightly overcast sky, sitting in my car waiting for my wife to come out of the grocery store -- observed slowly pulsating yellowish elongated light -- like a thin grain of rice at arms length.   I thought it was an airplane at first as it was traveling along the flight paths of other airplanes which I was observing out of boredom (roughly south to north) as if traveling along with them towards Boston (but it was at that time alone in the sky).  However the dim nature of the light-bar, and that it brightened and darkened slowly, without going on or off like typical airplane made me curious.  It reminded me of the behavior of a satellite, but the overcast sky would make that impossible. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59706.html",
      "state": "RI",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f7f",
      "summary": "Object shaped like a backslash (\\) zoomed across downtown Providence sky.",
      "city": "providence",
      "shape": "other",
      "date": "2008-03-04T00:00:00",
      "story": "Object shaped like a backslash (\\) zoomed across downtown Providence sky. I was driving down North Main Street in Providence towards downtown.  It was sunset so  the airplanes over the city had their lights on which attracted my attention to the sky.  All of the sudden I saw a silver diagonal line much like a backslash (\\) zoom across the sky right over the city towards college hill.  It was moving faster than anything I had ever seen and as soon as I realized what was going on, it disappeared.",
      "link": "http://www.nuforc.org/webreports/061/S61894.html",
      "state": "RI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c30",
      "summary": "eggs shape bottom glowing craft",
      "city": "providence",
      "shape": "egg",
      "date": "2006-10-30T00:00:00",
      "story": "eggs shape bottom glowing craft watching a storm i saw multipul planes fly in the erea do to the airport not far from my home. i notice no blinking lights on the craft. my camera was on the table that i shoot music videos with a semi cheap DVC cam.",
      "link": "http://www.nuforc.org/webreports/053/S53008.html",
      "state": "RI",
      "duration": "less then a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b80d2",
      "summary": "large, double beamed spotlight high in the sky",
      "city": "providence",
      "shape": "",
      "date": "2009-12-12T00:00:00",
      "story": "large, double beamed spotlight high in the sky Date of sighting: 9/19/09 Approximate time: 8:00 pm Place: Providence, RI (East Side) Direction: in the sky over the highway (I95) While walking to my car with a friend I saw a large, bright light in the sky.  It was clearly a light, not a star, and looked to be the size of a large spotlight with one primary beam coming down.  However, it was partially obscured behind a house, so I did not at first see that, while there was only one “light”, there were in fact two beams coming down.  Also, this light was extremely high in the sky; this was clear by the fact that the length of the light beams, despite coming from an intensely bright light, ended far, far above the ground, what looked like miles from our perspective.  Nothing on the ground was therefore illuminated.   As soon as I rounded the bend and saw these beams, they immediately began to disappear in a strange manner.  Rather than getting smaller and smaller as they ascended, the brightness diminished in a nanosecond; what was left was the “after light”.  It appeared that the light had perhaps disappeared behind a cloud; however, the night seemed to ! be cloudless, based on the fact that stars were visible (although, due to the density of ground light, there were not many of them).  The “after light” lasted several seconds as it got dimmer and dimmer; it was clear that the “lights” had not been turned off, rather, that whatever they were attached to was ascending rapidly in the sky.  The entire incident last approximately 20 seconds.  It was witnessed by myself and my friend, who saw essentially the same thing (though she did not have as good a view as I did, being more blocked by the house that had at first obscured my full view).",
      "link": "http://www.nuforc.org/webreports/072/S72510.html",
      "state": "CT",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8416",
      "summary": "I ran across information that seems to explain the beams.  ((NUFORC Note:  Missile launch.  PD))",
      "city": "providence",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "how to retract a report?  (I just made it with the same information above).   After doing more research (I had already spent a couple of hours doing that before making this report) I ran across information that seems to explain the beams: a NASA launch at around the same time, with sightings up and down the east coast. ((NUFORC Note:  Missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72511.html",
      "state": "RI",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8884",
      "summary": "saucer with red and blue lights over providence, RI",
      "city": "providence",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "saucer with red and blue lights over providence, RI I saw a saucer shape moving slowly through the sky. At first I thought it was an airplane but than I compared it to another plane off in the distance and they just weren’t the same. This ship was moving smoothly and the lights on it were different. It had two red lights on the outside and blue lights coming from the inside. It looked like a shadow of a disk against the dark sky. I’ve never seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/072/S72691.html",
      "state": "RI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b89d9",
      "summary": "Rhode Island, Providence, Nantucket, 19th January - formation flying craft of ther sky",
      "city": "providence",
      "shape": "formation",
      "date": "2009-03-19T00:00:00",
      "story": "Rhode Island, Providence, Nantucket, 19th January - formation flying craft of ther sky We were driving home from a meeting of our local sports club when 4 bright lights passed in front of us, above us, following the path of the highway.  At first we thought they were aircraft but then we realised there was no noise and they seemed to be dancing around each other.  Then one of them suddenly changed direction instantly and flew off behind the tree line.  The others stopped, wiggled a bit in the air and then disappeared as if covered by cloud.  Birds looked quite confused.",
      "link": "http://www.nuforc.org/webreports/068/S68150.html",
      "state": "RI",
      "duration": "6 minutes 20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b99b3",
      "summary": "3 illuminated oval objects spotted flying closely together.",
      "city": "providence",
      "shape": "oval",
      "date": "2008-10-31T00:00:00",
      "story": "3 illuminated oval objects spotted flying closely together. My boyfriend and I were at the Fleet Skating Center in Providence, RI, observing a chalk drawing art exhibit that was held earlier on. It was a perfectly clear nite, the stars were out and there were only a few clouds, if any. I happened to look up, and directly in my path of vision I saw 3 oval lights flying closely together. I alerted my boyfriend, who also observed the objects. I proceeded to point and shout, but others around us did not bother to look. The objects were visible for approximately a minute, and then disappeared into the nite.",
      "link": "http://www.nuforc.org/webreports/066/S66065.html",
      "state": "RI",
      "duration": "Approximately 1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b99e4",
      "summary": "Mostly sunny sky very large stayed about 5 minutes",
      "city": "providence",
      "shape": "circle",
      "date": "2009-04-14T00:00:00",
      "story": "Mostly sunny sky very large stayed about 5 minutes It was a very large UFO right over downtown Providence. The strange thing nobody else saw it but me and another person I Worked with in Parking lot. The front of it looked like an observation deck. We tried to get other people to look at it but nobody would.  There was nothing on the new's about it nobody else saw it!  When it left it went straight up till it looked like a dot then nothing.",
      "link": "http://www.nuforc.org/webreports/069/S69422.html",
      "state": "RI",
      "duration": "4 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6d7",
      "summary": "UFO seen floating over providence, RI",
      "city": "providence",
      "shape": "teardrop",
      "date": "2009-06-09T00:00:00",
      "story": "UFO seen floating over providence, RI I was looking up into the sky and i noticed this really bright object. I knew it wasn't a star because there wasn't any stars out and it was too cloudy.  I let my other two friends know what i was seeing. one of them even suggested that it was an object flying by the earths surface. but it wasn't moving.  it was shaped like a teardrop. after looking at it for 6 minutes it made a huge flash and flew out too quick to even see it. the flash was like a greenish color.",
      "link": "http://www.nuforc.org/webreports/070/S70406.html",
      "state": "RI",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8ae",
      "summary": "lights over providence",
      "city": "providence",
      "shape": "diamond",
      "date": "2010-08-24T00:00:00",
      "story": "lights over providence while at the fire water display my friends and i observed 5 lights in the sky 4 in a shape of a diamond with one larger(brighter)light out in front of diamond.  although a clear night  (stars clearly visible)the lights appeared still and hazy or behind clouds but visible. hundreds of people around us were all looking up and pointing to the sky as well  baffled.  what was even stranger was the search lights that were used for a promotion going on in the city would actually hit and reflect brightly off of the object in the sky when it made its rotation .this object was very high in the sky yet was a huge object. my friends and i are still convinced this was no blimp,weather balloon airplane satellite or anything else we have ever seen. after approx 15minutes the lights seemed to dim and fade away  i am stunned if no one else reported seeing this A stranger expressed his daughter claimed to see a ufo as well that night aprox 30 miles from where we were",
      "link": "http://www.nuforc.org/webreports/077/S77287.html",
      "state": "RI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba990",
      "summary": "Star slides to left in sky, then Disappears",
      "city": "providence",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Star slides to left in sky, then Disappears I know this may be a bit late to report, but I just found this site. I apologies for my bad timing. On Friday, May 14th 2010, around 4:30 am., I saw something quite curious. I am a cab driver and I tend to sit at the same spot early in the morning.  For some time I had been watching what I thought was Venus, rising in the east.  I was informed later that it was probably Jupiter. Anyhow, being the star gazer I am, I have watched this same star, planet, for quite awhile. What made this morning different was the fact that while I was watching it definitely slid approximately 4 inches in my view to the left and then just vanished. It was a clear morning, no clouds.  I waited for it to reappear but it never did in that spot.  10 minutes later or so though, if it is the same star, it did reappear way to the right and a lot higher in the sky. It happened way to fast to capture on video.  Not to mention I just wasn't expecting it. A few weeks later I attempted to make a video of what I saw.  Have link if needed.",
      "link": "http://www.nuforc.org/webreports/078/S78259.html",
      "state": "RI",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0c3",
      "summary": "Fleeting triangular object following a meteor path",
      "city": "providence",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Fleeting triangular object following a meteor path My wife and I were walking our dog in the late evening.  We had just sat down on a park bench behind a building when I saw a falling star (meteor) fall quite brightly, appearing between the building and a tree line to our  left.  I asked my wife if she saw the meteor but she was looking in another direction.  Five seconds after that I saw what appeared to be three diffused light-colored spots (very close together) flying in the exact course the meteor had taken.  This only lasted a second, again my wife did not see this new thing.  While it might have been a bird (or birds) I am curious about the shape and manner in which it flew, but mostly the direction -- right behind the ‘falling star’.  It seemed to have been at a greater distance than if it had been a bird, possibly a large object of some kind.  This happened near the Providence/Pawtucket line: Rhode Island. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83910.html",
      "state": "RI",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bc381",
      "summary": "The object was extremely close to my car when driving and traveled at a high rate of speed when it was not idle.",
      "city": "providence",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "the object was extremely close to my car when driving and traveled at a high rate of speed when it was not idle. i was driving on the highway and saw this object floating. it was a bright light that seemed to just stay there for about a half hour. i became fixed on it because i knew it was not a plane because it did not move, and not a helicopter because it did not move at all. it just hovered there. all the sudden it was right above my car i looked from the bottom at it and it looked like the shape of a plane. then my girlfriend in the passenger seat looked up when i was trying to drive and it was a disc shape she said. about 3 minutes later it was miles away where i could not see its shape anymore. then it came close again and started to turn on its side and fly away i said \"come back\" because i wanted to look at it and it flew at my car at an incredibly high speed and then vanished. i did not see this but my girlfriend was hysterical and scared because it came in our direction i have pictures and would like to",
      "link": "http://www.nuforc.org/webreports/085/S85521.html",
      "state": "RI",
      "duration": "1-2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd017",
      "summary": "A bright light in the sky croosing the sky of Providence pulling with it small and big clouds with out sound.",
      "city": "providence",
      "shape": "unknown",
      "date": "2012-08-05T00:00:00",
      "story": "A bright light in the sky croosing the sky of Providence pulling with it small and big clouds with out sound Was the 4 of july.  My wife and kids we when a cross the street  to my friends party.  Around 11:30 at night the party was over so we seat at front of the house.  I was eating and i drop my food on the stairs so i grab a brum and i start swiping the stairs and i heard my son saying daddy watch out. When i look to the sky i saw this ball of light color red in the middle and in the outside waw like orange with yellow with a tail and in the tail  i saw like this thing was pulling the clouds from small ones to big ones very fast.  I keep looking and when in a straight line heading to south side providence.  This thing was scare it for me and my family my son was crying all night telling me that we gonna die that this was the end of the world.  I can said this light was like a 200 feets from the ground so close that when he tell me watch out i almost laid on the ground thinking that light gonna hit me.  The light disappear in the horaizon.  Its was more like the lights have a vacum at the end pulling the clouds.   Sorry if i spell some words bad my first language is spanish.  Thank you",
      "link": "http://www.nuforc.org/webreports/091/S91066.html",
      "state": "RI",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3beca1",
      "summary": "UFO Stuck within a Storm Cloud",
      "city": "providence",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "UFO Stuck within a Storm Cloud I'm not sure if what I saw was an actual UFO, but I was able to snap a picture of it with my Iphone.   The object was inside a storm cloud but if you look at the picture there are white dots around it (it wasn't raining).  The color appears to blend in with the color of the storm cloud which is grey   Please see the photo I am submitting if you follow the beam of light up to the cloud you will see to the right of it the object I am referring.   I'd love to know if what I saw is in fact a UFO.",
      "link": "http://www.nuforc.org/webreports/100/S100422.html",
      "state": "RI",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bee97",
      "summary": "Orangish glowing object soared at low altitude , followed by white shooting star streaking across sky for 3 seconds",
      "city": "providence",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "orangish glowing object soared at low altitude , followed by white shooting star streaking across sky for 3 seconds While out on the porch of my work off friendship st. in providence with another woman, a goldish orangish glowing object that resembled a bird with wings flying and soaring in the sky at a low altitude, it turned a couple blocks down and out of sight.  I tried to find it by walking to other side of house, but could not see it.  As i got back onto porch and was looking up higher into the sky, a white shooting star type of light streaked at a low altitude and then just completely vanished.  There were no clouds in that area at that time.  There was no noises emitted by either object.",
      "link": "http://www.nuforc.org/webreports/096/S96606.html",
      "state": "RI",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf98c",
      "summary": "Around 6 am I saw something in the sky  that looked like a silver teardrop.",
      "city": "providence",
      "shape": "teardrop",
      "date": "2012-12-20T00:00:00",
      "story": "Around 6 am I saw something in the sky  that looked like a silver teardrop. While walking to the bus stop around around 6 am i happen to look up at the sky when i saw something that looked like a silver teardrop, very far up in the sky going down, it caught my attention because it didnt look like a plane flying forward, this was actually flying down, as if it was being dropped.  As it was going down it changed color from silver to black.  It became a dot and after about 2 mins it disappeared.  I ended up missing the bus, i didn't want to take my eyes off of it.  Very weird experience. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94653.html",
      "state": "RI",
      "duration": "4-9 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0499",
      "summary": "Bright light cigar shape hovering and disappearing.",
      "city": "providence",
      "shape": "cigar",
      "date": "2013-02-18T00:00:00",
      "story": "Bright light cigar shape hovering and disappearing I was driving down manton ave and I see this huge bright cigar shape hovering in the same place i parked on the side of the steeet and observed it the lights were not flickering.   During the 3 minute event it started to flicker and it disappeared.  The cigar shape Object is probably the same size of a football field or even bigger",
      "link": "http://www.nuforc.org/webreports/096/S96203.html",
      "state": "RI",
      "duration": "3:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c095a",
      "summary": "White bright streak like teardrop shape in clear blue sky.",
      "city": "providence",
      "shape": "teardrop",
      "date": "2014-01-10T00:00:00",
      "story": "White bright streak like teardrop shape in clear blue sky It was a bright white streak teardrop shape in the clear blue sky.  It looked as if it was not moving and it seemed far away because of that.  We viewed it for at least 15 minutes until we could not see it anymore.  It was bold not like a cloud or contrail.  The direction was west. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105576.html",
      "state": "RI",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e0d",
      "summary": "Large, red and spherical object \"hiding\" behind the moon at night.",
      "city": "providence",
      "shape": "sphere",
      "date": "2014-03-21T00:00:00",
      "story": "Large, red and spherical object \"hiding\" behind the moon at night. When traveling across Providence I noticed a large, spherical and red object behind the moon.  I looked at many times in different locations and it was still there.  Seems to be a quarter to a half of the size of the moon.   Had other people look at it and noticed the object.  It wasn't far out, the outside of the object was seen.  The red object seemed to be \"hiding\", and isn't obvious in plain sight.  The time I observed this was around 30 minutes.  The object seemed to be imobile at the time of viewing.   There might of been a small haze at the outline.   I searched sites about astronomy and astronomical calendars but found nothing like this.",
      "link": "http://www.nuforc.org/webreports/107/S107940.html",
      "state": "RI",
      "duration": "Unknown, seemed to stay"
    },
    {
      "_id": "64d005f478aba2ec5a3c163b",
      "summary": "Was coming home from a friends house and before my exit i saw an unidentified flying object. it started out right out front my windshie",
      "city": "providence",
      "shape": "rectangle",
      "date": "2013-11-11T00:00:00",
      "story": "Was coming home from a friend's house and before my exit I saw an unidentified flying object.  It started out right out front my windshield and slowly moved south and i saw it then again through the passenger side window.  There were lights what looked the a cubical or rectangular craft.  It was too large to have been a plane. ((NUFORC Note:  We suspect that the sighting occurred on November 10, and not October 10th.  We have amended the date above.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104342.html",
      "state": "RI",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e01",
      "summary": "Objects flying over Providence, RI.",
      "city": "providence",
      "shape": "triangle",
      "date": "2014-06-13T00:00:00",
      "story": "Objects flying over Providence RI My finace and I went out to smoke a last cigarette for the night on our front porch.  While finishing up I looked up and saw a huge white glowing semi transparent rounded triangle fly at above tree level.  The object was below planes' levels as there were two up high in the sky at the time I noticed.   I jumped up and tried to convince my fiance to look up.  He refused and told me that I looked nuts!   I saw another smaller looking traingle follow after the object and was proceded by two orange/red smaller objects.  At this time my fiance saw the last one and made me go inside.  The first one was incredibly fast and the others were slower.   This is the first time i have ever saw or reported anything like this.  I reported this only because I googled this and found out that everyone else saw it too!   All I can say is, \"What the hell is going on?\"",
      "link": "http://www.nuforc.org/webreports/110/S110036.html",
      "state": "RI",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e00",
      "summary": "Circular lights moving quickly and low in sky.",
      "city": "providence",
      "shape": "circle",
      "date": "2014-06-13T00:00:00",
      "story": "Circular lights moving quickly and low in sky. Facing the southern sky in a 10 minute window 4 different appearences of circular lit objects, appearing to be low, moved quickly in sporadic movements across horizon.   1 appearance was white other three orange in color. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110033.html",
      "state": "RI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c295a",
      "summary": "While walking in Providence, husband and wife and others view 3 orange orbs in the night sky",
      "city": "providence",
      "shape": "fireball",
      "date": "2014-10-03T00:00:00",
      "story": "While walking in Providence, husband and wife and others view 3 orange orbs in the night sky My wife and I were walking along the Providence river on South Water Street on the 27th after attending Waterfire in the city.  We were approximately 100-150 yards away from the bridge where the Waterfire festival ends, near the pavilion next to the river that marks the place where the Gaspee was burned by RI colonists in the early 1770s.  I looked up and noticed a large commercial airliner flying overhead, perhaps approaching TF Green airport in Warwick which was flying fairly low, but that quickly disappeared over the bay and we continued on our walk.  As we were walking north towards the bridge, a group of three younger guys were walking towards us and one said “What is that?  UFOs?”  The other guys laughed, but we turned our heads and saw 3 bright orange lights in the sky in a triangular pattern…approx 100-150m high (but could be higher…hard to tell).  They made no noise and as we watched another guy (older who was walking his dog) came along behind us and saw we were looking at something and looked up and said something like “What the heck is that?”  We said we had no idea.  Slowly, the color faded from bright orange, almost flamelike to white and the first two dots continued down the river towards the harbor/Narraganset Bay while one stayed suspended for a minute or to (I took a quick video with my iPhone of that one) and then it slowly faded away.  I wanted to blame the appearance on Waterfire, thinking that perhaps they were large embers suspended in the sky but there was no major breeze that would blow these downriver 100-150 yards and they all turned white at the same time.  Finally the one light in the sky faded out and we turned and walked away. This was the 3rd UFO I’ve seen in my life BTW….but was very strange as it was seen in such a cosmopolitan area, by so many people (the young college aged guys, the dog walker and us), but we were literally only 300-450 feet away from hundreds, perhaps thousands of people.",
      "link": "http://www.nuforc.org/webreports/114/S114127.html",
      "state": "RI",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3be7",
      "summary": "8 disc shaped crafts w/4 or 5 orange lights...they made no noise whatsoever and they should have if they were produced on this planet.",
      "city": "providence",
      "shape": "formation",
      "date": "2015-07-06T00:00:00",
      "story": "8 disc shaped crafts w/4 or 5 orange lights...they made no noise whatsoever and they should have if they were produced on this planet. I happen to look out my front door at all the colored fireworks in the air and noticed at first 5 round shaped disc shaped crafts w/4 or 5 orange lights at the bottom of same.  They made no noise at all and they weren't that far, whereas I wouldn't hear the noise of a normal type craft.   The formation was not totally straight.  Five of them stopped for approx. 30 seconds and seemed to be observing the fireworks, then they continued to proceed south, they came from the north.  They were not going at a high rate of speed either.  They were at approx. 1 mile apart from each other.   Then as they seemed to disappear into the clouds another one showed up and then two more.  All crafts seemed to disappear into the cloudly sky.   I waited to see if they would reappear for quite a while, but they did not.  They weren't very far in the sky, no where near what a plane would be, yet not one noise was heard even when the fireworks stopped you still couldn't hear a thing.  They also seemed to have a top to the disc shape...it was rounded.  I'm unsure if I was the only one who saw these crafts but I think folks were more interested in the various colors in the sky which the crafts also seemed intereted in too.",
      "link": "http://www.nuforc.org/webreports/120/S120023.html",
      "state": "RI",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c69",
      "summary": "I seen a bright blue light that seemed to get dim then glow red then started moving at a slow pace then 2 other pulsating lights coming",
      "city": "providence",
      "shape": "light",
      "date": "2015-07-03T00:00:00",
      "story": "I seen a bright blue light that seemed to get dim then glow red then started moving at a slow pace then 2 other pulsating lights coming from opposite directions and was following the first light",
      "link": "http://www.nuforc.org/webreports/119/S119769.html",
      "state": "RI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f96",
      "summary": "I was outside talking to my father with my aunt and my little cousin I look to the right of me I thought it was firework coming in the",
      "city": "providence",
      "shape": "circle",
      "date": "2015-06-05T00:00:00",
      "story": "I was outside talking to my father with my aunt and my little cousin I look to the right of me I thought it was firework coming in the air from the tube it was a bright red light then it turned a orangeish color it just started floating vertical into the air and sat there for a second so I tapped my aunt and said what's that she looked and it  was sitting there so my father turned around and he spotted the light but the light just went out and was gone",
      "link": "http://www.nuforc.org/webreports/119/S119261.html",
      "state": "RI",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c404a",
      "summary": "Multiple reflective objects high in the sky.",
      "city": "providence",
      "shape": "unknown",
      "date": "2015-06-05T00:00:00",
      "story": "Multiple reflective objects high in the sky. Looked to be 15 to 20 objects reflecting light very high in the sky.  They reflected light like an airplane but there looked to be too many to be airplanes.   I took video that shows the flickers in the sky.   I do not know if anyone else saw this. ((NUFORC Note:  Witness provides only minimal contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119344.html",
      "state": "RI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42fe",
      "summary": "Saw a disc shaped ufo with a green glow with green and red flashing lights hovering slowly over the Providence River Bay area",
      "city": "providence",
      "shape": "disk",
      "date": "2015-09-11T00:00:00",
      "story": "Saw a disc shaped ufo with a green glow with green and red flashing lights hovering slowly over the Providence River Bay area..   Followed by a helicopter with its giant search light looking as though it was trying to locate object",
      "link": "http://www.nuforc.org/webreports/121/S121825.html",
      "state": "RI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61f7",
      "summary": "Extremely fast (hypersonic+) aircraft (UFO) captured on Live TV over Providence, RI....Please Help me ID this thing.",
      "city": "providence",
      "shape": "unknown",
      "date": "2016-09-30T00:00:00",
      "story": "Extremely Fast (Hypersonic+) aircraft (UFO) captured on Live TV over Providence, RI....Please Help me ID this thing. At exactly 11:22:16pm, while I was watching WPRI 12 channel news they cut to a live view facing the cameras East towards the Biltmore and Westin Hotels.  At this time some type of object coming from the North and heading South was flying past at a fairly low altitude but was going at what appears to me as an extremely fast (beyond Hypersonic speeds).  I needed to slow it down and watch it over again (which I did about 20+ times) at about 1/6 of the normal speed and pausing at different times.  I noticed at this 1/6 speed that it was on camera for less than 2-3 seconds total which indicated to me that its speed was unbelievably fast.  Upon watching it over and over again, at different speeds, different time frames etc, it appears to be as best I could make out some type of aircraft (of Unknown origin).  It honestly could have been some type of fighter jet at hypersonic speeds....but why so low? I tried to DVR this and my DVR said it was having \"difficulties at! this time.\" (&lt;--Im not saying there is some conspiracy I am only indicating to you why I couldn't record and save this event).  I would ask for help in getting a copy of this from WPRI channel 12 news of this live broadcast, re-analyzing it, and then possibly contacting TF Greene Airport officially to see if they have record of what, if any, aircraft was flying through there. Unfortunately, yet very awkwardly, is the fact that this airport is approximately 10-15 miles from providence and in the same direction of this probable aircraft, however I do know for a fact that given its speed it was NOT coming in for a landing and it was definitely NOT some plane taking off as I have seen 100's of planes do both of these and this aircraft was flying at extremely High rate of speed that I can't even explain in words.  It almost looks like a streak across the sky like a meteor, but it was not at all bright like one, it didn't \"fizzle out\" like a meteor and it was clo! se by....like right over the city it appears.  The trajectory (! i.e. ang le) of this \"UFO\" is completely inconsistent with a meteor also.  I hope you don't think this is a joke, or just some crazy red neck farmer who had been drinking too much…   I am a highly educated, liberal college professor and Registered Nurse from the Northeast who is 100% sober and yet dumbfounded as to what this could be/is.  Please help me if you can.  Thanks",
      "link": "http://www.nuforc.org/webreports/130/S130251.html",
      "state": "RI",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6515",
      "summary": "Red circular object moving quickly, then stops and hovers over Providence, RI, changes colors and then disappears.",
      "city": "providence",
      "shape": "circle",
      "date": "2016-08-19T00:00:00",
      "story": "Red circular object moving quickly, then stops and hovers over Providence, RI, changes colors and then disappears. Around 5:30 this morning, my husband was out in the back yard with our dog, when he began to shout for me to come outside quickly. I worried something was wrong, so I immediately ran outside, as he pointed to the sky.   About a mile away I saw a very prominent red circle or orb like craft.  There could have been a haze around it but unsure if it was my eyes or not.  The orb was definitive and red though.  I observed it and watched it  in the sky as it was hovering.   Then, it very quickly zinged to the right and stopped again.  It turned from red to white, then back to red.  What I couldn't believe was the way it flew to the side and stopped immediately, not a gradual stop or eased stop, but a full on stop, like it hit a barrier and how fast it was moving.   It hovered a minute, then zinged left stopped, and it appeared to gain some elevation as it slowly proceeded to fly to the right and out of view for a few seconds, when I caught a glimpse of it through the houses.   I then observed it zing up into the sky so fast, I couldn't believe it, and it was gone.   I am a well educated professional and I am telling you there is nothing I have ever seen or heard of that:  1.  Is as precise in stopping as that craft was, it defied physics;  2. Could move that fast, and still maintain such control; and 3.  Could maneuver so quietly, no visible propellers or exterior engines were visible and without any vapor trail or exhaust.   It was scary and intriguing at the same time.  I have no doubt what I saw was not from here.",
      "link": "http://www.nuforc.org/webreports/129/S129307.html",
      "state": "RI",
      "duration": "10 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6583",
      "summary": "Walked out with dog and observed a dark craft overhead.  No lights.  Thought it could be a drone, but too large.",
      "city": "providence",
      "shape": "other",
      "date": "2016-08-02T00:00:00",
      "story": "Olneyville, Providence, RI.  Walked out with dog and observed a dark craft overhead.  no lights.  thought it could be a drone but too large.  very strange shape, unlike any aircraft I have ever seen.   watched it travel in a straight line till view was blocked by houses.  maybe two minutes.",
      "link": "http://www.nuforc.org/webreports/128/S128724.html",
      "state": "RI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c65ef",
      "summary": "Red orb moving quickly, then stops multiple times over Providence, RI.",
      "city": "providence",
      "shape": "circle",
      "date": "2016-08-16T00:00:00",
      "story": "Red orb moving quickly, then stops multiple times over Providence, RI. At 5:30 AM this morning, I was in my garden with my dog, when I looked up to see a bright red orb moving at great speed. It came to a quick stop, hovered and stayed in the same spot.  It looked to be maybe a mile away but was very distinct in shape and no gas trail or anything surrounding it or following it when it moved. I was unsure what I was witnessing, so I shouted out to my wife to come outside. We then saw the orb move in a straight line to the left,it was moving not as fast as when it first came into view,it then moved quickly to the right,then changed from a bright red glow to a bright white glow then back to red. It then moved left again,and then right,it continued moving right, hovered and then continued as it went out of view. I know some very smart women, and my wife is right up with the best of them. She is a professional lady who has been in high position within her company for several years. When she told me that she had never seen anything move like that in her life, I knew I wasn't crazy!  I myself have never seen anything move as fast,and then stop so quickly in my life. It made no noise whatsoever,but the thing that amazed me is the immediate stopping and acceleration it did.  From a stand still, just hovering, to zipping across in one direction then stopping like it hit a wall, then zipping back in the other direction, multiple times, is impossible to believe. ((NUFORC Note:  We spoke via telephone with the witness, and he seemed to us to be quite eloquent and sober-minded.  We suspect he is an excellent witness.  We have requested that his wife submit a second report, as well.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129299.html",
      "state": "RI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c67d7",
      "summary": "White disk that moved, dimmed, and flashed green and red lights, until disappearing.",
      "city": "providence",
      "shape": "disk",
      "date": "2017-04-13T00:00:00",
      "story": "White disk that moved, dimmed, and flashed green and red lights, until disappearing. 1 White disk hovering.  Propelled in air smoothly then dimmed and started to blink red and green light.  Disappeared.  Seen on a night sky.",
      "link": "http://www.nuforc.org/webreports/133/S133490.html",
      "state": "RI",
      "duration": "3:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c5a",
      "summary": "About 2:40 am and looked up in the sky and rite above my house was 10/12 what looked like stars.  ((anonymous report))",
      "city": "providence",
      "shape": "light",
      "date": "2017-01-06T00:00:00",
      "story": "I went outside to smoke a cigarette about 2:40 am and looked up in the sky and rite above my house was 10/12 what looked like stars but where low in the sky at different altitudes flashing orbs of different brilliant colors they where moving silent and very slow west for about 10 min until I couldn't see them no more please help me figure out what they where. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131954.html",
      "state": "RI",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6cd4",
      "summary": "A very large, dim, milky-white, round object, resembling a full moon, situated next to and on the left side of the sun.",
      "city": "providence",
      "shape": "circle",
      "date": "2016-12-30T00:00:00",
      "story": "A very large, dim, milky-white, round object, resembling a full moon, situated next to and on the left side of the sun.",
      "link": "http://www.nuforc.org/webreports/131/S131869.html",
      "state": "RI",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c48",
      "summary": "On 10/18/17 At about 6 p.m. I observed 4 unidentified air crafts in the sky that were flying over, under, and around eachother and also",
      "city": "providence",
      "shape": "other",
      "date": "2017-10-19T00:00:00",
      "story": "On 10/18/17, at about 6 p.m., I observed 4 unidentified air crafts in the sky that were flying over, under, and around each other, and also flying at alternating speeds.  One craft flew straight up and stayed still in that position for about 3 minutes, before resuming to fly.   After a few minutes of crafts flying around, what appeared to be a military aircraft flew between the other 4 crafts.  My attention was taken away for about a minute, and when I looked back up they were all gone.",
      "link": "http://www.nuforc.org/webreports/136/S136853.html",
      "state": "RI",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c86a6",
      "summary": "gray dark gray in color slowing moving across sky rotated and turned I could see some type of shining.  ((anonymous report))",
      "city": "providence",
      "shape": "disk",
      "date": "2018-08-10T00:00:00",
      "story": "Gray dark gray in color slowing moving across sky rotated and turned I could see some type of shining or reflection when it did this as it moved then turned to the right in a rotation I could see lights on the outside of it they were bluish whitish purplish in color I've never seen anything like it in my life it just disappeared after that into the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142524.html",
      "state": "RI",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8770",
      "summary": "Many blinking stars throughout the sky.  After several minutes some of the stars would fade, then become brighter. ((anonymous report))",
      "city": "providence",
      "shape": "",
      "date": "2018-07-19T00:00:00",
      "story": "We saw many blinking stars throughout the sky.  After several minutes some of the stars would fade and then become brighter and start blinking again.   Some thought they saw shooting stars.  There was a plane with a red light that flew through the sky approximately 23:20.  It was amazing we had never seen such a phenomenon.",
      "link": "http://www.nuforc.org/webreports/142/S142234.html",
      "state": "UT",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8fc8",
      "summary": "Reddish blueish disk flying by my window slowly",
      "city": "providence",
      "shape": "disk",
      "date": "2018-11-30T00:00:00",
      "story": "Reddish blueish disk flying by my window slowly. I was laying down and outside my window I seen a disk with blues and red lights go by my window very slowly.",
      "link": "http://www.nuforc.org/webreports/143/S143918.html",
      "state": "RI",
      "duration": "3 minutes"
    }
  ]
}