{
  "city": "reno",
  "fetch_timestamp": "2025-07-12T14:36:06.314217",
  "record_count": 119,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b45d4",
      "summary": "Group of four points of light moving in a deliberate and manner unconventional for aircraft or satellites",
      "city": "reno",
      "shape": "formation",
      "date": "2006-05-15T00:00:00",
      "story": "Group of four points of light moving in a deliberate and manner unconventional for aircraft or satellites Sighting Friday 4/28/06 @ 9:35P Location Reno, NV (39.525 Lat, 119.777 Long) Witnessed by husband and wife  Facing South-West I noticed nearly directly overhead four bright points of light of equal intensity in shape of square parallelogram spaced possibly 0.25-0.5 degrees Initial brightness 1-2 orders of magnitude greater than any other star in that part of the night's sky Color similar as other stars and constant (other than fading intensity noted below) Absolutely no other physical features were discernible Absolutely no sound observed  Points of light then changed positions several times in a smooth manner relative to each other in a pattern similar to a shell game, then deliberately aligned into a line of four abreast, then finally into four in a row before fading from vision while moving North - North-West at what appeared to be a constant speed on the order of but slightly slower than that of an orbital satellite.  During the first part of the observation the group of lights passed through a portion of the sky that was brightly illuminated vertically by the exterior lights of a nearby large hotel and resulted in causing the lights to appear to shimmer (similar to atmospheric distortion) as they crossed the cone of light.  Objects observed for a duration of approximately 45 seconds (from 90 degrees to approximately 45 degrees above the horizon)  Group intensity faded uniformly as objects moved in a Northerly direction until no longer visible  Approximately 3-4 minutes later a solo object (similar point of light but intensity 2-3 orders of magnitude lower) followed same track as first group but at a somewhat higher speed.  Object disappeared within approximately 10-15 seconds  Observer (author) has Masters degree in Aeronautical and Astronautical Engineering with experience in orbital vehicles and orbital mechanics and is a sworn peace officer.",
      "link": "http://www.nuforc.org/webreports/050/S50391.html",
      "state": "NV",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e4e",
      "summary": "Tonight I witnessed a formation of 2 silent craft flying from 110 degrees east to 215 degrees southwest. These craft flew in a level di",
      "city": "reno",
      "shape": "formation",
      "date": "2019-05-09T00:00:00",
      "story": "Tonight, I witnessed a formation of 2 silent craft flying from 110 degrees east to 215 degrees southwest.  These craft flew in a level direct formation not changing in altitude.  My guess was approx 15K feet in elevation.  This event was from horizon to horizon.  Strangely these craft going east to southeast cut straight across the landing path of an approaching airliner heading into RNO . One lead craft and the following craft appeared to be following from the rear in the 8 oclock position.  As I mentioned they were silent. Both craft had only red slowly strobing lights.  They lights blinked in an alternating sequence.  The front craft first then the rear craft.  This pattern repeated constantly from the beginning to the end of the event.  The lights appreared to be on the tips of wings if it had wings.  Not on top just on the ends.  No green or white lights were seen. No sound of prop or jet propulsion.  The skies were dark and the weather is broken clouds..55 degrees and 41% humidity.",
      "link": "http://www.nuforc.org/webreports/145/S145925.html",
      "state": "NV",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fa8",
      "summary": "Possible anti gravity propulsion system.",
      "city": "reno",
      "shape": "unknown",
      "date": "2019-03-29T00:00:00",
      "story": "Possible anti gravity propulsion system. First Reporting date: 9/24/1998 Reported to: Art Bell on Coast to Coast Show by fax. I would like to take this opportunity to report a possible Unidentified Flying Object [UFO]and share some insight into the greenish and while lights that are being seen in the sky. Five years ago, in 1993, I had a very close encounter or you could refer to it as a standoff with an Unidentified Flying Object [UFO] in the Reno, Nevada, area.  Excuse my pun, but I may be able to shed some light on the subject of UFO’s.  I cannot tell you exactly what it was, but I can tell you that it was not a fixed wing or helicopter that was currently known to the general public and there for unidentified. My military background includes an active duty tour in the U.S Air Force as an Aircraft Maintenance Specialist on F-111’s and other tactical fighter aircraft and over 20 years as a Security Forces Specialist and Supervisor.  I have extensive experience in Search and Rescue Air Support with both fixed wing and military helicopters. In this particular incident, I was working as a Sheriff’s Deputy on swing shift and had worked overtime until around 0300 hrs. in the morning.  I changed into my street clothing and put my Glock 9mm in my pancake style holster on my pants belt and put another magazine into my rear pocket.  I got into my Chevy 4x4 pickup truck and headed Northbound on highway 395 and to my residence in the Cold Springs Valley area near the Nevada/California boarder. At about 0330 hours, I crested a hill on Hwy. 395 at started to drop down in elevation towards the Cold Springs Valley.  I observed a bright white circular light moving back and forth across the base of Pevine Mountain near the Southbound lanes of Highway 395, which is several miles from the old Crystal Peak Mine access road. The area is about 5400 feet in elevation and the white light looked to be about 150 feet, above ground level or AGL.  At first, I thought that it might have been a Nevada Army National Guard OH-58 helicopter with a search light mounted on it, although I did not remember one on any of the aircraft I had flew on during search and rescue.  I did not see any formation lights, not strobes or anti-collision lights. At the bottom of the hill, I took the exit and pulled up to the stop sign. I sat there for a couple of minutes.  I shut my engine and lights off to listen to the sound of the main roto blades and did not hear anything.  The intensity of the bright light did not change as the object moved in a circular pattern and a nose mounted searchlight or a side mounted searchlight would have varied in intensity as the nose of the helicopter turned. I watched the bright light for about 3-4 minutes, before restarting my truck and turning on to Cold Springs Drive to drive around the dry lake bed.  While driving around the lake bed, I thought that another vehicle was catching up to me, as I would see some light and then it was gone.  After driving around the lake bed, I turned onto Brant Street and drove about 2 and half miles to my residence. As I pulled into my driveway and got out of my truck, I noticed that the very bright light was traveling along Brant Street at about 150 feet above the roadway towards my position. I moved out into the middle of the culdesac where it was dark and just stood there to try to get a glimpse of what type aircraft it was.  The nearest street light was about half a block away, so I felt a little safe in the dark.  My first thought was, \"Great, the object followed me home.\" The object was moving about 15-20 miles per hour and maintaining about 150-200 feet AGL.  I attempted to observe the outline of the object, but the brightness of the white light prevented it, and the intensity was much brighter that a searchlight that can be mounted on helicopters.  The light seemed to form a round disk type area about 100 ft. in diameter and was the only outline to judge the size of the object.  The object stopped moving towards me and remained stationary in the air with no main rotor blade or tail rotor noise. I was able to observe that there was a greenish hue to the white light emitting from the bottom of the object and said in a loud voice, “Oh, so that light is actually a low attitude propulsion system”.  I was surprised when the object moved sideways about 15 feet, as if answering the question. I got the feeling that I was being observed by a FLIR system- Forward Looking Infrared Radar.  I decided to wait this situation out, as I did not want to identify my house with a sleeping family. I was having a standoff with an UFO and I was thinking to myself, I bet they never abducted a cop with a Glock before and reached down and padded my Glock on my hip. I was hoping that the object would cross over me or move past me slowly, so I could get a look at the underside of the object.  The object maintained a silent hover for about 15 minutes as I stood still.  After about another five minutes, I decided to press the issue and threw up my hands and said very loudly, ”Well, what are you going do, do something”. The white light underneath the object became a greenish/ white color, with what looked like greenish water droplets as big as silver dollars spitting out the bottom for about 10 to 15 feet.  Then the greenish, white light shot straight up into the sky and was gone in about three seconds. I hung around for about another five minutes expecting the object to return since we were so close, but the object did not return and I searched the sky and did not see anything except the stars. I had feeling at the time that the object that followed me home may have been a either a Black Project from the Southern Desert area, or just a UFO. I did not mention the incident to anyone at the time as it would not have been politically incorrect to do so and could have been detrimental to my law enforcement carrier.",
      "link": "http://www.nuforc.org/webreports/145/S145338.html",
      "state": "NV",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b506e",
      "summary": "string of lights evenly spaced moving across sky.  ((NUFORC Note:  Starlink satellites?  PD))",
      "city": "reno",
      "shape": "formation",
      "date": "2019-12-22T00:00:00",
      "story": "string of lights evenly spaced moving across sky Went outside in the dark to see friend off. Looked straight up and saw a light moving way high up, looked like maybe a satellite it was that high up.  Clear skies, dark.  I noticed light behind it about 12\" holding hands straight out.  Lights moving SE direction over Cold Springs.  I then noticed another light and panned my view to the NW to see a continous line of these lights evenly spaced all moving across the sky in a straight line.  I counted about 30 before it was over.  They appeared to be gaining altitude until I lost sight.",
      "link": "http://www.nuforc.org/webreports/151/S151868.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5269",
      "summary": "While looking out my living room, I saw a glowing red UFO come down and land on a few branchs, then flew off northwards at high speeds",
      "city": "reno",
      "shape": "sphere",
      "date": "2006-10-30T00:00:00",
      "story": "While looking out my living room, I saw a glowing red UFO come down and land on a few branchs, then flew off northwards at high speeds Whlie I was playing with my new binoculars, I looked away for a second, then looked again and saw a small red apple like object come down from the sky and land on a group of small branchs. Then I looked for a few seconds then I told my brother to come see this object.  By the time he got there it flew away towards the north a high speeds.  A couple of years later, while watching Unsloved Mysteries I saw a ufo that looked like that one I saw but bigger. Which got me thinking about the UFO that I saw.  Then I begin going over what anyone would say about the UFO that I saw. I started by thinking that it can't be a laser because it was too big to be one,or that it was an illuion.",
      "link": "http://www.nuforc.org/webreports/052/S52862.html",
      "state": "NV",
      "duration": "at home"
    },
    {
      "_id": "64d005f478aba2ec5a3b58f5",
      "summary": "A purple sphere jetted left...and then right.and the left ..and then right again VERY fast and dissapeared",
      "city": "reno",
      "shape": "sphere",
      "date": "2007-10-08T00:00:00",
      "story": "A purple sphere jetted left...and then right.and the left ..and then right again VERY fast and dissapeared",
      "link": "http://www.nuforc.org/webreports/058/S58188.html",
      "state": "NV",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a82",
      "summary": "A cigar-shaped craft about 100-200 feet, hovering, yellowish-orange with red and white lights.",
      "city": "reno",
      "shape": "cigar",
      "date": "2007-04-27T00:00:00",
      "story": "A cigar-shaped craft about 100-200 feet, hovering, yellowish-orange with red and white lights.  500 Lights On Object0: Yes I am quite certain it was on a Tuesday night between 8 and 9pm that I (age 11) and the rest of my family (mom, age 36; brother, age 12; brother, age 17) saw the craft. The popular TV show MASH was on in our living room which faced Colorado Blvd, the street where we lived. My mother and two brothers were in the living room watching MASH, and I was in the family room watching another TV show. I could see and hear through our kitchen into our living room, where the rest of my family was watching television. I began to hear some excitement coming from the living room and went in to see what was going on. My whole family was staring out the window when suddenly my brother (17) darted to his room to get a camera and out the front door he went. I took his place at the window and was amazed at what I saw. Above the houses across the street and hovering, was a cigar-shaped disc, about 100-200 feet long, bright, with what I can remember as alternating white and red lights. Things began to happen very fast and the excitement was none like I’ve experienced before. We all were outside within seconds of me entering the living room to see what was going on. Once outside, my brother (17) easily scaled onto our roof via our front porch. My other brother (12) ran out into the front yard. I can remember my mother being very concerned, she kept me by her side as we continued to watch from our front porch. My brother’s camera was a cheap Kodak with a flash, but in the dark, he was unlucky at getting any kind of exposure. Anyway, we watched the craft through the tall trees, hover back and forth, over the houses, for about two minutes. The trees were not in bloom as of yet (my estimated date of 4/1 very easily could have been late February or March) and I could see the object through the trees. Another aspect that I am certain of is that I could see through the craft, I mean, it was a clear starry night, facing Mt. Rose and Slide Mountain, part of the Sierra Nevada Mountains which are easily visible on a clear ! day. At night, however, all one could see were the stars, and I can remember seeing the stars through the outline of the craft, which was bright orange-yellow. The lights I mentioned earlier went from one end to the other, through the center of the cigar shape. The strangest thing about our sighting is that is seemed very dark and quiet on our street for that time of night. Not one of our neighbors, who we all knew very well, were outside at that time, and not a single vehicle drove by. The episode, as I said, lasted about two minutes. The last thing I remember is that it all of the sudden disappeared, either from speeding away, or vanishing into thin air, I can’t say which. I am confident the year was 1975 for a number of reasons which I won’t get into here for this could get very long. I will say that this sighting has never left my consciousness. I rarely tell anyone and very rarely discuss it with my family. I can also say that the experience immediately (within one year) turned me and my mother into UFO buffs, of a sort. I can remember reading my first UFO book (Project Blue Book) I checked out at my school library (Vaughn Middle School). Ever since we’ve shared information and still do to this day, but we rarely venture into a conversation about that night. The experience has changed my life, and at the ripe age of almost forty-three, my interest has peaked so much that I have finally taken the time to write it down. That night we called the radio station and they thought we were joking. I told my friends at school and they didn’t believe my either. I do remember my mother telling us one of here friends from the hospital where she worked, spotted the craft. This person, according to my mom lived across Plumb Lane, so it made sense that she could have seen the same thing we did. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55686.html",
      "state": "NV",
      "duration": "two minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c9f",
      "summary": "Large round glowing yellow fireball traveling at a high rate of speed, then suddenly stopping and disappearing",
      "city": "reno",
      "shape": "fireball",
      "date": "2008-06-12T00:00:00",
      "story": "Large round glowing yellow fireball traveling at a high rate of speed, then suddenly stopping and disappearing At appproximately 8:00 p.m. on Tuesday, April 29, 2008, I had just left Reno, NV heading eastbound on I-80 towards Elko, NV. A large perfectly round glowing object caught my eye as it came into my field of vision above me in my front window of my car heading the exact same direction at an extremely fast speed. At first I thought it was a falling star beacuase of the speed that it traveled across the sky, but then I realized it was traveling way too low and it was way too large, and it was glowing yellow not white as typical of the falling stars I have seen often. At that point my mind told me it must be a meteor but here was absolutely no trail behind it. Then it came to a sudden halt but never diminished in brightness, and then just totally became invisible, like it turned its light off. I got I weird gut feeling like this was something I could not explain. Everyone in the car was freaking out because they were all equaly scared. The only other time I had this feeling was in Seattle ,WA in May 1977 at approxiamtely 9:00 p.m. when a small craft the size of a small car followed our car full of five people through a road with tall trees on both sides just floating behind our vehicle, you could see it in the rear view mirror. It was a typical saucer like design that consisted of four rows of glowing windows. Our car died in the middle of the road and we were not able to start it for about a minute. Everyone was hysterical and terrified. Just was curious if anyone else saw the Reno meteor/light in the sky?",
      "link": "http://www.nuforc.org/webreports/062/S62926.html",
      "state": "NV",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b63af",
      "summary": "On our vacation my husband and myself were outside on the hotel balcony, where we saw 4 objects rise from a distant mountain. They had",
      "city": "reno",
      "shape": "changing",
      "date": "2007-10-08T00:00:00",
      "story": "On our vacation my husband and myself were outside on the hotel balcony, where we saw 4 objects rise from a distant mountain. They had a bright orange diamond like shape. As they moved up in the distance they changed into more of a white sphere. At one point they all appeared to be one object then they split apart, appearing like they were dancing or playing in the sky, with a pendulum motion. They appeared to be about 2 or 3 miles away and the size of a dime held at arm's length. The higher they went the smaller they appeared, their lights became dimmer and then no longer were visible. They gave the appearance like they just vanished.",
      "link": "http://www.nuforc.org/webreports/058/S58630.html",
      "state": "NV",
      "duration": "2minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b64c2",
      "summary": "UFO flutters, makes right angle turn and accelerates to impossible speed.",
      "city": "reno",
      "shape": "unknown",
      "date": "2007-10-08T00:00:00",
      "story": "UFO flutters, makes right angle turn and accelerates to impossible speed. While waiting for the Reno Balloon Races to commence, I spent my time watching for satellites. After spotting a couple of normal ones, I saw a very unusual one. This one’s flight characteristic seemed to be like a butterfly in a strong breeze except very, very high up (high up enough to reflect sunlight at about 4:15am).  It appeared to be climbing in altitude quickly also. It was headed in a southerly direction and headed into Orion. As it climbed, it seemed to slow and then just lazily move towards the westerly foot (star name = Rigel) of Orion. I pointed this out to a passing stranger who showed no particular interest. As it reached Rigel, it slowed to a stop and reversed course. It was as faint as a smaller satellite at this point, and proceeded slowly in a northern direction past Meissa (Orion’s head), past Mars and to Triangulum. At approximately the star Perseus, the object made an abrupt 90 degree turn to the east and started to slowly accelerate at first. A couple of women with their 2 children came to sit next to me and I pointed this out to them, they focused in quickly, and the object accelerated  to the point that it went from almost straight above us to the horizon in about 2 seconds while the apparent size grew from a small, dim star to a large size star. I have watched the stars since I was a child, and have studied astronomy for decades. The flight characteristics of this object matched no known aircraft that I have ever heard of as far as fluttering, ability to make an instantaneous 90 degree turn at high velocity, or speed. To go from straight above to beyond the horizon at that altitude constitutes speeds that NASA could not duplicate in their wildest dreams.",
      "link": "http://www.nuforc.org/webreports/058/S58661.html",
      "state": "NV",
      "duration": "15 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b69d7",
      "summary": "One bright light moving silently east of Reno Nevada",
      "city": "reno",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "One bright light moving silently east of Reno Nevada From my back porch in South Reno I was looking east towards the desert foothills and noticed a bright light (about the size of the planet Venus on a clear night) moving slowly south eastward. The light was unblinking and I could not hear any sound. I glanced downward for about 10 seconds (I was cleaning the barbecue) and looking back up it was entirely gone. There were a number of identifiable airplanes farther east of where I saw the object.  Maybe as many as 8 planes in the distance.",
      "link": "http://www.nuforc.org/webreports/061/S61636.html",
      "state": "NV",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f71",
      "summary": "My friend and I encountered an object in the sky that at first we thought was a plastic bag. Then we noticed this thing was roughly 8,0",
      "city": "reno",
      "shape": "changing",
      "date": "2008-03-31T00:00:00",
      "story": "My friend and I encountered an object in the sky that at first we thought was a plastic bag. Then we noticed this thing was roughly 8,000 feet up and about 5 to 6 miles away. It kept changing shapes until settling on a ball of light. It moved from a south position, to a south-east position and back again several times, at which point another object, much fainter than the first appeared, moved from a southern position in relation to the original object, then began to circle it in a clockwise fashion. We were all at a local cafe, and several people went outside to see what the fuss was about. I had stopped a River Patrol Bicycle police officer to visually confirm what we were seeing. After several minutes the two objects shot straight up and out of view. We then noticed fighter jets circling the sky where the object(s) had been. I have taken a photo of it with my cell phone camera and so did my friends girl friend. I also took a photo of the fighter jets.  I went to several websites, and it did not exemplify the behavior of the naked eye GRB that took place that day, nor did it seem like a star in keeping with the rotation of the Earth as it would only move in one direction if this were the case. I also went to see if it was a satellite, no luck there. I'm at a loss to explain this in conventional terms. These objects were witnessed by several people in the downtown Reno area. And one person in the Northtowne area of Sparks, Nevada.",
      "link": "http://www.nuforc.org/webreports/062/S62296.html",
      "state": "NV",
      "duration": "roughly 45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7084",
      "summary": "White spherical object over Reno Nevada at 18:00 starting just above tree level, over airport then over mountains.",
      "city": "reno",
      "shape": "oval",
      "date": "2007-06-12T00:00:00",
      "story": "White spherical object over Reno Nevada at 18:00 starting just above tree level, over airport then over mountains. From the 20th floor of the Atlantis Resort a white spherical/oval object was seen just above tree level between Moana & Gentry streets. It was moving slowly at first heading in an easterly directly and over the airport toward the mountains.  Speeding up it moved in an erratic motion much faster than an airplane.  As it approached the foot of the mountain it gained altitude very quickly and continued its ascent while moving away and continuing to move erratically until it disappeared into a tiny spot.  The entire event lasted 3 minutes.",
      "link": "http://www.nuforc.org/webreports/056/S56637.html",
      "state": "NV",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7112",
      "summary": "Cluster of nine satellites flying together, two veering around others.",
      "city": "reno",
      "shape": "formation",
      "date": "2006-12-07T00:00:00",
      "story": "Cluster of nine satellites flying together, two veering around others. While stargazing with my son using night vision goggles last night we both saw what looked like a cluster of nine Satellites flying east to west with two of the satellites weaving around the other seven. When they were almost out of view one veered directly south and they disappeard from our view. Approx. 5 minutes later we saw seven more flying in the same direction but made a big left bank heading south until out of view. After 5-6 minutes we saw five more of the same things flying in a near perfect straight line north to south until out of our view. The objects looked like satellites, no blinking light, very distant, no sound or trails but moved faster and not in the straight line across the sky.",
      "link": "http://www.nuforc.org/webreports/053/S53180.html",
      "state": "NV",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b72bc",
      "summary": "Black Sphere moving silently west against wind currents",
      "city": "reno",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "Black Sphere moving silently west against wind currents Black Sphere object originated in south traveling due north.   The black sphere was traveling about the speed of a turbo prop plane, but silent.  Faster than a helicopter, but slower than a jet.  It continued on a calm windless day north, then turned 90 deg. to the west and continued west at the same speed until it just disapeared into the distance.  It did not move like a balloon, and traveled the wrong direction for a balloon, prevailing upper winds were heading east.   It left no contrails like a jet much higher at the same time.   I took pictures with a 6M digital camera, and zooming into the picture reveals only a black sphere.   I have no idea what it was.",
      "link": "http://www.nuforc.org/webreports/062/S62008.html",
      "state": "NV",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b740a",
      "summary": "Triangular object above freeway",
      "city": "reno",
      "shape": "triangle",
      "date": "2007-11-28T00:00:00",
      "story": "Triangular object above freeway I was driving South on the freeway on my way to work when suddenly traffic hit.  There were no accidents or anything.   I looked at the car next to me and noticed that the driver was leaned over his steering wheel looking straight up.  I looked up at this time and noticed a huge triangular object hovering above.  I noticed 2 helicopters circling this object, and the helicopters were tiny in comparison.   The object looked like a triangle that was lying down, but had some width to it.  It had large white lights blinking on the sides that kept going around the object in a circular motion.  It hovered for about 5 minutes and suddenly it was gone.   I didn’t see it move, take off, nothing.  It completely vanished right in front of my eyes.",
      "link": "http://www.nuforc.org/webreports/059/S59963.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b74aa",
      "summary": "they been traveling quickly around peavine mountain to quick to be any plane jet or helicopter, same type of thing i saw the last few y",
      "city": "reno",
      "shape": "other",
      "date": "2008-02-14T00:00:00",
      "story": "they been traveling quickly around peavine mountain to quick to be any plane jet or helicopter, same type of thing i saw the last few years around this time, looks like a saucer surrounder by a cloud of mist very fast i saw peoplelike things outside of it and they saw me far away when i was looking through binaculars they followed me to my house then took off so fast they dissappeared",
      "link": "http://www.nuforc.org/webreports/061/S61592.html",
      "state": "NV",
      "duration": "5min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7afd",
      "summary": "A white light dropped slowly from the sky & shifted to a level flight and faided out.",
      "city": "reno",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "A white light dropped slowly from the sky & shifted to a level flight and faided out. The aircraft was moving at a 90 degree angle from the sky towards the ground at a slow rate of speed. The aircraft made a small s pattern in the sky, almost like a woble.  There was not tail as if a meteor and was moving to slow.  At about 10-15,000 feet it shifted to a level flight with the ground.  After about 20 seconds in level flight it dimmed out.  It had no flashing or color lights.  It was one single color of white, and was about as bright as a neighbors 40 watt light bulb.",
      "link": "http://www.nuforc.org/webreports/056/S56421.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c61",
      "summary": "Reno, NV  Green Spherical Luminous Object over Reno",
      "city": "reno",
      "shape": "unknown",
      "date": "2006-10-30T00:00:00",
      "story": "Reno, NV  Green Spherical Luminous Object over Reno ((address deleted)) Blvd.  Had just entered 395 highway going south.  At the same time I began to notice an object entering my field of view from the left, my friend pointed towards it and said \"What is that?\".  I saw a distinct green circular shape moving at an extremely high speed from the Northeast to a Southwest direction.  It appeared the object was descending, but this could have been an illusion.  It appeared it was low, approx. 500-1000 ft.  (If I held a ruler up in front of my eyes the object would have measured about 1/4\" in diameter). There was no sound, like a military jet travelling at high speed might make.  I could not be sure if what I was seeing was propulsion from a craft or not.  It was dark and I could not see any shape other than the large green circle. I would estimate it traveled at least 4 miles in about 3 seconds as I had a view of the whole Reno valley.  It was moving much more rapidly than I would expect an civilian or government aircraft (planes or helicopters) to be traveling at.  After about six seconds, with the object heading toward the Sierra Mountain range, it suddenly and abruptly disappeared, like it simply just blipped out.",
      "link": "http://www.nuforc.org/webreports/053/S53021.html",
      "state": "NV",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b83dd",
      "summary": "Large rectangle, invisible apart from its outline",
      "city": "reno",
      "shape": "rectangle",
      "date": "2009-03-19T00:00:00",
      "story": "Large rectangle, invisible apart from its outline About 2 o'clock, Saturday afternoon, bright blue sky.  Bright sun.  Looking at commercial airliner traveling north to south through binoculars.  As I followed the plane, I saw a large rectangular shape in the same area as the plane.  I could only see the outline of the rectangle, the inside was the same color as the sky. The outline was like the edge of a window, thicker and collecting the light. The rectangle was about the same height as the plane, but was 3 to 4 times the length of the plane. I followed the plane for a second and went back to the object. It was in the same place but it must have turned.  What was visible now was a tall, thin triangle of similar visibility.  I dropped the binoculars, could not see the object, and when I looked through the binoculars I could not see the object. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69036.html",
      "state": "NV",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b877b",
      "summary": "Diamond, Spherical UFOS over Reno",
      "city": "reno",
      "shape": "diamond",
      "date": "2008-10-31T00:00:00",
      "story": "Diamond, Spherical UFOS over Reno Sitting on a lawn chair looking north towards Sun Valley I noticed a single circular sphere of light during the afternoon. There were some chemtrail clouds drifting south. The sphere moved very slowly towards me in over the downtown Reno metropolitan area. It took up a position over McCarren Blvd. and remained motionless for approx. 5 mins. It then moved closer to my position on a straight course but ever so slowly. At first I thought it was a balloon but it maintained its course on a straight trajectory. It stopped over the northern Sparks area and held position. It seemed to emminate its own white luminious light source. It appeared under intelligent control. Suddenly off to my left appeared a diamond [mother-of-pearl] shaped craft. It seemed to have dimensional structure to its outer shape. I glissened and gleamed various beautiful colors in the late afternoon sunlight.  One moment it seemed to look like a triangle then would alter its dimensional features appearing more diamond shaped. It moved with the same slow movemnt as the first sphere which was also visible at the same time the diamond was overhead. The diamond moved forward ever so slowly then took up position over the University of Reno. It remained stationary for 6-7 mins then began a very slow path floating back and forth slightly. It then began it final course 90 degs to it previous path heading west. It was the same altitude as the clouds [chemtrail clouds] which were blowing east in the wind. But the diamond was moving AGAINST the wind as it advance head-on past the clouds. I watched it till it was out of sight. This all took approx 25-30 mins.  The first sphere also was now undetectable by vision. It was also gone.",
      "link": "http://www.nuforc.org/webreports/065/S65354.html",
      "state": "NV",
      "duration": "30 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b8b3c",
      "summary": "Brite light seen over reno,nv. This is the 2nd time I have seen this light and it's not a shooting star.",
      "city": "reno",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Brite light seen over reno,nv. This is the 2nd time I have seen this light and it's not a shooting star. This is the second time I have seen this light. The first time I saw it was 2 months ago late at night.  It came from the south and was going north.  The first time I thought it was a shooting star but it held a constant elevation. I saw the same thing again tonight.  This is no shooting star and it make no noise at all.  The light is so bright and looks just like a star light, pure white and it stays on course without any elevation change at all. Has any one else seen this light.",
      "link": "http://www.nuforc.org/webreports/072/S72859.html",
      "state": "NV",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b53",
      "summary": "LARGE CIRCULAR DISK APPEARS FROM NOWHERE, THEN MOVES EAST AND FLAMES OUT",
      "city": "reno",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "LARGE CIRCULAR DISK APPEARS FROM NOWHERE, THEN MOVES EAST AND FLAMES OUT   AT 4:OO AM I WAS UNABLE TO SLEEP, SO I WENT INTO THE BACKYARD BECAUSE IT WAS A NICE NIGHT NO CLOUDS AND STILL WARM OUTSIDE. I NOTICED A BRIGHT STAR OR PLANET AND BECAUSE OF LACK OF CITY LIGHTS YOU COULD SEE THE ENTIRE SKY AND ALL THE STARS. HAVING WITNESSED SEVERAL UFO EVENTS OVER THE YEARS IN RENO,I REMEMBER THINKING NOW WOULD BE A PERFECT TIME FOR AN OCCURANCE, GIVEN THE TIME OF NIGHT.NO SOONER THAN I THOUGHT THAT AND WAS LOOKING AT THE STAR IN THE NORTHEAST SKY,WHEN OUT OF NOWHERE A HUGE YELLOWISH DISK APPEARED, LARGER THAN THE STAR I WAS LOOKING AT AND IT WAS TOTALLY STATIONARY FOR ABOUT 5 SECONDS, THEN IT STARTED TO SLOWLY MOVE EASTWARD.IT THEN STARTED TO FADE AND LIKE A FLAME BEING EXTINGUISHED, IT DISAPPEARED.BEING A FORMER PILOT, I KNOW IT WAS NOT AIRCRAFT",
      "link": "http://www.nuforc.org/webreports/073/S73715.html",
      "state": "NV",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bbf",
      "summary": "From flock of birds, to plane crash, to WTF is that!",
      "city": "reno",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "From flock of birds, to plane crash, to WTF is that! My rental vehicle was parked at the Grand Sierra Resort facing east and I was overlooking a small lake called MGM Lake. I was waiting for management to arrive at a new building where I was installing software. While I was in the rental vehicle listening to a college football game I noticed fish were jumping out of the lake. I live in Las Vegas and I very rarely get to see any wildlife 'in action'.  So I sat there and watched this for a few minutes when my eyes caught sight of what I thought were three birds. It was dark and I figured that lights in the distance had illuminated the birds. The birds were headed north but then banked to their right and completed a 270 degree turn. Now they were headed west, right in my direction. The area is very close to the airport and after I figured out the lights were not birds, I braced myself for a plane crash because the 270 degree turn was very fast, low, and heading lower. But once it straightened out, the lights started moving in my direction. I watched this object silently move across the sky (Had to be only 300 FT off the ground and I'd say roughly 1000 FT in front of me and I cannot judge the speed though I'd guess 200 MPH) and it went behind a tree line. I looked to the other side of the tree line expecting to see the object but nothing appeared. When I glanced up before the lights passed the tree line I could not make out any object but there were certainly three points that if you connected the dots you could make out a triangle. The rental car was idling but there was very little engine noise and I did not hear any noise from the object. There were no blinking lights and what made this even more interesting was about 20 seconds after the object went behind the tree line a plane landed. It was a small plane and I was thinking they had to have seen something!  I was in a complete sober state of mind. I called the Reno PD to see if anyone had reported the same thing and they said no.",
      "link": "http://www.nuforc.org/webreports/066/S66928.html",
      "state": "NV",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9029",
      "summary": "Faint object  seen shooting over Cold Springs Valley in Reno, Nevada",
      "city": "reno",
      "shape": "unknown",
      "date": "2010-02-14T00:00:00",
      "story": "Faint object  seen shooting over Cold Springs Valley in Reno, Nevada Time is approximate on this, sorry!  I and one of my brothers were visiting our brother in Reno, Nevada over Christmas.  His house is in the Cold Springs Valley area!  I stepped outside his garage to have a cigarette, on the side of his home.  It was still dark outside, but with a faint glow of the sun just barely starting to lighten the sky.  Not knowing exactly which direction his house faces, I will only suggest that I was on the east side of it at this time!  Being a believer of this type of thing, I always watch the skies in the hope that I will see something, and this time I did!  I was looking upwards, and I had high thin clouds to my right, but the skies were mostly clear.  I looked to my left more, and caught a fain object shoot past my field of vision at a very high rate of speed!  And I mean fast!  As I said, maybe only 2 seconds of viewing time!  What ever it was, it was not at an altitude to be lit by any sunlight because there was only a hint of lightening of the sky at this early hour!  And I saw it for such a short time span, than I can't even tell you what shape it was, either!  It was there, and then gone!  It's size I would approximate as being about the size of a pencil eraser, held about 8-10 feet away, looking straight on.  I went inside and told my brothers about this and one suggested that it might have been a bird!  But this was way too fast to be a bird!  And the other, which I tend to partially agree with suggested that it might have been a meteor!  The one problem I have with this is that I don't know a great deal about celestial bodies, but this seemed an awful lot closer to the ground than a meteor!  I would say no farther than 7-9,000ft above me!  I tried to follow it's path, to see if it would reflect any light from somewhere, but, nothing! It was pretty faint, and was gone really too quickly!",
      "link": "http://www.nuforc.org/webreports/073/S73846.html",
      "state": "NV",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b91ea",
      "summary": "flight from las vegas to reno - southwest airlines--made plane pitch, drop, and shutter for a few minutes  ((Turbulence??  PD))",
      "city": "reno",
      "shape": "cylinder",
      "date": "2009-12-12T00:00:00",
      "story": "flight from las vegas to reno - southwest airlines--made plane pitch, drop, and shutter for a few minutes ((NUFORC Note:  Probably not UFO-related.  Turbulence?  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73417.html",
      "state": "NV",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b986d",
      "summary": "Disk-shaped object sighted with rotating lights, only a few hundred feet away.",
      "city": "reno",
      "shape": "disk",
      "date": "2009-08-27T00:00:00",
      "story": "Disk-shaped object sighted with rotating lights, only a few hundred feet away. On the drive home with my boyfriend, I spotted a light in the sky that caught my attention.  It was a disk-like shape with many yellow-white lights moving in a circular motion around the craft.  The object also had one small red light near the top center of the craft.  I pointed the object out to my boyfriend and within about a minute, the object had moved all the way across the valley of Reno, NV, and could barely be seen anymore. We noticed that a helicopter came relatively close to the object several times, but the object seemed unaffected by its presence. We decided to attempt to follow the craft to investigate further.  As we drove across the city, the craft moved closer and farther away, sometimes hovering in one spot for several moments.  At one point, we got near enough to the craft that we could see with the unaided eye its true shape.  It was still disk shaped, but it had become apparent to us that there were two rows of lights instead of one, spin! ning around the craft in a circular motion.  At our closest, the object was a few hundred feet in the air away from us.  At this point, the object turned onto its side, much like a Frisbee rolling on the ground, then turned back to its flat side, and began again to move away from where we parked. We continued to drive throughout the city to get closer, but the object eventually disappeared from sight altogether.  In the dark it was very difficult to see the full shape of the object, but I and my boyfriend are certain that this was no helicopter, plane, or child's toy.  We attempted to both photograph and videotape the object, but neither method was successful in picking up the image.  To clarify, neither of us have ever seen anything like this.  We are both young college students with no history of mental illness.  We have seen TV shows regarding these kinds of incidents, and have always found them to be exaggerated and quite unrealistic.  After today, we are unsure what to believe and are searching for some sort of logical explanation.",
      "link": "http://www.nuforc.org/webreports/071/S71564.html",
      "state": "NV",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b98c4",
      "summary": "A shimmering dot like object seen thru binoculars at approx 45 degrees moving right-left eradically in field.",
      "city": "reno",
      "shape": "oval",
      "date": "2009-06-09T00:00:00",
      "story": "A shimmering dot like object seen thru binoculars at approx 45 degrees moving right-left eradically in field. Unidentified Object Sighting:  Saturday, May 9, 2009, WST: 10:44:50 Reno, NV On Saturday, the above date and time), a neighbor living at ((deleted)) Court, Reno, NV, alerted me of this unusual sighting in Reno, NV.  He was sitting on this front porch stoop (facing West) and noticed a silver sparkling object   appearing  to travel  up the side of Peavine mountain.  At first he thought it was a helicopter but ruled this out due to the rapid ascent and abrupt changes in directions without regard to being on a road or paths that were visible on the side of the mountain.  He indicated he observed this object for about 30 seconds then decided to get his binoculars and camera. He then observed this object going above the top of Peavine in a westerly or north-westerly direction.  He used is Canon digital camera with the 40 power  lens  and took three pictures, only two frames captured the object which  was just a small dot in the totally blue sky background.  He was so excited that he yelled at me to come and see the object which was shimmering in the sky at some distance, I used his binoculars then got my binoculars to observe the shinny and our US Postman also observed the object. While using my binoculars and observing the object, it sped different directions and reversed course very rapidly, unlike any normal flying craft.   Finally it was no longer visible to me and the other observers. After the sighting, the neighbor downloaded the captured images approximately 400X and it was a very distinct object with the magnification used by the computer.  He will forward the original digital image without magnification and other photos indication the approximate angle of sighted object in the sky from out vantage point on San Simeon Ct. To contact me: ((e-address deleted)), 775-((telephone number deleted)) ((address deleted)), Reno, NV 89509 Sincerely ((name deleted))",
      "link": "http://www.nuforc.org/webreports/070/S70080.html",
      "state": "NV",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9930",
      "summary": "A real ufo i cant believe it",
      "city": "reno",
      "shape": "flash",
      "date": "2010-02-14T00:00:00",
      "story": "A real ufo i cant believe it Im 17 i was on my phone and my phone was dying so i figured i would charge my phone. I notice through my window a brighter light than other stars it was blurry to because the window was foggy so i whiped the window and you can tell it was bright and moving fast and up there with the stars so i tell my cousin and sister i think i seen a ufo so i went outside to get a better look and im sure enough it is a ufo so i tell my cousin get come look and i point at the ufo and said look its flashing green and red and its brighter than the other stars and moving and spinning she it look like it is and it disappears and reappears it still out there as im writing this thats why i didnt put a duration",
      "link": "http://www.nuforc.org/webreports/074/S74080.html",
      "state": "NV",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9c85",
      "summary": "bright beam of light may have landed in reno, nevada",
      "city": "reno",
      "shape": "cigar",
      "date": "2010-02-14T00:00:00",
      "story": "bright beam of light may have landed in reno, nevada The object I saw was a cigar shaped, disk that was really bright.  No rotating lights or flashing just all one bright light it was half vertical and horizontal looking. F rom what we saw the craft looked fairly big there was only one in the sky.  There was no change of colors or paths left behind of what we seen.  My boyfriend and I were driving by the Clayton middle school area when we saw the full craft we couldn’t tell if it was moving or if it was just us but we assume it was.  Passing Wal-Mart we couldn’t see the object, no where in site until we went up Beaumont Parkway by the Mormon temple we saw in the distance by Verdi and passed Boomtown that the object went behind the mountains and looked like it landed horizontally,  It went really slow and when we couldn’t see the object there was a sunset looking background that was a yellowish orange color.  We stayed there for like 5 minutes and the colors where fading. 10 minutes later it was all black",
      "link": "http://www.nuforc.org/webreports/074/S74174.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c6f",
      "summary": "Mysterious Bright Light moving very fast across the sky.",
      "city": "reno",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Mysterious Bright Light moving very fast across the sky. I was going outside to have a cigarette and enjoy the cool night air when my wife and I spotted a very bright light moving south across the sky.The weather was clear and calm and you could see the big dipper behind the moving light along with the other stars. The light was moving very fast with no sound whatsoever and eventually got brighter before vanishing without a trace.",
      "link": "http://www.nuforc.org/webreports/071/S71227.html",
      "state": "NV",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f45",
      "summary": "A turquoise light appeared and then there seemed to be a creature appearing from the spacecraft",
      "city": "reno",
      "shape": "unknown",
      "date": "2009-01-10T00:00:00",
      "story": "A turquoise light appeared and then there seemed to be a creature appearing from the spacecraft   In the morning at, a little earlier than seven AM, two of my buddies, and I were coming back from Elko, Nevada and traveling westward on highway eighty. We were traveling to Sacramento, California to then fly back to Raleigh, North Carolina.  The purpose of our travel to Elko was to see our long lost friend from elementary school. When traveling back we took a stop in Reno, Nevada.  From there we spent the night at a motel, Motel 8, and then, in the morning, upon departure, we saw, what we thought to be, a UFO. There was a bright light, it then turned into a turquoise color and seemed to disappear.  We then heard heavy winds, from inside the car, and then we saw lots of dust and a dim light. I believe we saw some kind of creature approaching us.   My friends and I, were shocked when we saw it and panicked on whether we should go back to Elko or continue into California.  We continued our trip until we arrived in Sacramento, which is where we “stole” Internet, from the hotel we were outside of, to search up about UFO’s.   We then found this website’s number and called it, when we were off of the plane and traveling back to where we reside.",
      "link": "http://www.nuforc.org/webreports/067/S67598.html",
      "state": "NV",
      "duration": "less than 5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba116",
      "summary": "Bright light observed over Reno, Nevada.  Disappears suddenly.  ((NUFORC Note:  ISS sighting.  PD))",
      "city": "reno",
      "shape": "fireball",
      "date": "2009-08-05T00:00:00",
      "story": "Bright light observed over Reno, Nevada.  Disappears suddenly. While outside I happened to notice a bright, slow moving light to the south east of my house.  It seemed to be heading down, towards Earth.  My first thought was that it was a helicopter, but it's movement was much more steady and there was no noise.  Also, it was one bright light, whereas helicopters tend to have a few different colors on them.  About a minute after I first spotted it, an airplane was heading our direction and it disappeared quite suddenly. ((NUFORC Note:  ISS sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71314.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba82a",
      "summary": "Normally you can't see bright stars  in downtown Reno but when i was  looking up at the sky i saw a bright sphere dance around for a se",
      "city": "reno",
      "shape": "sphere",
      "date": "2008-08-12T00:00:00",
      "story": "Normally you can't see bright stars  in downtown Reno but when i was  looking up at the sky i saw a bright sphere dance around for a second or two and then watched it fly away.  It flew away at such a high speed that it couldn't have been a plane or hellicopter. it was too big to be a meteorite and it flew away from the earth",
      "link": "http://www.nuforc.org/webreports/065/S65155.html",
      "state": "NV",
      "duration": "5 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3baac0",
      "summary": "i was headed east leaving Reno i had just pasted a church and i was on a cell phone talking to my friend and i saw a triangle in the sk",
      "city": "reno",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "i was headed east leaving Reno i had just pasted a church and i was on a cell phone talking to my friend and i saw a triangle in the sky. it was must have been about 100 to 150 feet long and at least 150 feet high and had 3 lights at the points 2 white lights and a peach colored light at one end the UFO was rotation very slowly and was flying very slowly it felt so close that i felt like i could touch it and there were reflections of the lights on the hood of my van it was going south and it flew into a patch of trees i sped up to get out of the trees and when i got out i saw a very very small glimpse of it maybe a fourth of a second if that and it zipped of and it just became a light in the sky it didn't make a sound or disturb anything around it...it just left. I AM A BELIEVER...",
      "link": "http://www.nuforc.org/webreports/077/S77792.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baf96",
      "summary": "green circular object traveling over reno extremely fast.",
      "city": "reno",
      "shape": "circle",
      "date": "2011-05-02T00:00:00",
      "story": "green circular object traveling over reno extremely fast. Bright green glow traveling from west to east.   Appeared to be moving through very light cloud cover and was traveling extremely fast. At one point green glow seemed to hesitate slightly and go out, then almost instantly reappeared and then traveled east over mountain range.",
      "link": "http://www.nuforc.org/webreports/080/S80925.html",
      "state": "NV",
      "duration": "4 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bb004",
      "summary": "A silver Ball hovering over McCarran Blvd near Idewild park",
      "city": "reno",
      "shape": "other",
      "date": "2011-03-23T00:00:00",
      "story": "A silver Ball hovering over McCarran Blvd near Idewild park When I was a young child under the age of 10, App. 1985 or 86.  My family and I were traveling from Reno, Nevada to Truckee, CA, to see my Grandpa, as were driving from our home in Lemmon Valley down Virginia we turned onto McCarran Blvd and there were cars parked everywhere along the side of the road and people were standing there looking up at the sky.  We parked and got out and hovering in the sky was a giant silver ball shaped object, it was spinning in place as we stared at it.  I don't remember how long we stood there, but I remember looking at the other people and at this ball, and then all of a sudden jet fighters took off from right behind the MGM Hotel/Casino and the ball shot off at a extremely high speed and was just gone and then the 2 jets took off the same direction.   I remember my parents talking to other people about it, and then we all drove away. I remember there was never anything mentioned about it on the news or anywhere else. I am 34 years old now and still remember it just like yesterday! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80424.html",
      "state": "NV",
      "duration": "a few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1ee",
      "summary": "two light formations moving across reno, nevada",
      "city": "reno",
      "shape": "formation",
      "date": "2010-11-21T00:00:00",
      "story": "two light formations moving across reno, nevada While driving to work I noticed, what looked like, 2 airplanes a couple of hundred feet up and pretty close together.  While driving I tried counting the lights on the crafts, in which neither formation appeared to be moving, starting with the further away craft. I believe it had 5 or 6 lights, but while counting, the craft closer to me began tilting.  Both where horizontal to the ground but this one turned completely vertical.  I was heading south and they where seen through the front windshield on the passanger side.  As it got all the way vertical, it waited for a second before turning westward. I could see hundreds of little dimmer lights along the bottom. It took off rather quickly, almost looking like a plane with no body, just wings.  I tried to see the other craft but it was miles away, then I noticed the closer craft was miles away too.  In less than a mile of driving both crafts went from close by and horizontal to the ground to tilting and moving across! town, in just seconds.",
      "link": "http://www.nuforc.org/webreports/078/S78745.html",
      "state": "NV",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3f3",
      "summary": "Strange lights over Reno on Christmas eve",
      "city": "reno",
      "shape": "light",
      "date": "2011-02-18T00:00:00",
      "story": "Strange lights over Reno on Christmas eve My family and I were out driving around looking at Christmas lights on the east side of the valley/basin, when I looked out the window of our car and saw a few slow moving orange/yellow lights moving horizontal through the sky but below the mountain peaks, they looked like they were flying right through the middle of the valley.   I had my wife stop the car and i got out to try to get a better look with my binoculars as i watched them one by one go across to the middle of the valley then go up what seemed like a mile or two high above the mountain peaks and then begin moving horizontal again and fade out one by one and their was no sound from the objects.  They looked to be round in shape with slightly visible vertical panels.   The only other people I know who saw them from a differnt part of the valley was my brother and his wife with a few other people around them.   I placed calls to the local police and to the airport and nobody else had made a report and the airport said they didnt see anything.",
      "link": "http://www.nuforc.org/webreports/080/S80052.html",
      "state": "NV",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb505",
      "summary": "12/26/2010 17:08 Reno Nevada circle 5 seconds moved across sky from west to east",
      "city": "reno",
      "shape": "circle",
      "date": "2011-01-05T00:00:00",
      "story": "12/26/2010 17:08 Reno Nevada circle 5 seconds moved across sky from west to east December 26th, I was outside at about 14:50 hour setting up to film my Christmas light show.  The night was partly cloudy, and the night sky was twilight.  There was only one star visible. My house street runs west to east, I am standing across the street setting up my HDD recorder, I would be looking south to film my house. I started filming at 17:00 hour. The second song to play is Wizards in winter and that’s when the object appeared at about 17:08.  I first saw the object way before it entered in to the view finder. It was bright and very bold looking in the sky, as nothing could compare to its size or speed.  Best way for me to explain its size is if a star is pin size the object would be pea size.  I can’t imagine it saw it for more than 5 seconds.  It disappeared behind the clouds and I saw it again through the opening of clouds for maybe another second then it went be clouds again.  The object itself seemed to go bright to dim, there was no after burn or anything behind its movement.  Meteors, space junk, don’t know, hopefully there is a logical explanation. Best Regards",
      "link": "http://www.nuforc.org/webreports/079/S79427.html",
      "state": "NV",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc08a",
      "summary": "Blue/green semi-circle light object near Washoe lake NV along 395",
      "city": "reno",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Blue/green semi-circle light object near Washoe lake NV along 395 While driving southbound I noticed a bright blue light slightly east of the road, several miles away.  This is fairly hilly/mountainous terrain, and it was dark, so I assumed it was a light on a hilltop, or perhaps on a tower.  As I got close it became obvious the light was moving slowly from east to west.  I initially dismissed this as an optical illusion since there was no background other than dark night sky, but the road is pretty straight and the light clearly moved from the left to the right side of the road and got brighter. I alerted the rest of my family in the car, who also witnessed the object.  As we got closer we noticed that there was a blue light on one side and a green light on the other.  As we approached I saw what appeared to be a semi-circle of light with blue on the left and green on the right (from my perspective).  I could never make out any detail other than the lights.  I would estimate the object was less than 1000’ AGL.  I am a pilot with over 20 years of experience in military fighters.  The light configuration was unusual and did not conform to normal aircraft position lights (green/red on wingtips and white tail).",
      "link": "http://www.nuforc.org/webreports/083/S83861.html",
      "state": "NV",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc409",
      "summary": "Craft changing color and direction over Reno,NV.",
      "city": "reno",
      "shape": "changing",
      "date": "2012-01-12T00:00:00",
      "story": "Craft changing color and direction over Reno,NV. My wife and I were on our way back into Reno driving on I-80 West bound at about 630pm.  My wife looked up and saw a strange light in the sky and said it looked to close to be a star and it was not a plane because it didn’t not have any flashing lights on the bottom.  About the same time I looked up it changed color from white to red and seemed to change direction because the shape went from Round to Oblong.  After watching it change color and shape for about five minutes we noticed a low flying plane coming quick from the opposite side of the craft.  As the plane got closer to the craft it was as if someone turned a light switch off because the light from the craft was gone except for a real strange glow emitting from the craft. My wife and I thought it just disappeared and thought the strange sighting was over.  As the plane descended and disappeared over Reno the light came back as if a switch was hit again and was closer and brighter than before.  My wife and I continued to watch from the road for a total of about 40 mins and we could see the light pulsing and move from one spot to another with speed faster than any aircraft we have ever seen. This craft seemed to descend and ascend repeatedly and go from North to South. As we watched the craft it seemed to change color many times and continued into the sky north until it was completely out of sight.",
      "link": "http://www.nuforc.org/webreports/086/S86298.html",
      "state": "NV",
      "duration": "40 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bca73",
      "summary": "Reno area fast traveling object",
      "city": "reno",
      "shape": "disk",
      "date": "2011-08-21T00:00:00",
      "story": "Reno area fast traveling object I am a typical sky watcher in the evenings when I go out to smoke.  My field of view is mostly overhead to east south east, and south, with tree blockage to the west of me.  Most of the city light is blocked out in my back yard, but with typical diffuse light to the eye. I think I am pretty good at identifying that, which is an airplane in the air, or other having grown up around aviators, and people in the space industry. What I saw tonight was moving not as fast as say a meteorite would, like a streak, nor was it the slow steady pace of an airliner over head.   I am pretty familiar with the flight patterns and speeds of various craft overhead, helicopters or what have you, and with Reno airport nearby, it is easy to tell airplanes around. This “ufo” was orange in color, very high in the sky.  There were lower lying clouds tonight overhead, so I could tell it was above that cover.  It was moving from west to easterly direction, and man, this was not any airplane I have ever seen.   Very fast moving, but with purpose.  It was saucer to egg, to oval shaped, leaving no trail behind it.  There was no noise, though from my location sometimes you can hear very high up aircraft in later evenings. This was pretty weird to me, enough to want to report it, but was also wondering if anyone else in the Reno area saw something they questioned tonight.  Were there any low flying satellites tonight in that trajectory and time, that is possible what I saw?   I honestly don’t think it was THAT high, not space high; definitely in airspace air. Thanks.",
      "link": "http://www.nuforc.org/webreports/083/S83248.html",
      "state": "NV",
      "duration": "30 sec or less"
    },
    {
      "_id": "64d005f478aba2ec5a3bcdda",
      "summary": "",
      "city": "reno",
      "shape": "",
      "date": "2011-06-03T00:00:00",
      "story": "Man reported witnessing 3-4 extremely bright lights \"with bright orange lights around the middle.\"   At first, he thought it was an aircraft, but it turned slowly.   The object was below the clouds, and it projected an intensely bright light down to ground level.  The lights on the object were solid, not blinking.  The caller reported that the Reno Police Department (702--334-2121) had received over 100 calls about the same incident.   Also, he stated that he had spent a great deal of time around aircraft, and the object he had witnessed was not any kind of conventional aircraft he is familiar with.",
      "link": "http://www.nuforc.org/webreports/001/S01318.html",
      "state": "NV",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bd40c",
      "summary": "Small diamond shaped craft with streaking blue lights tailing it as it moved in and out of a single cloud in South Reno Nevada!",
      "city": "reno",
      "shape": "diamond",
      "date": "2012-05-13T00:00:00",
      "story": "Small diamond shaped craft with streaking blue lights tailing it as it moved in and out of a single cloud in South Reno Nevada! Me and a friend were taking a walk in a very busy residential area when he said what's that and proceeded to point up to the sky.  The object was going in front and behind of a small cloud in a weird zig zag manner moving from one side to the other, then going in, out amd arpund te cloud.  The movements it was making was nothing any man maid object we know of can make.  At one point it stopped in mid air for a couple seconds then went back around the cloud.  It was going at a fast pace but not to fast and the last time it went behind the small cloud it wasn't seen again.  The other clouds were random and not close together for it to move behind another one without us seeing it.  It was diamond shaped with a blue streak of light tailing behind it that was coming from what we believe was the back of the craft.  It also had some red and green lights but were very light and at the back of the craft but was not making a streak like the blue light was.  It just disappea! red behind the cloud and we didn't see it again.  It lasted about a minute or or two.  The craft looked to be not that big as the clouds were pretty low clouds.  It was making 90 degree and 180 degree moves almost like it was flipping over on itself to change direction.",
      "link": "http://www.nuforc.org/webreports/087/S87917.html",
      "state": "",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd457",
      "summary": "Figure 8 atmosphere highth bright light",
      "city": "reno",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "figure 8 atmosphere highth bright light Sitting on my porch with my girlfriend i have a good view of the towers on the hill i noticed what apeard to be a bright star further watching showed it moving in a figure 8 pattern wich i had my girlfriend confirm that i wasnt seing things i have now knoledge of anything that could be that bright and high(atmosphere level and brighter than any star currently in that side of the sky that could move like that ts currently 2;29 am i will post again if it leave and or is still there/returns",
      "link": "http://www.nuforc.org/webreports/092/S92362.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd628",
      "summary": "It is a little translucent light seeming to change clearly, with a larger one directly under the othe rediculously bright form in the s",
      "city": "reno",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "It is a little translucent light seeming to change clearly, with a larger one directly under the othe rediculously bright form in the sky.  The only thing in the sky other than the moon. They are freaking scary and they were here last night at the same time.  I fear the worst.  I you liv in the reno area, you are a fool if you don't stay up to see this. Its like a teloscope from the sky.  I belive the two objects are connected in someway and when i film the lights on my iphone they pulsate and freezed my screen at one point and it looms like a cloak is over something disgused by these lights.  At on point my i phone turned off after the strange video interfererance it has on my recording devices.  It's like a celestial sphere with the light asbits core.  You must see this people i am warning you! WTF is going on in reno nevada!!   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90738.html",
      "state": "NV",
      "duration": "4-Daylight"
    },
    {
      "_id": "64d005f478aba2ec5a3bd743",
      "summary": "Small plane size rectangular shape with triangular nose, looked to be investigating a small cloud while walking along Offenhauser Dr.",
      "city": "reno",
      "shape": "other",
      "date": "2012-07-04T00:00:00",
      "story": "Small plane size rectangular shape with triangular nose, looked to be investigating a small cloud while walking along Offenhauser Dr. It was between Sep and Nov because it was still slightly light out at 6:30 in the evening. It was cold enough to wear my jacket to but not yet winter, I remember that. There was a small amount of clouds in the sky on this evening and they were all a little ways apart from eachother. The person I was walking with said what is that and pointed at the sky. When I looked up I saw what appeared to be a rectangular like object about the size of a small plane with a triangular like top to it that came to a point. This craft looked like it was inspecting this one cloud. There were no wings and no noise. It had blue, green and pinkish streeks coming from the back that looked kind of like what a rocket has behind it when it takes off yet it was not thick nor looked like it was exhaust of anykind. The object was a light metalic silver. It moved around this cloud in such a way and in such speed unlike anything any of our normal average citizens know about that exist in ! our world. Then it just went POOF! Dissappeared just like that, right in front of our eyes. I do know we have nothing that can just dissapear in the blink of an eye, a flash of a second right in front of you. If I could draw a picture it would be imagined like this. The cloud was pretty small and the object went up, stopped, went down behind the cloud, back up through the cloud, then around it and back up then stopped, hovered by this cloud touching the edge of it with its nose and then back behind it, then it went back out and hovered for a second then POOF, it dissappeared. The movements were not of this world. It did not make turns. It just went up then down then through and around and out, its hard to explain it perfectly how it moved. It just did not move like any jets, planes, rockets we have and IT WAS NOT A DAMN WEATHER BALLOON either. There is no EXPLAINING this one away for me. I was not scared at what I was seeing I was amazed. I have always thought they existed ! and I had the privledge of actually seeing one which I am very! proud o f being able to say I have seen one. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90053.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bddf3",
      "summary": "The object was a bright light, light blue in color, and much brighter than a star or planet. ((NUFORC Note:  Sighting of Venus?  PD))",
      "city": "reno",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "The object was a bright light, light blue in color, and much brighter than a star or planet. Spotted at about 5:10 am, Saturday morning, September 16, 2012. The object was a bright light, light blue in color, and much brighter than a star or planet appears in the night sky, maybe about twice the size of anything I have seen in the sky. I noticed it as I walked out in my backyard to have a smoke. The light appeared to be above the mountains in the SSW of the valley, which lead to Lake Tahoe, not sure how high. At first, I thought maybe it was Jupiter or another large planet, but my stargazer app showed Jupiter in the northeast sky and nothing significantly large or bright in the area where I was looking. After about a minute of admiring what I assumed was a strange bright star or planet, it began to move northward. It moved at a slow pace much slower than what I am use to seeing the average plain in the night sky move, also there were no flashing lights, and I could hear no noise, simply a brilliant light blue light floating across the sky. After it ! left my view from the back yard, which was obstructed by the roof of my house, I decided to go out front to see if it was still there and it was. The light appeared to still be traveling at the same rate of speed, but a few seconds after spotting the light in the front yard it stopped, this time hovering in the northeast sky. Exited that it might actually be a UFO, I ran in to grab a small “moongazer” telescope, set it up out front, and located the craft with a 20mm lens, but it still just looked like a light, so I tried a 12mm, 6mm, and 4mm lens in the telescope. Through the 4mm lens, I could see that it was emitting a bright blue glow, and had Blues, reds, oranges and other colors, which I could not quite make out, shimmering all around it, although it still looked like a ball of light. I am not too sure how long it stayed there because I went in to check on my daughter around 5:40 and when I came out to gather my telescope equipment the sun was rising. I could no longer ! tell if it was there.",
      "link": "http://www.nuforc.org/webreports/092/S92851.html",
      "state": "NV",
      "duration": "arround 30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be85b",
      "summary": "Unusual object over Reno/Stead NV",
      "city": "reno",
      "shape": "unknown",
      "date": "2012-05-13T00:00:00",
      "story": "Unusual object over Reno/Stead NV I live in Stead, NV, just north of Reno.  Yesterday,  I stepped out to get my mail and a glint in the sky (like a small glint of metal) caught my eye.  I looked at it and saw an unusual object moving from right to left, very high in altitude and moving unusually slowly.  All I can say is that it was long, very large and if I had to make a comparison, would say it was cylindrical in shape, but can't be sure of that due to its distance.   There was another plane at high altitude in the sky with it some distance to the southwest (not in pursuit, probably a commercial aircraft) and it was clearly leaving a contrail but whatever this was, was not.   I leaned down to get my mail out of the mailbox, which took all of 3 seconds, looked back up fully expecting it to be there and it had completely vanished.  I'm a little frustrated at myself for taking my eyes off of it, I would have liked to have seen how it just apparently blinked out.",
      "link": "http://www.nuforc.org/webreports/088/S88891.html",
      "state": "NV",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bea32",
      "summary": "A fireball fell over south Reno, NV, on 3/10/2012 at 7:00PM. Lasted 4-5 sec.",
      "city": "reno",
      "shape": "fireball",
      "date": "2012-03-13T00:00:00",
      "story": "A fireball fell over south Reno, NV on 3/10/2012 at 7:00PM.  Lasted 4-5 sec. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note #2:  A careful reader noted that the sighting occurred in Nevada, NV, not Nebraska, NE, as the anonymous source indicated in the original report.  We express our gratitude to the person who detected the error, and forwarded the information to our Center.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87603.html",
      "state": "NV",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bff97",
      "summary": "7+ spherical craft south/southwest of Reno, NV.  ((NUFORC Note:  Sighting of Sirius, which is located below Orion.  PD))",
      "city": "reno",
      "shape": "sphere",
      "date": "2013-02-04T00:00:00",
      "story": "7+ spherical craft south/southwest of Reno, nv 7 or more bright spherical shapes South to Southwest of Reno, NV. largest pulsated with red, orange, and blue light.  Lasted about 1-2 hours. most in a large circular formation directly below the constellation of Orion's Belt.",
      "link": "http://www.nuforc.org/webreports/095/S95763.html",
      "state": "NV",
      "duration": "1-2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c0001",
      "summary": "Consumed the surrounding light like a vampire.   distant benevolence?...... none.",
      "city": "reno",
      "shape": "oval",
      "date": "2013-05-15T00:00:00",
      "story": "consumed the surrounding light like a vampire.   distant benevolence?...... none. At approx 03:00am on May 04 2013 while walking around the backside of our property (top of Wedekind rd. & McCarran blvd in Reno, Nevada), a slight (yet rather noticeable) motion within my periphery had grabbed my attention.  I turned to look up toward the south end of town. At about 20*deg above average horizon there was an object moving upward at a slight arc from the east.  The object traveled at a speed of approx 2+*deg per/second across the sky towards the west/s.west direction.  This is quite a bit faster than any satellite I would usually see at this hour. The size of the object if compared to a satellite (without assuming any equal distance in orbit, but merely by observable perspective) would be like comparing the sharpened tip of a pencil (satellite) with the eraser of a pencil (object) held at arms length.  The shape was of an oval, but lacked a solidly defined edge entirely. The object could have been dismissed entirely as a massive satellite ( perhaps the I.S.S. on re-entry?) or even a commercial airliner below 20,000ft.  Instead of completing an arc across the sky, it abruptly changed it's course ¾ the way and dropped downward, as if it just suddenly fell from the sky (in a very fast & controlled manner). The whole time this was being witnessed I had this very strange feeling that this object had become very aware that it was being watched, I felt this most intensely just before it fell towards the earth, as if offended by my staring at it.  However, the disturbing part had to be the way it was illuminated (or lack of illumination).  It was a VERY dark orange/pink color. It seemed as if it absorbed it's light from its surroundings, almost like some kind of parasitic negative image, or maybe like a black-hole. It glowed.... yet, it didn't.  It's surface was like a soft dark rubberized orange/pink haze... it glowed like it it was lit by some distant black-light tube.  But I swear it consumed the surrounding light like a vampire. This is not my first time seeing this phenomena in our town.  This solo one just confirmed the strange cluster formation that left myself and a friend shocked and questioning our existence this last year.  I don't believe there visiting has any distant benevolence...... none.",
      "link": "http://www.nuforc.org/webreports/097/S97566.html",
      "state": "NV",
      "duration": ":45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c017a",
      "summary": "We saw two bright fire lights shoot up to the sky at a fast steady rate until they disappeared behind the clouds.",
      "city": "reno",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "We saw two bright fire lights shoot up to the sky at a fast steady rate until they disappeared behind the clouds. My sister and brother-in- were walking to my car to leave for the store. When my sister-in-law said to look up ahead at some lights going up in the sky.  We both instantly looked towards the sky about south, southwest, and saw 2 huge bright fire lights going up in the sky at a fast steady pace. At first, one of them was going a little faster than the other.  Then after a minute they were even with each other. They kept going at the same pace the whole time.  And they stayed the same brightness until we couldn't we couldn't see them passed the clouds. We aren't quite sure what it was.  One of us said maybe lanterns or hot air balloons, but they were going pretty fast and in a steady direction.  It was barely breezy out, and about 27F degrees.",
      "link": "http://www.nuforc.org/webreports/095/S95841.html",
      "state": "NV",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c045b",
      "summary": "I saw two ufo's with three triangular white lights on fat boomerang shaped craft on i80 east west at 19:15 on 01/16/2013.",
      "city": "reno",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "I saw two ufo's with three triangular white lights on fat boomerang shaped craft on i80 east west at 19:15 on 01/16/2013. At approximately 19:10 on January 16, 2013,it was dark by then and I was driving west on i80 at Tracy Clark Power Plant when I saw a bright light as bright as the sun hovering above the power plant at first.  Then as I went about 8 more miles I realized I was getting closer and closer.  Once I reached a straight away I realized that the ufo was actually hovering right over the freeway.  Once I got closer I noticed it had three circular white lights in a triangular formation pointing east towards me.  I remember wondering if it was looking right at me.  To the northeast at the same time I saw one more set of lights same color and brightness about 10 or 15 miles  away.  Going back to the first one, I came up to it like I was looking at the mountains going 70 miles an hour.  It appeared to be fixed in one place just hovering the lights flickering as jet engines look when they’re firing.  The light was so bright that as I drove directly under it, the light reflected off! my car, and it must have been 1000 feet up or more but the light was bright enough that I could see a faint grey outline of what looked like a boomerang, fat in the middle with triangle lights and then I lost sight of it behind my windshield.  When I looked again about two miles down the road I could no longer see either craft maybe because they were too high up to see in my rear view mirror.  At 19:49 I called the national ufo hotline.",
      "link": "http://www.nuforc.org/webreports/095/S95990.html",
      "state": "NV",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0554",
      "summary": "2 small, silvery spheres over Reno, NV, 3 times faster than jet,, appear and disappear out of clear blue sky.",
      "city": "reno",
      "shape": "sphere",
      "date": "2013-03-03T00:00:00",
      "story": "2 small, silvery spheres over Reno, NV, 3 times faster than jet,, appear and disappear out of clear blue sky. I would like to report a UFO sighting which my husband and I had this afternoon, February 28, 2013, approximately 3:30 p.m.  Big, puffy, white clouds and blue sky.  Bright sunshine. We were sitting outside at our picnic table, talking. I was drinking iced tea, he had beer, and we enjoying the warm, sunny weather, when I commented on the jet passing over our heads.  It seemed to be rather low, or very large.  As we were looking up, He said, \"There's an object!!\" and pointed.   I looked up, and didn't see anything unusual, \"Where?\"  \"There!!!  An object!!\"  I squinted and looked harder, and my eyes fell upon a tiny, silvery white spot in the blue sky, just on the edge of a cloud.  \"Wow!  What is it?\" \"I don't know!!\" So, I jumped up and ran in for the 2 binocular cameras we have for bird watching. When I came out, it was still there.  The cloud had moved, but the object was in the same spot.  We each took a camera and tried to focus on the shiny object.   We could see it better, but it was still only a shiny round sphere, hanging in the sky.  It was not bouncing or moving and appeared too large to be a mylar balloon.   When I tried to click a photo of it, my batteries were dead, same with the other camera!  That's when another commercial jet came from the north.   I jumped up to run into the house to grab my Canon Rebel with 300 zoom lens.   He yells, \"It's going!\",  as I ran into the house. When I came back out carrying the zoom camera, he said again, \"It's going!  It's moving like a bat outta hell!\" I tried to catch it with the zoom lens and focus, but it was moving too fast.  But, I clicked a picture in case it could get SOMETHING.  He exclaimed, \"It's going!\"   When that plane appeared, it took off like a bat outta hell!!  3 times faster than the plane!!\"   Suddenly, another one appeared right behind it, out of the clear blue sky!!  The first one did a \"swoosh\" upward and toward the southeast, and the second one also did a \"swoosh\" upward and to the southeast, exactly like the first!  They disappeared right before our eyes!  He commented, \"They were going 3 times faster than the jet!  Can you believe that?!!  We saw a UFO!!  What do you think of that?!!   All I could say was, \"Cool!!\"",
      "link": "http://www.nuforc.org/webreports/096/S96465.html",
      "state": "NV",
      "duration": "~8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0dce",
      "summary": "Bright Oval object moving slowly over Reno area Early December 2013",
      "city": "reno",
      "shape": "oval",
      "date": "2013-12-23T00:00:00",
      "story": "Bright Oval object moving slowly over Reno area Early December 2013 On December 12 2013 I saw a bright light very close to where Venus starts shining in the evening in the S.W part of the sky.  This was much brighter than Venus as well as much larger and slowly moving from west to east.  At one point it stopped moving for a few minutes and the continued on in the same direction.   I observed it through binoculars and then through my spotting scope.  The video that I got of it is through my spotter using my camcorder.  I am not sure if the video I am sending will show the pattern that was on the object but through my camcorder it is pretty defined.   My son and his stepfather saw it through binoculars from their back yard a couple of miles from my home.   I have never seen anything like it and was hoping someone could tell me what I have seen.",
      "link": "http://www.nuforc.org/webreports/105/S105506.html",
      "state": "NV",
      "duration": "30+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1203",
      "summary": "s meadows ufo sighting.",
      "city": "reno",
      "shape": "triangle",
      "date": "2013-12-12T00:00:00",
      "story": "s meadows ufo sighting As I got off the highway at south meadows parkway, I saw a bright light in the sky thought it was the moon but it looked as if it was slowly turning as it got closer.  The light turned green so I went on.   As I turned onto gateway drive, a little ways up, a lighted object slowly flew over me.  It was real low and no noise so I know this wasnt an airplane, as I drove further I looked back over and the object was gone like it just disappeared.   As it was flying over me I could see small lights flashing in the back, the front of the object wasn't very lit but it appeared to be triangular shaped.   This is the first time I've witnessed this kind of thing, and I'm pretty sure that's what was out there early this morning.",
      "link": "http://www.nuforc.org/webreports/105/S105099.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c158f",
      "summary": "Lights seen hovering over rural Nevada community, witnessed by nearly a dozen residents.",
      "city": "reno",
      "shape": "circle",
      "date": "2013-11-20T00:00:00",
      "story": "Lights seen hovering over rural Nevada community, witnessed by nearly a dozen residents. Three lights were seen in the sky near Reno NV., by approximately 10 people all living in different households.  The objects were high in the sky but very bright and visible with the naked eye. The objects appeared to be rounding (circular) in shape and had glowing rings around each of them.  The light coming off of the circle shaped item was extremely bright and non-reflective.  The center appeared to be dark and almost perfect in shape. The objects appeared to be equal distances from each other forming a large triangle however they did not appear to be connected to each other.  They remained stationary for approximately one hour or slightly less and then disappeared at the same time. One of observer is a retired Air Force member with a law enforcement background.  Others include business owners, a Pharmaceutical Rep, House wife, and a Truck Driver. We have photos of the lights.",
      "link": "http://www.nuforc.org/webreports/104/S104550.html",
      "state": "NV",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c50",
      "summary": "((HOAX))  BRIGHT LIGHT/S OVER EST RENO IN SAT MORNING.",
      "city": "reno",
      "shape": "light",
      "date": "2014-06-13T00:00:00",
      "story": "BRIGHT LIGHT/S OVER EST RENO IN SAT MORRING WORKING LATE AT SHOP THINKING ABOUT UFOS LOCK UP AND U KNOW LOOKING UP IN TO SKY AND I SEE BITE LIGHT OVER THE AIRPORT THINKING A PLANE IN LANDING BUT ITS NOT MOVING DOWN WARD IN FACT IT SEEM TO BE DRIFTING LIKE A LEAF DOWN A BIT AND PULL UP FOR A SEC AND REP SO AFTER A MIN GET IN CAR DRIVE TO CORER STORE GET A DRINK I TAKE NOTE OF WARE I SANDED THE LIGHT IS ALINED WITH THE POWER LINES ON THE  ST  GO IN TO STORE POINT OUT LIGHT GET READY TO GO HOME LOOKING AT LIGHT DRIVING OFF IN SIDE MIRROR AND LOOKS LIKE IT GENE ALTITUDE TURN AROUND PARK SAME SPOT GET OUT AND NOTE LIGHT IS 7-8\" TALLER THAT POWER LINES DOES NOT MOVE GO LIGHT SO FAR AWAY LOOKS LIKE 1 LIGHT PULLS TO 2 AND COMES BACK TO ONE NEXT DAY NO LIGHT IN SAME SPOT ((NUFORC Note:  We are uncertain as to whether this report is intended as a sincere and serious-minded account of a genuine sighting.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110107.html",
      "state": "NV",
      "duration": "55 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d81",
      "summary": "Circular shaped object over Reno.",
      "city": "reno",
      "shape": "circle",
      "date": "2014-06-13T00:00:00",
      "story": "Circular shaped object over Reno. At 12:30 pm PST on 06-06-2014, myself and a friend observed a silver in color circular shaped object above Damonte Ranch area.  It was stationary and approximately 2,000 feet in the air.  The object was near the flight path of a four engine jet, but stayed in the same area not really moving.   We could not get a good view with binoculars so we went about our day with the object remaining in the sky.",
      "link": "http://www.nuforc.org/webreports/110/S110024.html",
      "state": "NV",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1df0",
      "summary": "Strange balloon.",
      "city": "reno",
      "shape": "oval",
      "date": "2014-06-04T00:00:00",
      "story": "Strange bright orb in the sky ongoing for two days.  Rirst spotted in lake Tahoe the day prior, and then again on this date.   When looked at through a 8 inch telescope it appeared to be a strange balloon that did not resemble anything of a weather balloon.   A strange cylinder is located on the bottom of the large modular oval, so i believe it is some strange form of recherche ((sic.  research)) balloon.   If you are in the Reno area i strongly suggest you to check this out because it is strange that it has not moved for what now is 2 days. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109765.html",
      "state": "NV",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e63",
      "summary": "Bright spherical light at 11:00 in clear blue sky. Nearly stationary but upon careful observation it was moving from west to east.",
      "city": "reno",
      "shape": "sphere",
      "date": "2014-06-04T00:00:00",
      "story": "Bright spherical light at 11:00 in clear blue sky.  Nearly stationary but upon careful observation it was moving from west to east.  Far brighter than a daytime star.  This is the second time I have seen it.  2 months ago I noticed it when I observed 4 or 5 people on an outdoor basketball court, all looking up at the object.",
      "link": "http://www.nuforc.org/webreports/109/S109820.html",
      "state": "NE",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2049",
      "summary": "5-8 objects over Reno, NV.",
      "city": "reno",
      "shape": "circle",
      "date": "2014-06-06T00:00:00",
      "story": "5-8 objects over Reno, NV. Using my 20 x 80 Celestron Skymaster binocs, while observing a large 4 engine jet heading south, I saw these objects pass in the opposite direction.   These objects appeared to be moving at the same rate of speed in formation.  The formation was in a broken arrow shape.  Maybe 4 in a line with 2 or 3 offset.  I followed the formation from my chair and saw the offset 2 or 3 objects move ahead of the group to create an almost even line side by side.   The best I can describe them objects is a small can shape.  Shiny and silvery with a white and almost orange bottom.  The skies where clear and sunny.   When I stood to follow the formation I lost view and was never able to find the formation again.  While I could have mistaken weather balloons I've never seen a cluster of balloons.  And I've never seen balloons maneuver like this.",
      "link": "http://www.nuforc.org/webreports/109/S109968.html",
      "state": "NV",
      "duration": "~60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c23bb",
      "summary": "Bright cicularobject/light moving slowly in center of sky, then slowly eastward",
      "city": "reno",
      "shape": "circle",
      "date": "2014-04-04T00:00:00",
      "story": "Bright cicularobject/light moving slowly in center of sky, then slowly eastward Saw neighbor very excited setting up telescope.  Asked if something was going on tonight in the sky.  He said he was setting up telescope to see what the ufo was in the sky.  Pointed to location.  It was in the southern potion of the sky.  Slowly moved to the central potion of the sky.  It was slowly moving north.   Ran into the house to get another camera, saw that it was now slowly (almost drifting) eastward.  Wasn't able to set up our telescope in time.  Recorded it with camera and took pictures.  The camera just caught a circular silverish object that looked as though the setting sun was reflecting on it.   When the sun completely set, we were no longer able to see it.  When looking at it through the close up camera lens, it was circular with black straight lines on the top of the circle and on the bottom of the circle.  Picture a circle in an outline of a square, and erase both the left and right sides of the square, leaving the top and bottom lines over and under the circle.   Didn't hear any noise.   It moved way too slow to be any type of human air vessel.  Moved even too slow to be a satellite. It also wasn't on a straight path.  I've seen satellites many, many times.  I've never seen one look like this.  It was bigger than satellites are and moved just way too slow.",
      "link": "http://www.nuforc.org/webreports/108/S108291.html",
      "state": "NV",
      "duration": "50 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24d7",
      "summary": "V-shaped object hovering over Reno Nevada.",
      "city": "reno",
      "shape": "chevron",
      "date": "2014-11-06T00:00:00",
      "story": "V shaped object hovering over Reno Nevada While standing in the backyard of a rental property my fiance and I were considering. I looked up and saw a slow moving object traversing the sky from east to west.  It was V shaped and looked to be partially yellow in color.  The object seemed to flap sporadically as it moved.  Its altitude seemed the same as the average plane passing overhead.  The object hovered at a certain point for a few minutes before vanishing from sight.",
      "link": "http://www.nuforc.org/webreports/114/S114478.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2722",
      "summary": "12-15 Illuminated objects hovering and flying in formation then shooting upward and disappearing into the sky",
      "city": "reno",
      "shape": "formation",
      "date": "2014-10-03T00:00:00",
      "story": "12-15 Illuminated objects hovering and flying in formation then shooting upward and disappearing into the sky On September 25, 2014, at approximately 1940 hours, I was outside walking my dog, when I heard a teenag boy nearby shout \"Oh my god, look at that!\" as he pointed into the sky.  He was speaking to his friend who was standing next to him and when I looked over they were both looking up in the air pointing.   From where I was standing the trees were blocking by view so I quickly ran over and as soon as I could see the sky, I was blown away, as I initially saw a formation of aircraft moving through the sky; there were approximately 6-7.   I then looked further to the right and saw a second formation in the sky of 6-8 more.  They seemed to temporarily hover in the air and then continue to move sideways through the sky in formation.  They all looked just like a solid bright light and what caught everyone's attention is that they were all flying so close together, or at least closer than an normal aircraft would fly together.   Also, they appeared to be far higher in the air than I had ever seen any aircraft in my life, and that includes my time in the military and and as a civilian.  I have never seen even military aircraft moving in that type of formation.  They were extremely high in the air.  Higher than I believed normal aircraft could fly.   There were two aircraft that were not flying within the formations and were larger and brighter than the others in formations and it was amazing because they would be moving in one direction and then instantly change direction at like 45 degree angles unlike anything I had ever seen and s movement normal aircraft is not capable of doing.  It was not a turn it was an instantaneous pivot in the sky.  Those two appeared to be able to fly more freely but also seemed to be guiding the formations almost like how one man marches a formation of soldiers; he is not part of the formation but he is giving the orders on how they move.  And then there was one other aircraft that was flying out of both the formations, and was also brighter and bigger than the others. At this point I ran over to my house to inform my wife to get me the number for the local press and for the local police (who referred me to your call center).  While she did that I pulled out my ipod and began recording their movements through the sky and narrating the entire experience.  As I looked up I noticed three aircraft that were not in the formations could no longer be seen. I ran back to the two guys who were still there watching.  They explained that the three big and bright aircraft had all disappeared.  They said that two of them had shot up into the air making an X and then disappeared into the sky.  They said the third one simply moved upward quickly and then disappeared as well.   I again went back over to my house and by at this time I could no longer see any of the aircraft.  Then entire incident took what looked like directly over the Reno Airport.  I have never seen anything like this in my life.  I did did not know whether to be amazed or scared as I am not sure what they were doing there.   At this time I do not wish to include my video recording of the event due to the sensitivity of the content.",
      "link": "http://www.nuforc.org/webreports/113/S113888.html",
      "state": "NV",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a11",
      "summary": "Headlight like object over mt rose in Reno, NV.",
      "city": "reno",
      "shape": "light",
      "date": "2014-09-18T00:00:00",
      "story": "Headlight like object over mt rose in Reno nv We were driving to work.  My spouse asked me if I saw what he was seeing.  I look up in the sky over near where the Mt Rose highway would be, and there was this circle of light, almost like you were looking at a car headlight sideways.  It appeared that it was shining light through a smokey sky for about 7 seconds and then it slowly faded away.  I have never seen anything so bright and then to fade away slowly was bizarre. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113464.html",
      "state": "NV",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a6a",
      "summary": "11/10/14 around 10:00pm - V shaped light formation over in west Reno.",
      "city": "reno",
      "shape": "triangle",
      "date": "2014-11-14T00:00:00",
      "story": "11/10/14 around 10:00pm - V shaped light formation over in west Reno My girlfriend and I had just arrived at her house when we exited my car and noticed a set of lights in the sky and looked up towards the west portion of the sky looking towards the Sierra Mountains.  We were around the Raley's supermarket off of Keystone drive.  We saw a \"v\" shaped arrangement of lights moving relatively slowly, the same formation that geese take when in flight.   After about 30 seconds the lights became dimmer and after 10 seconds the lights were completely gone.   I tried to get my camera out but the lights had completely disappeared by then.",
      "link": "http://www.nuforc.org/webreports/115/S115199.html",
      "state": "NV",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3277",
      "summary": "Possible spy satelite over Area 51.   ((NUFORC Note:  Pilot report.  PD))",
      "city": "reno",
      "shape": "light",
      "date": "2015-04-03T00:00:00",
      "story": "Possible spy satelite over Area 51. From FL390 we saw a star like object moving high above.  We asked Oakland Approach what was flying above.  He said \"Nothing on my radar.\"  I concluded that it was a possible spy satelite passing over Area 51.   As the sun was rising it made for a perfect exposure and remained lit while proceding to and from the view of our aircraft.",
      "link": "http://www.nuforc.org/webreports/118/S118095.html",
      "state": "NV",
      "duration": ":20"
    },
    {
      "_id": "64d005f478aba2ec5a3c3697",
      "summary": "Very large, bright white light with smaller bluish green and red lights",
      "city": "reno",
      "shape": "light",
      "date": "2015-02-20T00:00:00",
      "story": "Very large, bright white light with smaller bluish green and red lights To the west of Sun Valley, there was one very large bright white light, and two smaller bluish-green light and red lights toward the bottom right of the white light.  They were extremely high in the sky (from my perspective).  At one point while I was watching I also noticed a red light high above the large white light, like the smaller ones below.  They never moved for at least 30 minutes.   I was on the phone with my daughter, who was on the Reno side, about 10 miles to the west of me, and she was seeing the exact same thing.  But she said she was closer to being underneath them.  I went into the house for a short time, and when I came back out they were gone.",
      "link": "http://www.nuforc.org/webreports/117/S117389.html",
      "state": "NV",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36d5",
      "summary": "The lights where red 3 seperate strips within the craft that where blinking.The craft was west in the sky at the 10 oclock position hov",
      "city": "reno",
      "shape": "rectangle",
      "date": "2015-02-20T00:00:00",
      "story": "The lights where red 3 seperate strips within the craft that where blinking.  The craft was west in the sky at the 10 oclock position hovering not moving, then suddenly dropped in a swift movement unlike a helicopter.  Then hovered, then slowly dropping then darted left at a 45 degree downward angle then stopped quickly, the movement this was making where almost jerky very quick manuvers it excelerated and stopped very percisely.   The lights where to large to be position lights on a plane or helicopter, it came to a sudden stop then dropped while exelerating down toward the ground it appeared as if it was going to crash i could not see the lights it was moving to quickly behind the trees.  This was not like anything ive ever saw I was a aircraft mechanic in the USAF on the SR-71 and 33 dept of defence aircraft and nothing moved like this.",
      "link": "http://www.nuforc.org/webreports/117/S117395.html",
      "state": "NV",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c371a",
      "summary": "Blue ring with red blinking dots inside caught on video moving in the sky in irregular patterns.",
      "city": "reno",
      "shape": "disk",
      "date": "2015-01-07T00:00:00",
      "story": "Blue ring with red blinking dots inside caught on video moving in the sky in irregular patterns. Walking home from work when I saw blue and red blinking lights much like a plane.  It wasn't until it shot across the sky that I took more notice of what it was.   A circle of blue lights with 3 red lights in a triangle formation in the center that blinked at differing intervals.  I'm not sure of the shape because it had definite mass blocking out the stars that did not have lights on it.   It changed direction multiple times at varying speeds before stopping and hovering for a few seconds.   All the lights started pulsing before it moved away out of sight at a faster speed than any plane I've ever seen in the sky.   I caught the majority of the event on video.",
      "link": "http://www.nuforc.org/webreports/116/S116251.html",
      "state": "NV",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3798",
      "summary": "Green saucer sighted over Reno, Nevada.  ((NUFORC Note:  We suspect that the object is a lens flare.  PD))",
      "city": "reno",
      "shape": "disk",
      "date": "2015-02-06T00:00:00",
      "story": "Green saucer sighted over Reno, Nevada. A green saucer was sighted over the Reno Convention Center.  It was moving extremely fast.   A photo was being taken of the moon and the saucer entered the frame and then left. ((NUFORC Note:  We suspect that the object is a lens flare.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117163.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c386f",
      "summary": "Diamond shape large object with 5 smaller objects duration 2 hrs",
      "city": "reno",
      "shape": "formation",
      "date": "2015-01-26T00:00:00",
      "story": "Diamond shape large object with 5 smaller objects duration 2 hrs One very large object diamond shape in the sky SW. It moved horizontally, slightly while one smaller object to its left.  As the large object would move toward it it would back up.  This went on for an hour.   Then 1:00 am 4 other objects speared Below the large craft, quite a bit lower in an upside down T.  They were moving extremely slow.   I fell asleep around 2:00 am.  I was only awake because I have an Injury.  I got up to take an Advil.  I do not take drugs.",
      "link": "http://www.nuforc.org/webreports/116/S116970.html",
      "state": "NV",
      "duration": "2:00 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ac0",
      "summary": "Solid bright orange pulsating moving S and climbing at a low speed, changed direction to SE and steep climb, increased speed.",
      "city": "reno",
      "shape": "sphere",
      "date": "2015-07-17T00:00:00",
      "story": "solid bright orange pulsating moving south and climbing at a low speed, changed direction to southeast and steep climb, increased speed solid super bright orange globe or sphere pulsating like it was burning, but no smoke, and no sound, about the size of a half dollar in the sky, moving at about the speed of a helicopter, maybe slower, then changed direction from going south and climbing to southeast and much steeper climb and increased speed until it got as small as a pin head and out of sight",
      "link": "http://www.nuforc.org/webreports/120/S120310.html",
      "state": "NV",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b0a",
      "summary": "I saw a bright white light shooting across the sky, which at first I thought was a shooting star. Then milliseconds later I saw an obje",
      "city": "reno",
      "shape": "circle",
      "date": "2015-08-06T00:00:00",
      "story": "I saw a bright white light shooting across the sky, which at first I thought was a shooting star.   Then, milliseconds later, I saw an object following behind it at the same speed.  This second object had a red flashing light and two green circles. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120805.html",
      "state": "NV",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b0b",
      "summary": "2 women are frightened by a very loud low flying object, while in their hotel room, watching a lightening storm.",
      "city": "reno",
      "shape": "unknown",
      "date": "2015-08-06T00:00:00",
      "story": "2 women are frightened by a very loud low flying object, while in their hotel room, watching a lightening storm. 8-2-15:  Two women ((initials deleted/40's/female #1)  and ((initials deleted/50's/female #2)) were sitting in their hotel room ((room # deleted)) at the Marriott Residence Inn on Gateway Drive in Reno, NV.  We were watching a large lightning show that had gone on for over 1 hour.  It was very intense, but though there was enormous amounts of lightning; we heard no thunder. At about 1:30 am, our 1st floor room began to shake…we both thought earthquake!  Then we heard a very loud noise like a giant vacuum going very slowly overhead!  We could feel a large amount of energy that made all ((deleted--2nd woman's)) hair stand on end and cause ((deleted--1st woman)) to be nauseous. We looked at each other with wide eyes, and both said simultaneously, “What the hell is that?”  Then a very bright white light appeared outside the window.  The light seemed very low…barely clearing the top of the 2 story hotel.  It was angled down toward the ground.  We thought it was finished going over, but then a second round of the very loud bass sound began crossing the ceiling.  We determined that there were either 2 objects or on very large object with 2 engines.  There was no light accompanying the second sound. Things that were hanging in the room were swaying. ((female #2)) ran outside to see what it was but because of the trees and height of the surrounding hotels was unable to see anything but the light moving very slowly.  She heard what she could only describe as loud mechanical wailing. We waiting to see if we would hear anything else….like the freeway or maybe airplanes.  We did hear those things but it was NOTHING like the fly by experience.  We were freaked out by it. ((female #2)) began frantically texting her husband, who told her to call 911 if anything else happened.  No other strange happenings occurred, so she did not call. The sound was like nothing either had ever experienced before.  ((femal #2)) grew up next to an international airport and is very familiar with the sounds of helicopters, and even fighter jets.  This was neither of those things.  Both women were convinced that it was an aircraft unlike any they knew of. They were shocked.  ((female #1's))((deleted--teen relative) slept through the whole experience. We could find no reason why a helicopter or plane would fly that slow and low over hotels.  We considered that there is an Emergency Room at the Renown Hospital nearby, but this craft did not fit any of our understanding of a typical helicopter.  It was moving extremely slow, and had a constant bass humming sound...no chopper sound at all. There were dogs in this hotel and they were all barking. ((female #2's)) ears were ringing very loudly from the intense sound.  This lasted until she fell asleep several hours later. Neither of these two women have ever experienced anything like this before and both were trying hard to figure out what it could be...in the end, both agree it was either a secret military craft or a UFO",
      "link": "http://www.nuforc.org/webreports/120/S120899.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3da8",
      "summary": "Cluster on 5 objects.",
      "city": "reno",
      "shape": "formation",
      "date": "2015-06-24T00:00:00",
      "story": "Cluster on 5 objects I was driving my car along the 395 North leaving, Reno, NV, on the 14th June, 2015, when I saw 5 silver objects traveling in a cluster between me and a mountain which looked a bit like an asteroid but there was no fumes or smoke.  They were travelling at a steady pace east.   I pulled out my phone and opened the camera and pressed record, but when they were gone, I stopped and then I realized it never recorded.  It recorded me screaming with excitement from when I pressed stop in started recording.",
      "link": "http://www.nuforc.org/webreports/119/S119666.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3df2",
      "summary": "Started my run at 9:40 pm and there was an object in the east sky way too high to be a tower with lights.  It had a yellow light on ea",
      "city": "reno",
      "shape": "disk",
      "date": "2015-07-10T00:00:00",
      "story": "I started my run at 9:40 pm and there was an object in the east sky, way too high to be a tower with lights.  It had a yellow light on each side and had 2 flashing red lights on the bottom.   It was in the sky when I started my run and I didn't think anything of it.  I finished my run about 20 min later and it was in the same spot.   I ran inside to grab a pair of binoculars and when I came back out about 15 seconds later it was gone.",
      "link": "http://www.nuforc.org/webreports/120/S120262.html",
      "state": "NV",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4263",
      "summary": "Did anyone else see this teardrop/egg shaped object in the sky on Valley Road?",
      "city": "reno",
      "shape": "teardrop",
      "date": "2015-04-17T00:00:00",
      "story": "Did anyone else see this teardrop/egg shaped object in the sky on Valley Road? Was walking into work on Valley Road when I noticed something low in the air.   Thinking it was a mylar balloon, I watched it for a second and realized it was not moving.   It was not making any noises and I noticed it was changing colors in the light.",
      "link": "http://www.nuforc.org/webreports/118/S118444.html",
      "state": "NV",
      "duration": "Not Sure"
    },
    {
      "_id": "64d005f478aba2ec5a3c4520",
      "summary": "Odd shaped object",
      "city": "reno",
      "shape": "changing",
      "date": "2015-10-29T00:00:00",
      "story": "Odd shaped object Saw a UFO (time approx. 3:05pm).  Object spotted, saw through study window screen, caught my eye ascending.. guessing about 3-5 ft. across? (possibly 2 objects flying very closely together as it seemed to change shape).  No lights, dark/black in color, about 500? ft away.  Undulating up/down, erratic, moving at a steady rate first ascending then moving horizontally to the left.  Not a plane, bird and it's odd movement ruled out balloons.  Walked out onto my front porch to watch.  Flew behind next door neighbors pine tree.   Went into backyard to reacquire.  No further visual.",
      "link": "http://www.nuforc.org/webreports/122/S122937.html",
      "state": "NV",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c45e1",
      "summary": "Orange star turning color to white.Out of east headed to west toward trukee.",
      "city": "reno",
      "shape": "diamond",
      "date": "2015-11-26T00:00:00",
      "story": "Orange star turning color to white.  Out of east headed to west toward trukee.",
      "link": "http://www.nuforc.org/webreports/124/S124286.html",
      "state": "NV",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4686",
      "summary": "Stealth craft, or UFO?",
      "city": "reno",
      "shape": "triangle",
      "date": "2015-11-19T00:00:00",
      "story": "Stealth craft or UFO? Saw a dark triangular aircraft or ufo gliding silently, slowly, and without any lights, maybe 300-400 feet up, and the thing disappeared mid-air.   Reno has got some super stealth stuff they are testing that can SILENTLY and VERY SLOWLY traverse the skies at very low altitudes and cloak itself into invisibility, or it was a ufo.",
      "link": "http://www.nuforc.org/webreports/124/S124090.html",
      "state": "NV",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c73",
      "summary": "A lot of camera footage to back my siting.",
      "city": "reno",
      "shape": "",
      "date": "2015-09-11T00:00:00",
      "story": "a lot of camera footage to back my siting Heading home from girlfriends, I turned on a street near my house. I noticed an extremely bright star extremely close to earth.  So I recorded it on my lame camera phone for several minutes.   Then I continued home where I filmed it with camcorder and took pics with a really nice minolta. Until it retreated above the clouds where it was visible but much further away.  Then staring at it, I noticed another \"star\" of regular brightness break away from its constellation formation and slowly drift across sky.   Keep in mind this is weeks after I filmed a \"star\" shooting a beam down to earth.  Project blue beam? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121800.html",
      "state": "NV",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e21",
      "summary": "Rumble and slight movement, which caused question of earthquake, inside house.",
      "city": "reno",
      "shape": "unknown",
      "date": "2015-08-13T00:00:00",
      "story": "Rumble and slight movement, which caused question of earthquake, inside house. Did not see as I was inside, but felt a small rumble, which caused me to wonder if it were earthquake.  I stood, pillow fell off chair, then nothing.  Heard report of 2 others in Reno with same, therefore, reporting this.  There was not exactly a sound, but more of a \"sound wave\" experience. Have also in last few months seen \"falling stars\" which were remarkable in time and length, clearly. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120936.html",
      "state": "NV",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4fff",
      "summary": "4-5 UFO's (orange lights) circled around a bobbling circular UFO mothership (white light with a red light on the top or rear)",
      "city": "reno",
      "shape": "circle",
      "date": "2016-02-11T00:00:00",
      "story": "4-5 UFO's (orange lights) circled around a bobbling circular UFO mother ship (white light with a red light on the top or rear) Sighting event:  At approximately 04:30AM PST I went outside to retrieve the morning newspaper.  After exiting my house I noticed a brilliant full moon with some visible stars and scattered clouds in the sky.  The newspaper had not been delivered yet and then I noticed a bright light that appeared to be bobbling and weaving around.  The light had a red light at the rear or on the top of it.  I returned to the house and recovered my 7 x 35 binoculars and went outside again to view the object more.  It continued to bobble to and fro, up/down, and around. It stayed within approximately a quarter mile radius.  While watching the object I observed a dim orange light approach the brighter white light which did not blink or flash.  The orange lights came different directions to the white light, circled around it and then sped rapidly away in many directions.  This occurred during my observation of all objects until I quit watching approximately 05:45 PST.  My spouse a! lso observed the objects. Location of objects:  The bright non-pulsing white light with the red light on the top or rear was located approximately 240 degrees in the Southwest direction from my property.  It appeared to be 15-20 degrees above the Sierra Nevada mountains (Carson Range) above Lake Tahoe.  I estimate the objects to be 10 to 15 miles distance from my property during the sighting.",
      "link": "http://www.nuforc.org/webreports/125/S125692.html",
      "state": "NV",
      "duration": "75 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5180",
      "summary": "White cone shaped object in the early morning sky over Reno, NV.",
      "city": "reno",
      "shape": "cone",
      "date": "2016-02-11T00:00:00",
      "story": "White cone shaped object in the early morning sky over Reno, NV. At approximately 0520 hours, myself and a coworker observed a white dot in the sky with a noticeable white ring encircling it.  This was in the north west sky in the north west part of Reno and the dot appeared to be the size of a star.  As we watched, the dot slowly travelled south across the sky.  As the object moved, the encircling white ring disappeared and we could see what appeared to be a cone shaped white light under the original dot.  The cone looked almost like a spotlight under the dot similar to a lampshade.  The object appeared to be extremely high in the sky, did not blink, and made no sound.  The dot seemed to travel just in front of the cone as though the cone part was trailing.  We looked at the object through binoculars as it continued south and eventually out of sight.  The noticeable cone did not change shape and seemed to be an illuminated solid structure. My coworker and I work nightshift patrol as police officers.",
      "link": "http://www.nuforc.org/webreports/125/S125740.html",
      "state": "NV",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c537d",
      "summary": "We were driving in our BMW going southbound on Veterans and noticed a round green stoplight-shaped light about a mile up in the SE sky.",
      "city": "reno",
      "shape": "circle",
      "date": "2016-01-05T00:00:00",
      "story": "We were driving in our BMW going southbound on Veterans and noticed a round green stoplight shaped light about a mile up in the southeast area of the sky... which appeared out of nowhere then quickly descended straight down and then disappeared out of sight.  We didn't notice any unually noise or sound emminating fron whatever this object was.",
      "link": "http://www.nuforc.org/webreports/124/S124969.html",
      "state": "NV",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c54da",
      "summary": "Black triangle. Only discernible by observing the blotting out of stars. Clearly a very large object.",
      "city": "reno",
      "shape": "triangle",
      "date": "2015-12-10T00:00:00",
      "story": "Black triangle.  Only discernible by observing the blotting out of stars. Clearly a very large object. I can confirm previously reported sighting of triangular shaped object that was either incredibly massive at higher altitudes or around the width of a football field at lower altitudes.  It was completely silent and moved NNW from view until a single story building obscured the view. Object was completely dark, only visible by the triangular shape of the stars being blotted out as it moved beneath them.  This was not a small triangle from my vantage point.  If I held out my hand at arm's length and spread out my fingers, all three corners of the triangle would protrude very noticeably from the outline of my hand.  Triangle was perfect-edged, with no discernible features (such as those found on a stealth bomber).  Movement was slow and steady with no variability in altitude discernible. Spooky.",
      "link": "http://www.nuforc.org/webreports/124/S124591.html",
      "state": "NV",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c54d8",
      "summary": "Black triangle.  Only discernible by observing the blotting out of stars.  Clearly a very large object.",
      "city": "reno",
      "shape": "triangle",
      "date": "2015-12-10T00:00:00",
      "story": "Black triangle.  Only discernible by observing the blotting out of stars.  Clearly a very large object. I can confirm previously reported sighting of triangular shaped object that was either incredibly massive at higher altitudes or around the width of a football field at lower altitudes.  It was completely silent and moved NNW from view until a single story building obscured the view. Object was completely dark, only visible by the triangular shape of the stars being blotted out as it moved beneath them.  This was not a small triangle from my vantage point.  If I held out my hand at arm's length and spread out my fingers, all three corners of the triangle would protrude very noticeably from the outline of my hand.  Triangle was perfect-edged, with no discernible features (such as those found on a stealth bomber).  Movement was slow and steady with no variability in altitude discernible. Spooky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124571.html",
      "state": "NV",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cee",
      "summary": "Blue (like LED light) ball, even speed, heading straight from East  of Reno, heading North  slow then light turned off",
      "city": "reno",
      "shape": "circle",
      "date": "2016-12-05T00:00:00",
      "story": "Blue (like LED light) ball, even speed, heading straight from East  of Reno, heading North  slow then light turned off Outside working on 60 acre ranch, just at dusk dark, look to see , slow and steady light moving, North, not the normal medior streat, it was definatly a \"Blue\" color, like the color of the new LED headlights on cars, in blue, the round object did not, streak fast, or burn up or get lighter, just stayed an even speed, from me looking East, it was  heading North direction, then just \"turned off\" definatly not a normal comet, as i have seen thousands, i work livestock tending at nights all the time, out North of Reno, Nevada. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131245.html",
      "state": "NV",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fd5",
      "summary": "The unidentified objects seem to have a black bottom, white top in color. There were 15 to 25 traveling upward in a helix  pattern",
      "city": "reno",
      "shape": "",
      "date": "2016-10-11T00:00:00",
      "story": "The unidentified objects seem to have a black bottom, white top in color. There were 15 to 25 traveling upward in a helix  pattern Family traveling to church observed what was thought to be birds traveling upward then noticed this was not birds (because they were super big  in the perspective of sizes that were normal every day objects like light posts and Trees.)  The unidentified objects seem to have a black bottom, white top in color.  There were 15 to 25, even possibly 35 or more traveling rapidly upward.  They kind a look like straight stiffed winged and round pelican like body shaped.  Traveling rapidly upward in a helix like pattern.  Finally thier formation ended up in a diamond or 2 triangle patterns, then they eventually became translucent. Then disappeared out of the atmosphere.",
      "link": "http://www.nuforc.org/webreports/130/S130405.html",
      "state": "NV",
      "duration": "1:34"
    },
    {
      "_id": "64d005f478aba2ec5a3c6285",
      "summary": "Triangular light siting in the north east skies over Reno NV",
      "city": "reno",
      "shape": "light",
      "date": "2016-09-09T00:00:00",
      "story": "triangular light siting in the north east skies over Reno NV I had just finished setting up my 8 inch Celestron telescope and assembling my other night viewing equipment.  Celestron Skymaster binoculars and my 10x50 Nikon binoculars.,chairs and multiple wireless devices. I usually allow 30 to 45 minutes for my eyes to adjust to the dark however this event took me bu surprise. As I settled into my seat and started scanning the evening skies out of the dark 3 brilliant glowing white lights suddenly appeared. No slow build in intensity they just appeared. The 3 lights were in the shape of a perfect triangle. One on the top and two forming the bottom line of the triangle. My first thought was how interesting it is that 3 satellites suddenly appeared. I picked up my Nikon binoculars and focused on all 3. As I watched all 3 moved in a uniform pattern and never moved from the triangle shape they appeared in. My best guess is they appeared approximately 25 degrees above the skyline and close to 38 degrees north north east. As the triangle moved to the east the light intensity was consistent and brilliant. I continued to observe the 3 uniform lights for approximately 10 more seconds. By this time the lights rapidly faded to black at around 58 degrees north east. And as quickly as they appeared it's like someone hit the light switch. All 3 disappeared. Mr. Davenport, I perform this ritual nightly and have done so for at least 15 years. I know what satellites look like...I understand the way they move through the night skies and slowly faded out of view as the sun reflection passes. I'm not saying this was a UFO but I am saying I've never seen 3 satellites fly in formation and disappear all at once. Very bizarre event over the Northern skies of Reno NV. Take care sir!",
      "link": "http://www.nuforc.org/webreports/129/S129709.html",
      "state": "NV",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c65fa",
      "summary": "Looking south from Reno, object \"floating,\" with long trail from west to east.  ((NUFORC Note:  Space debris.  PD))",
      "city": "reno",
      "shape": "other",
      "date": "2016-08-02T00:00:00",
      "story": "Looking south from Reno, object &quot;floating&quot; with long trail from west to east. Amendment to my previous report, object flying or floating through air west to east, after hearing reports that it was seen in Southern California, I originally thought it was over towards the Reno Intl Airport, however, my view is due south and it makes sense this item was over SoCal as there was no depth perception to compare to.  Only that the object was travelling too slow to be considered an aircraft.  Object also produced a trail that could be seen in the darkness. ((NUFORC Note:  Space debris.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128850.html",
      "state": "NV",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c65ff",
      "summary": "Two large fireballs streak across the sky over Reno, NV.  ((NUFORC Note:  Space debris.  PD))",
      "city": "reno",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "Two large fireballs streak across the sky over Reno, Nevada. Just 15 minutes ago, (at around 9:40 p.m) I was sitting in my apartment and just happened to look outside my window and saw 2 large orange fireballs with long tails slowly streak across the Reno, Nevada sky.  They were coming from the soutwest and heading north east very close to the horizon. One was a good distance behind the other but traveling at the same speed and appeared to be the same size. I did not hear any sound. I watched them for a good 40 seconds then left to find my camera. By the time I returned they were gone. Kinda spooky but exciting at the same time. First time I've ever seen anything like that. Wierd. ((NUFORC Note:  Space debris.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128830.html",
      "state": "NV",
      "duration": "40 seconds+"
    },
    {
      "_id": "64d005f478aba2ec5a3c65f9",
      "summary": "Bright, west to east flight over Reno airport, craft with &quot;tail&quot; of something not as bright as fire.",
      "city": "reno",
      "shape": "other",
      "date": "2016-08-02T00:00:00",
      "story": "Bright, west to east flight over Reno airport, craft with &quot;tail&quot; of something not as bright as fire. Flying west to east, appeared to fly towards Reno International Airport but too high for landing approach. craft of some sort had a \"tail\" that appeared to be like a fire tail, but not that bright.  Seems to be twisting somewhat, slow like an aircraft. but the \"tail\" made it appear not like an aircraft. ((NUFORC Note:  Space debris.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128838.html",
      "state": "NV",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c68ca",
      "summary": "Flying building with about 10 floors of yellow gold lights and red & green lights at the bottom",
      "city": "reno",
      "shape": "rectangle",
      "date": "2017-04-07T00:00:00",
      "story": "Flying building with about 10 floors of yellow gold lights and red & green lights at the bottom Saw from afar a bright white light approaching above my home.  When it came closer above me it looks like a flying square building with about 10 floors of yellow gold lights and red and green lights at the bottom.  Didn't have chance to take video as it happened so fast!",
      "link": "http://www.nuforc.org/webreports/133/S133396.html",
      "state": "NV",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ab2",
      "summary": "I had just left work and was driving on west on W. Fourth Street in Reno. I pulled into Taco Bell and I noticed these 3 red lights drif",
      "city": "reno",
      "shape": "unknown",
      "date": "2017-02-10T00:00:00",
      "story": "I had just left work and was driving on west on W. Fourth Street in Reno.  I pulled into Taco Bell and I noticed these 3 red lights drifting in the air.  They were in alignment one on top of the other and were slowly moving south and up.  They looked mysterious to me.  After I left the drive thru at Taco Bell I noticed a car with two men outside of it and they were looking in the sky.  I said to them, “Oh, you saw those too?”  One guy said, “ya, there was three of them, but they left, this is the last one.”  I drove up a bit so I could get out of the lights because I wanted to take a video.  I took a video and then watched it for a while and left.  It gradually faded and kept going up and to the left. Thank you, I am a Coast listener and I will send you the video if you’d like.  Please let me know.",
      "link": "http://www.nuforc.org/webreports/132/S132445.html",
      "state": "NV",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7132",
      "summary": "Large flashes of light, followed by distant explosion noise going on for almost an hour.",
      "city": "reno",
      "shape": "unknown",
      "date": "2017-07-27T00:00:00",
      "story": "Large flashes of light, followed by distant explosion noise going on for almost an hour. At around 1:35 in the morning, flashes of bright light started appearing outside in intervals.  They would occur around every 5-7 minutes, and would fill up my whole room, along with all of outside.   Around 20 seconds after the lights appeared a loud but distant explosion-type noise could be heard.  This went on until around 2:10 AM.   The lights have not occurred since and I was only able to fully witness the last two.  It could not have been a lightning storm, because it has been clear all day, and fireworks would not have been bright enough.",
      "link": "http://www.nuforc.org/webreports/135/S135332.html",
      "state": "NV",
      "duration": "~40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c71f0",
      "summary": "Was outside my apt complex and noticed an extremely bright dot in the sky thats never been there before. It moved up and down and I cau",
      "city": "reno",
      "shape": "changing",
      "date": "2017-07-23T00:00:00",
      "story": "Was outside my apt complex and noticed an extremely bright dot in the sky that's never been there before.  It moved up and down and I caught it all on film.  It dimmed in and out.  It finally moved down and almost disappeared behind my building, but I backed up and lifted my phone it got very very bright directly st me then, disappeared completely",
      "link": "http://www.nuforc.org/webreports/135/S135281.html",
      "state": "NV",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c73e4",
      "summary": "The UFO was a translucent somewhat spherical shape and it seemed to be just floating in the sky - not really moving.  It was almost dir",
      "city": "reno",
      "shape": "sphere",
      "date": "2017-06-09T00:00:00",
      "story": "The UFO was a translucent somewhat spherical shape and it seemed to be just floating in the sky--not really moving.  It was almost directly overhead at about a 75 degree angle of elevation and slightly south southeast of us.  There was just one object. ((NUFORC Note:  Source of the report provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134452.html",
      "state": "NV",
      "duration": ">1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c73e3",
      "summary": "At approximately 7:00 p.m. we observed a large oval light directly over our Hotel near Reno/Tahoe Airport.",
      "city": "reno",
      "shape": "oval",
      "date": "2017-06-09T00:00:00",
      "story": "Location:\t  ((address deleted))  Plumb Lane \t\tReno, NV 89502   At approximately 7:00 p.m., we observed a large oval light directly over our hotel near the Reno/Tahoe airport.  The oval light appeared to move slightly and vary in brightness during our observation.    We estimate the object to have been at least 50,000’ in altitude and possibly much higher.  We estimate the size of the object to have been similar to a “tic tac” held at arm’s length.  The weather conditions were clear, although very windy.  The wind was blowing west to east at approximately 40 mph.  We were facing due south and object could be seen at an approximately 70 degree angle above our position.  It did not produce any sound. When we first noticed the object, the sun had not yet set, and the object was very large and very bright.  We initially thought it could have been helicopter or drone hovering over the nearby I-580 freeway.  However, this explanation was disproved when an airliner, flying at cruise altitude with the corresponding contrail, flew underneath the object.  We continued to observe the object for approximately 40-60 minutes.   As the sun set the light appeared to increase in altitude, dimming while doing so, and moving towards the east opposite the normal rotation of the earth and the rising moon/ stars.  By the time the sun had completely set the light appeared to be a normal star in size and brightness.  However, when I used the SkyView app on my phone the object did not correspond to any star, constellation, or satellite in the app’s database. I did manage to take one photograph of the light using my cell phone after numerous attempts.  However, the photo is not as detailed as our view while looking at the object.  We have no idea what it was.",
      "link": "http://www.nuforc.org/webreports/134/S134472.html",
      "state": "NV",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c73f0",
      "summary": "I noticed a white spot in the sky far higher than balloons or kites. I grabbed binoculars and I could tell that the spot was a lit ring",
      "city": "reno",
      "shape": "circle",
      "date": "2017-06-09T00:00:00",
      "story": "I noticed a white spot in the sky, far higher than balloons or kites.  I grabbed binoculars and I could tell that the spot was a light ring, like a circular fluorescent light.   Two commercial planes passed beneath the white ring and they appeared smaller than the ring.  The curious thing was that the ring did not move at all. . . Anything I know to be that high in the air moves at least a little bit, even a hovering helicopter or a tethered balloon.   I measured this object from my roof for 20 minutes and it did not move a slight amount.  I have been watching it for about an hour and no movement.  While it is hard to see beyond the light ring with my binoculars, it kind of appears that there is a metallic body in the center.   I had my wife and two children see it as well.  I took a picture with a cell phone magnified 8 times so it is clear to see the dot, but not magnified enough to see the light ring in the image.   Wish I had more powerful zoom equipment - do you have any resources? ((NUFORC Note:  Photo shows a small, white \"blob\" in the daytime sky.  We do not see the \"ring\" shape, indicated by the source of the report.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134454.html",
      "state": "NV",
      "duration": "1 hour +"
    },
    {
      "_id": "64d005f478aba2ec5a3c761a",
      "summary": "Low fast flying lights in circular formation.",
      "city": "reno",
      "shape": "circle",
      "date": "2018-01-12T00:00:00",
      "story": "Low fast flying lights in circular formation. 3 perfectly spaced out lights in a circular formation making what appeared to be a dark saucer-like shape.  Flying vet fast and very low.  Very weird, loud, consistent sound coming from the sky while it was passing.",
      "link": "http://www.nuforc.org/webreports/137/S137939.html",
      "state": "NV",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c77f6",
      "summary": "Undefined shaped object with vertical bars of white/red/green flashing lights traveling silently across Pyramid lake from south to west",
      "city": "reno",
      "shape": "unknown",
      "date": "2017-11-03T00:00:00",
      "story": "Undefined shaped object with vertical bars of white/red/green flashing lights traveling silently across Pyramid lake from south to west Wed. October 18th 5:10 AM Pyramid Lake, Reno, Nevada  While walking the dog, I saw a flash of light out of the corner of my eye and assumed it was a shooting star.  I expected to see it burn up upon entry into atmosphere.  Instead there were two bright vertical lights in the distance over the lake.  They appeared to hang there for several minutes.  As the lights approached I could see there were actually three large landing type lights in a vertical row.  As the ‘thing’ turned I could now see several red flashing lights and a couple of green pulsing lights behind them.  What was odd was that they were all vertical and nothing horizontal.  There was not a sound coming from that direction.  As a commercial airline  pilot for 36 years I could not imagine what kind of aircraft could have this light formation and move so quietly.  It traveled horizontally across the lake from south to northwest over the Sierras at a fairly rapid rate.  As it was totally dark out, I could not discern any shape behind the lights.  The distance and altitude would be hard to tell although I could see a glow on the lake from the lights, like you can when the moon is bright and shining on water.  I could also see a faint shape of distant mountains behind and above the object.",
      "link": "http://www.nuforc.org/webreports/136/S136877.html",
      "state": "NV",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7911",
      "summary": "Reno north valleys red rock orbs n ovel eggs. can see many each nite",
      "city": "reno",
      "shape": "oval",
      "date": "2017-11-03T00:00:00",
      "story": "Reno north valleys red rock orbs n ovel eggs. can see many each nite Multiple sitings north valleys reno.  many over stead airport most activity north reno. Colerful red white green blinking ovals n picture silver orb zoomed in three lights but lights circled horizontally.  Have seen large oval egg lights whitish lining eggs shape.  Slower raising in sky n back and fourth before drifting silently n brisk over to south area. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136890.html",
      "state": "NV",
      "duration": "Fon off 3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c796f",
      "summary": "MULTIPLE LIGHTS OVER RENO HEADING EAST",
      "city": "reno",
      "shape": "light",
      "date": "2017-12-04T00:00:00",
      "story": "MULTIPLE LIGHTS OVER RENO HEADING EAST AT APPROXIMATLY 830 PM, MYSELF AND SON WERE WALKING TO THE STORE AND I NOTICED SOME LIGHTS BUNCHED TOGETHER BEHIND A TREE AND ALSO A PLANE TAKING OFF FROM THE AIRPORT BUT AS I LOOKED AT THE LIGHTS LONGER I NOTICED THAT THEY WERE SIDEWAYS TILTED A BIT.   THERE WAS THREE OF THEM AND I WATCHED AS THE DEPARTING PLANE WENT UNDER THEM AND THEN THEY HEADED DUE WEST AT A INCLINATION.   THE TWO BOTTOM ONES DISAPPEARED, BUT THE BRIGHT ONE HAS A BRIGHT ORANGE LIGHT ON TOP AND BLUE AND RED PANELS DRAPED OF THE SIDES.   IT STAYED AT THE INCLINED POSTION FOR ABOUT 15 MIN BEFORE IT MOVED TO THE RIGHT ABOUT 12 DEGREES... I ALSO SAY A GROUP OF MUCH SMALLER ONES DIRECTLY IN THE PATH AND FOLLOWING IT AS IT WAS MUCH FARTHER THEN THE ATMOSHPHERE BY NOW.",
      "link": "http://www.nuforc.org/webreports/137/S137500.html",
      "state": "NV",
      "duration": "1 hour+"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cc1",
      "summary": "round saucer /red and green purple lights.purple glow around it.staid in one spot for one hour and a half no movement.",
      "city": "reno",
      "shape": "disk",
      "date": "2017-09-28T00:00:00",
      "story": "round saucer /red and green purple lights.purple glow around it.  staid in one spot for one hour and a half no movement. ((NUFORC Note:  We suspect a \"twinkling\" star, possibly Arcturus.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136381.html",
      "state": "NV",
      "duration": "west sky"
    },
    {
      "_id": "64d005f478aba2ec5a3c7df6",
      "summary": "Hi, I’m a huge skeptic who wants to believe, and I think I just saw the stereotypical orb of fire. I was sitting on my porch, just star",
      "city": "reno",
      "shape": "",
      "date": "2018-05-31T00:00:00",
      "story": "Hi, I’m a huge skeptic who wants to believe, and I think I just saw the stereotypical orb of fire.   I was sitting on my porch, just staring and it looked like it sped up from the ground, and with a falling leaf pattern but going up, it slowly floated up and away.   I filmed it as much as I could, but I’m pissed that my video does not do it justice, because it was an orangish ball of flickering fire, which only looks like a lil orb of light in the video.  I freaking out about how surreal this is, and want to say that this is not a hoax, I love this kinda stuff and hate people who hoax because they cloud the truth.   I did a couple instagram stories that I would love to send but in the end, it kinda looks like normal sky lights, but I wish I could have captured it when it was doing this ascending zig zag. ((NUFORC Note:  We have amended the time and date of the alleged sighting, based on our telephone conversation with the witness.  We were impressed by his apparent sincerity about the alleged sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141544.html",
      "state": "NV",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7eb1",
      "summary": "Four glowing cirlces low in the sky in south Reno.",
      "city": "reno",
      "shape": "circle",
      "date": "2018-05-10T00:00:00",
      "story": "Four glowing cirlces low in the sky in south Reno. I had just arrived home from work around midnight, from May 4 going into May 5.  Low in the sky, over my neighborhood in South Reno, I saw a bright red light in the sky toward the west and a little north.  The light seemed more to radiate, like heat or energy. It wasn’t a steady solid “lightbulb” type of light.  It moved, sometimes hoovering, from north to south, before moving up at a 45-degree angle and dimming out high in the sky.  This lasted about a minute.  A second or two after this first light disappeared, three more (identical) appeared, in the same general section of sky as the first.  Two of these lights traveled as a pair, a little higher in the sky than the first one, and the third lagged a little lower than the others.  However, they moved across the same section of sky from north to south, hoovering a little and moving slowly before taking the same angular rise and dimming out.  This lasted about 2 to 3 minutes.  There was no noise, no humming or engi! ne sound.  The light was steady, though it moved like it was “radiating”.  My background: I am college educated, have worked for a major airline, and as an EMT.",
      "link": "http://www.nuforc.org/webreports/139/S139731.html",
      "state": "NV",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8310",
      "summary": "Unlit, silent, slow hovering chevron shaped craft",
      "city": "reno",
      "shape": "chevron",
      "date": "2018-11-09T00:00:00",
      "story": "Unlit, silent, slow hovering chevron shaped craft. Was out running, looked up and saw a dead silent chevron or boomerang shaped craft with no lights.  It looked like a very graceful, gigantic bird gliding slowly from east to west.   After seeing it the first time I kept looking up and either the same craft again or saw another one exactly like the first.  The second sighting was approximately 3 minutes after the first sighting.",
      "link": "http://www.nuforc.org/webreports/143/S143672.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c89a5",
      "summary": "Silent lights spiraling above Reno NV in clear night sky",
      "city": "reno",
      "shape": "light",
      "date": "2019-09-06T00:00:00",
      "story": "Silent lights spiraling above Reno NV in clear night sky I was sitting on my back porch listening to the radio and night sky watching when I observed what at first appeared to be a shooting star.  The light traveled from my left to my right about 5 degrees above the hilly horizon which site North East to East of my home.  The speed was much slower than a shooting star.  The light wasn't sharp or bright brilliant it was as if it was below the surface of the water or behind dairy glass.  It was only a white light as there were no green or red lights which you would see on an aircraft.  No engine noise at all, completely silent.  As the light moved left to right it passed behind a large tree.  Expecting it to come out from behind the tree, I looked to the right side of the tree.  It didn't come back into view.   I then observed the same blurred light flying back to the left and spiraling in a clockwise motion and climbing.  Then the light moved back in a right direction which is south.  Again I see it spiral back to the left and upward.  Now I'm thinking this is not a normal event and I glance down at my table and look for my phone.  I wanted to capture a few pictures if possible.  This is where I lost track of the light.  I didn't see it again.  This entire event lasted maybe 5 to 10 seconds.  I was unable to see a shape only the muted white glow. Thinking about this it was similar to watching a large spotlight on clouds.  However the night skies were absolutely clear..no fog, clouds...no haze or smoke present.  An absolutely beautiful night sky where the Milky Way was so clearly observed.  I'm at a complete loss trying to make logical sense of this sighting.",
      "link": "http://www.nuforc.org/webreports/148/S148452.html",
      "state": "NV",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a62",
      "summary": "At about 30,000 feet two white spheres flew across the sky.  I was laying on a bench outside of the Patagonia.  ((anonymous report))",
      "city": "reno",
      "shape": "sphere",
      "date": "2019-09-06T00:00:00",
      "story": "At about 30,000 feet two white spheres flew across the sky.  I was laying on a bench outside of the Patagonia DC out on 4th street.  One flew by and I jumped up to see it better and it disappeared behind a tree.  I laid back down on the bench and another flew by not to long after.  Same thing.  I hopped up and lost it behind the tree. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148535.html",
      "state": "NV",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d6e",
      "summary": "I was driving on I-80 West just before the MnCarren exit and noticed a metallic oval shaped object hovering about 50 feet off the groun",
      "city": "reno",
      "shape": "egg",
      "date": "2019-01-04T00:00:00",
      "story": "I was driving on I-80 West just before the McCarren exit and noticed a metallic oval shaped object hovering about 50 feet off the ground on the South side of the freeway.  I was driving so I couldn't get a great look but it looked to be about the size of a large S.U.V..   I was unable to stop to take pictures or get a better look because I was on my way to an important meeting.   When driving back about 2 hours later the object was no longer there.  After reading there were other siting in Reno on the same day I decided to share.",
      "link": "http://www.nuforc.org/webreports/144/S144231.html",
      "state": "NV",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ed4",
      "summary": "I was in my back yard and I looked up in the sky. About 30,000 feet I saw two spheres flying in formati",
      "city": "reno",
      "shape": "sphere",
      "date": "2018-12-14T00:00:00",
      "story": "On July 28, 2018   South Reno:  I was in my back yard and I looked up in the sky. About 30,000 feet I saw two spheres flying in formation easily the size of a jumbo jet in diameter.  They were flying in formation at an incredible speed coming from the north by north west on a southern trajectory.  They were gone in less than 7-8 seconds.  I also saw in the north an airline aircraft going west to east.  I calculated the airliner was going in the area of 475-500 m.p.h. I used that rough calculation to estimate the speed of the spheres at 4-5 times the speed of the airliner.  They looked very much like large pearls.  They made no noise.",
      "link": "http://www.nuforc.org/webreports/144/S144056.html",
      "state": "NV",
      "duration": "7-8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f38",
      "summary": "V shaped lights swirl and disappear.",
      "city": "reno",
      "shape": "changing",
      "date": "2018-11-24T00:00:00",
      "story": "V shaped lights swirl and disappear. I was getting out of my friends car in DT Reno and happened to look up to the east.  I noticed 5 white lights in perfect V formation traveling N/NE.  Initially I thought it was a large plane making an aggressive turn into the airport, but the angle of the V was perfect 90 degrees and it was very large.  I’m kind of a plane nerd, so I pointed it out to my group of friends how odd it was and as I did this it changed shape. The five lights began swirling around each other and made a spiral then quickly faded and disappeared.  I began yelling about it but none of my friends seemed interested.  I guess they’ve all seen ufo’s before.",
      "link": "http://www.nuforc.org/webreports/143/S143844.html",
      "state": "NV",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f8e",
      "summary": "Round shape with hazy glow hovering.",
      "city": "reno",
      "shape": "circle",
      "date": "2018-11-24T00:00:00",
      "story": "Perfectly round shape with hazy glow hovering mid high in the sky.  After approximately a minute, it shot to the right in a streak and disappeared.  It was so fast I could hardly keep eyes on it.",
      "link": "http://www.nuforc.org/webreports/143/S143768.html",
      "state": "NV",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c9789",
      "summary": "10-12 equally spaced white &quot;stars&quot; moving in a linear formation.  ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "reno",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "10-12 equally spaced white &quot;stars&quot; moving in a linear formation At approximately 0530 on 24 November 2019, I observed approximately 10-12 white \"stars\" moving from the Southwest to the Northeast in a perfect linear formation.  All of the \"stars\" were equally spaced between each other and traveling at a constant speed.  There was one \"star\" on the left flank of the formation approximately 8 \"stars\" back from the lead \"star.\"  There were no blinking lights observed, as they were all a constant star-like coloration.  The weather conditions were clear and no sounds were heard.  I am a retired military officer (23 years).  Based upon my extensive military experience, I am 100% confident that this was NOT a military aviation formation, as the speed of the \"stars\" and number of craft observed do not support a military aircraft scenario",
      "link": "http://www.nuforc.org/webreports/150/S150983.html",
      "state": "NV",
      "duration": "45 seconds"
    }
  ]
}