{
  "city": "richmond",
  "fetch_timestamp": "2025-07-12T14:36:25.240360",
  "record_count": 167,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4447",
      "summary": "Triangular object travelling at very high speed with three light with no audiable sound = UFO?",
      "city": "richmond",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "Triangular object travelling at very high speed with three light with no audiable sound = UFO? A very quiet and clear sky night with lots of star in the sky. I was smoking outside of my house looking up the sky to check out the beautiful sky. I saw an (triangular) object with 3 dim lights travel at a rather high speed from east to west. I live rather close to the airport so I can tell what kind of normal airplane speed looks like up in the sky. What I saw was a high speed UFO with three dim lights travelling at a high speed without any audiable sound. I waited for at least for another 10 secs to see if sound can be heard. There was absolutely no sound. I couldn't really see the shape of the object because the it was dark but I certainly saw three dim lights with identical intensity.",
      "link": "http://www.nuforc.org/webreports/050/S50019.html",
      "state": "BC",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4577",
      "summary": "Took place near fairgrounds. I was outside at work and happened to look up at the sky. I saw a white light that was way too low to be a",
      "city": "richmond",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "Took place near fairgrounds. I was outside at work and happened to look up at the sky.  I saw a white light that was way too low to be a plane or street light.  It moved very quickly from left to right in a fast diagonal movement.  The light disappeared after it moved.",
      "link": "http://www.nuforc.org/webreports/147/S147856.html",
      "state": "IN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4585",
      "summary": "Took place near fairgrounds. I was outside at work and happened to look up at the sky. I saw a white light that was way too low to be a",
      "city": "richmond",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "Took place near fairgrounds.  I was outside at work and happened to look up at the sky.  I saw a white light that was way too low to be a plane or street light.  It moved very quickly from left to right in a fast diagonal movement.  The light disappeared after it moved.",
      "link": "http://www.nuforc.org/webreports/147/S147855.html",
      "state": "IN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4587",
      "summary": "a triangular object, one light on each point, size of football field escorted by VERY LOUD fast moving chopper going east.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2019-08-23T00:00:00",
      "story": "a triangular object, one light on each point, size of football field escorted by VERY LOUD fast moving chopper going east. a triangular object, one light on each point, light orange/white hue light color, about the length of a city block in size, almost translucent undercarriage tilting or banking slightly as it moved forward being followed or escorted by a black, fast moving, VERY LOUD, helicopter. going exactly East in direction, towards the ocean/quantico/washington DC. for the helicopter being so immensely loud, the sound came out of nowhere about 3-5 seconds before it came from behind a low two story brick building in church hill. the two were flying very low but moved at an incredible speed which covered 12 miles in 5-8 seconds. the ufo disappeared before the helicopter did.",
      "link": "http://www.nuforc.org/webreports/147/S147877.html",
      "state": "VA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b04",
      "summary": "Bright round or oval dots moving in straight line over Wayne Co., IN.  ((NUFORC Note:  String of Space Link satellites.  PD))",
      "city": "richmond",
      "shape": "light",
      "date": "2019-06-07T00:00:00",
      "story": "Bright round or oval dots moving in straight line over Wayne county indiana   , 2 flights  one after the other. I first saw a falling star.  I thought I might see some more so I looked up for a few more seconds.  I thought I was seeing one but then noticed one following it, followed by another and so on, New they  couldn't be  falling stars.  They seemed to be traveling at regular intervals in a straight line.  Bright, a few brighter or somewhat larger than others, seemed to be very high possibly Going through some high clouds at times and moving very fast.  I was considering not reporting this but I believe I have witnessed something rare.  P.S,  The falling star was moving east to north; the objects were moving west to east. Hope some one else saw them. ((NUFORC Note:  String of Space Link satellites.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146550.html",
      "state": "IN",
      "duration": "~8-9 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4b65",
      "summary": "Saw an odd moving light in the night sky, blinking in an odd fashion before it disappeared.",
      "city": "richmond",
      "shape": "flash",
      "date": "2019-07-05T00:00:00",
      "story": "Saw an odd moving light in the night sky, blinking in an odd fashion before it disappeared. I was stepping out to get something out of my vehicle when I noticed first what seemed like a flash of light similar to a beam from a lighthouse from the corner of my eye. I looked up into that direction, which was northward, and then I didn't see anything. Moments later, I saw a light light up in the sky moving northward. After the light was on for maybe 3 seconds it went out. I assumed it was an airplane at first oh, but I didn't see the static red light. I know the fixed red light is on all airplanes, I worked in Navy aviation so that's normally the first thing that I would see on a plane that is flying at night. After another three or four seconds having not seen the light come back on, it did again but it only remained lit for maybe another half of a second. After the light disappeared the second time, I did not see it again. I have not ever seen an aircraft where the lights acted that way, so I felt very suspicious about it. There were no clouds in the! area where I was looking at, I was able to see all of the other stars around the light that I saw. And the light appeared to be larger than the Stars, and it was a very dull yellow almost white light.",
      "link": "http://www.nuforc.org/webreports/147/S147161.html",
      "state": "VA",
      "duration": "~10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e72",
      "summary": "Abduction of myself and my child, age 5. We were lucid dreaming and grabbed out of our solar plexus (stomach area)and ended up in front",
      "city": "richmond",
      "shape": "changing",
      "date": "2019-04-08T00:00:00",
      "story": "Abduction of myself and my child, age 5.  We were lucid dreaming and grabbed out of our solar plexus (stomach area)and ended up in front of a group of Grey Reticulans.  I watched them shape shift and one decided to appear before me, and pointed to my right ear.  my son was with me and saw it happen as well.  I was terrified, and started to quickly speak scripture.  I am not sure why I did that, but these beings dropped both of us as soon as I started to pray.   My son is harassed constantly.  I have had other occasions of being abducted, this was probably my 3rd abduction, his first.  However this was different, as I was able to get out of it by speaking psalms 23.  When I woke up, I was in a teepee shape in my bed...my back arched. I hit the bed so hard that I fell off the bed.  My son repeated our experience to a T, as he was with me.   I have also been taken with an ex marine whom has the same sun and moon sign as me, as well as a very similar natal chart.  These are d! emons.  There is nothing good in this situation.  I have connected it to CERN.  It has happened in August 3 times for me in my life, and it is only getting worse.  It happens around the retrograde.  There was also a violet flame light frequency.  Our electricity went out after that.",
      "link": "http://www.nuforc.org/webreports/145/S145403.html",
      "state": "VA",
      "duration": "3 days"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f63",
      "summary": "I saw the light zoom across the sky faster than i’ve ever seen anything travel.  ((anonymous report))",
      "city": "richmond",
      "shape": "light",
      "date": "2019-04-18T00:00:00",
      "story": "i was on my way to deliver a pizza to a nursing home and i saw the light zoom across the sky faster than i’ve ever seen anything travel in my life and after several seconds it disappeared ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145664.html",
      "state": "KY",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b50ef",
      "summary": "Circular shaped, glowing object, hovering but moving slowly, then  traveling at a speed of at least thousands of mies per hourl",
      "city": "richmond",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "Circular shaped, glowing object, hovering but moving slowly, then  traveling at a speed of at least thousands of mies per hourl In December, 1969, four of us--three 18 year old college  students and one professional, were traveling south on Interstate 75, returning home after a University of Kentucky basketball game.  South of Richmond, but north of Berea.  All four of us saw an object overhead, directly in front of us, with an apparant altitude of a few hundred feet.  The size cannot be estimated because the actual altitude could not be determined, as there were no clouds or hills, mountains, etc., behind the object..  The object was round, and glowing with a white color, giving an appearance similar to that of a floresent light, but round, i.e. a circle shape.  At that time, so far as I was aware, flouresent lights were only tube shaped, whether straight, or sometimes bent into a circle.  I am referring only to the type of light produced by the object.  The object had an apparant size larger than a full moon, and the brightness was similar to that of a full moon on a clear night.  It was definitely NOT, however, the moon.  The object was hovering, moving very slowly from east to west.  As we watched, the object suddenly accelerated to a speed far faster than it would seem would be possible within the laws of physics, and moved beyond the western horizon so quickly that it was virtually instantaneous.  At the point of the sighting, we were going down a long slope on the interstate, and the terrain was such that there was a very wide, unobstructed view toward the western horizon, of several miles.  \"Accelerted\" is actually not the correct word, because \"acceleration\" implies that the speed increased from a slow speed to a faster speed through a process of going faster and faster.  To the contrary, the object appeared to have NO TRANSITION from the slow east to west hover to a speed which covered miles from our location to the western horizon in, perhaps, a hundreth of a second.  The four of us agreed that we would not report the incident because of the ridicule that we would probably suffer.  About six years after the sighting, I saw a newspaper story in the Louisville Courier-Journal newspaper about a professor at Eastern Kentucky University, which is located in Richmond, who was gathering information about a large number of unexplained UFO sightings in the Richmond area over the previous several years.  The article pointed out that the US Army Bluegrass Depot, a storage area for nerve and other weapons grade gases, and perhaps other weapons, is located just south of Richmond.  I wrote to the professor, telling him about  the sighting in 1969, and offering to meet with him if he wished  He returned my correspondence, saying to contact him if I was in Richmond in the future, but did not seem anxious to hear the details of the sighting.  I never met with him.  All three of the observers who were students at the time are now professionals: an accountant, a pharmacist, and an attorney. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52055.html",
      "state": "KY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b556e",
      "summary": "Disk over Richmond, CA",
      "city": "richmond",
      "shape": "disk",
      "date": "2008-03-04T00:00:00",
      "story": "Disk over Richmond, CA On or about April 14, 1998   Late in the evening my sister& I were star gazing.  Almost immediately a single bright orb  floated abruptly above us.  At first it looked as if it could be a satellite, but I asked my sister: \"Do you see that strange light centered almost directly above us?  We were also with a mutual friend. Upon their agreement, we started to get freaked out.  We all agreed and felt strongly we had seen an unidentified flying object. It was watching us watch it.  When we jumped up to go  inside to get a camera, it had already disappeared.  TARA HILLS CITY, CENTRAL CALIFORNIA,  LOCAL BAY AREA..",
      "link": "http://www.nuforc.org/webreports/061/S61309.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5645",
      "summary": "One round white ball that sat in the sky.",
      "city": "richmond",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "One round white ball that sat in the sky.",
      "link": "http://www.nuforc.org/webreports/051/S51685.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b56ec",
      "summary": "UFO sighting near Short Pump, VA  stationary egg/box shaped object with three lights",
      "city": "richmond",
      "shape": "egg",
      "date": "2006-10-30T00:00:00",
      "story": "UFO sighting near Short Pump, VA  stationary egg/box shaped object with three lights There was an egg/oval shaped object that had three lights on it and stood stationary in the sky while I was driving.  I stopped my car and continued to watch but after a few minutes it started to move in the opposite direction and then disapeared.  The shape was hard to describe, it was oval but square at one end. ((NUFORC Note:  Witness elects to remain semi-anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51730.html",
      "state": "VA",
      "duration": "3"
    },
    {
      "_id": "64d005f478aba2ec5a3b572a",
      "summary": "I have a picture.",
      "city": "richmond",
      "shape": "other",
      "date": "2007-11-28T00:00:00",
      "story": "I have a picture It looket like a jet exaust going straigkt uo for about 5 min and then gone instantly ((NUFORC Note:  Date of sighting may be approximate, although the witness does not indicate that fact.  We will request a copy of the photo.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60043.html",
      "state": "KY",
      "duration": "5 Min"
    },
    {
      "_id": "64d005f478aba2ec5a3b579a",
      "summary": "Electrical magnetic affects on at least three homes, lightning like flashes observed and blue haze in clouds",
      "city": "richmond",
      "shape": "flash",
      "date": "2006-10-30T00:00:00",
      "story": "Electrical magnetic affects on at least three homes, lightning like flashes observed and blue haze in clouds I was in my house reading by a lamp and my wife was in the bath room, and the lights started blinking as if they were going to turn off , soon afterwards they came back to normal, my son  and his girl friend were outside the house and he reported to me that the porch light was flashing on and off and at the same time they saw flashing lights in the sky somewhat like lightning but there was no sound, the weather was clear no rain or stormy clouds. The following day on July 29 I talked to two of my neighbors regarding the event of Friday night 28 July and I was told that their lights were flashing off and on at the  same time around 10:30 pm.  I  contacted PG&E our electrical supplier and they reported no transformer explosion on that date and time. Our electrical powere was affected by what ever was in the sky on July 28 - 06. ((name deleted)).    I decided to ask two of my neighbors if they had any problems with their lights around 10:30 and they all reported that their lights were flashin",
      "link": "http://www.nuforc.org/webreports/051/S51836.html",
      "state": "CA",
      "duration": "3 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b5a32",
      "summary": "White light with white beam spotted across small field in rural Illinois",
      "city": "richmond",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "White light with white beam spotted across small field in rural Illinois While walking from a school event to a gas station, my friends and I saw a white, circular light in the sky from across a field about .5 square acres. We, at first, thought it was a small aircraft, but it was very close to the ground. The light showed that it was very maneuverable in its sporadic, three-dimensional movements. Unique to this light, however, was a beam of a lighter white going from the main light (let’s say craft) to the ground. The light could move independently from the movement of the craft itself, and it searched from the trees surrounding the field to about the middle of the field. The craft continued these actions for about 15 minutes until it traveled to the tree line. The movements then switched to only a line parallel to our side of the field on the opposite side above the trees. The light remained on the ground for 1 more minute until the craft got brighter (as if its beam were shining at us). I and my friends got the distinct feeling that it has seen us seeing it. Then, in the blink of an eye, it was gone. It did not go below the trees. It did not fly up to the sky. It simply disappeared.",
      "link": "http://www.nuforc.org/webreports/059/S59818.html",
      "state": "IL",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a8f",
      "summary": "Big white object circular and about 15 small round star like orbs around this massive white object",
      "city": "richmond",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "Big white object circular and about 15 small round star like orbs around this massive white object I WAS IN A FRIEND'S BACK YARD HE WAS CLEANING I THOUGHT WILL I SHOULD BE ABLE TO BETTER IN THE DAY YOU KNOW U.F.O'S ORBS ECT. SO I LOOKED TO THE NORTH AND IT'S LIKE IT JUST APPEARED INTO OR OVER OUR ATMOSPHERE IT LOOKED TO BE CLOSE AT FIRST LITTLE ORBS NOT EVEN A 10TH THE SIZE OF THIS BIG WHITE OBJECT STARTED TO APPEAR AROUND IT GLOWING LIKE STARS THESE OBJECTS MOVED TOWARDS THE SUN GOING SOUTH AND AS IT GOT UNDER THE SUN I STARTED TO LOSE SIGHT OF IT I HELD MY HAND IN THE WAY OF THE SUN TO KEEP A GOOD VEIW OF IT AS IT PAST UNDER THE SUN THE ORBS OR OBJECTS AROUND THIS MASSIVE WHITE OBJECT STARTED TO CHANGE FORMATION AND ONE OF THE OBJECTS SHOT OFF TOWARDS THE SOUTH EAST WITH MORE EASE THAN I HAVE EVER SEEN WHATEVER THAT WAS HAD TO BE MASSIVE BECAUSE BY THE TIME IT APPEARED OVER MY HEAD IT WAS LIKE 10% THE SIZE OF THE SUN TO MY VEIW IT WAS TRUELY AMAZING I'M SURE THAT AROUND HERE IS A HOT SPOT THAT WAS ONE OF ABOUT A DOZEN TIMES I HAVE SEEN SOME CRAZY STUFF RICHMOND,CA I'M OUT ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60028.html",
      "state": "CA",
      "duration": "20 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f49",
      "summary": "Red and Silver Object Viewed Shortly After Take-off from Richmond International Airport",
      "city": "richmond",
      "shape": "other",
      "date": "2007-04-27T00:00:00",
      "story": "Red and Silver Object Viewed Shortly After Take-off from Richmond International Airport We had just taken off from RIC and had not quite reached 10,000 feet when just outside the port side of the airplane; I noticed a silver and red object in a stationary position. The distance from our aircraft to the object is unknown, but it was close enough to see some detail. The object was vertical in orientation with a long, antenna-like object on top with multiple array and wide, round center body and an even longer cylindrical \"rod\" (?) protruding out of the bottom of the object.  It appeared as though the object needed the bottom portion of to maintain balance, though that it speculative on my part, as the object did not appear to be moving. I had been looking out the window and noticed the object right away and as we climbed it remained in a fixed position.  As we climbed it fell out of my view. It almost looked as though it should have been attached to a tether on the ground, except none were visible. Interestingly, shortly before take-off from RIC, 2 F-16's from the Virginia Air National Guard landed and shortly before take-off, a Navy E-2C Hawkeye was \"practicing\" touch and go's at the airport. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56024.html",
      "state": "VA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f94",
      "summary": "December 10th object seen in Richmond, Virginia.  ((NUFORC Note:  Missile venting fuel in space.  PD))",
      "city": "richmond",
      "shape": "other",
      "date": "2008-03-04T00:00:00",
      "story": "December 10th object seen in Richmond, Virginia Hello, I also saw the December 10th object in the sky over Chesterfield county outside Richmond, VA.  It was very high, looked almost like a comet it had a wide tail, it also had a white speck at what would seem the front. Although you think it would head in the direction the tail shows, it moved against itself. I also got my girlfriend (20) my friend (23) and his dad (55) to come look at it. I continued by myself to further view it with my binoculars thats when i realized it was traveling strange. It moved in directions it shouldn't have, I've seen some things in the sky but this was by far the strangest, man-made or not. Hope its posted here what it was, if we ever figure out. ((NUFORC Note:  Missile venting fuel in space.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60578.html",
      "state": "VA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b62a0",
      "summary": "This wasnt a Plane or Blimps . Lets get this straight",
      "city": "richmond",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "This wasnt a Plane or Blimps . Lets get this straight While driving home in industry part of Richmond Annex , My eye caught some flashing lights in the sky at first I was going to pass it off as a blimp advertisement ot plane , but after second looks and kinda following it for a block or two . This wasnt a plane or blimp. Read my description of what I saw  Circular shape , dome on top lite up , flashing lights on the sides .Light on top never flashed , Lights on the sides seem to changing different colors. It seem to have a woble to it just gliding pretty far up in the sky there wasnt any sound , It was a semi cloudy night . I coulldnt make out the colors of the different colors flashing. I wasnt going to say anything but after reading the other post of someone seeing something on the 14th I knew I had to ((NUFORC Note:  Witness elects to remain totally anonymous.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54062.html",
      "state": "CA",
      "duration": "2- 5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b63c2",
      "summary": "sighted 09/28/2001 no noise Richmond, Va. at 11:00 PM 2-3 minutes duration going west to east  shape of a sailor's cap",
      "city": "richmond",
      "shape": "other",
      "date": "2008-03-31T00:00:00",
      "story": "sighted 09/28/2001 no noise Richmond, Va. at 11:00 PM 2-3 minutes duration going west to east  shape of a sailor's cap March 24, 2008   Dear Sir:  I have been a little hesitant to report a sighting two friends and I had some time back.       This sighting took place on Friday night September 28, 2001.   I might also add that one of the friends with me was an active FBI agent and also the driver of the vehicle. We were coming out of Richmond, Virginia at approximately 11:00 PM on the above date when we approached exit 58 on the southbound side of Interstate 95. On one side to the west is state route 150 with high tension electrical lines on the east running parallel to I-95 and (under construction at the time) to the west is  Interstate 895 overpass. We sighted a very odd flying object going from west to east.  What was strange about this is that the object had come in UNDER the electrical lines and was lit up in very bright white lights. The shape was that of a sailor’s cap. This object couldn’t have been 75 feet overhead. The vehicle was maybe 25 feet square and10-12 feet tall.  We had pulled onto the side of the road to watch this spectacle which had also attracted the attention of several vehicles on the northbound side of I-95. The object hovered over the roadway’s columns for a few minutes and then very slowly headed east. I have seen pictures of lots of different shapes of UFOs, but I have never seen or heard of anything like this. Do you have any ideas? We didn’t have a camera or video camera to take pictures of this. All three of us have discussed this several times and agree to what we saw.",
      "link": "http://www.nuforc.org/webreports/062/S62331.html",
      "state": "VA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b68ae",
      "summary": "UFO looses cloak while traveling.",
      "city": "richmond",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "UFO looses cloak while traveling. I was in my front lawn and loking up at the cloudy sky when an object flew past under the clouds.  It seemed to appear and then disapear in less than a second and in that time it had to have traveled half was to a third of the way through the entire sky. All it was was one large light with a smaller light close behind it, probably connected to the same craft. It absolutely did not come in through the clouds then back up giving the illusion of appearing and dissapearing, it seemed like it was traveling in a straight line very quickly and for some reason became visible or lost its cloak somehow.  Very weird. The shape may have been tear shaped but I could be certain because of the immense speed.",
      "link": "http://www.nuforc.org/webreports/054/S54626.html",
      "state": "VA",
      "duration": "one second"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ab5",
      "summary": "Looked up to see this almost yellow light up in the sky that shot from one side of the sky to the other.",
      "city": "richmond",
      "shape": "teardrop",
      "date": "2007-06-12T00:00:00",
      "story": "Looked up to see this almost yellow light up in the sky that shot from one side of the sky to the other. It was traveling from the south, south west and was headed across the sky then all of the sudden it shot from one side of the sky to the other. Just after shooting from one side of the sky to the other it disapeared.",
      "link": "http://www.nuforc.org/webreports/056/S56507.html",
      "state": "VA",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b4e",
      "summary": "diagonal line flashin bright white lights almost over center of Richmond",
      "city": "richmond",
      "shape": "cigar",
      "date": "2007-06-12T00:00:00",
      "story": "diagonal line flashin bright white lights almost over center of Richmond A 45 degree angle diagonal line in this direction /   bottom left to upper right.  4 or 5 BRIGHT flashing lights, almost strobing all were white lights.  One always seemed brighter than the others.  seemed to be about 3 or 4 miles away and unknown distance above the ground.",
      "link": "http://www.nuforc.org/webreports/056/S56941.html",
      "state": "IN",
      "duration": "30-40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f51",
      "summary": "Bright redish orange star object with no movement for 5 min, suddenly moving up and east out of sight",
      "city": "richmond",
      "shape": "fireball",
      "date": "2006-07-16T00:00:00",
      "story": "Bright redish orange star object with no movement for 5 min, suddenly moving up and east out of sight Outside and saw what looked like an extremely bright redish orange star... like mars but much more bright... it was low on the horizon and it was just sitting still in the same location.  After about 5 minutes of no movement at all it raised in the sky and moved east out of sight and vanished.",
      "link": "http://www.nuforc.org/webreports/050/S50684.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b71ea",
      "summary": "Triangle of lights traveling SSW to NNE.  ((NUFORC Note:  Possible sighting of U. S. Navy \"NOSS\" triplet of satellites??  PD))",
      "city": "richmond",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "Triangle of lights traveling SSW to NNE We were observing planets with my 10\" scope and attempting to pick up satallite passages.  While attempting unsuccessfully to observe the orbit of the Cosmos 2369 rocket scheduled to travel SSW to NNE and exit our field of vision at about 21:50 and looking to the NNE, suddenly observed directly overhead this triangular formation of lights traveling in approximately the same direction at a relatively rapid rate of speed. It was a stunning sight and I hurredly called it to the attention of my companion. The formation proceeded in the direction of VEGA, passed to the west of it, veered off to the East and disappeared from our view. The formation was about the size of my hand held at arms length. It was impossible to determine its height. There was no sound at any point. It consisted of about 6-8 indivdual lights. The lights were not spots, but vertical with a slight bulge in the middle. The formation was somewhat triangular, vertical on its left side and sloping slightly outward on the right side. It was traveling wide end or bottom forward. There was no variance in spacing or intensity of the lights nor variation in speed. The night was clear with no haze or cloud cover. The phenomena appeared as if it could have been produced by a searchlight but there was no cover upon which it could have been reflected and no variation in the light as would be seen if on cloud or haze cover. The light was soft and about a 1 in intensity. It did not reappear. There was no airplane traffic in the area prior to, during, or until some time after the sighting. No object per se was observable. ((NUFORC Note:  Possible sighting of U. S. Navy \"NOSS\" triplet of satellites??  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50682.html",
      "state": "VA",
      "duration": "Approx 1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7340",
      "summary": "Unknown Object  making  unbelievable turn over Richmond",
      "city": "richmond",
      "shape": "unknown",
      "date": "2007-10-08T00:00:00",
      "story": "Unknown Object  making  unbelievable turn over Richmond I was travelling west on I-64 on my motorcycle near Richmond (RIC) Airport when I noticed a craft which I presumed to be a military jet at approximately 10-12 thousand feet come from behind a big cloud formation.  It was heading SSW.  After a short distance, it turned back the way it came.  It didn't bank like a jet, It turned almost immediately around and headed back to the cloud.  I watched for the next 5 miles for it to reappear but, it never did.   When I got to I95 heading south I saw a larger plane seemingly flying past this particular cloud formation.  Not sure of what I saw here. ((NUFORC Note:  Witness indicate a date of October 28, 2007, which is illogical.  We have amended the date above, to indicate a date of September 28, which makes more sense.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59054.html",
      "state": "VA",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b7405",
      "summary": "Small bright white cigar object flash by at tree hight, pointed at ends, super fast, then dissappear.",
      "city": "richmond",
      "shape": "cigar",
      "date": "2007-04-27T00:00:00",
      "story": "Small bright white cigar object flash by at tree hight, pointed at ends, super fast, then dissappear. Just above tall tree height I saw a cigar shaped object 3 feet long, super bright white light, pointed at the ends flash by for 4 seconds or so, then disappear, went about 20 feet.  Saw it as I jogged down a hill on a college campus as I approached a small creek. I have never seen a ufo and have no interest in them, it was not a plane or meteor so I truly do not know what to make of it. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56113.html",
      "state": "VA",
      "duration": "6 sce"
    },
    {
      "_id": "64d005f478aba2ec5a3b76ed",
      "summary": "One set of cylindrical lights seen above 580 West",
      "city": "richmond",
      "shape": "disk",
      "date": "2007-04-27T00:00:00",
      "story": "One set of cylindrical lights seen above 580 West While returning from the Oakland Airport, I was driving along 580 towards the Richmond Bridge, when in the sky there appeared some type of cylindrical object of flashing lights.  I first saw this object in the sky while passing the IKEA in Emeryville, CA.  The object was stationary, but far in the distance. The lights I saw were clearly in motion, moving in a circular pattern, but in a pattern that varied from a solid circular pattern of uniform shaped lights, to certain areas flashing while other areas are black. If it had lasted only a minute, I may have ignored it, but this went on for more than ten minutes, and as I moved along 580, it was clear I was approaching the object.  While I originally thought it stationary, it must have moved at some point because I lost eye contact with it for approximately 2 minutes, then it came back into sight.  I cannot say the exact place I \"passed\" the object, but it was on my right-hand side, somewhere nearby the Martin Luther King, Jr. Memorial Park. Shortly after I passed where I thought it was above, I saw what I thought was a helicopter moving towards the location from the Southwest.  By the time I reached the Richmond Bridge, I had seen an additional 3 helicopters in the area.",
      "link": "http://www.nuforc.org/webreports/056/S56222.html",
      "state": "CA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7727",
      "summary": "Steady moving oval object with an orange glow as if on fire.",
      "city": "richmond",
      "shape": "oval",
      "date": "2007-08-14T00:00:00",
      "story": "Steady moving oval object with an orange glow as if on fire. It is Friday night, August 10, 2007.  I am a 41-year-old male, married 14 years with an 11-year-old daughter. She was having a friend spend the night, and wanted to sleep in the yard in the tent. We started a small fire, set up the tent, and made smores. As night fell, we turned out the lights to see the stars. At approximately 10:20 p.m. we saw an oval object appear in the sky. It hade no definite shape, but was glowing orange on the top half.  My daughter, her friend and myself moved through the back yard to keep it in view around the trees. It was about 30 degrees above the horizon, and moved from our west to south. Its speed appeared to be slower than when we have watched planes. There were no lights (red, blue, green or white), only the orange glow. We all 3 remarked how it looked like something burning. I have witnessed shooting stars, comets, aircraft, hot air balloons, and even the occasional faint satellite, and this was none of those. The size was similar to that of a dime held at arms length. My immediate thoughts were that there had been some sort of disaster with the shuttle or space station. My daughter said maybe a plane on fire, but we figured a plane would not keep speed and altitude if it were burning (plus there were no other lights). I know that the confirmation of 2 11-year-old girls may not hold much weight, but we all saw something very different tonight.",
      "link": "http://www.nuforc.org/webreports/058/S58087.html",
      "state": "MI",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7881",
      "summary": "Red, green, white stationary light.  ((NUFORC Note:  Twinkling star??  PD))",
      "city": "richmond",
      "shape": "light",
      "date": "2007-08-14T00:00:00",
      "story": "Red, green, white stationary light Around midnight the night before, my mother and I saw a flickering light.  This stationary light went, red green white, very fast.  At first we thought it was a plane but it stayed their for twenty minutes, then we went inside and ! hour later it was gone.  Tonight we went out and saw it, red, green white, rapidly.  At about the same location, NW at a 45' angle ((NUFORC Note:  Twinkling star??  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58129.html",
      "state": "VA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b78c5",
      "summary": "orbs in the kentucky sky",
      "city": "richmond",
      "shape": "unknown",
      "date": "2007-06-12T00:00:00",
      "story": "orbs in the kentucky sky My brother and I witnessed a orb like craft traveling north with no flashing lights. It was just a bright orb.  My brother said look at that star its moving.about 30 seconds later a red orb appeared to break off the bright orb and procceded infront of the white orb then made a left turn heading west.   There were no noises of any kind.",
      "link": "http://www.nuforc.org/webreports/056/S56951.html",
      "state": "KY",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a6b",
      "summary": "cigar shaped object over richmond",
      "city": "richmond",
      "shape": "cigar",
      "date": "2007-04-27T00:00:00",
      "story": "cigar shaped object over richmond Around 8pm I saw a cigar shaped object about four to five feet long hovering above the trees.  It was very bright white, almost blue and moved extremely fast and was totally silent.  It scared the crap out of me. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56399.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b80c7",
      "summary": "On August 5, 1975, at 6:31 P.M., while I was riding a bicycle, I stopped, along with my friend to watch a beautiful UFO. It was undergo",
      "city": "richmond",
      "shape": "egg",
      "date": "2009-03-19T00:00:00",
      "story": "On August 5, 1975, at 6:31 P.M., while I was riding a bicycle, I stopped, along with my friend to watch a beautiful UFO. It was undergoing some changes in function. It was generating brownish-gray smoke back and forth among chambers/holes on its surface. The holes were about 12 inches in diameter each and formed a matrix (grid) pattern spaced 2 feet apart. In the first instance viewing the holes, there were about 25 holes (secont time: 20 holes, third time 9 holes). The craft was semi-egg-shaped, but perfectly oval, not irregular shaped not smallish on one end as with an actual egg). It was about 250 feet long and 150 feet in diameter, about the size of eight houses. It was at first about one-half mile high distant from me, and later moved on about a mile. It seemed very close and very plainly visible to me. It was travelling at the speed of about 20 mile per hour. The smoke was being transferred from each chamber hole to each other chamber hole (as if trying to hide the whole craft maybe, or to generate the propelling system function). A fine cloud or mist of semi-frozen gas, like frozen carbon monoxide or frozen oxygen, nitrogen, helium, amonia, hazy neon, or other gas covered most of the craft, but would be partly covering at an area of one percent of its total surface for one minute while the rest was covered. The uncovered surface measured about 50 feet in diameter on the first uncovering and 40 feet in diameter on the second uncovering. The third uncovering (each uncovering was actually a clearing and diminishing of the misty gas which hid that particular area)was much smaller around 15 feet in diameter. While the partly covered area was visible, I could clearly see the functionality of the craft and watch it while it underwent changes in the skin covering (part of the function of the propelling or the disguise, possibly both a propelling and a disguise). I was aware that I should stare and focus because I knew that it was an important event I was watching. If I had had a picture camera or video camera I would have had an opportunity to capture very intensly important images of the craft and its peculiarities. As I watched for about 4 minutes the craft moved over the intersection at Broad Rock Road and continued travelling but got very fast and left a white cirrus cloud as it went very quickly away. This was a very clear warm day, sunny, with some cirrus clouds around the area of the sky. The sky was blue. The temperature of the air was about 90 degrees fahrenheit. The object left a trail but not necessarily a trail that it had generated, but a cirrus cloud which might have existed with or without the craft. The clouds of smoke of which I have alluded to seemed to be generated for the purpose of causing the craft to be visible or invisible at will as if the craft could manifest itself at will. Or, possibly the craft was absorbing the earth-born water clouds for fuel of some other purpose. I include my personal opinions because I think that my observations are inter-related with the experience, but not in the sense that I creat! ed the e vent in my own mind. I actually saw these things.",
      "link": "http://www.nuforc.org/webreports/069/S69128.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8403",
      "summary": "Myself and son had just driven over the state line of North Carolina going into Virginia.we were on the highway and seemed to be the on",
      "city": "richmond",
      "shape": "changing",
      "date": "2009-01-10T00:00:00",
      "story": "Myself and son had just driven over the state line of North Carolina going into Virginia.we were on the highway and seemed to be the only truck on the road @ that time.   I noticed in the sky directly ahead of us were 3 lights.  They lights remained still for a few minutes then began to spin counterclockwise slowly at first then the lights seemed to be spinning so fast that it appeared to be one light.   The lights seemed outline a sphere shape. The lighted sphere then moved towards the trees on our left. The sphere seemed to become a big ball of white light which proceeded to move through the trees towards the highway were we were driving.  I yelled @ my son saying don't you see the lights?!  He was not responding at all!   I don't recall what happened after that but I know we could not account for aprox 1hr and 16 mins. of missing time. I know this because of the travel time from the point we left and how long it wld take to get to were we were and there's no way it would have taken us that long, my son has a lead foot. ((NUFORC Note:  We spoke briefly via telephone with the source of this report, and she impressed us as being seemingly serious, and sober-minded.  Date may be approximate, although the witness does not indicate that fact above.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67741.html",
      "state": "VA",
      "duration": "1 hr 16 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ad2",
      "summary": "((HOAX??))  Strange light make j shape in rva",
      "city": "richmond",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "Strange light make j shape in rva ((NUFORC Note:  We cannot certify that this is intended as a serious-minded report.  Source of report indicates no date for the alleged sighting, so we have assigned an arbitrary date above, based on the little information provided by the witness.  PD)) i am 18 years old.i got off work late one night. walked out into the parking lot and decided to smoke a cigrett with one of my co workers and discuss how work suckd that night.i remeber it being an unusally a clear night,not a cloud in the sky that i could remember.once we got dune smoking we parted ways. i got into my vehicle and just as i shut the door i remembered i forgot my hoodie,i the proceeded back into the resturantto get my clothing before the cooks closed up and left.after i got my hoodie i then proceeded back to my car. i got in and put it in reverse and backed up and then pulled up to make a left turn out of the parking lot. i stoped turned the radio on and looked left to see if there were any cars comeing by me. there was litterly not a car in sight.so i looked right to double check,this is when things got really strange and has changed me ever since. as i looked to my right i noticed this highly unusaul light for way up in the night sky.it ap! peared to have a very odd color and shape to it. not like any airplane light ive ever seen. i remeber nooticeing the the light appeared from my point of view to be in the top right corner of windsheild. and this light seemed to be moveing at a rate of speed faster then anything i have ever witnessed. the direction of the objects movement seemd to be focased towards me. as it proced closer it seemed to be dropping in altitude.the closer it got the bigger the light got. the light came directly in front of my car, but about 500 to 600 feet obove and directly in my line of sight were it came to a complete stop withen a second.as it stoped i remember i felt this overwhelming of looseing control of my thought proceeses and instantly got a headache.once the light paused for a second it imeddiatly made a hook shape and zoomed off to my left and seemd to be instantly gone.i remeber gaining my ability to focas my thoughts seconds after it had left. i was petrified, and barely made it! home that night dew to fear.but unfortanly that is just the s! tart of it. for weeks after that i had tremendous headaches and insomnia. i would only sleep for a few hours before wakeing up.to realise i had dreams of things unimaginable. i never was much of a dreamer, but for some reason id have vivid dreams of deep space and it is almost like sumthing would be feeding me information of things i still cant explain. ive had instances were ive woken up and found myself walking down the road in the middle of the night in a hypnotic like state.i remember waking out of the stance and almost hearing in my head over and over again, \"we need you, come to us\". since my expierence ive become extremly telepathic and physic i seem to know things others dnt. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74146.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bfd",
      "summary": "Possible triangle craft spotted in Richmond VA",
      "city": "richmond",
      "shape": "triangle",
      "date": "2010-02-14T00:00:00",
      "story": "Possible triangle craft spotted in Richmond VA I am 14 years old, and I also hold a 2nd Degree Black Belt in Tae Kwon Do. On the way home from T.K.D. lessons, we had stopped in a traffic jam next to a high school football field. I peered out the window to get a better look at the traffic, and in the sky I saw 4 lights in a triangular formation; 3 white lights in each corner of the triangle and a single red light in the center. It was dark, and all I could tell from the lights were that they did not flash or blink in any way. I know that there were some power lines around, but if there was a solid object behind those lights, it was enormous. I'm sure others saw it, but I can't be sure. The craft did move, at a speed I estimate to be about 5 mph. I know that this was not the illusion created from the moving car, as I saw it move even when we were stopped. I didn't bother to tell my mom and sister, as they would just think I was joking. I've heard of the theorized TR-3B \"Government UFO,\" and I think that what I saw might bear a resemblance to the infamous Black Triangle. The lights were still there, even after the traffic started to pick up again. The next day, we took the same route to and from Tae Kwon Do lessons. On the way to our lesson, I looked at the spot in the sky where I had spotted the 3 lights. There was nothing like a cellphone, VOR or radio tower in the vicinity. On the way home, I looked in the sky and the lights weren't there. This still remains a mystery to me, and I'm still investigating this incident. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73925.html",
      "state": "VA",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f1f",
      "summary": "Flashing lights seen moving in the sky.",
      "city": "richmond",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Flashing lights seen moving in the sky. My mom was walking our dog, and she told me to come look. Up in the sky, very far away, was this twinkling light. It wasn't like a star, though. It flashed red and blue on the sides, and actually moved around slowly in the sky. After we started watching it move, we noticed another flying stationary across the other side of the sky. This second light was closer and you could see the colors more clearly. They weren't planes, because they moved whenever they felt like it at whatever speed they wanted. We actually got in the car and chased after the stationary flashing light, but we couldn't get any closer. It was very high and very far. It moved as we chased it though, so as far as I know it could have had a constant slow movement and I just couldn't tell because of the distance. But they did for sure move. They just now got so far that we can't see them anymore, so I came in here and typed this. It was CrAzY.",
      "link": "http://www.nuforc.org/webreports/064/S64475.html",
      "state": "KY",
      "duration": "About 2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b9483",
      "summary": "i was traveling west on 197 headed to work on a sunday night, a bright white light appeared on horizion",
      "city": "richmond",
      "shape": "triangle",
      "date": "2009-08-05T00:00:00",
      "story": "i was traveling west on 197 headed to work on a sunday night, a bright white light appeared on horizion heading to work at8:30 pm on sunday evening i was traveling west on 197 when i noticed a bright white light southwesterly on the horizion when it got closer i saw two green smaller  lights on the rear of object,it was moving slow heading east.lost sight of object when it went behind treeline.",
      "link": "http://www.nuforc.org/webreports/071/S71070.html",
      "state": "ME",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9897",
      "summary": "very short but still  wierd",
      "city": "richmond",
      "shape": "cigar",
      "date": "2008-08-12T00:00:00",
      "story": "very short but still  wierd it moved high in the sky and did a flip and 30 miniutes later a dot moved fast across the sky and suddenly disapeared",
      "link": "http://www.nuforc.org/webreports/064/S64574.html",
      "state": "KY",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b9cbb",
      "summary": "Thought I was seeing a aircraft flying towards me from south to west as  I could see 2 lights that I took for wing tip lights. I watch",
      "city": "richmond",
      "shape": "changing",
      "date": "2009-06-09T00:00:00",
      "story": "Thought I was seeing a aircraft flying towards me from south to west as  I could see 2 lights that I took for wing tip lights. I watch for a couple of minutes and noticed that it was not moving. I watch a short time until I went to retrieve my camera and upon returning within a few minutes it began to seem to  become more defined and cigar shape with what seemed to be a small trail. I took several pictures but the object was at a great distance it appeared. The sun was just breaking the horizon and all stars had disappeared but you could still plainly see this object and I live in downtown so the street lights  block out quite a bit but this seemed to shine silver and I looked  through bonoculars about this time and it seemed to emmit light from the center and expand and contract. I when inside for a minute and came out to see if I could still locate it but it had disappeared. I just walked outside to see if I possible would see it again and I believe I am seeing it again this mornng but more to the south west but still at a 10 oclock angle.I will try to get a better picture or dvd. Could it be the shuttle or space station? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70110.html",
      "state": "VA",
      "duration": "30 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b9ce6",
      "summary": "I saw a big tilted dark gray saucer-like object moving slowly in the night sky.",
      "city": "richmond",
      "shape": "disk",
      "date": "2010-05-12T00:00:00",
      "story": "I saw a big tilted dark gray saucer-like object moving slowly in the night sky. The object I saw was a very dark gray, saucer-like object that was tilted moving slowly to the right in the sky (roughly 500+ feet up). It was a bit more jagged than the normal “saucer” with a slight rectangle/diamond design. There were no lights of any kind on the object but there was a slight haze around the entire thing. I watched it hover in the sky, for roughly 3-5 mins before I completely lost track of it.  I don’t drink, smoke, do drugs, take any medication, and I don’t wear glasses or contacts. While I do believe in \"other\" life forms out in space, I’m not one to believe UFO sightings or abductions. There were trees in my view but the object was above them so they didn’t cause any problems. This event did happen at night around 11:30PM but I was wide awake.  I’m honestly blown away by what I witnessed tonight; I couldn’t believe my eyes when I saw. I’m not normally one to jump to conclusions or anything but I felt it deep within me that this was not a normal aircraft. I still can’t believe I actually witness this event, whenever anyone asks me about ghosts, etc. I tell them, I believe they MIGHT exist but I will never say they do till I witness it for myself. Well tonight, I witnessed a UFO sighting.",
      "link": "http://www.nuforc.org/webreports/075/S75259.html",
      "state": "VA",
      "duration": "3-5 minutes."
    },
    {
      "_id": "64d005f478aba2ec5a3ba213",
      "summary": "First 2, then 3 bright lights in the sky; lights eventually disappeared",
      "city": "richmond",
      "shape": "light",
      "date": "2009-05-12T00:00:00",
      "story": "First 2, then 3 bright lights in the sky; lights eventually disappeared My friend and I were heading home from Colchester to Barre after a night at the drive in.  We were on Interstate 89 heading south just past Exit 14 when I first noticed two bright lights in the sky.  I've sat on the tarmack at O'Hare airport enough to know what planes look like when they're \"stacked up\" waiting to land at night and have their \"landing lights\" on.  That's what I thought I was seeing.  After driving a few miles I could see a plane that was flying very low, coming in for a landing.  This was on the left side of the Interstate near the Williston exit, #12.  Looking to the right I then saw the lights, which I again thought were planes in line to land...but now there were three of the bright lights.  The two on the left were closer together than the one that was farthest to the right.  As we drove a bit further down the road either trees or hills blocked the view of that part of the sky.  I commented to my friend that it seemed very odd that Burlington airport would have 3 planes waiting to land...ever, let alone at that time of night.  He said he thought the lights were too close together to have been planes.  A mile or two down the road, the Interstate curves to the right as it goes down a hill...about 2 miles before the Richmond exit.  I figured that we would have a good view of the \"same\" sky when we got there and then we'd have another chance to look at the lights.  However, we never saw the lights again.  The night sky was very dark, no moon...and no clouds.  I believe that, if the lights had been planes, we would have seen them again as they came in to land.  But we never saw or heard a plane landing (after the one we saw landing as we drove past the Williston exit.)  The lights appeared to be a almost an orange color, but a very yellow-white orange.  Size-wise, the lights appeared bigger than any star or planet I've ever seen in the sky.  I can't say that I saw the lights moving at all, except for seeing 3 lights after earlier having seen 2.  I am reminded of looking a! t Jupite r with the naked eye...but about 4 times larger in apparent size and a corresponding increase in brightness.  The more I replay it in my mind the more I am reminded of how the planes looked at O'Hare airport at night while they are in line waiting to land.  (They also don't appear to move when still far away in the sky because they are, in essence, heading directly at you.)  It was the strangest thing I've seen in the sky in a long, long time.",
      "link": "http://www.nuforc.org/webreports/069/S69798.html",
      "state": "VT",
      "duration": "5-10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba471",
      "summary": "UFO sighting over VA-NC seaboard carried by NBC afiliates; video of talking heads posted online (see above link)",
      "city": "richmond",
      "shape": "sphere",
      "date": "2009-04-14T00:00:00",
      "story": "UFO sighting over VA-NC seaboard carried by NBC afiliates; video of talking heads posted online (see above link) http://www.wric.com/Global/story.asp?S=10092880&nav=0Rcx3aIN ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69448.html",
      "state": "VA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3ba529",
      "summary": "Orange 3/4 moon-like sphere hovering above tree line, disappearing without a trace, no sound",
      "city": "richmond",
      "shape": "sphere",
      "date": "2008-10-31T00:00:00",
      "story": "Orange 3/4 moon-like sphere hovering above tree line, disappearing without a trace, no sound ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66323.html",
      "state": "VA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba64f",
      "summary": "two very bright bluish lights moving very slowly and oddly.  ((NUFORC Note:  Possible star?  Or hoax.  PD))",
      "city": "richmond",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "two very bright bluish lights moving very slowly and oddly I was riding my bike and came to the top of a hill.  I saw two very bright lights adjacent to each other that had a light bluish tint to them a few miles away to the south.  It didn’t make any sound at all that I could hear I watched them lower from the sky straight down at a very slow, steady rate until they went behind a hill.  I rode my bike down the road and down a backroad where I thought it might have landed.  I went a few miles until it rose back up at the same steady, slow pace about ½ of a mile away.  I could still not hear any noise.  It started moving steadily to the northwest, and so I turned around and chased it some more.  I followed it for a while, with little luck catching it.  It went over the hill and out of sight, in the direction of Lexington, Kentucky.  I tried to get a picture with my phone, but it showed up as only a light that is indistinguishable.  I have no clue what this object was or is, but it was unlike anything I have ever seen before. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD)) ((NUFORC Note:  Possible star?  Or hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66397.html",
      "state": "KY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bac51",
      "summary": "Bright yellow and white glowing sphere motionless for 7-10 minutes, changes shape, disapears",
      "city": "richmond",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Bright yellow and white glowing sphere motionless for 7-10 minutes, changes shape, disapears Yesterday at around 5:00pm I noticed what looked like a large round object in the sky directly above with the slightest Northwesterly angle when pointing at it. I was lying on my back outside looking skyward when I noticed the round object that appeared to glow a bright yellow and white color. It did not move at all. I showed my wife and 3.5 year old daughter and both saw the object. After watching it for about 7-10 minutes it appeared to get larger in one instant and then about 10 seconds later it disappeared. While looking at it we speculated that it might be a balloon but concluded it was too large. We then wondered if it was a star shining very brightly but we have never seen a star glow so much in the day... it was not a star. I was not going to tell anyone about what we witnessed until by chance I saw photos accompanying a story on AOL.com today of almost the exact same thing yesterday over New York!!!!!!!!!! The moment I saw the photos I had a rush of adrenaline and a became a little spooked because of the extreme similarity to our experience yesterday. My wife had nightmares all night... Me - 42yrs old business owner Wife - 40yrs old designer Child - 3.5yrs old",
      "link": "http://www.nuforc.org/webreports/078/S78364.html",
      "state": "CA",
      "duration": "7-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bac90",
      "summary": "Cigar shaped object hovered, moved slowly for a short distance, then disappeared in a moment.",
      "city": "richmond",
      "shape": "cigar",
      "date": "2011-05-02T00:00:00",
      "story": "Cigar shaped object hovered, moved slowly for a short distance, then disappeared in a moment. In the mid to late afternoon on or near the date, May 8, 1989, on S. Laurel Street in Richmond, Virginia, I observed the following.   (I recall it being in the mid-spring, and I remember it being a Tuesday, however as it has been so many years I may be off by up to one year.  i.e. I lived at that address for one whole year.)  As I walked due south on Laurel Street from Carey Street towards my home I noticed a slightly shiny object hovering over the pyramid in Hollywood cemetery.  The pyramid is about 90 feet tall; therefore I estimated the object to be hovering at about 120 feet.  Since I knew I was only 3 blocks from the pyramid I estimated the object to be about 20-30 feet long and about 8-10 feet tall.  The width of the object was not easily estimable but the cigar shape it appeared to have indicated it may have been about 10 feet wide at most.  It hovered silently.  A cigar shaped object with no lights or windows visible and a finish that looked similar to “brushed steel”, with a slight grain or texture to the entire craft.  It seemed to have a pointed end and a slightly rounder end. As I stopped and stared, it began to move south in a straight path with no altitude change, towards the river which was less than a mile away, and near my home.  I walked at the same pace as it moved while it continued the south, slowly and silently.  Then it stopped and appeared to open a window or peephole on the side facing me.  (It was on my right)  It picked up speed, as if changing from one gear to the next instantly.  I began running to keep up with it and proceeded to seemingly keep up for two or three blocks, so it was still only going a few miles per hour.  Then in an instant, right before it was over the riverbank, it made an angled right turn which turned it about 20-30 degrees to the right (west) and about the same angle in increased elevation while accelerating as a rate I would estimate to be thousands of miles per hour.  Poof!  Gone in a second or less.  I would often describe the angle and acceleration as “impossible”. In conclusion I would like to add that I made a few calls to the weather services, NASA, and other agencies in and around Virginia and Washington, D.C. attempting to find out more or report the incident and ran into a brick wall.  More than once I was told to “just drop it”.  At times I assumed it was some military test flight, but in the twenty years since it happened, nothing like it has been produced by our military so I have begun to rethink it. I would describe myself at the time as a college student attending Virginia Commonwealth University.  The campus is only a few blocks from the location of the sighting.  I was about 23 years old.  Again, I may have the date off by as many as twelve months as I lived on Laurel Street from September of 1988-June 1989.   I studied communications, computer science and philosophy.  I have never before or since experienced anything like what I observed that day when I was walking home from class. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81071.html",
      "state": "VA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bacec",
      "summary": "Green falling object from the sky over Richmond Ky 2010",
      "city": "richmond",
      "shape": "light",
      "date": "2011-05-02T00:00:00",
      "story": "Green falling object from the sky over Richmond Ky 2010 A friend and I were standing on my back porch in Richmond Ky on a clear cold night in October.  The actual date I have now forgotten.  We live on the route of a nearby airport and I see and know what planes flying over looks like and we also live very close to an army depot which reported NO activities this particular evening. We were standing facing the open sky and I saw a glowing green flash hurdle to the ground descending from South to North...  It looked as though it hit the ground less than a visible mile from my house.  (Though we didn't witness ground impact).  The green glowing ball had a tail of sparks trailing behind it.  I have no idea the size of the object, but it was way bigger than a falling star and traveled slower than one time.  By the time I saw it, I had enough time to tell my friend to look too and we both witnessed it fall.   We stood outside long after, nervous of what might happen next and trying to explain what we saw.  Suddenly between 5 and 10 white lights appeared in the sky.  We at first thought them to be airplanes (comparably to the size an airplane light leaves in the sky)  However, these lights were doing figure 8's in the sky and would continuously travel towards and away from one another in a star like pattern.  This lasted for at least 20 minutes, and we had no video c! amera to record it. I called everyone I knew in the area, who also went outside and saw the event of the white lights.  About 15 people witnessed it during those 20 minutes.  I posted that I had seen a UFO of some kind in the area on facebook and got a response from two different people who were traveling a nearby highway who saw the green light also hurdle to the ground.  Both described the sighting exactly how I saw it without my going into detail first. No one ever mentioned the happening again.  I checked the newspaper the next day to see if anything had been said or reported or if their was an explanation and we couldn't find anything. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81083.html",
      "state": "KY",
      "duration": "20 MIN"
    },
    {
      "_id": "64d005f478aba2ec5a3bad2b",
      "summary": "Lights in sky, hoovering like object over house.  ((NUFORC Note:",
      "city": "richmond",
      "shape": "other",
      "date": "2011-05-02T00:00:00",
      "story": "Lights in sky, hoovering like object over house We were driving home from town and saw 2 lights in the sky very bright lights, I thought it was maybe one of the towers for the Airport in Augusta but wondered why I had never seen it before.  There was a big light on the top and directly under it was a smaller one they were perfectly aligned up and down.  We watched there were 3 in our car, it didn't move as we moved closer it stayed still in the sky.   We drove for about 5 minutes watching and we were going to follow the light to see what it was, when we turned away for a second because of the trees the one disappeared the one that was on top, the little one started to move we ended up pulling in our driveway and our kids pulled in behind us we all got out   I was just in awe as this craft or whatever it was went directly over us, no sound just lights it looked like a hoovering car, it had a flat bottom with one light on each side.   It disappeared when we turned to watch.",
      "link": "http://www.nuforc.org/webreports/080/S80764.html",
      "state": "ME",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3baee8",
      "summary": "UFO Found in Moon Pictures",
      "city": "richmond",
      "shape": "disk",
      "date": "2011-05-02T00:00:00",
      "story": "UFO Found in Moon Pictures On 4/4/2011, I was shooting some sunset pictures on Nuckols Farm during a walk with my wife and son. Couple minutes after the sunset, I found the half moon was bright then started shooting the moon and some street lights at Nuckols Farm Elementary School, 12351 Graham Meadows Drive, Richmond, VA 23233-6619. At one moment while I was adjusting my camera, I felt there was a \"star\" below the moon.  However, when the shutter had already closed, I could not see that object any more.  Then I magnified my picture. Very surprisingly, it was an UFO!  Right after that, I tried to search it out with a zoom lens and ended up with nothing.  Several minutes later, I showed this picture to some guys playing on the ground.  They were my neighbors in the same community. I also searched three other pictures taken couple seconds before that picture.  There was seemingly something on them but very dark. In the attachment, I put in the full size picture with all EXIF data for your analysis.  My camera’s time was not right.  The actual time of that picture (compared to my cell phone after that), should be 20:00:35, 4/14/2011. Thank you for your attention on this report.  Pictures were sent through e-mail.",
      "link": "http://www.nuforc.org/webreports/080/S80876.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bb138",
      "summary": "it was a bluish orb traveling west at a very fast rate of speed. It was about as large as a small SUV. Im almost positive it was a UFO",
      "city": "richmond",
      "shape": "disk",
      "date": "2011-01-05T00:00:00",
      "story": "it was a bluish orb traveling west at a very fast rate of speed. It was about as large as a small SUV.  Im almost positive it was a UFO",
      "link": "http://www.nuforc.org/webreports/079/S79209.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb137",
      "summary": "Flying craft climbing vertically until it passed the moon in the sky upon which it disappeared",
      "city": "richmond",
      "shape": "cylinder",
      "date": "2011-01-05T00:00:00",
      "story": "Flying craft climbing vertically until it passed the moon in the sky upon which it disappeared My friend and I were playing a game of soccer, when we looked to southwestern quadrant of the sky to see a flying craft climbing at a vertical slope.  The craft continued until it passed the moon in the sky, upon which it disappeared.",
      "link": "http://www.nuforc.org/webreports/079/S79204.html",
      "state": "VA",
      "duration": "Three minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1ed",
      "summary": "Blue bright- diamond like shape in the sky",
      "city": "richmond",
      "shape": "diamond",
      "date": "2010-11-21T00:00:00",
      "story": "Blue bright- diamond like shape in the sky Driving on 580 East, a very bright diamond like- blue light appeared and shot down very quickly and disappeared. It was much too large to be a star and definitely not a plane.  Not a fire works activity either, it was something out of the ordinary. ((NUFORC Note:  Source of report provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78748.html",
      "state": "CA",
      "duration": "03"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2b7",
      "summary": "Three white lights counter clockwise in sky making a Y shape.",
      "city": "richmond",
      "shape": "formation",
      "date": "2011-05-02T00:00:00",
      "story": "three white lights counter clockwise in sky making a Y shape Three circle lights circling counter clockwise and intersecting then spread out two a Y shape.  One is bright other two faded no noise herd. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81063.html",
      "state": "VA",
      "duration": "20"
    },
    {
      "_id": "64d005f478aba2ec5a3bb516",
      "summary": "At approx. 6:30am, I saw a white oval shape climb the sky going straight up, I did not see a trail of smoke like a regular USA aircraft",
      "city": "richmond",
      "shape": "oval",
      "date": "2011-02-23T00:00:00",
      "story": "At approx. 6:30am, I saw a white oval shape climb the sky going straight up, I did not see a trail of smoke like a regular USA aircraft gives off when flying.  There was no sound that I heard, and I had no music or and type of sound playing.  Then once it got to a really high height it just vanished.",
      "link": "http://www.nuforc.org/webreports/080/S80169.html",
      "state": "VA",
      "duration": "less than 90seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb568",
      "summary": "Slow moving craft with short bursts of vertical contrail....",
      "city": "richmond",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "Slow moving craft with short bursts of vertical contrail.... On Sunday, November 14 at approximately 3:30 p.m. I noticed a slow moving object tracking in a Northern direction.  The object appeared as only a bright light and had a short contrail – but was not behind the craft but below it.  The contrail also appeared to be in bursts at times. I called 911 who then transferred me to the tower at Richmond International Airport.  They said they had no “reports”.  I then went into the house to find a camera to take pictures – batteries were dead.  The craft then started on an Eastward path, stopped, and just hovered for at least three minutes since I contacted the tower once again and the answer was the same.  When I informed him that an aircraft was going in that same general area but lower and if they looked up at 11:00 I’m sure they would see it.. Approximately 5 minutes later, three (3) fighter jets were scrambled to the same area and I also witnessed an AWAC (hopefully right) radar plane but not on the same course of the jets, but also going to that general area. At the same time in the West area aircraft were spotted with regular contrails that were a great deal longer than the contrail coming from this craft. The craft could not be seen to assess the shape – it was basically a light or just very shiny and the sun was just reflecting off of it.  It appeared as almost a “star” kind of twinkling..",
      "link": "http://www.nuforc.org/webreports/078/S78914.html",
      "state": "VA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb575",
      "summary": "Bright craft in sky over Richmond, VA",
      "city": "richmond",
      "shape": "light",
      "date": "2011-02-18T00:00:00",
      "story": "Bright craft in sky over Richmond, VA Sunday night right over the city of Richmond, VA.  It was a single light object (could be the magnetic field around craft) starting off inspecting a plane's chemtrail then started making quick maneuvers, stopping abruptly and then continuing to bounce around to different areas.  It eventually headed east and our vision was blocked by trees.  It lasted for around 4 minutes.",
      "link": "http://www.nuforc.org/webreports/080/S80061.html",
      "state": "VA",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb60a",
      "summary": "4 shining spheres spotted over river for 20 minutes",
      "city": "richmond",
      "shape": "sphere",
      "date": "2011-01-05T00:00:00",
      "story": "4 shining spheres spotted over river for 20 minutes While crossing a bridge over the James River in a car, 4 large spheres were spotted in the sky hovering in a diamond formation. These spheres were all metallic colored and were shining in the sunlight.  Myself, along with 2 associates pulled over the car to examine the objects. We tried to call some friends but all of our cell phones had shut down.  The crafts also made a slight buzzing sound.  We viewed these objects for about 15 minutes, as they hovered above the river.  As quickly as they arrived, they immediately sped off into the horizon.",
      "link": "http://www.nuforc.org/webreports/079/S79438.html",
      "state": "VA",
      "duration": "30 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb6f7",
      "summary": "Blimp like hovering object swaying in park",
      "city": "richmond",
      "shape": "other",
      "date": "2010-07-19T00:00:00",
      "story": "blimp like hovering object swaying in park it was a warm summer night.i was in byrd park when i  looked up and saw what clearly wasnt a plane.in wasnt completely dark at the time.the craft resembled a blimp.the lights were very bright and they danced at a fast pace around the craft.it was extemely low.it was hovering over the downtown expressway.there were other people out there so its hard to think nobody else saw it.it was right above the tree line and it sort of swayed back and forth.i called my mother to see if she could see it from her house which was only blocks away.the lights were white and red.when i got in my car to see if i could follow it it vanished.in 1992 myself and four other family members saw what appeard to be a dome shape craft very low hovering over another park. the lights circled the bottom of it and there was one really bright light on top.it also hovered for awhile then dissapeared.on the two occasions that i have seen these crafts,they were always near water. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76591.html",
      "state": "VA",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbaa",
      "summary": "A bunch of us were playing B Ball and we all saw three OFOs lit up white.",
      "city": "richmond",
      "shape": "oval",
      "date": "2011-10-10T00:00:00",
      "story": "A bunch of us were playing B Ball and we all saw three OFOs lit up white. Late in the evening on a Saturday in Creighton Court in June, about ten of us kids were playing basketball, and we all saw three oval UFOs lit up white, cloud-high.  They were hovering and moving in place slightly.   We hollered \"Look y'all, UFO!!!\".  Then about fifteen more kids and ten more adults came out and said \"Ooh a UFO!\".  They hovered for a couple more minutes and then faded out.   Some of us stayed out and talked about it.  No one called the cops. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83915.html",
      "state": "VA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbea3",
      "summary": "black circle object going through the clouds very large",
      "city": "richmond",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "black circle object going through the clouds very large It was very cloudy , but the sune was shining through and there was a huge black object passing through the clouds moving faster than anything i have ever seen.  I could not make out anything else . It was also very close to the bluegrass army depot.",
      "link": "http://www.nuforc.org/webreports/085/S85035.html",
      "state": "KY",
      "duration": "45 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bbed7",
      "summary": "I just pulled in to my drive way when i saw a light high in the sky.  It was moving at a steady speed across the sky.  It was a constan",
      "city": "richmond",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "I just pulled in to my drive way when i saw a light high in the sky.  It was moving at a steady speed across the sky.  It was a constant light source and was not blinking, so it could not have been a plane.  It then slowed down and disappeared, which i assume it means that it left our atmosphere.",
      "link": "http://www.nuforc.org/webreports/086/S86359.html",
      "state": "KY",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc24a",
      "summary": "Two solid lights about 100 feet in the air over a field.",
      "city": "richmond",
      "shape": "cigar",
      "date": "2012-01-12T00:00:00",
      "story": "Two solid lights about 100 feet in the air over a field. Less than a quarter mile off the road to my left and no more then 100 feet in the air I saw two lights, one red one white, 10 to 20 feet apart. They seemed to partially illuminate the object which appeared to be metallic. I rolled down my window and turned off the stereo to make sure I couldn't hear any helicopter blades. I was driving home from work by myself at around 23:00 but there were other cars on the road that may have seen it as well.",
      "link": "http://www.nuforc.org/webreports/086/S86321.html",
      "state": "KY",
      "duration": "30sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc366",
      "summary": "Triangular aircraft with huge round lights underneath traveled within 30 feet of my window as I watched it come across the river.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Triangular aircraft with huge round lights underneath traveled within 30 feet of my window as I watched it come across the river. On September 27th, 2011 I was awoken by my dogs around 4:30 a.m.  As I stood up to go let them out I was distracted by lights out my window.  Because I live in the country, there are few lights outside.  These, however, were extremely bright and appeared to be spinning in a random pattern.  There were three lights that were all the same, but in different areas.  They were very close to the tree line, if not in it.  At that time, they were across the river from me. I watched to see if they could be part of something else, but one of them started to rise up in the air.  At first, I wasn't sure if I could believe my eyes, but it kept going up, then started to come towards my house across the river.  It moved in a 90 degree angle, straight up, then straight out and appeared to do so very smoothly, almost like being on a  conveyer belt.  I lost track of the other two lights when the one started moving. At this point, I grabbed my cell phone to try to video it, but was afraid that it was somehow aware of me, as it was coming straight toward my house.  Because I was nervous I held my phone at my stomach and tried to guess to where to find it to film it.  Unfortunately this was unsuccessful and not the smartest. However, I did, for about 1-2 full minutes watch the aircraft.  It came across the river and right over my garage which is directly outside my window.  My window was already up.  I had a fan running on a table below the window.  The fan is not loud, but the aircraft was so quiet that I turned off the fan to try to hear it, even as it was right in front of me.  I could barely hear it. What I saw was a huge triangular aircraft that was just cruising along.  I can't believe how big it was, how quiet it was, and how slow it was moving.  It had huge round lights underneath.  I could not see the top when it went by, and as it was coming toward me it was dark outside so I cannot say for sure, but it almost appeared to be just a solid triangular mass.  The bottom for sure, and the sides were clear to see.  I was probably no more than 30 feet from it.  I was stunned and didn't chase after it outside, but I wish I did. ((NUFORC Note:  We spoke via telephone with this witness on two occasions, and she sounded to us to be quite sincere and sober-minded.  We suspect that she has reported the sighting quite accurately.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84303.html",
      "state": "KY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc598",
      "summary": "Encounter of the third kind.",
      "city": "richmond",
      "shape": "unknown",
      "date": "2012-01-12T00:00:00",
      "story": "Encounter of the third kind.  500 Lights On Object0: Yes I was in my back yard smoking a cigarette when I heard a noise coming from the woods surrounding my backyard fence.  At first i thought it was a deer, but as I got closer to the fence I could tell that it was foot steps that i was hearing as the steps had a pattern of two and not four.  As I got right up to the fence I peered over and looked into the woods and saw the top of a head fairly large, pale white head on top of a 3 foot tall figure.  I called out \"Hello?\" and as soon as I did the being ran away into the woods at a very fast rate and disappeared.",
      "link": "http://www.nuforc.org/webreports/086/S86435.html",
      "state": "KY",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc798",
      "summary": "Line across sky like a jet plane plume, but much thinner and precise.  Cigar shaped object in the middle of it.",
      "city": "richmond",
      "shape": "other",
      "date": "2011-08-07T00:00:00",
      "story": "Line across sky like a jet plane plume, but much thinner and precise.  Cigar shaped object in the middle of it. Around 7:20 pm I noticed a line across the sky, but it was too thin and too precise to be caused from a jet.   In the middle of the line was a thin cigar shaped object.   About an hour later (~8:30 p.m.) I went back outside and it was still there.  I went to my neighbors to show them.  We both took pictures.  Around dusk it disappeared, or perhaps the sun wasn't reflecting on it any longer.   This morning the line was still across the sky but I don't see the cigar shaped object in the middle of it.",
      "link": "http://www.nuforc.org/webreports/082/S82595.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bca3c",
      "summary": "Red Orbs in the sky above Lake Reba in Richmond, KY.",
      "city": "richmond",
      "shape": "circle",
      "date": "2011-07-17T00:00:00",
      "story": "Red Orbs in the sky above Lake Reba in Richmond, KY. We saw an red glowing object in the sky that hovered in the sky above Lake Reba next to the Richmond park.  The object would appear then slowing disappear to reappear on the other side of the park.  We watched it do this for about thirty minutes before it was fully dark out.",
      "link": "http://www.nuforc.org/webreports/082/S82296.html",
      "state": "KY",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb23",
      "summary": "UFO spotted in Richmond,Ky near The Bluegrass Army Depot..??Is this Aliens or Government cover up",
      "city": "richmond",
      "shape": "cigar",
      "date": "2011-07-06T00:00:00",
      "story": "UFO spotted in Richmond,Ky near The Bluegrass Army Depot..??Is this Aliens or Government cover up It was around 5:15 on Thursday, june 30th, in Richmond, KY, when a buddy of mine and myself seen something that changed our lives forever.   While standing on our back deck having a cigarette, I noticed a a cigar shaped object descending from the sky.  We were convinced that it was an asteroid or something crazy like that, although there was no trail of smoke.  It disappeared past the horizon.  Around 10 min later I seen this object shoot back up into the sky using the same path it had descended from.  Once it reached a comfortable level in the sky it quickly changed its shape into a silver Ball and shot across the sky through a lightning storm.   To our suprise 30 min later there were even more objects in the sky that were unknown and making very quick movements dodging aircrafts and sneaking up behind them.   This to me is the real deal, something one has to see to believe. Also this is very near The Bluegrass Army Depot where a large supply of the nations nerve gas is s! tored.",
      "link": "http://www.nuforc.org/webreports/082/S82238.html",
      "state": "KY",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd41e",
      "summary": "Driving around when me and my friend saw a bright BRIGHT white light from about 2/12 miles away. Started driving towards it it as it ju",
      "city": "richmond",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "Driving around when me and my friend saw a bright BRIGHT white light from about 2/12  (sic.  2.5) miles away.  Started driving towards it it as it just stayed in the same position when we finally got to the road the object was right above the treeline friend was about to record it but we were so in shock that he forgot to press record soon after the object started moving slowly in up moving around, and then zoom it was gone but completely silent also we were in a rural area and it was above a crop field.  It may have landed but again it was a extremely bright light ((NUFORC Note:  Date is not indicated by witness.  We have assigned an arbitrary date, given that the source of the report has not responded to our queries.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93228.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdbab",
      "summary": "Oval Craft w/three white lights stationary and clearly just inside fast moving clounds. Observed for several minutes but gone when I re",
      "city": "richmond",
      "shape": "oval",
      "date": "2012-07-04T00:00:00",
      "story": "Oval Craft w/three white lights stationary and clearly just inside fast moving clounds. Observed for several minutes but gone when I re SF Bay Area - I stepped out on my patio at approximately 0125 hours Pacific time and was just looking around the sky since I'm up all night listening to the radio online.  I saw what I thought at first was an passenger airplane until I noticed that it was not moving AT ALL.  It was just hanging in the sky motionless. I watched it for approximately one minute to confirm it was not moving... then went inside and grabbed my bino's.  I got a clear look at a craft which had 3 bright white lights. It was an elongated oval with the 3 bright lights spaced evenly on it.  I could make out an outline of the oval as well. I watched it for several minutes with my Bino's and it remained motionless in the sky.  The best way that I can describe the lights is as if seeing an auto's headlights thru a slight fog.  This allowed me to see the outline of the object without the lights being too bright to do so. The object was dull gray in color. I was amazed at my luck so I went inside to grab my camera or video recorder but both had dead batteries. I was only inside about 30 seconds... I went back outside to see it again and this time it was gone... not a trace. No man-made aircfaft could disappear from the sky that fast. This object had been inside a slight low cloud cover which was moving briskly due to fast cold winds tonight. From where I was, the pan of the Big Dipper was behind this cloud cover and could NOT be seen through it. The cloud cover was there, and moving fast, the entire time I viewed this object... and like I said, the object was slightly inside the clouds but not deep inside because I could see it easily. After going inside for the camera the object was GONE but the clouds were still moving fast. When the cloud cover past completely I could easily see the entire Big Dipper but there was nothing else there that could have been the the craft... so I know for sure it was NOT any star. I can provide a sketch via fax if you want one.  Or I will mail the sketch since I see that you provide an address to do so.",
      "link": "http://www.nuforc.org/webreports/089/S89796.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd71",
      "summary": "Bright pink lights appears on North Richmond Sky",
      "city": "richmond",
      "shape": "cross",
      "date": "2012-11-19T00:00:00",
      "story": "Bright pink lights appears on North Richmond Sky Driving on Shell Rd. heading North 1/2 block from Bridgeport Road, Richmond, BC. A very bright pink light appears suddenly in the sky at 10:17 PM.  It resembles a shape of a cross. The location is roughly above Fraser River.  The area is near YVR airport.  Many aircrafts pass by this neighbourhood at all times.  But nothing like that shape and colour.  I told my kid of 17 years of age to look up.  As we stared at the mysterious bright pink light it suddenly dropped rapidly.  It was falling so quick we thought it would crash.  Then as we looked the light just vanished right in front of our eyes in the thin quiet sky.  The whole sighting was about 20-30 seconds.  Not enough time to grab a phone to record it.",
      "link": "http://www.nuforc.org/webreports/094/S94409.html",
      "state": "BC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be03a",
      "summary": "Huge circular something crosses I 295 on 10/24/12 at 16:14.",
      "city": "richmond",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Huge circular something crosses I 295 on 10/24/12 at 16:14. This afternoon while traveling North bound on interstate 295 something caught my eye in my peripheral vision.  I was at approximately mile post 28 near the Richmond Airport.  It was 4:14 pm.  A perfectly clear, sunny day with a gorgeous blue sky.   I assumed it was an airplane and turned for a quick look.  It is thrilling to watch the big jets cross over the highway.  Except this was not a jet.  It was round and silver/white like a perfect mylar balloon with absolutely no markings.  It was very large and was only about 200 feet above the ground.  I looked at the car next to me and as the driver passed me and saw it he pulled hard right across two lanes of traffic and stopped on the shoulder of the highway.  I slowed way down and watched as the circle dropped to about tree height and held position.  As I got closer I was anxious about driving by it but before I reached it, it pulled up a bit and quickly crossed the highway and dropped behind the trees quite rapi! dly.  The most disturbing vision was of the undeniably huge circular shadow it cast and watching that shadow move across the highway in front of me.  At least two other cars pulled over and watched.  I was too afraid to stop.  I have been trying to explain this away to myself and others since it happened but that shadow refuses to tuck itself away in my mind.",
      "link": "http://www.nuforc.org/webreports/093/S93843.html",
      "state": "VA",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be042",
      "summary": "Orange orbs traveling NNE. One after another with a 20 second space.",
      "city": "richmond",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "Orange orbs traveling NNE. One after another with a 20 second space. No sound.",
      "link": "http://www.nuforc.org/webreports/092/S92969.html",
      "state": "IL",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be1d0",
      "summary": "9/21/12 Richmond Va UFO sighting",
      "city": "richmond",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "9/21/12 Richmond Va UFO sighting UFO sighting in Richmond,VA. 2 large circle white lights with 1 red light in the middle. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92966.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be430",
      "summary": "Triangle formation over Richmond Maine in the late 1970's or early 1980's",
      "city": "richmond",
      "shape": "formation",
      "date": "2012-04-18T00:00:00",
      "story": "Triangle formation over Richmond Maine in the late 1970's or early 1980's I am not sure of the date or year this happened.  I was a small child.  8-11 years old.  It would have been in the late 1970's or early 1980's.   I had to go outside to the car to retrieve a comb or hairbrush that I had left there.  As I came around the corner of the house I looked up and saw a triangular formation of white lights hovering over town.   I was located at the corner of Cross and Main St. in Richmond, Maine and would have been facing east towards the Kennebec River.   There was no sound. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87925.html",
      "state": "ME",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3be760",
      "summary": "16 UFOs seen in under 4 hours!",
      "city": "richmond",
      "shape": "other",
      "date": "2012-06-14T00:00:00",
      "story": "16 UFOs seen in under 4 hours! My friend and I saw a metallic saucer around 9pm last night.  I had a pair of binoculars in my car so I quickly grabbed them.  We both observed it until it disappeared behind some clouds and we couldnt see it any longer. We went to his house and played video games and came outside to smoke a cigarette and we saw a glowing orange ball about 2 miles away from us.  We weren't very surprised to be honest.  We actually see this type of craft around his house all the time,  the only difference with this time is we saw 16 crafts.  They didn't all look alike though, and they were not all out at the same time.  One of the orange crafts appeared to eject a an object that had red flashing lights on it. I recognized this craft as one of the triangle type ufos that have three lights on the bottom of it.  It got close enough to us to where i could tell that it was not an airplane because there was no noise.  After that, one of the orange crafts got close enough for me to ! see the outline of the craft.  It was disk shaped, just like your standard UFO.  I was even able to make out what appeared to be an observation deck.  However i was not able to see any beings through it even with my binoculars.  There weren't more than three craft in the air at a time, so we could very well have seen the same craft more than once.  But we saw 16 ufos in all.",
      "link": "http://www.nuforc.org/webreports/089/S89566.html",
      "state": "KY",
      "duration": "3 Hours 45Min."
    },
    {
      "_id": "64d005f478aba2ec5a3be956",
      "summary": "It was fast and then split.",
      "city": "richmond",
      "shape": "changing",
      "date": "2012-04-18T00:00:00",
      "story": "It was fast and then split. The ufo started north then all of a sudden the craft split into three.  Then the whole cities power went out. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88199.html",
      "state": "VA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb4f",
      "summary": "Flashing stationary objects",
      "city": "richmond",
      "shape": "light",
      "date": "2012-02-10T00:00:00",
      "story": "Flashing stationary objects One light spotted, flashing, appears blue and red towards the South, noticed two more at different distances and positions in sky.  All flashing, the other three spotted after some observation, most appear to have red flashing lights.  Appears to be an verticle object with two lights each, one on top and one on bottom.  They're all fading very slowly but not moving at all.  Too high to be helicopters, the more I look the more I see, all fading gradually and stretching from South to West. I'm on the 9th floor on a balcony. If they're moving, they're each moving directly away from this building, or they really are fading, but the ones I can still see are still blinking and don't appear to be moving from their original positions. ((ADDENDUM FROM VISITER TO WEBSITE)) You probably have already received tips on this; but you have an entry on 8 Feb 2012 with the location entry as Palm Springs, Oregon.  I am pretty sure it should read Palm Springs, California. ((END ADDENDUM)) ((NUFORC Note:  We agree, and espress our gratitude to this person's careful reading.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87091.html",
      "state": "VA",
      "duration": ">20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3becf0",
      "summary": "The object changed into at least 5 different shapes during the sititng.",
      "city": "richmond",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "The object changed into at least 5 different shapes during the sititng. An unidentified flying object was spotted flying north and changed into numerous different shapes.",
      "link": "http://www.nuforc.org/webreports/100/S100506.html",
      "state": "VA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf04d",
      "summary": "UFO Sighted Outside of Richmond KY.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2013-07-03T00:00:00",
      "story": "UFO Sighted Outside of Richmond KY. I was just driving home on the interstate after leaving work, when I noticed a bright light off to my right (between Lancaster road and Barnes Mill Road west of Interstate-75 above Wilgreen Lake).   As I focused in on the object I recognized that the figure was a triangle floating in the sky somewhat low to the ground.   The moonlight made it clear to me that it was triangular shaped.  The lights I first saw, were actually three lights one being on each corner of the craft.   After I recognized what I was witnessing my instinct was to get closer to it, when I increased my speed I watched it go from just hovering to leaving the atmosphere with incredible speed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98793.html",
      "state": "KY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf04c",
      "summary": "9-10 circular lights in triangle formation off Chamberlayne exit RICHMOND, VA.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2013-07-03T00:00:00",
      "story": "9-10 circular lights in triangle formation off Chamberlayne exit RICHMOND, VA. Exiting off 95 north onto Chamberlayne for gas around 1 am, and saw maybe 9 or 10 white/yellow lights evenly distributed in a triangle formation hovering over Exxon across the street.   Pulled into Sunoco, got out and watched for around 30 seconds to a minute.  Unfortunately, I was unable to tell distance or size of craft.  If I had to guess, I would say it was somewhere high over Parham Rd.   Motion was minimal but present, best described as 'floating'.  There were no blinking marker lights and no sound emitted, completely silent from my location.    I unfortunately don't recall exact details of how it pulled away, exit was fast and behind the trees away from where I was.  No witnesses. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98375.html",
      "state": "VA",
      "duration": "~30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf061",
      "summary": "At regency mall, 2 circular white lights traveling side by side then suddenly start to fade and just disappear-as if they were invisibl",
      "city": "richmond",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "At regency mall, 2 circular white lights traveling side by side then suddenly start to fade and just disappear-as if they were invisible. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96759.html",
      "state": "VA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf138",
      "summary": "4 fireballs flying in formation over Henrico.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "4 fireballs flying in formation over Henrico. I saw four orange/red fireballs flying in formation across the sky over henrico.   I tracked them for about 30 seconds give or take and the gradually each faded away.  They were slow moving and made no sound. moving in an easterly direction. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98444.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf109",
      "summary": "Bright blue white light fading in and fading out within 5 seconds",
      "city": "richmond",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Bright blue white light fading in and fading out within 5 seconds. While watching the transit of the ISS I saw a similarly sized, color and brightness object within 1 degree of ISS track. My assumption was it was an Iridium flare. The flare was not listed on my IF app. It was very typical in terms of fade in fade out and duration of an iridium flare. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100929.html",
      "state": "BC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1e6",
      "summary": "Invisible Triangle outlined by lights flew directly over me straight from Selfridge Airforce Base Direction",
      "city": "richmond",
      "shape": "triangle",
      "date": "2013-08-30T00:00:00",
      "story": "Invisible Triangle outlined by lights flew directly over me straight from Selfridge Airforce Base Direction I was sitting outside drinking my morning coffee as I do every morning from around 3am till about 4am, I generally watch the stars, and knowing the Perseid Meteor shower was happening I was staring up into the sky, as I usually do, and just a few minutes after 4, maybe 4:05, I saw what appeared to be an invisible triangle outlined by dim yellow-ish/white-ish lights moving toward me about as high as a helicopter, not very high at all. It went directly over top of me.  It was a very quiet morning and as it passed over me I could hear a faint sound reminded me of the Jetson's cartoon cars or something like the 6 million dollar man noise (nah nah nah nah nah nah...etc) but very faint and sort of tin-ish.  It came out of the south east over my head toward the north west.  I live about 10 miles north west of Selfridge AirForce Base and it came straight from that direction.",
      "link": "http://www.nuforc.org/webreports/100/S100999.html",
      "state": "MI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1c1",
      "summary": "Saucer:  red light flashing every 3 seconds",
      "city": "richmond",
      "shape": "disk",
      "date": "2013-09-30T00:00:00",
      "story": "saucer:  red light flashing every 3 seconds",
      "link": "http://www.nuforc.org/webreports/102/S102223.html",
      "state": "VA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf33c",
      "summary": "Three bright lights in the sky making a triangle.",
      "city": "richmond",
      "shape": "oval",
      "date": "2013-02-04T00:00:00",
      "story": "Three bright lights in the sky making a triangle. Hello, I was walking my dogs this evening and it is a very clear sky tonight.  I noticed the usual stars that I see every time I walk the dogs along with the moon but tonight I noticed a very bright round light in the sky near the moon along with two dimmer round lights.  All three formed what looked like a triangle formation.  Now what caught my eye was the bigger/brighter light started flickering or pulsing, then the light darkened and I could no longer see it.   After this happened I noticed the smaller one on the left started moving away and eventually went out of view.  The third dim light at that point to me just looked like a distant star that never went away. Now take note that as this was going on I noticed the normal jets flying high in the sky and these lights appeared to me to be higher than the jets.  Being the type of person who likes to find an explanation for everything I checked to see where the space station was currently located and it was flying over the south pole at the time of the sighting.  Now I can't rule out other debris thats flying overhead but it looked very strange to me.  I have also never seen anything that has ever resembled a UFO before or anything paranormal.  I just thought I would post this here in hopes of an explanation to what I noticed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95422.html",
      "state": "VA",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf598",
      "summary": "A witness and I saw 2 UFOs within 1 minute in Fishing Bay VA.",
      "city": "richmond",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "A witness and I saw 2 UFOs within 1 minute in Fishing Bay VA. At 9:50 pm in Fishing Bay VA, I was looking at the sky with another witness on a boat in Fishing Bay when I suddenly noticed a light flying through the sky.  It was moving WAY to fast to be a plane, though it seemed like one.  I tried to ignore the object, but at about 9:51 another object appeared.  It appeared to be a plane like the last one, but again, it was moving WAY to fast to be one.  I took a closer look, and it appeared to have rings around it.  The other witness then told me they could not recognize what they where, and we then concluded they where in fact a UFO.",
      "link": "http://www.nuforc.org/webreports/098/S98681.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf615",
      "summary": "The light was fast going between trees just like the light u see attacking plains",
      "city": "richmond",
      "shape": "light",
      "date": "2013-06-02T00:00:00",
      "story": "The light was fast going between trees just like the light u see attacking plains I was sitting in the back sit of the car i check on my right in the wood it was automatique  i look the light was comming out of the woods there was snow Under it fast to it came in front of the car it pass  Under the light the driver said it was a bird it wasent i know it gone down the hill on me left in a very dark woods creepy to theres a lot of activity mabe a nest pepole see bugs and there scard to deaht hiding Under a car but drunk.  my mom at the age of 17 she sa in the sky just Under the threes a big dark ball it was huge and make a little sound like Wind this sithing was clost from my sighting about 10 mille",
      "link": "http://www.nuforc.org/webreports/098/S98235.html",
      "state": "QC",
      "duration": "5 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6d1",
      "summary": "Seen during Fireworks show. in the last minutes of video (1:10) it jets off real quick and disappears.",
      "city": "richmond",
      "shape": "other",
      "date": "2013-07-14T00:00:00",
      "story": "Seen during Fireworks show.   In the last minutes of video (1:10) it jets off real quick and disappears. http://youtu.be/jjKI8hDz7m8 ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99756.html",
      "state": "KY",
      "duration": "hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bf731",
      "summary": "Very low glowing red orb came towards me and stopped for a few seconds.",
      "city": "richmond",
      "shape": "sphere",
      "date": "2013-09-09T00:00:00",
      "story": "Very low glowing red orb came towards me and stopped for a few seconds. I was walking when I noticed a red glowing orb that appeared just above the tree line then slowly moved towards me then stopped for a couple seconds.  Then it started changing directions while it was moving straight up until it disappeared.   I tried to take a pic when it was close but my camera could not seem to focus on it.  As it was moving up my camera was able focus and snap a pic.  It made no sound at all.",
      "link": "http://www.nuforc.org/webreports/101/S101774.html",
      "state": "VA",
      "duration": ".60"
    },
    {
      "_id": "64d005f478aba2ec5a3bf87d",
      "summary": "Red light around big dipper",
      "city": "richmond",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Red light around big dipper One red light slowly traveling right across big dipper for 1 or 2 minutes then dissapeared.",
      "link": "http://www.nuforc.org/webreports/098/S98782.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf949",
      "summary": "Multiple Triangular Craft over Richmond, Virginia.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2013-09-30T00:00:00",
      "story": "Multiple Triangular Craft over Richmond, Virginia My son was walking the dog and came into the house to tell me he saw UFOs.  We went out in the backyard and for a twenty minute period we witnessed approximately 50 triangular objects with blinking lights flying overhead in a northeasterly direction.  There were two to five visible at any given time over this period. They were not directly over our heads, but as we looked NE, some were to our left, and some were to our right.  We could turn to the SE and pick out new ones, and follow them as they flew out of sight to the NE. We think they were triangular because they generally had three lights.  The lights allowed us to see the solidity of the objects.  The objects were moving in the direction of a side of the triangle; a point of the triangle was in the rear.  The rearmost light was blinking while the front two were steady.  There seemed to be more than just the three lights that defined the triangle. Their flight was straight and steady.  A single object would take about four minutes or so from initial sighting in the SE to going out of sight in the NE.",
      "link": "http://www.nuforc.org/webreports/102/S102600.html",
      "state": "VA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfabf",
      "summary": "Same triangle same area, same time of night, but a month later.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2013-07-03T00:00:00",
      "story": "same triangle same area, same time of night, but a month later. I was again just driving home on the interstate after leaving work, when I noticed a bright light off to my right (between Lancaster road and Barnes Mill Road west of Interstate-75 above Wilgreen Lake).   As I focused in on the object I recognized that the figure was a triangle floating in the sky somewhat low to the ground.   The moonlight made it clear to me that it was triangular shaped.  The lights I first saw, were actually three lights one being on each corner of the craft.   After I recognized what I was witnessing my instinct was to get closer to it, when I increased my speed I watched it go from just hovering to leaving the atmosphere with incredible speed.  This is my second time reporting this in the same area.",
      "link": "http://www.nuforc.org/webreports/098/S98792.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb04",
      "summary": "White lighted aircraft looking object",
      "city": "richmond",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "whit lighted aircraft looking object I was sitting on my deck, and looking west. I saw a bright star then to the right of that I saw this white light moving fairly fast.  It had like an orange looking light on it. I saw this same object a week earlier.  This craft was heading south very fast.  I watched this object for about seven minutes.",
      "link": "http://www.nuforc.org/webreports/101/S101459.html",
      "state": "MN",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc2e",
      "summary": "Orange lights over Richmond va/ d..c.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "Orange lights over Richmond va/ d..c. Woke up too the New Year's Eve fireworks and looked out my upstairs window too see them .. I saw 3 orange orbs moving through the sky till they were out of range.  Fireworks fall to the ground I though but these went in a strait line.  Woke my dad up and he saw the same thing as me so I knew I wasn't going crazy.   Hope this helps.",
      "link": "http://www.nuforc.org/webreports/095/S95800.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfcd1",
      "summary": "Multiple red round objects grouped in a v shaped form appeared moving across the sky then dissapeared into nowhere",
      "city": "richmond",
      "shape": "circle",
      "date": "2013-07-03T00:00:00",
      "story": "multiple red round objects grouped in a v shaped form appeared moving across the sky then dissapeared into nowhere \t I live in Richmond, IN 47374. I witnessed something last night i am unable to comprehend. \tOn the night of June 22, 2013 at approximatly 10:30 pm i noticed a group of 5 to 7 red round shaped objects in a staggered v shape followed by 2 more of the same isolated objects.   I apologize for not counting exactly how many there were but i assure you it was 5 or 7 in the first group.  I was somewhat taken back by what i was witnessing.  They appeared at the south horizon just above a tree line.  They traveled at what seemed to be a slow rate of speed northeast toward an almost full moon.   They then began to dissapear individually about fifteen seconds after they appeared to me.   These objects did not move in an abrupt fashion or shift in any way but in a linear motion. \tThis account took place as i was sitting om my girlfriends front porch patio.   I'm an avid star gazer so naturally i was staring at the sky while my girlfriend went inside to grab her sons overnight bag for him. His grandfather was sitting in his truck in the driveway facing north bound. I  noticed the objects and stood up to get a better look at the event and in awe just pointed at the sky, speechless! As the group shaped in the v pattern began to dissapear Missy, my girlfriend walked out of the front door onto the patio. She noticed me pointing at the sky and cuaght sight of the two objects that followed. They then began to fade into the night sky. At first i thought that they had dissapeared behind cloud cover but after further investigation i realized the sky was very clear with no visible clouds. \tIm not sure what i witnessed but i can tell you that ive never seen anything like it before in my life. After discussing the event with Missy i decided to notify someone of the event. I tried to figure out a logical explanation for what i had seen but was unable to. I  wanted so badly to find out if others had seen the same thing so when i woke up the following morning after a restless night of sleeping i immeditely looked in the paper and browsed the internet for other sightings. I then chose to call the National UFO sighting hotline. I truley hope that others will come forward and tell there stories of the same event if they witnessed this unexplained event. Im willing to testify to what i seen.",
      "link": "http://www.nuforc.org/webreports/098/S98854.html",
      "state": "IN",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd98",
      "summary": "My daughter and I were traveling on route 95 north during a storm when a disc shaped bright light with lightning shooting around it. Ha",
      "city": "richmond",
      "shape": "disk",
      "date": "2013-07-14T00:00:00",
      "story": "My daughter and I were traveling on route 95 north during a storm when a disc shaped bright light with lightning shooting around it.  Happened in front of us both trucks in front us hit there brakes hard when they saw it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100031.html",
      "state": "VA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bff33",
      "summary": "Red flame orb cruising parelle interstate 64 heading east.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "red flame orb cruising parelle interstate 64 heading east saw a red translusent like fireball at a fairly low altitude.  fiance the in car witnessed too. Looked up videos on internet finding same orb in a red orbs reports continue artical.",
      "link": "http://www.nuforc.org/webreports/097/S97524.html",
      "state": "VA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bffc2",
      "summary": "Orange/red lights moving east to west over Richmond's near west end.",
      "city": "richmond",
      "shape": "light",
      "date": "2013-09-09T00:00:00",
      "story": "Orange/red lights moving east to west over Richmond's near west end. Noticed three orange/red lights that at first appeared to be aircraft, but they had no blinking lights.  They also made no sounds.  We could see them come from the east moving west typically in groups of 3s.  They were relatively low.  Did not travel in a line - some where higher, some were lower.",
      "link": "http://www.nuforc.org/webreports/102/S102007.html",
      "state": "VA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c0043",
      "summary": "Orange ball of light flickers and disappears over Richmond, VA.",
      "city": "richmond",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Orange ball of light flickers and disappears over Richmond, VA A few weeks ago (from August 27) my boyfriend and I, saw 3 orange orbs of light in the sky.  They were all heading south east, and rapidly changed direction heading northwest. They moved slowly, and there were no blinking lights indicating human aircraft.  We tried to follow them, but eventually lost sight because of tree lines. Today (August 27) we saw the same ball of orange light.  It was only one this time. We were observing to see if it was the same thing.  We stopped our car to look more carefully when we saw the ball of orange light flicker, as if it were a light bulb.  It wasn't a blink with any kind of rhythm. It flickered about 3 times.  On the third flicker, it disappeared completely.  It was too low in the sky to be covered by clouds.  There were no trees or high buildings for it to go behind in the area. It didn't fade away, it simply flickered and disappeared.",
      "link": "http://www.nuforc.org/webreports/101/S101625.html",
      "state": "VA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c01e5",
      "summary": "Insanely large craft, wierd shape, purpleish blue, blue and white spotlights, very low over my car, flying slow.",
      "city": "richmond",
      "shape": "chevron",
      "date": "2012-12-20T00:00:00",
      "story": "Insanely large craft, wierd shape, purpleish blue, blue and white spotlights, very low over my car, flying slow. I drove home tonight, and on my way, as I pulled out of a friends neighborhood, I could see lights behind the trees.  They looked  really big.  So I then pulled out onto route 112 and parallel to the road, directly above me was the HUGE chevron-shaped aircraft.  I feel as though it must’ve been flying way too low to be a plane and way too slow.  It is a full moon tonight so I could see the actual colors of the vehicle.  It was a dark variation of blacks, blues and purples, and the lights were huge like I guessed- white and blue.  They looked like large round stage spotlights like at a concert.  It was like something out of a movie or comic.  The front was the chevron -shape, but the back had three rounded points coming out of the back.  Kind of like if you flipped it upside-down it’d look like the head of  a tulip. Also a few months ago in the same area, but on route 138 I saw two L-shaped crafts flying one after the other.  They had blue and yellow lights. 4 each- al! ternating along the L. I feel crazy.  Haha.  These flew very fast and a bit higher than the giant one I saw tonight. The one I saw tonight must’ve been 8 12 stories high.  It was that big.    After I saw that  one tonight , when I slowed down on the 40 mph road to watch it creep across the sky, I then saw a jet.  The jet was about the size of a star. This craft was probably 100 times larger than the jet that was very far away. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94889.html",
      "state": "RI",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0317",
      "summary": "Light changes from white to green to red, zigzag pattern but not much distance covered.  ((NUFORC Note:  Sighting of Sirius??  PD))",
      "city": "richmond",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "Light changes from white to green to red, zigzag pattern but not much distance covered A light in the eastern sky below the space station.  Changes colors from white to green to red.  Zigzag movement pattern but not changing position much. ((NUFORC Note:  Sighting of Sirius??  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95924.html",
      "state": "PE",
      "duration": "STILL IN PROGRESS"
    },
    {
      "_id": "64d005f478aba2ec5a3c057c",
      "summary": "White lights on unique object.",
      "city": "richmond",
      "shape": "circle",
      "date": "2013-03-03T00:00:00",
      "story": "White lights on unique object Dropped my husband off at the Richmond Airport & I was returning home.  I just left the airport, I was on Richmond Airport Connector Rd. heading back to I-895 when I saw what I thought was airplane light to my right.  It was too early in the morning for a plane to be flying but I thought that maybe it was a plane returning to the airport after being serviced. As I continued to watch the plane I know that the object was not heading for the airport so I figured that it was a private jet servicing one of the companies in the area.  As I watched the object it stopped and a light was bright shining down.  So now I figured that the object must be police and they were looking for something. As I came up on the object, now on my right side, I noticed that it was an object that I had never seen.  It was hovering over the trees but there was no sound and the trees did not move.  The object was round as a cylinder; the inside was hallow except for two cylinders that went thru the middle.  Half way thru these two cylinders split and made a \"V\" shape.  I was near the object for about a minute, then object took off to the north east. ((NUFORC Note:  We spoke via telephone with this witness, and she seemed to us to be quite sincere.  Her description of the object was so precise and objective, we suspect that she is a very good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96470.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c068b",
      "summary": "Bright light.",
      "city": "richmond",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "Bright light I'm an Over the Road truck driver I was heading southbound on I-75. I was traveling towards Tennessee, and I was on the phone with my uncle and I have recorded time of 12:18 pm EST; when a light appeared coming towards me and I looked to see if it was a plane, but I knew it was not because it was cold outside and planes were leaving jet streams.  Then the light sort of Morfed Flat and speed away very quickly towards the south like if it Blinked at me.  My windshield was clean and the sky was clear.  I have never seen anything like this, the only thing I can say it did freeze me in my tracks!!",
      "link": "http://www.nuforc.org/webreports/095/S95212.html",
      "state": "KY",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0721",
      "summary": "UFO \"Fireball\" Sighting.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2014-01-10T00:00:00",
      "story": "UFO \"Fireball\" Sighting. My wife and I were chatting with the blinds drawn as we looked out our apartment window. We saw a single light, looked like a fireball and we thought it was an aircraft with bright lights as the weather was a bit foggy.  About one minute later we saw another “light” closely following the first.  We went outside onto our porch as this seemed strange as aircrafts do not follow that closely and suprisingly there were no sounds as a low flying aircraft would make.  Then we saw another light following the 2nd.  There were therefore, three of these “fireball” type lights travelling in a horizontal motion. Then, the 1st light slowed down and descended toward the ocean or probably some other direction and faded.  The other two continued on, maintained a distance within each other and did the same.  By the time we got our camera out, it was gone.  It is 1.18 am and the fog has cleared at least by 50% and we are now wondering if these unidentified flying objects, “fireballs”, were using the fog as a cover whilst travelling.  Interesting Indeed would not believe unless we saw.  Amazing, there really are things out there.",
      "link": "http://www.nuforc.org/webreports/105/S105848.html",
      "state": "BC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c09ae",
      "summary": "Blue and green circle took off in two seconds and then was gone.",
      "city": "richmond",
      "shape": "circle",
      "date": "2013-11-11T00:00:00",
      "story": "Blue and green circle took off in two seconds and then was gone I was sitting at a stop light this morning with my friends in the car.  We all seen it.   It was circle and green and blue then it took off fast it was about 2 seconds seen a blue and green trail then it was gone.   We looked at each other confused thought we was going crazy but we all seen it at the same time.",
      "link": "http://www.nuforc.org/webreports/103/S103532.html",
      "state": "VA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0bce",
      "summary": "Orangey spheres over the north end of glenn miller park in Richmond, Indiana.",
      "city": "richmond",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "Orangey spheres over the north end of glenn miller park in Richmond, Indiana. I was laying in bed and saw an unusual flashing light in the north.  I got up and saw 3 or 4 folowing it.  The color was a orange.   As the event went on more and more came over a hill in the northwest section of glenn miller park; traveling east but remaining north.   I went outside with my roommate; there was no sound. the shape was round and some of them had a red glow.  The event seemed timed and somewhat in formation.  Never had seen anything like it.",
      "link": "http://www.nuforc.org/webreports/107/S107802.html",
      "state": "IN",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e77",
      "summary": "White dots forming triangle with one trailing dot. Silent propulsion.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2014-01-16T00:00:00",
      "story": "White dots forming triangle with one trailing dot. Silent propulsion. Was staring at the moon on a clear, cloudless night. Noticed a light moving towards my field of view. Then noticed there were multiple lights, moving in a triangle shape, with a single light trailing in the center, in a sort of arrow shape. The lights were only a few hundred, maybe a thousand, feet off the ground. It moved relatively slowly considering, and was in my field of view for more than 30 seconds. What makes me certain it was either a UFO or experimental craft of some sort was that it was absolutely silent. There was zero noise detectable from the ground where I was standing. It just silently and smoothly cruised across the sky. I have 20/20 vision, am 29 years old, and am gainfully employed in the IT field. This is the first UFO I have EVER seen. I hereby swear that with the exception of the date and time, which I don't recall exactly, the entirety of this recalling is 100% factual with absolutely no intentional exaggeration whatsoever. My only regrets are my good camera was inside and I had aircraft with which to give chase.",
      "link": "http://www.nuforc.org/webreports/106/S106365.html",
      "state": "CA",
      "duration": "~30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f65",
      "summary": "Lights was moving in same directions going in then out.",
      "city": "richmond",
      "shape": "circle",
      "date": "2014-02-07T00:00:00",
      "story": "Lights was moving in same directions going in then out. The objects was moving in same directions and the big one just stopped over my and my brother and my friend head. ((NUFORC Note:  Source of report does not indicate a date of the alleged sighting, and indicates a time in the morning.  We have assigned above an arbitrary time and date, and will amend those data, once we've heard back from the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106857.html",
      "state": "VA",
      "duration": "apartments"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ff3",
      "summary": "Red fireball object seen over east central Indiana.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2014-02-21T00:00:00",
      "story": "Red fireball object seen over east central Indiana. Red fireball appeared coming the northeast.  No sound.  The light didn’t blink, but pulsated.  It made a slow turn to the north and proceeded northerly until out of sight, approximately two minutes.  Maintained the red fireball appearance the entire time. Observer:  59 year-old woman; Software instructor.",
      "link": "http://www.nuforc.org/webreports/107/S107237.html",
      "state": "IN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c150c",
      "summary": "Green and Red lights in the sky around 5:15 PM, Richmond,VA.on I-64",
      "city": "richmond",
      "shape": "light",
      "date": "2013-12-05T00:00:00",
      "story": "Green and Red lights in the sky around 5:15 PM, Richmond,VA.on I-64 I was driving on I-95/64 W,  took the left exit on junction toward I-64W (Bryan Parks Interchange), driving that section and before completely connecting to I-64 W, there was a stationary object in the sky.  I could see it clearly, the 2 distinct lights, one was Red and other one was Green, initially I thought it was an airplane but realized that lights were not blinking and were very prominent like in bright signal lights, also those were like connected to a stationary object and not moving like airplane.  Traffic was very slow, I was able to observe this for sufficient amount of time to confirm that it was an unusual sight, it was a clear dark sky with no other distracting interference.",
      "link": "http://www.nuforc.org/webreports/105/S105044.html",
      "state": "VA",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1805",
      "summary": "See-through orb with changing orbs if light withing orb.",
      "city": "richmond",
      "shape": "oval",
      "date": "2014-07-20T00:00:00",
      "story": "See-through orb with changing orbs if light withing orb. Was heading home from work and I noticed something out of the corner of my eye moving really fast.  Initially thought it was a jet as I seen jet streams so I took random picture in the direction I seen it going and captured some type of orb of light or something I have multiple pictures.",
      "link": "http://www.nuforc.org/webreports/111/S111676.html",
      "state": "MO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1856",
      "summary": "Bright Pulsating RED U.F.O. and Multi-Spectrum U.F.O..",
      "city": "richmond",
      "shape": "other",
      "date": "2014-07-11T00:00:00",
      "story": "Bright Pulsating RED U.F.O. and Multi-Spectrum U.F.O. Whilst spending July 4th with my fiance, we heard fire works going on a few blocks from where I lived.  When we went outside to go look at them before she left, we saw the fireworks briefly stop for a minute and A HUGE red pulsating light a \"few\" thousand feet up near the area of my house, popped up out of nowhere and slowly moved around almost like an observing pattern.  Then immediately stops on a dime, slowly moves again, stops on a dime, but when it finally moved again, it vanishes.   I shrug it off an think it's a helicopter or a blimp that had random lights on it, so I head in my car and start driving down a long road near my neighborhood and see the exact SAME object 5-10 miles away (Estimated by draw distance) pop up again and do the same thing but this time it's pulsating a bright red aura.  I call the TSA (Transportation Security Administration) and they had no idea what kind of object it was, nor had anything in relation to what was described! as this vehicle and so they gave me the number to this website.   If you're reading this I also have additional info on a Multi-Spectrum U.F.O. seen a couple months ago as well along side with this bright RED U.F.O..",
      "link": "http://www.nuforc.org/webreports/111/S111111.html",
      "state": "VA",
      "duration": "30-35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c18d7",
      "summary": "Two Flashing white lights with round shape sphere UFOS  traveling fast.",
      "city": "richmond",
      "shape": "circle",
      "date": "2014-07-20T00:00:00",
      "story": "7/12/2014 at 9:00pm Two Flashing white lights with round shape sphere UFOS  traveling fast. I saw two flying UFOS with bright white lights flashing traveling very fast.  Their shape was round with a sphere across it.  Both UFOS were traveling parallel to each other.   They both flew in front of my house they traveled diagonally going towards of the side of the neighborhood roads.  They were traveling about 15 ft to 25 ft above the height of the houses.   This is my second time seeing a UFO.",
      "link": "http://www.nuforc.org/webreports/111/S111490.html",
      "state": "TX",
      "duration": "50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a27",
      "summary": "Meteor/fireball looking object seen.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2014-07-20T00:00:00",
      "story": "Meteor/Fireball looking object seen. Standing outside in Richmond, looking towards the North Shore Mountains, and saw a \"fire-ball\" looking light.   At first we thought that it might be an meteor or a plane on fire that was about to crash into the mountain.   As it moved, a long tail trailed the large \"fire-ball\" east and suddenly stopped moving for a few seconds and dispersed into two \"fire-ball\" objects.   They then started going back west and stopped again and looked to have disappeared.   The \"fire-ball\" light had gone and now they started to flicker with a blue and white light.  They had turned again and traveled east fast and upwards.  It was very strange how it had gone from a large \"fire-ball\" looking object to a smaller flickering object.   The whole experience and now knowing that there is something out there is very unsettling.",
      "link": "http://www.nuforc.org/webreports/111/S111545.html",
      "state": "BC",
      "duration": "10.00"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ac1",
      "summary": "((HOAX??))  BIG FIRE BALL ON I-64 MAKING AN AWFUL SOUND ,SHOT TWORDS THE GROUND AND THEN EXPLODED.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2014-06-04T00:00:00",
      "story": "BIG FIRE BALL ON I-64 MAKING AN AWFUL SOUND.  SHOT TOWARDS THE GROUND AND THEN EXPLODED. ((NUFORC Note:  We suspect that the report is a hoax.  The source elects to remain totally anonymous, and provides no contact information.  Date is flawed.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109647.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c20de",
      "summary": "Lolling out of my apartment window I noticed two large white lights that looked like airplane running lights. Upon watching this craft",
      "city": "richmond",
      "shape": "cylinder",
      "date": "2014-06-04T00:00:00",
      "story": "Lolling out of my apartment window I noticed two large white lights that looked like airplane running lights.   Upon watching this craft further- two bright red and green lights appeared between the two white lights and pulsated brightly. The lights appeared to be moving in a circle and quivering. Ran to go out on the porch to get a closer look and the lights grew very bright and the craft disappeared.",
      "link": "http://www.nuforc.org/webreports/109/S109931.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c210a",
      "summary": "We saw a triangular craft with white lights in the sky traveling from Lexington, Kentucky home to Barbourville, Kentucky.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2014-04-24T00:00:00",
      "story": "We saw a triangular craft with white lights in the sky traveling from Lexington, Kentucky home to Barbourville, Kentucky. On Saturday my sister her husband and my niece and nephew and I where taking a short trip from Barbourville, Kentucky to Lexington, Kentucky to check out the malls.  On the way back home going through Richmond I saw a white light in the sky in front of the car that went from bright to dull to bright again.   Then as the highway made a turn I could see it out of the back passenger side window.  That was when I got a closer look at the thing.  It looked like it was closer to the car by then and I could clearly see a dark triangular craft with white lights on each of the three corners.   The thing was low enough that if it was an airplane it would make noise but I didn't hear a sound from it.   I watched it out the window for about ten seconds then all the sudden it disappears.  Absolutely no trace of the thing.   For about a minute I kept my eyes glued to the window trying to find it but nothing.  My sister's husband saw it too.  I am baffled, airplanes have blue and red blinking lights I know I love airplanes very much.   This was no airplane that I have ever seen in my life.   The first thing I thought to do after our sighting was to report it to you Mr. Davenport.",
      "link": "http://www.nuforc.org/webreports/108/S108810.html",
      "state": "KY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c21e3",
      "summary": "Flying reddish &quot;V&quot; shape w/ moving lights over Richmond, Va.",
      "city": "richmond",
      "shape": "changing",
      "date": "2014-04-11T00:00:00",
      "story": "Flying reddish &quot;V&quot; shape w/ moving lights over Richmond, Va \tOn 4/2/14, I was sitting in my backyard in Richmond, Va, with my girlfriend and her friend at about 9:00pm.  We were talking about something or other and out of the corner of my eye I noticed something strange.  At first glance I thought it was a flock of birds in a “V” formation but after I looked closer, I realized they were lights with a reddish-white glow.   There were approximately 10-12 of these lights forming the shape and the V was not a solid shape, with each light moving individually and the “V” shape was changing as well, with one side becoming longer and almost straightening out into a full line as it flew across the sky.  After I noticed it, I pointed it out immediately and the other two people witnessed it as well.  It was a clear night and the lights stood out greatly in contrast to the sky.  The entire event lasted about 20-25 seconds.   The lights came from the north-east sky and travelled of in a western direction.  The lights came overhead of us and past us and then just disappeared from sight.  They didn’t appear to move away quickly as they were before but they just simply disappeared. \tI am a business professional with a college degree and I have never experienced anything like this.  I can usually explain most things of this nature but the way this craft moved was the most inhuman thing I have ever seen.  So fluid and quiet, no sound from engines and each light in the “V” formation was moving independently with all the lights finally almost completely straightening out before disappearing. \tDefinitely strange and most certainly not anything of this world.",
      "link": "http://www.nuforc.org/webreports/108/S108336.html",
      "state": "VA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2314",
      "summary": "I'm a trucker but when I was going north on interstate 95 somewhere around Richmond Virginia . I saw 3 aluminum looking balls flash in",
      "city": "richmond",
      "shape": "",
      "date": "2014-04-04T00:00:00",
      "story": "I'm a trucker but when I was going north on interstate 95.  Somewhere around Richmond Virginia, I saw 3 aluminum looking balls flash in different locations near each other.  Just after a white flying saucer with a brown line in the middle appeared then disappeared.    Then after the aluminum balls appeared then disappeared a dark tan camouflage jet was hovering.  Maybe a harrier jump jet because it didn't look like an air force jet.   It was last week.  Around 3/25/14 during the day.   Maybe they can bend light to disappear since the aluminum balls and white saucer then the tan camouflage jet appeared in the same area. ((NUFORC Note:  Time and date above are approximate.  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108192.html",
      "state": "VA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c2480",
      "summary": "Photographed & Videoed Weird Small Glowing Morphing Cylinder-Orb UFO/Entity Hovering in Tree Behind Neighbor's House",
      "city": "richmond",
      "shape": "cylinder",
      "date": "2014-11-06T00:00:00",
      "story": "Photographed & Videoed Weird Small Glowing Morphing Cylinder-Orb UFO/Entity Hovering in Tree Behind Neighbor's House During a later-than-normal exercise walk I was prompted to notice a small, glowing, weird rod-shaped object hovering approximately 30 feet above the ground in the flimsy, leafy, outer branches of a large tree behind a house in my tranquil, heavily-wooded suburban neighborhood of Stratford Hills in Richmond, Virginia. I'm 54 years old and I've been walking this route nearly every day for ten years and what I beheld at 11:33 p.m. on a very quiet Sunday night was abnormal and totally out-of-place!  Most of my neighbors probably were in bed.  I was fortunate to view the mysterious glowing object that seemed to be hiding up in the tree and I partially attribute my good fortune to the fact that it was a new moon - the darknest night of the month!  The silent UFO first was rod-shaped with a glowing blue light on the left end and a pinkish-violet light on the right end.  It was hovering horizontally in a place where a human could not be.  It was not a new-fangled bug zapper and there are no cable-TV or electric lines running near the tree and definitely not at that height.  No logic for the uncanny faintly-glowing lights in the tree. So I stopped and shot video with my iPhone 4S but with no zoom in vid mode I switched to still-shot so I could peer closer.  I took 30 pics spanning about ten minutes and during this time the small anomalous cylindrical UFO/entity? morphed into an orb which sometimes appeared cobalt-blue and other times violet with a freaky purplish core.  Then it morphed back into a rod that was more white colored and appeared to be segmented, reminiscent of a bacterial rod under a microscope. This flying object ain't one of ours - NOT a drone, stealth bomber, planet Venus, or swamp gas. I did not hear any sounds coming from the object that night but later when I downloaded the video I was surprised to discover that my iPhone had picked up some intriguing clicking noises and when I showed the video to my neighbor S-- she said \"It sounds like Morse code.\"  Not meaning that it actually was Morse code but that it definitely sounded like some form of code and/or intelligently-contrived electronic signal. I stood motionless and alone on the shoulder of the street for approximately ten minutes, taking video and photos, before continuing my usual walking route home as I already was walking later than normal and did not want to be out after midnight.  The small, glowing, cylinder-orb UFO/entity still was hovering up in the tree when I left the scene and I have no way of knowing how long it may have lingered behind my neighbor's house that night?  So far, I have not shared this with the people who live in the house where the sighting took place because I did not want to run the risk of freaking them out, but coincidentally enough, they started leaving their back-porch floodlights on immediately in the wake of me seeing the UFO in their backyard.  I did, however, tell one of their male neighbors and B----- agreed with me that maybe his neighbors who live in the house in question saw the object too and it spooked them?  For the record, my neighbor's back-porch and backyard floodlights again were burning brightly when I passed during my walk tonight, 10-29-2014, before submitting this report to NUFORC. I've been watching for the UFO/entity ever since during my exercise walks but no encore yet, and I wasn't even going to submit a report because I didn't know whether this clicking, glowing, morphing rod/orb was an \"alien/UFO\" or spiritual entity, but then some other odd \"occurrences\" came to my attention that made me change my college-educated mind:  1. My sighting in Richmond was at 11:33 p.m. on August 24, 2014 and just four hours later at 3:30 a.m. on August 25, 2014 a motorist on I-295 N near the Hopewell exit, which is only 22 miles south of Richmond, was followed up the road by a bright UFO orb that was moving a lot faster than manmade highway traffic.  Then the orb targeted another car in the southbound lanes and when the sphere made contact with the other vehicle both the orb and car vanished into thin air!  Then the driver of the first car saw the orb reappear, and when it started following their car up the highway again they became \"terrified,\" put the pedal to the metal, and made a hasty retreat off the next exit in sight.  I learned of this fascinating occurrence at the National UFO Reporting Center (NUFORC). 2.  Then a few hours later around 9 a.m. on August 25, 2014, a seasoned colonel in the U.S. Air Force Reserve was killed when his F-15 fighter jet crashed under \"mysterious circumstances\" in the Blue Ridge Mountains west of Richmond near Deerfield, VA.  Coincidentally enough, this was in an area where lots of residents have reported UFOs in the sky and orbs near the ground.  They say it took two days to recover the colonel's body and the official Air Force story was that he was from Massachusetts on a \"routine training mission.\"  Synchronistically enough, I also heard  NUFORC's esteemed Director Peter Davenport mention this odd fatal F-15 jet crash in Virginia's mountains during his Oct. 17, 2014 appearance on Coast-to-Coast AM radio with host George Noory.  Keep up the good work Peter as the efforts of you and your associates are greatly appreciated by a world starving for accurate, thoughtful information and truth. I'm not going to speculate or draw conclusions, but it seems like an awful lot of high strangeness for such a small region in ten hours!  Last but not least, a couple of weeks after my \"close encounter\" in Richmond, Virginia USA I was prompted to discover a seemingly-credible YouTube video of a small blue-pinkish-violet rod-shaped UFO that a man and woman in Ontario Canada videoed while sitting around a campground firepit and the anomalous silent hovering object looks uncannily similar to the UFO that I photographed in Richmond, VA when it was in \"rod mode.\"  The Ontario sighting was on August 20, 2014, only four days before my sighting in Virginia, and the Canadian couple was prompted to upload their video to YouTube on August 24 which synchronistically was the same day as my sighting!  Upon request, I will gladly make my photos and video available to Director Peter Davenport and NUFORC.  Ref:  http://nuforc.org/webreports/112/S112877.html  http://www.kait8.com/story/26383364/mass-f-15-fighter-jet-crashes-status-of-pilot-unknown  https://www.youtube.com/watch?v=21D9jaxNwRc",
      "link": "http://www.nuforc.org/webreports/114/S114678.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2904",
      "summary": "Around 21:58 I noticed a flying object above Road KY25 at 2324 Lexington Road in Richmond, KY. The object slowly traveled in the same e",
      "city": "richmond",
      "shape": "disk",
      "date": "2014-09-25T00:00:00",
      "story": "Around 21:58 hrs., I noticed a flying object above Road KY25 at 2324 Lexington Road in Richmond, KY.  The object slowly traveled in the same elevation to West direction and stopped about 1 mile West from Road KY25 at about 500 feet elevation.  The object stayed at the same location for about 13 minutes, then took off with an unbelievable speed in 45 degree angle and disappeared.  The object had a dome shape and lights were on the bottom of it - about 8 lights spread in a symmetrical shape.   The object seemed to investigate something on the ground, then took off.  I wonder what is located around Richmond, KY, to capture their interest?",
      "link": "http://www.nuforc.org/webreports/113/S113704.html",
      "state": "KY",
      "duration": "13 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bd3",
      "summary": "Bright solid light.",
      "city": "richmond",
      "shape": "light",
      "date": "2014-10-10T00:00:00",
      "story": "Bright Solid light Witnessed a very bright, solid white light that resembled a satellite moving slowly from East to West.  Moving very slowly and with no sound.  It looked very similar to previous sightings of the ISS but the object was getting darker as it approached the West horizon (should be the other way around...brighter going towards the sun).   Object was no longer visible once it was too far to the West.",
      "link": "http://www.nuforc.org/webreports/114/S114348.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3423",
      "summary": "Two lines of horizontal lights stationary.",
      "city": "richmond",
      "shape": "other",
      "date": "2015-04-08T00:00:00",
      "story": "Two lines of horizontal lights stationary. Driving down interstate by Richmond there were two horizontal lines of lights about six lights on each level it hovered stationary while we drove under it we had photographed it but the photo did not come out so well",
      "link": "http://www.nuforc.org/webreports/118/S118279.html",
      "state": "VT",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3453",
      "summary": "Blue light fireball shape shifted into several indescribable shapes and protrusions of light across the night sky.",
      "city": "richmond",
      "shape": "changing",
      "date": "2015-03-26T00:00:00",
      "story": "Blue light fireball shape shifted into several indescribable shapes and protrusions of light across the night Sky. Sitting outside in my car, talking to a friend, looking east into the night, cloudy sky, I see a light ball, almost like an indescribable low beam fluorescent foreign glowing light, on fire with blue flames, gliding slowly across the atmosphere not in a normal straight way.   It shifted shape every few seconds and had long protrusions of light coming outward every second or so in an irregular formation.   There was no actual physical aircraft that I could tell, but simply a shape shifting blue type light that changed shapes and drifted off into the west and disappeared into the horizon. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117969.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a98",
      "summary": "Looking S near Richmond, MN.  It was a horizontal flash, larger than a jet in three separate jagged lines...not lightning.",
      "city": "richmond",
      "shape": "flash",
      "date": "2015-08-06T00:00:00",
      "story": "Looking S near Richmond, MN.  It was a horizontal flash, larger than a jet in three separate jagged lines...not lightning. 5 of us were on our pontoon boat and I saw a horizontal flash of light in 3 separate lines across the sky…there is no way it was a plane…  It only lasted a few seconds, but it was bright..then gone.   The length of the light flashes was 3 times longer than a jet from the distance I saw it…it was not lightning as there was not a cloud in the sky",
      "link": "http://www.nuforc.org/webreports/120/S120840.html",
      "state": "MN",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b57",
      "summary": "Large, silent blue meteor like object fly over James River and quickly disappear.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2015-08-06T00:00:00",
      "story": "Large, silent blue meteor like object fly over James River and quickly disappear. My boyfriend and I were walking home to The Fan neighborhood from a friends house on the south side near Midlothian, early in the morning, between 3:30 and 4 AM.  We were crossing the \"35 cent bridge\" that goes over the James River, when, to our left, we saw a blue shooting star-like object with a trail of what looked like smoke fly west for about 2 seconds before completely disappearing.   My first thought was that it must be a meteor, but it was way too low in the sky and was flying too slowly.  It made no sound and like I said it disappeared after a couple seconds.  The whole thing happened pretty quickly, and was like nothing I have ever seen before.  There was another person walking toward us going the opposite direction over the bridge and when we crossed paths we asked him if he had seen it too.  He said he did and just as we were describing it to each other, we both saw another object flying farther away and in another direction (north), but this one was not blue or particularly lit up.  It appeared much smaller as it was much farther away and was going much faster.  After searching the Internet for meteor showers in the region or anything to explain what it might have been I have found nothing.",
      "link": "http://www.nuforc.org/webreports/120/S120852.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ebf",
      "summary": "Flickering fireball silently flying parallel to plane across the sky a few hundred feet in the air.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2015-06-15T00:00:00",
      "story": "Flickering fireball silently flying parallel to plane across the sky a few hundred feet in the air. 2 lights popped up over the horizon, one a plane, and one that looked like a petri dish that was full of a flammable liquid set on fire... it was more like fire and flickering coming up out of it than a fireball.   Only a few hundred feet from the ground, it moved silently parallel to the plane and went from one side of the sky to the other in a straight line.   Two pizza delivery personnel and my fiance saw this and we're unable to explain it.",
      "link": "http://www.nuforc.org/webreports/119/S119430.html",
      "state": "VA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c409a",
      "summary": "Obect shooting something from it.",
      "city": "richmond",
      "shape": "circle",
      "date": "2015-05-22T00:00:00",
      "story": "obect shooting something from it I was on my way home when I look up in the sky I noticed a light not like a plan it was bright and had red coming from it.  It look very different.  As I was look at the first one my dad said that it was another one.  I continued to look at it and it shot something from it,something I never seen before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119026.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42bb",
      "summary": "UFO above highway with yellow orange lights",
      "city": "richmond",
      "shape": "sphere",
      "date": "2015-04-23T00:00:00",
      "story": "UFO above highway with yellow orange lights Seen ufo in the sky when entering the highway right off Laburnum Ave in Richmond, VA.  I believe the object was sphere shaped.  It was really hard to tell because the left side of the ufo was slightly dark and the right side was a yellowish orange color.   The color looked like it was moving in a motion like a flying saucer would but becomes dark on the left side of the object.   The object was at a pretty good distance above the highway and then at a 45 degree angle the object zoomed off within 2 sec and disappeared.   2 other cars were on the highway as well in front of me but I'm not sure if they actually paid attention to it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118590.html",
      "state": "VA",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c46ae",
      "summary": "Not sure it was UFO related, however I saw three bright lights in a straight line and what was odd about one was that it was far TOO la",
      "city": "richmond",
      "shape": "light",
      "date": "2015-10-29T00:00:00",
      "story": "Not sure it was UFO related, however I saw three bright lights in a straight line, and what was odd about one was that it was far TOO large and bell-shaped and was surrounded by what I can only describe as lines of light much like arrows or spider-legs surrounding it.   I also saw the object quicky merge with what I believe was a star and for a split second I saw that thet had conjoined before changing back to its odd shape.  What stood out were the lines of light surrounding the main object.   I think the other two objects were stars however the third star was red and may have been a planet so I am not sure.",
      "link": "http://www.nuforc.org/webreports/123/S123028.html",
      "state": "VA",
      "duration": ">10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c49b6",
      "summary": "Similar to bright stars, with slight movement and color change.",
      "city": "richmond",
      "shape": "light",
      "date": "2015-09-25T00:00:00",
      "story": "Similar to bright stars, with slight movement and color change. My friend and I witnessed 3 points of light that looked like bright stars.  These lights were whitish, but seemed to have blinking colors of light that would change every so often, but then return to a whitish hue.  These lights were quite spread out, and were brighter than the surrounding stars, and seemed to move slightly up, down, left and right in a small space, like they were trying to not make too much motion to try to blend in as stars, but they were definitely not static lights, but not a whole lot of movement.  I witnessed these lights to remain in the sky for hours, and I've never seen anything like it before, blew my mind, even called the police non emergency line to see if they received any other reports, and they said that they did not. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122157.html",
      "state": "VA",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a6d",
      "summary": "A star fades into nothing and then slowly flashed ( brighter than the North Star) and fades away again 3 times changing positions.",
      "city": "richmond",
      "shape": "flash",
      "date": "2015-10-09T00:00:00",
      "story": "A star fades into nothing and then slowly flashed (brighter than the North Star) and fades away again 3 times changing positions. A star (no brighter than any other star) faded into nothing. 20 seconds later, in the same spot it flashed brighter than the North Star.  It was a slow flash.  About a minute later, slightly to the right, it flashed again.  It did this 2 more times.  It was not an airplane, not a satellite, not anything I can figure out.",
      "link": "http://www.nuforc.org/webreports/122/S122611.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c52ed",
      "summary": "Large circle, possibly 6 sided. with green and red lights rotating.  Held stationary for 20 minutes then slowly moved off toward north.",
      "city": "richmond",
      "shape": "circle",
      "date": "2016-01-05T00:00:00",
      "story": "Large circle, possibly 6 sided. with green and red lights rotating.  Held stationary for 20 minutes then slowly moved off toward north.  Southwesterly hovering about 3500 ft altitude. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124891.html",
      "state": "",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c544e",
      "summary": "Black Triangle shaped with bright white lights flying by 95 in Richmond",
      "city": "richmond",
      "shape": "triangle",
      "date": "2015-12-17T00:00:00",
      "story": "Black Triangle shaped with bright white lights flying by 95 in Richmond Was driving to Canada from Florida and was near Richmond on 95 when girlfriend though there was a thunderstorm because there were big flash outside.  I didn't mind, but around 30 sec later, I checked to my right and saw a black triangle shaped \"UFO\" with big bright white lights to each corner flying by.",
      "link": "http://www.nuforc.org/webreports/124/S124618.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5712",
      "summary": "Lights in pattern, under the clouds.",
      "city": "richmond",
      "shape": "",
      "date": "2016-07-15T00:00:00",
      "story": "Lights in pattern, under the clouds Flash of light, underneath the clouds, just after dusk.  4-6 lights, one bluish, one greenish, others were white.... going across the sky but 100% under the clouds",
      "link": "http://www.nuforc.org/webreports/128/S128439.html",
      "state": "ME",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5842",
      "summary": "Slow, low floating triangular orbs, self-obscured, self generated cloud.",
      "city": "richmond",
      "shape": "other",
      "date": "2016-06-10T00:00:00",
      "story": "Slow, low floating triangular orbs, self-obscured, self generated cloud. The kids were playing their Saturday morning soccer game.  One parent said, \"Look at that cloud.\"  It was dark and small and much lower than the overcast ceiling of around 3000 ft.   It was floating westward then abruptly changed direction and floated back toward our field,southward.  It stayed around 500 ft as it moved and was about the size of a house.  In it were 3 or 4 objects, partially obscured.   It was VERY distinctive.  It was not natural.  One parent said that it is retaining a triangular shape.  Many of us took pictures.  One lady said she thought it best not to. LOL!  I told her she was probably right.",
      "link": "http://www.nuforc.org/webreports/127/S127750.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c584c",
      "summary": "Clear, bright morning, 11:05 am, saw a pure white cylinder-shaped object in the sky above the tree lines, sailing fast.  No wings.",
      "city": "richmond",
      "shape": "cigar",
      "date": "2016-06-16T00:00:00",
      "story": "Clear, bright morning, 11:05 am, saw a pure white cylinder-shaped object in the sky above the tree lines, sailing fast.  No wings. Was heading North to home around 11:05 am..  as we were going down hill, I look to the left of me an saw a low flying white cylinder shape object sailing beside us, beyond the tree line,  told my friend to look..as we were looking it pick up fast speed, did not make any sound.. an we watched it sail northward real real fast..  it seem to turn slightly heading Northwest as it sailed fast across the sky..  it did not have any wings or tail..  it was a pure white..  the sky was clear blue with a couple of white fluffy clouds..",
      "link": "http://www.nuforc.org/webreports/127/S127881.html",
      "state": "KY",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c64f8",
      "summary": "This was not like anything I have seen in sky.",
      "city": "richmond",
      "shape": "flash",
      "date": "2016-08-02T00:00:00",
      "story": "This was not like anything I have seen in sky. Soon as walked out door in county a big blue flashing light caught eye.  Moving fas for the horizon, it paused, dashed right, then left at very high speeds then continued out of sight over a tree horizon.",
      "link": "http://www.nuforc.org/webreports/128/S128750.html",
      "state": "KY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ee7",
      "summary": "Large stationary object in the atmosphere reflected by the sun.",
      "city": "richmond",
      "shape": "circle",
      "date": "2017-08-17T00:00:00",
      "story": "Large stationary object in the atmosphere reflected by the sun. Large circular object in the sky.  I noticed a circular object in the sky that looked a lot like a star, but it was too early for a star to shine that bright.  The sun was reflecting off of it, and when dusk came, the object slowly dimmed, until I could not see it anymore.   Did not move at all the entire time it was visible.   It was positioned to the southeast of Richmond Ut.  I've seen the space station pass before, and satellites, but never something that is stationary for that long at that height, and that big.   Took a video for about 2 minutes, when I first saw it around 8:30 at night.",
      "link": "http://www.nuforc.org/webreports/135/S135676.html",
      "state": "UT",
      "duration": "2  hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c712f",
      "summary": "Bright white shape closer and brighter than plane moved accross night sky from southwest to north. Notably close, no lights flashed.Ste",
      "city": "richmond",
      "shape": "teardrop",
      "date": "2017-07-27T00:00:00",
      "story": "Bright white shape closer and brighter than plane moved accross night sky from southwest to north.  Notably close, no lights flashed.  Steady white and bright.  Crossed night sky in approximatly 20 seconds.  It moved faster than plane in sky, it was also closer.  No trail was left.  No sound.",
      "link": "http://www.nuforc.org/webreports/135/S135319.html",
      "state": "ME",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7453",
      "summary": "Thought it was a plane, but it stopped moving.  ((NUFORC Note:  Sighting of Venus??  PD))",
      "city": "richmond",
      "shape": "changing",
      "date": "2017-05-15T00:00:00",
      "story": "Thought it was a plane, but it stopped moving. Came out on my front porch after waking up.  Noticed what I thought was a plane in the distance, looked like it had red lights on its under side but then when I looked again it just stopped.  It got brighter, almost like it \"pulsed\" but then it dimmed down again.   I woke my husband up, he couldn't figure it out either.  It's been sitting in the same spot for almost an hour over Albany.  It's far too bright, and low, to be a star.",
      "link": "http://www.nuforc.org/webreports/134/S134084.html",
      "state": "CA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c756d",
      "summary": "Huge fireball orb above YVR Airport Vancouver, Canada.",
      "city": "richmond",
      "shape": "fireball",
      "date": "2017-04-28T00:00:00",
      "story": "Huge fireball orb above YVR Airport Vancouver Canada Around 1:05 am, I noticed a huge fireball orb in the sky.  After zooming in the picture, I noticed something in the middle.  The ball never moved an inch, and stayed for about 12 minutes.  I found it a little strange it was so close to the airport. ((NUFORC Note:  Witness does not indicate a date for the sighting, so we have assigned an arbitrary one, until we hear from the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133780.html",
      "state": "BC",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c76d0",
      "summary": "Daytime Sighting of Black Cone-Shaped Object Hovering in Sky.",
      "city": "richmond",
      "shape": "cone",
      "date": "2017-12-21T00:00:00",
      "story": "Daytime Sighting of Black Cone-Shaped Object Hovering in Sky On June 28, 2017, I was helping family members move into a new house.  At 2:37 pm, I was driving back to their old house to pick up the next load, when I noticed a stationary black object in the sky above the tree line in front of my car.  The jet black object caught my eye because it stuck out conspicuously against the crisp blue sky.  I immediately realized it was something out of the ordinary.  Excited and perplexed, I stopped the car and fumbled to get my phone out to capture it on video.  The object hovered silently and motionless in the sky.  It appeared to ascend slightly and very slowly at one point.  Otherwise, it did not move at all.  (A close review of the video suggests it also may have rotated along its vertical axis, like a spinning top, but I did not see any rotation while watching it with my own eyes).  It made no sound.  It was shaped like an upside-down cone or pyramid.  It had a distinct, sharp outline against the sky.  It looked dense, heavy and sturdy, and not made of flimsy or lightweight materials.  It definitely was not a natural object (e.g., a cloud or bird).  It looked mechanical, like some sort of machine.  But it did not have any discernable features of an aircraft (e.g., wings, propellers or a tail) or anything else that can fly.  It had no visible propulsion system or other means of flight.  It appeared shiny and shimmered somewhat, which I believe was sunlight reflecting off its surface.  Otherwise, it did not emit any light.  I asked a family member driving behind me if he saw the object (he did) and knew what it was (he did not).  He was not as interested in the object as I was and drove away.  After filming for about a minute, I also drove away because we were on a tight schedule.  I continued to watch the object as I drove and realized it was much higher up and farther away—and therefore much bigger—than I initially thought.  I recorded three videos.  The first one at 2:37 p.m. is through my windshield and, unfortunately, does not keep the object in the frame very well.  I captured the second video through my open window at 2:38 p.m., a few hundred yards down the road.  I stopped again about a quarter mile farther down the road to record the third video at 2:39 p.m.  After that, I continued to look at the object while driving but lost sight of it around 2:42 p.m., when trees along the road obscured my view of the sky.  The last time I saw the object, it was still hovering in the same spot where I first noticed it.  I have speculated that the object could have been a balloon, a kite or a drone.  I ruled out the first two options mainly because it did not behave—e.g., sway, pitch or pivot—like something that was tethered to the ground while flying.  Although a drone is the most plausible explanation, I do not think this was a drone.  The object was too high (~300-1000 ft.) and too large (~5-20 ft. tall) to be a drone, at least one available to the public.  It was also too motionless, for too long.  It did not drift or tilt in the wind; it simply did not move.  Even an experienced drone pilot probably cannot keep one completely still for several minutes in outdoor conditions.  I do not contend that the object I saw was (or was not) extraterrestrial.  I honestly do not know what it was or where it came from.  But I definitely saw something—a tangible object—in the sky that I cannot identify or explain.",
      "link": "http://www.nuforc.org/webreports/137/S137864.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7724",
      "summary": "UFO by  Richmond Chevron plant.  ((anonymous report))",
      "city": "richmond",
      "shape": "oval",
      "date": "2018-01-12T00:00:00",
      "story": "UFO by  Richmond Chevron plant. I was driving back home from work.  I was at a red light, when suddenly, I look over the horizon, I saw an oval metallic shape UFO floating/steady over some power lines  near some train rail track and overlooking the chevron refinery.   When I realized what I was looking at, I decided to turn around to recorded on my phone but it was too late, it was gone/disappear.  But I can assure you it wasn't a drone, it didn't have any fan looking propeller or power source. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138224.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7851",
      "summary": "((HOAX??))  UFO richmond, KY  ((anonymous report))",
      "city": "richmond",
      "shape": "changing",
      "date": "2017-12-21T00:00:00",
      "story": "UFO richmond KY Witnessed two shapes that over a period of two hours stayed within range but stationary one higher and to the left of the other.  They Changed shapes also seemed to have a bright bar like core but grew, red and almost blue lights at times. Shapes ranged from saucer like to oblong to odd pattern.  Two planes flew towards at one point then backed off but the crafts did not move.  I have witnessed similar crafts in Texas and here in Richmond before.   Definitely a UFO. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137896.html",
      "state": "KY",
      "duration": ">2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c01",
      "summary": "Ice blue orb of light slowly travels through sky and disappears",
      "city": "richmond",
      "shape": "light",
      "date": "2017-10-19T00:00:00",
      "story": "Ice blue orb of light slowly travels through sky and disappears While driving a light caught my eye.  It appeared suddenly enough to be a shooting star.  An orb of ice blue light moved slowly across the sky and then It didn't just disappear, the light swiftly eclipsed away.  The large size, slow speed and the way it disappeared were all unusual.",
      "link": "http://www.nuforc.org/webreports/136/S136808.html",
      "state": "VT",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d84",
      "summary": "Black triangle over Texas.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2017-09-08T00:00:00",
      "story": "Black triangle over Texas. My wife and I had our neighbors over for dinner.  It was about 9:30 or 10:00.  When my neighbor saw this thing just appear.   It was a black triangle the moon was coming up so you could see the outline on the sky.  It had a grid of lights across the bottom, larger ones on the edges.  They were flashing and changing all colors. It moved north to south over the top of the houses in my back yard.  Much bigger than an airplane.   It moved steadily and silently across the sky at a good rate of speed.  We watched it just slowly fad out and disappear at a steady speed.   Their was three of us that witnessed it and it lasted about 15 seconds.",
      "link": "http://www.nuforc.org/webreports/136/S136069.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d9f",
      "summary": "Large black triangle with red lights, hovering very low over national box-store.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2018-06-07T00:00:00",
      "story": "Large black triangle with red lights, hovering very low over national box-store. Driving home at dusk, I saw a very large black triangular craft.  It was hovering at low altitude in the middle of a suburban shopping area, right outside of the City of Richmond.  I was smoking a cigarette so the window was down, but I heard nothing out of the ordinary.  This object was completely silent.  I got a very good look at it when stopped at a traffic light.  It was hovering right over a national box-store, at no more than twice the hight of the building itself. This triangular craft was immense!  If I had to estimate its size, I’d say it was at least that of a football field, if not larger.  It was an isosceles triangle, black in color, except for seven red circular lights on the underside of the craft.  Each vertex had a large-sized light, and there was another at the triangle’s center.  From this larger center light there ran a row of three smaller red lights, down to the unequal side’s edge. It was astounding to see this extraordinary object juxtaposed on a perfectly typical, American landscape scene.  Its been tough to forget this, and I've yet to rationalize what I saw as being anything other than a \"UFO.\"  Thus I figured it was time to submit my report.",
      "link": "http://www.nuforc.org/webreports/141/S141721.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e10",
      "summary": "Very low flying triangle shape craft, lights on edges and floated above roads for a few seconds.  ((anonymous report))",
      "city": "richmond",
      "shape": "triangle",
      "date": "2018-06-01T00:00:00",
      "story": "very low flying triangle shape craft, lights on edges and floated above roads for a few seconds before effortlessly floating over to tree area and disappearing ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141692.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fe8",
      "summary": "Driving home, spotted lights, thinking it was a a/c or helicopter.  It was still and quiet, with flashing lights. ((anonymous report))",
      "city": "richmond",
      "shape": "circle",
      "date": "2018-04-13T00:00:00",
      "story": "Was driving home and spotted lights, thinking it was a airplane or helicopter.  It was still and quiet, with flashing lights.   As I drove closer in its direction, I notice the lights for brighter, then it begin to move in the same direction as me, but it had a glide like motion.  I stopped the car, then it turned around and glided in the opposite direction.  This was no airplane it helicopter.  I always thought people were ta ta in the head saying stuff like this, but now that I saw it...and someone else with me did to...seems unbelievable.",
      "link": "http://www.nuforc.org/webreports/139/S139372.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8406",
      "summary": "It was night. Object started as a bright white light behind light cloud coverage. Soon it became more clear as an object that seemed to",
      "city": "richmond",
      "shape": "unknown",
      "date": "2018-10-12T00:00:00",
      "story": "It was night. Object started as a bright white light behind light cloud coverage.  Soon it became more clear as an object that seemed to be entering the atmosphere/ falling.  The object seemed to be burning white asvit fell and had two long tails on either side at an angle making a triangular shape.  The object fell for several minutes and disapeared at distant hills/houses. We were on the freeway (I wasn't the driver) and I was using my phone so the video didn't catch as much as the naked eye did.",
      "link": "http://www.nuforc.org/webreports/143/S143443.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8531",
      "summary": "A wobbling, slightly moving object with 1-3 visible flashing red lights.  ((NUFORC Note:  We suspect a sighting of Mars.  PD))",
      "city": "richmond",
      "shape": "unknown",
      "date": "2018-09-27T00:00:00",
      "story": "A wobbling, slightly moving object with 1-3 visible flashing red lights. Last night I saw an unusual \"thing\" in the sky.  It was directly south at the 12:00 position.  It caught my eye because it was moving, but not far.  It was more like a wobble, changing short positions in the blink of an eye.  I got the binoculars out and saw there were several red lights flashing in different positions on the \"thing\".  My husband insisted it was the Planet Mars.  I've never seen Mars with flashing red lights. I checked on it again around midnight and it was gone.  I posted the info on social media and others claimed to see it, too.  I'm skeptical of their claims.  Thank you~ ((NUFORC Note:  We suspect a sighting of Mars.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143285.html",
      "state": "VA",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c873b",
      "summary": "UFO disc reflecting sun while hovering silently north of Richmond, VA.",
      "city": "richmond",
      "shape": "disk",
      "date": "2018-07-19T00:00:00",
      "story": "UFO disc reflecting sun while hovering silently north of Richmond, VA My girlfriend and I saw what we believe was a shiny metallic disc-shaped UFO while driving our car on I-295 west while exiting onto I-95 south outside Richmond, VA, at 2:10 p.m., Monday, July 9, 2018.  I was driving my girlfriend to her doctor's appointment.  Our sighting lasted about one minute or less.  While slowing to exit from one interstate highway to another I noticed what appeared to be a metallic saucer-shaped craft high in the air.  The craft was north of our position at about 45 degrees above the horizon.  I estimate the altitude may have been 10,000-15,000 feet (higher than a light prop plane but lower than a cruising airliner).  At the time there was a sunny clear-blue sky to the north without clouds and unlimited visibility.  There were clouds to the south but they were not a factor.  I watched the craft trying to determine whether it might be an airplane but there was absolutely no discernible movement, nor were there any FAA lights, markings, noise or! vapor trails.  The disc was hovering and reflecting the sunlight.   I'm 58 years old, BS with honors, am familiar with military and civilian spacecraft and aircraft, meteorology, astronomy, and relatives from NASA, NSA, and Army helicopters.  This craft did not appear to be one of \"ours.\"   After deciding for myself that the craft in question might very well be an extraterrestrial vehicle rather than a man-made aircraft, I pointed it out to my girlfriend.  She observed the shiny hovering disc for about 15 seconds and came to the same conclusion.  My girlfriend also is mature, college degreed, and the owner/operator of an online store.  We both watched the disc hover, seemingly motionless, reflecting the sun, and then it appeared to vanish into thin air without a trace.   We scanned the clear-blue sky but the \"saucer\" apparently cloaked itself, raced off in the blink of an eye, and/or perhaps disappeared into another dimension of time/space.  We did not see or hear a! ny man-made aircraft in the sky in that direction at the time of our disc sighting.  Only the shiny metallic saucer-shaped craft.  No clouds, airplanes or helicopters.  However, both of us heard a military jet fighter roar over our house at approximately 10 a.m. the same day, about four hours before we saw the UFO disc.   We live in rural King William County about 30 minutes northeast of where we saw the disc. We have seen many black unmarked helicopters over our property, and occasional jets, especially in conjunction with other resident's UFO reports, but I believe this was the first jet fighter in a few months and we found it noteworthy since the fighter plane was monitoring our area a few hours before we saw the UFO. Just a \"coincidence\"?  There is an Army base with heliports and airstrips controlled by the NSA, including \"secret\" underground tunnels, about 30 minutes northwest of our home but the aforementioned chopper and jet-fighter flights are not routine and nearly always coincide with MUFON/NUFORC reports by other local! witnesses.  My girlfriend and I believe the ETs are mostly benign and it's the \"shadow government\" and military/industrial/intelligence complex that people should be concerned about.  We believe the ETs probably monitor the shadow government facilities and vice versa.  We believe the latter information and opinion is relevant and should be considered in conjunction with our possible extraterrestrial disc sighting because of the unusual jet fighter roaring over our house the same day.  Note: Our shiny, reflective UFO disc sighting outside Richmond, VA occurred on the afternoon of July 9, 2018, and I reported it to the Mutual UFO Network (MUFON) on the morning of July 10, 2018 (MUFON case 93248).    Then on the morning of July 15, 2018 I discovered a NUFORC case from Springfield, VA, about a shiny, reflective possible UFO disc seen in the daytime on July 8, 2018, but posted to NUFORC on July 13, 2018.  The NUFORC case reminded me of our Richmond sighting first reported to ! MUFON.  Bottom line:  Someone in Northern Virginia near Washington, D.C, saw a possible UFO disc during the day on July 8 and then my girlfriend and I saw a possible UFO disc during the day outside Richmond (120 miles south of D.C.) on July 9, and a military fighter jet made an unusual pass over our rural home on July 9 about four hours before we saw the disc-shaped UFO.  All just a \"coincidence\"?",
      "link": "http://www.nuforc.org/webreports/142/S142242.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c87ac",
      "summary": "Last night i was on my phone, when it started acting up. When i went exit a page it would a slurping-like noise, In general it was slow",
      "city": "richmond",
      "shape": "unknown",
      "date": "2018-07-19T00:00:00",
      "story": "Last night i was on my phone, when it started acting up.  When i went exit a page it would a slurping-like noise, In general it was slower.after this i look out my window i see a object flashing white lights about 10 or 20 feet above the treetops (I think).  I didnt go and investigate as it was late and I didnt want to wake anyone.  It is now the morning i have been hearing planes outside.  If it was not a ufo it could have been flying out of Selfridge which is a nearby military base.",
      "link": "http://www.nuforc.org/webreports/142/S142291.html",
      "state": "MI",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c87af",
      "summary": "An airplane just went past a made a line of smoke. I see 2 ufo fly out of that line of smoke with a glowing light around them .",
      "city": "richmond",
      "shape": "oval",
      "date": "2018-07-19T00:00:00",
      "story": "An airplane just went past a made a line of smoke.  I see 2 ufo fly out of that line of smoke with a glowing light around them .",
      "link": "http://www.nuforc.org/webreports/142/S142300.html",
      "state": "IN",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c88cb",
      "summary": "Traveling N95 saw disc-like saucer descend in capsule style re-entry motion level out w/green lights.  ((anonymous report))",
      "city": "richmond",
      "shape": "disk",
      "date": "2018-06-21T00:00:00",
      "story": "Traveling N95 saw disc like saucer decend in capsule style reentry motion level out with green lights upon dead stop in mid eye level range and boytom glowed green before completely disappearing without a trace.  No glares on my windows and only vehicle beside me was semi truck that slowed down probly from witnessing same accountm so no way this was from headlights or naturalymanmade ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact  information.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141899.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8949",
      "summary": "UFO disc reflecting sun while hovering silently north of Richmond, VA",
      "city": "richmond",
      "shape": "disk",
      "date": "2019-09-06T00:00:00",
      "story": "UFO disc reflecting sun while hovering silently north of Richmond, VA My girlfriend and I saw what we believe was a shiny metallic disc-shaped UFO while driving our car on I-295 west while exiting onto I-95 south outside Richmond, VA at 2:10 p.m., Monday, July 9, 2018. I was driving my girlfriend to her doctor's appointment.  Our sighting lasted about one minute or less.  While slowing to exit from one interstate highway to another I noticed what appeared to be a metallic saucer-shaped craft high in the air. The craft was north of our position at about 45 degrees above the horizon.  I estimate the altitude may have been 10,000-15,000 feet (higher than a light prop plane but lower than a cruising airliner).  At the time there was a sunny clear-blue sky to the north without clouds and unlimited visibility.  There were clouds to the south but they were not a factor.  I watched the craft trying to determine whether it might be an airplane, but there was absolutely no discernible movement, nor were there any FAA lights, markings, noise or! vapor trails.  The disc was hovering and reflecting the sunlight.   I'm 58 years old, BS with honors, am familiar with military and civilian spacecraft and aircraft, meteorology, astronomy, and relatives from NASA, NSA, and Army helicopters.  This craft did not appear to be one of \"ours.\"  After deciding for myself that the craft in question might very well be an extraterrestrial vehicle rather than a man-made aircraft I pointed it out to my girlfriend.  She observed the shiny hovering disc for about 15 seconds and came to the same conclusion.  My girlfriend also is mature, college degreed, and the owner/operator of an online store.  We both watched the disc hover, seemingly motionless, reflecting the sun, and then it appeared to vanish into thin air without a trace.  We scanned the clear-blue sky but the \"saucer\" apparently cloaked itself, raced off in the blink of an eye, and/or perhaps disappeared into another dimension of time/space.  We did not see or hear a! ny man-made aircraft in the sky in that direction at the time ! of our d isc sighting. Only the shiny metallic saucer-shaped craft.  No clouds, airplanes or helicopters.  However, both of us heard a military jet fighter roar over our house at approximately 10 a.m. the same day, about four hours before we saw the UFO disc.   We live in rural King William County about 30 minutes northeast of where we saw the disc. We have seen many black unmarked helicopters over our property, and occasional jets, especially in conjunction with other resident's UFO reports, but I believe this was the first jet fighter in a few months and we found it noteworthy since the fighter plane was monitoring our area a few hours before we saw the UFO. Just a \"coincidence\"?  There is an Army base with heliports and airstrips controlled by the NSA, including \"secret\" underground tunnels, about 30 minutes northwest of our home but the aforementioned chopper and jet-fighter flights are not routine and nearly always coincide with MUFON/NUFORC reports by other local! witnesses.  My girlfriend and I believe the ETs are mostly benign and it's the \"shadow government\" and military/industrial/intelligence complex that people should be concerned about.  We believe the ETs probably monitor the shadow government facilities and vice versa.  We believe the latter information and opinion is relevant and should be considered in conjunction with our possible extraterrestrial disc sighting because of the unusual jet fighter roaring over our house the same day.  Note: Our shiny, reflective UFO disc sighting outside Richmond, VA, occurred on the afternoon of July 9, 2018 and I reported it to the Mutual UFO Network (MUFON) on the morning of July 10, 2018 (MUFON case 93248).    Then on the morning of July 15, 2018 I discovered a NUFORC case from Springfield, VA, about a shiny, reflective possible UFO disc seen in the daytime on July 8, 2018, but posted to NUFORC on July 13, 2018.  The NUFORC case reminded me of our Richmond sighting first reported to MUFON.  Bottom line:  Someone in Northern Virginia near Washington, D.C., saw a possible UFO disc during the day on July 8, and then my girlfriend and I saw a possible UFO disc during the day outside Richmond (120 miles south of D.C.) on July 9, and a military fighter jet made an unusual pass over our rural home on July 9 about four hours before we saw the disc-shaped UFO.  All just a \"coincidence\"?",
      "link": "http://www.nuforc.org/webreports/148/S148443.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b1a",
      "summary": "UFO disc reflecting sun while hovering silently north of Richmond, VA",
      "city": "richmond",
      "shape": "disk",
      "date": "2019-03-14T00:00:00",
      "story": "UFO disc reflecting sun while hovering silently north of Richmond, VA My girlfriend and I saw what we believe was a shiny metallic disc-shaped UFO while driving our car on I-295 west while exiting onto I-95 south outside Richmond, VA, at 2:10 p.m., Monday, July 9, 2018.  I was driving my girlfriend to her doctor's appointment.  Our sighting lasted about one minute or less. While slowing to exit from one interstate highway to another I noticed what appeared to be a metallic saucer-shaped craft high in the air.  The craft was north of our position at about 45 degrees above the horizon.  I estimate the altitude may have been 10,000-15,000 feet (higher than a light prop plane, but lower than a cruising airliner).  At the time there was a sunny clear-blue sky to the north without clouds and unlimited visibility.  There were clouds to the south but they were not a factor.  I watched the craft trying to determine whether it might be an airplane but there was absolutely no discernible movement, nor were there any FAA lights, markings, noise or! vapor trails.  The disc was hovering and reflecting the sunlight.  I'm 58 years old, BS with honors, am familiar with military and civilian spacecraft and aircraft, meteorology, astronomy, and relatives from NASA, NSA, and Army helicopters.  This craft did not appear to be one of \"ours.\"   After deciding for myself that the craft in question might very well be an extraterrestrial vehicle, rather than a man-made aircraft, I pointed it out to my girlfriend.  She observed the shiny hovering disc for about 15 seconds and came to the same conclusion.  My girlfriend also is mature, college degreed, and the owner/operator of an online store.  We both watched the disc hover, seemingly motionless, reflecting the sun, and then it appeared to vanish into thin air without a trace.  We scanned the clear-blue sky but the \"saucer\" apparently cloaked itself, raced off in the blink of an eye, and/or perhaps disappeared into another dimension of time/space.  We did not see or hear a! ny man-made aircraft in the sky in that direction at the time ! of our disc sighting.  Only the shiny metallic saucer-shaped craft. No clouds, airplanes or helicopters.  However, both of us heard a military jet fighter roar over our house at approximately 10 a.m. the same day, about four hours before we saw the UFO disc.  We live in rural King William County about 30 minutes northeast of where we saw the disc.  We have seen many black unmarked helicopters over our property, and occasional jets, especially in conjunction with other resident's UFO reports, but I believe this was the first jet fighter in a few months and we found it noteworthy since the fighter plane was monitoring our area a few hours before we saw the UFO.  Just a \"coincidence\"?  There is an Army base with heliports and airstrips controlled by the NSA, including \"secret\" underground tunnels, about 30 minutes northwest of our home but the aforementioned chopper and jet-fighter flights are not routine and nearly always coincide with MUFON/NUFORC reports by other local! witnesses.  My girlfriend and I believe the ETs are mostly benign and it's the \"shadow government\" and military/industrial/intelligence complex that people should be concerned about. We believe the ETs probably monitor the shadow government facilities and vice versa.  We believe the latter information and opinion is relevant and should be considered in conjunction with our possible extraterrestrial disc sighting because of the unusual jet fighter roaring over our house the same day.  Note: Our shiny, reflective UFO disc sighting outside Richmond, VA, occurred on the afternoon of July 9, 2018 and I reported it to the Mutual UFO Network (MUFON) on the morning of July 10, 2018 (MUFON case 93248).  Then on the morning of July 15, 2018, I discovered a NUFORC case from Springfield, VA, about a shiny, reflective possible UFO disc seen in the daytime on July 8, 2018 but posted to NUFORC on July 13, 2018.  The NUFORC case reminded me of our Richmond sighting first reported to MUFON.  Bottom line:  Someone in Northern Virginia near Washington, D.C, saw a possible UFO disc during the day on July 8 and then my girlfriend and I saw a possible UFO disc during the day outside Richmond (120 miles south of D.C.) on July 9, and a military fighter jet made an unusual pass over our rural home on July 9 about four hours before we saw the disc-shaped UFO.  All just a \"coincidence\"?",
      "link": "http://www.nuforc.org/webreports/145/S145161.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d47",
      "summary": "To the south of the moon I saw movement and there were approximately 8-10 faint white lights in a circle.",
      "city": "richmond",
      "shape": "chevron",
      "date": "2019-01-24T00:00:00",
      "story": "8-10 lights flying in circle formation during lunar eclipse. I was outside viewing the lunar eclipse around midnight.  To the south of the moon I saw movement and there were approximately 8-10 faint white lights in a circle.  There were some clouds so maybe they were behind them.  They were really high in the sky and I thought from their angular shape they were birds at first.  They flew in formation and each light peeled away from the ring and made a spiral in the sky, like drawing a number 9, then disappeared.  It all happened within a minute or so.   I kept looking to see if I could see them again, but they were gone.",
      "link": "http://www.nuforc.org/webreports/144/S144604.html",
      "state": "VA",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8de5",
      "summary": "Circular obj., bright white in color, observed hovering, darting in all directions, and blinking intermittently. ((anonymous report))",
      "city": "richmond",
      "shape": "circle",
      "date": "2019-01-11T00:00:00",
      "story": "A circular object, bright white in color, was observed hovering, darting in all directions, and blinking intermittently for a total of 19 minutes.  This was observed by 3 separate individuals.   As one can clearly ascertain in the videos captured, the background consisted of the object in question, the early morning sky, birds flying occasionally overhead, with a condensation trail left behind by a passing jet, and trees present in the horizon.   In our opinion, it was much too distant to have been some sort of drone, and moved much too quickly in various random directions to have been a passing aircraft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144300.html",
      "state": "KY",
      "duration": "19 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9172",
      "summary": "3 flying saucers.",
      "city": "richmond",
      "shape": "disk",
      "date": "2019-12-01T00:00:00",
      "story": "3 flying saucers I was in my bedroom in my apartment and decided to peek out the bay window we have, not even 5 seconds later I see a very round \"cloud\" but I notice this is no cloud because it was perfectly saucer shaped.  It flew north over a bank of america building then disappeared shortly after, after the first one disappeared a second saucer, that was a darker grey then the first one, took the same path as the first one and disappeared.  Then came a third one.  The third one was the same color as the second one, but instead of just disappearing, it morphed into a spiral, tornado like shape before also disappearing.",
      "link": "http://www.nuforc.org/webreports/149/S149558.html",
      "state": "VA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c93c1",
      "summary": "Bright light from the North to South and makes 90 degree high speed turn.",
      "city": "richmond",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "Bright light from the North to South and makes 90 degree high speed turn. 10/03/2019   Just after dusk I was sitting on my patio looking up at the sky and the airplanes crossing it.  I noticed one aircraft moving from East to West which is common to see.  It appeared to be at what can described as a normal altitude and speed. I noticed a very bright white light somewhat like a bright star, however it was travelling from the North to the South quite rapidly and looked to be at an extreme altitude.  I thought that seemed out of the norm moving from that direction, and I continued to watch.   The object was moving several times faster than the commercial airliners.    I thought it might be a satellite or the space station and I continued to watch it move towards the South. After approximately 45 seconds or so the object turned to the West at a 90 degree angle without appearing to change its speed.  I still watched the object for a few additional seconds until it disappeared from view. I have no true idea of what it was and I do not recall ever seeing something like that.  I felt uneasy and the hair stood up on my arms.   I went inside to tell my wife what I had just seen and she asked me if I was alright since I had a strange look on my face. Again, no idea what it was, but it was not what I would consider to be a normal experience.",
      "link": "http://www.nuforc.org/webreports/150/S150401.html",
      "state": "TX",
      "duration": "45-50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c966b",
      "summary": "Medium light orb fell from the sky into the trees.",
      "city": "richmond",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Medium light orb fell from the sky into the trees. I was driving from my boyfriends house on Bailey Bridge Rd in N Chesterfield, VA, heading towards Hull Street. I was passing Battlecreek Drive and saw a orb of light the size of a stop light when you are sitting at the Intersection. It was very quick, and seemed to curve slightly, it dropped from right above the tree line into the tall trees that are to the left of the turn from Bailey Bridge Rd onto Battlecreek Drive. I also think it might have dimmed a little bit, but that also could have been the trees.",
      "link": "http://www.nuforc.org/webreports/151/S151385.html",
      "state": "VA",
      "duration": "Very quick"
    },
    {
      "_id": "64d005f478aba2ec5a3c9796",
      "summary": "Fast moving white, bright light moved across the sky - moving much faster than a plane.",
      "city": "richmond",
      "shape": "circle",
      "date": "2019-10-04T00:00:00",
      "story": "Fast moving white, bright light moved across the sky - moving much faster than a plane. On a clear night, we were sitting outside having a beer at Hardywood West Creek, when my boyfriend, dad, brother, and I noticed other patrons looking up at the sky and pointing at it.  When we got up from our table, we saw that they were looking a very white, bright light moving across the sky.  This thing was moving much faster than a plane and was not blinking. In about 3 - 5 minutes it had crossed over us and then was out of our line of sight.  There were about 10 - 15 others who saw this, and they too were stumped about what they had just seen.",
      "link": "http://www.nuforc.org/webreports/149/S149058.html",
      "state": "VA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9795",
      "summary": "Triangle Shaped UFO Sighted in Richmond.",
      "city": "richmond",
      "shape": "triangle",
      "date": "2019-10-04T00:00:00",
      "story": "Triangle Shaped UFO Sighted in Richmond. Walked outside to let my dog pee- huge triangle shaped object with like 30 lights all blinking flying low.  Craziest thing I've seen in my life- was metallic gray but had different colored blinking lights. A lot of them were white but some were green and yellow.  Heading south- it looked like it went right over where the Richmond race way would be.  The race track is so loud- even though I am a few miles from it I can still hear the car engines and it is hard to tell if the object was making a sound.  The day was turning to night but the sky was still very blue as the sun had not quite set yet.",
      "link": "http://www.nuforc.org/webreports/149/S149142.html",
      "state": "VA",
      "duration": "2 minutes"
    }
  ]
}