{
  "city": "riverside",
  "fetch_timestamp": "2025-07-12T14:33:35.062677",
  "record_count": 96,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b445d",
      "summary": "Several amber orbs in the sky that had a plasma look to them",
      "city": "riverside",
      "shape": "sphere",
      "date": "2019-08-23T00:00:00",
      "story": "Several amber orbs in the sky that had a plasma look to them My son and I were driving on Jurupa Ave between Grand Ave and Palm Ave.  My son who was 16 at the time said, \"Mom pull over, you have to look at this.\"  I looked out the window and saw several amber spheres that had a plasma look to them.  They seemed kind of low in the sky and were moving to the east.  I tried to take a picture with my cell phone but my camera crashed when I tried.  By the time my phone came back on line the object was gone.  This image has stayed with me and I will never forget that night.   It took me years to report this because I didn't know a site like this existed and I feared people (other agencies) would make fun of me.  If you have any questions I would be happy to answer them.",
      "link": "http://www.nuforc.org/webreports/148/S148291.html",
      "state": "CA",
      "duration": "05:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b57a6",
      "summary": "Bright, fast moving light passes overhead",
      "city": "riverside",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "Bright, fast moving light passes overhead About 2030 hours 08/03/2007 I was sitting on my back porch facing east, looking at the night sky. The sky was cloudless and unusually clear for my urban location. I had just watched several satellites pass overhead, when I noticed a light low in the southern sky. At first I thought it was another satellite however it seemed a lot brighter and faster than the ones I had just been watching. The object was going from South to North and appeared to be at great altitude. Numerous general aviation and commercial aircraft were visible at the same time. The object appeared to be self luminous instead of reflecting sunlight, as it had an unusual blue/purple tinge similar to an electric welding torch. The object passed almost directly overhead of my location, continuing North until I lost sight of it behind the roofline of my house. The light maintained a straight course the entire time I could see it, traversing the sky from where I first saw it to where I lost sight of it in approximately one minute or so. Shortly before I lost sight of the object it blinked out and lit up again in a regular pattern about three times, going dark for several seconds. I checked the Heavens Above site and could find no info about any satellites passing overhead at that time. I also watched the next few nights to see if the object would reappear and I did see the satellites I had seen that night, but no sign of the bright, fast moving object.",
      "link": "http://www.nuforc.org/webreports/058/S58384.html",
      "state": "CA",
      "duration": "1 min approx."
    },
    {
      "_id": "64d005f478aba2ec5a3b59be",
      "summary": "Chicago suburbs, strange lights and figures; close contact with figures.",
      "city": "riverside",
      "shape": "light",
      "date": "",
      "story": "Chicago suburbs, strange lights and figures; close contact with figures. This event occurred when I was approximately 5 years old; as such it is an old memory that may be partially \"contaminated\" by the intervening years, but it remains, nevertheless, a very vivid memory for me.  My parents were driving home after visiting relatives. It was late (after midnight) and I was trying to sleep in the back seat of the car. The weather was getting cold that time of year, so all the car windows were rolled-up. We were traveling through an area that was only partially developed at the time--a heavily forested road, or forest preserve land, near Riverside IL--when my father abruptly stopped the car.  I sat up, thinking that we had almost crashed, and looked out the front window. Indistinct shapes moved around a bright light at what seemed like some sort of accident, but I could not see any other crashed cars. My mother kept saying something like, \"What is that? What are they doing there?\" The light extended completely across the narrow road and was a brilliant amber-yellow color with other spectral shades in it . . . like the rainbow hues glimpsed along the edge of a beveled mirror. My mother was talking very fast and nervously and I could tell she was becomming upset. She kept insisting that my father back-up the car and get \"hell out of here.\" My dad shouted back, \"I'm trying!\" but the car wouldn't move. My mom became hysterical when some of the figures turned toward us and started approaching the car.  As I watched I became aware of a presence alongside the car near me on the passenger side. The glare from the light, which now seemed all around us like an enveloping  fog, partially obscured him. This figure seemed to indicate to me that he wanted me to open the car door. When I reached up and raised the door \"button\", my mother began to scream uncontrollably: \"Don't let them in, DON'T LET THEM IN!\" I was unable to see any distinct features of the figures because of the glare around the car but, nevertheless, I could not understand her fear. One figure in particular seemed to want to play with me. He seemed older than me, but behaved just like a funny, playful older sibling. He projected this tremendous sense of warmth and affection toward me that I grasped immediately on a gut emotional level. No fear at all.  The last thing I remember was a monotonous buzzing sound as if the entire rear car window had been covered with insects. (I actually have what may be a screen memory of a thick blanket of buzzing flies entirely obscuring the view from the car's back window.) The car door opened and someone lifted me out. At first I thought this was my father, but it was not; the figure who lifted me was featureless, like a living shadow, without any discernable face. My body went limp, like someone who was asleep, only I was still conscious . . .  but it was as if I were outside of my own body, watching all this happening from a safe distance. I woke up the next morning at home in my bed surprised and confused about how I got there. When I asked my mother about the incident she simply said nothing had happened. To this day she either flatly refuses to discuss the incident or claims she has absolutely no recollection of it. I am a university lecturer. My father is deceased. My elderly mother lives with a 24-hour caregiver. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55814.html",
      "state": "IL",
      "duration": "10 minutes (?)"
    },
    {
      "_id": "64d005f478aba2ec5a3b6107",
      "summary": "A red and orange ball of light above the trees.",
      "city": "riverside",
      "shape": "circle",
      "date": "2007-06-12T00:00:00",
      "story": "A red and orange ball of light above the trees. A single orange and red ball in the sky was seen by two other friends, my brother and me, while walking up the road returning from fishing in the evening.  It appeared to be about the same brilliance and color of a road flare, producing a consistent discharge of flickering light.   The thing just sort rose up from behind the trees or maybe off the horizon but it seemed close (approx 100 meters).  It was silent and kind of danced around in a slight ‘zig zag’ pattern bobbing up and down to the right before changing direction left, then leveling to a straight line and blinking out.  It was at what seemed about tree top level in altitude but it was really hard to determine.  It was strange looking at it.  Judging the true distance and altitude was kind of tough because it looked unreal, literally, like ionized gas, or a hologram.   I don’t suppose this is relevant but we were all engaged in very a heated debate discussing the possibility of intelligent life originating elsewhere and the chances of its traveling here, two on one side, one taking a more neutral stance and one the opposite, shouting religious and scientific contentions to support one or rebut the other.  At least one other witness can corroborate and the other two probably would if they could be located; although one was stating disbelief in the whole UFO phenomenon at the time of the encounter.  Despite that strange irony I to this day state, that the object remains simply unidentified. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56521.html",
      "state": "TX",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b65bf",
      "summary": "Fast traveling object during late night",
      "city": "riverside",
      "shape": "fireball",
      "date": "2008-02-14T00:00:00",
      "story": "Fast traveling object during late night I layed awake around 1:30 in the morning. I was alone and my friend was asleep on the couch next to me. I looked out my window into the cloudless sky and saw a spec it looked like an airplane but was WAYY to fast and to small to either. I see planes go over my house all the time as Ontario airport is not to far away and this object was definetly not following any flight pattern..also knowing this as my mom is a pilot that flys in and out of ontario airport. It was to me what looked like a firefly going about 1,000 m.p.h. ALOT faster than a plane for sure. It's altitude was roughly about 2,000 feet. I have looked in the sky every night since then and have seen NOTHING going the same direction as this object",
      "link": "http://www.nuforc.org/webreports/061/S61112.html",
      "state": "CA",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6867",
      "summary": "An orange fireball like light moved right to left, than stopped and hovered.",
      "city": "riverside",
      "shape": "fireball",
      "date": "2007-08-07T00:00:00",
      "story": "An orange fireball like light moved right to left, than stopped and hovered. I SAW AN ORANGE FIREBALL MOVE RIGHT TO LEFT THAN HOVER!  \tI saw an orange fireball move right to left, than hover. I am not the only one to see it yesterday July 4, 2007. I was inside helping my girlfriend cook, when my brother says come outside there is a strange light in the sky. I  ran outside to see what it was. I looked up and saw an orange fireball moving south west. Almost like a meteor without a tail. \tAs I watched it, my hole family came outside and saw it, as well as my next door neighbors. I was astonished when the fireball like light stopped and started to move backwards towards north east. It then stopped again and hovered for about five minutes. I could not believe what I was seeing at this point. Everyone on my street, outside at the time, saw it. \tAfter hovering, the light then changed direction again. It start to head east. I watched it move off in the distance and become real dim. It looked like it turned into a star and then disappeared. I have never seen anything like this in the sky before. It was so odd that I got goose bumps all over my body. I was actually freaked out by the strange orange fireball looking light.",
      "link": "http://www.nuforc.org/webreports/057/S57461.html",
      "state": "CA",
      "duration": "Ten minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b70d4",
      "summary": "Orange glowing object seen over Riverside County, releasing small glowing red objects",
      "city": "riverside",
      "shape": "circle",
      "date": "2008-03-04T00:00:00",
      "story": "Orange glowing object seen over Riverside County, releasing small glowing red objects I saw a small \"craft\" with an orange glow, moving slowly (maybe 100 to 200 MPH) through the sky last night.  It was heading from west to the north-east, moving fairly slow and about at a height of maybe 40,000 FT.   I noticed it right away, in that it didn't have the same glow of a commercial or private plane.  Not to mention, the entire object was luminescent/glowing (it wasn't the headlight of an airplane, but just as bright).  Anyhow, as it began to head north, I started noticing small red glowing objects were being released from the craft.  These small objects would propel themselves and an incredible high rate, straight down, or in a 90 degree angle and then just disappear.  These red glowing objects were being released, every 5 seconds or so.  After 3 of these glowing-red objects were released, the craft then released 3 more objects, all at once, then begin to accelerate and incredible rate of speed.  As it was accelerating, it begin to lose it's orange glow and literally began to disappear! Before it disappeared, it seem to accelerate to over a 2 thousand miles an hour (from 200 MPH to 2000 MPH with in 2 or 3 seconds).  I watched this object for approximately 5 minutes (from start to finish).",
      "link": "http://www.nuforc.org/webreports/061/S61922.html",
      "state": "CA",
      "duration": "3 to 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b750e",
      "summary": "I live in Riverside,California and the reason I decided to post this picture on a forum (Generally a ufo site) is to find an explanatio",
      "city": "riverside",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "I live in Riverside,California and the reason I decided to post this picture on a forum (Generally a ufo site) is to find an explanation to this object I caught with my camera.  I took this picture around 5:45 P.M when I noticed a bright object on the sky above the hill.  It does not look like any aircraft or a bird and if you look closely a redish trail is visible.  I took 3 pictures of this (the last one came alittle blureish) and if anyone has any idea of what this object can be please respond. (The picture is pretty big,I use a Sony 7.2 Megapixel Cybershot) ((NUFORC Note:  Photo not sent to us, as of this writing.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54679.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b774c",
      "summary": "Oval object, flashing red & white, remains motionless in sky during gusty winds",
      "city": "riverside",
      "shape": "oval",
      "date": "2007-10-08T00:00:00",
      "story": "Oval object, flashing red & white, remains motionless in sky during gusty winds On 10/07/2007 about 0935 I was going for a walk. The sky was bright blue, with strong, gusty winds blowing from the northeast. I paused on a bluff that overlooks the Santa Ana riverbed to look at the scenery. I noticed a bright object in the sky to the west. I first thought it was a mylar balloon being blown by the wind, however I quickly noticed that it was not moving nearly as fast as, or in the same direction as the wind. Its path through the sky was quite smooth, not like it was being tossed about by the wind. The object was oval and was changing color every few seconds from reddish orange to white. It seemed to me that the object was slowing turning or wobbling, alternately showing a red and white surface. The object was bright, but not glittery as a metallic balloon would appear reflecting sunlight. I watched the object for about 5 minutes as it slowly made an arc towards the southeast. It finally hovered in one spot in the sky. I continued to watch it for another 20 minutes or so, and apparently it was gaining in altitude. When I first saw it, it had a definite oval shape and seemed to be about the same altitude as some general aviation type aircraft that were flying in the vicinity. After watching it hover, the size gradually reduced to where it looked like a star visible in the daytime. After watching the object for almost a half an hour, I started to walk home, stopping every so often to see if the object was still there. I hoped to locate it once I got home, where I could use binoculars to look at it, however the road took a turn through tall trees, and I was unable to find it again. It continued the flashing effect for the entire duration. There were numerous jet and propeller driven aircraft seen in the sky during the time of the sighting. I would assume it was a balloon of some type if it were not for the fact it was unaffected by the strong winds.",
      "link": "http://www.nuforc.org/webreports/059/S59154.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b79dc",
      "summary": "Green fireball, very slowly descending",
      "city": "riverside",
      "shape": "fireball",
      "date": "2006-12-07T00:00:00",
      "story": "Green fireball, very slowly descending Just observed a large, greenish-white fireball descending in the southwest sky. I had just stepped out to look at the evening sky, when I noticed the fireball slowly dropping, almost straight down. It did not glitter or fluctuate in intensity like other fireballs and meteors I have seen, nor did it leave any trail that I could determine. Its diameter appeared to be about that of a pea held at arm's length. It disappeared behind Mt. Rubidoux, which is just west of my location. What seemed odd was the very slow speed of the fireball, the lack of a trail, and the consistency of brightness. It did not resemble any meteor or fireball I have ever seen. It was definitely NOT fireworks of any sort. There were a number of airliners and private planes visible in the sky at the time, most likely there are other witnesses.",
      "link": "http://www.nuforc.org/webreports/053/S53507.html",
      "state": "CA",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c6b",
      "summary": "as me and my wife were siting in our lawn as i looked up to the south i saw what looked as a low long light passing then falling at a 9",
      "city": "riverside",
      "shape": "unknown",
      "date": "2006-07-16T00:00:00",
      "story": "as me and my wife were siting in our lawn as i looked up to the south i saw what looked as a low long light passing then falling at a 90degree then the air around it seemed to ripple around it.as it went further into the distance it seemed to get brighter then it suddenly stopped then it took off to the south once more.a round circular light was visible and next to it was another circular light then it disappeared.afterwards several minutes later there was an illuminating cloud left behind that lasted for atleast 10-15 minutes before it to dissipated.",
      "link": "http://www.nuforc.org/webreports/051/S51175.html",
      "state": "CA",
      "duration": "10min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7fe9",
      "summary": "Two Slow Flying Fireballs Within Seven Minutes",
      "city": "riverside",
      "shape": "teardrop",
      "date": "2009-12-12T00:00:00",
      "story": "Two Slow Flying Fireballs Within Seven Minutes At about 2100 hours on the night of September 5th, 2009, I was sitting outside with my wife in my backyard around a small fire.  In the sky to the north I noticed what looked like a small orange to red fireball.  This object moved toward the west at the rate of any normal passing airplane.  I ran after the orange glowing object for about one city block, as it would pass behind trees and houses.  Eventually it passed out of sight. After I had returned to my house and sat back down for about five to seven minutes, I saw a second, identical object moving along the same course.  I ran after this one as well, anticipating its course to get a better view.  As it moved into view I thought that it looked almost like it could have been a balloon that was somehow on fire. When I reached the top of the hill, the highest elevation in town, my view could only be obstructed by trees and the nearby church steeple.  Two local acquaintances happened to be passing by on the sidewalk.  I told them to look at the object.  They could not identify it.  The three of us watched the object as it flew away toward the west.  Eventually, without altering course, the light of the object vanished and we could see nothing but stars in the western sky. The weather was calm.  There was absolutely no wind.  The sky was completely clear.  The moon was low in the eastern sky. The object moved at the rate most any airplane would cross the sky, but the light from this aircraft was much larger than any of the small lights on normal planes.  Also, the object made absolutely no engine noise.  There was no sound at all.",
      "link": "http://www.nuforc.org/webreports/072/S72097.html",
      "state": "IA",
      "duration": "2 minutes times 2"
    },
    {
      "_id": "64d005f478aba2ec5a3b82d2",
      "summary": "Above March Air Force Base, a neon green light appears in the night sky, then shoots across the sky.",
      "city": "riverside",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Above March Air Force Base, a neon green light appears in the night sky, then shoots across the sky. It was a very clear sky lots of stars.  Driving down the 91 freeway south of the 60 freeway when to my eleven o'clock a green neon light a sphere, just appears for about two maybe three seconds then just blasted across the sky,  It looked like something out of star wars it was amazing, the reason that I'm reporting this now is that it happened very very close to March Air Force Base might have been above it and low very low.  I thought it was the air force with their jet with the laser that shoots down missiles but recently i seen the documentary on that jet and their laser is not neon green and does not shoot out the way this did.  It's been over four years but it seems like yesterday.   Well I'm not saying it was something from outer space but as an ex marine what i saw that night was impressive. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67966.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b887d",
      "summary": "Large bright egg shaped craft mooving slowly across riverside.",
      "city": "riverside",
      "shape": "egg",
      "date": "2009-03-19T00:00:00",
      "story": "Large bright egg shaped craft mooving slowly across riverside. We were coming home when we saw a huge glowing ball. It wasnt the moon because it had two blue lights at the sides and one red light at the top. It was to bright to be a blimp and it was shaped nothing like a plane. it moved slowly and smoothly. It seemed large because it was far away. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68072.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b89cb",
      "summary": "Orange V shaped object observed overhead",
      "city": "riverside",
      "shape": "other",
      "date": "2010-02-14T00:00:00",
      "story": "Orange V shaped object observed overhead On 02/15/2005 I had just returned home after taking my son to school, about 0930. I looked up at the sky as I walked from my car to the house to look at the clouds.  Almost directly overhead, in a clear patch between the clouds, I saw a brilliant, glowing orange V-shaped object.  It appeared stationary when I first saw it.   I went into the house to get a small spotting scope that I use for bird watching and returned. Using the scope, I saw that the V object was not solid orange, but had alternating sections of orange and white.  It had some type of structure to it that I could not quite make out due to distance.  The best I and describe it is a length of a crane or bridge, with it’s intricate crosspieces, bent at a 45 degree angle, painted orange and white. I was not a wing shape at all, as the arms of the V did not have much width to them.   The object would drift in and out of the clouds as they passed by to the NE, the clouds sometimes partially obscuring the object. I would estimate the size as similar to the wingspan of a commercial jet aircraft.  The object seemed to maneuver periodically to remain near the edge of the clouds.  I watched until the cloud cover thickened and the object was not visible any longer, about 5 minutes. I realize this is almost 5 years ago and I am just reporting it now.  At the time, I assumed that, due to the color, it was some sort of experimental device.  I also considered the date (day after Valentine’s day) of the sighting, that it may have been a balloon arch that got loose, but I have since had the chance to observe balloons released into the sky and they did not behave or look they way this object did.   I am reporting it now since I see so many reports of V and triangle shaped objects, maybe this is some piece of the puzzle.",
      "link": "http://www.nuforc.org/webreports/073/S73841.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8af7",
      "summary": "Driving southbound on the 91 fwy in Riverside C.A. at about 11:30 pm a green orb appeared out of nowhere to my eleven o'clock it seemed",
      "city": "riverside",
      "shape": "sphere",
      "date": "2010-04-13T00:00:00",
      "story": "Driving southbound on the 91 fwy in Riverside C.A. at about 11:30 pm a green orb appeared out of nowhere to my eleven o'clock it seemed to be maybe 500 feet off the ground i turned to my friend ,he was the passenger to see if the green orb caught his attention specially since the night sky was very clear the orb with the very dark sky just seemed to be impossible to miss,by the time i looked back to where the orb was it was in a split second streaking across the entire sky seemed to leave the earths atmosphere looking like something out of stars wars it was breath taking as it turns out my friend only caught the streak by the way the steak was also green to this day i wonder what it was that we witnessed that night wow is all i can say,oh by the way march air force base is a couple of miles directly past our seven second encounter.",
      "link": "http://www.nuforc.org/webreports/074/S74438.html",
      "state": "CA",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d65",
      "summary": "bright object that stopped in mid air and backed up.",
      "city": "riverside",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "bright object that stopped in mid air and backed up. My Mother, Her boyfriend, and I were riding home from a new years eve. party we were turning on to NewJersey Avenue 0ff of River Road.  When suddenly I pointed out a big bright light in the sky.  I told them it couldn't be a plane nor a helicopter because it would of blinded  another plane in front of it which would make it go off course. I suggested we would park on the side of the street for a minute suddenly when we stopped the light stopped and pointed right toward us so then i was joking around and said wouldn't that be scary if it backed up in mid air which planes can't do  and suddenly it backed up in mid air and drove the other way quicker then what a plane could do.",
      "link": "http://www.nuforc.org/webreports/064/S64481.html",
      "state": "NJ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f01",
      "summary": "Slow moving black egg shaped object hovering down from sky",
      "city": "riverside",
      "shape": "egg",
      "date": "2008-10-31T00:00:00",
      "story": "Slow moving black egg shaped object hovering down from sky  500 Lights On Object0: Yes It was about 830 at night on wed. Sept 17th. I was sitting in my car changing into some other clothes and I look through my windshield out towards the street and trees, through the trees I see a black egg-shaped floating object moving very slowly from the sky downwards towards the ground, moving very slowly I saw this object for about 20-25 seconds. I could see it so clearly right away I knew it was not a helicopter, airplane, or anything else..the ojbect was hovering to slowly and progressing down towards the ground at a shocking slow pace.",
      "link": "http://www.nuforc.org/webreports/065/S65748.html",
      "state": "CA",
      "duration": "20 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3b8efd",
      "summary": "Fluorescent white wing like ship traveling north west, slow, no sound, over roof of house at 4am.",
      "city": "riverside",
      "shape": "other",
      "date": "2008-10-31T00:00:00",
      "story": "Fluorescent white wing like ship traveling north west, slow, no sound, over roof of house at 4am. I think around 6oft. length and 30ft. wide. maybe 20ft. wide.  I'm just not sure. It was fluorescent white. It had wings with no body. It was traveling north/west, extremely low, over my roof, about 40ft. high.  No sound at all. 45 minutes later saw a white orb traveling around 150 ft. high, maybe a lot higher, in that general area.",
      "link": "http://www.nuforc.org/webreports/065/S65721.html",
      "state": "CA",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8fa8",
      "summary": "Blue and Orange lights floating stationary.",
      "city": "riverside",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Blue and Orange lights floating stationary. On the night before Halloween me and my girlfriend had come outside to my backyard, we were going about our conversation when a blue and orange light caught my eye and I had said to my girlfriend “What the ____!“ and pointed. The orange light was stationary and the blue light would movie 180 degrees back and forth on the left of the orange light. The two lights would dim in and out and the blue light would sometimes disappear. I live at a base of a small hill and the lights seemed to be right above the ground over the hill, I ran inside to get some binoculars thinking maybe I could get somewhat of a glimpse of what it could be and I focus the binoculars and point them toward the hill and the two lights zoomed from the stationary position to I guess you could say, light speed, faster than any machine or human can run.",
      "link": "http://www.nuforc.org/webreports/073/S73132.html",
      "state": "CA",
      "duration": "2-3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9027",
      "summary": "Orange balls of light over Riverside, California.",
      "city": "riverside",
      "shape": "formation",
      "date": "2010-02-14T00:00:00",
      "story": "Orange balls of light over Riverside, California We witnessed multiple formations by these 5 orange colored crafts.  They moved silently, and more quickly than anything I've ever seen.  They formed a vertical line, then a diamond and what appeared to be a crescent shape with a line, like the profile of a baseball cap.  They continued to move, then the light began fading and reappearing.  Eventually they disappeared in an upward direction.  We tried to use our cell phone cameras, but the image would not photograph.  The duration was approximately 3 minutes.  It was incredible.",
      "link": "http://www.nuforc.org/webreports/073/S73842.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b90db",
      "summary": "Double-disk shaped object, silver color on top, red on bottom.  Viewable on Google maps.com.  ((NUFORC Note:  Probably not a UFO.  PD))",
      "city": "riverside",
      "shape": "disk",
      "date": "2010-02-14T00:00:00",
      "story": "Double-disk shaped object, silver color on top, red on bottom.  Viewable on Google maps.com The information contained in this report can be verified by going to http://maps.google.com/. On December 27, 2009, I was looking at the street level view of my neighborhood as provided by Google maps.  When I maneuvered the view to look up into the sky I observed a very strange object.  Here are three photos I took, but they are of poor quality.  You may view the object yourself by entering the following location at Google maps:  Intersection of Cutwood Lane and Darkwood Drive, Riverside, California, 92506. I have additional information to share. ((NUFORC Note:  Probably not a UFO.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73878.html",
      "state": "CA",
      "duration": "On-going"
    },
    {
      "_id": "64d005f478aba2ec5a3b949a",
      "summary": "Round white object spotted traveling faster than a conventional aircraft, no smoke trail/tail",
      "city": "riverside",
      "shape": "circle",
      "date": "2008-08-12T00:00:00",
      "story": "Round white object spotted traveling faster than a conventional aircraft, no smoke trail/tail White cloud looking circular object traveling north west approx, moved faster than a plane or jet, no tail smoke or trail. This moved like a craft, not a drifting cloud and was definately round and white or glowing white. I viewed this w/ a sunny blue sky background as it moved until it disappeared into clouds, maybe 3 minutes total. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64484.html",
      "state": "RI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b96d9",
      "summary": "Flat football shaped object hoving over passing planes",
      "city": "riverside",
      "shape": "other",
      "date": "2010-04-13T00:00:00",
      "story": "Flat football shaped object hoving over passing planes I was at my high school with my boyfriend in the football field and a passing plane caught my attention.  There was a shiny, fish/football shaped object floating above and a small distance from the plane.  It was rotating on it's axis, moving very slowly, much slower than the plane.  The object was about a forth smaller than the plane, accounting for perspective. It went in a perfectly straight line and stopped.  It seemed to stop rotating, then changed the direction of its rotation from counter-clockwise to clockwise.  Then as another plane passed below it, it changed its trajectory and moved higher and away at a slight angle until neither I nor my boyfriend could see it anymore.  He didn't believe me that it was a UFO, he said it was balloons, but I've never seen balloons do what that object did.",
      "link": "http://www.nuforc.org/webreports/074/S74698.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b99ae",
      "summary": "My wife pointed out 4 lights high up in the sky.",
      "city": "riverside",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "my family was out front of house and my wife pointed out 4 lights high up in the sky. when this happened was at night. the dots of lightwere flying at a high rate of speed. some of the lights would fall back and then rapidly move forward back to formation. a jet was flying closer in altatude so we had a comparison to how high these objects were flying. from what I could tell they were close to space altitude. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66057.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9af8",
      "summary": "Large twinkling/flashing light with smaller one across from it, spinning like a baton",
      "city": "riverside",
      "shape": "cigar",
      "date": "2010-06-03T00:00:00",
      "story": "Large twinkling/flashing light with smaller one across from it, spinning like a baton Every night my mother and I stand in the back patio and smoke a cigarette before bed.  We live near the Riverside Airport, so we always see helicopters, commercial airplanes and jets fly over us.   At about 11:34-36ish at night, I'm looking up at the night sky taking a drag when I notice a twinkling, moving light.  Thinking it's probably a plane or chopper, I just kept watching the sky. But then I noticed that the twinkling/flashing light was moving pretty fast, and was hovering above a smaller light.  As it flew before me, it spinned like a baton at least three times before I noticed it was somewhat cigar/rod shaped. Meanwhile, I was also trying to get my mother's attention without keeping my eyes off the UFO.  I tried to speak, but all I could say was \"Oh my G-d!\" and \"Look!\".  My mother didn't see anything except the larger twinkling light.  From what I can recall she was either staring at me to try and understand what I was saying or behind me putting something away in the backyard.  I wouldn't call her a witness because 1) she wasn't looking at the sky and 2) she wears triple-lense reading glasses and we were outside in the dark with no lights on. I would call myself an observer.  Every-night I look into the night sky.  Every time we're on a road trip to Vegas, I see at least five shooting stars on the way there and back.  When I was three months pregnant with my boy, I saw what I believe today to have been a comet.  But what I saw about an hour and a half ago was nothing like this.  It was just so surreal, I almost had an anxiety attack.  Funny thing is, now there's a bunch of loud choppers flying over my house, there's been at least three already.  Whoever is reading this may choose to swallow it with a grain of salt, but only those who saw it too can vouch for me.",
      "link": "http://www.nuforc.org/webreports/075/S75497.html",
      "state": "CA",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9be9",
      "summary": "2 lights apear and the others shoots across sky when a plane flys by.  ((NUFORC Note:  Student report.  PD))",
      "city": "riverside",
      "shape": "light",
      "date": "2010-02-14T00:00:00",
      "story": "2 lights apear and the others shoots across sky when a plane flys by. me and 2 friends were standing out back we looked up in the sky and saw a light we thought it was a star then another appeared under it the first one moved from side to side a plane flew near the second one and the light flew across the sky in a split second",
      "link": "http://www.nuforc.org/webreports/074/S74157.html",
      "state": "NJ",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9cb8",
      "summary": "Light blue object, suddely turns brilliant white, leaves trail and wake",
      "city": "riverside",
      "shape": "light",
      "date": "2010-06-23T00:00:00",
      "story": "Light blue object, suddely turns brilliant white, leaves trail and wake On 06/17/2010 at 2133 hours I was on my back porch, looking at the sky before going to bed.  There were no clouds, but there was some haze near the ground.  I noticed a light blue object approaching from the South which I at first took to be a satellite.  As I watched, I noticed it was moving much faster than any satellite I have ever seen.  The object continued going North, passing overhead slightly to the East of my location.  Suddenly the object went from medium intensity light blue to brilliant white, and its size seemed to increase substantially.  It was not a gradual transition as with an iridium satellite, but instantaneous, as it something had switched on.  About a second after it turned white, it began making a conical shaped wake which spread out from the object and dissipated.  The object itself began leaving a thin, white trail behind it as well. After several seconds, the brilliant white light, wake and trail went off, and the object returned to its lig! ht blue form.  After a few more seconds, it briefly switched to brilliant white again, but this time no wake or trail were visible.  The object returned to light blue and remained that way until I lost sight of it as it went behind the roof line of my house to the North.  The object was on a straight flight path the entire time, going from South to North.  It seemed to wobble a bit after it started making the wake and trail.  At the time of this sighting, there were satellites and various types of aircraft visible in the sky.  I did not hear any noise that seemed to be related to the object. I did hear jet aircraft but I am sure the source was from airliners passing overhead.  I watched the sky during the same time period for the next two days to see if it could have been some type of satellite, but I did not see anything similar.",
      "link": "http://www.nuforc.org/webreports/075/S75865.html",
      "state": "CA",
      "duration": "2 min approx"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d3b",
      "summary": "It almost looked like a star, and it was reflecting the sun,but moving from south to north. I was able to watch it till it was out of s",
      "city": "riverside",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "It almost looked like a star, and it was reflecting the sun, but moving from south to north.  I was able to watch it till it was out of sight,  A plane at very high altitude flew in close proximity much much higher than the clouds which made the object appear to fly at an extremely higher altitude.  I could not hear the engine of the plane nor the object.  I snapped a couple of pictures and the object with a 10 meg pix cannon, and the object shows up as a shimmering white sphere.   It has rained for a couple of days and today was very clear and crisp outside so visibility was almost perfect except for a couple of clouds.",
      "link": "http://www.nuforc.org/webreports/067/S67514.html",
      "state": "CA",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e6e",
      "summary": "Bright blue-white round object moving south to north, very fast",
      "city": "riverside",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "Bright blue-white round object moving south to north, very fast On 03/15/2009 about 1948 hrs I was on my back porch looking at the sky.  My attention was drawn to an extremely bright, round object approaching from the south.  At first I thought it was a satellite, but it was too large, bright and fast.  The object was circular, bluish white in color, with a faint reddish corona-type effect around it.  Its’ speed was too fast for a satellite and too slow for a meteor.  The object’s brightness remained the same as it passed overhead, traveling from south to north.  It did not flicker, sparkle or leave a trail as a meteor would and it made no sound.  There were commercial and general aviation aircraft in the sky at the time, and the object seemed to be much higher than the aircraft.  I watched it until it disappeared behind some scattered clouds that were forming to the north-east of my location.  The object changed its course slightly to the east just before it disappeared for good.  I saw an identical object about a month ago, following the same general path, but I was busy at the time and did not make note of the date or time.",
      "link": "http://www.nuforc.org/webreports/069/S69615.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ffa",
      "summary": "Two white, cigar shaped objects, pulsing with light.",
      "city": "riverside",
      "shape": "cigar",
      "date": "2009-01-10T00:00:00",
      "story": "Two white, cigar shaped objects, pulsing with light. On Wednesday, December 24, 2008 at 7:18 in the morning, I was driving North on Van Buren Blvd. in Riverside, Ca.   We were expecting a storm and the sky to the Northwest of where I was traveling was very grey.  Set against the grey sky, I saw two oval shaped objects.   What really caught my eye was the way they seemed to be pulsating with light. The two objects were cigar or oval shaped.  They looked to be Southwest of Mount Baldy.  The objects were parallel to each other with the lower one slightly to the right, or East of the other.  The whole sighting lasted just over a minute.  Both objects seemed to light up and then fade, repeatedly.  They looked to be pulsing with light.  Each pulse probably took a few seconds to complete, from getting bright to fading back out. As I was watching the objects and looking for somewhere to pull over, and perhaps snap a picture, the objects just disappeared.  They brightened and faded and then they were just gone.",
      "link": "http://www.nuforc.org/webreports/067/S67673.html",
      "state": "CA",
      "duration": "1.25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fb1",
      "summary": "Bright light moving from NW to SE",
      "city": "riverside",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Bright light moving from NW to SE On 10/11/08 about 19:00 I was on my back porch looking at the stars. The sky was clear and visibility good. I noticed a white light moving from the northwest towards the east. I first thought it was a satellite, but soon noticed it was much larger and brighter than any satellite I have ever seen. It was brilliant white, brighter and larger than Venus which was also visible in the southern sky. The light’s speed was similar to a high altitude commercial aircraft, and it changed it course slightly several times while I watched, finally arcing towards the southeast. I watched the light until it disappeared in the distance. The light’s brightness remained constant for the duration of the sighting.",
      "link": "http://www.nuforc.org/webreports/066/S66198.html",
      "state": "CA",
      "duration": "1 min approx"
    },
    {
      "_id": "64d005f478aba2ec5a3ba1e4",
      "summary": "Oval object with 5 or 6 smaller spheres",
      "city": "riverside",
      "shape": "formation",
      "date": "2009-01-10T00:00:00",
      "story": "Oval object with 5 or 6 smaller spheres On 12/27/2008 about 1649 PST I was on my back porch looking at the sky. The sky was bright to the south due to the setting sun, with some high altitude clouds in the background. Visibility was very good. There was a slight breeze from the north, which was slightly bowing tall palm trees in the area. I became aware of a stationary black dot just above the skyline directly to the south of my location. I first took it to be a tethered advertising balloon, but soon realized it was too high in the sky, and would interfere with aircraft. After several minutes I went into the house and got a pair of binoculars to get a better look at the object. With the binoculars I could see the dot was actually oval shaped. There were five or six smaller circular objects spread out below the oval in a semi-circle. These objects were not visible to the naked eye. I watched for several minutes, periodically fiddling with the adjustments on the binoculars to get a better view. The large object seemed to remain stationary, while the smaller objects slowly moved about beneath, seemingly grouping up with each other in various configurations. All the objects were opaque black, backlight by the bright light of the setting sun. The oval looked like it might have had a reddish spot near the top, but it could have been due to the lighting. I watched for about five minutes until I received a phone call. I tried to locate the objects when I finished the call several minutes later, but they were gone. I cannot estimate how far away the objects were but feel they were fairly distant. There were general aviation and commercial aircraft in the area at the time of the sighting. I rule out balloons due to their not reacting to the wind and the regular spacing that the objects maintained in relation to each other. Balloon I have seen released into the sky quickly dissipate and follow random paths following the direction of the wind. I am no computer whiz, but I have made two drawings which I will attempt to attach which illustrate my observations.",
      "link": "http://www.nuforc.org/webreports/067/S67896.html",
      "state": "CA",
      "duration": "5 min approx"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5ca",
      "summary": "LARGE YELLOW BALL THAT HOVERED IN THE SKY, IT DID NOT BLINK OR CHANGE SHAPE IN ANYWAY. IT SIMPLY GLOWED,  I RAN INSIDE TO GET MY BROTHE",
      "city": "riverside",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "LARGE YELLOW BALL THAT HOVERED IN THE SKY, IT DID NOT BLINK OR CHANGE SHAPE IN ANYWAY. IT SIMPLY GLOWED,  I RAN INSIDE TO GET MY BROTHER AND WAS INSIDE FOR ONLY A SPLIT SECOND, WHEN I RAN BACK OUT IT WAS GONE.",
      "link": "http://www.nuforc.org/webreports/067/S67808.html",
      "state": "CA",
      "duration": "1-2 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3ba616",
      "summary": "Bright flash followed by glowing, blinking object",
      "city": "riverside",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Bright flash followed by glowing, blinking object On 08/02/2008 about 2130 I was sitting on my back porch, looking at the sky. My attention was drawn by a very bright flash, like a photographic flash, to the southwest. When the flash dissipated, there was a glowing white object in the spot where the flash originated. The object looked like a large satellite, blinking on and off in an irregular pattern glowing brightly for about a second then dimming to complete darkness for one to several seconds. My first impression was that it was some type of satellite which was rotating and reflecting the sun, but I would imagine that the pattern of flashes would be at a more consistent interval. The object continued flashing on and off for about a minute. By connecting the locations where the object was glowing, it made a shallow ‘S’ shaped path, finally disappearing to the northwest. I checked the Heavens Above site for iridium flares and other objects which would account for this sighting, but I could not find anything for that time frame and location in the sky.",
      "link": "http://www.nuforc.org/webreports/064/S64972.html",
      "state": "CA",
      "duration": "1 minute approx."
    },
    {
      "_id": "64d005f478aba2ec5a3ba66e",
      "summary": "Large flash, bright streak in the sky",
      "city": "riverside",
      "shape": "flash",
      "date": "2008-08-12T00:00:00",
      "story": "Large flash, bright streak in the sky On 08/02/2008 about 2232 I was sitting on my back porch, looking at the sky, when I saw an extremely bright white flash low in the sky to the south of my location.  After the flash I saw a large, wide trail streaking towards the southwest.  The trail was yellowish in color, with green towards the leading edge.  After the flash and trail disappeared, there were two parallel gray streaks which lasted for several seconds.  It didn’t look like any meteor or fireball I have ever seen, maybe space debris re-entering?  It looked more like some type of exhaust trail or plume from a missile.   I checked the local paper and the internet for any other reports, all I could locate was the following entry in an astronomy message board. Maybe someone can identify what TV station the person is talking about. Object crashed by Ca. border last night. Just heard on the news that an object was observed, looking much like a meteor, but changing directions, then hit the ground. News reported within sixteen minutes a bevy of military helicopters appeared, one being a large carrier that picked up the item, still glowing, and left due north towards Vegas. Anyone hear, see, know anything about this?  Wondering if the Riverside group that's having a Star Party this weekend saw it.",
      "link": "http://www.nuforc.org/webreports/064/S64973.html",
      "state": "CA",
      "duration": "2-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba630",
      "summary": "light blinks out in front of my eyes",
      "city": "riverside",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "light blinks out in front of my eyes looking out of my living room window i saw a brigt light in the southwest sky moving very slow as i was looking at this light i noticed it had no beacon lights just a white somewhat bluish light the next thing that happen freaked me out right in front of my eyes this thing just blinked out it disapeared. it was a very clear night sky i could see all the stars there was no place for this light to go it did not fly away.it simply turn invisable like if someone turn the light off a few monutes later a plane few by this is a flight path used by ohare and midway thats why i thougt it a plane untill it blinked out, in wake of incoming airplane  im 38 grafic designer. all i could say was !wow iam now a true believer that there is life out there taking into consideration of how big the universe is and the abundis of life on this planet.",
      "link": "http://www.nuforc.org/webreports/069/S69204.html",
      "state": "IL",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba705",
      "summary": "Bright star like object moving south  changed colors from white to orange and then turned northeast.",
      "city": "riverside",
      "shape": "light",
      "date": "2008-08-12T00:00:00",
      "story": "Bright star like object moving south  changed colors from white to orange and then turned northeast. Object: bright star like object, white at first moving slowly in southern direction then turning orange and shrinking in size, the object then moved to a halt and waited in formation with star formation and proceeded to then again move northeast. The object proceeded northeast out of visual range.",
      "link": "http://www.nuforc.org/webreports/064/S64982.html",
      "state": "PA",
      "duration": "15 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba751",
      "summary": "Bright spere flying through the sky",
      "city": "riverside",
      "shape": "sphere",
      "date": "2009-03-19T00:00:00",
      "story": "Bright spere flying through the sky to sum it up, the object was about as bright and big as venus was a few weeks ago moving through the sky. I thought it may have been an airplane but as it passed the brightness remained constant so I am sure it was not an airplane. There were no other lights just a bright blue-white spere very large and very high. It was not racing across the sky just moving at a moderate speed about as fast an airliner would fly by us being that we are close to ohare and midway airports. I was on the phone with my brother at the time who lives in the same town about a mile away and he could see it also.",
      "link": "http://www.nuforc.org/webreports/069/S69244.html",
      "state": "IL",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bab1c",
      "summary": "6 oval objects flying over Riverside California",
      "city": "riverside",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "6 oval objects flying over Riverside California Looking up in the sky and seen 6 oval shapes just flying over, it was a nice clear day.  This is the first time I ever seen something like this I started taking pictures.",
      "link": "http://www.nuforc.org/webreports/077/S77924.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3baecd",
      "summary": "Hovering saucer seen during daylight by many witnesses",
      "city": "riverside",
      "shape": "disk",
      "date": "2011-03-10T00:00:00",
      "story": "Hovering saucer seen during daylight by many witnesses In the summer of 1975 after dinner one evening I was watching TV with my brother.  It was still light out, probably around 6-7pm.  I heard a strange buzzing/whirring sound that started softly and became louder and I said to my brother “do you hear that?” He said “hear what?”   As the sound diminished. A few seconds later the sound came back much louder this time and I said “you can’t hear that?” He replied “now I do” and we looked at each other puzzled.  I got off the couch and went and put my ear to the speaker on the TV set to hear if it was coming from there.  It wasn’t.  It became apparent it was coming from behind where we were sitting from outside the window. I walked over to the window and to my surprise a saucer shaped object about 35 feet in diameter was hovering at tree top height over a field between two houses a few hundred feet outside of our window.  We both watched in amazement as this saucer shaped craft hovered in front of us.  There seemed to be sec! tions of it that were rotating, some clockwise some counterclockwise and at different speeds. It was shiny grey metallic and had what appeared to be rows of colored lights.  I was eleven at the time and the feeling of overwhelming excitement was hard to contain.  I had no negative feelings about it. In fact I found it to be a very positive experience.  We were not scared.  It felt like the most magical experience of my life.  Very positive. I ran to get my camera and my brother went to get my sister.  When we got back to the window half a minute later it was gone. We checked the local news paper when it came out the following Monday for other reports.  Many people reported it to the police as could be seen in the police blotter, and later in the week a story came out about all the families who had seen it from a nearby school field while playing baseball. Witnessing that at such an early age has had a huge impact on my ability to accept the concept that we are not at the apex of intelligence in the universe as many would like us to believe. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80214.html",
      "state": "CT",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baed2",
      "summary": "Tubular shaped object at high altitude over souther calif",
      "city": "riverside",
      "shape": "cylinder",
      "date": "2011-03-10T00:00:00",
      "story": "Tubular shaped object at high altitude over souther calif What I saw was tube shaped with flat ends the color was a pale white.  It was at what appeared to be very high altitude.  I could see shadowing with some contrast,it remained stationary for about four hours.  There were two other people who observed it. I was able to look at it with a pair of field glasses while laying on my back.  This thing was in some sort of geo sync. I watched it untill it faded from view due to diminishing daylight.  It never moved, it remained fixed in one position above my location.  It slowly faded from view while never moving.  Again it appeared to remain at a stationary point, but must have been in the atmosphere at high altitude because as daylight waned it slowly faded with the approaching dusk ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80345.html",
      "state": "CA",
      "duration": "4:00"
    },
    {
      "_id": "64d005f478aba2ec5a3bb201",
      "summary": "Brilliant green object, seems to launch smaller white objetc",
      "city": "riverside",
      "shape": "light",
      "date": "2010-08-24T00:00:00",
      "story": "Brilliant green object, seems to launch smaller white objetc On 07/31/2010 I was on my back porch looking at the sky.  The sky was clear with just a few scattered clouds. I had originally gone out to see what was happening, as about an hour earlier, a pair of Blackhawk helicopters were circling the area, extremely low with only their battle lights on.  I ended up looking at the stars after they left.  At 2152 hrs I noticed what seemed to be a satellite approaching from the south, about 30 degrees above the horizon. It was moving rather slow for a satellite and moving towards the northwest.  It started as a dim white color but began increasing in size and intensity.  Just when I thought I was about to see a good iridium flare, I realized that instead of flaring and then subsiding, this object was continuing to increase in size and brilliance.  It became huge, larger and brighter than Saturn visible to the west, and the color was now an unusual shade of light green around the edge and brilliant white in the center.  It appeare! d to be self-illuminated and not reflecting the sun.  It remained at its brightest for several seconds, then it suddenly went completely dark for a fraction of a second, then returned with full brilliance.  Concurrent with this display, I noticed a small, white object shooting off to the west at a slight downward angle.  The white object looked like a small, very slow meteor leaving a short trail.  It appeared slightly below the green object and quite a bit to the right of it, but the trajectory of the white object in relation to the green object gave me the impression it had shot out from it. (It is possible that it was just a meteor as there was nothing unusual about it other than its appearance and proximity to the green object.)  The green object, after re-appearing, remained illuminated for a about a second, then rapidly diminished in size and became completely dark. It did not just blink off but seemed to \"power down.\" At 2202 hrs., I saw a two more objects one after another, almost directly overhead going from south to north. They performed similarly to the large green object, but did not become as bright and they remained white in color.  They too grew in intensity, flashed on and off several times and then went dark.  I checked the Heavens Above website and discovered that there were NO iridium satellites visible from my location on that date, and the other known objects that were visible were not overhead at the times or locations of these sightings.",
      "link": "http://www.nuforc.org/webreports/076/S76933.html",
      "state": "CA",
      "duration": "10 sec approx"
    },
    {
      "_id": "64d005f478aba2ec5a3bb642",
      "summary": "Extremely fast black triangle",
      "city": "riverside",
      "shape": "triangle",
      "date": "2011-01-31T00:00:00",
      "story": "Extremely fast black triangle On the evening of 01/25/2011 I was on my back porch, looking at the sky.  The sky was cloudless, but there was haze or smog which was reflecting the city streetlights, making it rather bright.  The stars were visible, notably Orion, which I was looking at while facing East.    At 1911 hours I noticed movement to the left in my peripheral vision.  I was surprised to see a pitch black object moving swiftly from North to South across my field of vision, passing just below the constellation Orion.  While the object was directly in front of me it appeared as an isosceles triangle, the length being approximately twice the width, with the point at the front.  It was angled slightly away from me, consistent with the object's \"wingspan\" being parallel to the ground and me observing it from underneath from the West.  The object disappeared quickly into the haze as it departed to the South. I estimate the duration of the sighting as 1, not more than 2 seconds.  There were no lights on the object, it was completely black against the slightly orange cast of the sky.  The edges seemed very sharp while it was directly in front of me, but it was more vague as it approached and departed.  There were numerous airliners and general aviation aircraft visible at the time which were clearly audible.  I heard no sound that could be attributed to the passing of the object.  I estimate the object was considerably lower than the airliners I could see which were on final approach to Orange County and LAX.",
      "link": "http://www.nuforc.org/webreports/079/S79833.html",
      "state": "CA",
      "duration": "1 second approx"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb04",
      "summary": "Dull orange orb suddenly appears",
      "city": "riverside",
      "shape": "circle",
      "date": "2010-07-06T00:00:00",
      "story": "Dull orange orb suddenly appears On 07/03/2010 at 2242 hours, I was sitting on my back porch looking at the sky.  The sky was clear, with stars, satellites and aircraft visible.  A dull orange colored orb suddenly \"switched on\" about 30 degrees above the southern horizon.  It was large in comparison to the stars and planets, I would estimate it was the size of a pea at arm's length.  It was moving quickly in an arc heading towards the northeast, faster than any of the aircraft that were visible but too slow to be a meteor.   The orb had an appearance similar to a circular charcoal briquet, with the center slightly flickering as it moved.  It was not very bright at all, as a landing light on a plane would be, and its circular shape was sharply defined.  It did not leave a trail of any type or make any sound.   I watched it until it disappeared behind the roof of my house.  I ran to the front yard, but was unable to locate it again.   I cannot say how high it might have been except that it did not seem to be as high as a satellite.   There were numerous commercial and general aviation aircraft in the sky at the same time and I could clearly hear the sounds they made.   A lot of neighbors were shooting off skyrockets, but the orb was clearly not any type of firework.",
      "link": "http://www.nuforc.org/webreports/076/S76104.html",
      "state": "CA",
      "duration": "1 minute approx."
    },
    {
      "_id": "64d005f478aba2ec5a3bbdd5",
      "summary": "2  Large Flashes of Light Seen in Riverside,CA 10:15pm 8/28/011",
      "city": "riverside",
      "shape": "flash",
      "date": "2011-10-10T00:00:00",
      "story": "2  Large Flashes of Light Seen in Riverside,CA 10:15pm 8/28/011 At 10:15pm tonight,I was sitting outside smoking a cigarette(facing East)when right before my eyes I saw what looked like two huge flashes of light on the horizon.  My best example of this would be when a really strong hurricane, or gusts of wind knock out the transformers and you see large,green flashes of light.  That's basically what I saw(and trust me,we deal with the Santa Ana's out here) one after another, but they weren't green. They were a light bluish hue,and dimmed to white on the outer edges of the flashes.  Lasted about 2-4 seconds?  One flash right after the other,BAM-BAM (didn't make any noise though)   Hope someone else out there saw it too, I think it was in the direction of Downtown Riverside?  Hope that helps!:)",
      "link": "http://www.nuforc.org/webreports/083/S83534.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfa5",
      "summary": "White dot flying at high speed on Labor Day evening in Riverside, CA",
      "city": "riverside",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "White dot flying at high speed on Labor Day evening in Riverside, CA I was outside in my back yard, facing west, with moderate lighting off to the left of me, but not glaring nor directly in my line of vision.  To my right, which was very dark, I saw what I thought was a falling star so I looked to it quickly to view it.  My sister-in-law saw it too and at first thought we were going to see a falling star.  In the 2nd second and on, we focused our vision on it and instead of seeing it burn out, we saw it was a round ball of bright white light with a short, comet-like tail streaming behind it.  The tail was slightly shorter than what you see on a falling star and of the same white color as the round light that it trailed.  It flew across the sky traveling from north to south in a perfectly horozontal line, at an altitude lower than any airplane in our area and faster than any aircraft that I have ever seen.  It made no sound of any sort.  I am familiar with aircraft, helicopters and military aircraft and have been to several air shows and seen an assortment of aircraft fly but this was much faster and made no sound.  We watched it for about 3 seconds (plus the second that we saw it in our perifrial vision when we thought it was a falling star) then lost sight of it as it passed in front of my house.  We ran to the south side to watch it continue on but we never saw it again.  It looked just like the craft seen in the Lake Elsinor ufo video earlier this year and Lake Elsinor is not too far from here.  March Air Force Base is directly to the east of me, about 7 miles away and this is no like anything that flies from there, much, much faster that any plane I have ever seen, silent and didn't have the flashing aircraft lights.",
      "link": "http://www.nuforc.org/webreports/083/S83799.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc32f",
      "summary": "Two large Fireballs slowly moving south to north 11-24-11",
      "city": "riverside",
      "shape": "fireball",
      "date": "2011-12-12T00:00:00",
      "story": "Two large Fireballs slowly moving south to north 11-24-11 We observed 2 rather large orange fireballs traveling south to north in the sky directly overhead.  Moving slowly and looking like burning fireballs, growing brighter and dimmer and brighter as they traveled. Moving relatively slow, not like a meteor, too slow and yet faster then a air force jet.  They did not seem to come towards the earth, but appeared to be passing by in space?  One of our witnesses seen two more 20 mins later, same area and projection of travel.",
      "link": "http://www.nuforc.org/webreports/085/S85477.html",
      "state": "NJ",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc659",
      "summary": "Two bright lights overhead, travelling S to N",
      "city": "riverside",
      "shape": "light",
      "date": "2011-08-21T00:00:00",
      "story": "Two bright lights overhead, travelling S to N On 08/02/2011, I was sitting on my back porch looking at the sky.  The night was clear, no haze and normal air traffic was abundant.  I saw numerous \"regular\" satellites passing overhead as well.   About 2204 hours I noticed a light appear about 45 degrees above the horizon to the south.  At first, I thought it was an iridium satellite, as it grew in intensity and size to a brilliant yellowish color.   About 1 to 2 seconds later, a second object appeared behind the first, following the exact path of the first.   The objects were separated by a space which was approximately the width of my thumb at arms' length.  The second object got increasingly brighter, surpassing the brilliance of the first by a small margin.  Unlike iridium satellites, these two objects remained at peak illumination for maybe 5 to 10 seconds before fading.   My impression is that the objects were self-illuminated and not reflecting the Sun.   Both objects seemed to veer slightly to the northwest as they passed overhead.  Both objects faded out one after the other and could not be seen anymore.  I checked the Heavens Above website and discovered that there were no iridium satellites or other man made objects in the vicinity at the time of my sighting.",
      "link": "http://www.nuforc.org/webreports/083/S83021.html",
      "state": "CA",
      "duration": "30 seconds + -"
    },
    {
      "_id": "64d005f478aba2ec5a3bd37c",
      "summary": "Bright orange light floating across the sky",
      "city": "riverside",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "I was in my room and my dad was in his room when he noticed an object in the sky through his window and went to the front yard where my brother, sister, and mom were.  My brother ran to my room to call me outside to see what they were all looking at.  I looked up and saw a bright orange light floating across the sky.  I lost sight of the object behind the trees and it was gone after that.  My sister claims that when she first saw the object it was changing different colors like one that we witnessed a year before on independence day when we were all in the backyard.",
      "link": "http://www.nuforc.org/webreports/090/S90717.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be215",
      "summary": "flying redish orange balls without tails flying down the street at a high rate of speed.",
      "city": "riverside",
      "shape": "circle",
      "date": "2012-05-29T00:00:00",
      "story": "flying redish orange balls without tails flying down the street at a high rate of speed. we saw 6-7 flying redish orange going down the street in a single file line evenly spaced out and when they passed my house they were above a tree and one by one all of the lights on them went out ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88976.html",
      "state": "RI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be450",
      "summary": "My kids were out side playing when one of them look up to the west and saw a lot of redish Orange orbs in the sky they ran the house to",
      "city": "riverside",
      "shape": "circle",
      "date": "2012-07-04T00:00:00",
      "story": "My kids were out side playing when one of them look up to the west and saw a lot of redish Orange orbs in the sky they ran the house to get me when I got outside they were coming up over the trees at the end of the street.  When we got to the end of the deadend .the orbs were going in all directions. Then as they got over the water they all went into a single file line for about one to two miles the the just went black ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90305.html",
      "state": "RI",
      "duration": "15 20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be519",
      "summary": "Silent Triangle UFO over riverside county CA. 5 circle shaped lights along the bottom of each 'wing' leading to a point",
      "city": "riverside",
      "shape": "triangle",
      "date": "2012-05-13T00:00:00",
      "story": "Silent Triangle UFO over riverside county CA. 5 circle shaped lights along the bottom of each 'wing' leading to a point It was a triangle shaped, low lit, completely silent, flying craft .  IMAGINE THE MATH SYMBOL FOR GREATER THAN/LESS THAN > About 5 circle shaped lights on each side as it came to a point, lowly lit - almost like a fuzzy glow, not a typical 'shine' from a light...after 5-7 seconds it was out of view... Time 8:40pm aprx. I live in Riverside, Ca, right near March Air force base. THIS WAS NOT AN AIRPLANE. THIS WAS NOT A HALLUCINATION. THIS IS NOT A JOKE",
      "link": "http://www.nuforc.org/webreports/088/S88715.html",
      "state": "CA",
      "duration": "5-7 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3be744",
      "summary": "Flying Orb videoed and photographed over Mt Rubidoux in Riverside, CA.",
      "city": "riverside",
      "shape": "changing",
      "date": "2012-05-29T00:00:00",
      "story": "Flying Orb videoed and photographed over Mt Rubidoux in Riverside, CA. My friend and I were walking home from downtown Riverside, CA. At approximately 10:05 am  today, May 21, 2012.  I looked up and saw a round white orb floating/hovering in the sky over Mt.Rubidoux...just a little to the right of a small dead tree on the side of the mountain. To be honest, I was just planning to look at the mountain as I have a thing for mountains. I looked at the orb like floating object for a moment and finally told my friend to look up as the object appeared to just be hovering.  After about 20 seconds, I decided to pull out my Kodak Play Sport Camera...that I always carry with me as I love to take pictures of my surroundings.  I started filming; however, I did not have my glasses on and could not see anything through my view finder, thus I only took a 19 second video clip from this vantage point.  The friend I was with suggested, I take still photos rather than video (which can be heard on the video) and then look at them when I get home to se! e what the object is by zooming in on the object if I actually got it in the picture frame. At first, I thought...maybe it is a star...but I love looking into the sky at daytime and night time, yet I have never seen a star in this location at this time during the day. Due to the brightness, maybe it could be a meteor...but this had no tail, nor did it appear to be moving. Then the idea of a plane was in my mind...but again...this object was hovering...it was not flying in any direction when I first started my observation.  Eventually, I thought it could be a balloon...but again...the object just hovered....it did not move up or down nor did it move side to side...it was stationary for at least 10 minutes before it began to very slowly move in a northward direction. I then thought...maybe it is a weather balloon...but again...it did not move and it appeared to be too low for this type of activity. Additionally, the object was too high to be a hot air balloon. The object itself over the 40 minute time frame appeared to be round but could change from triangle, square o! r diamond shape. Now over the next 40 minutes, my friend and I walked from Mt. Rubidoux …to the Carlson Bark Park and across the bridge to a fast food place (Baker's) on Mission Blvd.  After exiting Baker’s we walked up to Limonite.  During that walk, I took 12 still pictures from different locations and 2 separate videos...one being 19 seconds long and the other being 39 seconds long.  I personally would have watched this object even longer and taken more photos and videos if my friend was not wanting so much to get home before the heat became unbearable...after all, we were on a 6 mile walk.  Yet in the time we did look at this object, it did eventually move northward very slowly...in fact, we went into Baker's and when exiting about 10 minutes later, we could still see the orb nearing the mountains near Ontario or Fontana. Also, during our viewing, I saw at least 2 airliner (jets) fly by...so commercial jets did have an opportunity to witness this object as well.  As far as making any noise...neither of us heard anything.  Eventually, I lost sight of the orb once I got to Limonite and the sun was in my eyes...making it too difficult to see at this point.  However, I do have to say, when I got home and looked at my photos something interesting appears. Remember, at the time, I saw only one object...and that is also noted in the first 19 second video; however, in my first still picture...there is a second object off to the right and when zoomed in you can see a very solid object and yet when I took my second still picture...the second object is gone. We are talking literally seconds from picture to picture and I did not see or hear anything at the time. Yet for this object to be missing in the video and then in the first picture but not in the second picture it had to be traveling so fast that we j! ust could not have seen it. That is it. So yes, I do have pictures and videos from different locations and I used trees, telephone poles, light poles and the mountain as reference points...so it can be verified by qualified researchers. I also did not erase them from my camera, so if real scientist would like to observe it and get the data and meta data from the original pictures and video they have that to reference as well.  I would send in the pictures and videos but I only want them studied and verified by qualified professionals at this time until I can get proper copyrights on the video and photos. Witness A – 45 yr old, Male,  Former US Army Intelligence Analyst who served with the 75th Ranger Rgt, 10th Mtn. Div. and 18th MI Bn..  Was also a former Sheriff’s Deputy and holds an AA degree in Information Technology. Witness B – 42 yr old Male,  a business owner and holds an AA degree in Electronics.",
      "link": "http://www.nuforc.org/webreports/089/S89114.html",
      "state": "CA",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beeba",
      "summary": "Very bright green light coming from oval shaped object",
      "city": "riverside",
      "shape": "oval",
      "date": "2013-05-15T00:00:00",
      "story": "Very bright green light coming from oval shaped object I was in my car talking on the phone in my driveway (nighttime) as i notice a faint green light, light up in the sky.  At first i thought i was just seeing things, like 3 -5 seconds later the green light comes back and so i look out of my window and i see a very bright green oval object for half a second because it was moving and lost its view because of my roof the second i saw that i ran out of my car to get a better view but the second i opened my door the entire sky lit up as if the sun was green, thats how bright it got. It was like an adjustable light in your kitchen.  It started off very faint then exponentially got brighter to the point the green was begining to turn like a bright white and then instanly went away and went back to a dark night.  I even saw the clouds shinning green. the craziest thing i have ever seen. so i ran out to the side walk and realized that i was not the only one that saw it because 2 of my neighbors saw the same thing i did. n! o sounds either",
      "link": "http://www.nuforc.org/webreports/096/S96720.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1f5",
      "summary": "3 reflective spheres southbound over Riverside CA toward Lake Matthews in formation w/ one breaking off, then loss of contact.",
      "city": "riverside",
      "shape": "formation",
      "date": "2013-02-04T00:00:00",
      "story": "3 reflective spheres southbound over Riverside CA toward Lake Matthews in formation w/ one breaking off, then loss of contact. As I was driving westbound adjacent to the 91 freeway I noticed 3 small spheres flying in formation and moving faster than a helicopter or plane would.  They were headed in one direction; south. They were high in the air; if I had to guess I would say about 3000 feet. They were very reflective which is how I spotted them to begin with.  As they flew across the sky they were headed toward Lake Matthews. One split off from their formation and led the other two. About five seconds after that I lost sight of them. This is my first UFO sighting and have heard of many that are not recorded. I've seen and have been around aircraft (former US Navy, stationed on an aircraft carrier). I am sure of what I saw. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95870.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf34e",
      "summary": "20-25 bright orange orbs in full moon night sky, formed a line and changed direction, then disappeared",
      "city": "riverside",
      "shape": "circle",
      "date": "2013-09-30T00:00:00",
      "story": "20-25 bright orange orbs in full moon night sky, formed a line and changed direction, then disappeared Bright Orange Orbs began to appear low on the Western horizon, they began to appear in intervals of about seven seconds apart in pairs, they rose high in the sky and formed a curved string heading east then taking a southern turn, after about seven seconds from taking the turn then they disappeared.  One final orb came last, following the others---it was twice the size and more intensely bright than the earlier smaller ones.  They all pulsated. There were approx. 20 to 25 orbs. Witnesses were a 17 year old & a 14 year old (daughters), a 52 year old (mom) and a 55 year old (dad).",
      "link": "http://www.nuforc.org/webreports/102/S102103.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5c1",
      "summary": "Circular motion orange in color and transparent.",
      "city": "riverside",
      "shape": "changing",
      "date": "2013-09-09T00:00:00",
      "story": "Circular motion orange in color and transparent The object that I seen was orange and clear in color. It didn't make any noise or have any lights. It started off as a ball type object with what looked like a flag type tail at the end of the ball.  As it moved it got smaller the shape changed to what looked like a boomerang.  And then a cresant moon. I used my camera phone to take a very detailed photo of the object. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101869.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c063e",
      "summary": "Bright red lights over Riverside, CA.",
      "city": "riverside",
      "shape": "light",
      "date": "2013-02-18T00:00:00",
      "story": "Bright red lights over Riverside, CA Time is approximate – just past dusk.  I observed from north, bright red lights at very low altitude from west to east, climbing as they passed by.  Close enough that I should have heard engine noise, but silent.  The first three flew in a triangular formation, one in front, two behind.  Called my wife out to have a look.  We watched as 5 more passed by at approximately one minute intervals on same trajectories.  Tried to view with binoculars, but red light too bright.  Flew right over March ARB, which is restricted airspace.  Stayed well away from commercial flight paths, of which there are several in this area, e.g., Ontario and John Wayne approach. Note:  these must have been some type of aircraft conforming to aviation rules, which require a red light on a left wing.  But the brightness of the light made them seem to be very close, ½ mile or less, while completely silent and very fast.",
      "link": "http://www.nuforc.org/webreports/096/S96345.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a83",
      "summary": "UFO EXPERIENCE (PHENOMENA) TUESDAY JANUARY 18, 1977",
      "city": "riverside",
      "shape": "oval",
      "date": "2014-02-21T00:00:00",
      "story": "(JANUARY 28, 1977) UFO EXPERIENCE (PHENOMENA) TUESDAY JANUARY 18, 1977, AT 5:45 P.M.  ((NUFORC Note:  We spoke via telephone with the source of the reports below, and requested that he submit them as individual reports.  We are awaiting the reports.  PD)) I LEFT MY PARENTS HOME LOCATED IN EAST PROVIDENCE DESTINATION 195 EAST TO TIVERTON, R.I., FOR THE ((name deleted)) RESTAURANT, ((deleted)) ROAD.  ALSO HAD AN APPOINTMENT AT 8:45 P.M. IN THE AREA. WHILE DRIVING ON 195 EAST & BEING A UFO ENTHUSIAST, I AUTOMATICALLY SCAN THE SKY SEARCHING FOR THE BRIGHTEST STARS.  I SPOTTED TWO THAT WERE UNUSUALLY BRIGHT AND CONCENTRATED ON THEM FOR A WHILE.  ONE OF THE STARS WAS LOCATED ABOVE THE FALL RIVER AREA & THE OTHER IN NORTH TIVERTON ON THE OPPOSITE SIDE OF THE EXPRESSWAY OR IN RELATION TO THE BRAGA BRIDGE ON THE RIGHT.   ALL OF A SUDDEN, AS I WAS PASSING THROUGH SOMERSET, THE STAR SPURTED DIRECTLY OVER TO THE NORTHERN SECTION OF FALL RIVER WITH ACCELERATION FASTER THAN ANY JET I'VE EVER SEEN.  NEXT, I THOUGHT MAYBE I AM HALLUCINATING. TO MYSELF, I INDICATED, IF THE OBJECT SHOOTS BACK ACROSS THE HIGHWAY AGAIN IT'S GOT TO BE A UFO!   SURE ENOUGH TWO OR THREE SECONDS LATER IT WENT TO THE OPPOSITE SIDE.  I WAS ABSOLUTELY OVERWHELMED!  THEN I NOTICED THE SPACECRAFT, GLOWING LIKE A STAR, CONTINUE IN A NORTH EAST DIRECTION OVER THE BRAGA BRIDGE.  I PREPARED TO EXIT 14 S, HEADING FOR TIVERTON ON ROUTE 24, LOOKED UP AND COULD SEE THE UFO ON MY LEFT HEADING FOR TIVERTON.  THEN I NOTICED IT CROSS OVER ROUTE 24 TO THE OPPOSITE SIDE OF THE HIGHWAY ON MY RIGHT, IT SEEM TO HOVER THERE FOR A SHORT TIME.  AFTER ABOUT 5 MINUTES I COULD SEE THE CRAFT ON MY LEFT JUST BEFORE EXITING ROUTE 24 AND ON TO ROUTE 138 MAIN ROAD. UPON ENTERING THE PARKING LOT AT THE COACHMAN I DECIDED TO PARK AS CLOSE AS POSSIBLE TO THE ENTRACE DUE TO THE EXTREMELY INCLEMENT WEATHER.  I PARKED ABOUT 25 FEET FROM THE ENTRANCE IN THE DIRECTION OF THE RESTAURANT. I OPENED THE DOOR, LOOKED AT MY WATCH WHICH INDICATED 6:20 P.M. STEPT OUT AND LOOKED UP-TO MY ASTONISHMENT THERE BEFORE MY EYES AT A DISTANCE OF ABOUT 150 FEET IN THE SKY WAS THIS MAGNIFICENT GLOWING WHITE OVAL SHAPED OBJECT BRIGHTER THAN A FLUORESCENT LIGHT, IT HOVERED WITHOUT MOVING OR MAKING A SOUND. I HAD THIS TREMENDOUS FEELING OF BEING AT PEACE WITH MYSELF FOR SOME UNKNOWN REASON. A COUPLE OF MINUTES LATER MY GUEST DROVE INTO THE PARKING LOT.  I RAN TO HER DOOR, OPENED IT AND TOLD HER TO LOOK UP AND SHE SAID, WHAT A BRIGHT STAR!  I SAID, THIS IS A UFO.  WE WATCHED FOR ANOTHER MINUTE BUT BECAUSE IT WAS SO COLD OUTSIDE WE RAN TO THE ENTRANCE. OUR TABLE WAS SITUATED IN THE BACK OF THE DINING ROOM FACING THE BAY WITH A DIRECT VIEW OF BRISTOL, LOOKING SOUTHWEST I COULD SEE THE LIGHTED MT. HOPE BRIDGE.  WE LOOKED UP AND WE COULD SEE THE OBJECT, IT WAS IN CONSTANT OBSERVATION THROUGHOUT THE DINER MEAL.  AT APPROXIMATELY 7:45 P.M. THE CRAFT MOVED ABOUT 100 FEET, BOTH OF US WITNESSED THIS ACTIVITY AND AND OF COURSE I STATED, DO YOU BELIEVE IN UFO'S NOW?  SHE ANSWERED RATHER ABRUPTLY, I ALWAYS THOUGHT THIS WAS POSSIBLE BUT FIRMLY BELIEVE NOW.   AT ABOUT 8:10 P.M. THE UFO MANEUVERED ITSELF STRAIGHT ACROSS TO BRISTOL, DISAPPEARED, RE-APPEARED AND STOPPED IN THE CENTER OF THE BAY FOR TEN MINUTES, THEN FINALLY LEFT OUR VIEW AT 8:20 P.M. IN THE DIRECTION OF BRISTOL. WE DEPARTED FROM THE ((restaurant)) AT 8:45 P.M., MY GUEST LEFT IN THE OPPOSITE DIRECTION AND I PROCEEDED TO AN APPOINTMENT ON THE MAIN ROAD. UFO EXPERIENCE (PHENOMENA) WEDNESDAY JANUARY 19, 1977 DECIDED WEDNESDAY NIGHT I WOULD ATTEMPT A REPEAT PERFORMANCE OF TUESDAY NIGHT BY DRIVING TO TIVERTON THEN TO MY SISTER'S HOME IN PORTSMOUTH.  WITH CAMERA & BINOCULARS I LEFT MY PARENTS HOME FOR TIVERTON AT 6:40 P.M. WHILE DRIVING ON 195 EAST TO ROUTE 24 SOUTH AT APPROXIMATELY 7:00 P.M., THE UFO WAS NOW TRAVELLING ON MY LEFT AND TRAVERSING BACK & FORTH OVER THE HIGHWAY.  I DID NOT EXIT THE ((restaurant name deleted)) ROUTE 138 BUT INSTEAD CONTINUED TO PORTSMOUTH AND LOST ALL ACTIVITY AT THIS POINT. THURSDAY JANUARY 20, 1977 AT 8:15 A.M.  WHILE WAITING FOR A BUS TO PROVIDENCE I FELT A SHARP PAIN ON THE RIGHT SIDE OF MY FOREHEAD.  THIS CONDITION CONTINUED UNTIL LUNCHTIME AT 12:00 P.M. WHEN I FELT NAUSEATED AND DELAYED MY LUNCH FOR FORTY MINUTES UNTIL IT SUBSIDED.  WENT TO LUNCH AT 12:40 FEELING A LITTLE DIZZY, THIS PERSISTED UNTIL 2:30 P.M. THAT DAY. I UNDERSTAND AFTER CLOSE CONTACT OR EXPOSURE THIS REACTION CAN OCCUR. FRIDAY JANUARY 21, 1977 IT WAS A VERY CLOUDY NIGHT AND AT 6:25 P.M. ON ROUTE 24 SOUTH TO PORTSMOUTH, I NOTICED IN NORTH TIVERTON, ON MY RIGHT ABOVE THE CLOUDS, THIS BRIGHT LIGHT MOVING ACROSS THE HIGHWAY TO THE OPPOSITE SIDE AND HOVERED THERE.  I CONTINUED TO PORTSMOUTH. TUESDAY JANUARY 25, 1977 THIS WAS A CLEAR NIGHT AT 7:35 P.M. ON ROUTE 24 SOUTH TO MAIN ROAD TIVERTON FOR AN APPOINTMENT, MY FATHER & I NOTICED AT A DISTANCE OF ABOUT 1500 FEET IN THE SKY, A BRIGHT STAR (UFO) HOVERING FOR A FEW SECONDS THEN IT COMPLETELY VANISHED. THIS SUMMERIZES MY UFO EXPERIENCES FOR THE PAST TWO WEEKS.  IN EVERY SIGHTING INDICATED WITHIN THIS REPORT I NEVER SAW THE METALLIC PORTION OF THE UFO, THE CRAFT WAS ALWAYS ENGULFED COMPLETELY WITH A WHITE GLOW I MUST SAY THAT IT HAS BEEN A FANTASTIC EXPERIENCE AND OF COURSE I LOOK FOWARD TO THE FUTURE WITH GREAT ANTICIPATION. SINCERELY YOURS, (JANUARY 28, 1977) UFO EXPERIENCE (PHENOMENA) TUESDAY JANUARY 18, 1977 AT 5:45 P.M. I LEFT MY PARENTS HOME LOCATED IN EAST PROVIDENCE DESTINATION 195 EAST TO TIVERTON, R.I. FOR THE ((name deleted)) RESTAURANT, ((address deleted)) ROAD. ALSO HAD AN APPOINTMENT AT 8:45 P.M. IN THE AREA. WHILE DRIVING ON 195 EAST & BEING A UFO ENTHUSIAST, I AUTOMATICALLY SCAN THE SKY SEARCHING FOR THE BRIGHTEST STARS.  I SPOTTED TWO THAT WERE UNUSUALLY BRIGHT AND CONCENTRATED ON THEM FOR A WHILE. ONE OF THE STARS WAS LOCATED ABOVE THE FALL RIVER AREA & THE OTHER IN NORTH TIVERTON ON THE OPPOSITE SIDE OF THE EXPRESSWAY OR IN RELATION TO THE BRAGA BRIDGE ON THE RIGHT.   ALL OF A SUDDEN, AS I WAS PASSING THROUGH SOMERSET, THE STAR SPURTED DIRECTLY OVER TO THE NORTHERN SECTION OF FALL RIVER WITH ACCELERATION FASTER THAN ANY JET IV'E EVER SEEN.   NEXT I THOUGHT MAYBE I AM HALLUCINATING. TO MYSELF, I INDICATED, IF THE OBJECT SHOOTS BACK ACROSS THE HIGHWAY AGAIN ITS GOT TO BE A UFO!  SURE ENOUGH TWO OR THREE SECONDS LATER IT WENT TO THE OPPOSITE SIDE.  I WAS ABSOLUTELY OVERWHELMED!  THEN I NOTICED THE SPACECRAFT, GLOWING LIKE A STAR, CONTINUE IN A NORTH EAST DIRECTION OVER THE BRAGA BRIDGE.  I PREPARED TO EXIT 14S HEADING FOR TIVERTON ON ROUTE 24, LOOKED UP AND COULD SEE THE UFO ON MY LEFT HEADING FOR TIVERTON.  THEN I NOTICED IT CROSS OVER ROUTE 24 TO THE OPPOSITE SIDE OF THE HIGHWAY ON MY RIGHT, IT SEEM TO HOVER THERE FOR A SHORT TIME.  AFTER ABOUT 5 MINUTES I COULD SEE THE CRAFT ON MY LEFT JUST BEFORE EXITING ROUTE 24 AND ON TO ROUTE 138 MAIN ROAD. UPON ENTERING THE PARKING LOT AT THE ((deleted name of restaurant)) I DECIDED TO PARK AS CLOSE AS POSSIBLE TO THE ENTRANCE DUE TO THE EXTREMELY INCLEMENT WEATHER.  I PARKED ABOUT 25 FEET FROM THE ENTRANCE IN THE DIRECTION OF THE RESTAURANT. I OPENED THE DOOR, LOOKED AT MY WATCH WHICH INDICATED 6:20 P.M. STEPPED OUT AND LOOKED UP-TO MY ASTONISHMENT THERE BEFORE MY EYES AT A DISTANCE OF ABOUT 150 FEET IN THE SKY WAS THIS MAGNIFICENT GLOWING WHITE OVAL SHAPED OBJECT BRIGHTER THAN A FLUORESCENT LIGHT, IT HOVERED WITHOUT MOVING OR MAKING A SOUND. I HAD THIS TREMENDOUS FEELING OF BEING AT PEACE WITH MYSELF FOR SOME UNKNOWN REASON. A COUPLE OF MINUTES LATER MY GUEST DROVE INTO THE PARKING LOT. I RAN TO HER DOOR, OPENED IT AND TOLD HER TO LOOK UP AND SHE SAID, WHAT A BRIGHT STAR!  I SAID, THIS IS A UFO. WE WATCHED FOR ANOTHER MINUTE BUT BECAUSE IT WAS SO COLD OUTSIDE WE RAN TO THE ENTRANCE. OUR TABLE WAS SITUATED IN THE BACK OF THE DINING ROOM FACING THE BAY WITH A DIRECT VIEW OF BRISTOL, LOOKING SOUTHWEST I COULD SEE THE LIGHTED MT. HOPE BRIDGE. WE LOOKED UP AND WE COULD SEE THE OBJECT, IT WAS IN CONSTANT OBSERVATION THROUGHOUT THE DINER MEAL.  AT APPROXIMATELY 7:45 P.M. THE CRAFT MOVED ABOUT 100 FEET, BOTH OF US WITNESSED THIS ACTIVITY AND AND OF COURSE I STATED, DO YOU BELIEVE IN UFO'S NOW?  SHE ANSWERED RATHER ABRUPTLY, I ALWAYS THOUGHT THIS WAS POSSIBLE BUT FIRMLY BELIEVE NOW. AT ABOUT 8:10 P.M. THE UFO MANEUVERED ITSELF STRAIGHT ACROSS TO BRISTOL, DISAPPEARED, REAPPEARED AND STOPPED IN THE CENTER OF THE BAY FOR TEN MINUTES, THEN FINALLY LEFT OUR VIEW AT 8:20 P.M. IN THE DIRECTION OF BRISTOL. WE DEPARTED FROM THE COACHMAN AT 8:45 P.M., MY GUEST LEFT IN THE OPPOSITE DIRECTION AND I PROCEEDED TO AN APPOINTMENT ON THE MAIN ROAD. UFO EXPERIENCE (PHENOMENA) WEDNESDAY JANUARY 19, 1977 DECIDED WEDNESDAY NIGHT I WOULD ATTEMPT A REPEAT PERFORMANCE OF TUESDAY NIGHT BY DRIVING TO TIVERTON THEN TO MY SISTER'S HOME IN PORTSMOUTH. WITH CAMERA & BINOCULARS I LEFT MY PARENTS HOME FOR TIVERTON AT 6:40 P.M. WHILE DRIVING ON 195 EAST TO ROUTE 24 SOUTH AT APPROXIMATELY 7:00 P.M., THE UFO WAS NOW TRAVELLING ON MY LEFT AND TRAVERSING BACK & FORTH OVER THE HIGHWAY. I DID NOT EXIT THE ((deleted))  ROUTE 138 BUT INSTEAD CONTINUED TO PORTSMOUTH AND LOST ALL ACTIVITY AT THIS POINT. THURSDAY JANUARY 20, 1977 AT 8:15 A.M. WHILE WAITING FOR A BUS TO PROVIDENCE I FELT A SHARP PAIN ON THE RIGHT SIDE OF MY FOREHEAD. THIS CONDITION CONTINUED UNTIL LUNCHTIME AT 12:00 P.M. WHEN I FELT NAUSEATED AND DELAYED MY LUNCH FOR FORTY MINUTES UNTIL IT SUBSIDED. WENT TO LUNCH AT 12:40 FEELING A LITTLE DIZZY, THIS PERSISTED UNTIL 2:30 P.M. THAT DAY. I UNDERSTAND AFTER CLOSE CONTACT OR EXPOSURE THIS REACTION CAN OCCUR. FRIDAY JANUARY 21, 1977 IT WAS A VERY CLOUDY NIGHT AND AT 6:25 P.M. ON ROUTE 24 SOUTH TO PORTSMOUTH, I NOTICED IN NORTH TIVERTON, ON MY RIGHT ABOVE THE CLOUDS, THIS BRIGHT LIGHT MOVING ACROSS THE HIGHWAY TO THE OPPOSITE SIDE AND HOVERED THERE. I CONTINUED TO PORTSMOUTH. TUESDAY JANUARY 25, 1977 THIS WAS A CLEAR NIGHT AT 7:35 P.M. ON ROUTE 24 SOUTH TO MAIN ROAD TIVERTON FOR AN APPOINTMENT, MY FATHER & I NOTICED AT A DISTANCE OF ABOUT 1500 FEET IN THE SKY, A BRIGHT STAR (UFO) HOVERING FOR A FEW SECONDS THEN IT COMPLETELY VANISHED. THIS SUMMERIZES MY UFO EXPERIENCES FOR THE PAST TWO WEEKS. IN EVERY SIGHTING INDICATED WITHIN THIS REPORT I NEVER SAW THE METALLIC PORTION OF THE UFO, THE CRAFT WAS ALWAYS ENGULFED COMPLETELY WITH A WHITE GLOW I MUST SAY THAT IT HAS BEEN A FANTASTIC EXPERIENCE AND OF COURSE I LOOK FORWARD TO THE FUTURE WITH GREAT ANTICIPATION. SINCERELY YOURS,",
      "link": "http://www.nuforc.org/webreports/107/S107166.html",
      "state": "RI",
      "duration": "10 days"
    },
    {
      "_id": "64d005f478aba2ec5a3c10a0",
      "summary": "I was on the corner of Blaine and Massachusetts Ave and myself and many others saw a red sphere flying westward high in the sky. It the",
      "city": "riverside",
      "shape": "sphere",
      "date": "2014-01-10T00:00:00",
      "story": "I was on the corner of Blaine and Massachusetts Ave and myself and many others saw a red sphere flying westward high in the sky.  It then started to move vertical and side to side while changing colors.  The barbers at \"Getting Faded\" came outside and witnessed it all for themselves as well.  The object seemed to be near Moreno Valley and was flying west towards Los Angeles.",
      "link": "http://www.nuforc.org/webreports/105/S105977.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c62",
      "summary": "On the evening of June 14th 2014, at approximately 23:00, I witnessed a slow moving light. It was traveling South to North, at what see",
      "city": "riverside",
      "shape": "light",
      "date": "2014-06-20T00:00:00",
      "story": "On the evening of June 14th 2014, at approximately 23:00, I witnessed a slow moving light.  It was traveling South to North, at what seemed slower then most of the air traffic in the area and at a higher altitude.   It seemed awkward because all the local air traffic travels East to west.   I have witnessed Satellites before and they appeared to move at a faster speed.   The object I witnessed could be seen with the naked eye and was traveling slower than anything I have witnessed before, but the path was very specific, not like a weather balloon.",
      "link": "http://www.nuforc.org/webreports/110/S110408.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2051",
      "summary": "Floating fire ball object in the shape of a diamond.",
      "city": "riverside",
      "shape": "diamond",
      "date": "2014-05-02T00:00:00",
      "story": "Floating fire ball object in the shape of a diamond. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108941.html",
      "state": "NJ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c220f",
      "summary": "4-5 circular white lights rotate around a circular orbit over part of Riverside.",
      "city": "riverside",
      "shape": "disk",
      "date": "2014-04-11T00:00:00",
      "story": "4 - 5 circular white lights rotate around a circular orbit over part of Riverside. As I was driving my car out of our garage, and down our drive way, a circular moving light in the sky caught my eye.   As I followed it with my eyes, there seem to be three or more white circular lights rotating around in a circle (like on an orbit path).  I thought of searchlights, but didn’t see the typical stream of light.  I thought of a helicopter searchlight, but there seemed to be no aircraft nearby. As I drove on out of my neighborhood, I tried to identify where it may have come from.  I never figured it out.   Tonight, I googled a group of words, and found this website.  I read a listing for 4/3/2014 out in another city (I believe).  They have a similar listing.  That is why I thought I would report this one.",
      "link": "http://www.nuforc.org/webreports/108/S108407.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2350",
      "summary": "Fireball seen in rual Riverside Iowa",
      "city": "riverside",
      "shape": "fireball",
      "date": "2014-04-04T00:00:00",
      "story": "Fireball seen in rual Riverside Iowa Around 5:30pm myself and 2 family members were walking from the house to the car when we heard what sounded like electricity cracking through the sky. My daughter pointed to the south and about 500-600 feet in the sky was this orange-red fireball type object screaming through the air. As it went over our home it set the car alarms off and our horses were trying to jump the gates.  We noticed shortly after that our cell phones had shut off too .",
      "link": "http://www.nuforc.org/webreports/108/S108167.html",
      "state": "IA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c28e4",
      "summary": "We witnessed 20 bright orange aircraft traveling from east to west, flying low, equally spaced apart, about the speed of airplane.",
      "city": "riverside",
      "shape": "formation",
      "date": "2014-11-21T00:00:00",
      "story": "We witnessed 20 bright orange aircraft traveling from east to west, flying low, equally spaced apart, about the speed of airplane. I live in a rural area around Riverside, Texas.  The sky is very spacious here.  It was on a clear night on November the 15 at 9:30 p.m.  I was taking my dog out for a potty walk.  I noticed how beautiful and clear the sky was.  When I noticed some aircraft  that I have never seen before flying low in the sky.  They were bright orange lighting, not flashing, much larger than an airplane.  They resembled the size of a space station that I have seen when it passes over.  They were traveling from east to west across the sky.  About the speed of an airplane.  I could not hear a noise coming from them.   There was an  airplane in the sky at the same time which I could identify and hear at the same time the other aircraft were out.  It was traveling from south to north.  The other aircraft all traveled about the same distance apart comeing from the same direction.  I counted about seven when I first noticed them.  There could have been more.   I went in the house and notified my daughter and she came out and witnessed them also.  Then we counted about 17 but there were probably more that we didn’t set our eyes on.",
      "link": "http://www.nuforc.org/webreports/115/S115417.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29bb",
      "summary": "Round Cylinder shaped craft, being chased by 2 fighter jets.",
      "city": "riverside",
      "shape": "cylinder",
      "date": "2014-09-18T00:00:00",
      "story": "Round Cylinder shaped craft, being chased by 2 fighter jets. Okay, I am reporting what was reported by several Riverside County citizens over the 91/215/60 freeway interchange this morning about 5:45 a.m.   There is a UTUBE video posted by one Tim Kaiser, with a cylinder being chased by 2 airforce jets.  It's real.  I tried to send the UTUBE to your UFO site, but could not figure out how to do it.  Is it posted on my Facebook Timeline Page.  If you would like to contact me, I can share it with a site you identify.  This is really amazing video.",
      "link": "http://www.nuforc.org/webreports/113/S113483.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a7e",
      "summary": "A triangular object with 5 bright lights.",
      "city": "riverside",
      "shape": "triangle",
      "date": "2014-11-26T00:00:00",
      "story": "a triangular object with 5 bright lights. I was walking home from a friend's house..as I looked into the sky I saw two bright objects . I didn't think anything of it..but as I continued walking...I noticed that the two objects were drifting apart slowly ..I then pulled out my phone and recorded.   The NEXT night.  I saw the same thing..but I continue seeing objects coming and as they head east of my home..the just disappear into thin air..I had a severe Hallucination a couple days ago.  I was laying down and my room suddenly turned black and white...everything seemed like a wave an  moving in a wave motion and I was walking around..but then I woke up...I thought it was real ..it was SO vivid.  But a strange thing...as I felt myself wake up..I saw a flash of a triangle shaped colorful object..I lost 30 minutes.  But it felt like 30 seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115609.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bc3",
      "summary": "Silver object hovering over Riverside/Fairborn Area close to WPAFB.",
      "city": "riverside",
      "shape": "changing",
      "date": "2014-09-25T00:00:00",
      "story": "Silver object hovering over Riverside/Fairborn Area close to WPAFB. Bright silver object, looking as though it had wings on either side, however, when it hovered for about 1 minute and when doing so, it changed shapes with a reddish triangle coming from the bottom of the object.  It twirled while hovering and when I circled the block to get a picture of it, the object took off, heading north/northwest and then disappeared.",
      "link": "http://www.nuforc.org/webreports/113/S113778.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c394a",
      "summary": "Friend's phone call leads to mutual sighting of object with odd 'plume'.",
      "city": "riverside",
      "shape": "other",
      "date": "2014-12-18T00:00:00",
      "story": "Friend's phone call leads to mutual sighting of object with odd 'plume'. ((NUFORC Note:  Atlas V missile launch from Vandenberg AFB at 19:19 hrs. (PST)  PD)) At 19:21 - according to my phone's call log - I received a call from my best friend, (who lives just over ten miles away in Norco, CA.), telling me that she was startled and amazed to be looking at 'something really weird' in the night skies over her home. As I headed out my own door (to see if I could spot anything), I realized that it was unlikely I'd be able to even see the sky at all - due to massive rains all day and low, thick, stormy clouds not to mention our distance from one another. However, as I stepped out from between the houses and into the open, I found it to be largely clearing above and to the west. As I scanned the dark, patchy skies, I immediately spotted several aircraft tracking and blinking as on any normal, Friday evening. As she continued trying to relate to me in excited bewilderment what she was seeing, I was just beginning to scan the night sky above my own house when she suddenly cursed that it had vanished; it had abruptly just 'winked out'. As she started-in bitterly about its sudden absence, off to my west (toward Norco) - something odd suddenly DID catch my eye and I had to stop her. It was something odd and it was tracking southward. Whatever it was, it was clearly and definitely NOT an airplane. I was confused by its appearance. I initially considered a meteor, but no ...then a comet... but also no. It appeared to be a small, solid, red light, shaped rather oblong lengthwise - like a thick grain of rice - with a comparatively huge, translucent 'bloom' behind it; kind of like the ones that envelop the rear halves of fighter jets as they pierce the sound barrier. But that's not what this was. It was utterly soundless and appeared to be moving more at the pace of a Cessna or helicopter, rather than any sort of jet. Gobsmacked, I focused and strained and squinted to get as good of a look as possible as I mumbled into my cellphone what I was seeing as she excitedly confirmed that it was exactly what she had just been observing. I was able to clearly see it for a good six seconds, as it moseyed slowly along, due south - directly (and maddeningly) toward one of the many low, pink, angry clouds around the area. It then moved behind the cloud from whence I never saw it emerge. I checked the 'color-change' box because although to me the object shone in an unblinking, unchanging 'stoplight red', my friend swears that it appeared as a bright white, to her. But what we both DID clearly see was the huge 'plume' at the trailing end. It was in fact this odd feature that first drew the eye. It looked like the top of an open, translucent 'umbrella' curved back and emanating directly from the rear of the object. Again, there were typical, nighttime aviation activities ongoing in the skies above me - flickering jetliners and local flights headed this way and that at their various flight levels. I spotted about five or six flashing lights immediately and easily identifiable as normal, evening air traffic - but they all seemed oblivious to the object, which - in fairness - was more or less in a patch of sky sort of off to itself - and fairly equidistant from any other traffic. Sadly, I've been unable to find any local (nor anywhere) mention of this phenomenon on the internet. SURELY she and I COULDN'T have been the only ones in Southern California to have seen this amazing object.",
      "link": "http://www.nuforc.org/webreports/116/S116019.html",
      "state": "CA",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c432a",
      "summary": "Something strange in the sky.",
      "city": "riverside",
      "shape": "formation",
      "date": "2015-11-19T00:00:00",
      "story": "Something strange in the sky. I have no recollection of taking this picture, but found it while going through my iPhone.   I suspect we were out on our boat taking pictures, because this one was amongst several other pictures. I tried to enhance the photo myself to see if I could bring more detail into focus, but wasn't really able to.  This is the unadulterated photo.",
      "link": "http://www.nuforc.org/webreports/124/S124114.html",
      "state": "RI",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c4364",
      "summary": "Orb of light emitting light in oposite direction of travel.  Left a glowing green cloud.  ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "riverside",
      "shape": "sphere",
      "date": "2015-11-19T00:00:00",
      "story": "Orb of light emitting light in opposite direction of travel.  Left a glowing cloud that turned green. ((NUFORC Note:  US Navy missile launch.  PD)) ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123780.html",
      "state": "CA",
      "duration": "2.00"
    },
    {
      "_id": "64d005f478aba2ec5a3c4510",
      "summary": "Saw two white crosses lit in sky and then they turned green. One cross disappeared and then came back 5 seconds or so later. This kept",
      "city": "riverside",
      "shape": "cross",
      "date": "2015-11-19T00:00:00",
      "story": "Saw two white crosses lit in sky and then they turned green.  One cross disappeared and then came back 5 seconds or so later.  This kept happening for 7 minutes and then stopped.  So freaky to watch this. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123993.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c473d",
      "summary": "Bluish light in the sky.  ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "riverside",
      "shape": "light",
      "date": "2015-11-12T00:00:00",
      "story": "Driving south on 215 freeway, my daughter shouted from the back seat, \"What is that light, dad?\"  I didn't see anything at first, but did see a giant bluish light in the sky to the west. Must have lasted 10 minutes or so.  Other have reported seeing it as far north as the Bat Area, south as far as San Diego and east as far as Nevada. ((NUFORC Note:  US Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123598.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c47bb",
      "summary": "Big ball of light like it was a helicopter spotlight but there was no aircraft, ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "riverside",
      "shape": "light",
      "date": "2015-11-12T00:00:00",
      "story": "Big ball of light like it was a helicopter spotlight but there was no aircraft, it looks cloudy around the area but the sky was clear. One the light disappeared there was a cloudy hazy turquoise sphere which was very dim but visable. ((NUFORC Note:  US Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123570.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ef2",
      "summary": "Strange light appears out of thin air and shoots down into earth, but not before disappearing again.",
      "city": "riverside",
      "shape": "light",
      "date": "2016-03-04T00:00:00",
      "story": "Strange light appears out of thin air and shoots down into earth, but not before disappearing again. Tuesday night, I was driving home from school on Van Buren blvd and all of a sudden a light appeared in the sky--out of nowhere and very low to the horizon.  It looked like a star appeared out of the of the sky which was not there before.   As soon as it appeared it stopped for a second as if it was completely still, then it proceeded to shoot down towards the Earth with extreme speed and disappeared into thin air before it 'hit'.   What made this stranger was that shooting stars are normally above you and not super low like that.  It was suddenly there then suddenly not.",
      "link": "http://www.nuforc.org/webreports/126/S126057.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f7e",
      "summary": "Saw what could have been a meteor fall from sky. White ball of light with long tail behind.  ((NUFORC Note:  Meteor?  PD))",
      "city": "riverside",
      "shape": "fireball",
      "date": "2016-03-11T00:00:00",
      "story": "Saw what could have been a meteor fall from sky.  White ball of light with long tail behind. ((NUFORC Note:  Meteor?  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126231.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5645",
      "summary": "Red lights to the North during Patriot High fireworks",
      "city": "riverside",
      "shape": "unknown",
      "date": "2016-07-08T00:00:00",
      "story": "Red lights to the North during Patriot High fireworks Watching fireworks display I saw a red light to my NW thought it was a helicopter until it stopped on a dime and hovered for a few minutes then moved in a manner uncharacteristic of a helicopter back to the SW a 100 feet then it continued to hover and move in a very smooth manner a number of times. It then went towards the NE and I lost sight behind trees as it moved from the area.  Too high for a drone too smooth for a helicopter and the manner of flight did not indicate a plane (which were in the area since we are on the flight path into Ontario airport)  Multiple people viewed and exclaimed that it was extraordinary.",
      "link": "http://www.nuforc.org/webreports/128/S128240.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b4d",
      "summary": "Star-like light with a tail disappears mid-flight",
      "city": "riverside",
      "shape": "light",
      "date": "2016-04-15T00:00:00",
      "story": "a star-like light with a tail disappears mid-flight I was sitting in a car driving along the road.  I was looking outside the window like i always do and glanced at the nighttime sky.  I saw what looked like a bright green star, but it was moving horizontally across the sky and had a tail.  It then suddenly disappeared mid-flight. I also saw/reported a ufo(which was also green and star-like, but different) about a week ago.  The two sightings took place in nearby locations. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126705.html",
      "state": "CA",
      "duration": "few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c14",
      "summary": "Green light that quickly fell downwards",
      "city": "riverside",
      "shape": "light",
      "date": "2016-04-01T00:00:00",
      "story": "A green light that quickly fell downwards. I glanced at the night sky right when a bright green light appeared and it quickly fell in a downward curve.",
      "link": "http://www.nuforc.org/webreports/126/S126570.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cc3",
      "summary": "Orion's Belts seen in the daytime turning into moving star formationspr",
      "city": "riverside",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "Orion Belts seen in the daytime turning into moving star formationspr It was around 4:30pm, bright day, and I looked up and there were three stars that looked like Orion's Belt, but I was seeing it in the day.  I continued to stare and them then they started to move from Orion's Belt formation into an H formation.  The left star move up two more came into view from below totalling 5.   They continue to move into an H then another come from the right. When they started to move my friend came down and I showed her what I was seeing.  A plane flew by and I had to tell her to follow the plane and then said right there can you the stars because they were so high up.  She did see the star things.  I took 4 pics but they were so high my phone didn't capture them",
      "link": "http://www.nuforc.org/webreports/131/S131569.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c62b0",
      "summary": "Shaped like plane but silver and had very thin body, long thin wings, with T shaped tail that had a white light. ((anonymous report))",
      "city": "riverside",
      "shape": "other",
      "date": "2016-09-15T00:00:00",
      "story": "Shaped like plane but was silver and had very thin body and long thin wings with T shaped tail that had a white light on it.  At first white lights on underside, then they changed to red, approx 10-12 of them.  Craft was headed NE, below commercial plane level, made no sound.  2nd one seen today. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129866.html",
      "state": "OH",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c64de",
      "summary": "Orange orb over the 60 freeway in Riverside, California.",
      "city": "riverside",
      "shape": "other",
      "date": "2016-08-19T00:00:00",
      "story": "Orange orb over the 60 freeway in Riverside, California. I was at the Van Buren Drive in movies in Riverside, California, when I suddenly saw a Orange orb zoom past over the 60 freeway.  It was the size of half a small car. I couldn't get a good look the exact size because it went by so fast.   I did see a helicopter about 30 mins after around the same location of the freeway.",
      "link": "http://www.nuforc.org/webreports/129/S129311.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c6650",
      "summary": "Pair of white light balls rapidly fade in and out, over Riverside City, Southern California.",
      "city": "riverside",
      "shape": "light",
      "date": "2016-08-02T00:00:00",
      "story": "Pair of white light balls rapidly fade in and out, over Riverside City, Southern California. At approximately 21:49 (I checked my phone, after the event), while swimming, in our pool, my wife and I witnessed two very large balls of pure white light following one another, about 3 seconds apart. They appeared as two low points of light, travelling South, in a straight line, grew very bright in intensity, then faded rapidly. My wife told me, \"I wouldn't have believed you, if I hadn't seen them, myself\". These objects appeared to be \"in atmosphere\" and well above normal commercial aircraft traffic (all air traffic is East West, in this airspace).  No blinking, or colored lights. Oddly enough, I've seen single balls of light, on the same trajectory, about once a month, for the past 2 years.  This was odd, to see two lights, following one another.",
      "link": "http://www.nuforc.org/webreports/128/S128905.html",
      "state": "CA",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c676d",
      "summary": "Strange orb looking lights floating across night sky in California",
      "city": "riverside",
      "shape": "light",
      "date": "2017-04-13T00:00:00",
      "story": "Strange orb looking lights floating across night sky in California My cousins & I were sitting outside when she noticed a few lights in the sky floating across in the same direction.  They looked like orbs just floating across sky but there were so many and they made no noise like that of an aircraft.  They did not blink or have any flashing light  but just seemed to disappear.  They looked like white lights floating.  I have video of it to at a certain time frame a light or something below these lights is seen streaking thru the sky below them.  I can't find anything online as far as anyone else seeing this or an explanation.",
      "link": "http://www.nuforc.org/webreports/133/S133479.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c67b0",
      "summary": "I saw a blue streak moving across the sky.",
      "city": "riverside",
      "shape": "other",
      "date": "2017-04-13T00:00:00",
      "story": "I saw a blue streak moving across the sky. I live approximately 15 miles North of Omak, Washington (State), and about 25 minutes south of the Canadian border.  At precisely 10:25 p.m. on April 7, 2017 - 13 miles north of Riverside, Washington, I was driving home (north) on Hwy. 97 when a blue streak of light went across the sky from right to left (east to west or NE to SW).   It moved from 360 degrees north to approximately 300 degrees in two seconds.  It would have been approximately 1/16 or smaller of the size of the moon.  The head of the streak was round with the blue streak following and being parallel & connected to the round ball - example (lollipop).  It was very low within the earth atmosphere and could have been just inside the border of British Columbia, Canada.   Two of Okanogan County sheriff vehicles just passed me seconds before the streak appeared and so I am not sure if they noticed what my wife and I witnessed.   If others saw what we saw, I would appreciate them filling out a report; thereby, verifying this event. ((NUFORC Note:  We spoke via telephone with the individual who submitted this report, and we found him to be both eloquent, and serious-minded, in his description of his sighting.  We suspect he is a very good, and very reliable, witness.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133478.html",
      "state": "WA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6846",
      "summary": "I was driving N on I-215 and my 9 year old son shouted from the back, \"Mom, mom what the heck is that?\"",
      "city": "riverside",
      "shape": "disk",
      "date": "2017-03-23T00:00:00",
      "story": "I was driving North on I 215 and my 9 year old son shouted from the back &quot; Mom, mom what the heck is that ... Mom look.&quot; Unfo I was driving North on I 215 and my 9 year old son shouted from the back, \"Mom, mom what the heck is that?... Mom look.\"   Unfortunately, I was in heavy, fast moving traffic and just couldn't take my eyes off the road.  He watched a flat disc move at incredible speed across the length of the mountains.  He said, \"Mom, I know how fast a plane crosses that space.  It takes minutes, and that thing crossed in seconds - the whole mountain range and then just vanished.\"   He couldn't get over what he had seen.   I am soooo bummed I missed it.",
      "link": "http://www.nuforc.org/webreports/133/S133178.html",
      "state": "CA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c38",
      "summary": "I saw a small red lighted ball in the clear night sky for approximately 3 minutes. I was able to take 3 photos of it. No sound.",
      "city": "riverside",
      "shape": "circle",
      "date": "2017-01-06T00:00:00",
      "story": "I saw a small red lighted ball in the clear night sky for approximately 3 minutes.  I was able to take 3 photos of it. No sound. While going outside to the backyard at 10pm., to close the pool gate, I looked up as usual to see stars on a clear night's sky.  Directly above, was one round red glowing ball, just below the cloud range, easily seen. It moved closer, and I went back in a few steps to get my Nikon camera by the door.  I then went outside again quickly, and was able to get 3 photos of it still there.  The 1st 2 photos were about the same; but the third photo taken as it QUICKLY went deeper into the night sky.  Only in the third photo, did I see any change in shape, from a circle.  Third photo, it was a small triangle with an \"arm\" light streak.  There were no other air crafts in the sky.  There was no sound to the object, and it is very quiet in this area.",
      "link": "http://www.nuforc.org/webreports/131/S131942.html",
      "state": "RI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7197",
      "summary": "Pulsing red light, changes colors & altitude.",
      "city": "riverside",
      "shape": "light",
      "date": "2017-07-14T00:00:00",
      "story": "Pulsing red light, changes colors & altitude. On the night of July 8, 2017, my wife called my attention to a red ball of light  approximately 20 miles away, to the West. The light was bright red and pulsing bright & dim.  It hovered, then rapidly ascended straight up.  On the way up, it changed color from red, to blue, to pale yellow, orange, then back to red, when it stopped. It hovered a few moments, then remained red and slowly descended, below the horizon. The entire event lasted about one minute. The light was incredibly bright, for as far away as it was.",
      "link": "http://www.nuforc.org/webreports/135/S135046.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7428",
      "summary": "Red light (looked/twinkled like a star) moving in slow circular pattern near Arcturus. Lasted a few minutes.  ((anonymous report))",
      "city": "riverside",
      "shape": "other",
      "date": "2017-06-02T00:00:00",
      "story": "Red light (looked/twinkled like a star) moving in slow circular pattern near Arcturus.  Lasted a few minutes, disappeared, followed by bright circular flash nearby and audible boom/percussion.  Never seen anything like it.  Missile test? ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134341.html",
      "state": "CA",
      "duration": "Few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c53",
      "summary": "I was leaving riverside driving on the 60 fwy when I saw a flashing light on the sky as if u were lighting a match little light was fla",
      "city": "riverside",
      "shape": "triangle",
      "date": "2017-09-28T00:00:00",
      "story": "I was leaving riverside driving on the 60 fwy when I saw a flashing light on the sky as if u were lighting a match little light was flashing on, at first I thought it could be a helicopter but as it started to change lights higher and higher then the light disappeared leaving one light which was moving flying after few seconds again the bright light appear. Flying at a fast speed.",
      "link": "http://www.nuforc.org/webreports/136/S136329.html",
      "state": "",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d2f",
      "summary": "Flashing object.",
      "city": "riverside",
      "shape": "unknown",
      "date": "2017-09-14T00:00:00",
      "story": "Flashing object Sunday morning September 9, 2017, between 1000 hours and 1100 hours, I was working on a vehicle in my driveway, when I noticed movement in the sky to my north-west.  The flash(es) caught my attention as I thought it might be an aircraft making a turn and a reflection was off of a cockpit windscreen.  I watched an object at an elevation of estimated 5,000 to 8,000 feet moving from north to south.  The object moved at a consistent speed and elevation.  The weather was warm with full sun with a very light breeze, barely discernible from south to north, with light scattered clouds that the object moved through or behind in its track.  Flashing as it moved through the sky. I was able to retrieve a pair of binoculars to get a better visual on the object.  By this time my son and wife joined in the watching this unknown object and kept track of its location.  The object had stopped and was now stationary in the western sky for about 5 minutes.   With the binoculars, I could not discern its shape; but the top and bottom portions were flashing separately and very brightly.  The object was emitting brilliant white flashes alternating from what I would describe the top half and bottom half of the object.  It appeared as though the two halves were rotating independently.  I was not able to determine shape. I looked away for about 10 seconds to adjust the binoculars and I lost sight of the object.   My son watched it as it moved abruptly to the west an undetermined distance and it was now, from my position, lower towards the horizon.  The object moved west until it was out of visual range. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136140.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8165",
      "summary": "Light with a trail over Riverside.",
      "city": "riverside",
      "shape": "light",
      "date": "2018-03-02T00:00:00",
      "story": "Light with a trail over riverside The object in question was a blue light.  At first, I believed this to be a star, but when I noticed a trail behind it, I knew it was something else.  Especially at the height that it was, with two planes under it for reference,  I knew that it had to be much higher.   Another thing was that for the height that it was, it seemed to be flying pretty fast.  Almost seemed to be outpacing the passenger plane under it.   The point is, I saw this light, it had a trail behind it that crossed once, like a jet propelled aircraft, it was way too high and fast for it to be a regular passenger plane, and I cant find any information about it on the internet.  I don't think it was a jet either. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138959.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8851",
      "summary": "Loud booms n weird tangle.",
      "city": "riverside",
      "shape": "triangle",
      "date": "2018-07-05T00:00:00",
      "story": "Loud booms n weird tangle There was a lot of air traffick but anyway fireworks started n the stars started being visible for Independence Day so I went to look at the sky cuz a baby is about to b born in my family tonight n I noticed a lot of bright lights which I thought to be planets n one in particular was the brightest n I noticed 2 not so bright stars connected to a triangle n looking to my left another triangle with 1 bright star n then tried to see if any connected to a star or anything to connect all 4 or 5 bright lights but it was weird the 1st really bright one never moved but the others seemed to be getting further apart so went to the front of house see if I could get a bigger view.  N the 1st triangle literally went from perfect 3 triangle to a long /l triangle.  So go back to back yard n I notice yes there is fireworks going on around but there is booms n sounds like boom and hitting something n no sizzle or pretty fireworks in one certain area of the sky.  Like I could still see sky n stars but I could see weird flashes of light in the sky  like it was reflecting behind an invisible object.   N then all of a sudden one of the lights broke away from the 1st really bright light n blanketed the sky slowly within 5 min I couldn't see mountains in background or any of the stars  except  straight up in the sky.  N I suddenly got a whiff of I dunno gun powder fireworks but smooth n less harsh n only for a second.  I noticed the 1st bright light had another light replaced n a triangle again.   I got my binoculars n zoom in the bright light had 3 lights n it was like the triangle was tilted facing toward where the booms were booming from.  I went inside after about 30-45 min n don't know what happen after the.",
      "link": "http://www.nuforc.org/webreports/142/S142078.html",
      "state": "CA",
      "duration": "30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c921a",
      "summary": "Lots of lights in formation one behind each other",
      "city": "riverside",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "Lots of lights in formation one behind each other Strange lights in formation about 20 lights in the sky flying behind each other. They disappeared after about 1 or 2 minutes",
      "link": "http://www.nuforc.org/webreports/150/S150653.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c95fb",
      "summary": "The object emitted light.",
      "city": "riverside",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "The object emitted light.",
      "link": "http://www.nuforc.org/webreports/151/S151361.html",
      "state": "CA",
      "duration": "15 minutes"
    }
  ]
}