{
  "city": "rochester",
  "fetch_timestamp": "2025-07-12T14:36:38.664444",
  "record_count": 160,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4562",
      "summary": "1 satelight and  3 unknown white and red objects that followed in the opposite direction flying silent in the sky-",
      "city": "rochester",
      "shape": "circle",
      "date": "2006-05-15T00:00:00",
      "story": "1 satelight and  3 unknown white and red objects that followed in the opposite direction flying silent in the sky- I watched the same faint Satelight go flying through the sky from North to South until I couldn't see it anymore. Then suddenly I saw another object flying almost on the same path flying (south to North) but this object was bright and then very faint and then bright and and very faint continuing until it was out of range.  Then seconds after that object passed I saw another object in which had a very bright red light and it appeared out of the Northwest sky and slowly headed towards that object that just had passed at a different angle and it then blinked it's red light several times at another object headed in the opposite direction ( as if it was comunicating with the last object coming in from the east. The last object had a bright red light and it moved swiftly through the sky towards the third object until I couldn't see it anymore. I know the first object was a satelight, but I'm not sure about the other three objects. I have never seen lights of this nature and I'm 99.99999% sure that it was not a aircraft of our nature. Plus the objects were silent...",
      "link": "http://www.nuforc.org/webreports/050/S50212.html",
      "state": "MN",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4799",
      "summary": "extraterrestrial walking around city",
      "city": "rochester",
      "shape": "unknown",
      "date": "2019-07-25T00:00:00",
      "story": "extraterrestrial walking around city In the early morning hours round 3:30 am my two friends and I were joy riding around the city of Rochester trying to kill time.  We were driving a mini van.  MY one friend was driving and my other friend was riding shotgun and I was siting in the first row of seating on the driver side.  driving down chili avenue, headed towards the city near Walmart, we were the only car on the road.  We saw a man with an injured leg attempting to cross the road about 200 yards from us.  As we approached the man he stopped in the middle of the road, we slowed our speed to a crawl and as we drove by him we looked directly at each others faces.  He had two black eyes about three times the size of a human, two holes for a nose and a very small mouth.  He was wearing a beanie so I don't know about hair.  We sped off in fear.  I don't believe what we saw was human.",
      "link": "http://www.nuforc.org/webreports/147/S147681.html",
      "state": "NY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b4883",
      "summary": "Green dot falling very fast.  ((NUFORC Note:  Possible meteor??  PD))",
      "city": "rochester",
      "shape": "circle",
      "date": "2019-08-23T00:00:00",
      "story": "Green dot falling very fast. Green dot falling towards horizon at incredibly high speed. ((NUFORC Note:  Possible meteor??  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148340.html",
      "state": "NY",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b48d4",
      "summary": "Very large, silent fireball with no smoke trail.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2019-07-12T00:00:00",
      "story": "Very large, silent fireball with no smoke trail. Summer of 1974 or 75.  A very large, perfectly round, fireball with a long fire trail with no smoke or sound.  Headed east.  This completely lit up the sky.  I was at the top of a hill and able to see it disappear over the horizon.  It did not appear to be heading toward the ground.  It was so large it was shocking and will always be etched in my memory. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)",
      "link": "http://www.nuforc.org/webreports/147/S147419.html",
      "state": "NY",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5094",
      "summary": "Space crafts were flying in a straight line in the distance, disappearing above one by one. Several planes were seen flying toward it.",
      "city": "rochester",
      "shape": "formation",
      "date": "2019-12-22T00:00:00",
      "story": "Space crafts were flying in a straight line in the distance, disappearing above one by one. Several planes were seen flying toward it.",
      "link": "http://www.nuforc.org/webreports/151/S151847.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5093",
      "summary": "Space crafts were flying in a straight line in the distance, disappearing above one by one. ((Starlink satellites?))",
      "city": "rochester",
      "shape": "formation",
      "date": "2019-12-22T00:00:00",
      "story": "Space crafts were flying in a straight line in the distance, disappearing above one by one. Several planes were seen flying toward it.",
      "link": "http://www.nuforc.org/webreports/151/S151846.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6634",
      "summary": "I seen a caft over the dorms at RIT in rochester for about 10  mins hovering I think i saw another car pull over .my girl friend was wi",
      "city": "rochester",
      "shape": "cylinder",
      "date": "2007-02-01T00:00:00",
      "story": "I seen a caft over the dorms at RIT in rochester for about 10  mins hovering I think i saw another car pull over .my girl friend was with me.",
      "link": "http://www.nuforc.org/webreports/054/S54354.html",
      "state": "NY",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6717",
      "summary": "strip of lights seen above neighborhood",
      "city": "rochester",
      "shape": "rectangle",
      "date": "2007-06-12T00:00:00",
      "story": "strip of lights seen above neighborhood My brother and I were looking at the stars in my friend's backyard. I noticed a slow moving silent strip of lights(6 horizintal dim lights), about 300 to 400 feet above us moving west. It was in the sky for about 30 seconds before moving out of view. Two minutes after discussing what it may have been (birds, plane, blimp) the object reapeared from the original direction where we had seen it before and followed the same path. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56527.html",
      "state": "MN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6faf",
      "summary": "pure white bubbulous object with brilliant tiny red twinkling lights in a small area on the underside",
      "city": "rochester",
      "shape": "other",
      "date": "2007-04-27T00:00:00",
      "story": "I was looking south over south town plaza watching the jets making clouds way up by the cirrus when i noticed about a quarter mile out in front of me an object that was slowly moving away to the ssw .  What i saw was a pure white bubbulous object with brilliant tiny red twinkling lights in a small area on the underside. this was viewed through 10x42 binoculars. i need a witness. I jumped in my truck and drove 200ft to a garage handed the binoculars over and pointed it out as we proceeded to view it as it drifted up at about a thirty five degree angle. when i first looked at it i thought it was about fifteen, 10 foot weather balloons tied together with twelve volt blinking lights on it but then i relized it was moving off towards the ssw and the wind was blowing due east.there was also an airplane that passed close behind it from airport. i have been watching the skies since i was eight (1969) and i have never seen any thing until now.  ex air force f-15 tech  comm/nav ((NUFORC Note:  Source of report elects to remain anonymous; provides e-mail address only.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55985.html",
      "state": "NY",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b71c7",
      "summary": "My wife and I were driving from Brockport to our home in Rochester, NY in the evening when we spotted three bright discs hovering in th",
      "city": "rochester",
      "shape": "sphere",
      "date": "",
      "story": "My wife and I were driving from Brockport to our home in Rochester, NY, in the evening when we spotted three bright discs hovering in the night sky. They were bright white in color and moved in tandem from one area of the sky, at rapid speeds, across the night sky over to where the airport was located.  The next morning an article appeared in the Rochester newspaper detailing a man who claimed he had been chased by a flying object.   I was teaching at ((school name deleted)) (grade deleted)) in the Rochester public schools and the next day students in my class claimed that a craft similar to what we has seen came down and hovered around their playing field.  ((name deleted)) ((NUFORC Note:  Witness indicates that the date of the incident in 1965 is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55088.html",
      "state": "NY",
      "duration": "afew minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b72e9",
      "summary": "orange ball of fire hovering over  Rochester NY area, chased away by another multi-colored UFO.  ((NUFORC Note:  Venus??  PD))",
      "city": "rochester",
      "shape": "fireball",
      "date": "2007-11-28T00:00:00",
      "story": "((NUFORC Note:  Venus??  PD)) orange ball of fire hovering over  Rochester NY area, chased away by another multi-colored UFO The sighting occurred at approximately 3:30 a.m. in Brockport NY (15 miles west of Rochester NY). I was coming home—pulling in the driveway-- (I live on a 40-acre farm) and immediately noticed a very bright orange-haze glow in the eastern sky—when I first noticed the object it was hovering (barely moving) and it was glowing. I noticed it immediately because of the size of the fireball/light and because it was much lower in the sky than any other celestial objects. I watched closely because it APPEARED to be moving, and sure enough, it was moving. The sky was very clear and the stars were very bright and beautiful on this morning. I am a college professor, and I was 100 percent sober. I was so taken back by the object that I woke my sleeping mother out of bed so she could also witness the object with me. I’m 37 years old and am always very cognizant of my surroundings, and I have NEVER in my life seen anything like this. I watched the object for approximately 1.5 hours (until about 5:00 a.m.). The object would hover for about 5 minutes at a time (sometimes more) and then it would disappear by ascending at a tremendous amount of speed. It would then reappear in a few minutes and repeat the same pattern. You could witness a zigzag hovering pattern—it changed directions very abruptly and almost zigzagged while hovering but we also witnessed (what appeared to be) either rotation of the air craft OR lights that were spinning (like a giant search light)—we could see the light going back and forth. The object we watched was orange in color and very bright—like a ball of light. Towards the very end of the sighting, we saw another object that was very different in shape with multi-colored lights (including red). The object was completely different in shape---not round but more like the shape and light configuration of a traffic light looks like. It did not look like an airplane because the rate of speed at which this 2nd object was traveling was incredible. It almost appeared as if the 2nd object ! was look ing for—or chasing the 1st object. Eventually, the orange glow ball object disappeared (as if it was being chased away). I was facing east toward Rochester and the 1st object disappeared into the south-eastern sky. The multi-colored object moved in from the north-eastern sky and disappeared in the north-eastern sky. When I first got home, I observed the object from outdoors. I did not hear any noises associated with this object. It was not a helicopter and it was DEFINITELY NOT an airplane. As the object appeared to be getting closer, I ran indoors because I was scared! For the remaining time, my mother and I observed the object through the east-facing windows of our house.",
      "link": "http://www.nuforc.org/webreports/059/S59924.html",
      "state": "NY",
      "duration": "1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b775a",
      "summary": "Bright Blue, Metallic Object seen over NYS Thruway around Roch, NY....",
      "city": "rochester",
      "shape": "circle",
      "date": "2007-02-01T00:00:00",
      "story": "Bright Blue, Metallic Object seen over NYS Thruway around Roch, NY.... Driving down the New York State Thruway on a cold, brisk, winter's morning my co-worker riding with me on our way to work notices a round, bright blue, metallic object hovering.  Within five seconds of seeing this object the object quickly shot towards the sky and disappeared.  When we arrived to work another co-worker who normally rides with us to work, but was on her own on this day reported seeing the same object disappear into the sky.",
      "link": "http://www.nuforc.org/webreports/054/S54816.html",
      "state": "NY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7944",
      "summary": "Streaking bright UFO spotted by all of us around a campfire!  Moving at a crazy speed....  ((NUFORC Note:  ISS overflight.  PD))",
      "city": "rochester",
      "shape": "circle",
      "date": "2007-08-07T00:00:00",
      "story": "Streaking bright UFO spotted by all of us around a campfire!  Moving at a crazy speed.... We had friends over for a camp fire and my neighbor noticed a bright light moving way faster than any plane could move. This light....flying object was streaking across the sky not changing direction or speed, it was way to high to be a plane!! And it was to fast to be a satellite. My neighbor who pointed the object out to us, use to be an ex-pilot and know aircrafts and speeds. This was a UFO without a doubt!! And made us all believe. ((NUFORC Note:  Overflight of International Space Station.  PD)) 03 Aug -0.2 22:57:04 10 W  22:59:40 28 NNW 23:01:04 19 NNE  04 Aug -2.0 21:44:19 10 WSW 21:47:12 66 NNW 21:50:06 10 NE   04 Aug 0.6 23:20:34 10 WNW 23:22:43 18 NNW 23:23:33 16 N http://www.heavens-above.com/passsummary.asp?lat=43.155&lng=-77.616&alt=155&loc=Rochester&TZ=EST&satid=25544&Date=39294.6666666667&Mag=",
      "link": "http://www.nuforc.org/webreports/058/S58000.html",
      "state": "NY",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b3a",
      "summary": "long row of lights with red light under, hovered, flew to west, dropped down below tree level, popped back up and flew faster than a nm",
      "city": "rochester",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "long row of lights with red light under, hovered, flew to west, dropped down below tree level, popped back up and flew faster than a nm as my girlfriend and i (both 50+yrs) were driving home at 10:10 PM we saw a very bright light low in the sky, we turned on to the last road home and saw the light again as we were behind trees and farm houses for a mile or so. the light hadnt moved, it was stationary. then as we got closer the object was about the size of a quarter held at arms length, it started to move to the right slowly at first then very quickly until we couldnt see it, it had disappeared behind a line of trees which make up a huge woods. we continued driving for another mile and all of a sudden the light went straight up and started coming back towards us quickly. i pulled over and got out of the car to look at it. as it went by about 2 miles away i could see a long row of lights and one tiny red lid underneath.  it was VERY COLD (0 degrees) and WINDY but i managed to get a couple poor quality pics. it then slowly veered away from us and i drove as fast as i could to follow it. i could not keep up so i pulled over and got out of the car one more time and then heard a very loud roar which turned out to be a jet of some sort that flew righ over my car fairly low. it had all the running lights i would expect that blink. the object we saw had no blinking lights. the jet followed the same direction as the object but much higher and to the left of it. they both continued flying away from us until out of sight. i called the local airport, they were not interested but gave me the FAA number which i called and that lady was not too interested either. i offed to send the photos but she said dont bother and have a nice day.",
      "link": "http://www.nuforc.org/webreports/055/S55056.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7dad",
      "summary": "Blue oval Light shoots threw sky",
      "city": "rochester",
      "shape": "oval",
      "date": "2006-12-14T00:00:00",
      "story": "Blue oval Light shoots threw sky Driving home from work and looking at the road ahead when a blue ball of light with a green haze around it shot over the tree top and out of my sight looked like a oval object no sound that i could hear and moved incredibly fast looked also like a glowing fire work that was about to go off but didnt",
      "link": "http://www.nuforc.org/webreports/053/S53934.html",
      "state": "NH",
      "duration": "4 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b7fe8",
      "summary": "Orange objects in sky",
      "city": "rochester",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Orange objects in sky When I was pulling into my driveway I noted a bright orange/red shape of light in the SE direction of the sky moving in a NW direction which was moving slower than an aircraft on descent.  I got out of the vehicle and immediately got my family members out to watch this phenomenon with me.  When we got outside again, we looked over to the South and noted another one of these light orbs in the sky along with the previous.  They were now moving in a direction towards the west.  My guess of altitude would be below 1,000 feet.  The light was constant, non fluctuating, and almost looked like a source of light on the bottom of the object radiating upwards to the top.  There was no noise associated with it, and the movement was steady.  No trails were noted.  The first object moved to the west of the sky, and turned direction upwards, and slowly faded away, the second object then followed to the same area and disappeared slowly.  I then looked back at the origin poi! nt and noted a third light of the same exact description follow the same path and again disappear. We live in the approach path of the International airport, so I have been seeing and dealing with planes in the sky for all of my life, however this was not a plane and there were no identifier strobes seen.  This was not a flare either, as it had a more orange hue than a flare.  There were no sounds of fireworks in the area as well.  When I attempted to look through the binoculars, the objects were fuzzy and could not be focused on. I stayed outside for a duration of ten more minutes after this event, and nothing else was seen. The path of these objects must have been a mile to three miles in length.",
      "link": "http://www.nuforc.org/webreports/072/S72096.html",
      "state": "NY",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b85d8",
      "summary": "Christmas Eve object with bright spotlight near Rt. 441 in Wayne County near Rochester, New York like a helicopter with no sound",
      "city": "rochester",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "Christmas Eve object with bright spotlight near Rt. 441 in Wayne County near Rochester, New York like a helicopter with no sound It was Christmas Eve and I (41) was telling my daughter (13) to get ready for bed at 10PM in a small town about 20 miles east of Rochester, NY in Wayne county.  We were in the worst part of a windstorm with SW winds sustained at 34MPH (54KPH) and gusts to 62MPH (99KPH).  As she was finishing up brushing her teeth I took a look outside to see the trees swaying in the high winds and saw an aircraft in an unusual position in the sky. Living outside Rochester, which has an international airport, it is not unusual to see planes, mostly incoming, approach from the east, headed west along New York state route 441 which later becomes Elmwood Avenue and leads a nearly straight line to the Rochester airport.  On this night, however, the aircraft I saw was at least a mile north of route 441 and had a spotlight similar to those I saw on police helicopters when I lived in Los Angeles.  It also had blue and red lights, but the spotlight was most noticeable. I opened the door to get a better look. My daughter, a firm believer that UFO’s are not real, saw what I was looking at and her exact words were “Is that a UFO?”  I told her it looked like a helicopter.  However, within a minute it was nearly overhead and we couldn’t hear it.  Its’ speed was much slower than most planes, and the spotlight (which was pointed toward the ground, but slightly to the right of its’ flight path) was very bright.  The speed and the spotlight seemed to suggest that it was a helicopter, except there was no sound. The object continued past our house where it seemed to pick up the path of route 441-west, towards the Rochester airport.  My daughter captured some video on her cell phone but it was captured through a closed window and appears to be a speck of light in a dark sky when viewed.  The flight path, the red, white and blue lights and the speed all seem to point towards a helicopter, or maybe even a small plane flying into a 40- to 70-knot headwind. But why would a helicopter be using such a bright spotlight? There were no police chases here that night.  And, its’ speed was faster than any possible police chase on these curvy, hilly roads.  It traveled at least 5 miles in about 2 minutes. And it was at a height of several thousand feet, too high for the spotlight to illuminate the ground.  It was cloudy and windy, but no fog or rain or snow to explain the use of the bright spotlight.  I also considered the possibility that an aircraft had landing gear trouble. To both of us, this seemed like it might have been a UFO and it might have been a helicopter with a bright spotlight.  It is possible that the wind was howling so loudly that it drowned out the helicopter sounds.  This sighting was unique enough to get my un-believing daughter to think it might be a UFO.  I’ve seen much stranger objects, back when I lived in the Hudson Valley region of New York State; objects the size of football fields that moved unlike any aircraft, and this sighting does not come close in comparison.  The object we saw, though, is still unexplained as far as we are concerned.  We are also aware of the obvious implication of seeing something unidentified flying across the sky on Christmas Eve night, but for now we’ll just call it a UFO. At the time of the sighting, we were at 43.15 degrees North, 77.34 degrees West looking East initially, then South, and lastly Southwest as we lost sight of it.",
      "link": "http://www.nuforc.org/webreports/068/S68477.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b889a",
      "summary": "12 to 15 points of light in formation of 2 triangle shapes, 2 loose ones on the left  very fast heading north",
      "city": "rochester",
      "shape": "formation",
      "date": "2008-10-31T00:00:00",
      "story": "12 to 15 points of light in formation of 2 triangle shapes, 2 loose ones on the left  very fast heading north August 26, 2008 UFO possibly sighted at 21:15 hours over Rochester New York. A double formation of 5 to 7, with a couple on outside of the 2 diamond shaped formations. Very high like star points of light, traveling north my vantagepoint put them traveling past the big Dipper. Only visible for about 5 seconds before lost in the horizon. To high for birds, to fast for jets. Question has this formation been seen by any others this day 26 of Aug. 08?",
      "link": "http://www.nuforc.org/webreports/065/S65413.html",
      "state": "NY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b92c3",
      "summary": "triangular shape with lights, several other much smaller craft darting erratically in area",
      "city": "rochester",
      "shape": "triangle",
      "date": "2010-04-13T00:00:00",
      "story": "triangular shape with lights, several other much smaller craft darting erratically in area There was 1 large triangular ship with 2 rectangular amber lights on the flat end and 1 light on the point.  It appeared to hoover while a group of 5 small craft darted back and forth moving erratically in a small area.   At the same time in another part of the sky we observed 2 more small craft moving erratically away from the area.  The large ship disappeared within 4-5 minutes, with the smaller crafts remaining for approximately 5 more minutes.  My husband and I both observed these, and when we went to work that night, we started to tell a co worker, and he stopped us, and described the same observance and time frame as we did.  He lives about 30 miles from us.",
      "link": "http://www.nuforc.org/webreports/074/S74588.html",
      "state": "WA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b93c2",
      "summary": "Bright light over Lake Ontario blazing through the early morning sky.",
      "city": "rochester",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Bright light over Lake Ontario blazing through the early morning sky. This morning I woke up and went outside to have a cigarette. While standing on the back deck of the house I noticed what first appeared to be a bright star in the north western part of the sky, maybe fifteen degrees from the horizon.  This places it over Lake Ontario. The light was a white-yellow, slightly larger than the visible stars at the time.  It moved at a constant, blazing speed, from northwest to south.  It appeared too far out in space to be a satellite and traveled too fast.  The object did not burn up or gravitate towards earth, but continued in a straight line through space.  In about forty-five seconds it had covered the entire horizon and faded away.   I've never seen a satellite behave in such a fashion and if anyone else noticed this event, I'd love to hear your thoughts.",
      "link": "http://www.nuforc.org/webreports/073/S73274.html",
      "state": "NY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b93c5",
      "summary": "Bright light seen traveling slowly west to east over Rochester; no sound or aircraft lights seen. ((NUFORC Note:  Sighting of ISS. PD))",
      "city": "rochester",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Bright light seen traveling slowly west to east over Rochester NY; no sound or aircraft lights seen. Spotted a bright light moving very slowly west to east over Rochester NY approximately 1830 - 1900 Hours 11.13.09. My step son and I were just getting home from the park. At first we thought it was a planet or star then we observed it moving ever so slowly. We watched it for about five minutes until it blinked out. No word on the web about what it may have been or who else may have seen it. I am a Navy Vet with experience in re to military aircraft.  This was no typical aircraft. ((NUFORC Note:  ISS visible in northern sky at 18:04 to 18:08 hrs.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73289.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b94e3",
      "summary": "Bluish bright ball of light soars over low clouds over neighborhood east to west, lit up sky, saw between cloud breaking.",
      "city": "rochester",
      "shape": "sphere",
      "date": "2010-05-12T00:00:00",
      "story": "Bluish bright ball of light soars over low clouds over neighborhood east to west, lit up sky, saw between cloud breaking. I am a 26 year old female.  I was outside having a cigarette break watching the storm in my backyard. I love storms - the thunder, rain, lightning.  I just stare at the sky watching for lightning.  Nothing seemed out of the ordinary until I noticed the sky started to get brighter and bluer.   Just as I was thinking \"huh, that's weird,\" a blue ball of light soared over the clouds low over my backyard, from east to west.  I didn't know it was a ball of light until it went over a part of the sky where the clouds broke up.  Right after, there was lightning.  I tried to think it was just part of the lightning, but the object in question didn't flash, just glowing and passed over swiftly.  It didn't make any noise.  It had an aura about it, and emanated light all around it, but you could tell the shape was spherical.  I just sat there with my jaw dropped.  I kept trying to rationalize what it was.  I entertained the thought it was a meteor about to hit the earth, and sat there waiting for the ground to shake.  Nothing happened, though.  I stayed outside for 15-20 minutes waiting for something to happen as if to explain it.  I have no idea what it was that I saw.  I only know that it was an unidentified flying object.",
      "link": "http://www.nuforc.org/webreports/075/S75040.html",
      "state": "MN",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9643",
      "summary": "We were stargazing and we saw a v-formation of brownish orange lights. These lights were traveling NNW. While watching this formation o",
      "city": "rochester",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "We were stargazing and we saw a v-formation of brownish orange lights.  These lights were traveling NNW.  While watching this formation of lights, a v-formation (8) came out of the orignal group and started traveling more west, then regrouped a short time later.  The group was difficult to see because of the color of the lights.  If you weren't watching closely you could miss them.  We heard no engine sounds during this time.",
      "link": "http://www.nuforc.org/webreports/074/S74704.html",
      "state": "IN",
      "duration": "3-5 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b9971",
      "summary": "red white and blue lights forming a triangle",
      "city": "rochester",
      "shape": "triangle",
      "date": "2010-06-23T00:00:00",
      "story": "red white and blue lights forming a triangle three, blue white and red star like shapes forming triangles hovered up and flew over our car heading west then stopped and hovered in the air staying still, then came back east stopped and then headed west again ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75849.html",
      "state": "NY",
      "duration": "20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b9be5",
      "summary": "\"Flying Saucer\" surrounded by 8 planes",
      "city": "rochester",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "\"Flying Saucer\" surrounded by 8 planes   On Jan. 21, 2010, I was in the parking lot at my local community centre.  At about 6:05 p.m I’m looking up at the sky.  What I see in the sky is an extremely bright orb with 8+ airplanes surrounding it, and flying at it.  As each airplane approached this object, it faded into a haze.  Before I went swimming I experienced a terrible headache and fatigue.  That night I experienced missing time, and I was temporarily paralyzed in bed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74213.html",
      "state": "NY",
      "duration": "40+ min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9bc6",
      "summary": "solid red chevron-shaped ufo formation sighting in Rochester, Minnesota 2004",
      "city": "rochester",
      "shape": "chevron",
      "date": "2008-07-05T00:00:00",
      "story": "solid red chevron-shaped ufo formation sighting in Rochester, Minnesota 2004 I saw 7 or 10 solid red chevron-shaped crafts flying in a \"v\" formation. They looked very small, so maybe they were extremely high up. They must have been moving very fast, because they appeared to fly from horizon to horizon in a northwest direction (as though they spanned  the distance from LaCrosse, Wisconsin to Minneapolis, Minnesota) in about 45 seconds.",
      "link": "http://www.nuforc.org/webreports/064/S64170.html",
      "state": "MN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e2e",
      "summary": "Appeared to be a plane, but had three bright lights and hovered.",
      "city": "rochester",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "Appeared to be a plane, but had three bright lights and hovered. Lights that at first appeared to be a plane, but hovered for an hour. It was seen north of the city of rochester, MN. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75577.html",
      "state": "MN",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e6c",
      "summary": "Two bright orange balls of light that moved quickly around each other, then suspended, then slowly, one by one, disappeared from view",
      "city": "rochester",
      "shape": "fireball",
      "date": "2009-04-14T00:00:00",
      "story": "Two bright orange balls of light that moved quickly around each other, then suspended, then slowly, one by one, disappeared from view My friend and I were driving east on Monroe Avenue in the town of Brighton, in Rochester, NY, on March 15, 2009. We were going home from a friend’s house after watching a show together. The time was approximately 12:30 AM. Almost immediately, I saw two bright orange balls of light in the sky, diagonally north of where we were driving. I yelled for her to pull over. We quickly parked in a parking lot facing the objects, in front of the Towpath Hotel. We jumped out of the car, and at that time, a man in another car pulled into the hotel and parked. We did not get his name, but the three of us watched this phenomenon together. These two objects moved at a very fast rate, independently, in all different directions, around each other, then they suddenly stopped and seemed suspended, parallel to each other. They were large and appeared to be at about the height that a plane would fly when descending. My friend took a picture on her cell phone. After a couple of minutes, the ball on the right very slowly seemed to recede and disappear. After it was completely out of sight, the ball on the left slowly receded, on a parallel path to that of the first one, until it disappeared. The three of us talked about it briefly, with all of us agreeing that they could not have been lights or aircraft that we’ve seen before. My friend and I felt thrilled to have witnessed such an event, as we have never had this happen to us before. We both have our masters degrees; I am a fifth grade teacher and my friend is a computer programmer. Last night, we bought the book, The Phoenix Lights, and agreed that what we saw looked exactly like the orbs on the cover. We are curious if there were other reports from our area or other locations on that day.",
      "link": "http://www.nuforc.org/webreports/069/S69318.html",
      "state": "NY",
      "duration": "4 min."
    },
    {
      "_id": "64d005f478aba2ec5a3ba9b3",
      "summary": "i believe what my family saw was a ufo",
      "city": "rochester",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "i believe what my family saw was a ufo my wife, son and myself were home i was cooking on the grill witch is right outside slider doors,i go and out of house waiting for food to cook,went out to get food off grill and saw two round shaped lights following eachother very slow just over the tops of tree line,i told my wife to get my banoculars when i looked through them i knew it was nothing i had ever seen before,i passed to wife to look and she did not know what it was.  I then passed to my 11 year old son and he starts saying to his mother and me its a ufo,we watched them stay in perfect form for about 2 minutes and they were gone i even had a officer come to my home because i reported what we saw.",
      "link": "http://www.nuforc.org/webreports/078/S78003.html",
      "state": "NH",
      "duration": "2:00"
    },
    {
      "_id": "64d005f478aba2ec5a3baa68",
      "summary": "Orange circular light , it hovered for a time before moving away at a high rate of speed",
      "city": "rochester",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "Orange circular light , it hovered for a time before moving away at a high rate of speed I saw a bright orange light in the sky.  It moved right to left.  Hovered for a few seconds.  After which it moved at a high rate of speed out of sight.",
      "link": "http://www.nuforc.org/webreports/077/S77651.html",
      "state": "NY",
      "duration": "45 SEC"
    },
    {
      "_id": "64d005f478aba2ec5a3baaa1",
      "summary": "2 round balls of light hovering over Rochester NY",
      "city": "rochester",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "2 round balls of light hovering over Rochester NY Two High glowing object hovering in eastern skys over the city,   One moved away from object and diapered, objects were not making any blinking but just glowing,   i caleld the news 10 nbc and they just laughed at me and said they will wait for more info.",
      "link": "http://www.nuforc.org/webreports/077/S77749.html",
      "state": "NY",
      "duration": "1hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bab0d",
      "summary": "Semi-egg shaped object floating above local highway 20-25 feet in the air.",
      "city": "rochester",
      "shape": "egg",
      "date": "2010-11-21T00:00:00",
      "story": "Semi-egg shaped object floating above local highway 20-25 feet in the air. I was driving on one of our highways, 390 south, when from far away I could see something ahead in the sky.  It looked like a helicopter possibly but was kind of small.  As I got closer, there were birds flying around but the object was stationary in the sky.  Even closer I could see that the object was indeed not moving and was just hovering 20-25 feet above the center lane of the highway, about 1 mile north of the Lehigh Station Road exit.  I drove right under the object, and kept trying to stare at it until it was above my windshield and I could not see it anymore.  It was metallic and may have even shined in the sun light.  Its shape was almost like a rounded jacks piece, or one of those hand-held massagers that has the three prongs at the bottom.  I immediately called my friends to explain what I just saw and that I would not have called if it was not something I thought was important.  I later contacted various news stations in the area, and they confi! rmed with me on September 21, 2010 that at least one other had seen a shape similar on September 20, 2010, and that two city police officers had also seen the object.  over the weekend in an adjacent county (about 30 minutes west) witnesses claimed that there was an object hovering over the highway and cars were actually pulling over because they thought it was a plane trying to land on the highway for an emergency.",
      "link": "http://www.nuforc.org/webreports/077/S77933.html",
      "state": "NY",
      "duration": "2min"
    },
    {
      "_id": "64d005f478aba2ec5a3bac4d",
      "summary": "Orange light seen hovering and moving over Rochester",
      "city": "rochester",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Orange light seen hovering and moving over Rochester On the night of 13 October 2010 I was on my overnight watch for the fire department in my local town. I stepped outside in the early morning for a smoke break and to look at the sky since it was so clear out.  I walked around the firehouse to check and make sure everything was locked up and nothing was out of the ordinary.  As I turned the South West corner of the building I noticed a bright light approximately 10 miles away directly west of the firehouse. I watched this light for approximately 15 minutes trying to figure out what it belonged to. I was figuring a helicopter until I compared the object with a stationary object close to me.  That is when I noticed the object was moving from left to right approximately 2-3 miles at a time in less than a minute.  The object continued doing this with-out ever dimming, so I was able to dismiss the bright light as being a landing light on the front of an aircraft. Since the landing light would dim as the aircraft turned away from me if it was circling something. After 45 minutes of watching this light moving left to right and occasionally up and down I noticed the light seem to be moving away from me, West.  With-in 3 minutes the light had moved a great distance away from the original spot where I had first witnessed the object.   I heard no noise associated with the light but I’m not sure if this is due to the distance from me. The light was bright with an orange glow.",
      "link": "http://www.nuforc.org/webreports/078/S78331.html",
      "state": "NY",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bacde",
      "summary": "Very bright circle that suddenly disappeared",
      "city": "rochester",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "Very bright circle that suddenly disappeared I was driving home at about 10:45 and I saw a bright object in the sky.  I looked up at it and it was massive, probably about half as big as a half-moon.  It was very white, almost blinding. Its shape was like the sun, with a circle and light radiating from the circle.  It didn’t flash like an airplane or helicopter.  The object moved very slightly down and to the right, and then it completely disappeared.  I couldn’t hear the object at all as well.",
      "link": "http://www.nuforc.org/webreports/078/S78432.html",
      "state": "MN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3d2",
      "summary": "it just stayed in one spot, i watched one the entire drive from the moment i saw it.  ((NUFORC Note:  Star or planet?  PD))",
      "city": "rochester",
      "shape": "light",
      "date": "2011-02-23T00:00:00",
      "story": "it just stayed in one spot, i watched one the entire drive from the moment i saw it on the express way, in plain view. the town of Webster is very suburban with few lights and has an open bay so it is a great view into the sky. and also a quiet area.  this light was dense as they usually are when i see them.  pulsating and changing color. if it even did move, it moved very slow and at different times of staying still. then it disappeared (turned lights off)  then appeared again. did this for about 10 minutes...as 2 others were doing the same thing but lower and flying around the general area this was in. one was low enough to see partial shape in a busy plaza with lights in it. this is the first of MANY MANY MANY sightings/encounters. i will be sure to report now that i know where to do so. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80191.html",
      "state": "NY",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb49d",
      "summary": "a shiny saucer or egg shaped object in the sky at Walmart store",
      "city": "rochester",
      "shape": "egg",
      "date": "2011-02-18T00:00:00",
      "story": "a shiny saucer or egg shaped object in the sky at Walmart store I was waiting for a bus at a bus stop at Walmart South store at 25 25th St SE. the sky is clear and sun is up and shining. I was just looking at sky and there is nothing in the sky. sudden, I saw a bright star appeared in the sky, at first I thought it was a star, but I saw it moving down and I looked at it very hard.  I see that it was a metal-like object and the sun is reflecting on it. It was shaped like a saucer or egg. it just faded into the sky and disappeared after like 30 seconds. There is a airport 9 miles from the location I am at.  I know it was not a airplane.  here is a map where I was at and saw a UFO in the sky. http://maps.google.com/maps?f=q&source=s_q&hl=en&geocode=&q=25+25th+Street+Southeast,+Rochester,+MN&aq=&sll=43.949822,-92.439651&sspn=0.183156,0.308647&ie=UTF8&hq=&hnear=25+25th+St+SE,+Rochester,+Olmsted,+Minnesota+55904&ll=43.98437,-92.455788&spn=0.011441,0.01929&t=h&z=16",
      "link": "http://www.nuforc.org/webreports/080/S80009.html",
      "state": "MN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5e1",
      "summary": "Contact me or Scott/Sandy/MOOSE from morning show on WPXY fm 97.9",
      "city": "rochester",
      "shape": "unknown",
      "date": "2011-02-08T00:00:00",
      "story": "Contact me or Scott/Sandy/MOOSE from morning show on WPXY fm 97.9 I heard on WPXY of many people calling in and reporting it now.  Visible from Webster ny and Chili NY among others.  Happening now! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We did not contact WPXY.  Possible hoax?  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79913.html",
      "state": "NY",
      "duration": "pending!"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5e5",
      "summary": "Black triangle in Rochester, Michigan",
      "city": "rochester",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Black triangle in Rochester, Michigan This is a text dump from the MUFON report I filed. I will also add more detail at the bottom. Driving northbound on Rochester road at Hamlin (see attached map), I saw about a mile ahead of me two VERY bright, yellow-white lights close together.  The lights were very different from the street lights, car lights, and building lights in the area.  All those lights looked washed out compared to the floating lights.  The floating lights were also significantly brighter and larger in diameter. At first I thought they were landing lights from a plane flying really low.  As I approached I realized the lights were stationary and then thought it must be lights on the end of a high pole - perhaps they're having a carnival in the parking lot of the mall again.   As I came to a stop in the left-hand turn lane at Rochester and Avon, It was about 20 or 30 yards away (west and slightly north) and about 4 stories up... and still not moving.  I keep thinking to myself, \"I can't be the only one seeing this\". The thing that stood out most was how I had traveled a mile with this thing in full view and it never appeared to move at all.  No wavering, nothing, even when I was right next to it. It was just hanging there steady in the same spot. At this point, I could make out a third light, and the three lights formed a triangle, but I could not see anything between the lights at all.  I pulled out my iphone and shot 3 pictures, but only 2 came out (not very well, either.  I have an iphone 3g so it's not HD). After about 10 seconds it started to move south.  It didn't accelerate, it just started moving at a slow, constant rate.  As it moved over the parking lot to my left (west), I could CLEARLY see its shape since the ground lights were illuminating it from below.  It was a triangle with equal lengths on all sides and appeared to have no markings at all; just a flat, \"grayish\" surface with lights on the each end.  I could not tell how thick it was.  As it moved, the lights faded to nothing over the span of about 6 seconds and then I couldn't see it at all even though it was fairly close. FYI, it was raining slightly and there was a slight \"haze\" in the air. This may be unrelated, but when I crossed the road two miles back  I saw four police cars with lights and sirens blaring as they drove through the intersection of Rochester and Auburn roads.  Two continued west and two turned south. Additional notes:  The lights on the craft barely show up on the photo although, to my eye, they were really bright, glowing balls of a diameter larger than the parking lot lights.  Strange that they barely show. Also, the lights were constant the whole time: no flickering, pulsing, etc. until they shut off one-by-one. I can't emphasize enough the strangeness of how this thing was just \"parked\" in mid air.  It was just hanging there completely still. Friends have been asking whether it made any noise.  I didn't hear anything but since it is a busy intersection I'm not surprised.  Although, you'd think if it was a jet that I would have heard a loud, high pitched noise, but I didn't. Also, the three lights were not underneath the object but appeared to be on the sides.  I couldn't tell how tall it was because the lights didn't reflect off the black surface. In retrospect, that's pretty strange too.  And I don't remember seeing the lights reflect off anything in the environment, but I probably didn't notice because I was watching this thing so closely.",
      "link": "http://www.nuforc.org/webreports/078/S78964.html",
      "state": "MI",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb604",
      "summary": "Black line over moon moves, then vanishes.",
      "city": "rochester",
      "shape": "unknown",
      "date": "2011-01-31T00:00:00",
      "story": "Black line over moon moves, then vanishes. I was leaving work at about 9:35 on January 22, 2011 and was passing Wal-Mart South in Rochester, when I happened to look up at the moon, and noticed that the moon looked cut in half.  I closed my eyes a few time to make sure my sight wasn’t going bad, but it was still there.  A solid, thick black line right over the middle of the almost full moon, with a light on it.   I drove a little ways, and when passing a field, I looked again, and the line had lowered to the bottom 2/3 of the moon.  I drove a little more, and when I looked again, the line had vanished.  There were no power lines in the area, nor overhead lines of any sort.",
      "link": "http://www.nuforc.org/webreports/079/S79807.html",
      "state": "MN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb84e",
      "summary": "We saw 20 to 30 fireballs floating or gliding higher and then slowly flickering out.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2010-08-30T00:00:00",
      "story": "We saw 20 to 30 fireballs floating or gliding higher and then slowly flickering out. My husband and my sister and I just came back from playing miniature golf and were driving along the road. My sister saw what she thought were red stars and asked what they were.  My husband and I both said they were just towers, as we were near the airport.  But then they started to move and get closer and we knew they were not towers. Every few seconds more would float up until there were about 20 to 30 in the sky. We pulled over into a nearby plaza to get a better look and try to get some pictures.  Several other people had pulled in to look at them too.  One guy yelled out his window to us \"what ARE those?\"   We answered that we had no idea. The objects were completely silent. They left no trails.  They looked like orangish-reddish fire, they flickered, but it was clear that it was not aircraft lights (like red/white of planes).  Also they didn't appear to flash uniformily like a light bulb would.  It looked more like the flickering of fire. After a while the lights started to flicker out.  But my husband then pointed to where one of them was and we saw that we could still see something moving against the sky, it was just completely darkened.   At that point there was a commercial jet in the sky and they were moving about twice the speed of the jet. But before, while they were lit up, they were moving much slower. All three of us are college educated, upper middle class.  My sister is 25. I am 29, and my husband is 34. ((NUFORC Note:  We assume an evening sighting, and have amended the time above, to reflect that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77516.html",
      "state": "NY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb897",
      "summary": "Fireball in the Sky",
      "city": "rochester",
      "shape": "fireball",
      "date": "2010-07-28T00:00:00",
      "story": "Fireball in the Sky It was approximately 10:00 pm eastern time.  My wife and I decided to take a night walk, with our kids (10 and 2), into town. As we walked south, through a parking lot, we (my wife, daughter, and myself) noticed a fireball way up in the south sky.  It was heading in an eastwardly direction at about the speed of a jet liner at around 30,000 feet.   At first we thought it was an airplane out of Detroit Metro Airport, but it started to get brighter and then dim again. The longer we watched it the more we realized it was not an airplane.  It was too much like a fireball. It didn’t leave any kind of streak or trail.  It was almost like something was burning up while entering the atmosphere.   I tried to take a picture, or video, with my iPhone but it was not visible on the screen when I tried. We assumed it would be on the news when we got home, or on the internet (news) the next day, but we found no stories about it.",
      "link": "http://www.nuforc.org/webreports/076/S76657.html",
      "state": "MI",
      "duration": "15 to 45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb996",
      "summary": "Bright, fast moving blue light in Eastern sky.",
      "city": "rochester",
      "shape": "light",
      "date": "2010-07-19T00:00:00",
      "story": "Bright, fast moving blue light in Eastern sky. My wife and I were driving East at approximately 9:50 to 9:55pm on the evening of July 14th, 2010.  At this time a bright, blue toned light caught our eyes, in the Eastern sky moving from North to South.  The object was about 10-15 degrees above the eastern horizon.   The object was moving very fast, much faster than a conventional craft and traversed the eastern horizon in about 20 to 30 seconds max.  It was a solid bright light, no blinking lights, no trail, seemed to move a bit erratically on path.  I thought at first it could be the ISS, or another prominent satellite but I checked fly overs, times, and directions of fly overs and none of them added up to our sighting.  The only visble fly over at that time and date for my area would be the Genesis II, which would have been to our backs, not ahead of us in the Eastern sky.",
      "link": "http://www.nuforc.org/webreports/076/S76648.html",
      "state": "NY",
      "duration": "20 - 30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbdd2",
      "summary": "Lighted object in orbital motion changed color, stopped, moved erratically at varying speeds, on a non-orbital path.",
      "city": "rochester",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Lighted object in orbital motion changed color, stopped, moved erratically at varying speeds, on a non-orbital path. 08/28/2011   @ 2145 CT  Observed a lighted object moving W to E at zenith position. Thought this was perhaps the ISS as we had followed sightings in the last couple of weeks. The object was white, and brightened from zenith to 10 degrees declination, then began to dim, and appear to diminish in size by roughly ½, and went from white to red in color.  At this point the object stopped tracking to the east and held stationary for approximately 5-8 seconds, then began to move in a northerly direction at a slow speed, paused, moved north again, moving faster and stopped again. The object moved back after that in an east to west direction at varying speeds, pausing at times, sometimes making abrupt sweeping curves and coming to sudden stops, then beginning to move in slow, small movements for short distances, pausing and moving again. It did not move like any plane or helicopter I have ever seen. No sound was observed related to this object. The light from the object was red, steady, and seemed to dim in relation to traveling a greater distance from my position of observation.  The duration of the sighting was approximately 3 minutes.",
      "link": "http://www.nuforc.org/webreports/083/S83526.html",
      "state": "MN",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe67",
      "summary": "Two objects seen one at close range in November of 1980",
      "city": "rochester",
      "shape": "oval",
      "date": "2012-01-12T00:00:00",
      "story": "Two objects seen one at close range in November of 1980 In 1980 I was an unemployed construction worker living in north central Indiana. I lived in a rural area with my closest neighbors being a mile away.  The road I lived on was a dirt road not very often traveled by others. It was a warm night in November (for Indiana) and there was no wind at all. It was a new moon so it was a great night to go fox hunting so I got my shotgun and red head lamp and started to the field.  I had to cross two triangle shaped fields, one was approximately 500 yards by a quarter mile the 2nd field was approximately 300 yards by a quarter mile. As I stepped into the first field I looked up and saw two red lights about 100 feet apart.  I knew there were two radio towers in that direction so I did not give it any thought.  It was about midnight and very dark so I did not look up again until I entered the next field.   When I did look up the lights had changed directions.  The lights had made a right turn and now were crossing in front of me heading south at a very slow speed.  The craft was over the fence row that separated the 2nd & 3rd fields.  The field I was entering was 300 yards across and the craft was about 200 feet up. When I saw the craft it scared the hell out of me.  I got behind a big tree and turned my light off. It was a still night and the craft made no sound at all.  It was 80-100 feet across and shaped oblong with two red lights on the outer edges.  I saw no windows or any other lights I watched from behind the tree for 15 minutes or more, the craft seemed to stop once and then moved on.  When it got to the long end of the field it turned right and slowly moved off out of sight. I stood there for a while trying to decide what I should do go hunting or go home.  I was 24 and needed the money so I went hunting.  I went into the third field and set up in the middle on top of a hill.  As I sat there not able to take my eyes off the sky I saw another craft a mile or so away.  It was also going very slow and was zig zaging between the houses.  I watched this one for an hour and a half by that time it was close to 2 AM.   I decided to give up on fox hunting and go home for the night. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86042.html",
      "state": "IN",
      "duration": "2 Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bbeea",
      "summary": "8-18 red/orange lights seemingly rising from the distant tree line above I-490 westbound after chili center exit south/southwest of my",
      "city": "rochester",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "8-18 red/orange lights seemingly rising from the distant tree line above I-490 westbound after chili center exit south/southwest of my location.  They would rise slowly in random formation, moving delicately and dimly flickering.  It seemed to reach altitude of 15-20,000 ft.  Hard to judge.  Comparatively larger than the surrounding stars. They would rise and disappear only to be followed by more. Several people informed me they saw the same objects behaving differently. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83696.html",
      "state": "NY",
      "duration": "20:16-21:30"
    },
    {
      "_id": "64d005f478aba2ec5a3bc028",
      "summary": "Rochester NY lights in the sky two sightings",
      "city": "rochester",
      "shape": "flash",
      "date": "2011-12-12T00:00:00",
      "story": "Rochester NY lights in the sky two sightings In the last week I have seen something twice.  The latest at about 05:30 this morning.  While outside having a cup of coffee and looking at the sky,  A light flashed on and a second later shut off.  It was not the red or green from an aircraft, but white light like a star.  Neither time did it appear again.  Had it been partly cloudy I would have figured cloud movement had done it, but both times the sky was clear.  The first time was east at about 45 degrees, and this morning was, North West, at maybe 60 degrees. The blink was probably as bright as Venus.  I'm not sure what other info is important. ((e-address deleted))",
      "link": "http://www.nuforc.org/webreports/085/S85173.html",
      "state": "NY",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfe9",
      "summary": "Sunday – December 18, 2011 at 5:30 PM A UFO was observed for aprox. 45 minutes in SouthWest Rochester around the Meadow Lakes Golf Cour",
      "city": "rochester",
      "shape": "triangle",
      "date": "2012-01-12T00:00:00",
      "story": "Sunday, December 18, 2011 at 5:30 PM A UFO was observed for aprox. 45 minutes in SouthWest Rochester around the Meadow Lakes Golf Course. The craft hung in the sky without moving for a good 30 minutes. I followed the craft to the West for the next 15 minutes, when it sped up and headed for Hayfield.  This craft had a set of perimeter lights and two large red lights or lasers around the back of it. I would guess it to be aprox. 100 to 200 feet or more in width. It would also tip up a few degrees at times on one side (dip) All the lights would go off and on at times.  Airplanes came by from the Airport but nothing was reported in the local news. It was also observed by my wife and another car that stopped.",
      "link": "http://www.nuforc.org/webreports/085/S85977.html",
      "state": "MN",
      "duration": "45 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7d8",
      "summary": "Large bright green fireball sails from south to east (left to right) over Thruway trailing bright green sparks and disappears.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2011-12-17T00:00:00",
      "story": "I was traveling west on NY Thruway 10 miles west of 490 exit east of Rochester.  A large bright green fireball sails from south to east (left to right) over Thruway, trailing bright green sparks and disappears.  Lasted about three seconds.",
      "link": "http://www.nuforc.org/webreports/085/S85852.html",
      "state": "NY",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7f6",
      "summary": "Noticed an orb floating in the sky. It seemed to be reflecting the sunlight. After 45 seconds it started changing shape and just vanish",
      "city": "rochester",
      "shape": "changing",
      "date": "2011-08-07T00:00:00",
      "story": "Noticed an orb floating in the sky.  It seemed to be reflecting the sunlight.   After 45 seconds it started changing shape and just vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82636.html",
      "state": "NY",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc22",
      "summary": "Orange Balls Swiftly Gliding Through The Sky In Rochester, N.Y.",
      "city": "rochester",
      "shape": "circle",
      "date": "2011-07-06T00:00:00",
      "story": "Orange Balls Swiftly Gliding Through The Sky In Rochester, N.Y. Date is 07/04/2011,  time is between 10:45-11PM, and the exact place is in Irondequoit, NY.   I was with family and friends and we just got done watching the fireworks and decided to sit down outside in the backyard and chat.   I seen one orange object floating in the sky traveling quite fast coming from the West and traveling to the East.  I didn't think anything of it and thought that it was something to do with the fireworks or even possibly a plane.  A few minutes later, I seen 3 more orange balls traveling the same speed, they were lined up one after thee other, a bit of a distance apart and were also traveling to the East.   I was with 5 other people at this time and got there attention and to our amazement we seen a plane fly through the sky at the same exact time and then we knew for sure that this was no plane.  My brother said they could have been Chinese lanterns, but seeing how fast these orange balls were going, each following the same direction and path, and moving at various speeds...we counted the Chinese lantern idea out.  The objects were orange in color, round in shape, looked like balls of fire gliding through the sky.   After seeing about 3 more sets of the orange balls follow the same path within a few minutes in between each set, we decided one person would Google it and 2 other people got out telescopes.  My brother was assembling the telescope and the balls continued on and then as soon as he had the scope ready to go they all of a sudden stopped.  I would say that we seen around 10 of these fireballs in total.  If anyone has any ideas what they could be or similar stories please get back to me. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82217.html",
      "state": "NY",
      "duration": "20-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd7f",
      "summary": "Fireball in Rochester ny",
      "city": "rochester",
      "shape": "fireball",
      "date": "2011-06-12T00:00:00",
      "story": "Fireball in Rochester ny We were driving on highway 390 north in Rochester, NY, near the vinage lane exit when we saw what looked like a triangular fireball in the sky to our left.  At first we thought it was an airplane that had caught on fire, but the object was not moving whatsoever.   We stopped the car and were trying o figure out what it was, maybe a weather balloon or hot air balloon but it was not moving. The fireball finally moved straight across the sky to the left but very slowly and then it stopped.  It then floated straight over to the right and stopped.  It would stop for about a minute or two before it'd move again.  The object literally looked like a triangular bonfire in the sky.   It came towards us then fell back.  It hovered for another few minutes before it finally slowly ascended up and at a much faster pace went at about a seventy degree angle back upon the sky where it eventually looked like a red or orange moving star and then disappeared.",
      "link": "http://www.nuforc.org/webreports/081/S81657.html",
      "state": "NY",
      "duration": "Ten minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcdbd",
      "summary": "three large triangle shaped aircraft",
      "city": "rochester",
      "shape": "triangle",
      "date": "2011-05-29T00:00:00",
      "story": "I went out to smoke and saw three large triangle shaped aircraft with yellow lights. they ran silent they were visible for about 5 minutes",
      "link": "http://www.nuforc.org/webreports/081/S81329.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcf43",
      "summary": "Came from tower with flashing lights on st marys property towards 11th ave sw",
      "city": "rochester",
      "shape": "other",
      "date": "2012-08-05T00:00:00",
      "story": "came from tower with flashing lights on st marys property towards 11th ave sw By 11th ave sw and 1st sw ..me an  a friend were sitting outside smoking an i seen a light out of the corner of my eye i looked up an seen a large flying object almost hovering..  i said to my friend look what the ..... is that?  as i pointed it was a if i could be heard an one by one the bright white lights started to shut off!?  an eventually went black! now there was not a cloud in the sky as we could see alot of stars?   NEVER HAVE I SEEN THIS BEFORE.I dont think it was a mayo one or a plane because almost always i can hear sound echo?  pleaase did anyone else see this?? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90844.html",
      "state": "MN",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1c2",
      "summary": "3 witness a  bright star like light at first  hover, and then transform into a multi-lighted object which went out of view.",
      "city": "rochester",
      "shape": "changing",
      "date": "2012-09-24T00:00:00",
      "story": "3 witness a  bright star like light at first  hover, and then transform into a multi-lighted object which went out of view. Located in the historic neighborhood of Corn Hill, 3 of us went out on the upper porch for a cigarette last night. It was about 9:30 when we went out and we enjoyed the cigarette and layed out to a nice view of the night sky.  After about ten min.  I noticed, a VERY bright, what appeared to be a star overhead and commented that the star must be a planet or something.  I was so impressed by this apparent star, that I decided to take a picture with my cellphone.  For some reason the phones touchscreen wouldn't react.  At that point my two friends, jumped up and commented that it started to move!  The light now seemd to be an object, which emitted two lesser lights of amber and yellow. Silently went in the southeast direction out of view.  Tbe three of us, were in amazement.  This was the first sighting for two of us, and the third person commented that this wasn't his first sighting.",
      "link": "http://www.nuforc.org/webreports/092/S92109.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd21d",
      "summary": "Bright orange sphere, moved upwards, stopped for about 5-10 sec, then slowly, moved south, stopped & faded away.  3x within 60 minutes",
      "city": "rochester",
      "shape": "sphere",
      "date": "2012-09-24T00:00:00",
      "story": "Bright orange sphere, moved upwards, stopped for about 5-10 sec, then slowly, moved south, stopped & faded away.  3x within 60 minutes Bright orange circle, or sphere, appeared to be slowly rising over the tree line in the western sky.  It moved directly upwards, stopped in one spot for about 5-10 seconds, then slowly,steadily moved south for approximately 10 seconds, stopped, and slowly faded away (took about 5 seconds to fade away - looked like it was getting smaller).  This occurred 3 times in the same location in the sky over a period of an hour.  Each time it looked similar and was in the same spot in the sky each time.  We had been using the &quot;Sky View Explore the Universe&quot; app on the iPhone each time we aimed the phone toward the orange sphere it didn't show up on the app.",
      "link": "http://www.nuforc.org/webreports/092/S92123.html",
      "state": "NY",
      "duration": "3 times, for ~30 seconds "
    },
    {
      "_id": "64d005f478aba2ec5a3bd269",
      "summary": "Bright, flashing green object moving quickly across the sky",
      "city": "rochester",
      "shape": "circle",
      "date": "2012-08-05T00:00:00",
      "story": "Bright, flashing green object moving quickly across the sky On July 4th, a group of us were out on a boat on Lake Ontario watching fireworks along the shore. Suddenly, we all noticed a green flashing circle.  It seemed to hover for a moment, and then began moving quickly.  None of us are sure if it appeared or we just did not notice it coming. It had a very bright green glow and seemed to flicker.  It was above 70 degrees above us and was the size of about 10 stars.  We were facing south when we saw it, and it traveled east.  To make sure it was not just a stray firework, we watched it travel and saw it go extremely far off into the distance.",
      "link": "http://www.nuforc.org/webreports/090/S90412.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd390",
      "summary": "Real bright star like object moving north to southeast silently low in the night sky.",
      "city": "rochester",
      "shape": "light",
      "date": "2012-09-24T00:00:00",
      "story": "Real bright star like object moving north to southeast silently low in the night sky. We were driving next to a hill w/ the radio and tv tower antennas on it to the left, when I noticed to the right of me a real bright star like object moving horizontally fairly low in the sky from North to Southeast it stopped mid air once and continued on!  There was two of us watching it and there was absolutely no noise or sound at all! We watched it move across the sky for at least 5 mins till it disapeared behind the trees and was too low to see anymore! Boy I wish I had a camera to record it!!! =)",
      "link": "http://www.nuforc.org/webreports/092/S92332.html",
      "state": "NY",
      "duration": "5+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd393",
      "summary": "Transported to a beautiful world with benevolent beings.",
      "city": "rochester",
      "shape": "unknown",
      "date": "2012-05-13T00:00:00",
      "story": "Transported to a beautiful world with benevolent beings   My experiences are always an extremely vivid dream, and I have had multiple follow up dreams as well.  Every fiber of my being tells me that my experiences were real.  I am not a ufo enthusiast by any means, and have always believed abduction stories, for the most part, are the result of an overactive imagination or mental/physical disorders.  Here is my story:  The first time I had the experience, I never experienced the actual abduction or saw any kind of spacecraft.  All of the sudden, myself and maybe four other humans were in some kind of adminstration building with windows all around, with a huge table in the middle of this stainless steel like atrium.  We were all terrified, and scattered to find a hiding place;  we had no idea how we got there, or who anyone else was.  We never saw the alien beings either!  Me and another human male hid in a closet.  There were no words spoken the entire time, not sure why.  All of the sudden, I wasn't afraid anymore, and ventured out into the atrium once again.  I walked to the big table in the center of the room, and some kind of a being or presence was showing me, telepathically, the secret to faster than light travel and their alphabet.  I was amazed, no longer afraid, just...awed!  Afterwards, I was lead, telepathically, outside of the atrium to their world.  It was beautiful beyond my ! imagination:  two suns; one brilliant blue sun on the horizon and another red sun on the other horizon.  The world around me had a desert coloring to it, but there were strange plants in the distance.  I was telepathically told that my time was up.  It is at this time that I woke up in my own bed, feeling like I had been blessed by god.  I was able to draw some of their alphabet, but had no idea what it meant.  I was also able to recreate the diagram for faster than light travel.  This experience has stuck with me throughout the years.  The second time I had this experience, I suddenly found myself looking at the beautiful horizon with the two beautiful suns.  I wasn't afraid at all, but so humbled and excited that I was back!  Once again, I never saw the alien(s), but was able to understand, and realize that there were several beings near me, that meant no harm.  It is like someone was speaking over a radio directly into my brain.  Once again, I am unable to speak with my voice, but these beings must have been able to read my thoughts and emotions, because I got a tour of this facility.  As I am walking through the atrium, I notice the ceilings are over 30 feet high, the walls curved and there were no straight lines.  It was all a stainless steel looking structure.  Very interesting!  I walked past glass window, where I saw hundreds of human bodies suspended in some kind of clear solution with one tube going into their abdomen.  The tube had a florescent liquid flowing into each human's stomach.  I was hor! rified.  The being told me, telepathically, not to worry.  These were just generic shells that they had created through genetic replication many years ago.  The human shells that they had were devoid of any soul or spirit that made us human, and had no awareness whatsoever.  The alien then told me not to be afraid once again, they have no intentions of harming any human being, only a fascination and a need to experiment.  The only time they deal with real live humans is in a controlled and friendly environment with no intent to harm or frighten.  All of the sudden, in my mind's eye, I saw a small town just like any here on earth.  There were humans, happily living out their lives in a place that was created by these beings.  Almost like a scientific zoo, but the humans were blissfully unaware of their situation.  These were genetic reproductions of actual humans from earth that they created to learn everything about the human race.  Once again, the being reiterated that not a single human was harmed, and that these humans were farmed there strictly for research, and were able to live their lives to entirety without any intervention from these beings; these brings were merely there to observe, not interfere.  Once again, I was suddenly outside of their facilities, gazing on the horizon, admiring their two beautiful suns.  I awoke, once again, in my own bed, with that same feeling of awe and being blessed with what I was able to experience.  I was astonished to have what seemed like a \"follow up\" visit, like these beings are making sure to take it slow, not to overwhelm, not to frighten, just to make contact with real earthly beings and share some of their culture.  I believe that the biggest thing these beings were trying to show me is that they are real, they have been making contact with humans for thousands of years, and were proud of their experiments.  Kind of like a \"hey, we are here, and there is no reason to fear us, let us show you!\"  I have not had another experience since the second one, which occurred in 2010.  Nothing even close.  I am not afraid that it will happen again, and I hope I do experience it again.  To me, it is almost like seeing the benevolent face of god.  These are truly good and beautiful beings that are reaching out.  It has been a life changing experience, for the better.  I hope that my story helps others and that others have been able to visit these beings.",
      "link": "http://www.nuforc.org/webreports/088/S88649.html",
      "state": "NY",
      "duration": "Unsure"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4a2",
      "summary": "Amber/orange balls 1 following the other changeing direction at unbeliveabley fast speeds",
      "city": "rochester",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "amber/orange balls 1 following the other changeing direction at unbeliveabley fast speeds We were looking out over the lake and saw a glowing amber/orange ball not like a flare but a distinct round ball.  It come from the west and abruptly shot north at a great speed.  A few seconds later it was followed by a second ball traveling at the same speed and flight pattern as the first.  The sky was clear and the sun had not yet set.  The time was approximate. We decided to report this now because we have seen the exact objects on several different TV programs.",
      "link": "http://www.nuforc.org/webreports/088/S88049.html",
      "state": "NY",
      "duration": "1min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4e9",
      "summary": "They looked like orange stars, moving incredibly fast at high altitude, then went straight up.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "They looked like orange stars, moving incredibly fast at high altitude, then went straight up. It was 7:45 est, in Rochester, Pa.  We saw 7 orbs/fireballs brighter than anything in the sky, there were 2 lead objects and 5 trailing.  They were moving from southwest to northeast.  We watched them go across the sky, then hit a patch of clouds and appear to go straight up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93287.html",
      "state": "PA",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5db",
      "summary": "Fleet of red UFO's emerging from Mt. Rainier.",
      "city": "rochester",
      "shape": "light",
      "date": "2012-11-19T00:00:00",
      "story": "Fleet of red UFO's emerging from Mt. Rainier There was about 20 or more red lights that flew right over my neighborhood, making no sound. It looked to me like they were emerging from Mt. Ranier.  Then they all turned north, and started moving towards Seattle.  One by one, the blinked out.  After all the red lights blinked out, there was a craft with two amber lights and a flashing red light in the middle moving in the same direction as the red fleet was headed.  I started filming, and the batteries went dead.  When I replaced the batteries, I captured a portion of the event, and a few pictures.  My mom, my two children, several of my neighbors, and myself, witnessed the event.",
      "link": "http://www.nuforc.org/webreports/094/S94335.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb36",
      "summary": "White teardrop light came out of nowhere and disappeared right over LAKE AVE.",
      "city": "rochester",
      "shape": "teardrop",
      "date": "2012-10-30T00:00:00",
      "story": "White teardrop light came out of nowhere and disappeared right over LAKE AVE. I was driving North on Lake Avenue (before Stone road) and a white, teardrop light appeared from the East side and curved downward. It got brighter and bigger as it moved then disappeared right above where a traffic light would hang. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93635.html",
      "state": "NY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdbc3",
      "summary": "Triangle craft with white lights, low to ground",
      "city": "rochester",
      "shape": "triangle",
      "date": "2012-08-05T00:00:00",
      "story": "Triangle craft with white lights, low to ground While I was driving I saw a very bright white light. At first I thought it could be the moon peering through the trees but as I continued to drive I saw that it was a moving craft.  Very bright, flashing blue and white.  Was very low to ground and moved slow.  Very low humming sound.  I live near the airport and this was nothing like I've Ever seen before.",
      "link": "http://www.nuforc.org/webreports/091/S91026.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bde45",
      "summary": "2 sets of 3 orange orbs traveling nw",
      "city": "rochester",
      "shape": "circle",
      "date": "2012-07-04T00:00:00",
      "story": "2 sets of 3 orange orbs traveling nw  2 sets of orange orbs heading northwest.   Appeared to be low and flying in formation",
      "link": "http://www.nuforc.org/webreports/090/S90014.html",
      "state": "",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be114",
      "summary": "A series of 7 flaming type objects crossing the night sky from South to North lasting 15 minutes.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2012-11-19T00:00:00",
      "story": "A series of 7 flaming type objects crossing the night sky from South to North lasting 15 minutes. (Late 50s married couple walking dog after dinner) A reddish flaming object moving toward us in the night sky, appearing/feeling like a hot air balloon, but moving horizontally too fast. Might have been something above the flame, wavering. Seemed to be rising as it moved from South/SouthWest to North/NorthEast passing by us slightly to the West.  It faded into the distance, perhaps two minutes from coming into view until it disappeared to the North. Several minutes later as we approached other pedestrians(3 young men) we asked if they had seen it. &quot;No.&quot;  Pointing up to where it had come from, we saw another on roughly the same path.  They all saw it.  In the next 5-10 minutes we all saw a pair traveling fairly close together, with one passing the other, and then three more individual &quot;flames&quot; on the same route. There was an aircraft passing roughly perpendicularly further South and much higher.",
      "link": "http://www.nuforc.org/webreports/094/S94571.html",
      "state": "NH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be44b",
      "summary": "Strange orange lights in sky over Rochester, NH",
      "city": "rochester",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Strange orange lights in sky over Rochester NH My fiance had gone outside to smoke a cigarette and came back in quickly telling me to come outside \"right now!\".  We both observed two orange lights moving across the sky from approximately West to East, keeping a perfect distance from each other.  As these entered a cloud bank three more of these lights came over the horizon.  Then a group of five came over the horizon in the exact shape and size of the big dipper.  These lights just kept coming and I did manage to take a video on my camera though the quality is not great.  The last object we say was hovering in the sky, un-moving for about ten seconds. In all honesty, at times we were not sure if some of the lights were separate or part of one large object...",
      "link": "http://www.nuforc.org/webreports/087/S87154.html",
      "state": "NH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be50e",
      "summary": "BRIGHT ORANGE LIGHTS IN SKY IN SE ROCHESTER MN",
      "city": "rochester",
      "shape": "oval",
      "date": "2012-06-14T00:00:00",
      "story": "BRIGHT ORANGE LIGHTS IN SKY IN SE ROCHESTER MN SAW A BRIGHT ORANGE LIGHT MOVING IN THE SKY HOVERING THEN TAKING OFF STRAIGHT UP IN THE AIR VERY FAST.  THEN RETURNED IN 10 MIN LATER AND MOVING IN  A BACK AND FORTH MOTION. THIS WAS IN SE ROCHESTER.",
      "link": "http://www.nuforc.org/webreports/089/S89455.html",
      "state": "MN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be594",
      "summary": "A star like object moves across the sky at super speed.",
      "city": "rochester",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "A star like object moves across the sky at super speed. I was out side in my backyard at around 11pm with my friends. It was a beautiful night.  You could see thousands of stars outside.  But as we starred a the sky we saw a red light the didnt move and was just blinking like some of the stars.  But unusual because it was pritty big.  But i didnt move for about 20 min so we thought it was just a star.  We went on with our business. 20min later when i look up in the sky that blinking light was moving right across the sky.  It wasnt a plaine cause we didnt here any jet sounds plus it was moving too fast to be any plane, and moved soo quickly and smooth to be a plane.  We were trying to not blink cause we thought it would disappear.  It looked to us that it was a star instead of a light going about 3,000 miles.  But as we lookk the light starts to fade.  Like litterly fades as we are starring at it.  It took about 5 seconds to disappear.  I wana telll everyone this after i saw that i was no longer a E.T critic.  I know what i saw, and i know that there is something up there and they have/are visiting us.",
      "link": "http://www.nuforc.org/webreports/091/S91462.html",
      "state": "MN",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3be75c",
      "summary": "Weird formation of multiple lights no sound",
      "city": "rochester",
      "shape": "changing",
      "date": "2012-06-14T00:00:00",
      "story": "Wierd formation of multiple lights no sound Thought I seen airplane with various flashy lights, then it stopped as it formed in to a v.  Then formed into one light.   As it hovered, I got binoculars to look closer it was a disc with white out line, but center light multiple colors real fast red,white, blue.as watching two more disc fly by object and do a big circle around the sky, cannot see second and third object with naked eye, ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89540.html",
      "state": "MN",
      "duration": "Hour and half"
    },
    {
      "_id": "64d005f478aba2ec5a3be81b",
      "summary": "3 red lights formed into a triangle formation, moving toward each other, then fading.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2012-03-13T00:00:00",
      "story": "3 red lights formed into a triangle formation, moving toward each other, then fading. There were 3 red lights that formed into a triangle.  They were moving toward each other and eventually started to disappear one by one.  We were in downtown Rochester as the sun was almost done setting.",
      "link": "http://www.nuforc.org/webreports/087/S87357.html",
      "state": "MN",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bedbd",
      "summary": "Silent craft moving across the sky",
      "city": "rochester",
      "shape": "sphere",
      "date": "2013-05-15T00:00:00",
      "story": "Silent craft moving across the sky I was walking outside at night when I looked up in the sky and saw 2 object, one directly in front of the other, going across the sky. I could not tell the shape of the object, it looked like a star. I know it wasn't a star because you could tell that it was lower than the stars. At first I thought it could be 2 satellites, one in front of the other. Except I have seen satellites and that isn't what this was. It actually could have been one craft with one light in the front and one in the rear. I saw it move across the sky, away from me, for about 20 seconds before it just disappeared.  It didn't appear to just shoot off into space. I just moved across the sky and disappeared.  If this was 2 objects, they were moving in formation at the same speed.  This wasn't a know aircraft, it was completely silent. From my point of view the object looked like this: .    .   Could this have been 2 satellites moving across the sky in formation? Sure. Only I've seen satellites before and satellites always appear smaller, and stay in the sky a lot longer.  Plus I've never seen 2 move across the sky in a formation like this. Let alone seem to appear and disappear so quickly ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97351.html",
      "state": "WA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf014",
      "summary": "Silent craft moving across the sky.",
      "city": "rochester",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Silent craft moving across the sky I was walking outside at night when I looked up in the sky and saw 2 object, one directly in front of the other, going across the sky.  I could not tell the shape of the object, it looked like a star. I know it wasn't a star because you could tell that it was lower than the stars. At first I thought it could be 2 satellites, one in front of the other.  Except I have seen satellites and that isn't what this was. It actually could have been one craft with one light in the front and one in the rear.  I saw it move across the sky, away from me, for about 20 seconds before it just disappeared.  It didn't appear to just shoot off into space.  I just moved across the sky and disappeared. If this was 2 objects, they were moving in formation at the same speed.  This wasn't a know aircraft, it was completely silent. From my point of view the object looked like this:   . .   Could this have been 2 satellites moving across the sky in formation?  Sure.  Only I've seen satellites!  before and satellites always appear smaller, and stay in the sky a lot longer.  Plus I've never seen 2 move across the sky in a formation like this. Let alone seem to appear and disappear so quickly   (Previously reported. I gave the wrong date, i said 2012. This happend 2013)",
      "link": "http://www.nuforc.org/webreports/098/S98609.html",
      "state": "WA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf076",
      "summary": "Orange orbs near Lake Ontario.",
      "city": "rochester",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Orange orbs near Lake Ontario My sister and I witnessed 2 sets of orange lights traveling eastward about 1/10th of a mile from Lake Ontario.   First 2 sailed directly overhead.  Bigger than stars but silent so impossible to tell how large.  Then after they disappeared, 2 more came from the same direction and went the same way. I watched one carefully and before it disappeared it sped up and got smaller at the same time, also angled upward slightly and then it was gone.  My sister got the 2nd 2 on video.  I noticed there was also a couple of planes in the sky, farther off.",
      "link": "http://www.nuforc.org/webreports/098/S98416.html",
      "state": "NY",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf143",
      "summary": "Glowing orange triangle object flew across the sky at a high rate of speed.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "Glowing orange triangle object flew across the sky at a high rate of speed. While outside, looked up to see a triangle shaped object silently flying across the sky at a high rate of speed.  Object continued to head from south to north before leaving sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96905.html",
      "state": "MN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf36b",
      "summary": "Singular light seen low in evening sky near Rochester, WA.  ((NUFORC Note:  Venus??  PD))",
      "city": "rochester",
      "shape": "circle",
      "date": "2013-09-30T00:00:00",
      "story": "Singular light seen low in evening sky near Rochester, wa. At twilight at 7:42 to 8:02 on 09/17/2013 I viewed a single white circular light in the southwestern sky, hovering, about 30 degrees of angle.  3 miles west of Rochester, Wa. 98579  There were no engine sounds. Upon zooming in, you see through the white light, to what looks like a spinning, Chinese lantern. When zooming further, now orange over all, with circulating red/yellow/green illumination around the outer circle. Enough detail was viewed revealing a wheel-like structure, radiating spokes into the rounded center. At this time I drove southwest to the town of Rochester, approximately 2 miles from original sighting area. I noticed I was physically closer and appeared so in my viewfinder. I took video of this at this time. Object slowly moved high in the southwestern sky (now dark) and was stationary at a 50 degree angle. There it remained. Taking note of it's position, I drove home. Approximately two hours later, I observed object high in sky, appearing to be the same object seen earlier, evidenced in my viewfinder. ((NUFORC Note:  Venus??  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102095.html",
      "state": "WA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf374",
      "summary": "Viewed on different evenings, overhead, and on the western horizon,originally thought it was a star or airplane headlight.",
      "city": "rochester",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Viewed on different evenings, overhead, and on the western horizon,originally thought it was a star or airplane headlight. On the nights between 8/8 to 8/15 at approximately 9:15 pm., I witnessed a white illuminated craft accompanied by a smaller orange colored spherical craft.   In the evenings following, I saw the same white lighted craft hovering in the western horizon.  This time I used my camera to sight in and took several pictures on the zoom setting which didn't allow for clarity, but still allowed detail.  It revealed a spherical dome shaped craft,apparently self illuminating.  It had a rounded center making it appear to be like a wheel of a car,hubcap in the center.   These objects displayed no usual marker lights, or engine sounds. In the week of these sightings I witnessed approximately 6 sightings, and all appeared to be the same vehicle.   I would like for you to see these pictures,so I left my # on your message phone.",
      "link": "http://www.nuforc.org/webreports/101/S101252.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3df",
      "summary": "Red Light with white yellow ora in sky near lake Ontario, Greece, Ny",
      "city": "rochester",
      "shape": "formation",
      "date": "2013-07-03T00:00:00",
      "story": "Red Light with white yellow ora in sky near lake Ontario, Greece Ny I was driving down Mt. Read Blvd. Rochester Ny to stone rd.  As I was driving I saw a red light in the sky surrounded by a white/yellowish ora, it seemed to be on the east side of me driving south.  And seemed ti be following  my driving path. I turned left at the light on stone rd.  And I still saw to the left of me.  I arrived at my friends house and as he was walking down the driveway to meet me I tol d him to look to the sky.  He reported the light was moving without stopping and stoped suddenly with no movement.  He stared for about 30 seconds and he said it faded outward towards space and dissapeared.  We both looked to the sky and nothing was there.  I am not joking and I feel like it followed.me and knew we were seeing it.",
      "link": "http://www.nuforc.org/webreports/098/S98508.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf483",
      "summary": "Flashes of light during meteor shower",
      "city": "rochester",
      "shape": "flash",
      "date": "2013-08-30T00:00:00",
      "story": "Flashes of light during meteor shower While hoping to catch the last night of the meteor shower, I began to see strange flashes in the sky. I have seem something similar to this a few years ago.  This time I only saw 3 flashes,  though the last time I saw something like this the flashes continued for iver 30 min.  The first 2 flashes appeard to be stationary, the 3rd flash came from just to the right if the previous 2.  I am willing to consider that these flashes were an optical illusion, and that I was just witnessing meteors coming directly at me, which is why I was unable to see a tail.  However, these flashes were very similar to the event I had witnessed in the past.  I also want to add that I didnt see these flashes out if the corner of my eye, I was looking directly at them.",
      "link": "http://www.nuforc.org/webreports/101/S101180.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf86c",
      "summary": "I witnessed a circular craft hovering low in the southern sky,just before dark.",
      "city": "rochester",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "I witnessed a circular craft hovering low in the southern sky,just before dark. I witnessed a circular craft hovering low in the southwestern sky from 8:56-9:14pm. I used my camera to capture several pictures, as well as video of the object.  It omitted a bright light, not from any headlight source.  This is my sixth sighting of what I believe is the same object, over a ten day period.  All occurring just before dark.  No engine noises or marker lights can be detected.  I viewed this object until it faded out of sight as it proceeded south. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101364.html",
      "state": "WA",
      "duration": "18 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8a6",
      "summary": "Stationary obj. with multicolored strobes observed approximately 45 deg. above horizon.  ((NUFORC Note:  Sighting of Arcturus?  PD))",
      "city": "rochester",
      "shape": "unknown",
      "date": "2013-09-30T00:00:00",
      "story": "Stationary object with multicolored strobes observed approximately 45 degrees above horizon. Object seen 45 degrees above horizon, stationary with multicolored strobes - no sound. What peaked my interest was a red laser type light flashing on and off every 2 seconds or so... followed by green, white, and yellow lights. Object appeared to be brighter than most natural night light sources. I am a trained military observer having been associated with the US Navy and Air Force for several years. Last known location was in the vicinity of Rochester, NY.  Observation was from South town Plaza Parking lot. ((ADDENDUM FROM WITNESS)) 30+ = Minutes. I know the difference between a star and an unidentified object... this was no star.   As for the other sightings man is way to arrogant to think we are alone in the entire universe.  God is way more inventive than to just create life on one solitary planet. ((END OF ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/102/S102563.html",
      "state": "NY",
      "duration": "30+"
    },
    {
      "_id": "64d005f478aba2ec5a3bf909",
      "summary": "Observed object hovering at low altitude, spinning,and changing colors. in S.W. evening sky.",
      "city": "rochester",
      "shape": "circle",
      "date": "2013-08-30T00:00:00",
      "story": "Observed object hovering at low altitude, spinning,and changing colors. in S.W. evening sky. I viewed this light low in the S.W sky.  Approx. @9:02pm. The circular light appeared to spin and produce yellow,blue green light.  Only one light was viewed. I was able to drive close to its location in Oakville,Wa. 8 miles away to obtain a closer view.  The object hovered in the air at approximately 1000 ft.altitude.  And also moved slowly toward the western horizon until too far away to see detail.",
      "link": "http://www.nuforc.org/webreports/101/S101387.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bffc3",
      "summary": "Orange-Red Lights Over Rochester, NH.",
      "city": "rochester",
      "shape": "light",
      "date": "2013-09-09T00:00:00",
      "story": "Orange-Red Lights Over Rochester, NH. A low flying orange-red round light moved without sound across the sky, then vanished.  It was followed by another.  The sky was cloudy,it had to have been low to see it at all.  No stars or moon visible.",
      "link": "http://www.nuforc.org/webreports/102/S102006.html",
      "state": "NH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c00cb",
      "summary": "Five bright orange lights (cross shape upon closer inspection) hovering over Rochester, MN.",
      "city": "rochester",
      "shape": "cross",
      "date": "2013-02-04T00:00:00",
      "story": "Five bright orange lights (cross shape upon closer inspection) hovering over Rochester, MN I was driving on Villa Rd. in NW Rochseter,MN when I saw about 5 strange bright orange lights in the sky in a line going upwards.  Slowly, as I was driving, they started to disappear from top to bottom, but there were two remaining when I got to my house. and one when I went to my backyard to see it better.  It appeared to be in the shape of a cross up and down with a bright orange color.  I watched it move slowly and it appeared to have a little wake behind it and then it disappeared.",
      "link": "http://www.nuforc.org/webreports/095/S95819.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c01da",
      "summary": "Shape changing craft.",
      "city": "rochester",
      "shape": "changing",
      "date": "2013-04-12T00:00:00",
      "story": "Shape changing craft I was standing at the top of the hill (the hill overlooks a four-way stop), and noticed a very, very slow moving plane (so i thought) coming from the right, what caught my attention was how close the object was to the trees and rooftops of the homes on my street.  Also it as completely dark, no lights on the craft,and it didnt make any noise.  I watched the object as it was still slowly moving forward towards the four-way stop. When the object reached the intersection, it was now completely visible.  It was grey, looked like a plane, size of a plane.  The object stoppped right in the middle of the intersection, so now i am at eye level with the object  The object then changed its shape, and turned into a star, it glowed a bright red, orange and maybe yellow, then the object changed its shape again to a really small round craft, and took off into the sky so fast headed toward stars.  I followed the object with my eyes,in secounds it was gone dissapeared in the stars, there was a line of smoke in the sky and within secounds that was gone too!  Back in 92-94 I was a pre-teen I did run home and tell my mother, whom absolutly believed me.   Over the years I moved out of state, and my brothers (we have 10+ years in age difference) still report seeing ufo's all the time over my mothers house!  We think the air space must be something worth investigating. ((NUFORC Note:  Date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96927.html",
      "state": "NY",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3c0641",
      "summary": "Four of us saw 4 fire colored lights flow acctossed the sky, and have video and still pic.",
      "city": "rochester",
      "shape": "light",
      "date": "2013-02-18T00:00:00",
      "story": "Four of us saw 4 fire colored lights flow acctossed the sky, and have video and still pic. I and 3 others saw 4 fire colored flow east to west for five minutes. We have a short video from a phone, and a good still photo, also from the same phone.  They look like many of the lights seen on this site and youtube.  They flowed in formation like an arrow, then a diangle line then dissapeared one at a time. No noise was heard. No tail like a meteor.  Not anything any of us ever seen before.  There were four of us, but six other people who were in the parking lot also saw these lights.",
      "link": "http://www.nuforc.org/webreports/096/S96353.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c08d1",
      "summary": "Bright light speeding across the sky in a straight line faster than anything I have ever seen before.",
      "city": "rochester",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "Bright light speeding across the sky in a straight line faster than anything I have ever seen before. I was driving south bound on Dewey Avenue near the parkway almost coming up to the intersection of Dewey Ave and Latta Rd.  It was myself, my fiancee and my 11 year old son in the car.   We were all having a conversation when out of no where to our left which would be to our east there was a light that literally appeared out of no where it shot across the sky faster than anything I have ever seen before in my whole entire life.  The shape was round and a bright light it was hovering for one moment and than just shot across the sky and appeared to be moving straight and then downward.   As quick as it appeared out of no where is as quick as it disappeared.  It did NOT have a trail of light behind it there was nothing behind it, it was just a light.   It traveled about as far as I can open my arms about a 90 degree STRAIGHT angle straight across the sky then appeared to go downward and disappeared.  I can not believe what I witnessed last night.",
      "link": "http://www.nuforc.org/webreports/107/S107544.html",
      "state": "NY",
      "duration": "<5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c092a",
      "summary": "Red/White Flashing Hovering Light.",
      "city": "rochester",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "Red/White Flashing Hovering Light It looks very similar to a star, but seems to move left, right, up and down slightly.  It seems to flash white and red.  I think it was quite a ways to the right of Orion. I noticed it when I went out for a walk at night. It seems to have moved across the sky quite a distance when I wasn't paying attention to it.",
      "link": "http://www.nuforc.org/webreports/105/S105596.html",
      "state": "MN",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c0938",
      "summary": "Floating Stationary Cylindrical Lights.",
      "city": "rochester",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "Floating Stationary Cylindrical Lights. It was seen while traveling East on Jefferson Rd (252). At first, it appeared to be reflections of the windshield, but after another person in the car questioned if we saw it, we could confirm it. They were like tall cylinders, but transparent and they were emitting like a white glow.  They were floating and did not extend all the way to the ground like a bright spotlight.  The 8-12 cylinders had a differing brightness.  There seemed to be one cluster that was southern most, then there more spread out going north.  They didn't appear to be moving relative to our position.  They seemed to be close, but as you drove closer, they the same distance away. After arriving at our destination, we got out of the car and still saw them in the same spots. My friend mentioned it on Facebook and a couple friends said they saw the lights from about 5 miles east, about 15 minutes after we had originally spotted them lights.   We checked about 50 minutes after the first sighting, and they are still present.",
      "link": "http://www.nuforc.org/webreports/107/S107595.html",
      "state": "NY",
      "duration": "10+"
    },
    {
      "_id": "64d005f478aba2ec5a3c0aca",
      "summary": "Huge, black, completely silent, slow gliding triangle. Cruised by close to the ground.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2014-03-18T00:00:00",
      "story": "Huge, black, completely silent, slow gliding triangle. Cruised by close to the ground. Huge black triangle with large, white circular lights around the edges.  It was completely silent and was slowly gliding by.  This didn't seem right because the object was flying really low..about the height of a 5 story building.  Had to turn my head right to left to see the entirety of the craft.  I was in my car and made a turn to to follow it, only to see it hover down over a patch of trees where its lights began to dim then it completely vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107793.html",
      "state": "MN",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0dee",
      "summary": "4 white lights rotating in the sky,right within the clouds.",
      "city": "rochester",
      "shape": "unknown",
      "date": "2014-03-18T00:00:00",
      "story": "4 white lights rotating in the sky,right within the clouds. Before I write this I want it understood that I was one to not pay attention to any so called UFO stories until last night, cause to be honest I had never seen anything like that before so I thought it was all BS.  Until last night,......... My bed room has a back door that leads outside onto a small roof around the back of the house, I use it when I'm going to have a smoke.   A little after lighting my cigarette I noticed what appeared to be 4 white lights rotating in the sky, right within the clouds, the moon was out and it was bright so I could see the clouds very well, the lights seem to be rotating simultaneously two at a time in a circles motion, curious I was like, \"What the hell am I looking at,\" trying to figure out if the lights were coming from the ground up or not, but from what I could see they were not they were coming from above the cloud.    Then just like that the lights rotated again into one but this time it was dead center and just ! diapered.  I stood there dumfounded not understanding what I just saw, but I do know what I saw.  Again I'm not a big fan or believer in the UFO thing, but I do now this, \"I know what I saw.\"",
      "link": "http://www.nuforc.org/webreports/107/S107868.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e47",
      "summary": "Solid bright orange light flying low and very quickly.",
      "city": "rochester",
      "shape": "light",
      "date": "2014-02-14T00:00:00",
      "story": "Solid bright orange light flying low and very quickly Near The Strong Museum of Play, Monroe Ave area.  Seen when we were walking from the car to the house.   We saw a light heading towards us in the sky from far south and west of Rochester.  Bright orange light zipped across the sky nearly overhead, from SW of the city to NE.   Clear sky; bright moon, 10 to 15 visible stars.   No blinking.  No visible trail behind. Looked to be lower than a commercial airplane would fly.  No sound.   Faded away in the distance but did not drop below horizon line.   It crossed the entire sky in less than 2 minutes.   No flickering or blinking, just a solid bright orange glow whizzing by faster than any plane I have seen.   Brighter than a lighter in your hand on a dark night.",
      "link": "http://www.nuforc.org/webreports/106/S106986.html",
      "state": "NY",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1214",
      "summary": "At approximately 7:30 pm , my wife and I witnessed an orange glow in the southwest sky. The glow became larger as it got closer.  There",
      "city": "rochester",
      "shape": "light",
      "date": "2014-01-16T00:00:00",
      "story": "At approximately 7:30 pm , my wife and I witnessed an orange glow in the southwest sky.  The glow became larger as it got closer.  There was no noise as it neared us or as it went over us and continued on north easterly heading.  There was no fiery trail following the object.  It was simply an orange ball flying through the sky and traveling at a fairly high rate of speed.  No clue what it was, expect that it did not appear to be man made. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106239.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c18bc",
      "summary": "White light pulsed bright and then faded away rather quickly.  ((NUFORC Note:  Possible flare from Iridium satellite??  PD))",
      "city": "rochester",
      "shape": "sphere",
      "date": "2014-07-20T00:00:00",
      "story": "White light pulsed bright and then faded away rather quickly. Saw a white light heading South in the Eastern sky.   It pulsed bright and then faded away rather quickly. ((NUFORC Note:  Possible flare from Iridium satellite??  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111556.html",
      "state": "NY",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1956",
      "summary": "Rotating cylinder over Rochester, NY city center.",
      "city": "rochester",
      "shape": "circle",
      "date": "2014-07-11T00:00:00",
      "story": "Rotating cylinder over Rochester, NY city center While attending a 7:05 pm ball game at Frontier Field, I witnessed what I thought originally was an air plane, moving in an easterly direction over the downtown area of Rochester.  After observing the object for about a minute I noticed it had an irregular flashing that looked like a rotating cylindrical shape that moved somewhat irregularly further east.   The object was very small and seemed to be at a very high altitude.  Then it disappeared.  Then, about thirty seconds later a smaller dark object appeared in almost the same place as the previous object, seemed to do a loop and quickly vanished.  The sky was very clear, no clouds, no other aircraft in the area.  My girlfriend also observed the objects as well, though other people around us in the crowd of about 7,000 appeared to not see it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111184.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d76",
      "summary": "Satellite looking object getting bright and fading while moving north east.",
      "city": "rochester",
      "shape": "light",
      "date": "2014-06-24T00:00:00",
      "story": "Satellite looking object getting bright and fading while moving north east. White to orange color.  Thought it was a satellite until it got brighter and then disappeared. It kept doing this as it traveled north east for a few minutes until it was behind houses/trees.  I've lived under the flight path for almost my whole life.  As a kid I always watched planes (as well as catching lightening bugs out back) I know it wasn't either of those.",
      "link": "http://www.nuforc.org/webreports/110/S110445.html",
      "state": "NY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e71",
      "summary": "2 round bright  reddish dots in the north sky.  Seemed to be still, then they started moving closer to each other passing each other.",
      "city": "rochester",
      "shape": "light",
      "date": "2014-06-13T00:00:00",
      "story": "Two round bright  reddish dots in the north sky.   They  seemed to be still then they started moving closer to each other passing each other.   I looked it up on the internet, and they were exactly like the red dots that were filmed at a previous date in AZ. ((NUFORC Note:  We suspect an evening sighting, and have changed the time above.  We attempted to contact the two witnesses, husband and wife, but have not managed to reach them, yet.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110063.html",
      "state": "NY",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1fc7",
      "summary": "Five reddish lights moving in an x formation traveling south west over Rochester.",
      "city": "rochester",
      "shape": "sphere",
      "date": "2014-06-20T00:00:00",
      "story": "Five reddish lights moving in an x formation traveling south west over Rochester. Five reddish orange lights over Rochester NY .Two at the top one centrally below and two more below.   They were moving south west together at great speed before fading out of sight.   Noticed when bringing out the trash.",
      "link": "http://www.nuforc.org/webreports/110/S110396.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c208a",
      "summary": "A disk like object, I could hardly make out a top and bottom projecting about 4 to 6 gentle yellowish lights. Stood still over a nursin",
      "city": "rochester",
      "shape": "disk",
      "date": "2014-06-04T00:00:00",
      "story": "A disk like object, I could hardly make out a top and bottom projecting about 4 to 6 gentle yellowish lights.  Stood still over a nursing home. Not a plane cause it didn't move or make noise.  Not a star cause it was to close.",
      "link": "http://www.nuforc.org/webreports/109/S109910.html",
      "state": "NY",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2151",
      "summary": "Three orbs in the sky over rochester ny.",
      "city": "rochester",
      "shape": "light",
      "date": "2014-04-18T00:00:00",
      "story": "three orbs in the sky over rochester ny i was sitting in my driveway in the car when i looked to my left and i saw 3 orange lights in the sky.   object 1 was leading object 2 was over to the left of 1 and object 3 was behind 1 and 2 and to the right, like three points of a check mark.   the objects were moving at a constant speed and they stopped i got out of the car told my granddaughter to look and she saw them as well.  we got out of the car went around the side of the house and they were just sitting there in the sky not moving. they sat there for what seemed to be a minute or so and they disappered in the trees.  went in the house and my granddaughter looked out the window and she said the were blinking but i did not see them at that time.   when i woke the next morning i had a strange noise i my right ear it sounded like a radio the couldn't find a station just static, it lasted on and off over the course of the day and then stopped.",
      "link": "http://www.nuforc.org/webreports/108/S108664.html",
      "state": "NY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24d4",
      "summary": "Like a star 2000 feet up same speed as a plane no sound or trail, solid light.",
      "city": "rochester",
      "shape": "diamond",
      "date": "2014-11-06T00:00:00",
      "story": "Like a star 2000 feet up same speed as a plane no sound or trail, solid light.",
      "link": "http://www.nuforc.org/webreports/114/S114458.html",
      "state": "NH",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2675",
      "summary": "3 silent deep black triangular UFO's Charlotte Beach.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2014-10-03T00:00:00",
      "story": "3 silent deep black triangular UFO's Charlotte beach Prior serviceman US Army, I saw three black as night triangular shaped UFO's gliding silently in a straight line formation from south to north parallel with lake Avenue by Charlotte Beach.  Followed by what seemed to be multiple aircraft in the area the minutes after sighting.   When all was calm, I seen the three silent black triangles do another pass following almost the exact flight path.",
      "link": "http://www.nuforc.org/webreports/113/S113937.html",
      "state": "NY",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b18",
      "summary": "Saw something shoot across the sky extremely fast.",
      "city": "rochester",
      "shape": "unknown",
      "date": "2014-11-26T00:00:00",
      "story": "Saw something shoot across the sky extremely fast I was driving home from work heading east down route 104 from route 259.  I caught a very fast object heading left to right.  The angle at which I saw it was about 20 degrees.  I am aware this is not much to go by but I have seen plenty of meteor showers and plenty of air shows and this seemed very strange how fast it was moving and the location in the sky.  I wanted to post this on hopes someone else had also seen the same thing.",
      "link": "http://www.nuforc.org/webreports/115/S115614.html",
      "state": "NY",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b49",
      "summary": "At 5:00 pm first orange glowing lights (Orange Fire Balls) seen were a set of 3 in a triangle shape approximately over Loan Oak Ice Cre",
      "city": "rochester",
      "shape": "fireball",
      "date": "2014-11-14T00:00:00",
      "story": "At 5:00 pm, first orange glowing lights (orange fireballs) seen were a set of 3 in a triangle shape approximately over Loan Oak Ice Cream on Rt 125.  Those 3 lights separated slowly away from each other and disappeared.  Behind those lights came several others in groups of 4 to 6 or so.  They all seemed to be 300 to 400 feet off of the ground and about 100 yards apart.  All flying in a row, one behind the other at about 30 to 50 mph? , running parallel to Rt 125 North.  A couple of the lights caught up to the lights ahead of them and flew beside them.   I drove south on Rt 125 and parked in front of Stewarts Green Houses were I could see more lights coming from the east, over the tree line across the street near Salmon Falls Road.  I watched the lights that kept coming in single file and flying along the side of Rt 125 North bound towards where they were first seen over Loan Oak Ice Cream.  I saw 35 to 40 or so total, in an 8 minute span between 5:00 pm and 5:08 pm.   When it looked like there were no more coming, I pulled out on to Rt 125 heading South, I looked over again toward the tree line and saw about 3 more appear, then I continued driving on my way home.",
      "link": "http://www.nuforc.org/webreports/115/S115308.html",
      "state": "NH",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2ddc",
      "summary": "2 sightings, 10 min apart, each time 2 orange/brownish dots moving south to north and incredible speed NO sound. Greece, NY",
      "city": "rochester",
      "shape": "formation",
      "date": "2014-08-22T00:00:00",
      "story": "2 sightings, 10min apart, each time 2 orange/brownish dots moving south to north and incredible speed NO sound.  Greece, NY 2 orange dots moving at incredible high speed south to north toward lake ontario.  NO sound whatsoever, absolutely quiet.  first sighting the right dot was moving in a straight line, the left dot was moving somewhat slightly curved but still in a fairly straight line parallel to the right dot.   Approximately 10 minutes later, 2nd sighting.  moving in same direction south to north.  this time both dots were much closer together, but again moving at incredible speed and again NO sound at all.  with less than 5 seconds they went from north Greece, NY, over lake ontario.   Shooting stars appear, get brighter and disappear.  those dots stayed same brightness, same size.  It's been quite amazing to see this since i have absolutely no explanation and always have been extremely skeptical toward any sightings i heard of or seen on shows on TV.   This tonight, though, really made me wonder what it could have been!  hopefully other will report it, too.   My wife also saw ! both sightings together with me.",
      "link": "http://www.nuforc.org/webreports/112/S112518.html",
      "state": "NY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2eba",
      "summary": "3 lights in different parts of sky at same time.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2014-08-29T00:00:00",
      "story": "3 lights in different parts of sky at same time I am reporting this for a friend, his words:   About 10:15, i let the dogs out in the backyard.  I immediately noticed a bright light in the west about 20 degrees up.  It was flickering, i knew it wasn't a star.  I got the binoculars and saw it had flashing lights, red, white and an occasional blue  or green.  A few times a bright beam of pinkish light shot out to the side.  The light stayed in one spot except that it occasionally moved a hair sideways and back, or in a small circle.  I couldn't get the binoculars to focus sharply on it, although I can focus on the craters of the moon or a jet at 35,000 feet.  After a while watching I sort of decided that it was in a triangular shape and was rotating. I walked down the street to get a better look.  At the top of the beach i noticed another light, same deal, out over the lake.  This was not like any of the lights I've seen out there.  When I had a clear view of the sky I saw that there was another one low in the northwest, like over toward Toronto. About 11:15 all three were suddenly gone.  They didn't move away, they went out. I came in the house and was heading into bed when there were five bright flashes in the southern sky, like a flash going off. There was never any noise from any of this.  The flash was bright enough to throw shadows of the trees into the room. In the middle of the night, around 2:30, wife said \"I can't sleep...aliens\".",
      "link": "http://www.nuforc.org/webreports/112/S112897.html",
      "state": "NY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c3103",
      "summary": "Fleet of lights seen through the clouds.",
      "city": "rochester",
      "shape": "light",
      "date": "2014-08-08T00:00:00",
      "story": "Fleet of lights seen through the clouds. While waiting for my dog to do her business, I noticed what I thought was a cluster of stars, about 5 or 6, and thought it was kind of odd.  It was cloudy and raining.   After watching for a few minutes they started to move around.  Mostly circles and figure 8's.   After watching for about 10 minutes there was a line of a dozen or so and then they just disappeared. Two were moving in circles until they finally zipped towards the east.   There was also what appeared to be a spotlight go across the sky a few times. This happened slightly to the north of the airport.   Lived here 15 years and never saw anything like the spotlight.  (or cluster of \"stars\" moving around through clouds.)",
      "link": "http://www.nuforc.org/webreports/112/S112190.html",
      "state": "NY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3779",
      "summary": "Star-like object in slow circular path suddenly speeds across sky in bright white cigar shape then disappears in cloud bank",
      "city": "rochester",
      "shape": "light",
      "date": "2015-01-16T00:00:00",
      "story": "star-like object in slow circular path suddenly speeds across sky in bright white cigar shape then disappears in cloud bank Driving home tonight near shoreline of lake Ontario, about 5 houses from my home, I observed a star-like light way above my house, moving in a tight slow circular path.  Other than motion, it looked like a star.   Then it sped off in a curved path much like a nike swoosh logo across the sky southward toward the city and disappeared in a cloud bank.  When it flew across it looked like a bright white cigar shaped light.   Not sure if shape truly changed or the extremely fast motion made it appear that way.  I could see the clouds light up as it moved through them then it was gone.   I have worked night shift for 22 years and having the opportunity always look up in the sky for the chance to see something extraordinary, and tonight it happened.",
      "link": "http://www.nuforc.org/webreports/116/S116611.html",
      "state": "NY",
      "duration": "~5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c391d",
      "summary": "((HOAX??))  Can't put what I saw in one sentence, not possible.",
      "city": "rochester",
      "shape": "oval",
      "date": "2014-12-18T00:00:00",
      "story": "Can't put what I saw in one sentence, not possible. Well, driving home on Rochester road there was this space craft seemed to be sort of filling us..  Now, where I live there is light pollution so you can't see shooting stars and anything like that.  All of a sudden this bolt of i don't even know, what looked liked a shooting star hit the craft.  We pull into a church parking lot, the craft is literally so low, we could see it, it was still just like we were, had a greenish almost blue glow.  We start driving again, the craft does this weird turn but ever so smoothly and heads the direction we are in.  My friend screams out the car windown nothing happened, we turn down this dirt road and all of a sudden boom it's gone..  But the most scariest interesting part of this whole entire thing, earlier that night at my friends house this sound I could not explained occurred, and lights flickered, and all of a sudden her basement door was open.  Them animals in the house became terrified.  I felt this weird feeling in my body, I wasn't afraid I was expecting them, but something was in her house.  We called the police thinking maybe were crazy and someone waist had broken in, the police found no evidence, all if the cabinets were open, all of her art supplies were open in the cabinets, the bar downstairs fridge open.  Then the sound stopped right when the police came.  Twenty minutes after they left we got in the car, drove around..  And saw what we had seen…",
      "link": "http://www.nuforc.org/webreports/116/S116009.html",
      "state": "MI",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c39c8",
      "summary": "Wack harp like noise coming from sky every 10-20 minutes.",
      "city": "rochester",
      "shape": "",
      "date": "2014-12-12T00:00:00",
      "story": "Wack harp like noise coming from sky every 10-20 minutes. Harp like noise coming from the sky at about 10-20 minute intervals.  Scariest ((word deleted)) iv ever heard in my life.   The when i looked it up on google it said it's an  unknown phenomenon that happens all over the world. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115841.html",
      "state": "NH",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ce5",
      "summary": "4 orange balls of light in the sky above Park Avenue.",
      "city": "rochester",
      "shape": "formation",
      "date": "2015-07-03T00:00:00",
      "story": "4 orange balls of light in the sky above Park Avenue. Sitting in car, originally observed 3 orange balls of light in triangle formation, slowly traveling southwest towards Brighton area.   The lead light moved over trees and out of sight, then the two in the rear of the formation started to move towards each other until they were basically one ball of orange light.   It then proceeded to move alone back the way they came (northwest, towards Irondequoit) after a couple of seconds it stopped and a 4th ball of light moved into view from behind trees heading in the same southwest route the original 3 were taking.   The now 2 orange lights moved in what looked like a parallel formation, with one leading just a little in front. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119789.html",
      "state": "NY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3df4",
      "summary": "I saw 5 red-orange colored, circular shaped slow flying objects with no sound and I was at the Greece Town Hall by the library.",
      "city": "rochester",
      "shape": "circle",
      "date": "2015-07-10T00:00:00",
      "story": "I saw 5 red-orange colored, circular shaped slow flying objects with no sound and I was at the Greece Town Hall by the library.",
      "link": "http://www.nuforc.org/webreports/120/S120259.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ddd",
      "summary": "5 orange lights following the same path, seemed to die out as they progressed, seen by five people w/video.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2015-07-06T00:00:00",
      "story": "5 orange lights following the same path, seemed to die out as they progressed, seen by five people w/video. We originally saw two red/orange lights in the sky.  We thought it was a meteor shower and took a video.   We ultimately ended up seeing five.  They all followed the same path.  One sped up in front of another.   They all seemed to die out as they progressed, which is why we thought it was some sort of meteor shower, that and the red/orange colors.",
      "link": "http://www.nuforc.org/webreports/120/S120033.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3e60",
      "summary": "Sitting at the commons in Rochester and appeared a fireball coming from the north east headed south west it was a huge fireball that fl",
      "city": "rochester",
      "shape": "fireball",
      "date": "2015-06-24T00:00:00",
      "story": "Sitting at the commons in Rochester and appeared a fireball coming from the northeast, headed southwest. It was a huge fireball that flew across the sky at the same speed as a twin engine plane but it kept getting higher and then it disappeared kind of orange yellow. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119732.html",
      "state": "NH",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c481d",
      "summary": "Large strange light shapes in sky flying in loose formation in semi-circle, then off in a straight line.",
      "city": "rochester",
      "shape": "unknown",
      "date": "2015-10-09T00:00:00",
      "story": "Large strange light shapes in sky flying in loose formation in semi-circle, then off in a straight line. I just saw 5 or 6 UFOS in the sky under cloud cover above Rochester, NY. I thought it was a spotlight advertisement at first glance, but then immediately saw the objects were large and far up--under cloud cover--but highly visible. They moved in loose formation and seemed to circle around a bit and then they kept going straight and disappeared.   It’s 8pm in Rochester, New York.",
      "link": "http://www.nuforc.org/webreports/122/S122486.html",
      "state": "NY",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c48a3",
      "summary": "Unexplained Lights Over Rochester, NY.  ((NUFORC Note:  Possible advertising lights??  PD))",
      "city": "rochester",
      "shape": "light",
      "date": "2015-10-29T00:00:00",
      "story": "Unexplained Lights Over Rochester, New York At about 7:50 p.m., on Saturday night, October 24th, 2015, I walked out of Marketplace Mall in Rochester, New York by the Macy's.  I looked up above the mall building and saw many flashes of lights.  They would change from dim to brighter every few seconds as if they were passing through clouds.  I watched this for nearly ten minutes before I had to go somewhere. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123121.html",
      "state": "NY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c48d6",
      "summary": "Yellow/Orange/White sphere seen by 3 in Rochester NH",
      "city": "rochester",
      "shape": "light",
      "date": "2015-10-16T00:00:00",
      "story": "Yellow/Orange/White sphere seen by 3 in Rochester NH Last evening, 10/12/2015, I went out to my truck to get a bag of groceries when I noticed a bright, flashing light.  It was strobing, then it would stop and go very bright, then strobe again.  It was a white/yellow/orange combination of light. It was just sitting there in the North East just above the tree line.  I ran into our house and got my wife, she came out to the front of our home, watched it with me for about 30 seconds, then it moved to the North. We could no longer see it from the front of our house so we went out to our back deck and was able to see it just over the trees. It was very, very bright, moving funny.  A little to the left, then up, then back.  After about 2 to 3 minutes, right before our eyes, it vanished!  At this time our daughter came over and wanted to know what we were doing, we told her what we saw.  After about 5 minutes of scanning the sky, BAM, it repapered right where it had vanished.  It seemed much brighter, moving a bit erratic and strobing faster.  After about 2 to 3 minutes, it moved up and to the north, then in a second vanished again.  We watched for another 10 to 15 minutes but it never came back. What we did notice is that after about 20 minutes after in vanished for the last time, there were a number of airplanes!!  We did not see one in the sky while we were watching the “UFO”, but after we counted at least 8 in the sky over and around where we saw the light.  Our son is very much into UFO’s and told us that when something like this happens and you see a number of planes, something defiantly is going on.  We are going to continue to monitor the sky every night for a while to see if it comes back.",
      "link": "http://www.nuforc.org/webreports/122/S122773.html",
      "state": "NH",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4993",
      "summary": "On a cloudy night in Minnesota I was on my back patio looking up towards the west for any stars and a light came into view that I assum",
      "city": "rochester",
      "shape": "chevron",
      "date": "2015-10-16T00:00:00",
      "story": "On a cloudy night in Minnesota I was on my back patio looking up towards the west for any stars and a light came into view that I assumed was a star until my eyes adjusted.  I noticed it was in the shape of a bird soaring and it was moving slowly towards the east.  It was moving about the speed of a plane and after about 3 seconds it disappeared behind a cloud. I just tried to shrug it off until a few seconds later I saw another farther down the sky and another flying very closely by it.  One disapeared as if into thin air and the other disapeared passed the clouds.  As the clouds moved I saw a few more come into view,a few at the same time and a few going faster before disapearing. I kept looking up for about 30 minutes; I didn't see anything else but I saw about 7-10 of these flying lighted objects within 5 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122829.html",
      "state": "MN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4aa6",
      "summary": "Bright orange orbs hoovering and zipping through the atmosphere with ease.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2015-10-02T00:00:00",
      "story": "Bright orange orbs hoovering and zipping through the atmosphere with ease. I was standing in my yard and as I looked to the sky I saw an bright orange orbs hoovering and suddenly began zipping around the sky with ease and precision, I ran back into my house frantically trying to explain the situation to my brother, who took his time getting outside, but sure enough the orb was still out there. By time I thought to turn on my camera phone, I was only able to capture about ten seconds of footage before the Orb shot out of the atmosphere.  As me and my brother starred at each other speechless, no more than ten seconds after the solo Orb took off, four of the exact same orbs slowly rose up from the tree line, in a semi V formation,  and seconds after slowly rising  all orbs simultaneously began again, effortlessly zipping through the night sky both side to side and up and down. As the multiple Orb feat was so astounding, when I attempted to capcapture more footage with my cellphone, I unfortunately forgot to press the record button,due to over excitement. Therefore, the initial single orb sighting is all I was able to capture.",
      "link": "http://www.nuforc.org/webreports/122/S122447.html",
      "state": "NY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ba1",
      "summary": "Many star like things wiggling in the sky at  12am till ???  I couldn't stay up to wait to watch them jet off or whatever.",
      "city": "rochester",
      "shape": "light",
      "date": "2015-09-17T00:00:00",
      "story": "Many star like things wiggling in the sky at  12am till ???  I couldn't stay up to wait to watch them jet off or whatever. I've been gazing at the stars my whole life , I'm 33 , and never saw this before.  At 12am I saw many, what looked like typical stars but looked closer than usual which got my attention and as I watched I saw them slightly adjust their position in the sky.  I saw 1 single yellowish one to the east adjust up , down, left and right.   Then another 2 off far to the left one bigger than the other, moving the same way almost battling each other but never switching sides, almost like they were playing pong.   Then noticed to more sets on different parts of the sky, at least 12 set up in a triangular shape with smaller ones inside the formed shape, then 3 more in a straight line up and down very slowly moved  across the east to north.  Don't believe me, just stare at the sky tonight, you'll ((deleted)) be surprised.))",
      "link": "http://www.nuforc.org/webreports/121/S121986.html",
      "state": "NH",
      "duration": "Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ca0",
      "summary": "Fast moving light, going straight up.",
      "city": "rochester",
      "shape": "unknown",
      "date": "2015-08-27T00:00:00",
      "story": "Fast moving light, going straight up. Noticed red and blue light in the sky it say there for a second, and then rapidly wen straight up in the air. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121169.html",
      "state": "NY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4dc8",
      "summary": "Seen 2 orange orbs passing NE to N each dropped 3 small bright objects then later I used a telescope because I seen 2 bright stars that",
      "city": "rochester",
      "shape": "cross",
      "date": "2015-08-27T00:00:00",
      "story": "Seen 2 orange orbs passing NE to N each dropped 3 small bright objects then later I used a telescope because I seen 2 bright stars that were much brighter then the others.  Through the telescope they were cross's, one bright center and 3 fainter to each side.  With a stronger objective lens, I could see even fainter lights evenly space between the cross.  They moved up and down the skys zenith slowly over a couple of hours, eventually they just kinda faded back until they were gone.   Video of the cross: https://www.youtube.com/watch?v=_Scv-72mpuI ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121424.html",
      "state": "NY",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e31",
      "summary": "3 orange lights, forming a perfect triangle in the SW sky, without sound or motion.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2015-08-13T00:00:00",
      "story": "3 orange lights, forming a perfect triangle in the SW sky, without sound or motion. I witnessed 3 glowing orange to red orange orbs to the SW.  The 3 objects appeared to be independent of each other and oscillated at different intervals.  I could not discern the presence of an overlaying craft (these did not appear to be lights attached to a craft of any kind). The 3 orbs began  as a single light and progressed in short fashion (maybe 10 minutes) in to 3, presented to me in the form of a perfect triangle in the sky.  I did not see any apparent motion nor did I detect any sound resonating from the SW. I initially had thought that the single orb was a forthcoming helicopter (mayo one does fly in this area) however, after seeing no motion and then witnessing the 3 in the sky, forming a perfect triangle, I knew that this was something completely different. I'm not sure what I witnessed but the fact that it maintained a perfectly triangular shape and quickly disappeared, after 30 minutes had elapsed, left quite a lasting impression in my mind.",
      "link": "http://www.nuforc.org/webreports/120/S120950.html",
      "state": "MN",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c51f1",
      "summary": "Yellow/orange bright light over Rochester, NY.",
      "city": "rochester",
      "shape": "light",
      "date": "2016-02-04T00:00:00",
      "story": "Yellow/orange bright light over Rochester, NY. Taking out the garbage noticed a bright light in the sky low in the horizon.  It was yellow to light orange in color.  No sound.  It was about as bright as Sirius.   I first noticed it behind tree line above neighbor’s house.  I was facing south and it was moving west to east.  I thought it was a low plane but the light was very bright.  It was a traveling strait and must have been higher because it went behind the clouds.  I did not see it exit the clouds.   Stars were really bright that night and the clouds were scattered. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125598.html",
      "state": "NY",
      "duration": "15-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5211",
      "summary": "On the night of Nov. 20th, at approximately 5 pm (1700 hrs), I was at work and was informed by a fellow employee that there was so",
      "city": "rochester",
      "shape": "circle",
      "date": "2016-01-05T00:00:00",
      "story": "On the night of Nov. 20th, at approximately 5 pm (1700 hrs), I was at work and was informed by a fellow employee that there was something in the sky, and that it looked like it might be on fire. I stopped what I was doing and went outside where another employee was already out there and watching a reddish/orange what I thought was a star, possibly Venus. He informed me that there had been 2 of these objects but the other one had disappeared from view.  He also told me that they had been closer and larger in size and so were moving away. I continued watching and realized it couldn't be Venus as it appeared to be moving slowly and changing in brightness, from a dull orange to a brighter orange and then back to dull again. There were some clouds in the sky and it was getting dark but I noticed the clouds seemed to be very high in the sky and after about 5 minutes the orange object started to noticeably pick up speed and disappeared behind the clouds. We watched for a few more minutes but the object didn't return.  I went outside a few more times that evening but never saw the object again.",
      "link": "http://www.nuforc.org/webreports/124/S124903.html",
      "state": "NH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c52cc",
      "summary": "Square or diamond shaped object hovering and moving very fast over Rochester, NY.  12/23/15 7:30 p.m. (EST).",
      "city": "rochester",
      "shape": "diamond",
      "date": "2016-01-05T00:00:00",
      "story": "Square or diamond shaped object hovering and moving very fast over Rochester, NY.  12/23/15 7:30 p.m. ET I was walking into an apartment building and noticed a very bright green light sitting still in the sky at what appeared to be maybe 7 to 10 thousand feet high.  Just based on the brightness of the light and the fact that it was sitting stationary in the sky,  I immediately pulled out my phone and started filming.   I then watched for the next 12 or 13 minutes as this thing blew my mind.  It appeared to be square, or diamond in shape.  It changed from green to red then back to green in no real pattern.  It did not make a sound.   It traveled from one side of the city to the entire other in under 10 seconds.  It dropped so low that it was out of my sight for a few minutes, then rose as if someone had a string attached to it and yanked it upward.  I would say 1,000 feet to 10,000 feet in under 3 seconds.   As it got close enough to me to really make it out I could tell the body of it was black, there were four huge perfect circle lights on the bottom, two red and two green, but at times there would be either no green or no red.  I also saw a flashing white or maybe even amber colored light on the back?  Maybe front?  I am basing the size on a passenger jet which flew through the same vicinity as the craft moments after it disappeared which I also caught on video and I would say that it was half to 3/4 the size of the airplane which was a full size jet plane.  It also appeared to be traveling 15 to 20 times faster than that plane which was descending to land and much much higher.  This happened in Rochester NY and I witnessed it from the suburb Greece, NY.  It was mostly south of my location, but at times traveled far enough north east (in under 10 seconds mind you) that I had to turn my whole body and face Irondequoit, NY, which is east of Greece, to keep recording it.   I stopped a passing car and asked the young lady to look up and tell me what she sees so I know i'm not going crazy and she watched it for about 5 seconds, said oh my God that's a ufo!  I said thank u for confirming and she promptly pulled away as if she was nervous.  The craft made a lot of erratic movements.  Stopping on a dime, zig zag patterns at times, shifting as if on an axis.  At one point it started heading right at me and had me nervous enough to start walking back towards the apartment building for safety.  It was acting as if it were investigating or searching for something.   Truly a life altering experience for me, felt absolutely nothing like a drone which is the infamous explanation i'm getting for this.  I own a drone.  I know what they can do.  I know there's a wide variety of shapes, sizes, and uses for them.  This was not that.   Oh and I don't know if this relevant or not but I experienced a really bad headache about an hour after the event which would not go away to the point that I had to take tylenol for it.  I NEVER EVER have headaches that lead me to have to medicate.  Cannot remember one time in life.  I don't know if it was just from all the excitement or what.",
      "link": "http://www.nuforc.org/webreports/124/S124851.html",
      "state": "NY",
      "duration": "13 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c55ce",
      "summary": "No noise, unusual beginning.",
      "city": "rochester",
      "shape": "sphere",
      "date": "2016-07-22T00:00:00",
      "story": "no noise, unusual beginning On Sept 25, 2012, I was taking image of Braddock Bay, Lake Ontario, near Rochester, NY, when I noticed what I thought were fireworks being shot near the lake.  They didn’t come from the ground, but raised up fanning out and arcing downward in 4 whitish lights which then faded.  This occurred straight in front of me, approx. 1 to 2 miles in front of my line of vision.    They started this pattern 90 deg South (to my left), and each time they repeated the same pattern until the fan of lights (4) were facing me and kept rotating as before moving from my left to my right.  There was an interval of between one or two seconds before each rotation.  It was at that point I decided to turn my camera in an attempt to capture this phenomenon. I was shooting 6 images of the same scene, shooting one f stop apart to later combine them later in a process known as stacking.  The images were shot in raw in which the camera shoots and records the data without any changes or modification.  I used a Canon 5d mark II  which produced images averaging 27 mp each.  I still have the raw images saved in which you can see the 4 yellowish discs in the horizon. As a result of this in the two images included I saw that the pattern had stopped and they were visibly flying in a North/Easterly direction to go over Lake Ontario towards Canada.  I have included a small version of the entire image and the magnified part of the image. Image 1  count from the right of the dock in the distnce to the third light to the left and you can see the small light in the sky.  Shot at 7:13  PM  (time of the 6th shot in the series)  Image 2  the light in the sky is more visible and you can compare the movement.  Shot at 7:15 ( again the 6th shot)  As for the light conditions the sun is setting and is behind and to the left of the 4 discs therefore the light is being generated is by them. Thank You, ((name deleted))   ((NUFORC Note:  We spoke at length via telephone with the witness, and he sounded to us to be quite sober-minded to us.  Also, he has submitted a high-quality photograph, to accompany the report, which is posted to our homepage, as of July 22, 2016.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128623.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5690",
      "summary": "Disk shape craft with spinning lights over Rochester",
      "city": "rochester",
      "shape": "disk",
      "date": "2016-06-24T00:00:00",
      "story": "Disk shape craft with spinning lights over Rochester This happened sometime in 1972, during warm weather, the sky was dark.   My mom picked me up at work at a department store in Greece, NY, which closed at 9:30.  Shortly after she turned onto Ridge Rd., I looked up and saw a disk-shaped craft hovering over us.  It was perfectly round, and had spinning lights around the perimeter.   I made my mother pull the car over and I got out.  Ridge Rd. is a very busy street, so I couldn't stay out of the car long.  My mother saw it, too, and brushed it off as being an advertising plane of some sort.  I never saw an advertising craft like that!  And in the dark sky!   I have always wondered if someone else remembered it.  I wonder if it's the same craft reported in Buffalo on 6/22/72. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127967.html",
      "state": "NY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c563d",
      "summary": "I caught it on my camera, its shooting around all different directions, almost looks like a dragon fly but a UFO sized one, it's changi",
      "city": "rochester",
      "shape": "teardrop",
      "date": "2016-07-22T00:00:00",
      "story": "I caught it on my camera, it's shooting around all different directions, almost looks like a dragon fly, but a UFO sized one, it's changing shapes, it's still here.  I noticed it 20 minutes ago.  I also saw a green shooting object shoot down near it.",
      "link": "http://www.nuforc.org/webreports/128/S128525.html",
      "state": "NH",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5732",
      "summary": "Green fireball shooting downward.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2016-07-15T00:00:00",
      "story": "Green fireball shooting downward. This UFO was seen at approximately 10:45pm July 10th, 2016.   This green fireball shot downward in the eastern sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128425.html",
      "state": "NH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c2a",
      "summary": "((HOAX??)) Started w/ 1 light on E hor., followed it, grew to countless lights over 2 hrs., along with close encounter ground sighting.",
      "city": "rochester",
      "shape": "fireball",
      "date": "2016-04-01T00:00:00",
      "story": "Started with 1 light on east horizon, followed it, grew to countless lights over 2 hours, along with close encounter ground sighting. It started with one light, redish/orangish/white hovering over the horizon while me and my friend were parked on my road, facing east.  I live on the east outskirts of Rochester.  It was staying in the same area but floating, dipping, and swooping around.  You could tell it was far away.  I pointed it out to ((friend's name deleted)) and she saw it too, and it proceeded to swoop around and dip up and down erratically.  We both saw it moving.   I was really excited and made her drive closer to where it was.  We drove closer, heading east until we weren't really in Rochester any longer, more Buckhart area.  I lost view of the light on the way.  When our view became clear again, we parked facing the side of the sky we saw it in, the south east whole sector of the sky.  I couldn't find it and then I noticed it in a different part of the sky, much higher.  We watched this light dance around for awhile.  It moved in ways impossible to any technology we have.  ((friend's name deleted)) saw it too.  We were watching the one light fly erratically.   Both of us keep thinking we glimpse other similar lights moving but aren't sure.  The one light is flying over the horizon at a steady speed in one direction, then it slowly fades away and seems to dissappear.  Another (or the same) light pops up much higher in a totally different direction in the sky.  Then we both saw the second one.  Same color of light, same behavior.  I was ecstatic.  At this point it was clear that these could not be planes or helicopters.  And then they kept appearing--they just kept popping up.  These different lights, all the same color, all differing moment to moment in brightness and dimness, sometimes becoming so dim as to be invisible. They all flew the same style--drunk alien, but never in sync; they would swoop, reverse directions in an instant, dip up and down.  There were no formations to be seen or apparent organization.  Sometimes the speed of their movement was shocking, given how far away they were they had to be covering huge distances in an instant.  Some would move in a general direction, but erratically.  At one point I could have sworn a fighter jet was pursuing one of them, but I couldn't be sure and ((friend's name deleted)) didn't notice it.  I tried to keep count and I got to 8 before I couldn't count them due to the number and the extreme dimness of some of them.  I kept trying to explain it to ((friend's name deleted)), but I don't think she will ever understand how much of a big deal this kind of shit is to me.   The sky was alive with dancing spaceships. We were there for maybe two hours. I could not stop watching, it was like being in a trance.  So I was watching the dance of the spaceships when I noticed a light in the sky coming from behind us (high, moving from NW to SE toward the spaceships.  It was different-- bigger, and blinking one light and one color in steady pulses, and moving at a steady speed and direction.  I assumed it's a plane but I watched it because something seemed odd about it. It's not like a light ON it is blinking, it's like the entire vessel is blinking.  And the color is like an old yellow light, like the color cast by old light bulbs.  I notice in between the blinks it appears to glow a very dull red.  It changes directions and comes in towards the ships.  I watch a spaceship closest to the incoming big yellow light and the strangest thing happens, the spaceship seems to become aware of the new interloper, and it swept towards it and back in a few motions, and then IT STARTED BLINKING BACK AT THE SHIP.  And both blinked differently, like they were shaking hands or trading information of some kind, with different rythyms and frequency and color.  This was the first time we saw any of the fireballs blink.  They blinked a bright white.  Then the big yellow ship came in closer to the other ships and slowed down to a stop were it hovered and bobbed.  As it did this, two more spaceships swooped in close to it and began their own unique blinking response.  So clearly it was another UFO, but different from the rest.  After it delivered it's message or whatever it flew away (SE to NE and seemed to go higher than any plane ever could) where it seemed to become a still star.   At this point, I couldn't take it and I called my dad to make him come outside the house and try to see what I was seeing.  This was also a really strange aspect.  Once my dad came outside, the brightest of the spaceships all started blinking red and white, like airplanes.  They also chose a general direction and stuck with! it, though their speed fluctuated.  It was funny because they all blinked with no rhythm or steady pulse to them.  Long story short, all he sees is airplanes of course.  He goes back in and I get off the phone with him and the ships go back to normal and start moving more.   At several points, I made reference points by holding up my thumb or my phone still under the light in the sky, this was an easy way to see that they were moving relative to the motionless point. I can't explain what I saw, but we saw it and it was amazing. A two hour dance that started with one little light. GROUND SIGHTING, AS WE LEAVE:  [A NOTE: we did not see any ship approach the ground or come close to landing] Right before we leave a big solid white orb light maybe a hundred yards behind us floods us with light.  I sa,y \"What the fuck was that?\" because it disappeared quickly and Kaitie said a car.  But the light hadn't come from the road.  It was directly behind us, close to a house on the other side of the road.  Then we were getting ready to pull out, and it floated out from behind the house.  My first impression was it was just someone with a light, but it was much too bright.  And it floated. It glided.  It came out from behind the house and started coming towards us.  We're talking the brightest white light you've ever seen, on the other side of the road not 70 yards away.  Then it's gone. Two seconds of darkness ... and then it comes back on-- except it's glowing blood red now, and more dim because of the duller color of the red.  There was no indication of anything producing the light. I was a little scared and we drove away, leaving the red light back there. That is the end of this report, but I feel the need to mention what happened the next night from my bedroom window. Kaitie was there again:  Over the cornfield in front of my house around 11 PM two lights hovering over the ground appeared and acted erratically.  One was bright and white, much similar to what we saw so close to us on the ground.  The other one was orange, and very odd at first appearance.  It looked to be a bright orange ball constructed of paper with a fire blazing inside of it.  It acted the most erratic in flight before both became almost entirely still.  They stayed until day started to come, and as the light of day  grew, they receded into the distance until they were tiny pinpricks, and then nothing. I have no pictures but if they come again I plan to walk up to them and try and take a picture/just get closer. ((NUFORC Note:  We spoke with the source of the report, and despite his assurance that the report is accurate, we question whether it is a serious report.  The source of the report describes himself as a \"writer,\" and when pressed on the type of writing he does, he admitted that he is a writer of fiction.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126639.html",
      "state": "IL",
      "duration": "~2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e47",
      "summary": "HELLO at approximately 21:30 my fiance and I were sitting on our deck. We had looked up at the sky and seen this bright amber colored f",
      "city": "rochester",
      "shape": "fireball",
      "date": "2016-11-11T00:00:00",
      "story": "HELLO at approximately 21:30, my fiance and I were sitting on our deck.  We had looked up at the sky and seen this bright amber colored fire type light.  It had to be about 25-35 feet above tree level.  We really got us is that after the first had gone by a second one had past about 2 minutes later and then a third about 2 minutes after that.  All headed in the same direction to.  NOW I know it was not a Chinese lantern because of its speed and it's  pretty windy for a flame to stay lit!!  Can't stress this part enough.  On top of that there was absolutely no sound.  We don't know what it could of been, but got our attention enough for me to look up what it could of been and ask questions.  This is my first stop to post this. ANY suggestions?  It was only one color to that amber fire color, so this has me baffled!",
      "link": "http://www.nuforc.org/webreports/131/S131018.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6304",
      "summary": "Bright lit object over head; watched it fade and disappear.",
      "city": "rochester",
      "shape": "light",
      "date": "2016-08-16T00:00:00",
      "story": "Bright lit object over head; watched it fade and disappear. Out star gazing with the family in the back yard.  Bight light comes over our tree line, bright white like a plane, but no blinking lights or noise would hear with a plane that low.  Watched as it flew over us and slowly the light started to fade on it.   Just when it got right over us it disappeared completely, and we all saw it happen.",
      "link": "http://www.nuforc.org/webreports/129/S129134.html",
      "state": "NH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6553",
      "summary": "A large black triangle with three lights that hovered around us for over 2 hours.  A solid object that made no sound.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2016-08-16T00:00:00",
      "story": "A large black triangle with three lights that hovered around us for over 2 hours. A solid object that made no sound. My daughter and I went out to view the Perseid Meteor Shower late on Thursday, August 11, at a small park in Rochester N.H., and while we were looking overhead toward the South we spotted a small light moving slowly in all directions.  As we watched we realized it wasn’t moving away from us.  After a few minutes we realized it was shaped like a triangle with a bright light toward the front and two dimmer, green-tinted lights in the back.  We also noticed that there were very faint green lines forming the triangle and connecting the three dots.  It was a solid object and the lights never changed distances from one another. The movement did not resemble a helicopter, airplane, satellite, drone or anything we had ever seen fly in the area before.  It made no noise that we could hear and it clearly had nothing to do with the meteor shower. It in no way looked like a shooting star.  Sometimes it moved quickly to the left or right.  Sometimes it moved forward in the direction of the brightest light and then backed away in the direction of the two green lights.  However, it always remained above us with no real pattern of movement. We were in an open field surrounded by trees and it remained above the open area from 11:45 p.m. on Aug. 11, and we left the scene on Aug. 12 at 1:57 a.m. At one point it seemed to not only move toward the spot where we were sitting, but down towards us.  It then quickly backed away again to its original spot in the sky. While it did move some distance, it never left our sight and was almost always directly above our heads. I made phone calls to the Pease Air Force base nearby and asked them to look to see if they saw anything on radar or any other equipment.  However, they said they could only see flight plans and transponders.  The man on the phone said he would look into our sighting further. We also called the Rochester Police Department and they responded with three vehicles.  The officers observed our UFO and somewhat laughed it off, but nicely.  Both the police officers and the man from the Pease Air Force Base wondered if it might be a drone, but I do not know of any drones that are solid, triangular with three lights.  It flew in so many directions for such a long period of time and made no noise of any kind.  In any event, our sighting was documented by an airport and the local police. Through the entire event the object never moved very quickly, but it did change speeds and stop and start again. My daughter noticed that there was a grey coloring in the solid area between the lights.  She also so on the side of the triangle lights, smaller rectangular lights separated almost like windows. This was the first UFO sighting that either of us has ever experienced. We saw no evidence of aliens. All we saw was the object itself. From what the police told me later, they had many calls from other citizens who saw the ufo and one called this national reporting hotline as well. The police also said that Rochester has no drones nor does the New Hampshire State Police.  They also said that the military would have informed them of any surveillance going on in the city.  They had  no military notifications that night. ((ADDENDUM #1 FROM WITNESS)) Here are two of our pictures...Only the bright light in the front of the triangle was visible on the phone camera picture but there it is. We have other pictures but they all look similar. We tried taking video and I'll look at those next as well. Here are the two pictures we managed to get.  ((END ADDENDUM #1)) ((ADDENDUM #2 FROM WITNESS)) Hi Peter,  This is my written report that I put together when I got home the night of Aug. 12.  From what my daughter said you  may not have received it.  The written report that you received, while it was happening, was hers.  She said it was mine because she was embarrassed to put her name on anything.  I'm going to send it in this e-mail with an attached microsoft word document as well.  ((NUFORCE Note:  Witness alludes to report which appears above.  PD)) ((END ADDENDUM #2)) ((ADDENDUM #3 FROM WITNESS)) We first saw it on Aug. 11 at 11:45 p.m. and kept on watching it until almost 2 a.m. on Aug. 12.  If it makes it easier we saw it for more time on Aug. 12.  Hope this helps. ((END ADDENDUM #3)) ((ADDENDUM #4 FROM WITNESS)) I'm really glad to help.  I've never dreamed of seeing anything so weird in my life and I want to know what others think of it.  The thing that strikes me most is that I never heard of a black triangle up to our sighting.  I have since done a lof of research and see they have been around a long long time, before any drones were in the hands of the public.  I truly don't believe that huge triangle was a citizen's drone.  It was something much more.  It was just too big and too quiet.  I saw a video from Concord, NH, with a triangle that was similar to ours, but it was taken in daytime.  There have been so many of these sightings in NH and the East Coast.  Why is that?  Very very interesting and very very strange. ((END ADDENDUM)) ((ADDENDUM #5 FROM WITNESS)) It was much larger than the moon in the sky above us.  To me it seemed as big as a football field, maybe a few football fields, high in the sky and way above the trees.  It flew higher than the small planes.  It dwarfed the small planes that flew around us all night.  As it hovered over us, we got very nervous, even scared, as it moved lower towards us, almost like we feared it was going to fall on us.  My daughter was making strange noises for a short portion of the 2 hours we saw it.  I also remember my heart racing a few times and my hands were trembling like I had too much caffeine?  My voice was trembling when I talked to you on the hotline, and it was hard to catch my breath.  I had a sick feeling in my stomach, but I was so excited to see it at the same time.  She wanted to leave but I wouldn't go.  I couldn't take my eyes off the thing.  I also forgot to mention that at the end it did move out of the area very slowly to the North and out of our view.  The police saw the tail end of it all.  Actually it seemed to move away more directly when the police cars arrived in the parking lot with their headlights and flashlights aimed at the object.  ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/129/S129288.html",
      "state": "NH",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c6556",
      "summary": "((Daughter's report))  3 lights connected by lines of light.  Can't see stars though it.  Moves in all directions.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2016-08-16T00:00:00",
      "story": "3 lights connected by lines of light.  Can't see stars though it.  Moves in all directions.  Clearly not a plane, helicopter, or satellite We were looking for shooting stars by the Isanglass River and we saw something moving sparatically, so we watched it and it's stayed in the same area but moves all around.  There is one white bright light and two green ones in a formation of a triangle.  There seems to be lines of light between the three triangular points of lights  It moves all around and the bright white light seems to be the front of it.  It's pretty big too.  Sometimes it stops then moves fast again.  It's been here for over an hour over our heads.  It sways back and forth and sometimes backs up and goes forward.  There's no stars showing between the three lights which suggets a solid object. ((NUFORC Note:  Please see other two reports, submitted by August 15, 2016.  Several members of the Rochester Police Department also witnessed the object, according to the witnesses.  PD)) ((NUFORC Note:  Photo forwarded by source of report appears to show no sign of anomalous objects overhead.  Rochester Police Department has no record of multiple police vehicles being dispatched to the area of the alleged sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129167.html",
      "state": "NH",
      "duration": "1 hour+"
    },
    {
      "_id": "64d005f478aba2ec5a3c6cb2",
      "summary": "Large craft, and separate red lights, in the early morning sky.",
      "city": "rochester",
      "shape": "formation",
      "date": "2017-01-06T00:00:00",
      "story": "Large craft, and separate red lights, in the early morning sky. Driving 490 West on the East side of the Genesee River, I first noticed a formation of white lights, as if the object had multiple lights, brighter white lights on the outside with smaller white lights outlining what looked to be a large craft.  I could not see the craft, only the white lights.  The lights were unmoving, unwavering and not blinking. Prior to this, while driving through Fairport, I had seen a moving object, which looked similar, however I dismissed it as an airplane, as it was flying in the direction of the airport. Shortly after seeing this larger object, I noticed several, I was driving so couldn't really stare at them, but there were a minimum of 10 bright red lights in the sky to the south of the highway, sporadically hanging in the sky.  They were intensely bright and some were moving around.  Visually they looked like a column of red lights there were simply not in a row, and they ranged from close to the rooftops to well into the sky.",
      "link": "http://www.nuforc.org/webreports/132/S132036.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c741d",
      "summary": "My UFO Sighting from the 60s.",
      "city": "rochester",
      "shape": "oval",
      "date": "2017-05-15T00:00:00",
      "story": "My UFO Sighting from the 60s. I never reported this, but It happened in the 60's. My friends and I were camping out in my back yard. I looked up into the night, because there was a full moon out, and it was bright, I could also see the clouds, because the moon was so bright. Next: I saw something that looked like a tic-tac come out from behind the cloud and then retract back into the cloud. next the object came back out, but this time there were 2 of these objects, they both retracted back into the cloud and came back out and now there were 3 objects. The first craft (far left) rose to the top of the other 2 forming a triangle. Then shifted down to where the 3rd craft was on the far right. and the other at the other end (far left) rose to the top. then all 3 started rotating in this manner. They moved very fast, then like a rubber-band snapping I saw a flash that looked like a check mark and they were gone. ((NUFORC Note:  For some strange reason, witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134134.html",
      "state": "NY",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7597",
      "summary": "Two bright lights heading south from Lake Ontario, eventually fading out",
      "city": "rochester",
      "shape": "light",
      "date": "2017-04-28T00:00:00",
      "story": "Two bright lights heading south from Lake Ontario, eventually fading out Two lights heading south from Lake Ontario (we were on the west side of Culver in Sea Breeze).  Lights were about the size of ISS and faded to nothing as they made there way across the sky.  They stayed equidistant from each other the whole time. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133839.html",
      "state": "NY",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c77cb",
      "summary": "Two very bright vertically oriented lights observed during the day, while traveling southbound on Rt 125.",
      "city": "rochester",
      "shape": "light",
      "date": "2017-11-03T00:00:00",
      "story": "Two very bright vertically oriented lights observed during the day, while traveling southbound on Rt 125. While traveling southbound on Rt 125 in Rochester, I observed 2 very bright white lights oriented vertically in the sky (one above the other).  The light on top was stationary.  The lower light was observed at about 1/2 the distance from the top light to the ground, moving right to left.   They appeared to be positioned in the direction of Barrington or Madbury, but distance was difficult to ascertain.  No contrails or aircraft outlines were observed.   After viewing the lights for about 15-20 seconds, both vanished simultaneously and did not reappear.",
      "link": "http://www.nuforc.org/webreports/136/S136859.html",
      "state": "NH",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c78b5",
      "summary": "Saw a bright light possibly 2 close lights at what appears to be high altitude. Object continued to the S getting dimmer.",
      "city": "rochester",
      "shape": "cigar",
      "date": "2017-12-04T00:00:00",
      "story": "Saw a bright light, possibly 2 close lights, at what appears to be high altitude.  Object continued to the south getting dimmer, and then disappears, and a tiny what appeared to be a small smoke trail.   Object then reappears as a light above treeline stayed stationary for a few minutes then proceeded in a Westerly direction as just a small cigar shaped object...  I don't think a plane would do this.  Could it be a drone???",
      "link": "http://www.nuforc.org/webreports/137/S137443.html",
      "state": "NH",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c78cb",
      "summary": "2 lights flashing thru color spectrum.  ((anonymous report))",
      "city": "rochester",
      "shape": "light",
      "date": "2017-12-14T00:00:00",
      "story": "2 lights flashing thru color spectrum 2 lights in half-diamond shape blinking through color spectrum, traveling south before slowly changing direction to SW, too high for plane or drone, possibly suborbital distance. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137751.html",
      "state": "MN",
      "duration": "150 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7937",
      "summary": "Small colorful dot with circles around it, moving all around. Shortly after a bright green light. ((anonymous report))",
      "city": "rochester",
      "shape": "oval",
      "date": "2017-12-04T00:00:00",
      "story": "Small colorful dot with circles around it, moving all around.  Shortly after a bright green light zoomed across the sky. I was siting in my parents bed, when I couldn’t sleep one night, I was looking out the window when a dot with many circles around it it was very small and colorful but it was moving around all over in triangles and lines and squares it was weird I watched it go for a while then a few minutes later a single bright green light went across the sky real fast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137496.html",
      "state": "MN",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a3a",
      "summary": "Black disk UFO cloaks then enters hyperspace.",
      "city": "rochester",
      "shape": "disk",
      "date": "2017-12-04T00:00:00",
      "story": "Black disk UFO cloaks then enters hyperspace. I went on my back porch and looked at the horizon and saw a black disk object flying in a straight line from left to right and then disappear.  After it dissapeared, I saw a burst of light in the daylight sky as if the craft went into hyperspace.   There had also been birds flying in the sky when I saw the craft.",
      "link": "http://www.nuforc.org/webreports/137/S137544.html",
      "state": "MN",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ace",
      "summary": "Radically moving UFO.",
      "city": "rochester",
      "shape": "cigar",
      "date": "2017-11-22T00:00:00",
      "story": "Radically moving UFO. It was a bright neon blue light that was zigzagging back and forth. when a plane flew near it, it started flashing with red. after about 20 minutes of watching it we looked away and five minutes later when we went to go and find it again, but it was gone.",
      "link": "http://www.nuforc.org/webreports/137/S137367.html",
      "state": "NH",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b6e",
      "summary": "Box-shaped UFO Low to Ground with 2 Red & 2 Blue Lights on Bottom Crosses 490 in Rochester",
      "city": "rochester",
      "shape": "rectangle",
      "date": "2017-10-05T00:00:00",
      "story": "Box-shaped UFO Low to Ground with 2 Red & 2 Blue Lights on Bottom Crosses 490 in Rochester On aforementioned date and time, my friend and I were on our way to a bar in downtown Rochester.  We both were completely sober at this time.  We were traveling in a westerly direction through the Park Avenue area of Rochester on the 490 North freeway.  It was already completely dark outside, except for some ambient streetlight/city light.  The UFO was traveling in a Northeasterly direction at approximately 25mph and we were traveling about 65mph. I first noticed the UFO as we were driving along listening to music.  At first I said nothing as I noticed the object had no flashing lights, which I've never seen before on any type of flying craft.  As soon as I realized this, I said to my friend half jokingly \"look a UFO\".  I pointed it out to him and then turned down the music.  Just as I did this the bottom lights came more into view, and I could clearly see 4 large in diameter lights mounted on the bottom of the UFO making a perfect square.  The 2 lights leading the way were red, and the 2 lights following were blue.  They were very close to the color of red and blue police lights, however they were large solid lights (not beams or spotlights) that did not blink. The UFO flew just about directly over us as I continued to stare and make as many detailed mental notes as possible while my friend looked as often as he could (he was driving).  My friend immediately agreed that it was very strange and that he had never seen anything like it. We tried to go over what it could possibly be, but since there were no blinking lights (which are required by law on all aircraft) and since the speed was so slow, the only possibility I thought would be a police helicopter, except several things didn't fit.  We heard no helicopter sounds at all, and this UFO only appeared to be about 200-300ft above the ground.  I also researched heavily into what this might be, and nothing matched, including the police helicopters used in the area. I  later asked my friend to describe exactly what he saw so that I could get an independent description of the object.  He immediately said it was \"box-shaped\" with 2 red lights and 2 blue lights on the bottom.  I personally couldn't make out anything other than the lights and the square shape surrounding the lights, however I was only focused on the lights, whereas he saw a box shaped object with lights underneath.  Some other information:  the UFO appeared to be about 30ft x 30ft squared on the bottom.  The 4 lights took up all of the space on the bottom of the UFO, which would mean each light had a diameter of about 15ft x 15ft.",
      "link": "http://www.nuforc.org/webreports/136/S136509.html",
      "state": "NY",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b46",
      "summary": "White sphere decending. Hovered in place for 10 min. saw headed north for a second  then disappeared.",
      "city": "rochester",
      "shape": "sphere",
      "date": "2017-10-05T00:00:00",
      "story": "White sphere decending. Hovered in place for 10 min. saw headed north for a second  then disappeared. Saw one white glowing object sphere shaped.  I was at the bottom of newport rd in Irondequoit, New york parked facing north at the irondequoit bay.  To the west of me I noticed a glowing sphere about 500 feet above the tree lines.   I told the other 3 people in my car ans they noticed it as well.  They were all scared I got out of my car by myself and approached the object.  It straded descending lower and lower as I approached it.  It hovered at the same place barley moving for about 10 minutes.   All of a sudden, it headed upwards and north at great speed for about a second then vanished.   Went back to my car and it would not start battery charge was drained had to get my car jumped.",
      "link": "http://www.nuforc.org/webreports/136/S136555.html",
      "state": "NY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7db9",
      "summary": "I saw a bright white tic tac in the sky, silently flying west to east in Rochester, Michigan.",
      "city": "rochester",
      "shape": "egg",
      "date": "2018-06-07T00:00:00",
      "story": "I saw a bright white tic tac in the sky, silently flying west to east in Rochester, Michigan. I was walking my neighbors dog.  It was still light out at 8:10pm eastern time or 20:00, with a blue sky and a few scattered clouds.  I looked up at the sky as I do often and noticed a object very high, flying from west to east. At first I thought it was a plane or even a drone.  The more I looked I noticed there was no noise, no engine sound, no contrail, and no chemtrail.  It was silent. I kept watching and I realized planes and drones are not egg or tic tac shaped.  It was all bright white.  Not lit up white but just white like a tic tac.  No lights at all.  The object flew straight, west to east, no zig zagging, or turns. It suddenly disappeared into a clear sky as if it there one second and gone the next. I'm not even sure what I saw, but I know for sure it wasn't a plane.",
      "link": "http://www.nuforc.org/webreports/141/S141725.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fcf",
      "summary": "Triangle UFO seen above Rochester, NY.",
      "city": "rochester",
      "shape": "triangle",
      "date": "2018-04-13T00:00:00",
      "story": "Triangle UFO seen above Rochester, NY. On February 21st, 2018, at around 8:30pm-ish, my two friends and I witnessed a triangular shaped UFO near St. John Fisher College.  The object was a large black triangle, with a bright light on each end of the object.  The object also had grey lines on the bottom, which were visible as a result to the light.   My friend pointed it out to us and thought it was a drone.  The more we looked at the object, we realized that it was not a drone, it had to be something else.  We were only able to look at the object for about 15 secs because it vanished out of no where.",
      "link": "http://www.nuforc.org/webreports/139/S139407.html",
      "state": "NY",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8018",
      "summary": "It was around 11:15 pm my boyfriend and i were laying in bed my bed faces my window we heard what sounded like a car running outside o",
      "city": "rochester",
      "shape": "triangle",
      "date": "2018-04-13T00:00:00",
      "story": "It was around 11:15 pm, my boyfriend and i were laying in bed my bed faces my window we heard what sounded like a car running outside of the house.  After about 2 minutes i looked to see who's car it was, but i could see a car in sight the sky then started to light up. Not a big bright light but lightened up enough to where i was paying attention what started as a single white flashing light far away in the sky kept fly closer as it got closer i could see 3 lights in the shape of a triangle but kind of rounded a light in the middle with a red flashing light hovering the top middle light  i instantly made my boyfriend come and see what i was seeing and he was shocked i stared out the window and seen the same light reappear  in the same exact spot and come by the same exact way starting as a single light and turning into this flying object i looked closer out the window and could see the light where turning side ways and i looked like it was spiriling  i have never seen anything like this before in my life but i witnessed this same event happen in about 10 minute intervals 4 times the same night and so did my boyfriend it flew by the same exact way and the sky was very bright for being so late at night im not a crazy person",
      "link": "http://www.nuforc.org/webreports/139/S139425.html",
      "state": "NY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c82f7",
      "summary": "Saucer with what looked like a kings crown on top seen in Rochester, NY, west side 95",
      "city": "rochester",
      "shape": "disk",
      "date": "2018-10-12T00:00:00",
      "story": "Saucer with what looked like a kings crown on top seen in Rochester NY west side 95 My sons when they were very little about 3 and 5 years old went to bed around 10:30pm they came down shortly after going to bed looking terrified.  I asked them what was wrong they said they seen something above our neighbors house through their bedroom window on the 2nd floor.  I asked them what it looked like they described a saucer shaped object with what looked like a kings crown sitting on top.  They said it had like a thick tether or rope with what looked like a bunched up couch cushion at the end hanging below it over the neighbor's house. They said they were watching it and all of the sudden it flipped lights on them they said it was so bright it made their faces hot and it scared them so bad they couldn't move they froze.  They then said the parts of it that looked like a crown.  The edges lit red and then it took off. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143453.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c83dc",
      "summary": "In the sky about 200 feet in the air was 2 round lights yellow the size of a mini van and they had beams of light coming down to about",
      "city": "rochester",
      "shape": "disk",
      "date": "2018-10-25T00:00:00",
      "story": "In the sky about 200 feet in the air was 2 round lights yellow the size of a mini van and they had beams of light coming down to about a foot off fround then as I watched they just kept spinning in circles and more and more kept joing so i ran this was on Chestnut st.  In Rochester, NH. ((NUFORC Note:  We attempted to telephone the source of the report, to establish whether it is intended as a serious-minded account, and we were unable to reach the person.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143583.html",
      "state": "NH",
      "duration": "~45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8458",
      "summary": "On 10AU18, I was facing E by the Genesee R..  When I saw an object flying north to south very quickly also going up and do",
      "city": "rochester",
      "shape": "light",
      "date": "2018-09-13T00:00:00",
      "story": "On August 10, 2018.  I was facing east by the Genesee River, when I saw an object flying north to south very quickly also going up and down behind the tree line in the same manner. Stopping on a dime.  Also had solid red green and orange lights and made no sound. It was amazing never seen that before and I have seen cool jets, choppers, and other things flying in the Marine corps.  Thanks.",
      "link": "http://www.nuforc.org/webreports/143/S143063.html",
      "state": "NY",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c86be",
      "summary": "Saw and heard what appeared to be a non-human entity.",
      "city": "rochester",
      "shape": "other",
      "date": "2018-08-17T00:00:00",
      "story": "Saw and heard what appeared to be a non-human entity. Checking email before heading to bed after a fun night of video games.  Did not feel stressed, overly tired, or creeped out at all - just ready to go to sleep.  I heard heavy breathing behind me at my office door - not human.  I assumed that it was my dog.  She is usually locked up in a room during the night, but the room can be easily opened from the outside by pushing on the door, and my cat sometimes lets the dog out.  I turned around, ready to talk to my dog, and saw a non-human face (grey, elongated features, can't remember the eyes).  It was so alarming that I jumped out of my chair and grabbed an object.  When I turned back to the door, it was gone.  I have tried telling myself that it wasn't real, and I have refused to tell anyone for fear of being ostracized.  No noticeable signs of a craft (audible or visual).  Strange and quickly disappearing scratch marks the next morning (scratches were white in a red blotchy area rather than red). ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142680.html",
      "state": "MN",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c877c",
      "summary": "Orb of yellowish light that turned blueish green.   Disappeared and reappeared 3 times in night sky.  ((anonymous report))",
      "city": "rochester",
      "shape": "light",
      "date": "2018-07-13T00:00:00",
      "story": "Orb of yellowish light that turned blueish green.   Disappeared and reappeared 3 times in night sky. In the clear Western sky, I saw what looked like a very bright star or planet, but it was more yellow than white and seemed to flicker.  I watched for a minute or two and it disappeared then reappeared. I went outside and took some pictures and video with my phone.  Zooming in it was definitely not a star or planet.  It changed colors and seemed like a light with a glowing aura that changed colors, yellow to a blueish green and back to yellow.  Each time it appeared it would be in the same vicinity, but not in the exact same place.  It stayed in the same place but appeared to me moving in place if that makes sense. I filmed for 42 seconds and it disappeared on film.  I did not move the phone.  Then it came back for a third and final time and I filmed for over 3 minutes zooming in and out to try to get a better focus.  I stopped filming and then filmed another minute or so and it appeared to be moving and fading in and out until it disappeared again. On the 3 minute video, an anomaly occurred that was only evident after viewing it after the fact.  There is one second that something like a cloud or a vapor passes closely in front of the camera, but the orb never disappears in the far distance.  There were no clouds or mist around me while filming so I have no idea what it was. About 20 minutes after it disappeared completely, large aircraft began circling the area where I saw it and I also have some footage of that, too.  The only thing going on that night near that vicinity was the Indian Reservation was setting off some loud fireworks, but nothing like you see on the 4th of July.  It looked more like lightening.  This orb was off to the right a good distance away and low in the sky, but high enough for me to think it was a star or a planet. Most people are telling me it's a drone, but I haven't seen footage of drones behaving in this manner or that were this large. I am willing to share the footage, but I don't see where to upload it to this report.  Please let me know if you would like to see it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142123.html",
      "state": "WA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c88db",
      "summary": "I was with my friend and we were in my backyard which is a very wooded area and it was pretty dark but we were just going for a walk. A",
      "city": "rochester",
      "shape": "other",
      "date": "2018-06-15T00:00:00",
      "story": "I was with my friend and we were in my backyard which is a very wooded area and it was pretty dark but we were just going for a walk.  And we saw in the sky 3 weird objects that I can't explained an it looked like it was just swaying and swinging itself in the sky.to be honest I thought it was a shooting star until it began sinking to the ground slowly followed by a loud bang and me and my friend ran back home, we were terrified.",
      "link": "http://www.nuforc.org/webreports/141/S141779.html",
      "state": "NY",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c896e",
      "summary": "UFO followed me home and parked on my property!",
      "city": "rochester",
      "shape": "circle",
      "date": "2019-09-19T00:00:00",
      "story": "ufo followed me home and parked on my property! I was driving home from Centraila, Wa ,about 11:30pm.  I got off I-5, and took exit 88 highway 12 west, toward Rochester, WA. I stopped at the 1st light, and saw what I thought, were weird  light reflections in the clouds, they were pale yellow orbs bouncing all over the sky, my husband said they were most likely from a spot light.  As we drove farther west I noticed that the orbs were just to the south of us about a mile or so and were brighter, and were closer together now traveling a little ahead and to the southwest of us, as we entered the town I realized this was one ship, and the lights were much brighter although still above the clouds, we made a left, and then turned back west on our street, I thought the object was still in town. Our road is curvy, and as I made the second curve,I almost wrecked the car!  I caught sight of the craft just to the left of me and a bit ahead. I almost wrecked the car!  we were the only ones on the road and the object was now just above the clouds, and you could see 6 white lights rotating in a pattern and 4 red lights that spun, then the white lights ran to the inside or center of the craft, made a star formation,then reversed direction and made a circle around the center star like light. This thing stayed in the cloud cover, never coming out into the bare sky, so I never saw the whole thing. As we took a left into our driveway and parked, the craft stopped and hovered, literally, 200 feet above us and 100 feet next to us, just above our pasture. the lights slowed down, and as we got of the car, it looked like it was coming down, by the way it made no noise, had no wind there was no engine noise at all! at this point we both decided it was best to get inside. We got the dogs out of the kennel, and took them in the house, they had been raising holy hell, and were franic!  I decided to go out side and see if the craft had left, it was no longer at the front of the property and I did not see it at first. This made me feel better and I walked out to the street and headed west to see if I could see where it went, as I walked up the road I looked to the left and looked out at our pasture, and saw at least, 25 rays of light pointing up to the sky, they were like spotlights and were bouncing all over the place! the craft was now on the ground behind the barn  so I could not see it, but I knew there were no lights out there like that! I took off for the house  and told my husband we needed to leave, he agreed and we got the dogs loaded and took off down to the next cross street, we turned left to go to highway 12 and the craft went right over us heading due west, and then it just disappeared! I am still shaken up, and just a bit afraid they will come back. A car was parked at the corner of the cross street and  moon road and he had a cell phone in his hand so someone got it on camera,  The whole encounter lasted 30 mins,",
      "link": "http://www.nuforc.org/webreports/148/S148823.html",
      "state": "WA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d19",
      "summary": "Hovering over 200 foot tall pine trees with no sound glowing lights diamond shape. ((anonymous report))",
      "city": "rochester",
      "shape": "diamond",
      "date": "2019-01-11T00:00:00",
      "story": "Hovering over 200 foot tall pine trees, with no sound, glowing lights diamond shape and I ran into the house because my mother told me to.  I was seven years old at the time but she was so terrified that we had to lock the door behind us.  I wanted to take my Halloween candy with me but I was told to get in the house now. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144336.html",
      "state": "NH",
      "duration": "3 minuets"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e39",
      "summary": "Large bright light stationery..got larger then brighter..then slowly disappeared whilst not moving at all",
      "city": "rochester",
      "shape": "circle",
      "date": "2019-01-11T00:00:00",
      "story": "Large bright light stationery.. got larger then brighter.. then slowly disappeared, whilst not moving at all",
      "link": "http://www.nuforc.org/webreports/144/S144362.html",
      "state": "NY",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ec2",
      "summary": "Usual bright star in the sky.  ((NUFORC Note:  Possible sighting of Venus??  PD))  ((anonymous report))",
      "city": "rochester",
      "shape": "light",
      "date": "2019-01-04T00:00:00",
      "story": "usual bright star in the sky. Getting up at 5am to go to the gym.  Trying to wake myself up, stepped out my front door to smoke a cigarette. Directly across my front door in the sky was a very bright star like light that was a bright yellow white.  Lower than a star though.  It was in a area of the sky that the planes turn around to land at the Rochester airport.  So my first thought was it was a plane turning around like they do. Again, this unusually bright star was BRIGHT, kinda flickering and in that plane turn around area in the sky right near Lake Ontario. While watching this bright light it slowly faded away and disappeared.  It never moved from its spot in the sky.  At that time I assumed it was a plane turning around but 15 seconds later it slowly faded back to its full brightness.  It did this multiple times not moving from its spot in the sky for about 15 min. I continued to check on it while I was getting ready it eventually disappeared after a hour of this.  I didn't see it leave but was definitely unusual. The sky was clear that morning, no clouds and was still dark. I didn't think to take a picture or thought it was weird at the time because I assume it must be explainable.  When I got up the next morning and went to smoke it wasn't there so definitely wasn't a star.",
      "link": "http://www.nuforc.org/webreports/144/S144289.html",
      "state": "NY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c9286",
      "summary": "Bright light moving erratically in all directions",
      "city": "rochester",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "Bright light moving erratically in all directions. I told myself my eyes were playing games and it wasn’t moving like I thought, so I shut one eye and didn’t move my head and positioned my head so I could barely see it on the edge of the window and it keeps moving in and out of sight.  Bright light would occasionally change color and brightness. Clouds could account for brightness change but I simply can’t explain the odd flying patterns in all directions. Have very grainy cell video. Difficult to make out but odd movement still noticeable. Doubtful someone would be flying a drone around 1:30 am in rural southern MN so high in the air..? Object appeared NW of Rochester, MN.",
      "link": "http://www.nuforc.org/webreports/149/S149919.html",
      "state": "MN",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9671",
      "summary": "saw a bright light shape like a circle on top of a rectangle, flashes and dissapears.",
      "city": "rochester",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "saw a bright light shape like a circle on top of a rectangle, flashes and dissapears. Driving northbound on 52, going to Rochester city limit, we saw a light shaped like a green circle on top of a yellow horizontal rectangle.  Then there was a bright flash and it vanish.",
      "link": "http://www.nuforc.org/webreports/151/S151437.html",
      "state": "MN",
      "duration": "30 secs"
    }
  ]
}